{
  "metadata": {
    "case_name": "Central Bank of India Ltd. v. Cashew Products Corporation Ltd. & Ors.",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "Ramaswami, J."
    ],
    "case_number": "Civil Appeal No. 405 of 1964",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "By resolution Ex. BD dated November 25, 1946, Board of Directors of 1st defendant Company authorised 2nd defendant to obtain financial accommodation from plaintiff-bank to extent of Rs. 15 lakhs under different kinds of loans.",
      "type": "background",
      "date": "1946-11-25",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Company by letter Ex. DE dated November 26, 1946 asked for accommodation: Rs. 1 lakh clean overdraft, Rs. 4 lakhs open loan, Rs. 10 lakhs out agency and key loans.",
      "type": "background",
      "date": "1946-11-26",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On November 26, 1946, all three defendants executed promissory note Ex. B in favour of plaintiff-bank for Rs. 4 lakhs, sent with letter of continuity Ex. A stating pro-note as security for repayment of overdraft up to Rs. 4 lakhs, continuing liability notwithstanding reductions.",
      "type": "material",
      "date": "1946-11-26",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On same day, defendant No. 1 executed deed of hypothecation Ex. G of stocks of goods to secure demand cash credit up to Rs. 4 lakhs, agreeing to accept bank statement as conclusive proof, security continues notwithstanding account fluctuations.",
      "type": "material",
      "date": "1946-11-26",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Plaintiff-bank opened overdraft account in name of defendant No. 1 on basis of documents.",
      "type": "material",
      "date": "1946-11-26",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "On December 21, 1949, three documents Exs. A, B, G renewed in identical terms by Exs. C, D, F.",
      "type": "material",
      "date": "1949-12-21",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "On January 1, 1950, sum of Rs. 3,24,645/12/2 due to plaintiff-bank; demand notice Ex. O sent.",
      "type": "procedural",
      "date": "1950-01-01",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Second notice Ex. L sent by plaintiff-bank on April 26, 1950.",
      "type": "procedural",
      "date": "1950-04-26",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "On September 8, 1950, plaintiff-bank filed suit O.S. No. 114 of 1957 for recovery of Rs. 2,86,292/11/11 from all three defendants.",
      "type": "procedural",
      "date": "1950-09-08",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Defendant No. 1 contested suit claiming loss due to sudden termination of credit facilities, to be set off.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f11",
      "text": "Defendants Nos. 2 and 3 pleaded they executed promissory notes only as sureties for 1st defendant, not co-obligants; bank made adjustments between accounts without consent, allowed overdraws beyond limits, converted secured loans to simple by releasing goods against trust receipts, discharging sureties.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f12",
      "text": "Subordinate Judge of Alleppey decreed in favour of plaintiff, holding defendants 2 and 3 co-obligants, not merely sureties; did not examine discharge pleas.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Defendant No. 3 appealed to Kerala High Court in A.S. No. 561 of 1961; defendants 1 and 2 did not appeal.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Kerala High Court dismissed appeal on July 12, 1962, holding defendant No. 3 co-obligant, not surety.",
      "type": "procedural",
      "date": "1962-07-12",
      "source": "lower_court"
    },
    {
      "id": "f15",
      "text": "On July 16, 1962, defendant No. 3 filed C.M.P. No. 5032/1962 complaining omission to deal with arguments; High Court issued supplementary judgment on July 18, 1962 rejecting further arguments.",
      "type": "procedural",
      "date": "1962-07-18",
      "source": "court"
    },
    {
      "id": "f16",
      "text": "Letters from bank (Exs. AF, AM, CE, CG, AS, V, etc.) addressed/referred to defendant No. 3 as guarantor.",
      "type": "admitted",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the status of the 3rd defendant in regard to the transaction of overdraft account is that of a surety or of a co-obligant.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether defendant No. 3 is discharged of his liability as a surety by reason of the alleged conduct of the plaintiff-bank in violating terms of agreement Ex. G or fraudulent/negligent conduct.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "High Court misconstrued Exs. A and B; integrated transaction by Exs. A, B, G executed same day confers status of surety on 3rd defendant, not co-obligant.",
      "supporting_facts": [
        "f3",
        "f4"
      ],
      "legal_basis": "Documents to be read together as one transaction; Manks v. Whiteley"
    },
    {
      "id": "pa2",
      "text": "Discharged as surety due to bank's adjustments between accounts without consent, allowing overdraws beyond limits, converting secured loans to unsecured by releasing goods.",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": "Sections 126, 141 Contract Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "No contract of suretyship under s.126 Contract Act; jointly and severally liable on promissory notes are co-obligants, not sureties.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": "Vyravan Chettiar v. Official Assignee; Duncan Fox Co. v. North & South Wales Bank; s.132 Contract Act illustration"
    },
    {
      "id": "ra2",
      "text": "Suit based on promissory note, not overdraft; s.92 Evidence Act bars collateral evidence.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": "Venkata Krishnayya v. Karnedan Kothari; s.92 Evidence Act"
    },
    {
      "id": "ra3",
      "text": "Adjustments do not support discharge claim.",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Documents Exs. A, B, G part of same transaction, to be read together; Ex. A states pro-note as security for overdraft of defendant 1; Ex. G hypothecation by defendant 1; bank letters treat 3rd def as guarantor; thus 3rd def is surety, not co-obligant.",
      "addresses_issue": "i1",
      "key_observation": "Status of 3rd defendant is that of surety; High Court finding incorrect."
    },
    {
      "id": "cr2",
      "text": "s.126 Contract Act satisfied as bank party to Ex. A (guarantee) and Ex. G; s.92 Evidence Act inapplicable as relying on contemporaneous written collateral docs, not oral.",
      "addresses_issue": "i1",
      "key_observation": "Suit based on overdraft balance, not pro-note alone."
    },
    {
      "id": "cr3",
      "text": "Issue of discharge due to bank conduct mixed question of fact/law not properly dealt with by High Court despite supplemental judgment; requires remand.",
      "addresses_issue": "i2",
      "key_observation": "High Court failed to consider points urged."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "3rd defendant has status of surety, not co-obligant, in overdraft transaction.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Case remanded to High Court to decide if 3rd defendant discharged as surety due to bank conduct.",
      "resolves_issue": "i2",
      "in_favor_of": "partial"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Manks v. Whiteley",
      "citation": "1912 1 Ch. 735",
      "treatment": "followed",
      "relevance": "Several contemporaneous deeds part of one transaction read as one; equities from whole transaction."
    },
    {
      "case_name": "Duncan Fox Co. v. North & South Wales Bank",
      "citation": "1881 6 A.C. 1",
      "treatment": "referred",
      "relevance": "Distinguishes classes of suretyship; even in some cases without strict suretyship, surety gets benefit of securities."
    },
    {
      "case_name": "Vyravan Chettiar v. Official Assignee of Madras",
      "citation": "A.I.R. 1933 Mad. 39",
      "treatment": "distinguished",
      "relevance": "Jointly severally liable on pronotes not sureties under s.126; no s.141 rights."
    },
    {
      "case_name": "Venkata Krishnayya v. Karnedan Kothari",
      "citation": "A.I.R. 1935 Mad. 643",
      "treatment": "distinguished",
      "relevance": "s.92 Evidence Act bars oral collateral; but here written contemporaneous docs."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Contract Act",
      "sections": [
        "Section 126",
        "Section 132",
        "Section 141"
      ],
      "relevance": "Defines contract of guarantee requiring creditor as party; creditor not bound by co-debtor contract; surety discharged by creditor impairing remedy."
    },
    {
      "name": "Indian Evidence Act",
      "sections": [
        "Section 92"
      ],
      "relevance": "Bars evidence of oral agreement varying terms; inapplicable to contemporaneous written collateral docs."
    }
  ],
  "outcome": {
    "disposition": "remanded",
    "summary": "Appeal allowed; High Court judgment and decree of July 18, 1962 set aside; case remanded to Kerala High Court for rehearing and redetermination on whether 3rd defendant discharged as surety, in light of Supreme Court observations that 3rd defendant is surety.",
    "relief_granted": "Remand to High Court",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"the promissory note Ex. B was given to the plaintiff-bank as security for the repayment of any overdraft to the extent of Rs. 4,00,000... the said Pro-Note is to be a security to you for the repayment of the ultimate balance\"",
      "speaker": "court",
      "significance": "From Ex. A, establishing pro-note as continuing security for principal debtor's overdraft."
    },
    {
      "text": "\"if the transaction is contained in more than one document between the same parties they must be read and interpreted together and they have the same legal effect... as if they are one document.\"",
      "speaker": "court",
      "significance": "Principle for construing integrated documents to determine surety status."
    },
    {
      "text": "\"Our concluded opinion, therefore, is that the status of the 3rd defendant with regard to the overdraft account was that of a surety and not co-obligant\"",
      "speaker": "court",
      "significance": "Core holding reversing High Court."
    }
  ],
  "_case_id": "1965_272",
  "_label": 1,
  "_text_length": 26163,
  "_extracted_at": "2026-02-10T19:27:43.408455"
}