{
  "metadata": {
    "case_name": "Commissioner of Income-tax, U.P. v. Lala Manmohan Das",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "Shah, J."
    ],
    "case_number": "Civil Appeal No. 512 of 1964",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Under an agreement dated January 2, 1931, Lab Manmohan Das (assessee) was appointed Treasurer of the Allahabad Bank Ltd. in respect of certain Branches, Sub-Agencies and Pay Offices.",
      "type": "background",
      "date": "1931-01-02",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The assessee was assessed to income-tax as representing his Hindu undivided family, and the income received by the assessee under the terms of the agreement with the Allahabad Bank was treated as income of the Hindu undivided family.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "In the previous year corresponding to the assessment year 1950-51 the assessee in performing his duties as a Treasurer suffered a net loss of Rs. 38,027.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "For the assessment year 1951-52, the profit and loss account of the assessee showed Rs. 73,815 as receipts, against which were debited outgoings amounting to Rs. 39,370 which included Rs. 20,000 being the loss suffered by the assessee as Treasurer of the Patna Branch of the Allahabad Bank arising from misappropriation by an Assistant Cashier.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The Income-tax Officer refused to allow the loss suffered in the previous year to be set off against the net profit of Rs. 34,445 and brought that amount of profit to tax as remuneration received by the assessee as Treasurer of the Allahabad Bank.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The order of the Income-tax Officer was confirmed in appeal by the Appellate Assistant Commissioner.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "The Income-tax Appellate Tribunal held that the remuneration received by the assessee as Treasurer of the Allahabad Bank was income arising from pursuit of a profession or vocation within the meaning of s. 10 of the Act and the loss suffered during the preceding year was liable to be set off against the assessee's income from that source in the year under consideration.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "At the instance of the Commissioner of Income-tax, U.P., the following questions were referred to the High Court of Allahabad under s. 66(1) of the Income-tax Act, 1922.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "The High Court held that the remuneration received by the assessee from the Allahabad Bank was income liable to be taxed under s. 10 of the Income-tax Act, and that the assessee could claim to set off the loss computed in the assessment year 1950-51 against the profit in the subsequent year.",
      "type": "procedural",
      "date": "1960-12-23",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "With certificate granted by the High Court, this appeal has been preferred by the Commissioner of Income-tax.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "In making his order of assessment for the year 1950-51 the Income-tax Officer declared that the loss computed in that year could not be carried forward to the next year under s. 24(2) of the Income-tax Act, as it was not a business loss.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether on a true interpretation of the deed of agreement dated 2nd January, 1931, appointing the assessee as Treasurer of the Allahabad Bank Limited, income earned by the assessee from his activities as such Treasurer fell to be computed under Section 10 of the Act or Section 7 or Section 12 of the Income-tax Act?",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "If the answer to this question is that such income is liable to be computed under Section 10 of the Act, Whether the assessee could claim a set off of the loss suffered by him in the preceding year 1950-51 against his profits in the year under consideration, i.e., 1951-52 having failed to prefer an appeal against the refusal by the Income-tax Officer making the assessment for the year 1950-51 to allow the assessee to carry forward the loss under Section 24(2) of the Act?",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The remuneration received by the assessee was salary as a servant of the Bank taxable under s.7, citing Shivnandan Sharma v. Punjab National Bank Ltd. and Piyare Lal Adishawar Lal v. Commissioner of Income-tax, Delhi, where similar contracts held Treasurers to be servants.",
      "supporting_facts": [
        "f1"
      ],
      "legal_basis": "Sections 7, 10; Shivnandan Sharma v. Punjab National Bank Ltd.; Piyare Lal Adishawar Lal v. CIT"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The remuneration was from profession or vocation under s.10, allowing set-off of prior year loss.",
      "supporting_facts": [
        "f3",
        "f4",
        "f7"
      ],
      "legal_basis": "Section 10, 24(2)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The second question presents little difficulty: The Income-tax Officer in the subsequent year determines if prior loss can be set off under s.24(2); prior ITO's decision not binding on assessee.",
      "addresses_issue": "i2",
      "key_observation": "Whether the loss of the previous year may be set off against the profits of that year is for the ITO of the subsequent year."
    },
    {
      "id": "cr2",
      "text": "Interpretation of agreement: Assessee not servant; holds office as Treasurer with control over staff, onerous responsibilities, no Bank control over manner of work; contract for service, not of service.",
      "addresses_issue": "i1",
      "key_observation": "Test of control: No right of control by Bank over manner of work."
    },
    {
      "id": "cr3",
      "text": "Distinguishes Shivnandan Sharma (Bank had control, orders, summary dismissal) and Piyare Lal (Bank control, summary termination); here no such control or summary termination.",
      "addresses_issue": "i1",
      "key_observation": "Terms not identical; no Bank control or supervision."
    },
    {
      "id": "cr4",
      "text": "Not profession or business, but vocation under s.10; loss set-off allowed under s.24(2).",
      "addresses_issue": "i1",
      "key_observation": "Occupation as Treasurer is a vocation."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Remuneration not salary under s.7; computed under s.10 as vocation.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Loss from prior year set-off allowed under s.24(2) against subsequent year profits from same vocation.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Dharangadhara Chemical Works Ltd. v. State of Saurashtra",
      "citation": "1957 S.C.R. 152",
      "treatment": "followed",
      "relevance": "Principles for determining employer-employee relationship: test of control over manner of work; contract for service vs. contract of service."
    },
    {
      "case_name": "Shivnandan Sharma v. Punjab National Bank Ltd.",
      "citation": "1955 S.C.R. 1427",
      "treatment": "distinguished",
      "relevance": "Treasurer held servant due to Bank control, orders, summary dismissal; terms not similar here."
    },
    {
      "case_name": "Piyare Lal Adishawar Lal v. Commissioner of Income-tax, Delhi",
      "citation": "1960 3 S.C.R. 669",
      "treatment": "distinguished",
      "relevance": "Treasurer held servant due to Bank control and summary termination; no such provisions here."
    }
  ],
  "statutes_cited": [
    {
      "name": "Income-tax Act, 1922",
      "sections": [
        "Section 7",
        "Section 10",
        "Section 12",
        "Section 24(2)",
        "Section 24(3)",
        "Section 66(1)"
      ],
      "relevance": "Computation of income as salary (s.7), profession/vocation (s.10), or other sources (s.12); carry forward and set-off of losses from business/profession/vocation (s.24(2)); reference to High Court (s.66(1))."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court upheld the High Court's view that the assessee's remuneration as Treasurer was taxable under Section 10 as income from vocation, not salary under Section 7, and allowed set-off of the loss from 1950-51 against 1951-52 profits under Section 24(2). Appeal by Commissioner dismissed.",
    "relief_granted": "Set-off of prior year loss allowed",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The test which is uniformly applied in order to determine the relationship is the existence of a right of control in respect of the manner in which the work is to be done.",
      "speaker": "court",
      "significance": "Key test for servant vs independent contractor from Dharangadhara."
    },
    {
      "text": "The remuneration must therefore be computed under s. 10 of the Income-tax Act and loss of profit suffered in that vocation in any year may be carried forward to the next year and be set off against the profit of the succeeding year.",
      "speaker": "court",
      "significance": "Final holding on classification and set-off."
    }
  ],
  "_case_id": "1965_80",
  "_label": 0,
  "_text_length": 29049,
  "_extracted_at": "2026-02-10T19:25:35.841713"
}