{
  "metadata": {
    "case_name": "State of Bombay (now Maharashtra) v. Narul Latif Khan",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "Gajendragadkar, C.J."
    ],
    "case_number": "Civil Appeal No. 1040/63",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Respondent appointed as Extra Assistant Commissioner in 1926 and held various offices in State service of Madhya Pradesh Government.",
      "type": "background",
      "date": "1926",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "In 1950, respondent holding post of Treasury Officer at Nagpur.",
      "type": "background",
      "date": "1950",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Privilege leave for over a year due; applied for four months privilege leave; request rejected on June 12, 1950; informed no further leave applications entertained.",
      "type": "material",
      "date": "1950-06-12",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On July 7, 1950, proceeded on casual leave for two days; renewed application for four months leave on medical grounds on July 8, 1950, with certificate from Dr. Dange.",
      "type": "material",
      "date": "1950-07-07",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Government constituted Medical Board; respondent appeared on July 22, 1950; Board could not decide, recommended admission to Mayo Hospital for observation.",
      "type": "material",
      "date": "1950-07-22",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Government asked respondent to admit to Mayo Hospital for examination on August 8, 1950; respondent refused, pressed to go to Calcutta.",
      "type": "material",
      "date": "1950-08-08",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "On July 26, 1950, received telegram about dangerously ill daughter in Raipur; applied for ten days leave; granted on July 31, 1950.",
      "type": "material",
      "date": "1950-07-26",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "From Raipur, renewed leave application with certificates from Dr. Bhalerao and Dr. Kashyap; correspondence ensued; Government insisted on Medical Board appearance; respondent refused due to illness.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "On September 9, 1950, Government ordered resume duties within three days or face suspension and enquiry.",
      "type": "procedural",
      "date": "1950-09-09",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Respondent replied on October 4, 1950, did not resume duties.",
      "type": "material",
      "date": "1950-10-04",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Government suspended respondent and appointed Mr. S.N. Mehta for enquiry on November 29, 1950; notice to appear December 7, 1950; respondent did not appear, cited illness.",
      "type": "procedural",
      "date": "1950-11-29",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Charge-sheet served January 15, 1951: (1) disobeyed order to admit to Mayo Hospital; (2) failed to report for duty; (3) persistently disobeyed orders, unfit for service.",
      "type": "procedural",
      "date": "1951-01-15",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Respondent denied charges in written statement; pleaded illness prevented travel; requested lawyer and to examine doctors.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f14",
      "text": "Met enquiry officer on September 21, 1951 at Raipur; discussed case; agreed no need for counsel as no oral evidence from Government; undertook to file detailed statement and appear personally.",
      "type": "procedural",
      "date": "1951-09-21",
      "source": "court"
    },
    {
      "id": "f15",
      "text": "Filed detailed written statement; notice for oral statement November 20, 1951; did not appear; officer examined documents, reported November 24, 1951, charges proved.",
      "type": "procedural",
      "date": "1951-11-24",
      "source": "court"
    },
    {
      "id": "f16",
      "text": "Respondent repeatedly requested oral enquiry and to examine doctors (letters January 20, March 2, April 23, 1951).",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f17",
      "text": "Final order of compulsory retirement June 6, 1952 under Art. 353 CSR, with compassionate allowance equal to invalid pension.",
      "type": "material",
      "date": "1952-06-06",
      "source": "court"
    },
    {
      "id": "f18",
      "text": "Respondent filed suit challenging order as ultra vires Art. 311; claimed declaration, restoration, Rs. 62,237.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f19",
      "text": "Trial court dismissed suit, found Art. 311 complied with.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f20",
      "text": "High Court allowed appeal, held Art. 311 violated due to no oral enquiry, defective second notice; decreed Rs. 37,237.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the appellant gave a reasonable opportunity to the respondent to defend himself before passing the final order of compulsory retirement on June 6, 1952 under Article 353 of the Civil Service Regulations, in compliance with Article 311(2) of the Constitution.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether Rule 55 of the Civil Services (Classification, Control and Appeal) Rules made it obligatory for the enquiry officer to hold an oral enquiry if desired by the charged officer.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Respondent had been given a reasonable opportunity to defend himself; impugned order valid and legal.",
      "supporting_facts": [
        "f11",
        "f14",
        "f15"
      ],
      "legal_basis": "Article 311(2)"
    },
    {
      "id": "pa2",
      "text": "Departmental enquiry based on documents only; no obligation to examine witnesses; respondent agreed no oral evidence needed as per Government side.",
      "supporting_facts": [
        "f14"
      ],
      "legal_basis": "Rule 55 of Civil Services Rules"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Impugned order invalid as violated Art. 311; no reasonable opportunity given; no oral enquiry held; no opportunity to lead oral evidence or examine doctors.",
      "supporting_facts": [
        "f13",
        "f16"
      ],
      "legal_basis": "Article 311(2); Rule 55"
    },
    {
      "id": "ra2",
      "text": "Departmental enquiry suffered from serious infirmity; second notice defective; final order did not consider explanation.",
      "supporting_facts": [
        "f12",
        "f17"
      ],
      "legal_basis": "Article 311(2)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Enquiry officer did not hold oral enquiry despite respondent's repeated requests to examine doctors; respondent did not waive demand for oral enquiry.",
      "addresses_issue": "i1",
      "key_observation": "Respondent wanted to lead medical evidence to show disobedience not deliberate due to illness."
    },
    {
      "id": "cr2",
      "text": "Under Rule 55, charged officer required to state if desires to be heard in person; if so desires or authority directs, oral enquiry shall be held; this is mandatory based on natural justice.",
      "addresses_issue": "i2",
      "key_observation": "Enquiry officer bound to fix date for oral evidence once desired; failure introduces fatal infirmity, violates reasonable opportunity under Art. 311(2)."
    },
    {
      "id": "cr3",
      "text": "Even if Government relies only on documents, charged officer's desire for oral enquiry to lead evidence cannot be denied without reasons.",
      "addresses_issue": "i1",
      "key_observation": "Medical evidence relevant to charges of deliberate disobedience."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Failure to hold oral enquiry despite request violates Rule 55 and Art. 311(2); impugned order invalid.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Oral enquiry mandatory if charged officer desires to be heard in person or lead evidence.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Article 311(2)"
      ],
      "relevance": "Requires reasonable opportunity of showing cause against proposed action before dismissal, removal, reduction in rank, or compulsory retirement."
    },
    {
      "name": "Civil Service Regulations",
      "sections": [
        "Article 353"
      ],
      "relevance": "Governs compulsory retirement; order passed in relaxation allowing compassionate allowance."
    },
    {
      "name": "Civil Services (Classification, Control and Appeal) Rules",
      "sections": [
        "Rule 55"
      ],
      "relevance": "Mandates informing of charges, written statement, and oral enquiry if desired by charged officer or directed; allows control but not denial of oral enquiry."
    },
    {
      "name": "Public Servants (Inquiries) Act, 1850",
      "sections": [],
      "relevance": "Provisions without prejudice to; mentioned in Rule 55."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court upheld High Court's decision that the compulsory retirement order was invalid for violating Art. 311(2) due to failure to provide reasonable opportunity via oral enquiry under Rule 55; sustained decree for Rs. 37,237.",
    "relief_granted": "Money decree for Rs. 37,237 confirmed in favour of respondent.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "the requirement that an oral enquiry shall be held if the authority concerned so directs or if the charge-sheeted officer so desires is mandatory. Indeed this requirement is plainly based upon considerations of natural justice and fairplay.",
      "speaker": "court",
      "significance": "Core holding on interpretation of Rule 55 and Art. 311(2)."
    },
    {
      "text": "the fact still remains that he wanted to examine his doctors, and though he intimated to Mr. Mehta that he desired to examine his doctors, Mr. Mehta failed to give him an opportunity to do so. That, in our opinion, introduces a fatal infirmity in the whole enquiry.",
      "speaker": "court",
      "significance": "Explains violation of reasonable opportunity."
    }
  ],
  "_case_id": "1965_318",
  "_label": 0,
  "_text_length": 25679,
  "_extracted_at": "2026-02-10T19:28:08.364687"
}