{
  "metadata": {
    "case_name": "Appellant v. State",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "Sarkar, J."
    ],
    "case_number": "Criminal Appeal No. 40 of 1964",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant convicted by learned magistrate under s.18(a)(ii) read with s.27 of the Drugs Act, 1940 for having manufactured for sale and exhibited for sale a drug known as OKSAL which did not contain the ingredients in the proportion mentioned in the label pasted on the container of the drug.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Magistrate sentenced appellant to pay a fine of Rs. 125 and in default of payment of the fine, to rigorous imprisonment for one month.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f3",
      "text": "On appeal by the appellant to the Sessions Judge, the conviction was set aside and the appellant was acquitted.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f4",
      "text": "On appeal by the State to the High Court of Madras in Criminal Appeal No. 22 of 1961, the judgment of the Sessions Judge was set aside and the conviction and sentence passed by the magistrate were restored, dated April 24, 1963.",
      "type": "procedural",
      "date": "1963-04-24",
      "source": "high_court"
    },
    {
      "id": "f5",
      "text": "Prosecution produced certificate by Government Analyst showing the drug was misbranded within s.18(a)(ii) as label bore false statement at variance with components; label stated Benzoic acid, Salicylic acid, Zinc Oxide and Boric acid in specified proportions, but deficient by Benzoic Acid 15.5%, Salicylic acid 25%, Zinc Oxide 25%, Boric acid 46.3%.",
      "type": "material",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f6",
      "text": "Appellant produced no evidence to the contrary as required under s.25(3) of the Act.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Drugs Inspector obtained samples from appellant's shop and forwarded part to Government Analyst with letter stating sent for test or analysis.",
      "type": "background",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f8",
      "text": "Analyst's report did not state protocols of any test, only result of analysis showing quantities found.",
      "type": "disputed",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "No dispute as to components constituting the drug, only dispute as to quantities in which they were contained.",
      "type": "admitted",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the Government Analyst's report was admissible in evidence to prove misbranding, as it did not state protocols of tests applied and was thus not in the prescribed form under Rule 46 and Form 13.",
      "framed_by": "appellant"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The report was not in the prescribed form under Rule 46 and Form 13 as it did not state protocols of tests applied under Head 7, hence not admissible in evidence.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": "s.25(3), Rule 46, Form 13 of Drugs Act, 1940"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The report was admissible; Sessions Judge erred in accepting appellant's contention, as rejected by magistrate and High Court.",
      "supporting_facts": [
        "f5",
        "f6"
      ],
      "legal_basis": "s.25(3), Rule 46, Form 13 of Drugs Act, 1940"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Rule 46 requires Government Analyst to supply report in Form 13 with results of test or analysis with protocols of tests applied; rule and form contemplate analysis and test as two different things.",
      "addresses_issue": "i1",
      "key_observation": "Protocols required only for tests, not for analysis; here only analysis done to determine quantities, no test carried out or needed."
    },
    {
      "id": "cr2",
      "text": "Report gave only result of analysis of quantities, which was in prescribed form; irrelevant if Analyst should have done test but did not.",
      "addresses_issue": "i1",
      "key_observation": "Report conclusive under s.25(3) unless contrary evidence adduced."
    },
    {
      "id": "cr3",
      "text": "Inspector's letter sent sample for test or analysis, but Analyst did only analysis.",
      "addresses_issue": "i1",
      "key_observation": "Does not affect admissibility of analysis report."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The Analyst's report is in the prescribed form and fully admissible in evidence under s.25(3) as it provided result of analysis without need for test protocols.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Rai Kishan v. The State of Uttar Pradesh",
      "citation": null,
      "treatment": "distinguished",
      "relevance": "Observation that report without protocols of test not in prescribed form; distinguished as here no test done, only analysis."
    }
  ],
  "statutes_cited": [
    {
      "name": "Drugs Act, 1940",
      "sections": [
        "s.18(a)(ii)",
        "s.25(3)",
        "s.27",
        "Rule 46",
        "Form 13"
      ],
      "relevance": "Defines misbranding, admissibility and conclusiveness of Analyst report if in prescribed form; court held report complied."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal by special leave against the Madras High Court order restoring the magistrate's conviction and sentence is dismissed, as the Analyst's report was held admissible and conclusive proof of misbranding.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "Obviously, the rule and the form contemplate analysis and test as two different things, for otherwise both words would not have been mentioned, nor the word 'or' been put between them.",
      "speaker": "court",
      "significance": "Core reasoning distinguishing test from analysis, upholding report's form."
    },
    {
      "text": "That being so, in our view, the report is in the prescribed form and is fully admissible in evidence.",
      "speaker": "court",
      "significance": "Direct holding on admissibility resolving the appeal."
    }
  ],
  "_case_id": "1965_266",
  "_label": 0,
  "_text_length": 5480,
  "_extracted_at": "2026-02-10T19:27:39.582831"
}