{
  "metadata": {
    "case_name": "Commissioner of Income-tax v. Assessee Firm (Unnamed)",
    "case_year": null,
    "court": "Supreme Court of India",
    "judges": [
      "Shah, J."
    ],
    "case_number": null,
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The assessee is a firm carrying on business in real estates at Kualakangsar in the Federated States of Malaya.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Some of the properties belonging to the assessee and which constituted its stock-in-trade suffered damage during the second world war.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On August 14, 1947, the Government of India notified a scheme to give relief to Indian nationals doing business in the Federated States of Malaya who had sustained loss when the territory was under Japanese occupation.",
      "type": "background",
      "date": "1947-08-14",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "An assessee who opted for the scheme was entitled to have his losses incurred or suffered during five years relevant to the assessment years 1942-43 to 1946-47 to be aggregated and to set off the losses against his profits for the two years relevant to the assessment years 1942-43 and 1941-42, and to claim refund of any excess tax for those two years after adjustment.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Under the scheme, losses suffered by the assessee in Malaya during the war period were allowed to be set off against the assessment year 1942-43 and 1941-42 and the assessee obtained the benefit of Rs. 65,197 and Rs. 1,29,028 in the two years in reduction of tax liability.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The Government of Malaya set up war damage commission to compensate persons whose properties had sustained damage due to war conditions.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Under the scheme devised by the Government of Malaya the assessee received compensation amounting to Pound 13,889 and Pound 85,479 in the previous years relevant to the assessment years 1954-55 and 1956-57.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "The Income-tax Officer, Tiruchirappalli, in proceedings for assessment years 1954-55 and 1956-57 brought to tax the amounts received by the assessee as war damages from the Government of Malaya.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "The order of the Income-tax Officer was confirmed by the Appellate Assistant Commissioner.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "The Income-tax Appellate Tribunal confirmed the order of the Appellate Assistant Commissioner, subject to a slight modification, which is not material for the purpose of this appeal.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Thereafter, at the instance of the assessee, the Tribunal referred the questions to the High Court for their opinion.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the war damage receipts of Pound 13,889 and Pound 85,479 constitute income of the assessee for assessment in the years 1954-55 and 1956-57 respectively?",
      "framed_by": "tribunal"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Before the Income-tax Officer, it was urged that the compensation received from the Government of Malaya was a capital receipt of a casual and non-recurring nature, and on that account not liable to be brought to tax.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "section 4(3)(vii) of the Income-tax Act"
    },
    {
      "id": "pa2",
      "text": "Under the scheme framed by the Central Board of Revenue, full compensation for loss suffered by the assessee was not paid, and therefore from the amount of compensation received from the Government of Malaya under the War Damage Compensation Scheme, in ascertaining the taxable income the book value of the assets should be deducted, and only the balance should be brought to tax.",
      "supporting_facts": [
        "f5",
        "f7"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Since under the scheme framed by the Central Board of Revenue, only a fraction of the value of the property lost was allowed as compensation to the assessee and the current book value of the properties was the market value less the compensation received from the Central Government, only the excess over that book value received from the Government of Malaya was taxable.",
      "supporting_facts": [
        "f5",
        "f7"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Payments received by the assessee to compensate for the loss to those properties were subject to tax on the income included therein.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "The receipt was revenue in that it represented recovery of a revenue loss.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The contention that only the excess over the book value was liable to be taxed was not raised before the revenue authorities and the Tribunal; the only contention raised was that the receipts were not taxable because they fell within section 4(3)(vii) of the Income-tax Act as capital receipt.",
      "addresses_issue": "i1",
      "key_observation": "The first question referred to the High Court was also on the footing that the entire amount claimed was capital receipt."
    },
    {
      "id": "cr2",
      "text": "Even if that contention was open to the assessee, when the assessee put forward the claim for compensation under the scheme framed by the Central Board of Revenue that its entire property had been lost through enemy action and it obtained relief under the special scheme on that basis, the value of the assets must after receipt of compensation be taken to be nil.",
      "addresses_issue": "i1",
      "key_observation": "The assessee by not writing off the value in his books of account and after accepting the benefits of the special scheme could not invest those assets for the purpose of assessment to tax with any book value which was liable to be taken into account."
    },
    {
      "id": "cr3",
      "text": "Compensation received in replacement of those assets by the assessee from the war damage commission must therefore be treated in its entirety as profit liable to tax.",
      "addresses_issue": "i1",
      "key_observation": "Entire war damage receipts constitute income."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The war damage receipts constitute income of the assessee for assessment in the years 1954-55 and 1956-57 respectively, in their entirety.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "V. S. S. V. Meenakshi Achi v. Commissioner of Income-tax",
      "citation": "Civil Appeals Nos. 157-158 of 1965",
      "treatment": "followed",
      "relevance": "Governs the answer to the second question on replantation dividend receipts"
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act, 1922",
      "sections": [
        "section 66(1)",
        "section 4(3)(vii)"
      ],
      "relevance": "Reference under section 66(1); exemption claimed under section 4(3)(vii) for capital receipts"
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeals fail and are dismissed. The war damage receipts received by the assessee from the Government of Malaya are held to constitute income taxable in full for the assessment years 1954-55 and 1956-57.",
    "relief_granted": null,
    "costs": "with costs"
  },
  "key_quotes": [
    {
      "text": "\"Compensation received in replacement of those assets by the assessee from the war damage commission must therefore be treated in its entirety as profit liable to tax.\"",
      "speaker": "court",
      "significance": "Core holding on taxability of entire receipts"
    },
    {
      "text": "\"the value of the assets must after receipt of compensation be taken to be nil, and the assessee by not writing off the value in his books of account on and after accepting the benefits of the special scheme could not invest those assets\"",
      "speaker": "court",
      "significance": "Reason for rejecting book value deduction"
    }
  ],
  "_case_id": "1965_264",
  "_label": 0,
  "_text_length": 6396,
  "_extracted_at": "2026-02-10T19:27:37.168930"
}