{
  "metadata": {
    "case_name": "Ratan Lal v. State",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "Shah, J."
    ],
    "case_number": "Criminal Appeal No. 53 of 1964",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Ratan Lal is proprietor of Anil Medical Stores at Wani, District Yeotmal, Maharashtra.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On September 14, 1960, Station House Officer, Wani, raided the shop and seized 12 bottles of Mahadrakshasava (52.3% alcohol v/v) manufactured by Brahma Aushadhalaya, Nagpur, and 88 bottles of Dashmoolarishta (54.5% alcohol v/v) manufactured by Vedic Pharmaceutical Works, Nagpur.",
      "type": "material",
      "date": "1960-09-14",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Preparations are Ayurvedic medicinal preparations containing alcohol, manufactured by process of distillation under licences under Medicinal and Toilet Preparations Excise Duties Act 16 of 1955.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Appellant purchased preparations from Sharda Medical Stores, Nagpur, supplied by manufacturers.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Appellant convicted by Magistrate First Class, Kalapur, under s.66(1)(b) Bombay Prohibition Act 1949, sentenced to RI 3 months and fine Rs.500/-; confirmed in appeal by Sessions Court Yeotmal; High Court Bombay (Nagpur Bench) confirmed conviction but modified sentence, judgment dated August 9, 1963.",
      "type": "procedural",
      "date": "1963-08-09",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Appellant had no licence, permit, pass or authorization.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Evidence by Palnitkar, Sub-Inspector, that Mahadrakshasava and Dashmoolarishta are distilled Ayurvedic products; conceded by State before Sessions and High Court.",
      "type": "material",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f8",
      "text": "Preparations manufactured within Maharashtra from bonded warehouse.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Government of Maharashtra declaration on October 4, 1960, after consulting Board of Experts, that both preparations are fit for use as intoxicating liquor.",
      "type": "material",
      "date": "1960-10-04",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Police report filed on June 2, 1962.",
      "type": "procedural",
      "date": "1962-06-02",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the preparations Mahadrakshasava and Dashmoolarishta containing alcohol were medicinal preparations unfit for use as intoxicating liquor within s.24A, complying with description and limitations in s.59A of Bombay Prohibition Act.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether under amended s.6A(7), the preparations were deemed unfit until State Government determination, and if subsequent declaration has retrospective effect.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Possession not contravention as preparations are medicinal containing alcohol unfit for use as intoxicating liquor within s.24A; manufactured by distillation, not fermentation, so proviso to s.59A(1) inapplicable; comply with s.59A limitations as licensed under Medicinal Act and from bonded warehouse.",
      "supporting_facts": [
        "f2",
        "f3",
        "f4",
        "f6",
        "f7",
        "f8"
      ],
      "legal_basis": "Bombay Prohibition Act ss.24A, 59A; Medicinal and Toilet Preparations Excise Duties Act 16 of 1955"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Preparations do not comply with s.59A as alcohol generated by fermentation exceeding 12%; even if comply, fit for use as intoxicating liquor.",
      "supporting_facts": [
        "f2"
      ],
      "legal_basis": "Bombay Prohibition Act ss.59A proviso, 24A"
    },
    {
      "id": "ra2",
      "text": "Medicinal preparation fit for intoxicating use if high alcohol intoxicates in normal dose or large quantity without health danger.",
      "supporting_facts": [
        "f2"
      ],
      "legal_basis": "Bombay Prohibition Act s.6A"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Courts below erred; preparations manufactured by distillation, not fermentation; proviso to s.59A inapplicable; no evidence alcohol exceeds quantity necessary for extraction/solution/preservation; licensed manufacture infers s.59A compliance.",
      "addresses_issue": "i1",
      "key_observation": "Clear evidence of distillation process."
    },
    {
      "id": "cr2",
      "text": "Under amended s.6A(7) (effective before offence), articles deemed unfit until State determines fit after Board advice; declaration on Oct 4, 1960 post-dates seizure Sept 14, 1960; no retrospective effect; possession innocent at time.",
      "addresses_issue": "i2",
      "key_observation": "s.6A(7) creates deeming fiction defining unfit articles for s.24A."
    },
    {
      "id": "cr3",
      "text": "High Court followed Narandas Mangilal which interpreted pre-amendment s.6A; amendment via Act 22 of 1960 changed scheme, making State determination only mode of proof.",
      "addresses_issue": "i2",
      "key_observation": "Amended s.6A(6),(7) alters proof requirements."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Mahadrakshasava and Dashmoolarishta unfit for use as intoxicating liquor at time of possession; exemption under s.24A applies; no offence under s.66(1)(b).",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Until State Government determines under s.6A that article fit, deemed unfit; subsequent determination no retrospective operation.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "State of Bombay v. F.N. Balsara",
      "citation": "1951 S.C.R. 682",
      "treatment": "referred",
      "relevance": "Declared clause (c) of s.12 invalid re medicinal/toilet preparations; led to addition of s.6A."
    },
    {
      "case_name": "State of Bombay/Gujarat v. Narandas Mangilal Agarwal",
      "citation": "1962 Supp. 1 S.C.R. 15",
      "treatment": "distinguished",
      "relevance": "Held no obligation to consult Board under pre-amendment s.6A; followed by High Court erroneously post-amendment."
    },
    {
      "case_name": "D.K. Merchant v. State of Bombay",
      "citation": "1958-60 B.L.R. 1183",
      "treatment": "referred",
      "relevance": "Bombay HC held prosecution cannot proceed without State satisfaction post-Board consultation under s.6A; disagreed with by SC in Narandas."
    }
  ],
  "statutes_cited": [
    {
      "name": "Bombay Prohibition Act 25 of 1949",
      "sections": [
        "s.66(1)(b)",
        "s.2(22)",
        "s.2(24)",
        "s.12",
        "s.24A",
        "s.59A",
        "s.6A",
        "s.11"
      ],
      "relevance": "Penalises possession of intoxicant/liquor; exceptions for medicinal preparations unfit for intoxicating use complying with s.59A; s.6A deems unfit until State determination."
    },
    {
      "name": "Medicinal and Toilet Preparations (Excise Duties) Act 16 of 1955",
      "sections": [],
      "relevance": "Preparations manufactured under licences; issued from bonded warehouse, inferring s.59A compliance."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; conviction and sentence set aside as possession of preparations on Sept 14, 1960 not offence, being deemed unfit under s.6A(7) until post-seizure declaration.",
    "relief_granted": "Acquittal",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"Until the State Government has determined as aforesaid any article mentioned in sub-section (1) to be fit for use as intoxicating liquor, every such article shall be deemed to be unfit for such use.\"",
      "speaker": "court",
      "significance": "Quotes amended s.6A(7) deeming fiction central to holding."
    },
    {
      "text": "\"A subsequent declaration by the State that they were fit for use as intoxicating liquor, could not have any retrospective operation, and possession which was innocent could not, by subsequent act of the State, be declared as offending the statute.\"",
      "speaker": "court",
      "significance": "Explains why conviction invalid due to timing."
    }
  ],
  "_case_id": "1965_209",
  "_label": 1,
  "_text_length": 18457,
  "_extracted_at": "2026-02-10T19:26:58.672121"
}