{
  "metadata": {
    "case_name": "University of Mysore v. Gopala Gowda and Bheemappa Reddy",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "Shah, J."
    ],
    "case_number": "Civil Appeals Nos. 565-566 of 1963",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Mysore University Act 23 of 1956 enacted to reorganise University of Mysore.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Section 21 constitutes Academic Council as an authority under s.13.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Section 22: Academic Council has control and general regulation of teaching, courses of studies, maintenance of standards thereof, and other powers as prescribed.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Section 23(c): Academic Council powers include making Regulations relating to courses, schemes of examinations, conditions on which students admitted to examinations, degrees etc.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Section 43: Regulations may provide for exercise of powers in ss.22,23 including admission of students, recognition of other exams, university courses, conditions for admission to exams for degrees etc.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Academic Council framed Regulations for B.V.Sc. degree under ss.22,23,43. Clause 3(c): No candidate who fails four times shall be permitted to continue the course.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Mysore Veterinary College, Hebbal, Bangalore affiliated to Mysore University for B.V.Sc. training.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Gopala Gowda admitted in 1958 to First Year B.V.Sc. course at Mysore Veterinary College.",
      "type": "material",
      "date": "1958",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Gopala Gowda declared unsuccessful in four successive First Year examinations.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Controller of Examinations informed Gopala Gowda by letter dated August 2, 1961 that he lost right to continue B.V.Sc. course under Regulation 3(c).",
      "type": "procedural",
      "date": "1961-08-02",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Gopala Gowda filed Writ Petition No. 940 of 1961 in Mysore High Court seeking quashing of order and permission to appear in subsequent exams and prosecute training.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Bheemappa Reddy failed four successive First Year examinations commencing April 1959.",
      "type": "material",
      "date": "1959-04",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Controller informed Bheemappa Reddy he would not be permitted to continue under Regulation 3(c).",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Bheemappa Reddy filed Writ Petition No. 1056 of 1961 in Mysore High Court, similar relief.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f15",
      "text": "Mysore High Court by judgment dated January 31, 1962 held Regulation 3(c) beyond competence of Academic Council, quashed orders, permitted students to continue.",
      "type": "procedural",
      "date": "1962-01-31",
      "source": "lower_court"
    },
    {
      "id": "f16",
      "text": "University of Mysore, Controller of Examinations, Principal of Veterinary College appealed to Supreme Court by special leave.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f17",
      "text": "Post High Court judgment, respondents permitted to continue, passed second and third year exams, permitted to keep terms for degree exam.",
      "type": "material",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the Academic Council of the Mysore University was competent in exercise of the powers conferred by ss. 22, 23 and 43 of the Mysore University Act 23 of 1956 to frame cl. 3(c) of the Regulations relating to the grant of the degree for Bachelor of Veterinary Science (B.V.Sc.): 'No candidate who fails four times shall be permitted to continue the course.'",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Academic Council invested with power to control entire academic life from admission to conferment of degree, including power to refuse admission to exams and weed out unfit students after four failures as reasonable test of inaptitude.",
      "supporting_facts": [
        "f3",
        "f4",
        "f5",
        "f6"
      ],
      "legal_basis": "ss.22, 23(c), 43 of Mysore University Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Regulation 3(c) does not subserve maintenance of standards under s.22; power under ss.22,23(c) allows prescribing qualifications for admission to course/exams/degree but not to prevent admitted student from prosecuting studies; only consequence of failure is withholding degree, not obstructing course.",
      "supporting_facts": [
        "f6",
        "f15"
      ],
      "legal_basis": "ss.22, 23(c) of Mysore University Act"
    },
    {
      "id": "ra2",
      "text": "Maintenance of standards limited to course length, attendance, minimum attainments; once admitted, student deemed to have capacity to attain standard; power to refuse exercisable at admission, not later.",
      "supporting_facts": [
        "f8",
        "f12"
      ],
      "legal_basis": "s.22 of Mysore University Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Academic Council has control over teaching, courses, standards under s.22; powers under s.23(c) to make regulations on courses, exams, conditions for admission to exams etc.; s.43 allows regulations for these.",
      "addresses_issue": "i1",
      "key_observation": "Power to prescribe conditions for admission to exams implies power to refuse in contingencies, weed out unfit students."
    },
    {
      "id": "cr2",
      "text": "Failure in four exams is reasonable test of inaptitude or disability; indefinite continuation would lower standards.",
      "addresses_issue": "i1",
      "key_observation": "Power to maintain standards includes directing unfit student to discontinue, beyond just admission qualifications or final withholding of degree."
    },
    {
      "id": "cr3",
      "text": "High Court erred in holding no power to frame Regulation 3(c).",
      "addresses_issue": "i1",
      "key_observation": "Regulation valid."
    },
    {
      "id": "cr4",
      "text": "Though High Court view erroneous, respondents already continued, passed later exams; no interim stay sought; exceptional circumstances warrant no effective order against them.",
      "addresses_issue": "i1",
      "key_observation": "Dismiss appeals without nullifying results."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Academic Council competent to frame Regulation 3(c); power to maintain standards and prescribe conditions for exams includes barring student after four failures from continuing course.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Mysore University Act 23 of 1956",
      "sections": [
        "s.4",
        "s.13",
        "s.21",
        "s.22",
        "s.23",
        "s.43"
      ],
      "relevance": "Powers of Academic Council to regulate courses, standards, make regulations including conditions for exams and barring unfit students."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court held Regulation 3(c) valid and within competence of Academic Council, reversing High Court; however, in exceptional circumstances since respondents permitted to continue post High Court order, passed later exams without interim stay, appeals dismissed without nullifying their results.",
    "relief_granted": "None; status quo maintained for respondents",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"No candidate who fails four times shall be permitted to continue the course.\"",
      "speaker": "court",
      "significance": "The impugned regulation at issue."
    },
    {
      "text": "Power to prescribe conditions on which a student may be admitted to the examinations... necessarily implies the power to refuse to admit a student in certain contingencies...",
      "speaker": "court",
      "significance": "Core reasoning upholding regulation's validity."
    },
    {
      "text": "If after securing admission... a student may be held entitled to continue indefinitely... a lowering of academic standards would inevitably result.",
      "speaker": "court",
      "significance": "Justification for power to bar persistent failures."
    }
  ],
  "_case_id": "1965_26",
  "_label": 0,
  "_text_length": 13007,
  "_extracted_at": "2026-02-10T19:24:52.977990"
}