{
  "metadata": {
    "case_name": "State of Madhya Pradesh v. Hiralal",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "Subba Rao, J."
    ],
    "case_number": "Civil Appeal No. 814 of 1964",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Hiralal, the respondent, is the manager of a joint Hindu family carrying on business in the name and style of Messrs. Tilokchand Kalyanmal.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The joint family owns a re-rolling mill situated in Indore City called the Central India Iron and Steel Company.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The said family purchases scrap iron locally and imports iron plates from outside and after converting them into bars, flats and plates in the Mills sells them in the market.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The respondent made a default in furnishing the returns prescribed by s. 7 of the Act for the period April 1, 1954, to March 31, 1955.",
      "type": "procedural",
      "date": "1954-04-01 to 1955-03-31",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "On February 27, 1956, the Sales-tax Officer, Indore, determined the taxable turnover at Rs. 2,26,000 and the sales-tax payable thereon at Rs. 8,000 and he also imposed a penalty of Rs. 1,000 under s. 14(1)(c) of the Act.",
      "type": "procedural",
      "date": "1956-02-27",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "On the same day he issued demand notices to the respondent for the payment of the said sales-tax and the penalty.",
      "type": "procedural",
      "date": "1956-02-27",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "On September 10, 1956, the respondent filed a petition in the High Court of Madhya Bharat (afterwards Madhya Pradesh) under Arts. 226 and 227 of the Constitution for the issue of appropriate writs quashing the assessment of tax and penalty and to restrain the State from giving effect to the said orders of the Sales-tax Officer.",
      "type": "procedural",
      "date": "1956-09-10",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "A Division Bench of the High Court held that the iron bars, flats and plates sold by the respondent were exempted from sales-tax under the Notification. In that view, the orders of the Sales-tax Officer were quashed.",
      "type": "procedural",
      "date": "1961-10-24",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "The state has filed the present appeal, by special leave.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the said iron bars, flats and plates are iron and steel within the meaning of Item No. 39 of the Notification No. 58, dated October 24, 1953.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Learned counsel for the State contends that the expression iron and steel means iron and steel in the original condition -and not iron and steel in the shape of bars, flats and plates.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": "Notification No. 59, Schedule IV, Item 9: goods prepared from any metal other than gold and silver"
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "A comparison of the said two Notifications brings out the distinction between raw materials of iron and steel and the goods prepared from iron and steel while the former is exempted from tax, the latter is taxed.",
      "addresses_issue": "i1",
      "key_observation": "Therefore, iron and steel used as raw-material for manufacturing other goods are exempted from taxation. So long as iron and steel continue to be raw-materials, they enjoy the exemption."
    },
    {
      "id": "cr2",
      "text": "Scrap iron purchased by the respondent was merely re-rolled into bars, flats and plates. They were processed for convenience of sale. The raw-materials were only re-rolled to give them attractive and acceptable forms. They did not in the process lose their character as iron and steel.",
      "addresses_issue": "i1",
      "key_observation": "The dealer sold iron and steel in the shape of bars, flats and plates and the customer purchased iron and steel in that shape."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The bars, flats and plates sold by the assessee are iron and steel exempted under the Notification.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Madhya Bharat Sales Tax Act, Samvat 2007 (Act No. 30 of 1950)",
      "sections": [
        "s. 7",
        "s. 14(1)(c)",
        "s. 5"
      ],
      "relevance": "Governs sales tax assessment, returns, penalty, and notifications exempting/taxing goods"
    },
    {
      "name": "Essential Goods (Declaration and Regulation of Tax on Sales or Purchases) Act, 1952 (Act No. 52 of 1952)",
      "sections": [
        "s. 5",
        "Schedule I"
      ],
      "relevance": "Declares iron and steel essential; empowers notifications"
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Arts. 226",
        "Art. 227"
      ],
      "relevance": "Basis for High Court petition"
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal by special leave is dismissed, upholding the High Court's judgment that the iron bars, flats and plates are exempted from sales tax under Item No. 39 of Notification No. 58. The conclusion arrived at by the High Court is correct.",
    "relief_granted": "Orders of Sales-tax Officer quashed (upheld)",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "We, therefore, hold that the bars, flats and plates sold by the assessee are iron and steel exempted under the Notification.",
      "speaker": "court",
      "significance": "Core holding resolving the interpretation issue in favor of exemption"
    },
    {
      "text": "Scrap iron purchased by the respondent was merely re-rolled into bars, flats and plates. They were processed for convenience of sale. The raw-materials were only re-rolled to give them attractive and acceptable forms.",
      "speaker": "court",
      "significance": "Key reasoning on why re-rolled products retain character as iron and steel"
    }
  ],
  "_case_id": "1965_260",
  "_label": 0,
  "_text_length": 5090,
  "_extracted_at": "2026-02-10T19:27:28.397515"
}