{
  "metadata": {
    "case_name": "Meenakshi Achi & V.R.K.R.S. Firm v. Income Tax Authorities",
    "case_year": 1965,
    "court": "Supreme Court of India",
    "judges": [
      "Subba Rao, J."
    ],
    "case_number": "C.A. No. 157/1965 and C.A. No. 158/1965",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant in C.A. No. 157/1965, Meenakshi Achi, owns 5/6th share in Sungei Chour Estate in Malaya.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Appellant in C.A. No. 158/1965, V.R.K.R.S. Firm, owns rubber estates in Kaualakangsar, Malaya.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "During the Second World War, rubber estates in the Federated Malay States were either destroyed or denuded.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Government of the Federated Malay States issued The Rubber Industry Re-planting Fund Ordinance, 1952, constituting a Board to administer funds from cess on rubber production and export.",
      "type": "background",
      "date": "1952",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "In accounting year relevant to assessment year 1955-56, Meenakshi Achi received 5,962 dollars as re-plantation cess from the Board.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "In accounting year corresponding to assessment year 1955-56, V.R.K.R.S. Firm received 10,336 dollars as re-plantation cess from the Board.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Income-Tax Officer treated the amounts as revenue receipts on the ground that payments were made to cover re-planting expenses of the assessees.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Assessees claimed the amounts as capital receipts.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "Tribunal concluded the amounts were income assessable to tax.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "High Court answered questions in affirmative, holding amounts were trading receipts as source was production/export of rubber by plantation owners.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Assessees were only planters, not running any business in rubber; income from plantations assessed in India as foreign agricultural income.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Assessees conceded they did not have high-yielding rubber trees entirely; payments based on expenditure after 1st January 1946, claimed and allowed as expenses.",
      "type": "admitted",
      "date": "1946-01-01",
      "source": "petitioner"
    },
    {
      "id": "f13",
      "text": "Expenses allowed were based on production, not actual expenses shown.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "Assessees owned rubber plantations before 1st January 1946; did not pay any duty for rubber exported as they were not exporters.",
      "type": "admitted",
      "date": "1946-01-01",
      "source": "court"
    },
    {
      "id": "f15",
      "text": "Cess collected on rubber produced in Penang and exported from Federation other than Penang.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f16",
      "text": "Proceedings assumed scheme framed under First Schedule; properties not planted entirely with high-yielding rubber trees.",
      "type": "admitted",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether, on the facts and in the circumstances of the case, the re-plantation cess receipt of 5,962 dollars is income assessable to tax?",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether on the facts and in the circumstances of the case, the sum of 10,336 dollars constitutes income assessable to tax?",
      "framed_by": "high_court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Premise of High Court wrong; fund not collected from producers like assessees, who were neither producers in Penang nor exporters; only planters not running business.",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Income from plantations taxed in India as foreign agricultural income; taxability depends on object of payment.",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Payments ex gratia as inducement to develop rubber plantations with high-yielding trees, hence capital receipts.",
      "supporting_facts": [
        "f4",
        "f16"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Scheme framed per First Schedule; disbursements per Second Schedule; payments related to rubber produced, which is trading asset.",
      "supporting_facts": [
        "f5",
        "f6",
        "f12"
      ],
      "legal_basis": "Rubber Industry Re-planting Fund Ordinance, 1952 First and Second Schedules"
    },
    {
      "id": "ra2",
      "text": "Even if First Schedule applies, payments to recoup revenue expenditure for running/maintaining plantations.",
      "supporting_facts": [
        "f12",
        "f13"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Assumed scheme under First Schedule; revenue cannot change ground to Second Schedule.",
      "addresses_issue": "i1",
      "key_observation": "Assessees only planters, not carrying on business."
    },
    {
      "id": "cr2",
      "text": "Under First Schedule clause 4, amounts credited proportional to rubber produced; paid against expenditure incurred since 1st January 1946 on re-planting/new planting.",
      "addresses_issue": "i1",
      "key_observation": "Payments against maintenance expenditure."
    },
    {
      "id": "cr3",
      "text": "High Court erred: assessees not exporters, did not contribute to fund via duty.",
      "addresses_issue": "i1",
      "key_observation": "Source not from assessees' contributions."
    },
    {
      "id": "cr4",
      "text": "Analogous to Higgs v. Wrightson: grants towards expense of ploughing held revenue receipt.",
      "addresses_issue": "i1",
      "key_observation": "Amounts paid against expenditure for maintaining plantations."
    },
    {
      "id": "cr5",
      "text": "Receipts are revenue receipts liable to tax.",
      "addresses_issue": "i2",
      "key_observation": "Earmarked on basis of production, recoups maintenance costs."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Amounts from fund earmarked for assessees on basis of rubber produced were paid against expenditure for maintaining plantations and producing rubber; hence revenue receipts assessable to tax.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "High Court rightly answered questions against assessees, though for different reasons.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Higgs v. Wrightson",
      "citation": null,
      "treatment": "followed",
      "relevance": "Grants for ploughing land held revenue receipt as towards expense; analogous to payments against plantation maintenance."
    }
  ],
  "statutes_cited": [
    {
      "name": "Rubber Industry Re-planting Fund Ordinance, 1952",
      "sections": [
        "Section 4",
        "Section 7",
        "Section 10",
        "First Schedule",
        "Second Schedule"
      ],
      "relevance": "Established fund from cess on rubber production/export; schemes for utilization for re-planting; basis for crediting and disbursing amounts proportional to production against replanting expenditure."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court dismissed the appeals by special leave, holding the re-plantation cess receipts as revenue receipts assessable to tax, affirming High Court though for different reasons.",
    "relief_granted": null,
    "costs": "with costs"
  },
  "key_quotes": [
    {
      "text": "\"Whether, on the facts and in the circumstances of the case, the re- plantation cess receipt of 5,962 dollars is income assessable to tax?\"",
      "speaker": "court",
      "significance": "Core legal issue framed."
    },
    {
      "text": "\"The amounts from the fund earmarked for the appellants on the basis of the rubber produced by them were paid against the expenditure incurred by them for maintaining the rubber plantation and producing the rubber.\"",
      "speaker": "court",
      "significance": "Key finding on nature of receipts as revenue."
    },
    {
      "text": "\"Since the amount of the grant depends on the area ploughed, it would seem to be a grant towards the expense of the ploughing.\"",
      "speaker": "court",
      "significance": "Quote from Higgs v. Wrightson applied analogously."
    }
  ],
  "_case_id": "1965_262",
  "_label": 0,
  "_text_length": 16420,
  "_extracted_at": "2026-02-10T19:27:38.241511"
}