{
  "metadata": {
    "case_name": "Appellant Company v. Sales Tax Officer, Government of Orissa",
    "case_year": null,
    "court": "Supreme Court of India",
    "judges": [
      "Subba Rao, J."
    ],
    "case_number": null,
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant filed petitions under Article 226 of the Constitution of India in the High Court of Orissa for issuance of a writ of mandamus or any other appropriate writ quashing the assessment orders/notification on the ground that the imposition of tax was without authority of law or ultra vires the Orissa Sales Tax Act and the rules.",
      "type": "background",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f2",
      "text": "High Court of Orissa dismissed the petitions on the ground that the petitioner has not exhausted the internal remedies under the Orissa Sales Tax Act.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f3",
      "text": "Appellant filed appeals by special leave against the orders of the High Court of Orissa.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Learned Attorney-General appearing for the Sales Tax Officer raised a preliminary objection that the special leave petitions were filed out of time.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f5",
      "text": "Mr. A. V. Viswanatha Sastri appearing for the appellant company contended that the special leave petitions were not barred by time.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "Court excused the delay in filing the special leave petitions, having regard to the circumstances of the case.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the special leave petitions were filed out of time and barred.",
      "framed_by": "respondent"
    },
    {
      "id": "i2",
      "text": "Whether the sales tax authorities under the Orissa Sales Tax Act could decide the question of whether the imposition of tax was ultra vires the Act.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether the appellant was required to exhaust internal remedies under the Orissa Sales Tax Act before filing writ petitions under Article 226.",
      "framed_by": "high_court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The imposition of tax was without authority of law or ultra vires the Orissa Sales Tax Act and the rules; sought writ of mandamus or other appropriate writ to quash the assessment orders.",
      "supporting_facts": [
        "f1"
      ],
      "legal_basis": "Article 226 of the Constitution of India"
    },
    {
      "id": "pa2",
      "text": "The special leave petitions were not barred by time.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The appellant should exhaust internal remedies under the Orissa Sales Tax Act.",
      "supporting_facts": [
        "f2"
      ],
      "legal_basis": "Orissa Sales Tax Act"
    },
    {
      "id": "ra2",
      "text": "The special leave petitions were filed out of time.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Without deciding whether the special leave petitions were barred by time, having regard to the circumstances of the case, excused the delay in filing, if any.",
      "addresses_issue": "i1",
      "key_observation": "Fit case for excusing the delay."
    },
    {
      "id": "cr2",
      "text": "In K. S. Venkataraman Co. (P.) Ltd. v. State of Madras (Civil Appeal No. 618 of 1963, decided on October 18, 1965), this Court held that the Sales Tax Tribunal could only decide disputes between the assessee and the Commissioner in terms of the provisions of the Madras General Sales Tax Act, 1939, and the question of ultra vires was foreign to its jurisdiction.",
      "addresses_issue": "i2",
      "key_observation": "For the same reason, the question raised by the appellant could not be decided by the sales tax authorities under the Orissa Sales Tax Act, 1947."
    },
    {
      "id": "cr3",
      "text": "The High Court went wrong in dismissing the applications on the ground that the appellant should exhaust his internal remedies under the Orissa Sales Tax Act.",
      "addresses_issue": "i3",
      "key_observation": "Ultra vires question foreign to jurisdiction of sales tax authorities."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Delay in filing special leave petitions excused.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Sales tax authorities under Orissa Sales Tax Act cannot decide question of ultra vires.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h3",
      "text": "High Court erred in dismissing writ petitions for non-exhaustion of internal remedies.",
      "resolves_issue": "i3",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "K. S. Venkataraman Co. (P.) Ltd. v. State of Madras",
      "citation": "Civil Appeal No. 618 of 1963, decided on October 18, 1965",
      "treatment": "followed",
      "relevance": "Sales Tax Tribunal could only decide disputes in terms of the Act; question of ultra vires foreign to its jurisdiction; applied analogously to Orissa Sales Tax Act"
    }
  ],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Article 226"
      ],
      "relevance": "Basis for filing writ petitions in High Court to quash assessment orders"
    },
    {
      "name": "Orissa Sales Tax Act, 1947",
      "sections": [],
      "relevance": "Imposition of tax alleged ultra vires; internal remedies not required to be exhausted for ultra vires challenge"
    },
    {
      "name": "Madras General Sales Tax Act, 1939",
      "sections": [],
      "relevance": "Precedent held tribunal jurisdiction limited under this Act; analogous to Orissa Act"
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Court excused delay in filing special leave petitions and held that the High Court erred in dismissing the writ petitions under Article 226 on the ground of non-exhaustion of internal remedies under the Orissa Sales Tax Act, as the ultra vires question was beyond the jurisdiction of sales tax authorities.",
    "relief_granted": "Delay excused; High Court orders effectively set aside on merits discussed",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "the Sales Tax Tribunal could only decide disputes between the assessee and the Commissioner in terms of the provisions of the Madras General Sales Tax Act, 1939, and the question of ultra vires was foreign to its jurisdiction.",
      "speaker": "court",
      "significance": "Core reasoning applied from precedent to hold Orissa sales tax authorities lack jurisdiction over ultra vires"
    },
    {
      "text": "The High Court, therefore, went wrong in dismissing the applications on the ground that the appellant should exhaust his internal remedies under the said Act.",
      "speaker": "court",
      "significance": "Direct holding reversing High Court's dismissal"
    }
  ],
  "_case_id": "1965_158",
  "_label": 1,
  "_text_length": 1911,
  "_extracted_at": "2026-02-10T19:26:16.739593"
}