{
  "metadata": {
    "case_name": "State of Kerala v. N. Sami Iyer",
    "case_year": null,
    "court": "Supreme Court of India",
    "judges": [
      "Sikri, J."
    ],
    "case_number": "Tax Revenue Case No. 44 of 1960",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The respondent, N. Sami Iyer, is a dealer in tobacco.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The assessee objected to the assessment of the turnover of Rs. 7,757.54 for the assessment year 1957-58 on the ground that the goods were the subject-matter of purchases which had already been assessed at the point of purchase in the hands of the assessee.",
      "type": "disputed",
      "date": "1957-58",
      "source": "respondent"
    },
    {
      "id": "f3",
      "text": "The assessee failed before the Sales Tax authorities, but in a revision the High Court of Kerala accepted his contention and held that this turnover was not liable to tax.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f4",
      "text": "During the period April 1, 1957 to September 30, 1957, the assessee was residing in Malabar and in this area the Madras General Sales Tax Act 9 of 1939 applied.",
      "type": "material",
      "date": "1957-04-01 to 1957-09-30",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Tobacco was taxable at the purchase point under the Madras Act and the turnover with which we are concerned had suffered taxation at that point under the Madras Act.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The Travancore-Cochin General Sales Tax Amendment Act, 1957 (12 of 1957) came into force on October 1, 1957.",
      "type": "background",
      "date": "1957-10-01",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Act 12 of 1957 changed the short title of the Travancore-Cochin General Sales Tax Act 1125 (11 of 1125) to the General Sales Tax Act, 1125, and extended it to the whole of the State of Kerala, including Malabar district.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Section 14 of Act 12 of 1957 inserted s. 26A in Act 11 of 1125 with Schedule II, deeming registrations and licences under Madras Act to be under the new Act, and requiring turnover under Madras Act up to commencement of Act 12 of 1957 to be taken into account for the financial year ending 31st March 1958.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Act 12 of 1957 by s. 15 inter alia repealed the Madras General Sales Tax Act, 1939, as in force in the Malabar District.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Section 3(5) of the General Sales Tax Act, 1125, is in the same terms as s. 3(5) of the Madras General Sales Tax Act.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Section 5(vii) of the General Sales Tax Act corresponding to s. 5 of the Madras Act provides for single point taxation as specified by Government notification.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Description of item 2 in column 2 of Schedule I: Tobacco other than Beedi Tobacco Suka.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Government issued notification No. RI-10674/57/RD-2 dated September 28, 1957, specifying taxable point for tobacco other than Beedi Tobacco Suka as 1st sale in the State by a dealer who is not exempt from taxation under section 3(3).",
      "type": "material",
      "date": "1957-09-28",
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Previously under Madras Act, taxable point for tobacco was point of first purchase; now changed to first sale in the State.",
      "type": "material",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether there was a vested right under the proviso to s. 3(5) of the Madras General Sales Tax Act not to be taxed again on sales of goods already taxed at purchase point, and whether this right survives the repeal by Act 12 of 1957.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether Act 12 of 1957 manifests a contrary intention within the meaning of s. 4(c) of the General Clauses Act, 1125, to tax the disputed turnover again.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "There was no right, much less a vested right, not to be taxed except under the Madras General Sales Tax Act; the right if at all was to take advantage of the provisions of the repealed Act, namely, the proviso to s. 3(5) of the Madras Act.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": "Proviso to s. 3(5) Madras General Sales Tax Act"
    },
    {
      "id": "pa2",
      "text": "Even if there was such a right, Act 12 of 1957 manifests a contrary and different intention within the meaning of s. 4(c) of the General Clauses Act, 1125, and the disputed turnover is liable to taxation under Act 12 of 1957.",
      "supporting_facts": [
        "f6",
        "f8",
        "f13"
      ],
      "legal_basis": "s. 4(c) General Clauses Act, 1125; s. 26A and Schedule II of Act 12 of 1957"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The goods were the subject-matter of purchases which had already been assessed at the point of purchase in the hands of the assessee, hence turnover not liable to tax again.",
      "supporting_facts": [
        "f2",
        "f5"
      ],
      "legal_basis": "Proviso to s. 3(5) Madras General Sales Tax Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "By virtue of s. 4(c) of the General Clauses Act, 1125, the dealer continued to be liable to taxation under the Madras General Sales Tax Act in respect of the disputed turnover at the purchase point, with a right not to be taxed again in respect of any sale of such goods.",
      "addresses_issue": "i1",
      "key_observation": "Liability under old Act incurred, attached with right not to be taxed on resale."
    },
    {
      "id": "cr2",
      "text": "Act 12 of 1957 does not manifest a different intention to destroy rights and liabilities under the old Act; the second schedule preserves old rights such as registration and licences.",
      "addresses_issue": "i2",
      "key_observation": "No clear words to override the right under s. 3(5) proviso; as per State of Punjab v. Mohar Singh, new Act must expressly or by clear intention destroy old rights."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The turnover of Rs. 7,757.54 is not liable to taxation under the new Act as it had already suffered tax at purchase point under Madras Act, and the right attached survives repeal.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Act 12 of 1957 does not manifest intention to destroy rights under old Act per s. 4(c) General Clauses Act.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "State of Punjab v. Mohar Singh",
      "citation": null,
      "treatment": "followed",
      "relevance": "When repeal followed by fresh legislation, look to new provisions to see if they manifest intention to destroy old rights and liabilities."
    }
  ],
  "statutes_cited": [
    {
      "name": "Madras General Sales Tax Act, 1939",
      "sections": [
        "s. 3(5)",
        "s. 5"
      ],
      "relevance": "Taxed tobacco at purchase point; proviso prevents double taxation on resale."
    },
    {
      "name": "Travancore-Cochin General Sales Tax Act, 1125 (11 of 1125)",
      "sections": [
        "s. 3(5)",
        "s. 5(vii)",
        "s. 26A (inserted)"
      ],
      "relevance": "Extended to Kerala; same s. 3(5); single point tax per notification."
    },
    {
      "name": "Travancore-Cochin General Sales Tax Amendment Act, 1957 (12 of 1957)",
      "sections": [
        "s. 14 (inserts s. 26A)",
        "s. 15 (repeals Madras Act)",
        "Schedule II"
      ],
      "relevance": "Extended Act to Malabar; transitory provisions deem old registrations and include prior turnover."
    },
    {
      "name": "General Clauses Act, 1125",
      "sections": [
        "s. 4(c)"
      ],
      "relevance": "Preserves liabilities and rights under repealed Act unless contrary intention."
    },
    {
      "name": "States Reorganisation Act, 1956",
      "sections": [
        "s. 5(2)",
        "s. 3(2)"
      ],
      "relevance": "Defines Malabar District."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal is dismissed; the Court agrees with the High Court that the turnover of Rs. 7,757.54 (noted as 7,754.54 in result) is not liable to taxation.",
    "relief_granted": "Turnover held not liable to tax",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"Where a dealer has been taxed in respect of the purchase of any goods in accordance with the rules referred to in clause (1) of this proviso, he shall not be taxed again in respect of any sale of such goods effected by him.\"",
      "speaker": "court",
      "significance": "Proviso to s. 3(5) preventing double taxation"
    },
    {
      "text": "\"We cannot discern any intention in Act 12 of 1957 to destroy the rights and liabilities acquired or incurred under the Madras General Sales Tax Act.\"",
      "speaker": "court",
      "significance": "Core holding on survival of rights post-repeal"
    },
    {
      "text": "\"In the result we agree with the High Court that the turn-over of Rs. 7,754.54 is not liable to taxation.\"",
      "speaker": "court",
      "significance": "Final determination"
    }
  ],
  "_case_id": "1965_286",
  "_label": 0,
  "_text_length": 8924,
  "_extracted_at": "2026-02-10T19:28:13.026963"
}