{
  "metadata": {
    "case_name": "Landholder (Kharma Hat) v. Local Board of Barpeta",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "Wanchoo, J."
    ],
    "case_number": "Civil Appeal No. 630 of 1963",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant is a landholder in the district of Kamrup and holds a hat or market known as Kharma hat on his land since the year 1936.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "In 1953-54, the local board of Barpeta, within whose jurisdiction the Kharma market is held, issued notice to the appellant to take out a licence and pay Rs. 600/- for the year 1953-54 as licence-fee for holding the market.",
      "type": "material",
      "date": "1953-54",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Later this sum was increased to Rs. 700/- for the year 1955-56.",
      "type": "material",
      "date": "1955-56",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The appellant continued protesting against this levy but no heed was paid to his protests and the amount was sought to be recovered by issue of distress warrants and attachment of his property.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The appellant filed a writ petition in the Assam High Court in Civil Rule No. 42 of 1957 challenging the constitutionality of the impost on a number of grounds.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Assam High Court dismissed the writ petition by judgment and order dated June 8, 1959, and granted certificate under Art. 132 of the Constitution.",
      "type": "procedural",
      "date": "1959-06-08",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "The tax is levied by local boards for the use of any land for the purpose of holding markets as provided by s. 62 of the Assam Local Self-Government Act, No. XXV of 1953.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Under s. 62, a rule has been framed prescribing Rs. 1000/- as the maximum amount of tax which may be levied by any local board in Assam on markets licensed under that section, and any local board may with the previous approval of Government impose a tax within this maximum according to the size and importance of a market.",
      "type": "material",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f9",
      "text": "At the time the tax was imposed for 1953-54 (continued later with modifications), there were five markets on which tax was imposed including Kharma market: lowest Rs. 400/- on two markets, Rs. 500/- on the third, Rs. 600/- on Kharma market, Rs. 1000/- on the fifth.",
      "type": "material",
      "date": "1953-54",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the Assam legislature had legislative competence to tax markets under the impost levied by s. 62 of the Act, specifically whether it is a tax on land within entry 49 of List II of the Seventh Schedule.",
      "framed_by": "appellant"
    },
    {
      "id": "i2",
      "text": "Whether the tax actually imposed on the Kharma market infringes Art. 14 of the Constitution.",
      "framed_by": "appellant"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The Assam legislature had no legislative competence to tax markets, as there is no entry in List II for tax on markets as such; markets and fairs appear at item 28 of List II, and item 66 allows only fees.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "Seventh Schedule List II items 28, 49, 66"
    },
    {
      "id": "pa2",
      "text": "The tax imposed on Kharma market infringes Art. 14 as the board fixed a high rate arbitrarily, discriminating against appellant's market as against neighbouring markets where tax was lower.",
      "supporting_facts": [
        "f2",
        "f3",
        "f9"
      ],
      "legal_basis": "Article 14 of the Constitution"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The State legislature was competent to impose the tax under entry 49 of List II as it is a tax on land.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "Seventh Schedule List II entry 49"
    },
    {
      "id": "ra2",
      "text": "No discrimination under Art. 14 as tax imposed in accordance with rule prescribing Rs. 1000/- maximum and graduated according to size and importance of market; appellant failed to show discrimination.",
      "supporting_facts": [
        "f8",
        "f9"
      ],
      "legal_basis": "s. 62 of the Act; Rule 300 framed under s. 63; Article 14"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Entries in legislative lists interpreted in widest amplitude; tax on land under entry 49 List II may be based on annual value/use to which land is put; scheme of s. 62 shows tax is on land used as market, not on market/transactions/business therein, as tax paid by owner/occupier of land, licence for use of land, depends on area/size/importance.",
      "addresses_issue": "i1",
      "key_observation": "The tax provided by s. 62 is a tax on land, though its incidence depends upon the use of the land as a market."
    },
    {
      "id": "cr2",
      "text": "Appellant alleging Art. 14 violation must produce facts/figures showing discrimination; no such material adduced re relative size/importance of five markets; board graduated tax per rule according to size/importance; cannot hold discrimination.",
      "addresses_issue": "i2",
      "key_observation": "As there is no material before us by which we can judge the relative size and importance of the five markets, it is not possible to hold that there was discrimination."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The impost under s. 62 is a tax on land within entry 49 List II, within competence of State legislature.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "No violation of Art. 14 as appellant failed to show discrimination in fixation of tax.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Ralla Ram v. The Province of East Punjab",
      "citation": "1948 F.C.R. 207",
      "treatment": "followed",
      "relevance": "Tax on land may be based on annual value and would still be tax on land, not on income; use of land can be taken into account."
    }
  ],
  "statutes_cited": [
    {
      "name": "Assam Local Self-Government Act, No. XXV of 1953",
      "sections": [
        "s. 62",
        "s. 63"
      ],
      "relevance": "Imposes annual tax on land used as market; scheme analyzed to hold it is tax on land."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 14",
        "Art. 132",
        "Seventh Schedule List II entry 49, item 28, item 66"
      ],
      "relevance": "Art. 14 on equality; legislative competence under List II; certificate under Art. 132."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal is dismissed upholding the judgment of the Assam High Court; the tax under s. 62 of the Assam Local Self-Government Act, 1953 is held constitutional, being a tax on land within legislative competence and not violative of Art. 14.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"the tax provided therein is a tax on land, though its incidence depends upon the use of the land as a market.\"",
      "speaker": "court",
      "significance": "Core holding on legislative competence."
    },
    {
      "text": "\"It is well-settled that it is for the person who alleges that equality before law has been infringed to show that such really is the case.\"",
      "speaker": "court",
      "significance": "Burden of proof under Art. 14."
    },
    {
      "text": "\"Rs. 1000/- (Rupees one thousand only) per annum has been fixed as the maximum amount of tax which may be levied by the local boards in Assam on markets licensed under section 62 of the Act.\"",
      "speaker": "court",
      "significance": "Quotes the rule justifying graduated taxation."
    }
  ],
  "_case_id": "1965_269",
  "_label": 0,
  "_text_length": 14370,
  "_extracted_at": "2026-02-10T19:27:39.963409"
}