{
  "metadata": {
    "case_name": "Appellant (Manufacturer of Chloral Hydrate) v. State of Andhra Pradesh",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "Wanchoo, J."
    ],
    "case_number": "Civil Appeal No. 649 of 1964",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The appellant manufactures drugs in Hyderabad and among the drugs manufactured by it is chloral hydrate.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "In September 1962, the State of Andhra Pradesh issued rules called the Andhra Pradesh Telangana Area Chloral Hydrate (Chloral) Rules, 1962 with respect to manufacture, possession, sale, import, export and transport of chloral hydrate.",
      "type": "material",
      "date": "1962-09",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The Rules provide that the manufacture of chloral hydrate shall take place only in accordance with the conditions of a licence granted by the Excise Commissioner and only on payment of excise duty of Rs. 500/- per annum. The Rules also provide for possession, import, export, sale and transport of chloral hydrate.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The Rules were issued under the Andhra Pradesh Telangana Area Intoxicating Drugs Act, No. IV of 1333 Fasli (1333-F Act) as amended by the Hyderabad Opium and Intoxicating Drugs Amendment Act, No. XXII of 1953.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "In consequence of the issue of the Rules, the appellant was called upon to take out a licence and pay the necessary excise duty. The appellant refused to do so.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "In November 1962, the appellant filed a writ petition (W.P. No. 1061 of 1962) in the Andhra Pradesh High Court challenging inter alia the validity of the Rules.",
      "type": "procedural",
      "date": "1962-11",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "The Andhra Pradesh High Court dismissed the writ petition by judgment and order dated March 30, 1963.",
      "type": "procedural",
      "date": "1963-03-30",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "The appellant applied for a certificate for leave to appeal to the Supreme Court, which was refused, but obtained special leave from this Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "The appellant in its writ petition admitted that chloral hydrate was used in small doses as a hypnotic and sedative.",
      "type": "admitted",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f10",
      "text": "Chloral hydrate has been notified by the Government of Andhra Pradesh as an intoxicating drug within the meaning of the amended 1333-F Act.",
      "type": "material",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f11",
      "text": "The State Government's case is that chloral hydrate is a narcotic drug or a narcotic within the meaning of entry 51 of List II of the Seventh Schedule, increases intoxication if mixed with liquor, and is being produced in large quantities to be mixed with liquor.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f12",
      "text": "The appellant holds a licence under the Drugs Act and rules framed thereunder for manufacturing chloral hydrate.",
      "type": "background",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the 1333-F Act had been repealed in toto on the introduction of the Dangerous Drugs Act, No. 2 of 1930 by the Opium and Revenue Laws (Extension of application) Act, No. 33 of 1950, and of the Drugs Act, No. 23 of 1940 by the Part B States (Laws) Act, No. III of 1951, and therefore there was no power in the Hyderabad legislature to amend it by Act 22 of 1953, and consequently no law in force on the basis of which the Rules could be promulgated in 1962.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether the Rules framed by the State of Andhra Pradesh in 1962 with respect to chloral hydrate were within the powers conferred by the 1333-F Act as amended in 1953, as chloral hydrate was not a narcotic or narcotic drug and was not covered by item 51 of List II of the Seventh Schedule to the Constitution.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The 1333-F Act had been repealed in toto on the introduction of the Dangerous Drugs Act, No. 2 of 1930 and the Drugs Act, No. 23 of 1940, and therefore there was no power in the Hyderabad legislature to amend it by Act 22 of 1953. In consequence there was no law in force on the basis of which the Rules could be promulgated in 1962.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": "Opium and Revenue Laws (Extension of application) Act, No. 33 of 1950; Part B States (Laws) Act, No. III of 1951"
    },
    {
      "id": "pa2",
      "text": "Even if the 1333-F Act did not stand repealed as above, the Rules framed by the State of Andhra Pradesh in 1962 with respect to chloral hydrate were not within the powers conferred by the 1333-F Act as amended in 1953, as chloral hydrate was not a narcotic or narcotic drug and was not covered by item 51 of List II of the Seventh Schedule to the Constitution.",
      "supporting_facts": [
        "f2",
        "f3",
        "f9"
      ],
      "legal_basis": "Item 51, List II, Seventh Schedule to the Constitution"
    },
    {
      "id": "pa3",
      "text": "Chloral hydrate is not a narcotic or a narcotic drug within the meaning of entry 51 of List II.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": "Affidavit of State; Medicinal and Toilet Preparations (Excise Duties) Act, 16 of 1955"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "There was no repeal of the 1333-F Act by the introduction of the Dangerous Drugs Act 1930 and the Drugs Act, 1940, and consequently the amendment of the 1333-F Act by the Hyderabad Act No. 22 of 1953 was good, and the 1333-F Act as amended was in force in 1962 when the Rules were framed.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": "Dangerous Drugs Act, 1930; Drugs Act, 1940"
    },
    {
      "id": "ra2",
      "text": "The Rules were intra vires the 1333-F Act as amended in 1953 as chloral hydrate was a narcotic and an intoxicating drug.",
      "supporting_facts": [
        "f10",
        "f11"
      ],
      "legal_basis": "1333-F Act as amended; Item 51, List II, Seventh Schedule"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The introduction of the Dangerous Drugs Act in the Part B State of Hyderabad in 1950 did not result in complete effacement of the 1333-F Act. It remained alive even so far as opium, charas, bhang and ganja were concerned for the purpose of collection of duties of excise thereon. It also remained alive with respect to other substances which might be notified as intoxicating drugs under the 1333-F Act.",
      "addresses_issue": "i1",
      "key_observation": "A substance can come both under the Dangerous Drugs Act as well as under entry 51 of List II for duties of excise."
    },
    {
      "id": "cr2",
      "text": "The Drugs Act of 1940 is mainly concerned with standard and quality of drugs and has nothing to do with duties of excise. The introduction of the Drugs Act would not affect that part of the 1333-F Act which dealt with collection of duties of excise. The 1333-F Act continued in existence so far as it dealt with collection of duties of excise on substances covered by it and could therefore be amended by Hyderabad Act No. 22 of 1953.",
      "addresses_issue": "i1",
      "key_observation": "Narcotics and narcotic drugs are liable to duties of excise under entry 51 of List II, which can only be imposed by the State."
    },
    {
      "id": "cr3",
      "text": "Chloral hydrate is a narcotic or a narcotic drug within the meaning of entry 51 of List II of the Seventh Schedule as it is hypnotic and sedative, relieves pain, produces sleep, and in large doses brings on stupor, coma, and even death. It also has intoxicating effect when mixed with liquor and so is an intoxicating drug within the meaning of the amended Act.",
      "addresses_issue": "i2",
      "key_observation": "Dictionary meaning of narcotic; admission by appellant."
    },
    {
      "id": "cr4",
      "text": "The Rules provide for manufacture under licence and payment of duties of excise of Rs. 500 per year, which is within power if chloral hydrate is narcotic.",
      "addresses_issue": "i2",
      "key_observation": "State can impose excise duties and incidental control."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The 1333-F Act was not completely repealed by the Dangerous Drugs Act 1930 or Drugs Act 1940, and survived for purposes of excise duties.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Chloral hydrate is a narcotic drug within entry 51 List II, and an intoxicating and narcotic substance under the amended 1333-F Act; Rules are intra vires.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Andhra Pradesh Telangana Area Intoxicating Drugs Act, No. IV of 1333 Fasli (1333-F Act)",
      "sections": [
        "S. 2",
        "S. 4",
        "S. 5",
        "Ss. 7 to 11",
        "S. 16",
        "S. 17"
      ],
      "relevance": "Basis for framing Rules; survived repeal for excise duties; amended to include notified intoxicating drugs."
    },
    {
      "name": "Hyderabad Opium and Intoxicating Drugs Amendment Act, No. XXII of 1953",
      "sections": [
        "S. 2(1)(iv)",
        "S. 2(2)"
      ],
      "relevance": "Amended definition of intoxicating drugs to include notified narcotic substances."
    },
    {
      "name": "Dangerous Drugs Act, No. 2 of 1930",
      "sections": [
        "S. 39(1)"
      ],
      "relevance": "Does not repeal state excise laws; applies to specific drugs but states retain excise power."
    },
    {
      "name": "Drugs Act, No. 23 of 1940",
      "sections": [
        "S. 2"
      ],
      "relevance": "Concerns standards and quality, not excise duties; in addition to other laws."
    },
    {
      "name": "Opium and Revenue Laws (Extension of application) Act, No. 33 of 1950",
      "sections": [
        "S. 4"
      ],
      "relevance": "Extended central acts but repealed only corresponding laws, not excise parts."
    },
    {
      "name": "Part B States (Laws) Act, No. III of 1951",
      "sections": [
        "S. 6"
      ],
      "relevance": "Extended Drugs Act but did not repeal excise provisions."
    },
    {
      "name": "Medicinal and Toilet Preparations (Excise Duties) Act, No. 16 of 1955",
      "sections": null,
      "relevance": "Definition of narcotic specific to that Act; chloral hydrate not covered as medicinal prep under it."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Item 59 List I",
        "Item 8 List II",
        "Item 51 List II",
        "Item 19 List III, Seventh Schedule"
      ],
      "relevance": "Governs legislative competence for drugs, narcotics, excise duties."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court dismissed the appeal by special leave, upholding the Andhra Pradesh High Court's dismissal of the writ petition challenging the validity of the Chloral Hydrate Rules, 1962, holding the Rules intra vires the 1333-F Act as amended.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"Obviously, therefore, if chloral hydrate is hypnotic and sedative as admitted by the appellant, it would be a narcotic.\"",
      "speaker": "court",
      "significance": "Determines chloral hydrate as narcotic under entry 51 List II."
    },
    {
      "text": "\"The introduction of the Dangerous Drugs Act in the Part B State of Hyderabad in 1950 did not result in complete effacement of the 1333-F Act.\"",
      "speaker": "court",
      "significance": "Rejects repeal argument, preserves state excise power."
    },
    {
      "text": "\"There can be no other conclusion on the evidence in the present case than that chloral hydrate is a narcotic or a narcotic drug within the meaning of entry 51 of List II of the Seventh Schedule.\"",
      "speaker": "court",
      "significance": "Key finding upholding Rules."
    }
  ],
  "_case_id": "1965_65",
  "_label": 0,
  "_text_length": 23866,
  "_extracted_at": "2026-02-10T19:25:03.284776"
}