{
  "metadata": {
    "case_name": "Appellants v. Col. Lal Rampal Singh",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "Sarkar, J."
    ],
    "case_number": "Civil Appeal No. 736 of 1963",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "This is the third case in the series arising out of a petition for a writ of certiorari moved in the High Court of Madhya Pradesh to quash certain orders reducing the pension granted to the respondent Col. Lal Rampal Singh by an order of the Ruler of Rewa before that State had merged in the United State of Vindhya Pradesh.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The High Court of Madhya Pradesh took the same view as in the Nagod case Civil Appeal No. 738 of 1963.",
      "type": "procedural",
      "date": "1960-11-12",
      "source": "lower_court"
    },
    {
      "id": "f3",
      "text": "The subsequent fortunes of the United State have been described in the Nagod case judgment.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The respondent held various offices in the Government of Rewa.",
      "type": "background",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f5",
      "text": "By an order made on April 3, 1948 and published in an extraordinary issue of the Rewa Raj Gazette, the Ruler stated that Col. Lal Rampal Singh entered State service on 21st November, 1922 and he is now anxious to retire. I find that he has put in a service of more than 25 years up to date, and, as such, he is allowed to retire on a full pension of Rs. 350 per month of his last grade, as a special case with effect from the date of this order, and the so-called breaks in his service, if there be any, are hereby condoned.",
      "type": "material",
      "date": "1948-04-03",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "In Rewa the Ruler had made a set of rules, called Rewa State Pension and Gratuity Rules for grant of pension to Rewa State Civil Servants. The Ruler was not bound by those Rules as he was a sovereign Ruler.",
      "type": "background",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f7",
      "text": "The Indian Union had paid the respondent in terms of the order up to March 27, 1953.",
      "type": "material",
      "date": "1953-03-27",
      "source": "respondent"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the order of the Ruler of Rewa dated April 3, 1948 is law.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "If the order is not a law, whether it was a grant accepted by the Indian Union through payment up to March 27, 1953, depriving the respondent of his right of property under the grant.",
      "framed_by": "respondent"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The order of April 3, 1948 is not a law but an executive order passed in terms of the Rewa State Pension and Gratuity Rules and is open to the succeeding Government to set aside by another executive order.",
      "supporting_facts": [
        "f5",
        "f6"
      ],
      "legal_basis": "Rewa State Pension and Gratuity Rules"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The order of April 3, 1948 is a law which can only be altered by another law duly passed by the Union or other competent legislature.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "If the order was not a law, it was a grant and as the Indian Union had paid the respondent in terms of the order up to March 27, 1953, it must be deemed to have accepted that grant and it cannot deprive the respondent of his right of property under the grant.",
      "supporting_facts": [
        "f5",
        "f7"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "From the terms of the order, the Ruler purported to act under the Rewa State Rules, as appears from the reference to full pension, condonation of the breaks in his service and special case. The Order also granted certain advance increments which could only have been done to justify the full pension of Rs. 350 per month under the Rules. Under the Rules the respondent would have been entitled to a smaller pension in view of the breaks and if the increments had not been granted. The Ruler was therefore not acting in the exercise of his sovereign power and in disregard of the Rules but purporting to act in terms of the Rules.",
      "addresses_issue": "i1",
      "key_observation": "The Order of April 3, 1948 is not a law but an executive order passed in terms of the Rules."
    },
    {
      "id": "cr2",
      "text": "It is open to the succeeding Government to set aside that order by another executive order. The respondent's rights under the Rewa State Rules, accepting it as a law binding on the Indian Union, are not in the least affected. He is, however, not entitled to any rights except those which the Rules justify.",
      "addresses_issue": "i1",
      "key_observation": "The first contention of the respondent that the order of April 3, 1948 is a law which can only be altered by another law must fail."
    },
    {
      "id": "cr3",
      "text": "What the Ruler did by his order of April 3, 1948 does not appear to have been to make a grant but to have passed an order purporting to act under the Rules. If that order was not justified by the Rules, it was illegal and is liable to be set aside by another order duly made under them. Pension is furthermore normally always a matter of grace when there is no law governing. It is implicit in the grant of a pension that it may be subsequently reviewed. Therefore the grant of the pension-assuming that to be the correct view to take-must always have been subject to alteration. The succeeding State was hence competent to review the order even if it had paid the pension for sometime in terms of it.",
      "addresses_issue": "i2",
      "key_observation": "The contention that it was a grant accepted by payment is ill-founded."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The Order of April 3, 1948 is not a law but an executive order passed in terms of the Rewa State Pension and Gratuity Rules. It is open to the succeeding Government to set aside that order by another executive order.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "The order was not a grant but an order under the Rules, and even if a grant, pension is a matter of grace subject to review.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Nagod case",
      "citation": "Civil Appeal No. 738 of 1963",
      "treatment": "referred",
      "relevance": "High Court took same view as in Nagod case; subsequent fortunes of United State described there; judgment delivered earlier in the day."
    }
  ],
  "statutes_cited": [
    {
      "name": "Rewa State Pension and Gratuity Rules",
      "sections": [],
      "relevance": "Ruler purported to act under these rules; order is executive order in terms of the rules; respondent's rights limited to what rules justify."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "The appeal is allowed. The order of the High Court is set aside implicitly by allowing the appeal against its view that the Ruler's order was law.",
    "relief_granted": "Appeal allowed",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "It has to be held that the Order of April 3, 1948 is not a law but an executive order passed in terms of the Rules. It is open to the succeeding Government to set aside that order by another executive order.",
      "speaker": "court",
      "significance": "Core holding on the nature of the Ruler's order."
    },
    {
      "text": "Pension is furthermore normally always a matter of grace when there is no law governing. It is implicit in the grant of a pension that it may be subsequently reviewed.",
      "speaker": "court",
      "significance": "Rejects the grant argument and affirms reviewability of pension."
    }
  ],
  "_case_id": "1965_328",
  "_label": 1,
  "_text_length": 4607,
  "_extracted_at": "2026-02-10T19:28:08.778811"
}