{
  "metadata": {
    "case_name": "Assessee v. Revenue",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "Sikri, J."
    ],
    "case_number": "Civil Appeal No. 853 of 1964",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant is the youngest son of T. V. Sundaram Ayyangar, who was the Karta of a Hindu undivided family.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Partial partition of the family; 150 shares of Rs. 1,000 each in T. V. Sundaram Iyengar and Sons Limited divided equally among coparceners, assessee getting 25 shares of Rs. 25,000.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "With the shares as nucleus, assessee acquired house properties, shares and deposits up to March 31, 1952.",
      "type": "material",
      "date": "1952-03-31",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Assessee was Service Manager of the private limited company and received substantial remuneration.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "First son, Venugopal, born to assessee on December 11, 1952; conception sometime in March, 1952.",
      "type": "material",
      "date": "1952-12-11",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "For assessment year 1952-53, assessee assessed as individual with all sources of income.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "For assessment year 1953-54 (accounting year April 1, 1952 to March 31, 1953), assessee claimed income from all sources except salary assessable in hands of HUF consisting of himself and son Venugopal, which came into existence in or about March 1952 when son conceived.",
      "type": "disputed",
      "date": "1952-04-01",
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "Income Tax Officer recognised HUF only from date of birth, December 11, 1952; assessed income other than salary as individual till then.",
      "type": "procedural",
      "date": "1952-12-11",
      "source": "prosecution"
    },
    {
      "id": "f9",
      "text": "Appellate Assistant Commissioner upheld ITO's view.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Assessee failed before Income Tax Appellate Tribunal.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "High Court answered the question against the assessee in reference under S. 66(1) of the Act (Case Referred No. 86 of 1957, judgment dated August 9, 1961).",
      "type": "procedural",
      "date": "1961-08-09",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Appeal to Supreme Court by certificate of Madras High Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the assessment of the income of the assessee, other than his salary, in the hands of the assessee as an individual and not as a Hindu undivided family till 11th December, 1952, for the assessment year 1953-54 is valid.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Under the Indian Income Tax Act, 1922, Hindu undivided family is a separate unit; to determine existence and date of coming into being, principles of Hindu Law apply as Act lays down no principles.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "Hindu Law"
    },
    {
      "id": "pa2",
      "text": "According to Hindu Law, a son conceived has same rights of property as living son; this is substantive rule, not fiction; joint Hindu family comes into existence from date son conceived (March 1952), so HUF existed from beginning of accounting year 1952-53.",
      "supporting_facts": [
        "f5",
        "f7"
      ],
      "legal_basis": "Hindu Law"
    },
    {
      "id": "pa3",
      "text": "Alternatively, status at end of accounting year determines; child in existence at end, so HUF status; whole income assessable to HUF.",
      "supporting_facts": [
        "f5",
        "f7"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Doctrine of Hindu Law that son conceived has rights applies only for special purpose to safeguard son's rights to property; not of universal application.",
      "supporting_facts": [],
      "legal_basis": "Hindu Law; C.B.C. Deshmukh v. I. Mallappa Chanbasappa"
    },
    {
      "id": "ra2",
      "text": "Act concerned with realities; person to whom income accrues must be visible reality; only assessee existed till December 11, 1952.",
      "supporting_facts": [
        "f5",
        "f8"
      ],
      "legal_basis": "Sections 3, 4 of Indian Income Tax Act, 1922"
    },
    {
      "id": "ra3",
      "text": "Applying fiction would introduce anomalies in working of Act; difficulties with return forms (Part IIIA requires names, ages of members at end of previous year).",
      "supporting_facts": [],
      "legal_basis": "Section 22 of Act; prescribed return form"
    },
    {
      "id": "ra4",
      "text": "Alternative point not raised earlier; even if HUF existed at end, income accrued earlier to assessee as individual; Act disregards subsequent application.",
      "supporting_facts": [
        "f5",
        "f7"
      ],
      "legal_basis": "Sections 3, 4 of Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Doctrine of Hindu Law that son in womb equal in respects to living son for inheritance, partition etc., but not universal; refused extension to adoption in Deshmukh case as it would lead to anomalies.",
      "addresses_issue": "i1",
      "key_observation": "Doctrine mainly for determining rights to property and safeguarding son's rights."
    },
    {
      "id": "cr2",
      "text": "Doctrine does not fit scheme of Income Tax Act; Legislature did not intend to incorporate it; Sections 3 and 4 charge income of existing entities (individual, HUF etc.); income accrues day-to-day to known entity.",
      "addresses_issue": "i1",
      "key_observation": "At relevant time, only assessee existed till birth."
    },
    {
      "id": "cr3",
      "text": "Section 22 requires returns from persons with income; if HUF from conception, assessees could not file returns timely (e.g., uncertainty of child's gender); return form assumes members in existence at end of year with names, ages.",
      "addresses_issue": "i1",
      "key_observation": "Difficult to reconcile doctrine with Act's provisions; introduces uncertainties."
    },
    {
      "id": "cr4",
      "text": "No rights of son affected by not recognising for s.3 till born; income-tax liability not to be imposed on unborn.",
      "addresses_issue": "i1",
      "key_observation": "Even if HUF at end of year, prior accrued income remains assessee's."
    },
    {
      "id": "cr5",
      "text": "Alternative point not raised earlier; even if considered, income accrued to assessee till birth; Act disregards subsequent events.",
      "addresses_issue": "i1",
      "key_observation": "Birth creates HUF but does not retroactively change prior accruals."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Doctrine of Hindu Law regarding son conceived not applicable for determining coming into being of HUF as assessable entity under Income Tax Act.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Assessment of assessee's income other than salary as individual till December 11, 1952, for AY 1953-54 valid.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "C. B. C. Deshmukh v. I. Mallappa Chanbasappa",
      "citation": "A.I.R. 1964 S.C. 510",
      "treatment": "followed",
      "relevance": "Scope of Hindu Law doctrine that son in womb equal to living son; not extended to adoption; not universal."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income Tax Act, 1922",
      "sections": [
        "Section 3",
        "Section 4",
        "Section 22",
        "Section 66(1)"
      ],
      "relevance": "Charging sections for individuals/HUFs; accrual of income; notices/returns; reference to High Court."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal dismissed; agreed with High Court that assessment as individual till birth of son on December 11, 1952, valid; question answered in favour of revenue.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"the doctrine is not of universal application and it applies mainly for the purpose of determining rights to property and safeguarding such rights of the son.\"",
      "speaker": "court",
      "significance": "Limits scope of Hindu Law doctrine."
    },
    {
      "text": "\"Income-tax is a liability and it could not have been the intention of the legislature to impose a liability on persons yet unborn.\"",
      "speaker": "court",
      "significance": "Rejects applying doctrine to tax assessment."
    },
    {
      "text": "\"The Act disregards subsequent application of income and profits once they have arisen.\"",
      "speaker": "court",
      "significance": "Prior accruals not affected by later HUF formation."
    }
  ],
  "_case_id": "1965_155",
  "_label": 0,
  "_text_length": 11741,
  "_extracted_at": "2026-02-10T19:26:19.834381"
}