{
  "metadata": {
    "case_name": "Commissioner of Income Tax v. Bharat Carbon Ribbon Manufacturing Co.",
    "case_year": 1965,
    "court": "Supreme Court of India",
    "judges": [
      "Sikri, J."
    ],
    "case_number": "Civil Appeal No. 106 of 1965",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The assessee is a public limited company dealing in the manufacture and sale of stationery goods. Before the partition of the Country the company's registered office as well as the head office was at Lahore.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Assessment year 1947-48, the accounting period being the calendar year ending 31st December, 1946.",
      "type": "background",
      "date": "1946-12-31",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The assessee had paid advance tax under Section 18-A of the Indian Income Tax Act to the tune of Rs. 36,783/6/- between June 1946 and March 1947. This tax was paid under the Indian Income-tax Act to the Income-tax Officer, Lahore.",
      "type": "admitted",
      "date": "1946-06 to 1947-03",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The assessment for the year 1947-48 was completed by the Pakistan Income-tax Officer on the 28th January, 1948 on a total income of Rs. 1,22,014 for Income tax and Rs. 52,780 for capital gains. He worked out the total tax payable by the assessee at Rs. 76,472/6. As a result of this assessment, even after setting off the tax paid under Section 18-A of Rs. 47,513 an amount of Rs. 20,000 was still due from this assessee.",
      "type": "material",
      "date": "1948-01-28",
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "The assessment for the year 1947-48 was also made by the Income-tax Officer 3rd Additional Business Circle, New Delhi on a figure of Rs. 38,916.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The Income-tax Officer, New Delhi, by his order dated March 1952, determined the total income of the assessee at Rs. 38,916 and directed that demand notice and chalan be issued.",
      "type": "procedural",
      "date": "1952-03",
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Appellate Assistant Commissioner disallowed the claim for credit of advance tax paid in Lahore, holding that the amount had been adjusted by Pakistan authorities towards the payment of tax.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Appellate Tribunal allowed the assessee's claim on the ground that the language of s. 18A(11) was mandatory, and it was the duty of the Income-tax authorities to give credit for the amount paid by the assessee as advance tax in the regular assessment made under the Indian Income Tax Act.",
      "type": "procedural",
      "date": null,
      "source": "tribunal"
    },
    {
      "id": "f9",
      "text": "At the instance of the Commissioner of Income Tax a reference was made to the High Court under s.66(1) of the Income Tax Act, 1922.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "High Court answered both questions in the affirmative in favor of the assessee.",
      "type": "procedural",
      "date": "1962-11-13",
      "source": "high_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the assessee was entitled to have an adjustment of the advance tax paid by it under Section 18-A of the Indian Income-tax Act in Lahore for the assessment year 1947-48 against the demand of tax raised by the Income-tax Officer 3rd Additional Business Circle, New Delhi for the assessment year 1947-48?",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the order of the Tribunal directing a refund to the assessee out of the advance tax paid by him in Lahore is legal and valid?",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "By virtue of s. 18(3) of the Indian Independence Act, the Income Tax Act as it existed before the coming into force of the Indian Independence Act, applied both to the Dominion of Pakistan and the Dominion of India, and the result of this simultaneous application to both the Dominions was that the advance tax paid by the assessee was liable to be adjusted against the assessments made both in Pakistan and in India, and Pakistan having made the adjustment, there was no money left to be adjusted against the assessment in India.",
      "supporting_facts": [
        "f3",
        "f4"
      ],
      "legal_basis": "Section 18(3) of the Indian Independence Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "If the direction contained in s. 18A(11) had to be obeyed, credit had necessarily to be given to the assessee at the time of regular assessment. What may have been done by the Pakistan authorities in January, 1948, cannot be called a proceeding under the Indian Income Tax Act and the fact that the money paid by the assessee under the Indian Income Tax Act may have been seized by the Pakistan authorities or disposed of in some other manner, can in no way affect the right of the assessee under the Indian Income-tax Act.",
      "supporting_facts": [
        "f3",
        "f6"
      ],
      "legal_basis": "Section 18A(11) of the Income Tax Act, 1922; Dwarka Dass v. Income-tax Officer, Kanpur"
    },
    {
      "id": "ra2",
      "text": "It was the obligation of the Government of India under s. 9 of the Indian Independence (Rights, Property and Liabilities) Order, 1947, either to refund the money paid as advance tax or to give credit in the assessment in India.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": "Section 9 of the Indian Independence (Rights, Property and Liabilities) Order, 1947"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The effect of s. 18(3) of the Indian Independence Act was to change the incidents of the advance tax paid. Previously the advance tax was to be adjusted towards a single regular assessment to be made by British India. After the Indian Independence Act the advance tax was liable to be adjusted against two regular assessments, one by India and one by Pakistan. In Pakistan, under s. 18A(11), the Pakistan Government was entitled to adjust the advance tax paid by the assessee against its demand. Similarly, the Government of India was entitled to adjust the amount against its demand.",
      "addresses_issue": "i1",
      "key_observation": "It follows that if the assessee has been given credit for the advance tax by the Pakistan Government, he cannot claim that credit should be given to him by the Indian Income Tax authorities. The effect of the Indian Independence Act was not to double the advance money the assessee had paid."
    },
    {
      "id": "cr2",
      "text": "Dwarka Dass case is distinguishable because that case proceeded on the assumption that no regular assessments had been made in Pakistan for the relevant years and only some assessment proceedings were pending.",
      "addresses_issue": "i1",
      "key_observation": "Here the Pakistan authorities had made a regular assessment and had adjusted the advance tax paid by the assessee."
    },
    {
      "id": "cr3",
      "text": "By virtue of the simultaneous application of the Indian Income Tax Act in both the Dominions, there was a statutory modification of the incidents of the advance tax paid by the assessee.",
      "addresses_issue": "i1",
      "key_observation": "In this view it is not necessary to consider the interpretation of s. 9 of the Indian Independence (Rights, Property and Liabilities) Order, 1947."
    },
    {
      "id": "cr4",
      "text": "The answer to the second question depends on the answer to the first question.",
      "addresses_issue": "i2",
      "key_observation": "As the High Court rightly observed."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The assessee was not entitled to adjustment of the advance tax paid in Lahore against the Indian demand; the Tribunal's order directing refund is not legal and valid.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Answer to the questions should be in the negative and against the assessee.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Dwarka Dass v. Income-tax Officer, Kanpur",
      "citation": "29 I.T.R. 60",
      "treatment": "distinguished",
      "relevance": "Distinguishable because no regular assessments made in Pakistan in that case, unlike here where Pakistan made regular assessment and adjusted advance tax."
    }
  ],
  "statutes_cited": [
    {
      "name": "Income Tax Act, 1922",
      "sections": [
        "Section 18A",
        "Section 18A(11)",
        "Section 66(1)"
      ],
      "relevance": "Advance tax paid under s.18A to be treated as payment of tax and credit given in regular assessment under s.18A(11); reference under s.66(1)."
    },
    {
      "name": "Indian Independence Act, 1947",
      "sections": [
        "Section 18(3)"
      ],
      "relevance": "Caused simultaneous application of Income Tax Act to both India and Pakistan, modifying incidents of advance tax to be adjustable against both assessments."
    },
    {
      "name": "Indian Independence (Rights, Property and Liabilities) Order, 1947",
      "sections": [
        "Section 9"
      ],
      "relevance": "Mentioned by respondent but not considered necessary due to statutory modification under Indian Independence Act."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "The Supreme Court allowed the appeal by special leave, reversed the High Court's judgment, and held that the answers to the referred questions should be in the negative and against the assessee, as the advance tax had already been adjusted by Pakistan authorities.",
    "relief_granted": "None to assessee; credit disallowed.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"It follows that if the assessee has been given credit for the advance tax by the Pakistan Government, he cannot claim that credit should be given to him by the Indian Income Tax authorities.\"",
      "speaker": "court",
      "significance": "Core holding on effect of partition and dual adjustment."
    },
    {
      "text": "\"The effect of the Indian Independence Act was not to double the advance money the assessee had paid. The amount of money he paid as advance tax remained the same.\"",
      "speaker": "court",
      "significance": "Explains statutory modification of advance tax incidents post-partition."
    },
    {
      "id": "kq3",
      "text": "\"What the Income tax authorities would do or may have done to the advance tax paid to the Income-tax Officer, Lahore, is entirely immaterial.\"",
      "speaker": "tribunal",
      "significance": "Tribunal's view overturned by Supreme Court."
    }
  ],
  "_case_id": "1965_86",
  "_label": 1,
  "_text_length": 9715,
  "_extracted_at": "2026-02-10T19:25:39.792578"
}