{
  "metadata": {
    "case_name": "Maharani Mandalsa Kumari Debi & Ors. v. Ramnarain Private Ltd.",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "Bachawat, J."
    ],
    "case_number": "Civil Appeal No. 130 of 1964",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Maharaja Sir Rajendra Prakash Bahadur Maharaja of Sirmur, Maharani Mandalsa Kumari Debi Rajmata of Sirmur, Maharani Premlata Debi of Chhota Udaipur, Maiyan Sahiba Sheba Kumari Debi of Jharipani, Major Rao Raja Sirendra Singh, Jagat Pershad, Shib Chander Kumar, Praduman Kumar and Dayawati Rani carried on business in partnership under the firm name Messrs. Jagatsons International Corporation at New Delhi.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Respondent No. 1, Ramnarain Private Ltd. instituted Summary Suit No. 162 of 1957 against Messrs. Jagatsons International Corporation on the Original Side of the Bombay High Court claiming Rs. 1,96,831.58 N.P. based on agreement dated September 26, 1956, whereby respondent No. 1 agreed to provide finance to the firm.",
      "type": "material",
      "date": "1957",
      "source": "respondent"
    },
    {
      "id": "f3",
      "text": "No consent of the Central Government obtained for institution of suit though Maharaja of Sirmur is a Ruler of former Indian State within s. 87B CPC.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Summons served on Shib Chander Kumar as partner and person having control or management of partnership business.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "On July 15, 1957, firm admitted liability and applied for installments; Court passed decree for Rs. 1,89,643.98 N.P. and interest, payable in installments.",
      "type": "procedural",
      "date": "1957-07-15",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Firm committed defaults in payment of installments.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "On December 13, 1957, respondent No. 1 filed application under O. 21 r. 50(2) CPC for leave to execute decree against Maharani Mandalsa Kumari Debi, Maharani Premlata Debi, Maiyan Sahiba Sheba Kumari Debi, Major Rao Raja Sirendra Singh, Jagat Pershad, Praduman Kumar and Dayawati Rani as partners.",
      "type": "procedural",
      "date": "1957-12-13",
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "Opposite parties filed affidavit alleging: (1) suit incompetent without consent under s. 86 CPC; (2) Jagat Pershad and Shib Chander Kumar entered agreement fraudulently without authority and concealed suit, submitted to consent decree without authority.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "Single Judge by order dated March 18, 1958 rejected contentions, allowed application under O. 21 r. 50(2) CPC holding: absence of consent under s. 86/87B does not render decree nullity, objection not available in execution; merits not to be agitated in O. 21 r. 50(2).",
      "type": "procedural",
      "date": "1958-03-18",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Appeal by Maharani Mandalsa Kumari Debi, Maharani Premlata Debi, Major Rao Raja Sirendra Singh and Maiyan Sahiba Sheba Kumari Debi dismissed by High Court Bench on November 21, 1958 holding: decree against other partners valid though nullity against Maharaja; no other defences in O. 21 r. 50(2).",
      "type": "procedural",
      "date": "1958-11-21",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Appellants appeal to Supreme Court under certificate granted by High Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether suit against firm incompetent and decree void in absence of consent under s. 86 read with s. 87B CPC for Maharaja of Sirmur, a partner.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether decree against firm could be executed under O. 21 r. 50 CPC against other partners.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "What defences may be raised in application under O. 21 r. 50(2) CPC.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Suit against firm is suit against all partners; absence of consent under s. 86/87B renders suit incompetent against Maharaja and decree null and void.",
      "supporting_facts": [
        "f1",
        "f2",
        "f3"
      ],
      "legal_basis": "s. 86, s. 87B, O. 30 CPC"
    },
    {
      "id": "pa2",
      "text": "Consequently, suit against firm incompetent, decree wholly void, cannot be executed under O. 21 r. 50 CPC; application under O. 21 r. 50(2) not maintainable.",
      "supporting_facts": [
        "f5",
        "f7"
      ],
      "legal_basis": "O. 30, O. 21 r. 50 CPC"
    },
    {
      "id": "pa3",
      "text": "Entitled to dispute liability under O. 21 r. 50(2) on all grounds including fraud by Jagat Pershad and Shib Chander Kumar in entering agreement and concealing suit.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": "O. 21 r. 50(2) CPC"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "For purposes of suit under O. 30 CPC, firm is legal entity separate from partners; no consent under s. 86/87B required.",
      "supporting_facts": [
        "f2"
      ],
      "legal_basis": "O. 30 CPC; Dulichand Lakshminarayan v. CIT"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Suit against firm under O. 30 is really suit against all partners; firm name denotes partners; decree against firm is against all partners including Maharaja; absence of consent bars suit against Maharaja, decree nullity as to him.",
      "addresses_issue": "i1",
      "key_observation": "First contention sound."
    },
    {
      "id": "cr2",
      "text": "In abnormal cases where one partner immune (e.g., infant, deceased, sovereign), suit against firm competent, decree valid against other partners and assets; decree here to be amended excluding Maharaja; executable under O. 21 r. 50 against others.",
      "addresses_issue": "i2",
      "key_observation": "Second contention rejected; application maintainable."
    },
    {
      "id": "cr3",
      "text": "Under O. 21 r. 50(2), respondent may question partnership at accrual, collusion/fraud on decree, nullity, special protection; not merits or inter-partner disputes; no sufficient plea of fraud/collusion against respondent; appellants partners at accrual.",
      "addresses_issue": "i3",
      "key_observation": "Third contention rejected."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Suit/decree nullity insofar as against Maharaja of Sirmur for want of consent under s. 86/87B CPC.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Decree valid against firm other than Maharaja; executable against partnership property and other partners under O. 21 r. 50 CPC after amendment.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Defences under O. 21 r. 50(2) limited to partnership status, fraud/collusion on decree, nullity, special protection; not merits of claim or internal fraud.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Dulichand Lakshminarayan v. Commissioner of Income-tax, Nagpur",
      "citation": "1956 S.C.R. 156",
      "treatment": "referred",
      "relevance": "Firm sued in firm name as if corporate body for convenience under O. 30."
    },
    {
      "case_name": "Bhagwati Morarji Goculdas v. Alembic Chemical Works Co.",
      "citation": "1948 L.R. 75 I.A. 147",
      "treatment": "followed",
      "relevance": "Limited personality extended to firm for some purposes."
    },
    {
      "case_name": "Purushottam Umedbhai & Co. v. Manilal & Sons",
      "citation": "1961 1 S.C.R. 982",
      "treatment": "followed",
      "relevance": "Firm not legal entity; suit in firm name is suit by/against partners."
    },
    {
      "case_name": "Rodriguez v. Speyer Brothers",
      "citation": "1919 A.C. 59",
      "treatment": "followed",
      "relevance": "Suit by/against firm is really by/against all partners."
    },
    {
      "case_name": "Western National Bank of City of New York v. Perez, Triana & Co.",
      "citation": "1891 1 Q.B. 304",
      "treatment": "followed",
      "relevance": "Suing firm is suing partners individually."
    },
    {
      "case_name": "Lovell & Christmas v. Beauchamp",
      "citation": "1894 A.C. 607",
      "treatment": "followed",
      "relevance": "Judgment against firm is against members; valid against firm except immune partner (infant)."
    },
    {
      "case_name": "Gaekwar Baroda State Railway v. Hafiz Habib-Ul-Haq",
      "citation": "1938 L.R. 65 I.A. 182",
      "treatment": "followed",
      "relevance": "Suit really against sovereign barred without consent."
    },
    {
      "case_name": "Ellis v. Wadeson",
      "citation": "1899 1 Q.B. 714",
      "treatment": "referred",
      "relevance": "Suit against firm with deceased partner binds surviving partners, not deceased's estate."
    },
    {
      "case_name": "Gambhir Mal Pandiya v. J.K. Jute Mills Co. Ltd.",
      "citation": "1963 2 S.C.R. 190",
      "treatment": "followed",
      "relevance": "Defences under O. 21 r. 50(2): partnership, collusion/fraud, not re-trial of suit."
    }
  ],
  "statutes_cited": [
    {
      "name": "Code of Civil Procedure, 1908",
      "sections": [
        "s. 86",
        "s. 87B",
        "O. 30",
        "O. 30 r. 1",
        "O. 30 r. 2",
        "O. 30 r. 3",
        "O. 30 r. 4",
        "O. 30 r. 6",
        "O. 30 r. 9",
        "O. 21 r. 50",
        "O. 21 r. 50(2)"
      ],
      "relevance": "Governs suits against firms, consent for suits against Rulers, execution against partners."
    },
    {
      "name": "Indian Partnership Act, 1932",
      "sections": [
        "s. 4"
      ],
      "relevance": "Defines firm and partners."
    }
  ],
  "outcome": {
    "disposition": "partially_accepted",
    "summary": "Appeal partly allowed: accepted that decree nullity against Maharaja of Sirmur; rejected contentions that entire decree void or execution not maintainable against other partners; decree to be amended excluding Maharaja, executable against partnership assets and other partners under O. 21 r. 50; limited defences allowed under O. 21 r. 50(2).",
    "relief_granted": "Decree amended to exclude Maharaja; leave to execute against appellants upheld.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"A suit by or in the name of a firm is thus really a suit by or in the name of all its partners... So also a suit against the firm is really a suit against all the partners of the firm.\"",
      "speaker": "court",
      "significance": "Core reasoning on nature of suit against firm under O. 30 CPC."
    },
    {
      "text": "\"The legal fiction must not be carried too far. ... the firm is not a legal entity.\"",
      "speaker": "court",
      "significance": "Limits respondent's separate entity argument."
    },
    {
      "text": "\"Primarily the question to try would be whether the person against whom the decree is sought to be executed was a partner of the firm, when the cause of action accrued, but he may question the decree on the ground of collusion, fraud or the like but so as not to have the suit tried over again.\"",
      "speaker": "court",
      "significance": "Defines scope of defences under O. 21 r. 50(2) citing Gambhir Mal."
    }
  ],
  "_case_id": "1965_21",
  "_label": 0,
  "_text_length": 19443,
  "_extracted_at": "2026-02-10T19:25:06.506347"
}