{
  "metadata": {
    "case_name": "Legal Representatives of Ram Chand Kohli v. State of Uttar Pradesh & Ors.",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "Shah, J."
    ],
    "case_number": "Civil Appeal No. 659 of 1964",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "House No. 11, Kaiserbagh at Lucknow, was since 1918 in the occupation of one Chowdhry Akbar Hussain.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "After the partition of India, Chowdhry Akbar Hussain migrated to Pakistan.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "By order dated October 12, 1949 the Deputy Custodian of Evacuee Property, Lucknow, declared No. 11, Kaiserbagh as evacuee property under s. 6 of the U. P. Administration of Evacuee Property Ordinance 1 of 1949 (continued by Central Ordinances 12 and 20 of 1949).",
      "type": "procedural",
      "date": "1949-10-12",
      "source": "lower_court"
    },
    {
      "id": "f4",
      "text": "No claim was preferred by any person in pursuance of this notification, and management of the property continued with the Custodian of Evacuee Property.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Acting under s. 12 of the Displaced Persons Compensation and Rehabilitation Act 44 of 1954, the Central Government by notification dated May 27, 1955 acquired the property for the Central pool constituted under that Act.",
      "type": "procedural",
      "date": "1955-05-27",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "On June 7, 1957 the property was put up for sale by public auction and was purchased by one Ram Chand Kohli.",
      "type": "material",
      "date": "1957-06-07",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "On September 27, 1961 the State of Uttar Pradesh applied under s. 27 of the Administration of Evacuee Property Act 31 of 1950 invoking the revisional jurisdiction of the Custodian-General against the order of the Deputy Custodian notifying the property as evacuee property.",
      "type": "procedural",
      "date": "1961-09-27",
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "State of Uttar Pradesh claimed that the property belonged to the State and Chowdhry Akbar Hussain had no proprietary interest in the property and accordingly the Deputy Custodian had no power to declare it evacuee property. State was not aware of the notification declaring the property to be evacuee property, nor of the subsequent proceedings and of the sale to Ram Chand Kohli.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f9",
      "text": "The appellants who are the legal representatives of Ram Chand Kohli contended, inter alia, that the petition was belated, and that in any event the property being of the ownership of Chowdhry Akbar Hussain it was lawfully declared evacuee property.",
      "type": "admitted",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f10",
      "text": "The Custodian-General upheld the plea of the State of Uttar Pradesh, and set aside the order of the Deputy Custodian.",
      "type": "procedural",
      "date": "1962-09-11",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "With special leave, the heirs and legal representatives of Ram Chand Kohli have appealed to this Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Revision petition heard on August 4, 1962, adjourned to August 14, 1962. On August 6, 1962, counsel for appellants served notice for inspection of documents, no inspection given.",
      "type": "procedural",
      "date": "1962-08-04",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the Custodian-General had jurisdiction to entertain the revision petition filed by the State of Uttar Pradesh under s. 27 of the Administration of Evacuee Property Act 31 of 1950 against the Deputy Custodian's order of October 12, 1949, given the chain of repealing ordinances and acts and declarations of finality.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the trial of the petition before the Custodian-General was vitiated by gross irregularities and breach of the rules of natural justice.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The petition was belated.",
      "supporting_facts": [
        "f7",
        "f10"
      ],
      "legal_basis": "Section 27 of Administration of Evacuee Property Act 31 of 1950; discretionary power not to entertain delayed petitions"
    },
    {
      "id": "pa2",
      "text": "Custodian-General had no jurisdiction because the chain of fictions in repealing statutes preserved the finality of the Deputy Custodian's order under earlier ordinances, preventing revision under s. 27 of Act 31 of 1950.",
      "supporting_facts": [
        "f3",
        "f10"
      ],
      "legal_basis": "s. 30(6) Ordinance 12/1949; s. 55(3) Ordinance 27/1949; s. 58(3) Act 31/1950; Indira Sohanlal v. Custodian of Evacuee Property; Dafadar Niranjan Singh v. Custodian"
    },
    {
      "id": "pa3",
      "text": "Property was owned by Chowdhry Akbar Hussain and lawfully declared evacuee property.",
      "supporting_facts": [
        "f1",
        "f2",
        "f3"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The property belonged to the State and Chowdhry Akbar Hussain had no proprietary interest; Deputy Custodian had no power to declare it evacuee property.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "State was not aware of the notification, subsequent proceedings, or sale to Ram Chand Kohli.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Section 27 does not prescribe time limit; power exercisable at any time; delay within discretion of Custodian-General; no interference under Art. 136.",
      "addresses_issue": "i1",
      "key_observation": "Great delay but within competence and discretion of Custodian-General."
    },
    {
      "id": "cr2",
      "text": "By chain of deeming provisions (Ordinance 27/1949 s.55(3); Act 31/1950 s.58(3)), order under s.6 Ordinance 12/1949 deemed made under Act 31/1950, subject to s.27 revision notwithstanding finality declarations.",
      "addresses_issue": "i1",
      "key_observation": "Fiction deems order under new Act, subjecting it to revisional jurisdiction; rejects appellants' interpretation of precedents."
    },
    {
      "id": "cr3",
      "text": "Procedure before Custodian-General violated natural justice: admitted new evidence/documents without formal order, no opportunity to rebut, no inspection allowed, originals produced without notice.",
      "addresses_issue": "i2",
      "key_observation": "Gross violation; must remand for proper hearing."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Custodian-General had jurisdiction under s.27 Act 31/1950 to entertain revision.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Custodian-General's order set aside due to breach of natural justice; remanded for fresh hearing with directions to admit evidence properly and hear parties.",
      "resolves_issue": "i2",
      "in_favor_of": "partial"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Indira Sohanlal v. Custodian of Evacuee Property, Delhi Others",
      "citation": "1955 2 S.C.R. 1117",
      "treatment": "distinguished",
      "relevance": "Appellants relied on dicta re s.58(3); Court holds it does not preserve finality against revision under new Act."
    },
    {
      "case_name": "Dafadar Niranjan Singh and Another v. Custodian, Evacuee Property Pb. and Another",
      "citation": "1962 1 S.C.R. 214",
      "treatment": "distinguished",
      "relevance": "Chain of fictions broken in that case; dicta on s.58(3) not accepted as limiting fiction to non-final orders."
    },
    {
      "case_name": "Surtees v. Ellison",
      "citation": "1829 9 B. C. 752",
      "treatment": "referred",
      "relevance": "Rule that repealed statute regarded as never existing except for past closed matters, altered by saving provisions."
    }
  ],
  "statutes_cited": [
    {
      "name": "U. P. Administration of Evacuee Property Ordinance 1 of 1949",
      "sections": [
        "s. 6"
      ],
      "relevance": "Initial power to notify evacuee property (noted as inadvertent reference)."
    },
    {
      "name": "Administration of Evacuee Property Chief Commissioners Provinces Ordinance 12 of 1949",
      "sections": [
        "s. 5",
        "s. 6",
        "s. 30"
      ],
      "relevance": "Power to notify evacuee property; finality of orders; applied to UP by Ordinance 20/1949."
    },
    {
      "name": "Administration of Evacuee Property Ordinance 20 of 1949",
      "sections": [
        "s. 4"
      ],
      "relevance": "Extended Ordinance 12/1949 to United Provinces."
    },
    {
      "name": "Administration of Evacuee Property Ordinance 27 of 1949",
      "sections": [
        "s. 7",
        "s. 24",
        "s. 27",
        "s. 28",
        "s. 55"
      ],
      "relevance": "Repealed prior ordinances with deeming provisions; revision powers; finality."
    },
    {
      "name": "Administration of Evacuee Property Act 31 of 1950",
      "sections": [
        "s. 7",
        "s. 24",
        "s. 27",
        "s. 28",
        "s. 58"
      ],
      "relevance": "Core Act; revision by Custodian-General; deeming prior actions under this Act."
    },
    {
      "name": "Displaced Persons (Compensation and Rehabilitation) Act 44 of 1954",
      "sections": [
        "s. 12"
      ],
      "relevance": "Acquisition of evacuee property for Central pool; subsequent sale."
    },
    {
      "name": "General Clauses Act, 1897",
      "sections": [
        "s. 6"
      ],
      "relevance": "Effect of repeal; s.58(3) of Act 31/1950 departs from this rule."
    }
  ],
  "outcome": {
    "disposition": "remanded",
    "summary": "The Supreme Court held that the Custodian-General had jurisdiction to entertain the revision but set aside his order dated September 11, 1962 due to gross violation of natural justice in procedure, including admission of new evidence without opportunity to rebut. Remanded to Custodian-General for fresh hearing after proper admission of evidence and hearing both parties.",
    "relief_granted": "Order of Custodian-General set aside; remanded for retrial.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The powers of the Custodian-General are unquestionably judicial and normally he may not be justified in entertaining a petition in revision which has been instituted after great delay, especially when titles of persons other than those directly concerned in the order sought to be revised, have intervened.",
      "speaker": "court",
      "significance": "Acknowledges delay but defers to discretion."
    },
    {
      "text": "By this chain of fictions, things done and actions taken under Ordinance 12 of 1949 are to be deemed to have been done or taken in exercise of the powers conferred under Act 31 of 1950, as if that Act were in force on the day on which such thing was done or action taken.",
      "speaker": "court",
      "significance": "Core reasoning on jurisdiction via deeming provisions."
    },
    {
      "text": "The procedure followed by the Custodian-General is in gross violation of the rules of natural justice.",
      "speaker": "court",
      "significance": "Basis for remand."
    }
  ],
  "_case_id": "1965_62",
  "_label": 1,
  "_text_length": 32155,
  "_extracted_at": "2026-02-10T19:25:01.997023"
}