{
  "metadata": {
    "case_name": "Successors of Suleman v. Sat Narain and others",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "Hidayatullah, J."
    ],
    "case_number": "Civil Appeal No. 962 of 1964",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The land in dispute measures 5 bighas and 3 biswas Khata No. 2 situate in Bhagwatipura, pargana Kewai, district Allahabad and consists of 5 plots Nos. 26, 27, 29, 30 and 32.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Jantari mortgaged the said land with Suleman on October 4, 1929 and the mortgage is admitted to be usufructuary in nature.",
      "type": "admitted",
      "date": "1929-10-04",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "It is also admitted that the land was Sir Sankalap of Jantari.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Appellants are the successors-in-interest of Suleman, the original mortgagee.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Original respondent Sat Narain was the successor-in-interest of Jantari, the original mortgagor. Subsequently, Sat Narain sold his interest to others who have been joined as respondents under O. 22 r. 10 CPC.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "On May 27, 1952, Sat Narain filed an application under S. 12 of the U.P. Agriculturist Relief Act in the court of the Munsif East Allahabad alleging that the mortgage had been paid off from the usufruct of the land and he was entitled to redeem it.",
      "type": "procedural",
      "date": "1952-05-27",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Defendants (representing Suleman the mortgagee) opposed the application. Two written statements were filed on October 4, 1952 and March 31, 1953 alleging plaintiff was not an agriculturist, mortgage not satisfied as land not productive, one denied the mortgage, claimed they had become Sirdars under U.P. Zamindari Abolition and Land Reforms Act.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "Learned Munsif framed five issues and decided in favour of plaintiff: mortgage existed, plaintiff and mortgagor agriculturists, mortgage satisfied from usufruct, defendants not Sirdars, suit maintainable. Passed decree on November 24, 1953.",
      "type": "procedural",
      "date": "1953-11-24",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Defendants appealed to District Court; appeal dismissed by judgment dated April 17, 1957 confirming all findings.",
      "type": "procedural",
      "date": "1957-04-17",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Decree executed and possession delivered on May 1, 1957 to successors-in-interest of original mortgagor.",
      "type": "procedural",
      "date": "1957-05-01",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Application for revision filed in Allahabad High Court, dismissed by order dated October 9, 1961 as property back to original owner and substantial justice done.",
      "type": "procedural",
      "date": "1961-10-09",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Appeal by special leave to Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "U.P. Zamindari Abolition and Land Reforms Act came into force July 1, 1952.",
      "type": "background",
      "date": "1952-07-01",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the suit under S. 12 of U.P. Agriculturist Relief Act filed on May 27, 1952 was competent after repeal of the Act by U.P. Zamindari Abolition and Land Reforms Act amendments, and whether Munsif had jurisdiction post-July 1, 1952.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Status of representatives of mortgagee: whether Sirdars under Abolition Act or asamis, and ejectment procedure.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Plaintiff not agriculturist, suit not maintainable under S.12 U.P. Agriculturist Relief Act; mortgage not satisfied as land not productive; denied mortgage.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "U.P. Agriculturist Relief Act S.12"
    },
    {
      "id": "pa2",
      "text": "Defendants became Sirdars by U.P. Zamindari Abolition Act; suit not maintainable.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "U.P. Zamindari Abolition and Land Reforms Act"
    },
    {
      "id": "pa3",
      "text": "After repeal of Agriculturist Relief Act by Act XVI of 1953, suit incompetent; ejectment of asami/Sirdar only under Abolition Act provisions before Assistant Collector.",
      "supporting_facts": [
        "f13"
      ],
      "legal_basis": "U.P. Zamindari Abolition and Land Reforms Act Ss.21(1)(d), 200, 202(c), Sch. II List I; Act XVI of 1953 S.67"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Mortgage paid off from usufruct; entitled to redeem.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": "U.P. Agriculturist Relief Act S.12"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Appellants not Sirdars due to S.14(2)(a) as land was sir of mortgagor on date of mortgage; deemed sir of mortgagor.",
      "addresses_issue": "i2",
      "key_observation": "Land continued to be sir or khudkasht of mortgagor."
    },
    {
      "id": "cr2",
      "text": "Appellants claim asamis under S.21(1)(d), ejectment under S.202(c) before Assistant Collector per Sch.II.",
      "addresses_issue": "i2",
      "key_observation": "But pending suit governs."
    },
    {
      "id": "cr3",
      "text": "Suit filed May 27,1952 before Abolition Act force July 1,1952; repeal by Act XVI/1953 from July 1,1952 does not affect pending proceedings per U.P. General Clauses Act S.6(c),(e).",
      "addresses_issue": "i1",
      "key_observation": "No different intention; no transfer of pending cases."
    },
    {
      "id": "cr4",
      "text": "Amending Act XVIII/1956 S.23 saving clause confirms pending proceedings continue under old law notwithstanding amendments.",
      "addresses_issue": "i1",
      "key_observation": "Explicitly preserves jurisdiction exercised before commencement."
    },
    {
      "id": "cr5",
      "text": "Proceedings before Munsif with jurisdiction; not affected by Abolition Act or amendments.",
      "addresses_issue": "i1",
      "key_observation": "Appeal fails."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Suit under S.12 U.P. Agriculturist Relief Act competent; pending proceedings continue unaffected by repeal and Abolition Act jurisdiction provisions.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Mortgagees not Sirdars; mortgage satisfied; decree valid.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "U.P. Agriculturist Relief Act",
      "sections": [
        "S. 12"
      ],
      "relevance": "Provided remedy for agriculturist mortgagor to redeem; suit filed thereunder; repealed but pending suit saved."
    },
    {
      "name": "U.P. Zamindari Abolition and Land Reforms Act, 1950",
      "sections": [
        "S. 14(2)(a)",
        "S. 18",
        "S. 21(1)(d)",
        "S. 200",
        "S. 202(c)",
        "S. 339",
        "Sch. II List I",
        "Sch. III List I Item 13A"
      ],
      "relevance": "Determined status as not Sirdars but potential asamis; ejectment jurisdiction to Assistant Collector; did not oust pending civil court jurisdiction."
    },
    {
      "name": "U.P. Zamindari Abolition and Land Reforms (Amendment) Act XVI of 1953",
      "sections": [
        "S. 1(2)",
        "S. 67"
      ],
      "relevance": "Repealed Agriculturist Relief Act retrospectively from July 1,1952."
    },
    {
      "name": "U.P. Zamindari Abolition and Land Reforms (Amendment) Act XVIII of 1956",
      "sections": [
        "S. 23",
        "Sch. II"
      ],
      "relevance": "Saving for pending proceedings; jurisdiction not to affect prior litigation."
    },
    {
      "name": "U.P. General Clauses Act",
      "sections": [
        "S. 6(c)",
        "S. 6(e)"
      ],
      "relevance": "Effect of repeal does not affect accrued rights or pending proceedings unless different intention."
    },
    {
      "name": "Code of Civil Procedure",
      "sections": [
        "O. 22 r. 10"
      ],
      "relevance": "Joinder of subsequent purchasers as respondents."
    },
    {
      "name": "Transfer of Property Act",
      "sections": [
        "S. 83"
      ],
      "relevance": "S.12 Agriculturist Relief Act notwithstanding S.83."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal by special leave against the Allahabad High Court order dismissing revision is dismissed. The decree for redemption under S.12 U.P. Agriculturist Relief Act passed by Munsif and confirmed up to High Court is upheld as the proceedings were competent and unaffected by subsequent repeal and jurisdictional changes in Abolition Act.",
    "relief_granted": "None to appellants; prior possession to respondents confirmed.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The question is whether a different intention appears in either the Abolition Act or the amending Act XVI of 1953, for otherwise the old proceeding could continue before the Munsif.",
      "speaker": "court",
      "significance": "Central to applying General Clauses Act S.6 to pending suit."
    },
    {
      "text": "The addition of this section clearly shows that by the conferral of the jurisdiction upon the Assistant Collector it was not intended to upset litigation pending before appropriate authorities when the Abolition Act came into force.",
      "speaker": "court",
      "significance": "Interprets S.23 of 1956 Amendment Act saving pending cases."
    },
    {
      "text": "In our judgment, therefore, the proceedings before the Munsif were with jurisdiction because they were not affected by the passing of the Abolition Act or the amending Act, 1953.",
      "speaker": "court",
      "significance": "Core holding on jurisdiction."
    }
  ],
  "_case_id": "1965_366",
  "_label": 0,
  "_text_length": 15582,
  "_extracted_at": "2026-02-10T19:28:49.065835"
}