{
  "metadata": {
    "case_name": "Plaintiff v. 1st Defendant",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "Ranmswami, J."
    ],
    "case_number": "Civil Appeal No. 798 of 1963",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Disputed property consisted of 16 acres and 27 cents of land in Sokkanur village of Coimbatore district of which half share belonged to Palani Moopan and the other half to his daughter Palani Mooppachi.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Palani Moopan executed the document-Ex. B-1 with regard to his share of the property in favour of the 1st defendant for a consideration of Rs. 4,000/- on May 28, 1946. Out of the consideration, a sum of Rs. 2,000/- was reserved with the vendee to pay off an earlier mortgage and the balance of Rs. 2,000/- was paid to the vendor in cash. The first defendant discharged the earlier mortgage in accordance with the directions in Ex. B-1.",
      "type": "material",
      "date": "1946-05-28",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The document, B-1 was in the form of a sale deed but it contained a stipulation that the 1st defendant should reconvey the property to Palani Moopan on his repaying the amount of Rs. 4,000/- after 5 years and before the end of the 7th year.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "After the death of Palani Moopan his sons executed an assignment deed in favour of the plaintiff, Ex. A-1 dated August 10, 1950 for a sum of Rs. 1,600/-.",
      "type": "material",
      "date": "1950-08-10",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The plaintiff alleged that he tendered the amount to the first defendant several times but the latter refused to accept the same.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "The real value of the property was, according to the Munsif and the Subordinate Judge, Rs. 8,000/-. The High Court reached the finding that the value of the property was Rs. 5,500/-",
      "type": "disputed",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "The patta was not transferred to the 1st defendant after the execution of Ex. B-1 by Palani Moopan. The patta continued in the name of Palani Moopan even after the execution of Ex. B-1. Exhibits A-6 and A-7 are certified copies of thandal extract of patta for the years 1945-54.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "The kist for the land was continued to be paid by Palani Moopan and after his death, by the sons of Palani Moopan.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "The plaintiff had obtained patta for the land on the basis of Ex. A-2. The registered deed of transfer of patta was executed by the sons of Palani Moopan in favour of the plaintiff.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Trial court held that Ex. B-1 was a mortgage by conditional sale and accordingly granted a preliminary decree to the plaintiff for redemption under O. 34. r. 7 of the Civil Procedure Code.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "The first defendant took the matter in appeal to the Subordinate Judge of Coimbatore but the appeal was dismissed.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "The 1st defendant preferred second appeal in the Madras High Court which set aside the decrees of the lower Courts and ordered that the suit should be dismissed, holding that the transaction was an outright sale and not a mortgage by conditional sale.",
      "type": "procedural",
      "date": "1960-08-19",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "whether the document, Ex. B-1 executed by Palani Moopan in favour of the 1st defendant is, in its true effect, a mortgage by conditional sale or a sale with a condition for retransfer.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Ex. B-1 must be deemed in law to be a mortgage by conditional sale and that he was entitled to redeem as the assignee of the equity of redemption.",
      "supporting_facts": [
        "f2",
        "f3",
        "f4"
      ],
      "legal_basis": "s. 58(c) of the Transfer of Property Act"
    },
    {
      "id": "pa2",
      "text": "Being an agriculturist, he was entitled to the benefits of Madras Act IV of 1938 as amended.",
      "supporting_facts": [],
      "legal_basis": "Madras Act IV of 1938"
    },
    {
      "id": "pa3",
      "text": "Alternatively that if Ex. B-1 was held to be an outright sale with a condition to repurchase, the first defendant was bound to reconvey the property to him on payment of the amount of Rs. 4,000/-.",
      "supporting_facts": [
        "f2",
        "f3",
        "f5"
      ],
      "legal_basis": null
    },
    {
      "id": "pa4",
      "text": "The question of valuation was one of fact and the High Court was not entitled to go into the question in the second appeal.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Ex. B-1 was an outright sale with a covenant to repurchase and as no tender was made by the plaintiff within the time stipulated in the document, the suit was barred by time.",
      "supporting_facts": [
        "f3",
        "f5"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "By s. 58(c) of the Transfer of Property Act a mortgage by conditional sale is defined as... Provided that no such transaction shall be deemed to be a mortgage, unless the condition is embodied in the document which effects or purports to effect the sale.",
      "addresses_issue": "i1",
      "key_observation": "The proviso to this clause was added by Act 20 of 1929."
    },
    {
      "id": "cr2",
      "text": "The question whether by the incorporation of such a condition a transaction ostensibly of sale may be regarded as a mortgage is one of intention of the parties to be gathered from the language of the deed interpreted in the light of the surrounding circumstances.",
      "addresses_issue": "i1",
      "key_observation": "The definition of a mortgage by conditional sale postulates the creation by the transfer of a relation of mortgagor and mortgagee, the price being charged on the property conveyed."
    },
    {
      "id": "cr3",
      "text": "In the present case there are several circumstances to indicate that Ex. B-1 was a transaction of mortgage by conditional sale and not a sale with a condition for retransfer: (1) the condition for repurchase is embodied in the same document; (2) consideration Rs.4000 while value Rs.8000; (3) patta not transferred; (4) kist paid by original owners; (5) reconveyance for same amount Rs.4000.",
      "addresses_issue": "i1",
      "key_observation": "Having regard to the language of the document, Ex. B-1 and examining it in the light of these circumstances we are of the opinion that the transaction under Ex. B-1 was mortgage by conditional sale."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The transaction under Ex. B-1 was mortgage by conditional sale and the view taken by the High Court with regard to the legal effect of the transaction must be reversed.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "The plaintiff is entitled to a preliminary decree for redemption under O. 34. r. 7, Civil Procedure Code, for taking accounts and for declaration of the amounts due to the 1st defendant under Ex. B-1.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Transfer of Property Act",
      "sections": [
        "58(c)"
      ],
      "relevance": "Defines mortgage by conditional sale and requires condition to be embodied in the sale document"
    },
    {
      "name": "Madras Act IV of 1938",
      "sections": [],
      "relevance": "Plaintiff claimed benefits as agriculturist"
    },
    {
      "name": "Code of Civil Procedure",
      "sections": [
        "Order 34 Rule 7"
      ],
      "relevance": "Preliminary decree for redemption"
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "The Supreme Court set aside the judgment and decree of the Madras High Court dated August 19, 1960 in Second Appeal No. 871 of 1958 and restored the judgment and decree of the Subordinate Judge of Coimbatore granting the plaintiff a preliminary decree for redemption of the mortgage. A period of six months is granted for payment of the amount under the preliminary decree.",
    "relief_granted": "Preliminary decree for redemption under O. 34 r. 7 CPC for taking accounts and declaration of amounts due; six months time for payment",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The question whether by the incorporation of such a condition a transaction ostensibly of sale may be regarded as a mortgage is one of intention of the parties to be gathered from the language of the deed interpreted in the light of the surrounding circumstances.",
      "speaker": "court",
      "significance": "Core test for determining nature of transaction"
    },
    {
      "text": "Having regard to the language of the document, Ex. B-1 and examining it in the light of these circumstances we are of the opinion that the transaction under Ex. B-1 was mortgage by conditional sale",
      "speaker": "court",
      "significance": "Final determination reversing High Court"
    }
  ],
  "_case_id": "1965_163",
  "_label": 1,
  "_text_length": 12343,
  "_extracted_at": "2026-02-10T19:26:21.815288"
}