{
  "metadata": {
    "case_name": "Anwarkhan Mehboob and Co. v. State of Madhya Pradesh",
    "case_year": 1965,
    "court": "Supreme Court of India",
    "judges": [
      "Hidayatullah, J."
    ],
    "case_number": "Writ Petition No. 38 of 1965",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Petitioner is a partnership firm which manufactures and sells bidis under the name Anwarkhan Mehboob and Co., Jabalpur.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "In 1948, petitioner firm acquired for 25 years (1948-1973) the right to pluck and carry away tendu leaves from 99 villages in former Imlai Estate from Malguzar Raja Raghuraj Singh for Rs. 9,000 per year payable after each crop but before 3 months expiry. Document registered Annexure I executed on August 22, 1948. Only leaves to be plucked, no bushes cut.",
      "type": "admitted",
      "date": "1948-08-22",
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "In 1950, Madhya Pradesh Abolition of Proprietary Rights (Estates, Mahals and Alienated Lands) Act No. 1 of 1951 passed. All proprietary rights vested in State free from encumbrances, including land, forests, trees etc.",
      "type": "material",
      "date": "1951",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Government of Madhya Pradesh obstructed persons holding contracts for tendu leaves including petitioner firm.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Petitioner firm and others filed petitions under Art. 32 including WP No. 309 of 1951 (Firm Anwar Khan Mehboob Co. v. State of MP), heard together, decided December 23, 1952. Main judgment in Chhotabhai Jethabhai v. State of MP held contracts are licenses not affected by Abolition Act, writ of prohibition issued against State interference.",
      "type": "procedural",
      "date": "1952-12-23",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Petitioner firm obtained writ of prohibition and would have enjoyed agreement till 1973.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "In 1964, Madhya Pradesh Tendu Patta Vyapar Viniyaman Adhiniyam, 1964 (No. 29 of 1964) passed to regulate trade by creating State monopoly.",
      "type": "material",
      "date": "1964",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Adhiniyam empowered State to divide areas into units, appoint agents, set advisory committees for prices, require registration of growers, manufacturers, exporters. Section 5 restricts purchase/transport to State, officers, agents. Penalties for contravention.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Grower defined: State for reserved/protected forests/unoccupied land; specific holders for other lands. Petitioner not a grower.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "By notification, areas extended, Imlai Estate divided into unit No. 3 Baghraji, No. 5 Kundam, No. 11 Umaria leased areas.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Advisory Committees under MP Tendu Patta Mantrana Samiti Mulya Prakashan Niyam, 1964; rules MP Tendu Patta Vyapar Viniyaman Niyamavali, 1965 framed.",
      "type": "procedural",
      "date": "1964",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Tenders invited for areas including three units, remarks noted leased to petitioner till 1973. No tenders for units 5 and 11, tender for unit 3.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "On March 20, 1965, Minister for Forests informed petitioner's representatives that leases extinguished by Adhiniyam, time extended for fresh tenders.",
      "type": "procedural",
      "date": "1965-03-20",
      "source": "court"
    },
    {
      "id": "f14",
      "text": "On March 23, 1965, tenders accepted for unit 3 Baghraji and unit 11 Umaria.",
      "type": "procedural",
      "date": "1965-03-23",
      "source": "court"
    },
    {
      "id": "f15",
      "text": "On March 24, 1965, Divisional Forest Officer, Jabalpur informed petitioner by letter that right to collect tendu leaves in 99 villages abrogated under Adhiniyam.",
      "type": "procedural",
      "date": "1965-03-24",
      "source": "court"
    },
    {
      "id": "f16",
      "text": "Present petition filed under Art. 32.",
      "type": "procedural",
      "date": "1965",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the earlier decision in Chhotabhai Jethabhai case operates as res judicata in the present case.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the Adhiniyam affects the rights of the petitioner firm under its 1948 agreement, particularly in light of s.5 and whether it violates fundamental right to property under Art. 32.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether petitioner firm is entitled under Explanation I to s.5 of Adhiniyam.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Adhiniyam does not touch rights recognized and enforced by earlier writ of prohibition; not retrospective, no attempt to nullify decision.",
      "supporting_facts": [
        "f5",
        "f6"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Adhiniyam in terms does not apply due to Explanation I to s.5.",
      "supporting_facts": [
        "f8",
        "f9"
      ],
      "legal_basis": "Explanation I to s.5, MP Tendu Patta Vyapar Viniyaman Adhiniyam, 1964"
    },
    {
      "id": "pa3",
      "text": "Entitled to enforce same fundamental right to property recognized earlier; former decision binding as res judicata.",
      "supporting_facts": [
        "f2",
        "f5"
      ],
      "legal_basis": "Art. 32; res judicata; Hoystead v. Commissioner of Taxation"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "No right in property which could be claimed; petition incompetent in view of later decisions dissenting from Chhotabhai case.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": "Shantabai v. State of Bombay; Mahadeo v. State of Bombay"
    },
    {
      "id": "ra2",
      "text": "Earlier matter could not anticipate Adhiniyam which was not in existence.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": null
    },
    {
      "id": "ra3",
      "text": "Petitioner firm affected by s.5 of Adhiniyam as any other person notwithstanding earlier decision.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": "s.5, MP Tendu Patta Vyapar Viniyaman Adhiniyam, 1964"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Chhotabhai case not binding precedent as given per incuriam, not followed in Shantabai and Mahadeo; agreements are bare licences ending with licensor's interest.",
      "addresses_issue": "i1",
      "key_observation": "Decision in Chhotabhai treated agreements as licences but considered them conferring fundamental right to property per incuriam."
    },
    {
      "id": "cr2",
      "text": "No res judicata as cause of action different: earlier based on Abolition Act, present on Adhiniyam; new law creates new circumstances.",
      "addresses_issue": "i1",
      "key_observation": "Even if property right assumed earlier, effect of new Adhiniyam must be worked afresh."
    },
    {
      "id": "cr3",
      "text": "Agreements confer licence coupled with grant to enter forests and pluck leaves, no property right before severance.",
      "addresses_issue": "i2",
      "key_observation": "Contract right not property right invocable under Art. 32."
    },
    {
      "id": "cr4",
      "text": "S.5 creates monopoly: no purchase/transport except by State/officers/agents; Explanation II deems acquisition of collection right as purchase in contravention.",
      "addresses_issue": "i2",
      "key_observation": "Petitioner has no interest in holding, cannot collect; must purchase from Government like others."
    },
    {
      "id": "cr5",
      "text": "Abolition Act vested forests in State; Adhiniyam gives State sole purchase right; no property right invaded.",
      "addresses_issue": "i2",
      "key_observation": "Petitioner's rights no longer available."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Earlier decision does not operate as res judicata.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Adhiniyam validly applies to petitioner; no fundamental right to property violated; rights under 1948 agreement extinguished, must buy tendu leaves from Government.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Chhotabhai Jethabhai v. State of Madhya Pradesh",
      "citation": "1953 S.C.R. 476",
      "treatment": "doubted",
      "relevance": "Earlier decision holding contracts as licences not affected by Abolition Act; held per incuriam and not binding."
    },
    {
      "case_name": "Shantabai v. State of Bombay",
      "citation": "1959 S.C.R. 265",
      "treatment": "followed",
      "relevance": "Refused to follow Chhotabhai; unregistered agreements not conferring property rights."
    },
    {
      "case_name": "Mahadeo v. State of Bombay",
      "citation": "1959 Supp. 2 S.C.R. 339",
      "treatment": "followed",
      "relevance": "Declined to accept Chhotabhai; contractual rights end with licensor's title."
    },
    {
      "case_name": "Hoystead v. Commissioner of Taxation",
      "citation": "1926 A.C. 155",
      "treatment": "distinguished",
      "relevance": "On res judicata of fundamental facts; distinguished as cause of action different."
    },
    {
      "case_name": "Society of Medical Officers of Health v. Hope",
      "citation": "1960 A.C. 551",
      "treatment": "referred",
      "relevance": "Did not follow Hoystead."
    },
    {
      "case_name": "Broken Hill Proprietary Company Limited v. Municipal Council of Broken Hill",
      "citation": "1926 A.C. 94",
      "treatment": "referred",
      "relevance": "In conflict with Hoystead."
    },
    {
      "case_name": "Mohanlal Hargovind v. C.I.T.",
      "citation": "1949 I.T.R. 473 (P.C.)",
      "treatment": "distinguished",
      "relevance": "Relied on in Chhotabhai but in different context on capital vs revenue expenditure."
    }
  ],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Article 32",
        "Article 19(1)(f)",
        "Article 19(1)(g)"
      ],
      "relevance": "Petition for enforcement of fundamental rights to property; held no such right invaded."
    },
    {
      "name": "Madhya Pradesh Abolition of Proprietary Rights (Estates, Mahals and Alienated Lands) Act, 1950",
      "sections": [
        "No. 1 of 1951"
      ],
      "relevance": "Vested proprietary rights including forests in State; did not affect licences per earlier decision."
    },
    {
      "name": "Madhya Pradesh Tendu Patta (Vyapar Viniyaman) Adhiniyam, 1964",
      "sections": [
        "Section 5",
        "Section 1(3)"
      ],
      "relevance": "Creates State monopoly on purchase/transport of tendu leaves; applies to petitioner."
    },
    {
      "name": "Madhya Pradesh Land Revenue Code, 1959",
      "sections": [
        "Definitions of unoccupied land"
      ],
      "relevance": "For definition of grower."
    },
    {
      "name": "Madhya Pradesh Tendu Patta Mantrana Samiti Mulya Prakashan Niyam, 1964",
      "sections": [],
      "relevance": "For advisory committees and price fixation."
    },
    {
      "name": "Madhya Pradesh Tendu Patta Vyapar Viniyaman Niyamavali, 1965",
      "sections": [],
      "relevance": "Procedure for implementation."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The petition under Art. 32 fails as no fundamental right to property is violated; earlier writ does not protect against Adhiniyam which creates valid State monopoly; petitioner's rights under 1948 agreement no longer available and it must purchase tendu leaves from Government like others.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"The decision in Chhotabhai Jethabhai's case, which treated the agreements as bare licences and yet considered that a fundamental right to property was conferred by them, was apparently given per incuriam and could not therefore be followed.\"",
      "speaker": "court",
      "significance": "Rejects binding nature of earlier precedent."
    },
    {
      "text": "\"Since there is no right to property before the leaves are plucked, no such rights can be said to be invaded by the Adhiniyam.\"",
      "speaker": "court",
      "significance": "Core holding on absence of property right."
    },
    {
      "text": "\"The rights of the petitioner firm such as they were, must be held to be no longer available to it. The petitioner firm must buy its leaves like any other person.\"",
      "speaker": "court",
      "significance": "Final determination on petitioner's position."
    }
  ],
  "_case_id": "1965_59",
  "_label": 0,
  "_text_length": 28566,
  "_extracted_at": "2026-02-10T19:25:10.990195"
}