{
  "metadata": {
    "case_name": "Ernakulam Electric Supply Co. v. State of Kerala",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "Bachswat, J."
    ],
    "case_number": "Civil Appeal No. 897 of 1963",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The appellant is the holder of a license for the supply of electrical energy in Ernakulam and other places in Cochin. The license was originally granted to the managing agents of the appellant under the Cochin Electricity Regulation III of 1902 and subsequently assigned to the appellant with the permission of the Cochin Government.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Date of commencement of the license is December 3, 1935.",
      "type": "material",
      "date": "1935-12-03",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On the merger of Travancore-Cochin with the Union of India, the Indian Electricity Act, 1910 was made applicable by the Part-B States Laws Act, 1951 to the Travancore-Cochin area, and the Cochin Electricity Regulation stood repealed. The Electricity Supply Act, 1948 was also made applicable.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On March 31, 1957 the Kerala Electricity Board was constituted, and by s.71 of Act 54 of 1948, any right and option to purchase the undertaking of the licensee under the Indian Electricity Act, 1910 was transferred to and vested in the Board.",
      "type": "procedural",
      "date": "1957-03-31",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Clause 15(a) of the license provides: The option of purchase given by Section 7, sub-section (1) of the Regulation shall first be exercisable on the expiration of 25 years from the commencement of this license and on the expiration of every subsequent period of ten years during the continuance of this license.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The period of 25 years expired on December 2, 1960. The last date for giving the two years' notice under s.7(4) of the Indian Electricity Act, 1910 expired on December 2, 1958.",
      "type": "material",
      "date": "1960-12-02",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "On February 11, 1959, the State Electricity Board served on the appellant a notice, Ex. B, of its election to purchase the undertaking on the expiry of December 2, 1960, but this notice was not in accordance with s.7(4) and was of no legal effect.",
      "type": "procedural",
      "date": "1959-02-11",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "By the Indian Electricity (Amendment) Act, 1959 (Act 32 of 1959), s.6 was substituted for the old s.7 with effect from September 5, 1959.",
      "type": "background",
      "date": "1959-09-05",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "On October 24, 1959, the State Electricity Board served upon the appellant a notice, Ex. D, of its election to purchase the undertaking on the expiry of December 2, 1960.",
      "type": "procedural",
      "date": "1959-10-24",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "On October 29, 1959, the State Electricity Board served upon the appellant another notice, Ex. E, of its election.",
      "type": "procedural",
      "date": "1959-10-29",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "On November 20, 1959, the State Government served upon the appellant a notice, Ex. G, of its election to purchase the undertaking on the expiry of December 2, 1960.",
      "type": "procedural",
      "date": "1959-11-20",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "On November 14, 1960, the appellant filed a writ petition in the High Court of Kerala impleading the State of Kerala and the Kerala State Electricity Board, seeking writs restraining action pursuant to notices Exs. B, D, E and G.",
      "type": "procedural",
      "date": "1960-11-14",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "On December 20, 1961, a learned single Judge of the High Court dismissed the writ petition, holding that notices Exs. B, D, E by the Board could be ignored, and upheld the State Government's notice Ex. G.",
      "type": "procedural",
      "date": "1961-12-20",
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "The appellant filed Writ Appeal No. 17 of 1962, impleading only the State Government. The Division Bench dismissed the appeal on October 4, 1962.",
      "type": "procedural",
      "date": "1962-10-04",
      "source": "lower_court"
    },
    {
      "id": "f15",
      "text": "Appeal to Supreme Court under certificate under Arts. 133(1)(a) and 133(1)(c).",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the proposed acquisition of the electrical supply undertaking of the appellant by the State of Kerala in pursuance of notice Ex. G, dated November 20, 1959 is authorised by s. 6 of the Indian Electricity Act, 1910.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "As the two years' notice in writing of the election to purchase the undertaking on the expiry of December 2, 1960 was not served on the appellant as required by the old s.7(4) of the Indian Electricity Act, 1910, the appellant acquired a vested right to hold the license until the expiry of a further period of ten years, that is to say, until December 2, 1970, and this vested right was not taken away either expressly or by necessary implication by the new s.6.",
      "supporting_facts": [
        "f6",
        "f7"
      ],
      "legal_basis": "s.7(4) Indian Electricity Act, 1910; new s.6"
    },
    {
      "id": "pa2",
      "text": "The expression 'on the expiration of each such period as is specified in the license' in the new s.6(1)(a) means a period which has not expired and on the expiry of which the option may be legally exercised, and since in the absence of the two years' notice required under the old s.7(4), the option of purchase on the expiry of December 2, 1960 could not be legally exercised, the new s.6(1) did not confer any option of purchase on the expiry of December 2, 1960 and the first option exercisable under the new s.6(1) would be on the expiry of December 2, 1970.",
      "supporting_facts": [
        "f6",
        "f7"
      ],
      "legal_basis": "s.6(1)(a) Indian Electricity Act, 1910"
    },
    {
      "id": "pa3",
      "text": "Sub-sections (4) and (5) of the new s.6 show that the period on the expiry of which the option under sub-s (1) of s.6 is exercisable, is a period which would expire at least 18 months after the coming into force of the new s.6, that is to say, after September 5, 1959, and since the period expiring on December 2, 1960 is not such a period, the new s.6(1) did not confer any option of purchase on the expiry of December 2, 1960.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": "s.6(4), s.6(5) Indian Electricity Act, 1910"
    },
    {
      "id": "pa4",
      "text": "In any event, the State Electricity Board having duly elected to purchase the undertaking on the expiry of December 2, 1960, the State Government acquired no option of purchase under sub-s (2) of s.6 of the Indian Electricity Act, 1910.",
      "supporting_facts": [
        "f9",
        "f10"
      ],
      "legal_basis": "s.6(2) Indian Electricity Act, 1910"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The absence of two years' notice under the old s.7(4) of the Indian Electricity Act, 1910 did not confer upon the appellant a vested right to hold the license until the expiry of December 2, 1970, and the immunity from compulsory purchase under the old s.7 arising from the non-service of the requisite two years' notice could be, and was, taken away by the new s.6, which required only one year's notice of intention to purchase the undertaking.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "old s.7(4); new s.6 Indian Electricity Act, 1910"
    },
    {
      "id": "ra2",
      "text": "Assuming that the appellant acquired under the old s.7 a vested right to hold the license until December 2, 1970, such vested right was taken away by the new s.6, which expressly applies to licenses granted before its commencement, and the period of 25 years is a period specified in the license on the expiry of which the option of purchase was legally exercisable.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": "s.6(1)(a) Indian Electricity Act, 1910"
    },
    {
      "id": "ra3",
      "text": "Sub-sections (4) and (5) of the new s.6 did not cut down the plain meaning of sub-s (1) of the section and the option on the expiry of the period of 25 years was vested under sub-s (1) of s.6, though this period did not expire 18 months after September 5, 1959.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": "s.6(1), s.6(4), s.6(5) Indian Electricity Act, 1910"
    },
    {
      "id": "ra4",
      "text": "As the State Electricity Board did not send to the State Government any intimation in writing of its intention to exercise the option on the expiry of December 2, 1960 as required by sub-s (4) of s.6, the Board must be deemed to have elected not to exercise this option, and consequently by sub-s (2) of s.6, the State Government is vested with the option.",
      "supporting_facts": [
        "f9",
        "f10",
        "f11"
      ],
      "legal_basis": "s.6(2), s.6(4) Indian Electricity Act, 1910"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The fourth contention of Mr. Viswanatha Sastry is sound: assuming the option vested in the State Electricity Board under s.6(1), and as the Board duly elected to purchase, the State Government acquired no right or option under s.6(2).",
      "addresses_issue": "i1",
      "key_observation": "State Electricity Board abandoned its notices, but had elected; State has no option."
    },
    {
      "id": "cr2",
      "text": "Sub-s (4) of s.6 imposed duty on Board to give notice 18 months before expiry, but s.6 came into force Sep 5, 1959, and period expired Dec 2, 1960; impossible to give 18 months notice, excused by maxim 'lex non cogitat ad impossibilia' (law does not compel impossibilities); thus Board not required to give notice, cannot be deemed not to have elected.",
      "addresses_issue": "i1",
      "key_observation": "Performance of impossible duty excused; Board's election stands."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The State Government never became vested with the option of purchasing the undertaking under sub-s (2) of s.6 as the State Electricity Board duly elected to purchase.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Indian Electricity Act, 1910",
      "sections": [
        "s.6",
        "s.7",
        "s.7(1)",
        "s.7(4)",
        "s.7A(4)"
      ],
      "relevance": "Governs option to purchase undertaking; new s.6 substituted by Amendment Act 1959; interprets vesting of option in Board and when it passes to Government."
    },
    {
      "name": "Electricity (Supply) Act, 1948",
      "sections": [
        "s.71"
      ],
      "relevance": "Transfers right and option to purchase to State Electricity Board."
    },
    {
      "name": "Indian Electricity (Amendment) Act, 1959",
      "sections": [
        "s.6"
      ],
      "relevance": "Substitutes new s.6 effective Sep 5, 1959."
    },
    {
      "name": "Part B States (Laws) Act, 1951",
      "sections": [],
      "relevance": "Makes Indian Electricity Act, 1910 and Electricity Supply Act, 1948 applicable to Travancore-Cochin."
    },
    {
      "name": "Cochin Electricity Regulation III of 1902",
      "sections": [
        "s.7(1)"
      ],
      "relevance": "Original license under this; s.7(1) corresponds to Indian Electricity Act s.7(1)."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; respondent State of Kerala restrained from taking any action under notice Ex. G dated November 20, 1959.",
    "relief_granted": "Restraint on State from acting under Ex. G",
    "costs": "Respondent to pay costs in this Court"
  },
  "key_quotes": [
    {
      "text": "the performance of this impossible duty must be excused in accordance with the maxim, lex non cogitat ad impossibilia — the law does not compel the doing of impossibilities",
      "speaker": "court",
      "significance": "Key reasoning excusing Board's non-compliance with 18-month notice requirement"
    },
    {
      "text": "Sub-section (1) of s.6 expressly vests in the State Electricity Board the option of purchase on the expiry of the relevant period specified in the license. But the State Government claims that under sub-s (2) of s.6 it is now vested with the option.",
      "speaker": "court",
      "significance": "Explains why State's option does not vest"
    }
  ],
  "_case_id": "1965_231",
  "_label": 1,
  "_text_length": 17267,
  "_extracted_at": "2026-02-10T19:27:00.018711"
}