{
  "metadata": {
    "case_name": "Ram Charan Das v. Girja Nandini Devi",
    "case_year": 1965,
    "court": "Supreme Court of India",
    "judges": [
      "Mudholkar, J."
    ],
    "case_number": "Civil Appeal No. 520 of 1961",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Property originally belonged to Chunnilal, who by will in 1883 devised it to Kanhaiyalal and his brother Madho Prasad.",
      "type": "background",
      "date": "1883",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Madho Prasad died during lifetime of Kanhaiyalal, leaving daughter Maheshwari Bibi.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Kanhaiyalal died on June 10, 1922 without leaving a widow or any issue.",
      "type": "material",
      "date": "1922-06-10",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "After Kanhaiyalal's death, Kadma Kuar, his mother, entered into possession of the entire property.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Kanhaiyalal and Madho Prasad had a sister Mst. Pyari Bibi, who had son Gopinath (died 1934, leaving widow Girja Nandini, defendant No. 1).",
      "type": "background",
      "date": "1934",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Plaintiff Ram Charan Das is sixth son of Diwan Madan Gopal, son of Brijlal, son of Deoki Nandan (elder brother of Chunnilal), thus collateral of Kanhaiyalal and next reversioner with brothers after Kadma Kuar.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Soon after Kadma Kuar entered possession, Court of Wards took over management under s. 10 of U.P. Court of Wards Act, 1912, including property bequeathed to Madho Prasad which Kanhaiyalal possessed.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Maheshwari Bibi claimed half estate as tenant-in-common; Court of Wards released half to her upon Kadma Kuar's agreement.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Suit No. 30 of 1932 by Gopinath claiming to be next reversioner under Hindu Law of Inheritance Amendment Act 1929, seeking declaration against release to Maheshwari Bibi; withdrawn.",
      "type": "procedural",
      "date": "1932",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Suit No. 53 of 1932 by plaintiff Ram Charan Das and Suit No. 54 of 1932 by brother Hanuman Prasad claiming to be nearest reversioners, Act 1929 does not affect rights, Maheshwari and Gopinath have no right; compromised.",
      "type": "procedural",
      "date": "1932",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Compromise in Suit No. 53 of 1932 dated March 31, 1933 embodied in deed Ex. Y-13; parties include Kadma Kuar (1st party), Gopinath (2nd party), Ram Charan Das and brothers (3rd party).",
      "type": "material",
      "date": "1933-03-31",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Ex. Y-13: Kadma Kuar renounces claims to estate in favour of 2nd and 3rd parties; 2nd party gets List A properties, 3rd party List B; management of Arrah Kalan to Kadma for life, then jointly.",
      "type": "material",
      "date": "1933-03-31",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Kadma Kuar died on October 14, 1937; suit instituted shortly thereafter by plaintiff.",
      "type": "material",
      "date": "1937-10-14",
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Plaintiff concedes no claim to items 1,2 (Hewett Road, Goshain Tola) and item 7 (8 anna share in Zamindari village) of List A.",
      "type": "admitted",
      "date": "1964-04-14",
      "source": "petitioner"
    },
    {
      "id": "f15",
      "text": "Gopinath paid off liabilities/debts of properties allotted to him, including to Court of Wards for release.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f16",
      "text": "Allahabad High Court in First Appeal No. 392 of 1944 dated September 23, 1958 upheld deed; trial court also rejected plaintiff's claim.",
      "type": "procedural",
      "date": "1958-09-23",
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Legal effect of deed Ex. Y-13 dated March 31, 1933 described as deed of partition.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether validity of transaction affected by property being under management of Court of Wards.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Deed Ex. Y-13 invalid, not a surrender or family arrangement; Kadma Kuar not entitled to make family settlement; she was under disability as ward under Court of Wards, transaction void.",
      "supporting_facts": [
        "f7",
        "f11",
        "f12"
      ],
      "legal_basis": "s. 37(a) U.P. Court of Wards Act, 1912"
    },
    {
      "id": "pa2",
      "text": "Transaction not surrender of entire estate; divided between reversioners and strangers.",
      "supporting_facts": [
        "f11",
        "f12"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Arrangement temporary, not final, per certain recitals in Ex. Y-13.",
      "supporting_facts": [
        "f12"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Transaction is surrender of estate by Kadma Kuar or alternatively family settlement; plaintiff party to it, estopped from challenging, took benefit, Gopinath discharged debts recoverable from property.",
      "supporting_facts": [
        "f11",
        "f12",
        "f15"
      ],
      "legal_basis": "s. 115 Indian Evidence Act, 1872"
    },
    {
      "id": "ra2",
      "text": "Effective surrender by Kadma Kuar in favour of presumptive reversioner Gopinath.",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Deed Ex. Y-13 is in substance a family arrangement binding on parties, acted upon (Gopinath paid liabilities); compromises suits, settles conflicting claims of Gopinath and plaintiff/brothers to Kanhaiyalal's estate.",
      "addresses_issue": "i1",
      "key_observation": "Document effects compromise of conflicting claims; recitals recognize rights; suits 53/54/1932 compromised per deed."
    },
    {
      "id": "cr2",
      "text": "Settlement final, not temporary; proviso reserves right to challenge recitals but not terms; parties related, possible claims.",
      "addresses_issue": "i1",
      "key_observation": "No express statement of temporary nature; drawn by lawyer; estoppel applies."
    },
    {
      "id": "cr3",
      "text": "Family settlement not alienation/transfer/creation of interest; each party takes by independent title admitted; not barred by s.37(a) U.P. Court of Wards Act as bona fide settlement of family disputes.",
      "addresses_issue": "i2",
      "key_observation": "Court of Wards party to suits, accepted payment from Gopinath for release."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Deed Ex. Y-13 is a valid family arrangement binding on plaintiff.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Validity not affected by Court of Wards management; family settlement not a transfer or creation of interest under s.37(a).",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Ramgouda Annagouda v. Bhausaheb",
      "citation": "L.R. 54 I.A. 396",
      "treatment": "followed",
      "relevance": "Three connected deeds part of one family transaction settling disputes among interested parties."
    },
    {
      "case_name": "Mst. Hiran Bibi v. Mst. Sohan Bibi",
      "citation": "A.I.R. 1914 P.C. 44",
      "treatment": "followed",
      "relevance": "Family compromise not alienation by limited owner."
    },
    {
      "case_name": "Khunni Lal v. Govind Krishna Narain",
      "citation": "I.L.R. 33 All. 356",
      "treatment": "followed",
      "relevance": "Family settlement not alienation."
    },
    {
      "case_name": "Man Singh v. Nowlakhbati",
      "citation": "L.R. 53 I.A. 11",
      "treatment": "distinguished",
      "relevance": "Not family settlement, purported surrender not bona fide, created interest under Court of Wards Act."
    },
    {
      "case_name": "Rangasami Gounden v. Nachiappa Gounden",
      "citation": "L.R. 46 I.A. 72",
      "treatment": "followed",
      "relevance": "Parties to family settlement need not have legal claim, semblance or affection suffices."
    },
    {
      "case_name": "Sureshwar Misser v. Maheshrani Misrain",
      "citation": "L.R. 47 I.A. 233",
      "treatment": "referred",
      "relevance": "Bona fide family compromise valid under Court of Wards principles."
    }
  ],
  "statutes_cited": [
    {
      "name": "U.P. Court of Wards Act, 1912",
      "sections": [
        "s. 10",
        "s. 37(a)"
      ],
      "relevance": "Court took management; ward incompetent to transfer/create charge/interest or contract with liability; family settlement not within purview."
    },
    {
      "name": "Hindu Law of Inheritance (Amendment) Act, 1929",
      "sections": [],
      "relevance": "Basis for Gopinath's claim as sister's son preferential reversioner."
    },
    {
      "name": "Indian Evidence Act, 1872",
      "sections": [
        "s. 115"
      ],
      "relevance": "Estoppel prevents plaintiff challenging after taking benefit."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court holds deed Ex. Y-13 a valid family arrangement binding on plaintiff; not invalidated by Court of Wards; plaintiff's contentions rejected as he took benefits and estopped.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "It seems to us abundantly clear that this document was in substance a family arrangement and, therefore, was binding on all the parties to it.",
      "speaker": "court",
      "significance": "Core holding on nature of Ex. Y-13."
    },
    {
      "text": "Courts give effect to a family settlement upon the broad and general ground that its object is to settle existing or future disputes regarding property amongst members of a family.",
      "speaker": "court",
      "significance": "Principle justifying enforceability of family arrangements."
    },
    {
      "text": "A compromise by way of family settlement is in no sense an alienation by a limited owner of family property.",
      "speaker": "court",
      "significance": "Why not barred by Court of Wards Act."
    }
  ],
  "_case_id": "1965_337",
  "_label": 0,
  "_text_length": 29211,
  "_extracted_at": "2026-02-10T19:28:51.422904"
}