{
  "metadata": {
    "case_name": "Sahib Singh Mehra v. State",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "Raghubar Dayal, J."
    ],
    "case_number": "Criminal Appeal No. 47 of 1963",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Sahib Singh Mehra, appellant, published an article in his paper Kaliyug of Aligarh, dated September 12, 1960, under the heading 'Ultra Chor Kotwal Ko Dante' containing expressions alleging that illicit bribe money from plaintiffs and defendants enters into the pockets of public prosecutors and assistant public prosecutors.",
      "type": "material",
      "date": "1960-09-12",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The Public Prosecutor and the eleven Assistant Public Prosecutors at Aligarh requested the Superintendent of Police for obtaining sanction of the Government for filing a complaint under s. 500 I.P.C.",
      "type": "procedural",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f3",
      "text": "Home Secretary, U.P. Government, conveyed sanction on March 1, 1961, to the Inspector General, U.P., for filing complaint under s. 500 I.P.C. against Editor and Publisher of Kaliyug for defamatory remarks against Assistant Public Prosecutor Sri R. K. Sharma and other police prosecuting staff.",
      "type": "procedural",
      "date": "1961-03-01",
      "source": "prosecution"
    },
    {
      "id": "f4",
      "text": "Public Prosecutor of Aligarh filed complaint in Court of Session, Aligarh, for offence under s. 500 I.P.C.",
      "type": "procedural",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f5",
      "text": "Appellant admitted publication of the impugned article before Sessions Judge, stated no evil intention, published for public good in general terms to bring bad things to notice of Government.",
      "type": "admitted",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "Sessions Judge convicted appellant under s. 500 I.P.C., sentenced to simple imprisonment for six months and fine of Rs. 200, holding statements defamatory and not protected by exceptions 3 and 9 to s. 499 I.P.C.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Appeal against conviction dismissed by Allahabad High Court on January 29, 1963.",
      "type": "procedural",
      "date": "1963-01-29",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Appellant published something defamatory of R. K. Sharma in May 1960; R. K. Sharma filed complaint in September 1960; impugned article referenced this and welcomed action to expose bribe money.",
      "type": "background",
      "date": "1960-05",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Public Prosecutor and Assistant Public Prosecutors deposed they are not corrupt and none at Aligarh is corrupt.",
      "type": "admitted",
      "date": null,
      "source": "prosecution"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the sanction granted was a general sanction and not with respect to defamation of any particular Public Prosecutor or Assistant Public Prosecutor, and whether such sanction was contemplated by law.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether it is proved that the appellant had any intention to harm the reputation of any particular Public Prosecutor or Assistant Public Prosecutor.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether there was evidence that the remarks were defamatory of any particular group.",
      "framed_by": "petitioner"
    },
    {
      "id": "i4",
      "text": "Whether prosecution led evidence to establish that the defamed group had any reputation which could be harmed.",
      "framed_by": "petitioner"
    },
    {
      "id": "i5",
      "text": "Whether the remarks were for public good, protected by exceptions 3 and 9 to s. 499 I.P.C.",
      "framed_by": "petitioner"
    },
    {
      "id": "i6",
      "text": "Whether a collection of persons like prosecuting staff at Aligarh can be defamed under Explanation 2 to s. 499 I.P.C.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Sanction granted was general and not with respect to defamation of any particular Public Prosecutor or Assistant Public Prosecutor and such sanction was not contemplated by law.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": "Section 198B Cr.P.C."
    },
    {
      "id": "pa2",
      "text": "Not proved that appellant had intention to harm reputation of any particular Public Prosecutor or Assistant Public Prosecutor.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": "Section 499 I.P.C."
    },
    {
      "id": "pa3",
      "text": "No evidence that remarks were defamatory of any particular group.",
      "supporting_facts": [
        "f1"
      ],
      "legal_basis": "Explanation 2 to s. 499 I.P.C."
    },
    {
      "id": "pa4",
      "text": "Prosecution did not lead evidence to establish that defamed group had reputation which could be harmed.",
      "supporting_facts": [],
      "legal_basis": null
    },
    {
      "id": "pa5",
      "text": "Remarks were for public good, protected under exceptions 3 and 9 to s. 499 I.P.C.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": "Exceptions 3 and 9 to s. 499 I.P.C."
    },
    {
      "id": "pa6",
      "text": "Sentence is severe and should be reduced to period already undergone.",
      "supporting_facts": [],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Sanction was specific to defamatory remarks against R.K. Sharma and other prosecuting staff.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": "Section 198B Cr.P.C."
    },
    {
      "id": "ra2",
      "text": "Public Prosecutor and Assistants are not corrupt.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Sanction was specific to article containing defamatory remarks against R.K. Sharma and other police prosecuting staff; complaint restricted to Aligarh staff but sanction covers it given context.",
      "addresses_issue": "i1",
      "key_observation": "No defect in form of sanction."
    },
    {
      "id": "cr2",
      "text": "Under s.499 I.P.C. and Explanation 2, defamation possible against collection of persons if identifiable; prosecuting staff at Aligarh is identifiable group.",
      "addresses_issue": "i3",
      "key_observation": "Prosecuting staff forms collection of persons covered by Explanation 2."
    },
    {
      "id": "cr3",
      "text": "Remarks per se defamatory; no defence of truth urged; not for public good as tenor suggests ulterior motive to dissuade legal action.",
      "addresses_issue": "i5",
      "key_observation": "Tendency to lead readers to believe prosecuting staff corrupt, affecting reputation adversely."
    },
    {
      "id": "cr4",
      "text": "No good faith shown for exceptions 3 and 9; presumption of good reputation unless proved otherwise.",
      "addresses_issue": "i4",
      "key_observation": "Prosecution deposed no corruption."
    },
    {
      "id": "cr5",
      "text": "Press must take care; reckless comments to be avoided; deterrent sentence justified for ulterior motive.",
      "addresses_issue": "pa6",
      "key_observation": "No justification to reduce sentence."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Sanction under s.198B Cr.P.C. valid for defamation of identifiable group like prosecuting staff.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Prosecuting staff at Aligarh identifiable collection of persons defamable under Explanation 2 to s.499 I.P.C.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Impugned remarks per se defamatory, not protected by exceptions 3 and 9 to s.499 I.P.C.; offence under s.500 I.P.C. committed.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h4",
      "text": "Sentence of six months SI and Rs.200 fine not to be reduced.",
      "resolves_issue": "pa6",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Indian Penal Code, 1860",
      "sections": [
        "Section 499",
        "Section 500"
      ],
      "relevance": "Defines defamation; exceptions do not protect appellant; offence committed against identifiable group."
    },
    {
      "name": "Code of Criminal Procedure",
      "sections": [
        "Section 198",
        "Section 198B"
      ],
      "relevance": "Requires complaint by aggrieved person except for public servants with government sanction; Public Prosecutor can file with sanction."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal against conviction and sentence under s.500 I.P.C. dismissed; appellant rightly held to have defamed Public Prosecutor and Assistant Public Prosecutors at Aligarh.",
    "relief_granted": "None",
    "costs": "Not mentioned"
  },
  "key_quotes": [
    {
      "text": "\"The prosecuting staff of Aligarh or, as a matter of fact, the prosecuting staff in the State of Uttar Pradesh, is certainly such an identifiable group or collection of persons.\"",
      "speaker": "court",
      "significance": "Holds that group defamation possible under Expl.2 s.499 IPC."
    },
    {
      "text": "\"Reckless comments are to be avoided. When one is proved to have made defamatory comments with an ulterior motive and without the least justification motivated by self-interest, he deserves a deterrent sentence.\"",
      "speaker": "court",
      "significance": "Justifies upholding deterrent sentence."
    }
  ],
  "_case_id": "1965_227",
  "_label": 0,
  "_text_length": 14358,
  "_extracted_at": "2026-02-10T19:26:58.696944"
}