{
  "metadata": {
    "case_name": "Sri Mahant Kaushalya Das v. State",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "Ramaswami, J."
    ],
    "case_number": "Civil Appeal No. 131 of 1963",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The appellant is the hereditary Mahant of Sri Bairaghi Matam -a Hindu Religious and Charitable Institution of a monastic nature. The appellant has been residing in the Matam premises, Elephant Gate, Madras which is a public place of worship.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On March 22, 1963 at about 10 a.m. the appellant was arrested by the police and immediately produced before the VIII Presidency Magistrate on the same day on a charge under s. 4(1)(a) of the Madras Prohibition Act on the allegation that he was in possession of 3,960 grams of Ganja concealed in a wooden box in the Matam premises without any permit.",
      "type": "material",
      "date": "1963-03-22",
      "source": "prosecution"
    },
    {
      "id": "f3",
      "text": "The charge framed by the VIII Presidency Magistrate: On 22nd March 1963 at about 8 a.m. at No. 1 General Muthiah Mudali street in C-2 limits, the accused was found in possession of 3,960 grams of Ganja concealed in wooden box in his Matam premises without any permit.",
      "type": "material",
      "date": "1963-03-22",
      "source": "lower_court"
    },
    {
      "id": "f4",
      "text": "The appellant pleaded guilty to the charge and upon that plea he was convicted by the Magistrate to rigorous imprisonment for one year and a fine Rs. 50, in default to rigorous imprisonment for one month.",
      "type": "procedural",
      "date": "1963-03-22",
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "Judgment by the Magistrate dated 22nd March 1963: Accused produced. Pleads guilty. Found guilty. The quantity is very huge viz., 3,960 grams concealed in a wooden box. I convict and sentence him to rigorous imprisonment for one year and to pay a fine of Rs. 50 in default to rigorous imprisonment for one month. Confiscate property.",
      "type": "procedural",
      "date": "1963-03-22",
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "The appellant preferred Criminal Appeal No. 251 of 1963 to the High Court alleging that his eye-sight was very bad and defective, that he was an illiterate person, not acquainted with English or Tamil or with any other South Indian language and that he only knew Hindi as it was spoken in Uttar Pradesh. He also complained that he had no time to consult either his lawyer or his disciples, that the proceedings were rushed through with undue haste, that he did not really plead guilty to the charge and that he never understood the implications of the offence or the proceedings before the Magistrate.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "The appellant filed an affidavit in support of the appeal before the High Court in regard to these allegations.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "Kailasam, J. called for a report from the VIII Presidency Magistrate with regard to the allegations made in the affidavit of the appellant.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "On April 23, 1963 the Magistrate submitted a report: The particulars of the offence were explained to the accused by the Interpreter. It was translated to accused in Hindi by Sri M. Sukumara Rao, Bench Clerk of this Court who has passed examination in Hindi. The plea of guilty by the accused was also interpreted to the Court by Sri M. Sukumara Rao. The allegations contained in the affidavit are false.",
      "type": "procedural",
      "date": "1963-04-23",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Thereafter Kailasam, J. confirmed the conviction and sentence and dismissed the appeal on April 29, 1963.",
      "type": "procedural",
      "date": "1963-04-29",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "This appeal is brought by certificate granted under Art. 134(1)(c) of the Constitution from a judgment of the Madras High Court dated April 29, 1963.",
      "type": "procedural",
      "date": "1963-04-29",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the Magistrate complied with the mandatory provisions of s. 243 Criminal Procedure Code",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether the necessary ingredients of the offence of possession of the contraband article under s. 4(1)(a) of the Madras Prohibition Act have been established as a matter of law",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether under s. 362(2A) Criminal Procedure Code it was sufficient if the Magistrate made a memorandum of the substance of the examination of the accused",
      "framed_by": "respondent"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The Magistrate did not comply with the mandatory provisions of S. 243 Criminal Procedure Code, that the appellant has been deprived of the substance of a fair trial, and that the conviction of the appellant is legally invalid.",
      "supporting_facts": [
        "f4",
        "f5",
        "f6",
        "f7"
      ],
      "legal_basis": "S. 243 Criminal Procedure Code"
    },
    {
      "id": "pa2",
      "text": "The necessary ingredients of the offence of possession of the contraband article under s. 4(1)(a) of the Madras Prohibition Act have not been established as a matter of law.",
      "supporting_facts": [
        "f2",
        "f3"
      ],
      "legal_basis": "s. 4(1)(a) Madras Prohibition Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Under s. 362(2A) Criminal Procedure Code it was sufficient if the Magistrate made a memorandum of the substance of the examination of the accused and that it was not necessary to record the actual words used by the accused.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": "s. 362(2A) Criminal Procedure Code"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "It cannot be disputed in the present case that there has been a violation by the Magistrate of the requirements of s. 243 of the Criminal Procedure Code which states If the accused admits that he has committed the offence of which he is accused, his admission shall be recorded as nearly as possible in the words used by him and, if he shows no sufficient cause why he should not be convicted, the Magistrate may convict him accordingly.",
      "addresses_issue": "i1",
      "key_observation": "It is stated by the Magistrate in his report that the particulars of the offence were explained to the appellant by the Bench Clerk Sri M. Sukumara Rao and that the plea of guilty by the appellant was interpreted to the Court by the same Bench Clerk. It is manifest from the record that the admission of the appellant has not been recorded as nearly as possible in the words used by him, as required by s. 243 of the Criminal Procedure Code."
    },
    {
      "id": "cr2",
      "text": "In our opinion, the requirements of s. 243 of the Criminal Procedure Code are mandatory in character and a violation of these provisions vitiates the trial and renders the conviction legally invalid. The requirement of the section is not a mere empty formality but is a matter of substance intended to secure proper administration of justice.",
      "addresses_issue": "i1",
      "key_observation": "It is important that the terms of the section are strictly complied with because the right of appeal of the accused depends upon the circumstance whether he pleaded guilty or not and it is for this reason that the legislature requires that the exact words used by the accused in his plea of guilty should, as nearly as possible, be recorded in his own language in order to prevent any mistake or misapprehension."
    },
    {
      "id": "cr3",
      "text": "It has been held by the Madras High Court in Queen-Empress v. Erugadu that the violation of the procedure in s. 243 of the Criminal Procedure Code was sufficiently serious to invalidate the conviction of the accused. The same view has been taken by the Calcutta High Court in Shailabala Dasee v. Emperor and by the Allahabad High Court in Mukandi Lal v. State. In our opinion, these cases correctly lay down the law on the point.",
      "addresses_issue": "i1",
      "key_observation": "Precedents support that violation invalidates conviction."
    },
    {
      "id": "cr4",
      "text": "S. 362(2A) of the Criminal Procedure Code has no application in a case where the accused pleads guilty and the special provision of s. 243 of the Criminal Procedure Code would be attracted in such a case. Section 243 of the Criminal Procedure Code is a provision of a special character and according to well-established rule of interpretation that special provision will take precedence and override the general provision of s. 362(2A) of the Criminal Procedure Code.",
      "addresses_issue": "i3",
      "key_observation": "Special provision overrides general."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The requirements of s. 243 of the Criminal Procedure Code are mandatory in character and a violation of these provisions vitiates the trial and renders the conviction legally invalid.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Section 243 of the Criminal Procedure Code is a provision of a special character and according to well-established rule of interpretation that special provision will take precedence and override the general provision of s. 362(2A) of the Criminal Procedure Code.",
      "resolves_issue": "i3",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Queen-Empress v. Erugadu",
      "citation": "I.L.R. 15 Mad. 83",
      "treatment": "followed",
      "relevance": "Violation of the procedure in s. 243 of the Criminal Procedure Code was sufficiently serious to invalidate the conviction of the accused."
    },
    {
      "case_name": "Shailabala Dasee v. Emperor",
      "citation": "I.L.R. 62 Cal. 1127",
      "treatment": "followed",
      "relevance": "Violation of s. 243 CrPC invalidates conviction."
    },
    {
      "case_name": "Mukandi Lal v. State",
      "citation": "A.I.R. 1952 Allahabad 212",
      "treatment": "followed",
      "relevance": "Violation of s. 243 CrPC invalidates conviction."
    }
  ],
  "statutes_cited": [
    {
      "name": "Madras Prohibition Act, 1937 (Madras Act 10 of 1937 as amended by Madras Act 8 of 1958)",
      "sections": [
        "4(1)(a)"
      ],
      "relevance": "Whoever imports, exports, transports or possesses liquor or any intoxicating drug shall be punished... It shall be presumed until the contrary is shown that a person accused of any offence under clauses (a) to (j) of sub-section (1) has committed such offence in respect of any liquor or any intoxicating drug... for the possession of which he is unable to account satisfactorily."
    },
    {
      "name": "Code of Criminal Procedure",
      "sections": [
        "243",
        "362(2A)"
      ],
      "relevance": "S.243: If the accused admits that he has committed the offence... his admission shall be recorded as nearly as possible in the words used by him... S.362(2A): General provision for memorandum of substance, but overridden by special s.243."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "134(1)(c)"
      ],
      "relevance": "Certificate granted for appeal to Supreme Court."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "The Supreme Court held that there was a violation of the mandatory requirements of s.243 CrPC as the appellant's admission was not recorded in his own words, rendering the conviction legally invalid. The appeal was allowed, setting aside the conviction and sentence.",
    "relief_granted": "Conviction and sentence set aside",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "In our opinion, the requirements of s. 243 of the Criminal Procedure Code are mandatory in character and a violation of these provisions vitiates the trial and renders the conviction legally invalid.",
      "speaker": "court",
      "significance": "Core holding on the effect of non-compliance with s.243 CrPC."
    },
    {
      "text": "The requirement of the section is not a mere empty formality but is a matter of substance intended to secure proper administration of justice.",
      "speaker": "court",
      "significance": "Explains the purpose and mandatory nature of s.243 CrPC."
    },
    {
      "text": "Section 243 of the Criminal Procedure Code is a provision of a special character and according to well-established rule of interpretation that special provision will take precedence and override the general provision of s. 362(2A) of the Criminal Procedure Code.",
      "speaker": "court",
      "significance": "Rejects respondent's argument on applicability of s.362(2A)."
    }
  ],
  "_case_id": "1965_129",
  "_label": 1,
  "_text_length": 9045,
  "_extracted_at": "2026-02-10T19:25:39.354831"
}