{
  "metadata": {
    "case_name": "Kanwal Ram & Ors. v. State",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "Sarkar J."
    ],
    "case_number": "Criminal Appeal No. 167 of 1963",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Sadh Ram was married to Kubja sometime in 1940-41. The marriage between the appellant Kanwal Ram and Kubja is said to have taken place in September 1955.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "By September 1955, the Hindu Marriage Act, 1955 had come into force and it prohibited the marriage of a Hindu during the lifetime of his or her spouse.",
      "type": "background",
      "date": "1955-09",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The parties belong to a village in Himachal Pradesh among whom a customary form of marriage called Praina is recognised. Both the marriages were performed according to that form.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "For a marriage in Praina form, the following ceremonies are essential: First some agnatic relation of the bridegroom goes to the bride's house and offers her suhag. Thereafter, a relation of the bride who is called Prainu, brings her to the house of the bridegroom. There at the door of the house of the bridegroom coins are put in a pot and then Puja and Katha reading of holy scriptures are held. The bride then picks up the pot and takes that to the family hearth and bows there. Then she makes obeisance to the father-in-law and the mother-in-law and other elders in the family. Lastly, with feasting the ceremonies end.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The complaint Sadh Ram himself admitted that puja at the entrance and bowing at the hearth by the bride after she had picked up the pot were compulsory ceremonies. He added, If any one of these ceremonies is not performed, then the marriage is not complete.",
      "type": "admitted",
      "date": null,
      "source": "complainant"
    },
    {
      "id": "f6",
      "text": "The only witness who spoke about the ceremonies observed at the marriage of Kubja and Kanwal Ram said was that Seesia had brought the suhag and Hira Nand acted as Prainu. He does not mention any of the other ceremonies.",
      "type": "disputed",
      "date": "1955-09",
      "source": "prosecution"
    },
    {
      "id": "f7",
      "text": "Originally four persons were charged: Kubja the bride, Kanwal Ram the bridegroom, Hira Nand and Seesia both relations of the bride, the latter two having been charged under s. 494 read with s. 109 for abetment of the offence of bigamy committed by the two first mentioned accused. The charges were framed on the complaint of Sadh Ram.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "The complainant had also implicated Hiroo, the mother of Kubja but she was discharged by the magistrate.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "The trial Court acquitted the accused persons but on appeal the Judicial Commissioner of Himachal Pradesh convicted them.",
      "type": "procedural",
      "date": "1963-07-31",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Hira Nand died pending the appeal in this Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Appellant Kanwal Ram stated that he had sexual relationship with Kubja.",
      "type": "disputed",
      "date": null,
      "source": "appellant"
    },
    {
      "id": "f12",
      "text": "A statement filed by Kubja, Hira Nand and Hiroo in answer to an application for restitution of conjugal rights filed by Sadh Ram against Kubja and others, in which it was stated that Kubja married Kanwal Ram after her marriage with Sadh Ram had been dissolved.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the second marriage of Kubja with Kanwal Ram has been proved, specifically whether the essential ceremonies required for its solemnisation according to Praina custom were performed.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "This evidence was not enough to show that the marriage of Kubja and Kanwal Ram can be said to have been performed.",
      "supporting_facts": [
        "f6",
        "f5"
      ],
      "legal_basis": "Bhaurao Shankar Lokhande v. The State of Maharashtra (1965) 2 S.C.R. 837"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Apart from the evidence about the marriage ceremonies there was other evidence which would prove the second marriage: statement by appellant Kanwal Ram that he had sexual relationship with Kubja; statement filed by Kubja, Hira Nand and Hiroo admitting the second marriage after dissolution of first.",
      "supporting_facts": [
        "f11",
        "f12"
      ],
      "legal_basis": "R. v. Robinson"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The evidence of the witness called to prove the marriage ceremonies showed that the essential ceremonies had not been performed. So that evidence cannot justify the conviction.",
      "addresses_issue": "i1",
      "key_observation": "In Bhaurao Shankar Lokhande v. The State of Maharashtra this Court held that a marriage is not proved unless the essential ceremonies required for its solemnisation are proved to have been performed."
    },
    {
      "id": "cr2",
      "text": "Statement by appellant Kanwal Ram that he had sexual relationship with Kubja, even if true, would at all prove his marriage with Kubja.",
      "addresses_issue": "i1",
      "key_observation": "Sexual relationship does not prove marriage."
    },
    {
      "id": "cr3",
      "text": "The statement admitting the second marriage by Kubja etc. is certainly not evidence of the marriage so far as Kanwal Ram and Seesia are concerned they did not make it. Nor is it evidence of the marriage even against Kubja: treated as an admission, the entire document has to be read as a whole and that would prove the dissolution of the first marriage; in law such admission is not evidence of the fact of the second marriage having taken place.",
      "addresses_issue": "i1",
      "key_observation": "In a bigamy case, the second marriage as a fact, that is to say, the ceremonies constituting it, must be proved. Empress v. Pitambur Singh; Empress v. Kallu; Archbold Criminal Pleading Evidence and Practice 35th ed. Art. 3796, 3781; Morris v. Miller."
    },
    {
      "id": "cr4",
      "text": "R. v. Robinson does not support that it is not necessary to prove that all the ceremonies required for the particular form of marriage had been observed.",
      "addresses_issue": "i1",
      "key_observation": "In R. v. Robinson, the second marriage had been performed according to Scottish custom observing all necessary formalities, but invalid due to residency requirement; invalidity did not affect bigamy liability."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "A marriage is not proved unless the essential ceremonies required for its solemnisation are proved to have been performed.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Admission of marriage by the accused is not evidence of it for the purpose of proving marriage in a bigamy case.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Bhaurao Shankar Lokhande v. The State of Maharashtra",
      "citation": "1965 2 S.C.R. 837",
      "treatment": "followed",
      "relevance": "Marriage not proved unless essential ceremonies proved to have been performed."
    },
    {
      "case_name": "Empress v. Pitambur Singh",
      "citation": "1880 I.L.R. 5 Cal. 566",
      "treatment": "referred",
      "relevance": "In bigamy case, second marriage ceremonies must be proved."
    },
    {
      "case_name": "Empress v. Kallu",
      "citation": "1882 I.L.R. 5 All. 233",
      "treatment": "referred",
      "relevance": "Admission of marriage not evidence in bigamy case."
    },
    {
      "case_name": "Morris v. Miller",
      "citation": "4 Burr 2057 98 E.R. 73",
      "treatment": "referred",
      "relevance": "Admission of marriage not evidence in adultery or bigamy case."
    },
    {
      "case_name": "R. v. Robinson",
      "citation": null,
      "treatment": "distinguished",
      "relevance": "Validity of second marriage does not affect bigamy liability if ceremonies performed; does not dispense with need to prove ceremonies."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "494",
        "109"
      ],
      "relevance": "Bigamy and abetment thereof"
    },
    {
      "name": "Hindu Marriage Act, 1955",
      "sections": [],
      "relevance": "Prohibited marriage of Hindu during lifetime of spouse"
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "The appeal is allowed as the second marriage has not been proved due to lack of evidence on essential ceremonies; conviction by Judicial Commissioner set aside, restoring trial court's acquittal.",
    "relief_granted": "Acquittal of appellants",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"If any one of these ceremonies is not performed, then the marriage is not complete.\"",
      "speaker": "complainant",
      "significance": "Admission by complainant on essential ceremonies for Praina marriage."
    },
    {
      "text": "\"a marriage is not proved unless the essential ceremonies required for its solemnisation are proved to have been performed.\"",
      "speaker": "court",
      "significance": "Core holding from Bhaurao case applied."
    },
    {
      "text": "\"In a bigamy case, the second marriage as a fact, that is to say, the ceremonies constituting it, must be proved.\"",
      "speaker": "court",
      "significance": "Rejects reliance on admissions or other evidence."
    }
  ],
  "_case_id": "1965_133",
  "_label": 1,
  "_text_length": 6753,
  "_extracted_at": "2026-02-10T19:25:37.232407"
}