{
  "metadata": {
    "case_name": "Madhya Pradesh State Road Transport Corporation v. Madhya Pradesh Transport Co. Pvt. Ltd",
    "case_year": 1965,
    "court": "Supreme Court of India",
    "judges": [
      "Ramaswami, J."
    ],
    "case_number": "Civil Appeal No. 243 of 1965",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "On November 27, 1962 applications were invited for a permit for running a town bus service in Raipur.",
      "type": "procedural",
      "date": "1962-11-27",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On February 20, 1963 it was decided by the Regional Transport Authority to grant a permit for the service to the 3rd respondent--Madhya Pradesh Transport Co. Pvt. Ltd, Raipur.",
      "type": "procedural",
      "date": "1963-02-20",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The 3rd respondent did not produce buses of the required specifications for operating the service though several opportunities were given.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The order granting the permit to the 3rd respondent was revoked by the Regional Transport Authority on September 13, 1964.",
      "type": "procedural",
      "date": "1964-09-13",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Shortly thereafter the Regional Transport Authority granted a temporary permit to the appellant for a period of two months i.e. from September 29 to November 28, 1964 in respect of the aforesaid bus service (order dated 19-9-1964).",
      "type": "procedural",
      "date": "1964-09-19",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "By the order dated November 25, 1964 the Regional Transport Authority granted another temporary permit for 4 months to the appellant from 28-11-1964 on the routes and timings covered by the previous order, to meet public need till regular operations introduced.",
      "type": "procedural",
      "date": "1964-11-25",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "The 3rd respondent moved the High Court of Madhya Pradesh on December 19, 1964 for grant of a writ of certiorari to quash the order of the Regional Transport Authority granting temporary permits to the appellant.",
      "type": "procedural",
      "date": "1964-12-19",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "The High Court allowed the application on January 13, 1965 and issued a writ quashing the order dated November 25, 1964.",
      "type": "procedural",
      "date": "1965-01-13",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Appeal by special leave by the Madhya Pradesh State Road Transport Corporation against the High Court judgment.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Regional Transport Authority invited applications for regular operations on two routes and one additional route; public need aroused for existing routes.",
      "type": "background",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "After revocation of regular permit to respondent No. 3, there was a shortage of necessary number of transport vehicles on the route.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Regional Transport Authority had received large number of letters from responsible members of the public indicating need for town bus operations.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Regional Transport Authority invited fresh applications for permanent permit by Gazette notification dated December 14, 1964.",
      "type": "procedural",
      "date": "1964-12-14",
      "source": "respondent"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Scope and interpretation of s. 62(c) of the Motor Vehicles Act: whether the appellant was entitled to the grant of a temporary permit for 4 months to meet a particular temporary need when there is also a permanent need.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether a temporary permit under s. 62 can be granted for a total period exceeding 4 months, including successive grants.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "There was a particular temporary need for the provision of transport facilities; the High Court erred in holding that whenever there was a permanent need there could be no temporary need, so temporary permit could not be granted under s. 62(c).",
      "supporting_facts": [
        "f11",
        "f12",
        "f10"
      ],
      "legal_basis": "Section 62(c) of the Motor Vehicles Act"
    },
    {
      "id": "pa2",
      "text": "The words 'in any case' in s. 62 do not impose a total limit of 4 months; successive temporary permits can be granted if the temporary need persists, provided no abuse of power.",
      "supporting_facts": [
        "f5",
        "f6"
      ],
      "legal_basis": "Section 62 of the Motor Vehicles Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "A temporary permit cannot be granted for any route when there is a permanent need for providing transport facilities on that route and it has been decided to invite applications for that purpose.",
      "supporting_facts": [
        "f1",
        "f2",
        "f10"
      ],
      "legal_basis": "Section 62(c) of the Motor Vehicles Act; Shri Ram Khanna v. Raingopal Satyanarain 1961 P.L.J. 121"
    },
    {
      "id": "ra2",
      "text": "The Regional Transport Authority ought not to have granted a temporary permit for a total period exceeding the limit of 4 months; 'in any case' means under no circumstances can total exceed 4 months.",
      "supporting_facts": [
        "f5",
        "f6"
      ],
      "legal_basis": "Section 62 of the Motor Vehicles Act"
    },
    {
      "id": "ra3",
      "text": "The order dated November 25, 1964 had expired and fresh applications invited, so declaration would be academic.",
      "supporting_facts": [
        "f13"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Section 62(c) permits grant of temporary permit to meet a particular temporary need; no antithesis between particular temporary need and permanent need; both may coexist on a route. Regional Transport Authority considered temporary need after cancellation of regular permit and shortage of vehicles, valid under s.62(c). High Court view incorrect.",
      "addresses_issue": "i1",
      "key_observation": "Temporary and permanent needs can coexist; s.62(c) not restricted."
    },
    {
      "id": "cr2",
      "text": "'In any case' in s.62 means at any one time no permit exceeds 4 months, but successive permits permissible if need persists and formalities under s.57 not completed; cannot abuse by granting in quick succession without action under s.57.",
      "addresses_issue": "i2",
      "key_observation": "No total 4-month limit across successive grants absent abuse."
    },
    {
      "id": "cr3",
      "text": "Divergence among High Courts resolved: Follow Rajasthan HC in Jairam Dass and Assam HC in Chandi Prasad; contrary views of Madras, Kerala, Nagpur, Mysore HCs incorrect.",
      "addresses_issue": "i1",
      "key_observation": "s.62(c) general, includes temporary need created by inability to provide regular service immediately."
    },
    {
      "id": "cr4",
      "text": "Question not academic as High Court view binds Regional Transport Authorities unless set aside; necessary to declare true position for future.",
      "addresses_issue": "i1",
      "key_observation": "Declaration required despite expiry."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Regional Transport Authority was entitled to grant temporary permit under s.62(c) to appellant to meet particular temporary need despite permanent need.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Temporary permits can be granted successively beyond total 4 months if temporary need persists and no abuse of power by Regional Transport Authority.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Shri Ram Khanna v. Raingopal Satyanarain",
      "citation": "1961 P.L.J. 121",
      "treatment": "doubted",
      "relevance": "Emphasized by RTA and respondent; restrictions under first proviso to s.62, but SC holds temporary need exists alongside permanent."
    },
    {
      "case_name": "Jairam Dass v. Regional Transport Authority",
      "citation": "I.L.R. 1956 Rajasthan 1053",
      "treatment": "followed",
      "relevance": "Temporary permit valid till formalities for increasing regular permits; amounts to temporary need."
    },
    {
      "case_name": "Chandi Prasad Mahajan v. The Regional Transport Authority, Gauhati",
      "citation": "I.L.R. 1952 Assam 9",
      "treatment": "followed",
      "relevance": "s.62(c) general; includes temporary need from inability to provide transport immediately."
    },
    {
      "case_name": "Sri Rama Vilas Service Ltd. v. The Road Traffic Board, Madras",
      "citation": "A.I.R. 1948 Madras 400",
      "treatment": "distinguished",
      "relevance": "Contrary view on s.62(c); held incorrect."
    },
    {
      "case_name": "Balagangadharan v. Regional Transport Board, Quilon",
      "citation": "A.I.R. 1958 Kerala 144",
      "treatment": "distinguished",
      "relevance": "Contrary view on s.62(c); held incorrect."
    },
    {
      "case_name": "Shah Transport Co., Chhindwara v. The State of Madhya Pradesh",
      "citation": "A.I.R. 1952 Nagpur 353",
      "treatment": "distinguished",
      "relevance": "Contrary view on s.62(c); held incorrect."
    },
    {
      "case_name": "Mallasattappa v. The Chairman, Regional Transport Authority, Bangalore",
      "citation": "A.I.R. 1959 Mysore 114",
      "treatment": "distinguished",
      "relevance": "Contrary view on s.62(c); held incorrect."
    }
  ],
  "statutes_cited": [
    {
      "name": "Motor Vehicles Act",
      "sections": [
        "Section 62",
        "Section 62(c)",
        "Section 57",
        "Section 46",
        "Section 54"
      ],
      "relevance": "Interpretation of s.62(c) for temporary permits to meet particular temporary need; provisos restrict grants during pendency of new/renewal apps; no total 4-month limit across grants."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; High Court order dated January 13, 1965 set aside; order of Regional Transport Authority dated November 25, 1964 granting temporary permit to appellant declared legally valid.",
    "relief_granted": "Declaration of validity of temporary permit; High Court writ quashed.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"There is no antithesis between a particular temporary need and a permanent need and it is manifest that these two kinds of need may coexist on a particular route.\"",
      "speaker": "court",
      "significance": "Core holding on interpretation of s.62(c)"
    },
    {
      "text": "\"The section means that at any one time the Regional Transport Authority is not permitted to issue to any person a temporary permit for a period exceeding 4 months, but if the temporary need persists... it would... be permissible... to grant a second temporary permit.\"",
      "speaker": "court",
      "significance": "Clarifies limit on successive temporary permits"
    },
    {
      "text": "\"From the large number of letters from some responsible members of the public... it is clear that the public of Raipur is feeling the need of the town bus operations.\"",
      "speaker": "lower_court",
      "significance": "Justification by RTA for temporary permit"
    }
  ],
  "_case_id": "1965_126",
  "_label": 1,
  "_text_length": 12567,
  "_extracted_at": "2026-02-10T19:25:40.672124"
}