{
  "metadata": {
    "case_name": "Union of India & Ors. v. Lachman Hotchand Kriplani & Ors.",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "Sikri, J."
    ],
    "case_number": "Civil Appeals Nos. 89-93 of 1964",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Respondent Lachman Hotchand Kriplani is a displaced person from West Pakistan with three brothers owning 731 acres and 14 ghuntas of agricultural land in District Nawabshah, Taluka Nawab Shah, Sind.",
      "type": "background",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f2",
      "text": "Respondent submitted claim under Displaced Persons (Claims) Act, 1950 for 1/4 share of the land standing in name of Fatehchand. Claim accepted by Claim Officer on October 7, 1952, assessed as 94-3 standard acres.",
      "type": "admitted",
      "date": "1952-10-07",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Agricultural land in Sind notified under Claims Act, 1950 for claims.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On July 2, 1955, respondent applied for compensation under Displaced Persons (Compensation and Rehabilitation) Act, 1954, stating he was not member of Joint Hindu Family but co-sharer with three others who filed separate claims.",
      "type": "procedural",
      "date": "1955-07-02",
      "source": "respondent"
    },
    {
      "id": "f5",
      "text": "Assistant Settlement Commissioner, after enquiry, held on March 3, 1960 that four co-sharers were members of Joint Hindu Family and whole agricultural land claim treated as joint property.",
      "type": "material",
      "date": "1960-03-03",
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "Statement of account issued to respondent on August 29, 1960 showing gross compensation Rs. 10,701/- calculated as 1/4th share of compensation for 376 standard acres and 12 units (converted to Rs. 42,806/- total).",
      "type": "procedural",
      "date": "1960-08-29",
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "On October 28, 1960, respondent served notice on Regional Settlement Commissioner to rectify statement of account, claiming r.20 or alternatively r.19 applies.",
      "type": "procedural",
      "date": "1960-10-28",
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "Assistant Settlement Commissioner replied that calculation was correct.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Respondent filed petition under Articles 226 and 227 in Bombay High Court. High Court allowed petition, set aside statement of account dated August 29, 1960, directed application of r.19 with rr.51 and 56 etc. Respondent's counsel did not challenge joint family finding.",
      "type": "procedural",
      "date": "1961-08-30",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Appellants obtained special leave; appeals before Supreme Court. Common question in all five appeals; facts similar.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether Rule 19 of the Displaced Persons (Compensation and Rehabilitation) Rules, 1955 applies to verified claims in respect of agricultural land left by members of an undivided Hindu joint family in West Pakistan.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Rule 19 applies only to non-agricultural (urban) land, not agricultural land. Chapter IV of Rules does not deal with agricultural lands; separate provisions in Chapter VIII and elsewhere like Rule 51 govern agricultural claims. No distinction in ss.4,5,6,7,8 of Compensation Act between urban and agricultural verified claims, but scheme of Rules separates them.",
      "supporting_facts": [
        "f3",
        "f6"
      ],
      "legal_basis": "Displaced Persons (Compensation and Rehabilitation) Act, 1954 (ss.4,5,6,7,8); Rules 1955 (Ch.IV, r.19, r.51, Ch.VIII)"
    },
    {
      "id": "pa2",
      "text": "Joint family or co-owners not treated as unit for agricultural claims; no provision in Chapter VIII for joint families or co-owners in agricultural land.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": "Rules 1955 (r.20)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Rule 19 applies to agricultural land; nothing in scheme of Rules or language of r.19 limits it to non-agricultural land. Alternatively, r.20 applies.",
      "supporting_facts": [
        "f2",
        "f4",
        "f6"
      ],
      "legal_basis": "Rules 1955 (r.19, r.20)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Verified claims under Claims Act 1950 include agricultural land in Sind. Sections 4-8 of Compensation Act 1954 apply to both urban and such agricultural verified claims without distinction. Public dues deducted similarly.",
      "addresses_issue": "i1",
      "key_observation": "No basis to distinguish urban and verified agricultural claims in ss.4-8."
    },
    {
      "id": "cr2",
      "text": "Rules 1955: Chapters I-III apply to agricultural verified claims (rr.3,4,6,10,11,12). Chapter IV (incl. r.19) applies; Appendix VII has column for agricultural land and remarks on r.19. r.16,18 exclude agricultural but not r.19. r.51 sets scale for agricultural.",
      "addresses_issue": "i1",
      "key_observation": "Each rule in Ch.IV examined individually; r.19 general, applies to 'properties' incl. agricultural."
    },
    {
      "id": "cr3",
      "text": "r.19 heading and language general: 'properties left by members of undivided Hindu family'; 'claim' refers to verified claims incl. agricultural. No construction limits it. r.20 also applies to co-owners incl. agricultural for equity.",
      "addresses_issue": "i1",
      "key_observation": "Ch.VIII deals with compensation mode for units (individual/joint/co-owner) determined by rr.19/20; does not override them."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Rule 19 applies to verified claims for agricultural land left by undivided Hindu joint family in West Pakistan.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Displaced Persons (Claims) Act, 1950",
      "sections": [
        "Definition of 'claim'"
      ],
      "relevance": "Basis for verified claims including notified agricultural land in Sind."
    },
    {
      "name": "Displaced Persons (Compensation and Rehabilitation) Act, 1954",
      "sections": [
        "ss.2(d) 'public dues'",
        "ss.4,5,6,7,8",
        "s.40"
      ],
      "relevance": "Governs applications for compensation on verified claims; no distinction between urban and verified agricultural; deductions and payment modes."
    },
    {
      "name": "Displaced Persons (Compensation and Rehabilitation) Rules, 1955",
      "sections": [
        "r.3,4,6,10,11,12,13,14,15,16,18,19,20,49,51,56"
      ],
      "relevance": "Procedure for claims; r.19 special provision for joint families applicable to agricultural verified claims; r.51 scale for agricultural."
    },
    {
      "name": "Displaced Persons (Debt Adjustment) Act, 1951",
      "sections": [
        "s.52"
      ],
      "relevance": "Dues to be deducted under r.13."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Arts. 226, 227"
      ],
      "relevance": "Basis for High Court petition."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court dismissed the appeals with costs, upholding High Court order directing application of r.19 to respondent's agricultural land claim as joint family member. Other appeals also dismissed as common question decided against appellants.",
    "relief_granted": "High Court order affirmed: determine compensation per rr.19,51,56 etc.",
    "costs": "Dismissed with costs."
  },
  "key_quotes": [
    {
      "text": "\"Rule 19 reads thus Special Provision for payment of compensation to Joint families--Where a claim relates to properties left by the members of an undivided Hindu family in West Pakistan...\"",
      "speaker": "court",
      "significance": "Quotes full r.19 to emphasize its general language applying to 'properties' including agricultural."
    },
    {
      "text": "\"Accordingly, in agreement with the High Court, we hold that r. 19 will apply to the claim of the respondent in respect of agricultural land left by him as a member of the Joint Hindu Family.\"",
      "speaker": "court",
      "significance": "Core holding affirming r.19 applicability."
    }
  ],
  "_case_id": "1965_109",
  "_label": 0,
  "_text_length": 19718,
  "_extracted_at": "2026-02-10T19:25:40.466850"
}