{
  "metadata": {
    "case_name": "State of Maharashtra v. Prabhakar Pandurang Sanggiri",
    "case_year": 1965,
    "court": "Supreme Court of India",
    "judges": [
      "Subba Rao J."
    ],
    "case_number": "Criminal Appeal No. 107 of 1965",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Prabhakar Pandurang Sanzgiri detained by Government of Maharashtra under S. 30(1)(b) of the Defence of India Rules, 1962, in Bombay District Prison to prevent him from acting in manner prejudicial to defence of India, public safety and maintenance of public order.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Detenu wrote book in Marathi titled 'Anucha Antarangaat (Inside the Atom)' with permission of Government while in detention.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "High Court Judges examined table of contents and opined: manuscript deals with theory of elementary particles objectively, to educate on quantum theory, purely scientific, cannot prejudice defence, public safety or order.",
      "type": "admitted",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f4",
      "text": "In September 1964, detenu applied to Government of Maharashtra for permission to send manuscript out of jail for publication; rejected by letter dated March 27, 1965.",
      "type": "procedural",
      "date": "1964-09",
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "Detenu applied to Superintendent, Arthur Road Prison, for permission to send manuscript out; request rejected.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Detenu filed petition under Art. 226 in Bombay High Court seeking direction to State to permit sending manuscript to wife for publication.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Government in counter-affidavit: not required by law to permit detenu to publish books; did not allege publication prejudicial.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "Bombay High Court held: no curb on civil rights/liberties by detention order; no rules prohibiting sending book out for publication; directed Government to allow sending manuscript to wife.",
      "type": "procedural",
      "date": "1965-06-22",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Conditions of detention governed by Bombay Conditions of Detention Order, 1951; no condition on writing/sending books for publication.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Sub-r.(iii) r.17 of Bombay Order: letters to/from security prisoners censored; if detrimental, withheld or portions deleted; Government did not rely on this for book.",
      "type": "background",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether restriction on detenu sending manuscript book out of jail for publication is in terms of Defence of India Rules, or in contravention thereof, given no specific condition in detention order prohibits it.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether detention inherently deprives detenu of right to publish book as attribute of personal freedom, per A.K. Gopalan.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether restriction can only be imposed by order under cls.(f) and (h) of sub-r.(1) r.30 of Rules, complying with s.44 of Act.",
      "framed_by": "respondent"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Detained person loses freedom, exercises only privileges conferred by detention order; Bombay Conditions of Detention Order, 1951 confers no privilege/right to write book and send out for publication.",
      "supporting_facts": [
        "f1",
        "f9"
      ],
      "legal_basis": "A.K. Gopalan v. State of Madras (1950 SCR 88)"
    },
    {
      "id": "pa2",
      "text": "Government not required by law to permit detenu to publish books while in detention.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Restriction only by order under cls.(f) and (h) sub-r.(1) r.30 of Rules, in compliance with s.44 of Defence of India Act; impugned restriction neither.",
      "supporting_facts": [
        "f4",
        "f5"
      ],
      "legal_basis": "Defence of India Rules r.30(1)(f),(h); Defence of India Act s.44"
    },
    {
      "id": "ra2",
      "text": "Neither detention order nor conditions of detention enable Government to prevent sending manuscript out for publication.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": "Bombay Conditions of Detention Order, 1951"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Art.358/359 suspend rights only if deprivation under Act/Rules; if contravention, right to approach court under Art.226 remains.",
      "addresses_issue": "i1",
      "key_observation": "Question is whether liberty restricted in terms of Rules."
    },
    {
      "id": "cr2",
      "text": "Under r.30(4), detention under conditions determined by Government; Maharashtra applied Bombay Conditions of Detention Order, 1951, which has no condition on writing/sending books.",
      "addresses_issue": "i1",
      "key_observation": "No restrictions other than those prescribed under r.30(4) can be imposed."
    },
    {
      "id": "cr3",
      "text": "Conditions are not mere privileges but limits on restrictions; absence of prohibition means no restriction valid.",
      "addresses_issue": "i2",
      "key_observation": "Cannot interpret to allow starving detenu if no food condition."
    },
    {
      "id": "cr4",
      "text": "Das J. observation in Gopalan not accepted by all judges; multiple views on Art.19/21 reconciliation; not last word.",
      "addresses_issue": "i2",
      "key_observation": "Cites second Kochunnis case summarizing views."
    },
    {
      "id": "cr5",
      "text": "Sub-r.(iii) r.17 on letters, not books; Government did not rely on it or claim detriment.",
      "addresses_issue": "i1",
      "key_observation": "Prima facie applies only to letters."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Restriction on sending manuscript out infringes personal liberty in derogation of law whereunder detained, as no condition in Bombay Order prohibits.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "State acted contrary to law in refusing permission; must allow sending to wife for publication.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "A.K. Gopalan v. State of Madras",
      "citation": "1950 S.C.R. 88",
      "treatment": "distinguished",
      "relevance": "Petitioner relied on Das J. view that detention deprives Art.19 rights as attributes of free man; court holds not accepted by all judges, not binding."
    },
    {
      "case_name": "Second Kochunnis case",
      "citation": "1960 3 S.C.R. 887",
      "treatment": "followed",
      "relevance": "Summarizes diverse views of judges in Gopalan on Art.19/21."
    }
  ],
  "statutes_cited": [
    {
      "name": "Defence of India Act, 1962",
      "sections": [
        "s.3",
        "s.44"
      ],
      "relevance": "Power to make Rules; compliance required for restrictions under r.30(1)(f),(h)."
    },
    {
      "name": "Defence of India Rules, 1962",
      "sections": [
        "r.30(1)(b)",
        "r.30(4)",
        "r.30(1)(f)",
        "r.30(1)(h)",
        "r.17(iii)"
      ],
      "relevance": "Basis for detention and conditions; only prescribed restrictions valid."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art.19",
        "Art.21",
        "Art.226",
        "Art.358",
        "Art.359"
      ],
      "relevance": "Suspension during emergency conditional; right to approach court if contravention of law."
    },
    {
      "name": "Bombay Conditions of Detention Order, 1951",
      "sections": [],
      "relevance": "Governs conditions; no provision prohibiting books/publication."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court dismissed appeal by State of Maharashtra, upholding Bombay High Court order directing permission to send manuscript book to detenu's wife for publication, as no legal restriction exists under detention conditions.",
    "relief_granted": "High Court direction upheld: allow detenu to send manuscript to wife for publication.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"the conditions regulating the restrictions on the personal liberty of a detenu are not privileges conferred on him, but are the conditions subject to which his liberty can be restricted.\"",
      "speaker": "court",
      "significance": "Core holding distinguishing privileges from limits on restrictions."
    },
    {
      "text": "\"No restrictions other than those prescribed under sub-r.(4) of r.30 can be imposed on a detenu.\"",
      "speaker": "court",
      "significance": "Defines scope of valid restrictions during detention."
    },
    {
      "text": "\"we are satisfied that the manuscript book deals with the theory of elementary particles in an objective way... purely of scientific interest and it cannot possibly cause any prejudice.\"",
      "speaker": "lower_court",
      "significance": "High Court assessment of book's content, unchallenged."
    }
  ],
  "_case_id": "1965_54",
  "_label": 0,
  "_text_length": 15079,
  "_extracted_at": "2026-02-10T19:24:57.372906"
}