{
  "metadata": {
    "case_name": "Calcutta Tramways Co. Ltd. v. Corporation of Calcutta",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "Subba Rao, J."
    ],
    "case_number": "Civil Appeal No. 245 of 1964",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "On or about October 2, 1879, the Corporation of the town of Calcutta incorporated under Bengal Act IV of 1876 entered into an agreement in writing with Dillwyn Parrish, Alfresh Parrish and Robinson Souttar (grantees), granting right to construct, maintain and use certain tramways in Calcutta on payment of certain rents.",
      "type": "background",
      "date": "1879-10-02",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The 1879 agreement contained an arbitration clause for referring disputes arising under the agreement to arbitration.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Clause 28 of the 1879 agreement provided that 'the said Corporation' would include the Corporation and its successors.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Subsequent agreements entered into on November 22, 1879, September 2, 1893 and December 9, 1899 between successors of the Corporation and grantees, confirmed by appropriate Acts; all contained similar arbitration clauses; appellant's predecessor agreed to pay rents.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Corporation of Calcutta is successor of properties of Corporation of the town of Calcutta under Bengal Act II of 1888.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Calcutta Tramways Co. Ltd. (appellant) is successor/assignee of the grantees.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "On August 30, 1951, State of West Bengal entered into agreement with appellant to purchase the undertaking.",
      "type": "material",
      "date": "1951-08-30",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Calcutta Tramways Act, 1951 (WB Act XXV of 1951) passed and effective October 18, 1951; Government substituted for Corporation under various agreements, subject to reservation that sums payable under agreements payable by appellant to Corporation.",
      "type": "material",
      "date": "1951-10-18",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Disputes arose regarding track rent payable by appellant to Corporation; dispute referred to arbitration per arbitration clause.",
      "type": "disputed",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Parties appointed arbitrators per clause, but appellant nominated without prejudice to rights.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Appellant filed application on January 7, 1963 in Original Side of Calcutta High Court for determination of validity of arbitration agreement and incidental reliefs.",
      "type": "procedural",
      "date": "1963-01-07",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Calcutta High Court (A.N. Ray, J.) on February 13, 1963 held valid arbitration agreement between appellant and respondent; appellant party to arbitration clauses; reference valid.",
      "type": "procedural",
      "date": "1963-02-13",
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Appellant filed present appeal by special leave against High Court order.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether there was a valid arbitration agreement between the appellant and the respondent after the Calcutta Tramways Act, 1951, particularly whether the Corporation could rely on arbitration clauses for disputes regarding sums payable.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "All rights of Corporation under agreements transferred to Government under Tramways Act, 1951 except sums payable; therefore Corporation cannot rely on arbitration clauses and refer disputes re sums payable to arbitration.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": "West Bengal Act XXV of 1951"
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Under Section 5 of WB Act XXV of 1951, Government statutorily substituted for respondent in agreements unless subject-matter or context otherwise requires; proviso saves sums payable to bodies as if Act not passed.",
      "addresses_issue": "i1",
      "key_observation": "Proviso excludes operation of fiction re sums payable; agreements intact for that purpose."
    },
    {
      "id": "cr2",
      "text": "Relevant agreements provide for recovery of rents and arbitration procedure; substantive right to payment and procedural right to arbitration interconnected and not severable.",
      "addresses_issue": "i1",
      "key_observation": "To preserve substantive right but withhold procedural right denies remedy."
    },
    {
      "id": "cr3",
      "text": "Appellant's contention would make new agreement, compel Corporation to give up agreed remedy; alternative of Government enforcing arbitration incongruous as dispute between appellant and Corporation but arbitration with third party.",
      "addresses_issue": "i1",
      "key_observation": "No trusteeship provision in Act."
    },
    {
      "id": "cr4",
      "text": "Proviso brings subject-matter of sums payable (substantive and procedural) within exception; fiction yields to contract terms; both right to sums and arbitration procedure saved.",
      "addresses_issue": "i1",
      "key_observation": "Fair construction removes anomalies."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Both the right to sums payable and procedure of arbitration saved under proviso to Section 5; valid arbitration agreement exists; reference valid.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Bengal Act IV of 1876",
      "sections": [],
      "relevance": "Incorporated Corporation of the town of Calcutta"
    },
    {
      "name": "Bengal Act II of 1888",
      "sections": [],
      "relevance": "Constituted Corporation of Calcutta as successor"
    },
    {
      "name": "Calcutta Tramways Act, 1951 (West Bengal Act XXV of 1951)",
      "sections": [
        "Section 3",
        "Section 4",
        "Section 5"
      ],
      "relevance": "Confirmed purchase agreement; transferred powers/duties; substituted Government for Corporation in agreements with proviso saving sums payable to Corporation"
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal is dismissed. The Supreme Court holds that the arbitration agreement remains valid between the appellant and the respondent under the proviso to Section 5 of the Calcutta Tramways Act, 1951, upholding the Calcutta High Court's order that the reference to arbitration is valid, legal and effective.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "To preserve the substantive right and to withhold the procedural right to enforce it is to save the right and to deny the remedy.",
      "speaker": "court",
      "significance": "Explains inseparability of substantive right to rents and procedural arbitration remedy"
    },
    {
      "text": "The fiction in s. 5 of the Act shall yield to that extent, to the terms of the contract. On such a construction we hold... that both the right to the said sums payable and the procedure of arbitration are saved thereunder.",
      "speaker": "court",
      "significance": "Core holding on interpretation of Section 5 proviso"
    }
  ],
  "_case_id": "1965_22",
  "_label": 0,
  "_text_length": 9323,
  "_extracted_at": "2026-02-10T19:24:52.382631"
}