{
  "metadata": {
    "case_name": "Commissioner of Agricultural Income-tax v. Respondent Tea Company",
    "case_year": 1962,
    "court": "Supreme Court of India",
    "judges": [
      "Satyanarayana Raju, J."
    ],
    "case_number": "Special Leave Appeal against Income-tax Reference Case No. 10 of 1962",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The respondent is a company which carries on the business of manufacturing and selling tea.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "For the purpose of affording shade to the tea bushes, the respondent grows grevelia trees in its different tea estates.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "There is no controversy about the fact that the owners of tea estates plant grevelia trees not for the purpose of deriving any income therefrom but solely for the purpose of providing shade for the tea plants and that such shade is essential for the proper cultivation of tea.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "During the accounting year relevant to the assessment year 1957-58, the respondent received a sum of Rs. 600-12-0 by the sale of grevelia firewood.",
      "type": "material",
      "date": "1957-58",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "This amount was included by the Agricultural Income-tax Officer, Special Circle, Quilon, in computing the agricultural income of the respondent.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The respondent appealed to the Deputy Commissioner of Agricultural Income-tax Sales Tax, Quilon, contending that the said sum was a capital receipt, but the Deputy Commissioner rejected the contention.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "The contention was reiterated by the respondent in second appeal filed by it to the Kerala Agricultural Income-tax Appellate Tribunal.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "The Appellate Tribunal by its order dated August 2, 1962, held that the said sum could not be considered to be a revenue receipt and was not therefore liable to be included in computing the agricultural income of the respondent.",
      "type": "procedural",
      "date": "1962-08-02",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "On a reference made to the High Court of Kerala in Income-tax Reference Case No. 10 of 1962, the Division Bench agreed with the Tribunal and answered the question in favor of the respondent.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "The appellant thereupon applied to this court and obtained special leave.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "The trees were cut down and sold after they had become useless by efflux of time.",
      "type": "material",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the amount realized by the sale of grevelia trees as firewood is a revenue receipt and liable to tax under the Kerala Agricultural Income-tax Act, 1950.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The sale proceeds of the firewood of the grevelia trees constituted agricultural income.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": "Section 2 of the Kerala Agricultural Income-tax Act, 1950"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The grevelia trees of the tea estates of the respondent constituted capital assets.",
      "supporting_facts": [
        "f2",
        "f3",
        "f11"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The question is whether the sale proceeds of grevelia trees which had become useless, did not fall within the definition of agricultural income under the Act.",
      "addresses_issue": "i1",
      "key_observation": "The grevelia trees in the tea estate of the respondent constituted therefore capital assets and the proceeds derived therefrom by sale as firewood would not constitute agricultural income under the Act."
    },
    {
      "id": "cr2",
      "text": "Section 2 of the Kerala Agricultural Income-tax Act, 1950 defines agricultural income as (1) any rent or revenue derived from land which is used for agricultural purposes (2) any income derived from such land in the State by agriculture, or the performance by a cultivator or receiver of rent-in-kind to render the produce raised or received by him fit to be taken to market, or the sale by a cultivator or receiver of rent-in-kind of the produce raised or received by him, in respect of which no process has been performed than a process of the nature described in sub-clause (ii).",
      "addresses_issue": "i1",
      "key_observation": "Trees planted solely for shade, essential for tea cultivation, not for deriving income."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The grevelia trees constituted capital assets and the proceeds derived therefrom by sale as firewood would not constitute agricultural income under the Act.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Kerala Agricultural Income-tax Act, 1950 (XXII of 1950)",
      "sections": [
        "Section 2"
      ],
      "relevance": "Defines agricultural income; sale proceeds do not fall within the definition as trees were for shade, not produce for income."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal by special leave against the High Court judgment is dismissed, upholding that the sale proceeds of grevelia firewood are capital receipt not liable to agricultural income-tax.",
    "relief_granted": "Amount of Rs. 600-12-0 not includible in agricultural income.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The grevelia trees in the tea estate of the respondent constituted therefore capital assets and the proceeds derived therefrom by sale as firewood would not constitute agricultural income under the Act.",
      "speaker": "court",
      "significance": "Core holding of the judgment."
    },
    {
      "text": "There is no controversy about the fact that the owners of tea estates plant grevelia trees not for the purpose of deriving any income therefrom but solely for the purpose of providing shade for the tea plants.",
      "speaker": "court",
      "significance": "Admits key fact distinguishing trees from agricultural produce."
    }
  ],
  "_case_id": "1965_316",
  "_label": 0,
  "_text_length": 3456,
  "_extracted_at": "2026-02-10T19:28:05.860107"
}