{
  "metadata": {
    "case_name": "Assessee v. Commissioner of Income-tax",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "Shah, J."
    ],
    "case_number": "Civil Appeals Nos. 199, 200, 201, 202 of 1964",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant carried on business at Nuzvid as a moneylender and conducted a cinematography theatre.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "In respect of income from property and business, appellant submitted a return for assessment year 1947-48 and disclosed in statement dated August 26, 1949, that Sita Devi-Maharani of Baroda had between November 10, 1945 and February 11, 1948 out of natural love and affection given her some jewellery and four amounts of money aggregating Rs. 5,20,000/-",
      "type": "admitted",
      "date": "1945-11-10 to 1948-02-11",
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "Income-tax Officer, Special Circle, Vijayawada, accepted appellant's statement and did not treat the money and jewellery as taxable income for 1947-48.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "In course of assessment proceedings for year 1951-52, Income-tax Officer inclined to treat money and jewellery as remuneration for services rendered to Sita Devi as maid-servant.",
      "type": "disputed",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f5",
      "text": "Income-tax Officer issued notice under s. 34 of Income-tax Act calling for explanation and evidence relating to receipt of assets admitted in statement dated August 26, 1949, other cash amounts and cheques between August 25, 1948 and October 23, 1952, and other assets in wealth statement.",
      "type": "procedural",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f6",
      "text": "By statement dated November 27, 1953, appellant submitted detailed explanation claiming income received was earned with aid of property given by Sita Devi and Yuvarani of Pithapuram out of love and affection.",
      "type": "admitted",
      "date": "1953-11-27",
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "On December 26, 1954, appellant examined on oath before Income-tax Officer: stated credits are gifts, jewels gifted by Sita Devi, offered to produce correspondence (excluding portions), records with auditors.",
      "type": "admitted",
      "date": "1954-12-26",
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "Income-tax Officer by order dated March 31, 1956 held gifts were remuneration for services as maid-servant or Secretary; determined escaped income: 1946-47 Rs. 4,70,000/- (jewellery 4L, cash 70k), 1947-48 Rs. 2,50,000/-, 1950-51 Rs. 96,600/-, 1951-52 Rs. 30,000/-",
      "type": "procedural",
      "date": "1956-03-31",
      "source": "prosecution"
    },
    {
      "id": "f9",
      "text": "Appellate Assistant Commissioner agreed receipts taxable but valued jewellery for 1946-47 at Rs. 20,000/- and directed consequential modifications.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Income-tax Appellate Tribunal held ITO justified in reopening under s.34, receipts were remuneration taxable for 1946-47, 1947-48, 1950-51, 1951-52; submitted consolidated statements of case to High Court with question on taxability and s.34 invocation (error mentioning 1948-49).",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Andhra Pradesh High Court by judgment dated April 13, 1960 held evidence supported finding appellant was employee of Sita Devi, receipts were remuneration not gifts; for one reference called supplementary statement on s.34 and held justified.",
      "type": "procedural",
      "date": "1960-04-13",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Appellant appealed to Supreme Court by special leave against High Court order.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f13",
      "text": "Department had information from various sources: appellant acted as local agent disbursing salary to Sita Devi's servants in Pittapuram; described as Private Secretary in bill by Bombay Garage Ltd.",
      "type": "disputed",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f14",
      "text": "Appellant belonged to family of Dasis employed in menial capacity in ruling family of Pittapuram; receiving salary of Rs. 8/- per month from Maharaja of Pittapuram.",
      "type": "background",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f15",
      "text": "Appellant associated with Sita Devi for at least 8 years before earliest year; gifts commenced after Sita Devi married Gaekwad of Baroda; lived with her in London 1949-50 and Baroda.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f16",
      "text": "Similar gifts to Narasinghrao (associate) and daughters of appellant's sisters.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether on the facts and circumstances what the assessee received in the relevant years is assessable to tax",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether Section 34 of the Income Tax Act could be invoked in regard to the years 1947-48 and 1950-51",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Receipts were gifts made out of natural love and affection by Sita Devi and Yuvarani of Pithapuram, not income taxable under the Act.",
      "supporting_facts": [
        "f2",
        "f6",
        "f7"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Burden lies on Department to prove receipts are within taxing provision, as they are not income at all, not a claim for exemption.",
      "supporting_facts": [],
      "legal_basis": "Sections 3 and 4 of Income-tax Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Receipts were remuneration for services rendered as maid-servant, secretary or local agent to Sita Devi.",
      "supporting_facts": [
        "f4",
        "f13",
        "f14",
        "f15"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Burden on assessee to prove receipts not taxable; failure to produce evidence allows inference they are taxable income.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "Commissioner of Income-tax v. Calcutta Agency Ltd.; A. Govindarajulu Mudaliar v. Commissioner of Hyderabad"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Act imposes tax on income but does not provide every receipt is income; burden on Department to prove receipt within taxing provision when assessee claims not income (not exemption). High Court erred in placing burden on assessee.",
      "addresses_issue": "i1",
      "key_observation": "Receipts disclosed as from Sita Devi; source not disputed."
    },
    {
      "id": "cr2",
      "text": "Evidence (local agent for salary disbursement, description as Private Secretary in bill) insufficient to prove remuneration; creates suspicion at highest, not proof of master-servant relation or remuneration.",
      "addresses_issue": "i1",
      "key_observation": "Department's information from ex parte statements has no value."
    },
    {
      "id": "cr3",
      "text": "Calcutta Agency Ltd. inapplicable as it was claim for exemption/allowance; Govindarajulu about undisclosed source/nature, but here source disclosed.",
      "addresses_issue": "i1",
      "key_observation": "Inference of taxable income only where source/nature unsatisfactory; not applicable here."
    },
    {
      "id": "cr4",
      "text": "Other circumstances (family background, association duration, timing post-marriage, living together, similar gifts to others) do not prove remuneration.",
      "addresses_issue": "i1",
      "key_observation": "No evidence appellant assisted in divorce/marriage."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "What the assessee received in the relevant years was not assessable to tax.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Commissioner of Income-tax v. Calcutta Agency Ltd.",
      "citation": "19 I.T.R. 191",
      "treatment": "distinguished",
      "relevance": "High Court misapplied; burden on assessee only for exemption claims under s.10(2)(xv), not for proving receipt not income."
    },
    {
      "case_name": "A. Govindarajulu Mudaliar v. Commissioner of Hyderabad",
      "citation": "34 I.T.R. 807",
      "treatment": "distinguished",
      "relevance": "Inference of taxable income where assessee fails to prove source/nature; inapplicable as source disclosed here."
    }
  ],
  "statutes_cited": [
    {
      "name": "Income-tax Act",
      "sections": [
        "Section 3",
        "Section 4(3)(vii)",
        "Section 10(2)(xv)",
        "Section 34"
      ],
      "relevance": "General tax on income (s.3); gifts not income; reopening assessments (s.34); burden analysis."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Supreme Court allowed the appeals, held receipts not assessable to tax, reversed High Court; unnecessary to decide on s.34 as taxability decided in favour of assessee; proceedings pending long, property attached, so decided on merits without remand.",
    "relief_granted": "Appeals allowed; receipts not taxable.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "By ss. 3 4 the Act imposes a general ability to tax upon all income. But the Act does number provide that whatever is received by a person must be regarded as income liable to tax. In all cases in which a receipt is sought to be taxed as income, the burden lies upon the Department to prove that it is within the taxing provision.",
      "speaker": "court",
      "significance": "Core holding on burden of proof."
    },
    {
      "text": "Where however a receipt is of the nature of income, the burden of proving, that it is number taxable because it falls within in exemption provided by the Act lies upon the assessee.",
      "speaker": "court",
      "significance": "Distinguishes between proving not income vs. exemption."
    },
    {
      "text": "The companyclusion of the Tribunal is, therefore, based on matters which may at the highest create some suspicion, and upon its view that the burden of proving that the receipts were number taxable lay upon the appellant.",
      "speaker": "court",
      "significance": "Rejects Tribunal's evidence and reasoning."
    }
  ],
  "_case_id": "1965_120",
  "_label": 1,
  "_text_length": 19479,
  "_extracted_at": "2026-02-10T19:25:42.630804"
}