{
  "metadata": {
    "case_name": "Appellant v. Sholapur Borough Municipality",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "Wanchoo, J."
    ],
    "case_number": "Civil Appeal No. 577 of 1963",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The appellant took on lease two survey numbers from the respondent, Sholapur Borough Municipality on April 1, 1946 for a period of three years. The land is situate within the municipal limits.",
      "type": "background",
      "date": "1946-04-01",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "About November 8, 1946, the Bombay Tenancy Act, No. 29 of 1939 (1939-Act) was applied to this area and s. 3-A of that Act provided that every tenant shall on the expiry of one year from the date of the coming into force of the Bombay Tenancy Amendment Act, No. XXVI of 1946 be deemed to be a protected tenant unless his landlord has within the said period made an application to the Mamlatdar for a declaration that the tenant was not a protected one. The respondent did not file a suit within one year and therefore the appellant claimed to have become a protected tenant under the 1939-Act.",
      "type": "material",
      "date": "1946-11-08",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The 1939-Act was repealed in 1948 by the Bombay Tenancy and Agricultural Lands Act, No. LXVII of 1948 (1948-Act). Section 31 of the 1948-Act provided that for the purposes of this Act, a person shall be recognised to be a protected tenant if such person had been deemed to be a protected tenant under s. 3, 3-A or 4 of the 1939-Act. Section 88 of the 1948-Act inter alia provided that nothing in the foregoing provisions of the 1948-Act shall apply to lands held on lease from a local authority.",
      "type": "background",
      "date": "1948",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Section 89(2) of the 1948-Act provided for the repeal of the 1939-Act except for ss. 3, 3-A and 4 which continued as modified in Sch. I of the 1948-Act. That sub-section provided that nothing in the 1948-Act or any repeal effected thereby shall save as expressly provided in this Act affect or be deemed to affect any right, title, interest, obligation or liability already acquired, accrued or incurred before the commencement of the 1948-Act.",
      "type": "background",
      "date": "1948",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The respondent gave notice to the appellant on May 2, 1955 terminating his tenancy with effect from March 31, 1956.",
      "type": "procedural",
      "date": "1955-05-02",
      "source": "respondent"
    },
    {
      "id": "f6",
      "text": "Subsequently the respondent filed suit No. 42 of 1957 for obtaining possession of the lands and for certain other reliefs. It was held in that suit that the respondent could not get possession of the lands as the appellant was entitled to the benefit of the 1948-Act and consequently the respondent's suit for possession was dismissed.",
      "type": "procedural",
      "date": "1957",
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "The respondent then appealed to the District Court.",
      "type": "procedural",
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "During the pendency of that appeal the appellant made an application on September 8, 1958 for a declaration that he was a protected tenant of the lands and also for fixing rent under the provisions of the Tenancy Act.",
      "type": "procedural",
      "date": "1958-09-08",
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "Further in the appeal filed in the District Court a compromise was arrived at by which the order dismissing the respondent's suit for possession was set aside and the suit was remanded to the trial court with the direction that the suit be stayed and disposed of after the decision by the Mamlatdar. The compromise provided that if the appellant was finally held to be tenant by the authorities under the 1948-Act the suit for possession would be dismissed. It also provided that if the decision in the proceedings under the Tenancy Act went against the appellant, the suit for possession would be decreed.",
      "type": "procedural",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "The Mamlatdar held that the appellant was a tenant and gave him a declaration under s. 70B of the 1948-Act.",
      "type": "procedural",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "The respondent then went in appeal to the Collector, and the Collector decided that the Mamlatdar had no jurisdiction to decide whether the appellant was a tenant.",
      "type": "procedural",
      "source": "respondent"
    },
    {
      "id": "f12",
      "text": "The appellant then went in revision to the Bombay Revenue Tribunal. The tribunal held, in view of the amendments that had been made in the 1948-Act by the Amendment Act of 1956 by which s. 88B was introduced in the 1948-Act, that the revenue court had jurisdiction to decide whether the appellant was a tenant. Finally it remanded the matter to the Collector for decision on the question whether the appellant was a tenant or a protected tenant on the merits.",
      "type": "procedural",
      "source": "petitioner"
    },
    {
      "id": "f13",
      "text": "The respondent contended before the Revenue Tribunal that the appellant could not have the status of a tenant or protected tenant in view of the provisions of the 1948-Act and therefore the respondent filed a petition under Art. 227 of the Constitution of India before the Bombay High Court.",
      "type": "procedural",
      "date": "1961-03-08",
      "source": "respondent"
    },
    {
      "id": "f14",
      "text": "Its contention before the High Court was that in view of s. 88 of the 1948-Act the appellant could not claim to be a protected tenant within the meaning of s. 31 of that Act and therefore the order of the Collector was right. It was also contended that s. 88-B would not apply to the case of the appellant as it came into force on April 1, 1956 after the determination of the tenancy of the appellant by notice. Both these contentions were accepted by the High Court and the order of the Revenue Tribunal was set aside and in its place the order of the Collector dismissing the appellant's application was restored.",
      "type": "procedural",
      "source": "lower_court"
    },
    {
      "id": "f15",
      "text": "Thereupon there was an application to the High Court under Art. 133(1)(c) of the Constitution and the High Court certified the case as a fit one for appeal to this Court.",
      "type": "procedural",
      "source": "court"
    },
    {
      "id": "f16",
      "text": "This appeal was first heard by a Division Bench of this Court and has been referred to a larger Bench in view of certain difficulties relating to the interpretation and inter-relation of ss. 31, 88 and 89 of the 1948-Act and in view of two decisions of this Court.",
      "type": "procedural",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the appellant, lessee from a local authority (Sholapur Borough Municipality), who became a protected tenant under the Bombay Tenancy Act, 1939, continues to have that status under the Bombay Tenancy and Agricultural Lands Act, 1948, particularly in view of the inter-relation of ss. 31, 88 and 89 of the 1948-Act.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether s. 88 of the 1948-Act is an express provision that prevails over the saving clause in s. 89(2)(b) and excludes application of s. 31 to lands held on lease from a local authority.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Reconciliation of precedents: Sakharam v. Manikchand and Mohanlal Chunilal Kothari v. Tribhovan Haribhai Tamboli regarding interpretation of ss. 31, 88 and 89.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Sakharam's case fully covers the present case and on the basis of that case the appeal should be allowed.",
      "supporting_facts": [
        "f2",
        "f3",
        "f4"
      ],
      "legal_basis": "Sakharam v. Manikchand; s. 89(2)(b) of 1948-Act saves rights acquired under 1939-Act"
    },
    {
      "id": "pa2",
      "text": "S. 89(2)(b) protects the interest acquired as a protected tenant under the 1939-Act and s. 88 does not in express terms lay down that the interest acquired by a protected tenant under the 1939-Act is being taken away.",
      "supporting_facts": [
        "f2",
        "f4"
      ],
      "legal_basis": "s. 89(2)(b) of 1948-Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "On the ratio of Mohanlal Chunilal Kothari's case, the appellant should be held not to be a protected tenant and considerations which applied to the interpretation of s. 88(1)(d) equally applied to the interpretation of s. 88(1)(a), (b) and (c). In view of the latter decision, the decision in Sakharam's case no longer holds the field.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": "Mohanlal Chunilal Kothari v. Tribhovan Haribhai Tamboli; s. 88 of 1948-Act"
    },
    {
      "id": "ra2",
      "text": "In view of s. 88 of the 1948-Act the appellant could not claim to be a protected tenant within the meaning of s. 31 of that Act. S. 88-B would not apply as it came into force on April 1, 1956 after the determination of the tenancy by notice.",
      "supporting_facts": [
        "f3",
        "f5",
        "f12"
      ],
      "legal_basis": "s. 88, s. 88B of 1948-Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Ss. 3, 3-A and 4 of the 1939-Act were not repealed and were continued as modified in Sch. I of the 1948-Act only for the purpose of s. 31. No new protected tenants could come into existence under the 1948-Act after December 28, 1948.",
      "addresses_issue": "i1",
      "key_observation": "Protected tenants under 1948-Act are only those recognized under s. 31 who were protected under 1939-Act."
    },
    {
      "id": "cr2",
      "text": "S. 88 lays down that nothing in the foregoing provisions of the 1948-Act shall apply inter-alia to lands held on lease from a local authority. As s. 31 is one of the foregoing sections it will not apply to lands held on lease from a local authority.",
      "addresses_issue": "i2",
      "key_observation": "S. 31 is in effect omitted for such lands; no provision for recognizing protected tenants for local authority leases."
    },
    {
      "id": "cr3",
      "text": "S. 89(2)(b) is qualified by 'save as expressly provided in this Act'. S. 88 is an express provision which takes out such leases from ss. 1 to 87, rendering s. 31 non-existent for local authority leases, thus taking away the protected tenant status expressly.",
      "addresses_issue": "i2",
      "key_observation": "Effect of s. 88(1)(a) is that there will be no protected tenants of lands held on lease from a local authority under the 1948-Act."
    },
    {
      "id": "cr4",
      "text": "In Sakharam's case, more was read into s. 89(2)(b) than justified; full effect not given to 'save as expressly provided'. S. 88 has meaning only if it affects rights under s. 31.",
      "addresses_issue": "i3",
      "key_observation": "Sakharam case does not hold; legislature took away status for public interest."
    },
    {
      "id": "cr5",
      "text": "Supported by Mohanlal Chunilal Kothari's case where s. 88(1)(d) applied retrospectively. Clauses (a), (b), (c) of s. 88(1) apply prospectively and retrospectively to lands held on lease, not confined to date of enactment.",
      "addresses_issue": "i3",
      "key_observation": "View of High Court that s. 88(1)(a) expressly takes away interest of protected tenants under 1939-Act is correct."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The appellant cannot claim the benefit of s. 31 nor is his interest as protected tenant saved by s. 89(2)(b) due to the express provision in s. 88(1)(a). There can be no protected tenants of lands held on lease from a local authority under the 1948-Act.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "S. 88 is an express provision prevailing over s. 89(2)(b) saving clause.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Sakharam v. Manikchand does not hold the field; Mohanlal Chunilal Kothari supports the view taken.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Sakharam v. Manikchand",
      "citation": "1962 2 S.C.R. 59",
      "treatment": "doubted",
      "relevance": "Supported appellant's contention but court holds more read into s. 89(2)(b) than justified; does not hold the field."
    },
    {
      "case_name": "Mohanlal Chunilal Kothari v. Tribhovan Haribhai Tamboli",
      "citation": "1963 2 S.C.R. 707",
      "treatment": "followed",
      "relevance": "Holds s. 88(1)(d) retrospective; considerations apply to s. 88(1)(a),(b),(c); supports s. 88 taking away protected status."
    }
  ],
  "statutes_cited": [
    {
      "name": "Bombay Tenancy Act, 1939",
      "sections": [
        "3",
        "3-A",
        "4"
      ],
      "relevance": "Deemed protected tenants; continued as modified in Sch. I of 1948-Act for purpose of s. 31; rights acquired thereunder affected by s. 88 of 1948-Act."
    },
    {
      "name": "Bombay Tenancy Amendment Act, 1946",
      "sections": [
        "No. XXVI of 1946"
      ],
      "relevance": "Applied 1939-Act to area; triggered s. 3-A deeming protected tenancy."
    },
    {
      "name": "Bombay Tenancy and Agricultural Lands Act, 1948",
      "sections": [
        "31",
        "88",
        "88(1)(a)",
        "88B",
        "89",
        "89(2)(b)",
        "70B"
      ],
      "relevance": "S.31 recognizes 1939 protected tenants; s.88 excludes local authority leases; s.89(2)(b) saving clause overridden by express s.88; s.70B declaration; s.88B via 1956 amendment gives jurisdiction."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 227",
        "Art. 133(1)(c)"
      ],
      "relevance": "Respondent's petition to High Court; certification for SC appeal."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court upheld the Bombay High Court's judgment, holding that s. 88(1)(a) of the 1948-Act expressly excludes lands held on lease from a local authority from the provisions including s. 31, overriding the saving in s. 89(2)(b). The appellant is not a protected tenant; Revenue Tribunal's order set aside restored.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"Nothing in the foregoing provisions of this Act shall apply ... to lands held on lease from ... a local authority.\"",
      "speaker": "court",
      "significance": "Key text of s. 88(1)(a) excluding local authority leases, rendering s. 31 inapplicable."
    },
    {
      "text": "\"save as expressly provided in this Act, affect or be deemed to affect any right, title, interest... already acquired... before the commencement of this Act.\"",
      "speaker": "court",
      "significance": "S. 89(2)(b) saving clause qualified by 'save as expressly provided', overridden by s. 88."
    },
    {
      "text": "In view of this express provision contained in s. 88(1)(a), the appellant cannot claim the benefit of s. 31 nor can it be said that his interest as protected tenant is saved by s. 89(2)(b).",
      "speaker": "court",
      "significance": "Core holding dismissing appeal."
    }
  ],
  "_case_id": "1965_136",
  "_label": 0,
  "_text_length": 19407,
  "_extracted_at": "2026-02-10T19:26:24.466432"
}