{
  "metadata": {
    "case_name": "Petitioner v. Respondents",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "Shah, J."
    ],
    "case_number": "Special Leave Petition (Civil) No. 890 of 1964",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Petitioner commenced suit on July 2, 1951 in the Court of the Subordinate Judge, First Class, Ajmer against the respondents claiming a decree for Rs. 10,665 and for rendition of accounts in respect of the balance of sale proceeds of 104 bales of cotton purchased by him through the agency of the respondents.",
      "type": "material",
      "date": "1951-07-02",
      "source": "petitioner"
    },
    {
      "id": "f2",
      "text": "104 bales of cotton purchased by petitioner were sold by the respondents as his agents on May 14, 1948 for Rs. 27,267/13/6.",
      "type": "material",
      "date": "1948-05-14",
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "Respondents delivered towards that amount a demand draft for Rs. 11,000 which was encashed and four cheques of the aggregate value of Rs. 13,000 which because of lack of arrangement with the respondents bankers were not encashed.",
      "type": "material",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "Petitioner entitled to receive from the respondents Rs. 10,665 being the amount due on the foot of dishonoured cheques and interest thereon at the rate of 6% per annum between July 2, 1947 to July 1, 1951, less Rs. 4,000 subsequently received by him.",
      "type": "material",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "Petitioner also claimed a decree for the balance of the price after giving credit for commission, dalali and godown charges incurred by the respondents as his agents and rendition of account.",
      "type": "material",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "Trial Court passed a decree directing that account be taken for ascertaining the amount due in respect of the entire transaction of 104 bales and appointed a Commissioner.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Commissioner reported that Rs. 12,089/14/6 with interest at the rate of 6% per annum from May 14, 1948 were due to the petitioner.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "High Court of Rajasthan reversed the decree passed by the Trial Court and dismissed the suit, holding that the transactions were those of an unregistered firm constituted by the petitioner and another person named Duli Chand and the suit was barred because the firm was not registered.",
      "type": "procedural",
      "date": "1963-12-16",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Application filed by the petitioner for certificate under Art. 133 of the Constitution was rejected by the High Court.",
      "type": "procedural",
      "date": "1963-12-16",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Petitioner admitted in his plaint that the bales of cotton were sold by the respondents as his agents and the right of the respondents to sell the bales was not in dispute.",
      "type": "admitted",
      "date": null,
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the judgment of the High Court involves a claim or question respecting property of value not less than Rs. 20,000, entitling petitioner to a certificate under Art. 133(1)(b) of the Constitution.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether the case is otherwise fit for appeal to the Supreme Court under Art. 136 of the Constitution.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The judgment of the High Court involves a question relating to the right of the petitioner respecting 104 bales of cotton belonging to him and sold by the respondents for an amount exceeding Rs. 27,000.",
      "supporting_facts": [
        "f2"
      ],
      "legal_basis": "Art. 133(1)(b) of the Constitution"
    },
    {
      "id": "pa2",
      "text": "Pursuant to the order of the Trial Court, a Commissioner reported Rs. 12,089/14/6 with interest at 6% from May 14, 1948 due to petitioner, and adding interest the amount exceeds Rs. 20,000 at the date of the decree of the High Court.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "Art. 133(1)(b) of the Constitution"
    },
    {
      "id": "pa3",
      "text": "Petitioner could not seek certificate under cl. (a) of Art. 133(1) as claim in court of first instance did not reach Rs. 20,000.",
      "supporting_facts": [
        "f1"
      ],
      "legal_basis": "Art. 133(1)(a) of the Constitution"
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "To attract Art. 133(1)(b), the judgment must involve directly or indirectly some claim or question respecting property of amount or value not less than Rs. 20,000; under cl. (a), it is the amount of subject-matter in court of first instance.",
      "addresses_issue": "i1",
      "key_observation": "Variation in language of cls. (a) and (b) of Art. 133(1) highlights different conditions."
    },
    {
      "id": "cr2",
      "text": "The property respecting which the claim or question arises must be property in addition to or other than the subject-matter of the dispute.",
      "addresses_issue": "i1",
      "key_observation": "If no claim respecting property other than subject-matter, cl. (a) applies; here subject-matter was claim for money."
    },
    {
      "id": "cr3",
      "text": "Judgment did not involve any claim or question relating to property in addition to or other than the subject-matter in dispute of value Rs. 20,000; challenged was right of respondents to retain price received.",
      "addresses_issue": "i1",
      "key_observation": "Claim to money due from agent for price of property sold does not involve claim respecting the property sold."
    },
    {
      "id": "cr4",
      "text": "Commissioner's report and added interest still relate to subject-matter in dispute; judgment does not involve claim respecting property other than subject-matter of suit.",
      "addresses_issue": "i1",
      "key_observation": "Petitioner's alternative ground does not assist."
    },
    {
      "id": "cr5",
      "text": "The contention raised by the petitioner under either head has no substance.",
      "addresses_issue": "i2",
      "key_observation": "Judgment of High Court proceeds entirely upon appreciation of evidence and findings; suit stands dismissed."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Art. 133(1)(b) requires judgment involving claim or question respecting property of value not less than Rs. 20,000 in addition to or other than the subject-matter of the dispute.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Present case involves only claim for money as subject-matter; no certificate under Art. 133(1)(b); special leave not granted.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Article 136",
        "Article 133(1)(a)",
        "Article 133(1)(b)"
      ],
      "relevance": "Governs special leave to appeal and certificate for appeal to Supreme Court; cl. (a) based on subject-matter value in first instance, cl. (b) on property claim in judgment appealed from."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Special leave petition dismissed as High Court judgment does not involve claim or question respecting property of value not less than Rs. 20,000 under Art. 133(1)(b) and case not otherwise fit for appeal under Art. 136.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "To attract the application of Art. 133(1)(b) it is essential that there must be... a judgment involving directly or indirectly some claim or question respecting property of an amount or value not less that Rs.20,000.",
      "speaker": "court",
      "significance": "Defines conditions for certificate under Art. 133(1)(b)"
    },
    {
      "text": "The property respecting which the claim or question arises must be property in addition to or other than the subject-matter of the dispute.",
      "speaker": "court",
      "significance": "Distinguishes between cls. (a) and (b) of Art. 133(1)"
    },
    {
      "text": "In our view the contention raised by the petitioner under either head has no substance.",
      "speaker": "court",
      "significance": "Rejects petitioner's arguments outright"
    }
  ],
  "_case_id": "1965_267",
  "_label": 0,
  "_text_length": 7683,
  "_extracted_at": "2026-02-10T19:27:41.355770"
}