{
  "metadata": {
    "case_name": "Petitioner v. State of Kerala",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "Subba Rao, J."
    ],
    "case_number": "Writ Petition No. 95 of 1964",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Kizhakke Kottaram i.e., Eastern Palace, 2 acres and 57 cents in extent, comprised in survey Nos. 646 to 650 in Trivendrum City, originally belonged to His Highness the Maharaja of Travancore.",
      "type": "background",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f2",
      "text": "Under a sale deed dated January 7, 1959, the Maharaja sold the Eastern Palace including land, trees, buildings, out-houses, surrounding wall on all sides, gates and all appurtenant to the petitioner.",
      "type": "material",
      "date": "1959-01-07",
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "The eastern wall in dispute is a portion of the Palace wall situate in survey Nos. 646 to 650 and petitioner has been in possession since purchase.",
      "type": "admitted",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "On October 3, 1963, Government of Kerala passed G.O. MS No. 661/63/Edn. under Travancore Ancient Monuments Preservation Regulation 1 of 1112/M.E., considering Fort walls around Sree Padmanabhaswamy Temple of archaeological importance to be preserved as protected monument, described as situated inter alia in survey Nos. 646 to 650.",
      "type": "procedural",
      "date": "1963-10-03",
      "source": "respondent"
    },
    {
      "id": "f5",
      "text": "Pursuant to G.O., State Government issued notification dated October 3, 1963, declaring the said walls to be a protected monument under the Regulation.",
      "type": "procedural",
      "date": "1963-10-03",
      "source": "respondent"
    },
    {
      "id": "f6",
      "text": "The wall bounding Kizhakke Kottaram on the east is part of the historic fort wall which has always remained and continued to remain the property of Travancore-Cochin and later Kerala Government; petitioner deliberately intermeddled with it and illegally encroached.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f7",
      "text": "Petitioner filed O.P. No. 1502 of 1960 in Kerala High Court for similar relief, dismissed by Vaidialingam J. as seeking declaration of title foreign to Art. 226, appropriate in civil suit; appeal dismissed by Division Bench (Raman Nair and Raghavan JJ.) accepting that view, without going into merits.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "State admitted purchase of Kizhakke Kottaram by petitioner from Maharaja but contested that disputed wall is part of historic Fort wall.",
      "type": "admitted",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f9",
      "text": "Petitioner in physical possession of disputed wall, admitted by State which stated petitioner intermeddled with it.",
      "type": "admitted",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the petition is barred by res judicata due to dismissal of prior Kerala High Court petition O.P. No. 1502/1960.",
      "framed_by": "respondent"
    },
    {
      "id": "i2",
      "text": "Whether petitioner has fundamental right under Art. 19(1)(f) in respect of the disputed wall.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether Travancore Ancient Monuments Preservation Regulation 1 of 1112 M.E. ceased to be law, impliedly repealed by Ancient Monuments Preservation Act 1904, Act LXXI of 1951 or Act XXIV of 1958.",
      "framed_by": "petitioner"
    },
    {
      "id": "i4",
      "text": "Whether the disputed Fort wall is an ancient monument or an archaeological site/remains.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Eastern wall is portion of Palace wall in survey Nos. 646-650, owned and possessed since purchase; notification infringes Art. 19(1)(f).",
      "supporting_facts": [
        "f2",
        "f3"
      ],
      "legal_basis": "Art. 19(1)(f); Sale deed Annexure A-2"
    },
    {
      "id": "pa2",
      "text": "Regulation 1 of 1112 M.E. impliedly repealed by extension of Ancient Monuments Preservation Act 1904 in 1951, or by Act LXXI of 1951 and Act XXIV of 1958, as they cover same field.",
      "supporting_facts": [],
      "legal_basis": "Ancient Monuments Preservation Act 1904; Act LXXI 1951; Act XXIV 1958"
    },
    {
      "id": "pa3",
      "text": "Disputed wall is not ancient monument but archaeological site/remains covered by Entry 40 List III; Central Act 1904 occupied field, repealing State Act.",
      "supporting_facts": [],
      "legal_basis": "Entry 40 List III Seventh Schedule"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Petition barred by res judicata as prior Kerala HC petition for same relief dismissed.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "res judicata"
    },
    {
      "id": "ra2",
      "text": "Disputed wall is part of historic Fort wall around Sree Padmanabhaswamy Temple, always Govt property; petitioner encroached and intermeddled.",
      "supporting_facts": [
        "f6",
        "f8"
      ],
      "legal_basis": "Travancore State Manual, Chief Engineer list 1886, history by K.P. Sankunni Menon, Memoir by Ward and Conner, Trivendrum Gazetteer 1962"
    },
    {
      "id": "ra3",
      "text": "Notification validly issued under State Regulation to preserve historic Fort wall as protected monument.",
      "supporting_facts": [
        "f4",
        "f5"
      ],
      "legal_basis": "Travancore Ancient Monuments Preservation Regulation 1 of 1112 M.E."
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Rejected res judicata: Kerala HC dismissed prior petition without merits, on ground of alternate remedy in civil suit; no final decision on title, so no bar to Art. 32 petition.",
      "addresses_issue": "i1",
      "key_observation": "Where no final decision on title, no scope for res judicata."
    },
    {
      "id": "cr2",
      "text": "Petitioner has possessory title to disputed wall via sale deed (eastern boundary road, outer compound walls conveyed) and physical possession admitted by State.",
      "addresses_issue": "i2",
      "key_observation": "Entitled to protection against interference without sanction of law."
    },
    {
      "id": "cr3",
      "text": "State Regulation 1 of 1112 M.E. (1936) continued in force; not repealed by Central Act 1904 (extended 1951 subject to Parliament's legislative power under Entry 67 List I, no national importance declaration), Act LXXI 1951 (monument not scheduled), or Act XXIV 1958 (no notice for this monument).",
      "addresses_issue": "i3",
      "key_observation": "State Act holds field for non-national importance monuments under Entry 12 List II."
    },
    {
      "id": "cr4",
      "text": "Fort wall is ancient monument (historical structure surviving from former period around Temple), not archaeological site/remains (for exploration/study); State notified as monument under valid State Act s.3.",
      "addresses_issue": "i4",
      "key_observation": "Constitution distinguishes: monuments in State List, sites/remains in Concurrent; argument afterthought, not raised earlier."
    },
    {
      "id": "cr5",
      "text": "Not deciding if disputed wall part of Fort wall; such objections raisable under Act provisions.",
      "addresses_issue": "i2",
      "key_observation": "No need to decide Art. 363 issue."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "No res judicata bar to Art. 32 petition.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Petitioner has possessory right in disputed wall protectable under Art. 19(1)(f), but notification valid as State Regulation holds field and wall is ancient monument.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Travancore Regulation 1 of 1112 M.E. not repealed by Central Acts.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    },
    {
      "id": "h4",
      "text": "Fort wall is ancient monument, notification under State Act valid.",
      "resolves_issue": "i4",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 32",
        "Art. 19(1)(f)",
        "Art. 363",
        "Entry 67 List I",
        "Entry 12 List II",
        "Entry 40 List III Seventh Schedule"
      ],
      "relevance": "Basis for petition, fundamental right, legislative competence distinguishing monuments (State) from sites/remains (Concurrent/national)"
    },
    {
      "name": "Travancore Ancient Monuments Preservation Regulation 1 of 1112 M.E. (1936 A.D.)",
      "sections": [
        "s. 3"
      ],
      "relevance": "State law under which G.O. and notification issued declaring Fort walls protected monument; held valid and continuing"
    },
    {
      "name": "Ancient Monuments Preservation Act, 1904 (Central Act VII)",
      "sections": [],
      "relevance": "Extended to Travancore-Cochin 1951 but subject to Parliament power; no national importance declaration, does not repeal State Act"
    },
    {
      "name": "Part B States (Laws) Act, 1951 (Act III)",
      "sections": [
        "s. 3"
      ],
      "relevance": "Extended Central Act 1904 subject to Parliament's legislative fields"
    },
    {
      "name": "Ancient and Historical Monuments and Archaeological Sites and Remains (Declaration of National Importance) Act, 1951 (Act LXXI)",
      "sections": [
        "s. 3 Part I Schedule"
      ],
      "relevance": "Declares specific monuments national importance; disputed monument not included"
    },
    {
      "name": "Ancient Monuments and Archaeological Sites and Remains Act, 1958 (Act XXIV)",
      "sections": [
        "s. 3",
        "s. 4"
      ],
      "relevance": "Repeals Act LXXI 1951; deems prior declarations national but no notice for this monument"
    },
    {
      "name": "Travancore-Cochin Administration and Application of Law Act, 1125 M.E. (Act VI 1949 A.D.)",
      "sections": [],
      "relevance": "Extended Travancore laws to Travancore-Cochin State"
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Court rejected preliminary objection of res judicata, acknowledged petitioner's possessory title but upheld validity of G.O. and notification under continuing State Regulation as Fort wall is ancient monument; not deciding if disputed wall is part of Fort wall, leaving to proceedings under Act; petition dismissed.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "Every citizen whose fundamental right is infringed by the State has a fundamental right to approach this Court for enforcing his right. If by a final decision of a competent Court his title to property has been negatived, he ceases to have the fundamental right in respect of that property",
      "speaker": "court",
      "significance": "Rejects res judicata as no merits decision in prior HC case"
    },
    {
      "text": "The petitioner has possessory title in the wall and is, therefore entitled to be protected against interference with that right without the sanction of law.",
      "speaker": "court",
      "significance": "Acknowledges petitioner's possession despite upholding notification"
    },
    {
      "text": "Monument means, among others, a structure surviving from a former period whereas archaeology is the scientific study of the life and culture of ancient peoples.",
      "speaker": "court",
      "significance": "Distinguishes ancient monument from archaeological site/remains"
    }
  ],
  "_case_id": "1965_106",
  "_label": 0,
  "_text_length": 18727,
  "_extracted_at": "2026-02-10T19:25:43.217237"
}