{
  "metadata": {
    "case_name": "Commissioner of Income-tax v. P.K.N. Company Ltd.",
    "case_year": null,
    "court": "Supreme Court of India",
    "judges": [
      "Shah, J."
    ],
    "case_number": null,
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "A partnership styled P.K.N. was carrying on money-lending business in several towns in India and also in the Federated States of Malaya.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "In the course of its business the P.K.N. firm acquired rubber estates and other immovables in the Districts of Muar and Segamat in the Federated States of Malaya.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On December 4, 1937, a private limited company was registered in the name of P.K.N. Company Ltd. under the Pudukottai Company Regulation V of 1929 with its head office at Viswanathapuram, in the territories of His Highness the Maharaja of Pudukottai. The share capital of the company was of the face value of 6,60,000 Malayan dollars.",
      "type": "background",
      "date": "1937-12-04",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Between March 23, 1939, and July 8, 1939, an area of more than 3,000 acres of rubber plantations, several houses and open plots of land, which were the assets of the P.K.N. firm, were transferred to the company for an aggregate consideration of 16,50,000 Malayan dollars. In consideration of the transfer, the company allotted shares of the face value of 6,60,000 Malayan dollars to the partners of the firm of P.K.N. and the balance remained outstanding as a debt due by the Company to the firm of P.K.N.",
      "type": "material",
      "date": "1939-03-23 to 1939-07-08",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "On March 14, 1941 the Company purchased a rubber estate called the Lee Estate for 2,62,655 Malayan dollars.",
      "type": "material",
      "date": "1941-03-14",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "On July 7, 1941 the Company purchased for 5,000 Malayan dollars a house in co-ownership with another firm.",
      "type": "material",
      "date": "1941-07-07",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "In the year 1941 and 1942 some of the properties acquired from the firm of P.K.N. were sold by the Company.",
      "type": "material",
      "date": "1941-1942",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Between 1942 and 1945 the territory of Malaya was under occupation by the Japanese forces and during that period some houses belonging to the company were destroyed by fire.",
      "type": "background",
      "date": "1942-1945",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "After 1945 some more lands admeasuring approximately 700 acres in the aggregate were sold by the Company.",
      "type": "material",
      "date": "after 1945",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "On August 1, 1949, the state of Pudukottai integrated with the Province of Madras, and after the extension of the Indian Income-tax Act to that territory.",
      "type": "procedural",
      "date": "1949-08-01",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "The company was assessed by the Income-tax Officer, Pudukottai, as a dealer in real estate and profits amounting to 34,272 Malayan dollars and 40,613 Malayan dollars were brought to tax in the assessment years 1949-50 and 1950-51. But the Income-tax Appellate Tribunal set aside the orders, observing that the activities of the company outside India were limited to the holding of properties, and deriving income therefrom, and that the properties did not come to the company in the course of its money-lending business, nor could it be said that they were acquired for the purpose of resale at a profit, and that the company was formed in order to take over these properties and it would be far from correct to say that the properties taken over were intended to be turned into stock-in-trade, and therefore profits realised by sale of the properties were of capital nature.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Before the order of the Tribunal was pronounced, the Income-tax Officer assessed the company for the assessment year 1951-52 on a total profit of 1,41,326 Malayan dollars earned from the sale of immovable properties. The Appellate Assistant Commissioner confirmed the order in appeal. On further appeal, the Income-tax Appellate Tribunal confirmed the order of the Appellate Assistant Commissioner observing that all the material facts were not brought to the notice of the Tribunal at the hearing of the appeals in respect of the earlier years.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Pursuant to a direction of the High Court of Madras under section 66(2) of the Income-tax Act, 1922, the Tribunal referred the question: Whether, on the facts and circumstances of the case, the surplus of 1,41,326 realised by the assessee-company by the sale of some of its estates and properties held by it in Malaya was income chargeable to tax under the Indian Income-tax Act? The High Court answered the question in favour of the company and held that the amount sought to be brought to tax was not income chargeable under the Indian Income-tax Act.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "With special leave, the Commissioner of Income-tax has appealed to this court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f15",
      "text": "Large amounts of money were spent on cultivation and development of the rubber and coconut estates, and substantial income was derived therefrom.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f16",
      "text": "The total area of 3,000 acres originally transferred by the P.K.N. firm was apparently not a compact block and the company was unable to administer the far-flung estates effectively and economically, and on that account certain small plots of land were sold in 1940 and 1941.",
      "type": "material",
      "date": "1940-1941",
      "source": "court"
    },
    {
      "id": "f17",
      "text": "Thereafter in 1948, 1949 and 1950 lands were sold from time to time and profits were made. As a result of these disposals, the total holding of the Company was reduced to about 2,000 acres of rubber estates, besides some houses acquired from the P.K.N. firm and the Lee Estate.",
      "type": "material",
      "date": "1948-1950",
      "source": "court"
    },
    {
      "id": "f18",
      "text": "Tabulated statement of acquisitions and disposals: Year ended 31-3-39 Purchase 1,577,560; 31-3-40 Purchase 67,213 Sale 7,917 Profit 3,366; etc., totaling Purchase 1,918,328 Sale 998,078 Profit 485,250 Loss 32,454. No fresh acquisitions after July 7, 1941, till 1950. Items in 1943 and 1945 are transfer entries. Loss of 30,600 in 1943 is by fire.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f19",
      "text": "Primary activity of the company was that of planters. Books show expenditures and realizations from rubber sales: 1948 exp Rs.3,50,000 rec Rs.5,25,000; 1949 exp Rs.3,31,000 rec Rs.6,70,000; 1950 exp Rs.5,25,000 rec Rs.16,50,000.",
      "type": "material",
      "date": "1948-1950",
      "source": "court"
    },
    {
      "id": "f20",
      "text": "Memorandum of association contains clauses to carry on business as merchants, commission agents, financiers, etc., and to purchase, sell, deal with properties.",
      "type": "background",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether, on the facts and circumstances of the case, the surplus of 1,41,326 realised by the assessee-company by the sale of some of its estates and properties held by it in Malaya was income chargeable to tax under the Indian Income-tax Act?",
      "framed_by": "lower_court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "In 1951-52, profit of 93,093.79 from rubber estates, 34,425 from houses, 13,050 from joint properties, 150 from coconut tops, net 141,326.42. Subscribed capital 660,000 but acquisitions over 1,800,000. Raised loans and paid interest. Not formed solely for P.K.N. assets. Continuous sales since 1939-40. Development and sales simultaneous. Purchased joint property and sold at profit.",
      "supporting_facts": [
        "f18",
        "f4",
        "f5",
        "f6"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Activities limited to holding properties and deriving income therefrom. Properties not acquired for resale. Company formed to take over properties, not to turn into stock-in-trade. Profits capital nature.",
      "supporting_facts": [
        "f3",
        "f4",
        "f11"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "It is for the revenue to establish that the profit earned in a transaction is within the taxing provision. Nature of transaction determined on all facts. Question whether adventure in nature of trade is mixed question of law and fact. General criteria: related to normal business, subdivision, magnitude, etc. But purchase of land not assumed trade. Profit motive not decisive.",
      "addresses_issue": "i1",
      "key_observation": "Company floated to take over P.K.N. assets. Spent on development, derived income from rubber. Sales when opportunity or necessity, not trading."
    },
    {
      "id": "cr2",
      "text": "No fresh acquisitions after 1941. Sales spread over years, motivated by necessity, difficulty of management. Primary activity planters, dealers in rubber. Incidental sales do not convert investment to trade.",
      "addresses_issue": "i1",
      "key_observation": "Powers in MoA not decisive. Substance over form."
    },
    {
      "id": "cr3",
      "text": "Precedents illustrate need to consider all circumstances. Here, object to carry on planting business, sales incidental.",
      "addresses_issue": "i1",
      "key_observation": "Lee Estate never sold, nucleus for rubber business."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The surplus realised by the sale of properties is capital accretion and not income chargeable to tax.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Janki Ram Bahadur Ram v. Commissioner of Income-tax",
      "citation": null,
      "treatment": "followed",
      "relevance": "Revenue must establish taxability; nature of transaction on facts; mixed question of law and fact; criteria for adventure in trade."
    },
    {
      "case_name": "Karanpura Development Co. Ltd. v. Commissioner of Income-tax",
      "citation": null,
      "treatment": "followed",
      "relevance": "Ownership and leasing as business or owner depends on object; substance over form."
    },
    {
      "case_name": "Kishan Prasad and Co. Ltd. v. Commissioner of Income-tax",
      "citation": null,
      "treatment": "followed",
      "relevance": "Whether transaction within company's power has no bearing on whether profits are capital or revenue."
    },
    {
      "case_name": "Raja J. Rameshwar Rao v. Commissioner of Income-tax",
      "citation": null,
      "treatment": "distinguished",
      "relevance": "Acquisition with view to develop and sell later is trade."
    },
    {
      "case_name": "St. Aubyn Estates Ltd. v. Strick",
      "citation": null,
      "treatment": "distinguished",
      "relevance": "Company with powers to develop and sell did so systematically, constituting trade."
    }
  ],
  "statutes_cited": [
    {
      "name": "Income-tax Act, 1922",
      "sections": [
        "Section 66(2)"
      ],
      "relevance": "Direction for reference to High Court"
    },
    {
      "name": "Pudukottai Company Regulation V of 1929",
      "sections": [],
      "relevance": "Under which company was registered"
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal by the Commissioner of Income-tax is dismissed. The surplus from sale of properties is held to be capital accretion, not taxable income, affirming the High Court.",
    "relief_granted": "Tax assessment set aside in favor of assessee-company",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "it is for the revenue to establish that the profit earned in a transaction is within the taxing provision and is on that account liable to be taxed as income.",
      "speaker": "court",
      "significance": "Burden of proof on revenue"
    },
    {
      "text": "the question whether a transaction is an adventure in the nature of trade must depend upon the collective effect of all the relevant materials brought on the record.",
      "speaker": "court",
      "significance": "Holistic assessment required"
    },
    {
      "text": "Ownership of property and leasing it out may be done as a part of business, or it may be done as land owner. Whether it is the one or the other must necessarily depend upon the object with which the act is done.",
      "speaker": "court",
      "significance": "Object determines nature (citing Karanpura)"
    }
  ],
  "_case_id": "1965_261",
  "_label": 0,
  "_text_length": 18820,
  "_extracted_at": "2026-02-10T19:27:42.486288"
}