{
  "metadata": {
    "case_name": "Director of Enforcement v. Respondent",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "Sikri, J."
    ],
    "case_number": "Civil Appeal No. 701 of 1964",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Following the recovery in 1954 of some foreign currency and Travelers Cheques at No. 311, Bow Bazar Street, Calcutta, where the respondent alongwith his mother and brother carried on the business of jewellers.",
      "type": "material",
      "date": "1954",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Director of Enforcement issued a notice on April 23, 1958, calling upon the respondent to show cause within 10 days why adjudication proceedings should be held against him for contravention of s.23(1) of the Foreign Exchange Regulation Act, 1947.",
      "type": "procedural",
      "date": "1958-04-23",
      "source": "prosecution"
    },
    {
      "id": "f3",
      "text": "On May 10, 1958, the respondent replied to the notice giving his version as to how he came into possession of the foreign currency, but denied having sold any travellers cheques, and prayed that proceedings be dropped and currency returned.",
      "type": "procedural",
      "date": "1958-05-10",
      "source": "respondent"
    },
    {
      "id": "f4",
      "text": "Director of Enforcement, after considering the cause shown, concluded adjudication proceedings should be held and requested respondent to appear personally or through representative on May 13, 1958, at Calcutta Branch.",
      "type": "procedural",
      "date": "1958-05-13",
      "source": "prosecution"
    },
    {
      "id": "f5",
      "text": "On May 13, 1958, respondent filed petition under Art. 226 challenging adjudication proceedings on grounds that s.23(1)(a) and s.23D ultra vires Art. 20(2), and offence in 1954 made adjudication illegal.",
      "type": "procedural",
      "date": "1958-05-13",
      "source": "respondent"
    },
    {
      "id": "f6",
      "text": "High Court allowed raising point that s.23(1)(a) and s.23D contravene Art. 14; Mitter J. held s.23(1)(a) violates Art. 14 and ultra vires, s.23D also condemned; held no retrospective operation for 1954 offence as vested right to ordinary court trial affected.",
      "type": "procedural",
      "date": "1961-08-10",
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Appeal by certificate under Art. 132 against High Court judgment dated August 10, 1961, in Civil Rule No. 1428 of 1958.",
      "type": "procedural",
      "date": "1961-08-10",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether s.23(1)(a) and s.23D of the Foreign Exchange Regulation Act, 1947 violate Art. 14 of the Constitution.",
      "framed_by": "respondent"
    },
    {
      "id": "i2",
      "text": "Whether the amendment to s.23(1) by Act XXXIX of 1957 introducing adjudication by Director of Enforcement applies retrospectively to offence committed in 1954, or whether respondent had vested right to trial by ordinary court.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether new s.23(1)(a) contravenes Art. 20(1) of the Constitution by prescribing a minimum penalty.",
      "framed_by": "respondent"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "High Court erred in holding accused had vested right to be tried by ordinary criminal court; amendment only changed venue of trial from Magistrate to Director of Enforcement in some cases and no vested right affected.",
      "supporting_facts": [
        "f1",
        "f6"
      ],
      "legal_basis": "Rao Shiv Bahadur Singh v. State of Vindhya Pradesh"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "s.23(1)(a) and s.23D ultra vires Art. 14 (conceded before SC).",
      "supporting_facts": [],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Substantive vested right to be tried by ordinary court existed before amendment; amendment not retrospective as it affects vested right, though procedural.",
      "supporting_facts": [
        "f1",
        "f6"
      ],
      "legal_basis": "Maxwell 11th Ed. p.217; Art. 20"
    },
    {
      "id": "ra3",
      "text": "New s.23(1)(a) contravenes Art. 20(1) as it prescribes minimum penalty, unlike old s.23(1) where Magistrate had option for lesser fine.",
      "supporting_facts": [
        "f1"
      ],
      "legal_basis": "Art. 20(1)"
    },
    {
      "id": "ra4",
      "text": "No indication in Amending Act that new procedure retrospective; affects right of appeal under CrPC.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "s.23(1) and s.23D do not violate Art. 14, as held in Shanti Prasad Jain v. Director of Enforcement.",
      "addresses_issue": "i1",
      "key_observation": "Respondent concedes point."
    },
    {
      "id": "cr2",
      "text": "No vested right to be tried by particular court or procedure except where constitutional objection like discrimination or other fundamental right violation; amendment procedural and retrospective; no principle in Art. 20 makes procedure a vested right.",
      "addresses_issue": "i2",
      "key_observation": "Person accused has no fundamental right to trial by particular court or procedure; cites Rao Shiv Bahadur Singh."
    },
    {
      "id": "cr3",
      "text": "New s.23(1)(a) prescribes maximum penalty not exceeding three times value or Rs.5000, whichever more; no minimum prescribed, so no greater penalty than old section; no breach of Art. 20(1).",
      "addresses_issue": "i3",
      "key_observation": "Words 'not exceeding' cover both expressions."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "s.23(1)(a) and s.23D do not violate Art. 14.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Amendment to s.23(1) by Act XXXIX of 1957 is procedural, applies retrospectively to 1954 contravention; no vested right in particular procedure or court.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h3",
      "text": "s.23(1)(a) does not contravene Art. 20(1) as it prescribes maximum, not minimum, penalty.",
      "resolves_issue": "i3",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Shanti Prasad Jain v. Director of Enforcement",
      "citation": "1963 2 S.C.R. 297",
      "treatment": "followed",
      "relevance": "Held s.23(1) and s.23D do not violate Art. 14."
    },
    {
      "case_name": "Rao Shiv Bahadur Singh v. State of Vindhya Pradesh",
      "citation": "1953 S.C.R. 1188",
      "treatment": "followed",
      "relevance": "No vested right in particular court or procedure for trial; Art. 20 prohibits conviction under ex post facto law but not trial under new procedure."
    }
  ],
  "statutes_cited": [
    {
      "name": "Foreign Exchange Regulation Act, 1947",
      "sections": [
        "s.23(1)",
        "s.23D",
        "s.4",
        "s.5",
        "s.9",
        "s.10",
        "s.12(2)",
        "s.17",
        "s.18A",
        "s.18B"
      ],
      "relevance": "Contravention provisions; amendment by Act XXXIX of 1957 substituted s.23(1) introducing adjudication option by Director of Enforcement instead of only criminal court trial."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 132",
        "Art. 226",
        "Art. 20(1)",
        "Art. 20(2)",
        "Art. 14"
      ],
      "relevance": "Basis for High Court petition and appeal; challenges to vires and retrospectivity."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; High Court judgment quashing adjudication proceedings set aside; writ petition under Art. 226 dismissed; adjudication proceedings directed to proceed expeditiously.",
    "relief_granted": "Adjudication proceedings restored.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"A person accused of the commission of an offence has no fundamental right to trial by a particular court or by a particular procedure, except in so far as any constitutional objection by way of discrimination or the violation of any other fundamental right may be involved.\"",
      "speaker": "court",
      "significance": "Core holding on no vested right in procedure, from Rao Shiv Bahadur Singh."
    },
    {
      "text": "\"no person has a vested right in any course of procedure.\"",
      "speaker": "court",
      "significance": "Affirms procedural laws are retrospective unless contrary intent."
    }
  ],
  "_case_id": "1965_60",
  "_label": 1,
  "_text_length": 10771,
  "_extracted_at": "2026-02-10T19:24:57.628139"
}