{
  "metadata": {
    "case_name": "Gobald Motor Service (P.) Ltd. v. Commissioner of Income Tax",
    "case_year": null,
    "court": "Supreme Court of India",
    "judges": [
      "Sikri, J."
    ],
    "case_number": null,
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The assessee, Gobald Motor Service (P.) Ltd., was a private limited company which ran a fleet of buses and lorries from Mettupalayam in the accounting year relevant to the assessment year 1952-53.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Income-tax Officer passed order dated February 13, 1957 under section 23A: Total income as finally determined Rs. 2,04,222; Taxes paid Rs. 81,529; Balances available for distribution Rs. 73,617; Dividends declared Rs. 45,000.",
      "type": "material",
      "date": "1957-02-13",
      "source": "lower_court"
    },
    {
      "id": "f3",
      "text": "Dividend declared was less than 60% of the profits available for distribution.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f4",
      "text": "Book profit before appropriation of income-tax, etc. Rs. 1,01,902; Less taxes actually payable Rs. 81,529; Profits available for distribution Rs. 20,373; Dividends declared Rs. 45,000.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "Additions to income: Rs. 20,000 on account of luggage collections; Rs. 25,000 on account of spare parts, etc.; sustained by Appellate Assistant Commissioner.",
      "type": "disputed",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "Income-tax Officer applied section 23A, deeming additional dividend of Rs. 77,692 distributed among shareholders (initially two, revised to six).",
      "type": "procedural",
      "date": "1957-02-13",
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Appellate Assistant Commissioner: Difference between total income Rs. 2,04,222 and book profits Rs. 1,01,902 due to additions - Spare parts, tyres, tubes etc. Rs. 25,000; Suppression of luggage collections Rs. 15,000; Difference between depreciation allowed and claimed Rs. 34,906.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Appellate Assistant Commissioner held Income-tax Officer justified in applying section 23A.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Appellate Tribunal confirmed order of Income-tax Officer.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "High Court held first condition for section 23A satisfied; concealed profits nearly Rs. 40,000 (Rs. 37,000 per assessee) to be added to book profits; Income-tax Officer had material to conclude larger dividend not unreasonable.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Reference to High Court under section 66(1) of Income-tax Act, 1922: Whether on the facts and circumstances of the case, section 23A was properly applied?",
      "type": "procedural",
      "date": null,
      "source": "tribunal"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether on the facts and in the circumstances of the case, section 23A was properly applied?",
      "framed_by": "tribunal"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Income-tax Officer did not consider reasonableness of dividend from standpoint of business considerations such as previous losses, present profits, availability of surplus money, reasonable requirements of future etc.",
      "supporting_facts": [
        "f2",
        "f4",
        "f6"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Additions in respect of luggage collections and expenditure on spare parts etc. disallowed should not be added to book profits as they represent notional income.",
      "supporting_facts": [
        "f5",
        "f7"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Income-tax Officer not entitled to deem distribution more than Rs. 60,000 as assessee not being made to distribute more than commercial profits.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": "Section 23A of Income-tax Act, 1922"
    },
    {
      "id": "pa4",
      "text": "Burden on revenue to prove all conditions of section 23A satisfied, including Income-tax Officer considering losses in earlier years or smallness of profits made.",
      "supporting_facts": [],
      "legal_basis": "Commissioner of Income-tax v. Gangadhar Banerjee & Co."
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Dividend less than 60% of assessable income minus taxes; concealed profits to be added to book profits; larger dividend not unreasonable.",
      "supporting_facts": [
        "f2",
        "f3",
        "f5",
        "f7",
        "f10"
      ],
      "legal_basis": "Section 23A of Income-tax Act, 1922"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Commercial or accounting profits to be considered are real profits; deliberately omitted items must be added to arrive at true commercial profits.",
      "addresses_issue": "i1",
      "key_observation": "High Court right in holding additions for luggage collections and spare parts to be added to book profits."
    },
    {
      "id": "cr2",
      "text": "Once conditions satisfied, Income-tax Officer must deem undistributed portion as distributed as dividend.",
      "addresses_issue": "i1",
      "key_observation": "No option but to pass order under section 23A."
    },
    {
      "id": "cr3",
      "text": "Assessee did not raise point of business considerations before Appellate Assistant Commissioner or Tribunal; too late to raise now; before High Court, contention was only that 'profits made' refers to book profits.",
      "addresses_issue": "i1",
      "key_observation": "Assessee never urged unreasonableness due to previous losses etc. at earlier stages."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Section 23A properly applied; additions represent real commercial profits to be included.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Income-tax Officer must act as prudent businessman but assessee failed to raise relevant considerations earlier.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Commissioner of Income-tax v. Gangadhar Banerjee & Co.",
      "citation": null,
      "treatment": "referred",
      "relevance": "Burden on revenue; Income-tax Officer to consider business considerations like previous losses, present profits etc.; must take overall financial picture."
    }
  ],
  "statutes_cited": [
    {
      "name": "Income-tax Act, 1922",
      "sections": [
        "23A",
        "66(1)"
      ],
      "relevance": "Application of section 23A to deem undistributed profits as dividends if less than 60% distributed and larger not unreasonable; reference by Tribunal."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court agreed with High Court, answered the referred question in the affirmative and against the assessee.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The commercial or accounting profits which have to be taken into consideration are the real commercial or accounting profits. If an item is deliberately omitted from the accounts, it cannot be said that commercial principles prevent that amount being added to the profits.",
      "speaker": "court",
      "significance": "Justifies adding concealed/suppressed items to book profits for section 23A."
    },
    {
      "text": "The Income-tax Officer, acting under this section, is not assessing any income to tax... He only does what the directors should have done. He puts himself in the place of the directors... judged by business considerations, such as the previous losses, the present profits...",
      "speaker": "court",
      "significance": "Quotes Subba Rao J. on approach under section 23A (from Gangadhar Banerjee)."
    }
  ],
  "_case_id": "1965_91",
  "_label": 0,
  "_text_length": 12743,
  "_extracted_at": "2026-02-10T19:25:36.886960"
}