{
  "metadata": {
    "case_name": "Sales Tax Officer, Jodhpur & State of Rajasthan v. M/s Shiv Ratan G. Mohatta",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "Sikri, J."
    ],
    "case_number": "Civil Appeal No. 652 of 1964",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appeal by certificate from Rajasthan High Court judgment dated May 7, 1963, quashing assessment order dated March 5, 1962 by Sales Tax Officer, Jodhpur City, levying sales tax on turnover of Rs. 23,92,252.75 np.",
      "type": "procedural",
      "date": "1963-05-07",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Respondent M/s Shiv Ratan G. Mohatta is a partnership firm with head office at Jodhpur, claimed not liable to sales tax on turnover as not a dealer under s. 2(f) of Rajasthan Sales Tax Act, 1954, and sales in course of import under Art. 286(1)(b) Constitution.",
      "type": "background",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f3",
      "text": "Zeal-Pak Cement Factory, Hyderabad (Pakistan) manufactured cement; Pakistan Industrial Development Corporation agreed with M/s Milkhiram & Sons Pvt. Ltd., Bombay for export to India.",
      "type": "material",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f4",
      "text": "State Trading Corporation of India agreed with M/s Milkhiram & Sons for purchase of 35,000 long tons cement delivered O.R. Khokhropar in Pakistan on Rajasthan border; appointed assessee as agent for import and sale.",
      "type": "material",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f5",
      "text": "Assessee obtained orders from buyers in Rajasthan under agreements fixing price, terms; disclaimed responsibility for delays, losses in transit; payments in advance or partly; buyer responsible for unloading, demurrage.",
      "type": "material",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f6",
      "text": "Assessee sent despatch instructions to Pakistan Corporation indicating buyer-consignee, destination, RR and DA to be sent by post to consignee; passed to Zeal-Pak Factory.",
      "type": "material",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f7",
      "text": "Pakistan Factory advised consignee of consigning quantity to State Bank of India, Karachi with RR and invoice; State Bank endorsed RR to consignee by post.",
      "type": "material",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "Consignee took delivery by RR or indemnity bond to Station Master.",
      "type": "material",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f9",
      "text": "Sales Tax Officer assessed assessee as dealer, agent of non-resident dealer, importer, booked orders, issued bills, collected tax from buyers.",
      "type": "disputed",
      "date": "1962-03-05",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Sales Tax Officer did not discuss Art. 286(1)(b) ground.",
      "type": "procedural",
      "date": "1962-03-05",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Assessee filed writ petition under Art. 226; State objected on alternative remedy of appeal; High Court overruled, citing lack of jurisdiction under Art. 286(1)(b) and Venkateswaran precedent.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "High Court held assessee a dealer under s.2(f); but sales in course of import as property passed to buyers before reaching India, citing Gokal case; quashed assessment on disputed turnover.",
      "type": "procedural",
      "date": "1963-05-07",
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether High Court should have entertained writ petition under Art. 226 instead of directing assessee to pursue appeal under Rajasthan Sales Tax Act.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether assessee was a dealer under s. 2(f) of Rajasthan Sales Tax Act, 1954.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether sales took place in course of import under Art. 286(1)(b) of Constitution, exempting from sales tax.",
      "framed_by": "respondent"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "High Court should have refused writ petition as alternative appeal remedy available; no exceptional circumstances; assessee must deposit tax on appeal.",
      "supporting_facts": [
        "f11",
        "f12"
      ],
      "legal_basis": "Art. 226 Constitution"
    },
    {
      "id": "pa2",
      "text": "Onus on assessee to prove sales in course of import; no evidence when State Bank endorsed RR to buyers or when goods crossed frontier; title passed on delivery in Rajasthan after import ceased.",
      "supporting_facts": [
        "f7",
        "f8",
        "f9"
      ],
      "legal_basis": "Art. 286(1)(b) Constitution"
    },
    {
      "id": "pa3",
      "text": "Assessee is dealer as agent effecting sales, collecting tax.",
      "supporting_facts": [
        "f5",
        "f9"
      ],
      "legal_basis": "s. 2(f) Rajasthan Sales Tax Act, 1954"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Sales Tax Officer failed to consider Art. 286(1)(b); sales in course of import as property passed during import.",
      "supporting_facts": [
        "f4",
        "f6",
        "f7"
      ],
      "legal_basis": "Art. 286(1)(b) Constitution; J.V. Gokal case"
    },
    {
      "id": "ra2",
      "text": "Not a dealer under s.2(f) or sales exempt.",
      "supporting_facts": [
        "f2"
      ],
      "legal_basis": "s. 2(f) Rajasthan Sales Tax Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "High Court should have declined writ as no exceptional circumstances; not to convert into assessing authority; but since entertained, not dismiss now.",
      "addresses_issue": "i1",
      "key_observation": "Art. 226 not for bypassing statutory remedies unless root jurisdiction issue or palpable injustice."
    },
    {
      "id": "cr2",
      "text": "High Court erred in deciding factual question of when title passed without STO considering it; High Court not to find facts in writ jurisdiction.",
      "addresses_issue": "i3",
      "key_observation": "Remand to STO to find facts on taxability."
    },
    {
      "id": "cr3",
      "text": "Onus on assessee for Art. 286(1)(b); disputed/missing facts like endorsement timing require investigation by assessing authorities.",
      "addresses_issue": "i3",
      "key_observation": "High Court confined to record; should quash and remand."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "High Courts should not entertain Art. 226 petitions in tax matters post-assessment unless exceptional; decline if facts disputed.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "High Court not to decide taxability facts de novo; remand to STO.",
      "resolves_issue": "i3",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "A.V. Venkateswaran v. Ramchand Sobharaj Wadhwani",
      "citation": "(1962) 1 S.C.R. 753",
      "treatment": "followed",
      "relevance": "Writ maintainable despite alternative remedy if no jurisdiction."
    },
    {
      "case_name": "J.V. Gokal and Co. Pvt. Ltd. v. Assistant Collector of Sales Tax",
      "citation": "(1960) 2 S.C.R. 852",
      "treatment": "referred",
      "relevance": "Sale in course of import when property passes during import."
    }
  ],
  "statutes_cited": [
    {
      "name": "Rajasthan Sales Tax Act, 1954",
      "sections": [
        "s. 2(f)"
      ],
      "relevance": "Definition of 'dealer'; whether assessee liable."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 286(1)(b)",
        "Art. 226"
      ],
      "relevance": "Sales in course of import exempt; writ jurisdiction limits."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; High Court order set aside; assessment order quashed insofar as disputed turnover; remitted to Sales Tax Officer to decide afresh after finding facts.",
    "relief_granted": "Remand to STO for fresh decision untrammelled by High Court views.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "It was not the object of art. 226 to convert High Courts into original or appellate assessing authorities whenever an assessee chose to attack an assessment order on the ground that a sale was made in the course of import and therefore exempt from tax.",
      "speaker": "court",
      "significance": "Limits Art. 226 in tax matters."
    },
    {
      "text": "The proper order in the circumstances of this case would have been to quash the order of assessment and send the case back to the Sales Tax Officer to dispose of it according to law.",
      "speaker": "court",
      "significance": "Directs remand procedure."
    }
  ],
  "_case_id": "1965_268",
  "_label": 1,
  "_text_length": 15053,
  "_extracted_at": "2026-02-10T19:27:35.025175"
}