{
  "metadata": {
    "case_name": "Vijaysingh v. State of Maharashtra",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "Subba Rao, J."
    ],
    "case_number": "Criminal Appeal No. 154 of 1963",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "On June 12, 1961, Vijaysingh, the appellant, and one Namdeo Shinde drove in a jeep at an excessive speed and dashed it against the wall of the office of the District Superintendent of Police, Akola. Both of them appeared to be intoxicated. In the jeep there was also a bottle with a label on it as Tincture Zingeberis.",
      "type": "material",
      "date": "1961-06-12",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Vijaysingh was prosecuted before the Judicial Magistrate, First Class, Akola, under s. 66(1)(b) and s. 85(1)(1,2, and 3) of the Bombay Prohibition Act, 1949.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The Magistrate convicted the appellant both under s. 66(1)(b) and s. 85(1)(1,2 and 3) of the Act, but sentenced him only under ss. 66(1)(b) and 85(1)(1) of the Act.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On appeal, the Sessions Judge, Akola, acquitted the appellant under s. 66(1)(b) of the Act, but confirmed the conviction and sentence under s. 85(1)(1) thereof.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "State of Maharashtra preferred an appeal to the High Court against acquittal under s. 66(1)(b); appellant preferred revision against conviction under s. 85(1)(1). High Court heard both together, allowed State's appeal, dismissed revision, set aside acquittal under s. 66(1)(b), sentenced to RI 3 months and fine Rs. 500, confirmed conviction and sentence under s. 85(1)(1).",
      "type": "procedural",
      "date": "1963-05-02",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Accused produced before police a sample bottle out of which he says he had consumed tincture zingeberis. Sample analysed by Chemical Analyser: weak Ginger Tincture B.P. 1959 (Tincture Zingeberis Mitis), absolute alcohol content 89.1 per cent. v/v, ethyl alcohol 90.0 per cent. v/v (within B.P. limits 86-90%), total solids 0.62 per cent., complied with pharmacopical specifications.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Blood sample of accused contained 0.207 mg. p.c. w/v of ethyl alcohol.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Blood alcohol concentration on taking normal dose of tincture zingeberis mitis would be about 0.007 per cent. w/v; accused took roughly 125 c.c. to reach 0.207 per cent.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "On evidence of Dr. Deshmukh, Tincture Zingeberis Mitis might be consumed for intoxication without harmful effects.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Accused adduced no evidence that the medicine is unfit for use as intoxicating liquor.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Concentration of alcohol in blood more than 0.05 per cent. weight in volume.",
      "type": "material",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Construction of provisions of Bombay Prohibition Act, 1949, particularly s.66(2) on burden of proof where accused consumes medicinal preparation containing alcohol: whether accused discharged burden by proving consumption of medicinal preparation, shifting burden to prosecution to prove fit for use as intoxicating liquor.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Effect of s.6A: whether absence of State Government determination deeming Tincture Zingeberis Mitis fit for intoxicating use discharges accused's burden under s.66(2).",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether prosecution proved Tincture Zingeberis Mitis unfit for intoxicating use, or required proof of harmful effects.",
      "framed_by": "petitioner"
    },
    {
      "id": "i4",
      "text": "Ingredients of offence under s.85(1): whether requires proof that accused drunk for purpose of intoxication and not medicinal purpose.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Under s.66(2), accused need only prove consumed medical preparation; burden shifts to prosecution to prove medicinal preparation fit for use as intoxicating liquor. Accused established taking tincture zingeberis, prosecution failed to prove fitness.",
      "supporting_facts": [
        "f6",
        "f10"
      ],
      "legal_basis": "s.66(2), Bombay Prohibition Act; State of Bombay v. Narandas Mangilal Agarwal"
    },
    {
      "id": "pa2",
      "text": "Under s.6A(7), until State Government determines medicinal preparation fit for intoxicating use, deemed unfit; no such determination for Tincture Zingeberis Mitis, so burden discharged.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": "s.6A(6),(7), Bombay Prohibition Act"
    },
    {
      "id": "pa3",
      "text": "High Court relied on irrelevant evidence; prosecution must prove consumption had no harmful effects to show unfit for intoxicating use.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": null
    },
    {
      "id": "pa4",
      "text": "s.85(1) requires accused drunk and incapable of self-care, and took drink for intoxication not medicinal purpose (from s.85(2) presumption).",
      "supporting_facts": [
        "f1"
      ],
      "legal_basis": "s.85(1),(2), Bombay Prohibition Act"
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "s.66(1) prohibits consumption of liquor (liquid containing alcohol); s.24A exempts medicinal preparations unfit for intoxicating use. s.66(2) shifts burden to accused to prove liquor was medicinal preparation not in contravention (e.g., unfit for intoxicating use). Here, blood alcohol >0.05%, burden on accused; he failed to prove unfit, prosecution proved fit via analysis and expert evidence.",
      "addresses_issue": "i1",
      "key_observation": "Accused failed to discharge statutory burden; prosecution established fitness for intoxicating use."
    },
    {
      "id": "cr2",
      "text": "Narandas case pre-amendment adding s.66(2); cannot apply post-1959 amendment shifting burden.",
      "addresses_issue": "i1",
      "key_observation": "Distinguished precedent due to statutory change."
    },
    {
      "id": "cr3",
      "text": "s.6A point raised first time in Supreme Court, no record of government determination or material placed; cannot permit without factual basis.",
      "addresses_issue": "i2",
      "key_observation": "Point not raised timely, lacks evidence."
    },
    {
      "id": "cr4",
      "text": "Prosecution evidence (expert) shows preparation consumable for intoxication without harm; accused no contrary evidence.",
      "addresses_issue": "i3",
      "key_observation": "Fitness proved positively."
    },
    {
      "id": "cr5",
      "text": "Even assuming s.85 requires purpose of intoxication, facts show accused took for intoxication (rash driving under influence), drunk and incapable.",
      "addresses_issue": "i4",
      "key_observation": "Facts satisfy even strict test."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Under s.66(2), where blood alcohol >0.05%, burden on accused to prove medicinal preparation consumed was not in contravention (e.g., unfit for intoxicating use); High Court correctly found accused failed burden, preparation fit.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "s.6A point inadmissible first time in Supreme Court without evidence.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Prosecution discharged onus via expert evidence of fitness for intoxication.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    },
    {
      "id": "h4",
      "text": "Offence under s.85(1) committed on facts.",
      "resolves_issue": "i4",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "State of Bombay v. Narandas Mangilal Agarwal",
      "citation": "1962 Supp. 1 S.C.R. 15",
      "treatment": "distinguished",
      "relevance": "Held State to prove fitness pre-1959 amendment; inapplicable post-s.66(2) addition shifting burden to accused."
    }
  ],
  "statutes_cited": [
    {
      "name": "Bombay Prohibition Act, 1949",
      "sections": [
        "s.66(1)(b)",
        "s.66(2)",
        "s.85(1)(1,2,3)",
        "s.24A",
        "s.13(b)",
        "s.6A"
      ],
      "relevance": "Prohibits consumption of intoxicants/liquor; exemptions for unfit medicinal preparations; burden shift on blood alcohol level; presumption under s.85(2); govt determination under s.6A."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court upheld High Court judgment convicting appellant under s.66(1)(b) (RI 3 months, fine Rs.500) and s.85(1)(1) of Bombay Prohibition Act; rejected all contentions on burden of proof, s.6A, evidence, and s.85 ingredients.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"the burden of proving that the liquor consumed was a medicinal or toilet preparation containing alcohol, the consumption of which is not in contravention of the Act... shall be upon the accused person\"",
      "speaker": "court",
      "significance": "Quotes s.66(2) central to burden shift."
    },
    {
      "text": "\"Tincture Zingeberis Mitis was a preparation which might be consumed for intoxication and that intoxication would not be accompanied by any other harmful effects.\"",
      "speaker": "court",
      "significance": "Key finding on fitness for intoxicating use."
    },
    {
      "text": "\"We cannot, therefore, permit the appellant to raise the point for the first time before us, particularly when there is utter lack of factual basis.\"",
      "speaker": "court",
      "significance": "Rejects s.6A argument as untimely."
    }
  ],
  "_case_id": "1965_321",
  "_label": 0,
  "_text_length": 14793,
  "_extracted_at": "2026-02-10T19:28:17.864273"
}