{
  "metadata": {
    "case_name": "4th Defendant (Appellant) v. Plaintiffs and Others (Respondents)",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "Subba Rao, J."
    ],
    "case_number": "Civil Appeal No. 273 of 1963",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The tavazhi originally was a branch of a tarwad but separated itself from the said tarwad on July 13, 1934 under a decree in a partition suit.",
      "type": "background",
      "date": "1934-07-13",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The tavazhi owns a number of properties.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Plaintiffs filed O.S. No. 108 of 1948 in the Court of the Subordinate Judge, Palghat, against the tavazhi represented by its manager and others, for arrears of maintenance due to them and for other reliefs.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "In the plaint, it was alleged that the Chalakkode nilam property was the property of the tavazhi and therefore they were entitled to maintenance from the income of the said property also.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "Defendants in their written statement denied that the said property was the property of the tavazhi but alleged that it was purchased from and out of the private funds of defendants 1 and her son, defendant 4.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f6",
      "text": "One of the issues raised was whether the property referred to in paragraph 5 of the plaint was tavazhi property from which maintenance could be claimed.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "The learned Subordinate Judge held that the said property did not belong to the tavazhi but it was the personal property of defendants 1 and 4. In the result in giving a decree for maintenance, he did not take into consideration the income from the said property.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "On appeal, a Division Bench of the Madras High Court, having regard to the relevant presumptions under the Malabar law, held that the said property belonged to the tavazhi. In the result, it allowed the appeal and remanded the suit to the Court of the Subordinate Judge for fixing the rate of maintenance after taking into account the income from the said property also.",
      "type": "procedural",
      "date": "1955-07-15",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "The 4th defendant, after obtaining the certificate from the High Court, has preferred the present appeal to this Court against the judgment of the said Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "The appellant and his mother (1st defendant) are members of the tavazhi.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "The 1st defendant is the karnavati of the tavazhi and her son, the 4th defendant, who is an advocate, has been managing the properties on her behalf.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "The tavazhi has properties yielding appreciable income from and out of which the Chalakkode property could have been purchased.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "The assignment of the decree in execution whereof the said property was purchased was taken in favour of both defendants 1 and 4.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "The sale certificates for the same was issued in the names of both of them.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f15",
      "text": "The ticket for the kuri was admittedly taken in the name of the 1st defendant and it is admitted by the 4th defendant that his accounts would not disclose that he paid the subscriptions to the kuri.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f16",
      "text": "The 4th defendant has suppressed both the accounts of the tavazhi and his personal accounts and has failed to prove that he had any personal income from and out of which he could have paid Rs. 14,000 odd towards the purchase of the said property.",
      "type": "material",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether a certain property, described as Chalakkode property, is the property of the tavazhi of which the appellant and his mother are members or the separate property of the appellant.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The first and the fourth defendants are not the managers of the tavazhi properties.",
      "supporting_facts": [],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Even if they are, there is no presumption under the Malabar law that the properties acquired in their names are tavazhi properties.",
      "supporting_facts": [],
      "legal_basis": "Malabar law"
    },
    {
      "id": "pa3",
      "text": "Even if there is such a presumption, the appellant has proved by relevant evidence that the Chalakkode property is the self-acquired property of himself and the 1st defendant.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The 1st defendant is the karnavati of the tavazhi that she was managing the tavazhi properties during the crucial period with the active help of her son, the 4th defendant appellant.",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "There is presumption under the Marumakkathayam law that a property acquired in the name of a manager of a tavazhi is the property of the tavazhi, and that the said presumption has not been rebutted by any acceptable evidence.",
      "supporting_facts": [],
      "legal_basis": "Marumakkathayam law"
    },
    {
      "id": "ra3",
      "text": "The same presumption should be invoked in the case of the 4th defendant-appellant, who was in de facto management of the said property during the crucial period and that he had kept back all the relevant accounts and failed to rebut the said presumption.",
      "supporting_facts": [
        "f11",
        "f16"
      ],
      "legal_basis": "Marumakkathayam law"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Under Marumakkathayam law, a family is known as a tarwad consisting of a mother and her children and descendants in female line; tavazhi is a branch thereof; management vests in eldest male (karnavan) or female (karnavati); fiduciary relationship.",
      "addresses_issue": "i1",
      "key_observation": "Relevant principles of Marumakkathayam law are well settled."
    },
    {
      "id": "cr2",
      "text": "Courts have recognized difference between joint Hindu family and tarwad in context of acquisition of properties; under Hindu law presumption if nucleus; but for junior member of tarwad (anandravan) no presumption either way.",
      "addresses_issue": "i1",
      "key_observation": "Question decided on facts of each case."
    },
    {
      "id": "cr3",
      "text": "If a property is acquired in the name of the karnavan, there is a strong presumption that it is a tarwad property and that the presumption must hold good unless and until it is rebutted by acceptable evidence.",
      "addresses_issue": "i1",
      "key_observation": "Strong presumption for manager."
    },
    {
      "id": "cr4",
      "text": "Agree with High Court on consideration of documentary and oral evidence that 1st defendant is karnavati and 4th defendant managing on her behalf; strong presumption for 1st defendant; for 4th defendant, de facto manager in fiduciary position.",
      "addresses_issue": "i1",
      "key_observation": "Subordinate Judge did not examine witnesses personally."
    },
    {
      "id": "cr5",
      "text": "Tavazhi has nucleus; assignment and sale certificate to both D1 and D4; kuri in D1 name, subscriptions not from personal accounts; D4 suppressed accounts, no proof of personal funds for Rs.14,000; burden shifted and not discharged.",
      "addresses_issue": "i1",
      "key_observation": "Facts establish tavazhi property."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The Chalakkode property is the property of the tavazhi.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Govinda v. Nani",
      "citation": "1913 36 Mad. 304",
      "treatment": "referred",
      "relevance": "No presumption for anandravan."
    },
    {
      "case_name": "Dharnu Shetty v. Dejamma",
      "citation": "A.I.R. 1918 Mad. 1367",
      "treatment": "referred",
      "relevance": "No presumption for junior member of tarwad."
    },
    {
      "case_name": "Soopiadath Ahmad v. Mammad Kunhi",
      "citation": "A.I.R. 1926 Mad. 643",
      "treatment": "followed",
      "relevance": "No presumption for junior; strong presumption for karnavan."
    },
    {
      "case_name": "Thatha Amma v. Thankappa",
      "citation": "A.I.R. 1947 Mad. 137",
      "treatment": "followed",
      "relevance": "No presumption for junior; strong presumption for karnavan."
    },
    {
      "case_name": "Chathu Nambiar v. Sekharan Nambiar",
      "citation": "A.I.R. 1925 Mad. 430",
      "treatment": "followed",
      "relevance": "Strong presumption that property in karnavan's name is tarwad property."
    }
  ],
  "statutes_cited": [],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court agreed with the finding of the Madras High Court that the Chalakkode property was the property of the tavazhi, upholding the remand for fixing maintenance including its income.",
    "relief_granted": "None specified; upholds High Court remand for maintenance calculation including Chalakkode property income.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "If a property is acquired in the name of the karnavan, there is a strong presumption that it is a tarwad property and that the presumption must hold good unless and until it is rebutted by acceptable evidence.",
      "speaker": "court",
      "significance": "Core legal principle applied to determine property ownership."
    },
    {
      "text": "The facts certainly shift the burden of proving title to the property to the 4th defendant and he has failed to discharge the same.",
      "speaker": "court",
      "significance": "Explains why presumption not rebutted for appellant."
    }
  ],
  "_case_id": "1965_357",
  "_label": 0,
  "_text_length": 11999,
  "_extracted_at": "2026-02-10T19:28:48.521053"
}