{
  "metadata": {
    "case_name": "Brundaban Nayak v. Election Commission of India & Anr.",
    "case_year": 1965,
    "court": "Supreme Court of India",
    "judges": [
      "Gajendragadkar, C.J."
    ],
    "case_number": "Civil Appeal No. 50 of 1965",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The appellant Brundaban Nayak was elected to the Legislative Assembly of Orissa from the Hinjili 23 Constituency in Ganjam district in 1961, and was appointed one of the Ministers of the Council of Ministers in the said State.",
      "type": "background",
      "date": "1961",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On August 18, 1964, respondent No. 2, P. Biswal, applied to the Governor of Orissa alleging that the appellant had incurred a disqualification subsequent to his election under Art. 191(1)(e) of the Constitution read with section 7 of the Representation of the People Act, 1951.",
      "type": "material",
      "date": "1964-08-18",
      "source": "respondent"
    },
    {
      "id": "f3",
      "text": "On September 10, 1964, the Chief Secretary to the Government of Orissa forwarded the said complaint to respondent No. 1, the Election Commission of India, under the instructions of the Governor, requesting it to make enquiries and give its opinion.",
      "type": "procedural",
      "date": "1964-09-10",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On November 17, 1964, respondent No. 1 served a notice on the appellant forwarding to him a copy of the letter received by it from respondent No. 2 dated the 4th November, 1964, calling upon him to submit his reply by December 5, 1964, and hearing fixed on December 8, 1964.",
      "type": "procedural",
      "date": "1964-11-17",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "On December 1, 1964, the appellant sent a telegram and a registered letter to respondent No. 1 requesting adjournment of the hearing.",
      "type": "procedural",
      "date": "1964-12-01",
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "Respondent No. 2 objected to the appellant's request for adjournment.",
      "type": "procedural",
      "date": "1964-12",
      "source": "respondent"
    },
    {
      "id": "f7",
      "text": "On December 8, 1964, respondent No. 1 took up the matter; respondent No. 2 appeared by counsel, appellant absent; respondent No. 1 adjourned to January 2, 1965.",
      "type": "procedural",
      "date": "1964-12-08",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "On January 2, 1965, appellant appeared by counsel Mr. Patnaik who raised question of maintainability and competence of respondent No. 1; overruled; adjournment requested without submitting to jurisdiction; denied; heard Mr. Chatterjee for respondent No. 2; orders reserved.",
      "type": "procedural",
      "date": "1965-01-02",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Appellant moved Punjab High Court under Art. 226 praying to quash the enquiry; summarily dismissed on January 6, 1965.",
      "type": "procedural",
      "date": "1965-01-06",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Appellant applied for special leave on January 8, 1965; granted on January 14, 1965; stay of proceedings granted.",
      "type": "procedural",
      "date": "1965-01-14",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Through oversight, original complaint and Governor's reference not forwarded to appellant with notice.",
      "type": "procedural",
      "date": "1964-11-17",
      "source": "respondent"
    },
    {
      "id": "f12",
      "text": "It is not disputed that a complaint was made by respondent No. 2 to Governor and referred to EC.",
      "type": "admitted",
      "date": null,
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether a question as to whether a member has become subject to disqualification under Art. 191(1) can arise only on the floor of the Legislative Assembly and by members thereof, or by any citizen via complaint to Governor.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether the Election Commission is entitled to hold an enquiry before giving its opinion to the Governor under Art. 192(2), or whether the Governor alone holds the enquiry.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "No question has arisen under Art. 192(1) because such question can be raised only on the floor of the Legislative Assembly by members, not by an ordinary citizen or voter via complaint to Governor.",
      "supporting_facts": [
        "f2"
      ],
      "legal_basis": "Art. 192(1), Art. 199(3)"
    },
    {
      "id": "pa2",
      "text": "Even if question arises, Governor alone holds enquiry as he gives the final decision; EC only gives opinion on material collected by Governor.",
      "supporting_facts": [
        "f3",
        "f4"
      ],
      "legal_basis": "Art. 192(1) & (2)"
    },
    {
      "id": "pa3",
      "text": "Failure to furnish copy of original complaint and Governor's reference renders proceedings illegal.",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Election Commission is competent to hold enquiry under Art. 192(2); practice consistently followed.",
      "supporting_facts": [
        "f3",
        "f7",
        "f8"
      ],
      "legal_basis": "Art. 192(2), Art. 103(2)"
    },
    {
      "id": "ra2",
      "text": "Oversight in not forwarding documents does not affect jurisdiction; fact of reference was public knowledge.",
      "supporting_facts": [
        "f11",
        "f12"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Art. 192(1) does not limit how question arises; any citizen can complain to Governor; no referring authority like Speaker required.",
      "addresses_issue": "i1",
      "key_observation": "What the said clause requires is that a question should arise how it arises, by whom it is raised, in what circumstances it is raised, are not relevant."
    },
    {
      "id": "cr2",
      "text": "Scheme of Art. 192: Governor decides formally per EC opinion; EC holds enquiry as it is decisive in substance; analogous to election petitions.",
      "addresses_issue": "i2",
      "key_observation": "The object of this provision clearly is to leave it to the Election Commission to decide the matter, though the decision as such would formally be pronounced in the name of the Governor."
    },
    {
      "id": "cr3",
      "text": "Oversight in documents does not affect jurisdiction; appellant knew of complaint.",
      "addresses_issue": "i2",
      "key_observation": "As soon as respondent No. 1 received the complaint and the order of reference... it was seized of the matter and it was plainly acting within its jurisdiction."
    },
    {
      "id": "cr4",
      "text": "Appellant's proceedings aimed to prolong enquiry.",
      "addresses_issue": "i2",
      "key_observation": "The main object of the appellant in taking such a plea was to prolong the proceedings before respondent No. 1."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Any citizen entitled to complain to Governor under Art. 192(1); question arises upon such complaint.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Election Commission competent to hold enquiry before giving opinion under Art. 192(2).",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Election Commission, India v. Saka Venkata Subba Rao",
      "citation": "1953 S.C.R. 1144",
      "treatment": "followed",
      "relevance": "Articles 190(3) and 192(1) applicable only to disqualifications after election."
    }
  ],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Article 191(1)(e)",
        "Article 192",
        "Article 190(3)(a)",
        "Article 199(3)",
        "Article 226",
        "Article 101",
        "Article 102",
        "Article 103"
      ],
      "relevance": "Governs disqualification of legislators, procedure for decision by Governor on EC opinion, vacation of seat."
    },
    {
      "name": "Representation of the People Act, 1951",
      "sections": [
        "Section 7(d)"
      ],
      "relevance": "Disqualification incurred by appellant subsequent to election."
    },
    {
      "name": "Commissions of Enquiry Act, 1952",
      "sections": [],
      "relevance": "Suggested to vest EC with powers like summoning witnesses for enquiries under Art. 192(2)."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal dismissed with costs. EC directed to proceed expeditiously with enquiry and forward opinion to Governor. Noted potential vacation of seat under Art. 190(3) if allegations proved.",
    "relief_granted": null,
    "costs": "Dismissed with costs"
  },
  "key_quotes": [
    {
      "text": "\"What the said clause requires is that a question should arise how it arises, by whom it is raised, in what circumstances it is raised, are not relevant.\"",
      "speaker": "court",
      "significance": "Rejects limitation on who can raise disqualification question under Art. 192(1)."
    },
    {
      "text": "\"The object of this provision clearly is to leave it to the Election Commission to decide the matter, though the decision as such would formally be pronounced in the name of the Governor.\"",
      "speaker": "court",
      "significance": "Explains scheme of Art. 192 allowing EC to conduct enquiry."
    },
    {
      "text": "It is desirable that the Election Commission should be vested with the powers of a commission under the Commissions of Enquiry Act, 1952...",
      "speaker": "court",
      "significance": "Recommends legislative amendment for EC powers in such enquiries."
    }
  ],
  "_case_id": "1965_361",
  "_label": 0,
  "_text_length": 24554,
  "_extracted_at": "2026-02-10T19:28:48.936850"
}