{
  "metadata": {
    "case_name": "Commissioner of Income-tax, Bombay and Income-tax Officer, C-II Ward, Bombay v. Bhagwandas Kevaldas",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "Gajendragadkar C.J.",
      "Wanchoo J.",
      "Shah J.",
      "Sikri J.",
      "Mudholkar J. (dissenting)"
    ],
    "case_number": "Civil Appeals Nos. 1003 and 1004 of 1963",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The 1st Income-tax Officer, C-11 Ward, Bombay served a notice under s. 18-A(1) of the Indian Income-tax Act, 1922 calling upon Bhagwandas Kevaldas (assessee) to pay in four equal installments Rs. 25,973/5 as advance-tax for the assessment year 1948-49.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On September 17, 1947 the assessee filed an estimate of his income under s. 18-A(2) and of the tax payable by him.",
      "type": "procedural",
      "date": "1947-09-17",
      "source": "assessee"
    },
    {
      "id": "f3",
      "text": "On January 10, 1948 the assessee filed a revised estimate.",
      "type": "procedural",
      "date": "1948-01-10",
      "source": "assessee"
    },
    {
      "id": "f4",
      "text": "An order under s. 23-B of the Act provisionally assessing the income was made by the Income-tax Officer and pursuant thereto on August 23, 1950 the assessee paid the tax so assessed.",
      "type": "procedural",
      "date": "1950-08-23",
      "source": "income_tax_officer"
    },
    {
      "id": "f5",
      "text": "Regular assessment of the income of the assessee was made on March 31, 1953 by the Income-tax Officer, and it was found that the tax paid on the basis of the estimate of the assessee was less than eighty per cent of the tax determined as a result of the regular assessment. But the Income-tax Officer made no charge for interest under sub-s. (6) of s. 18-A of the Income-tax Act.",
      "type": "material",
      "date": "1953-03-31",
      "source": "income_tax_officer"
    },
    {
      "id": "f6",
      "text": "The departmental auditor raised an objection in auditing accounts of C-11 Ward that a mistake was committed by the Income-tax Officer in failing to charge interest in making the order of assessment against the assessee.",
      "type": "procedural",
      "date": null,
      "source": "departmental_auditor"
    },
    {
      "id": "f7",
      "text": "On September 21, 1956 the Income-tax Officer served a notice upon the assessee requiring him to show cause why the mistake in not levying interest be not rectified and why he should not be directed to pay penal interest under s. 18-A(6).",
      "type": "procedural",
      "date": "1956-09-21",
      "source": "income_tax_officer"
    },
    {
      "id": "f8",
      "text": "On October 4, 1956 the Income-tax Officer recorded an order: 'During the internal checking of C-11 Ward, the Auditor has pointed out a mistake in not charging penal interest under s. 18-A(6). As this mistake is apparent from record the same is rectified under s. 35 after giving due notice to the assessee,' and served a notice of demand calling upon the assessee to pay Rs. 14,929/10 as interest due under s. 18-A(6) for the period January 1, 1948 to July 22, 1950.",
      "type": "procedural",
      "date": "1956-10-04",
      "source": "income_tax_officer"
    },
    {
      "id": "f9",
      "text": "In exercise of his powers under s. 33-A, by order dated February 1, 1958, the Commissioner of Income-tax confirmed the order of the Income-tax Officer rectifying the original order of assessment and imposing liability to pay interest, subject to the modification that interest be paid only till June 13, 1950.",
      "type": "procedural",
      "date": "1958-02-01",
      "source": "commissioner"
    },
    {
      "id": "f10",
      "text": "The assessee moved the High Court of Judicature at Bombay by a petition under Art. 226 of the Constitution for issue of a writ certiorari quashing the order passed under s. 33-A by the Commissioner of Income-tax and the order passed by the Income-tax Officer under s. 35 and the notice of demand pursuant to that order.",
      "type": "procedural",
      "date": null,
      "source": "assessee"
    },
    {
      "id": "f11",
      "text": "The High Court of Bombay, following its earlier judgment in Shantilal Ravji v. M. C. Nair, directed that the orders passed by the Income-tax Officer and by the Commissioner of Income-tax be quashed.",
      "type": "procedural",
      "date": "1958-11-13",
      "source": "bombay_high_court"
    },
    {
      "id": "f12",
      "text": "Against the order passed by the High Court the Commissioner of Income-tax and the Income-tax Officer appealed to this Court with certificate granted by the High Court.",
      "type": "procedural",
      "date": null,
      "source": "appellants"
    },
    {
      "id": "f13",
      "text": "Act 25 of 1953 added a fifth proviso to s. 18-A(6) with retrospective operation from April 1, 1952: 'Provided further that in such a case and under such circumstances as may be prescribed, the Income-tax Officer may reduce or waive the interest payable by the assessee.' Rules framed in December 1953 (r. 48).",
      "type": "background",
      "date": "1953-04-01",
      "source": "legislature"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether a proceeding under Art. 226 of the Constitution for a writ against revenue authorities in a tax matter is a 'civil proceeding' within the meaning of Art. 133(1) allowing the High Court to certify an appeal to the Supreme Court.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the Income-tax Officer could rectify the assessment order under s. 35 to charge interest under s. 18-A(6), given the retrospective amendment introducing discretion to waive/reduce interest, and whether the omission was a mistake apparent from the record.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The appeal is competent as the writ petition under Art. 226 challenging tax levy is a civil proceeding under Art. 133.",
      "supporting_facts": [
        "f10",
        "f11",
        "f12"
      ],
      "legal_basis": "Articles 132, 133, 134, 136 of the Constitution"
    },
    {
      "id": "pa2",
      "text": "The rectification under s. 35 was valid as the original omission to charge interest was a mistake apparent from the record; the retrospective proviso to s. 18-A(6) did not imply exercise of discretion by ITO in omitting interest.",
      "supporting_facts": [
        "f5",
        "f8",
        "f9"
      ],
      "legal_basis": "Sections 18-A(6), 35 of Income-tax Act 1922; Act 25 of 1953"
    },
    {
      "id": "pa3",
      "text": "The proviso to s. 18-A(6) requires prescription of cases/circumstances by rules, which were framed in 1953 and are not retrospective.",
      "supporting_facts": [
        "f13"
      ],
      "legal_basis": "s. 18-A(6) proviso, r. 48"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The writ proceeding under Art. 226 is not a civil proceeding under Art. 133, especially in revenue matters; appeal incompetent.",
      "supporting_facts": [
        "f10",
        "f11"
      ],
      "legal_basis": "Article 133 of the Constitution"
    },
    {
      "id": "ra2",
      "text": "Due to retrospective proviso to s. 18-A(6) from 1952, ITO had discretion to waive/reduce interest at time of assessment; omission implies exercise of discretion, not rectifiable under s. 35 as no mistake apparent.",
      "supporting_facts": [
        "f5",
        "f13"
      ],
      "legal_basis": "s. 18-A(6) proviso, s. 35 Income-tax Act; Act 25 of 1953"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "A proceeding under Art. 226 seeking relief against infringement of civil rights by revenue authorities in tax matters is a civil proceeding under Art. 133; revenue proceedings are civil if they enforce civil rights.",
      "addresses_issue": "i1",
      "key_observation": "Expression 'civil proceeding' covers proceedings asserting civil rights conferred by statute, including against taxation laws."
    },
    {
      "id": "cr2",
      "text": "Preliminary objection fails; appeal competent.",
      "addresses_issue": "i1",
      "key_observation": "No warrant to exclude revenue matters from civil proceedings under Art. 133."
    },
    {
      "id": "cr3",
      "text": "By retrospective amendment (Act 25/1953), proviso to s.18-A(6) and rules deemed in force at assessment date; ITO must be deemed to have had discretion; failure to charge interest implies exercise thereof or defective order; rectification under s.35 invalid as no mistake apparent.",
      "addresses_issue": "i2",
      "key_observation": "Commissioner erred in not considering the proviso and r.48."
    },
    {
      "id": "cr4",
      "text": "Dissent (Mudholkar J.): Omission to charge interest was oversight/mistake apparent, as law then required charging; proviso deems discretion existed but does not imply it was exercised; rectification valid.",
      "addresses_issue": "i2",
      "key_observation": "Cannot assume exercise of discretion without evidence; prima facie mistake."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Writ petition under Art. 226 challenging tax orders is a civil proceeding for Art. 133 certification.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "ITO's rectification under s.35 invalid; High Court correctly quashed orders as omission not a mistake apparent due to retrospective discretion under s.18-A(6).",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Shantilal Ravji v. M. C. Nair, IV Income-tax Officer, G Ward, Bombay and Another",
      "citation": "1958 34 I.T.R. 439",
      "treatment": "followed",
      "relevance": "Bombay High Court followed this to quash orders."
    },
    {
      "case_name": "M. K. Venkatachalam I.T.O. and Another v. Bombay Dyeing and Manufacturing Company Ltd",
      "citation": "1959 S.C.R. 703",
      "treatment": "followed",
      "relevance": "Rectification under s.35 valid for mistakes from retrospective amendments."
    },
    {
      "case_name": "T. Cajee v. U. Jormanik Siem and Anr",
      "citation": "1961 1 S.C.R. 750",
      "treatment": "distinguished",
      "relevance": "No application; power not absolute until rules framed."
    },
    {
      "case_name": "State of Bombay v. Pandurang Vinayak",
      "citation": "1953 S.C.R. 773",
      "treatment": "referred",
      "relevance": "Effect of deeming provisions with retrospective operation."
    },
    {
      "case_name": "East End Dwellings Co. Ltd. v. Finsbury Borough Council",
      "citation": "1952 A.C. 109",
      "treatment": "referred",
      "relevance": "Full effect of legal fictions from retrospective amendments."
    },
    {
      "case_name": "Rangoon Botatoung Company Ltd. v. The Collector, Rangoon",
      "citation": "L.R. 39 I.A. 197",
      "treatment": "referred",
      "relevance": "Character of land acquisition award as arbitration."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act, 1922",
      "sections": [
        "s. 18-A(1)",
        "s. 18-A(2)",
        "s. 18-A(6)",
        "s. 23-B",
        "s. 33-A",
        "s. 35"
      ],
      "relevance": "Advance tax estimation, provisional/regular assessment, interest for underestimation, rectification of mistakes, revision by Commissioner."
    },
    {
      "name": "Indian Income-tax (Amendment) Act, 1953 (Act 25 of 1953)",
      "sections": [
        "Fifth proviso to s. 18-A(6)"
      ],
      "relevance": "Retrospective discretion to ITO to reduce/waive interest from April 1, 1952."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 132",
        "Art. 133",
        "Art. 134",
        "Art. 136",
        "Art. 226"
      ],
      "relevance": "Appellate jurisdiction of Supreme Court; writ jurisdiction of High Court; civil/criminal/other proceedings."
    },
    {
      "name": "Income-tax Rules",
      "sections": [
        "r. 48"
      ],
      "relevance": "Prescribed cases/circumstances for reducing/waiving interest under s.18-A(6)."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court dismissed the appeals by revenue authorities, upholding Bombay High Court's quashing of rectification order under s.35 and Commissioner's confirmation under s.33-A, on grounds that retrospective proviso to s.18-A(6) deemed discretion existed at assessment time, making omission non-rectifiable mistake.",
    "relief_granted": "Orders of ITO and Commissioner quashed; writ upheld.",
    "costs": "Appeal dismissed with costs. One hearing fee in both appeals."
  },
  "key_quotes": [
    {
      "text": "\"A civil proceeding is therefore one in which a person seeks to enforce by appropriate relief the alleged infringement of his civil rights against another person or the State...\"",
      "speaker": "court",
      "significance": "Defines 'civil proceeding' under Art. 133 including tax writs."
    },
    {
      "text": "\"if you are bidden to treat an imaginary state of affairs as real, you must surely... also imagine as real the consequences and incidents which... must inevitably have flowed from or accompanied it.\"",
      "speaker": "court",
      "significance": "Explains effect of retrospective legal fictions (citing East End Dwellings)."
    },
    {
      "text": "\"The order of the Income-tax Officer which did not take notice of the law deemed to be in force must be regarded as defective.\"",
      "speaker": "court",
      "significance": "Holds original assessment defective due to deemed existence of discretion."
    }
  ],
  "_case_id": "1965_363",
  "_label": 0,
  "_text_length": 46072,
  "_extracted_at": "2026-02-10T19:29:00.363360"
}