{
  "metadata": {
    "case_name": "Commissioner of Income-tax v. Maheshwari Devi Jute Mills Ltd.",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "Shah, J."
    ],
    "case_number": "Civil Appeals Nos. 66 and 67 of 1964",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Maheshwari Devi Jute Mills Ltd. carries on the business of manufacturing jute goods and is a member of the Jute Mills Association.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Members of the Association entered into an agreement dated January 9, 1932 called the First Working Time Agreement restricting hours of work, to expire on December 11, 1944.",
      "type": "background",
      "date": "1932-01-09",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "A fresh agreement was executed on June 12, 1944, with preamble stating signatories determined to continue provisions similar to those in the Working Time Agreement due to losses from over-production.",
      "type": "background",
      "date": "1944-06-12",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "By cl. 4, restrictions on hours of work; loom-hours based on number of looms installed. Cl. 5: working hours per week for registered complement of looms. Cl. 10: max for mills exceeding 220 looms. Cl. 13: registration of loom-hours.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Cl. 6: grouping of mills under same managing agents; transfer of surplus loom-hours to others in group or outside, registered with Association.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Respondent allotted 220 x 72 loom-hours per week.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "In account year corresponding to assessment year 1949-50, preparatory section unable to work more than 48 hours/week; sold 220 x 24 loom-hours to Naskarpara Jute Mills for Rs. 53,460/- with Association sanction.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "In account year corresponding to assessment year 1950-51, received Rs. 1,85,230/- from Birla Jute Mills and Hanuman Jute Mills for sale of surplus loom-hours.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Income-tax Officer included amounts as revenue receipts liable to tax for 1949-50 and 1950-51; confirmed by Appellate Assistant Commissioner and Income-tax Appellate Tribunal.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Tribunal referred question to Allahabad High Court at instance of respondent: Whether receipts of Rs. 53,460/- and Rs. 1,85,230/- were revenue receipts liable to tax.",
      "type": "procedural",
      "date": null,
      "source": "tribunal"
    },
    {
      "id": "f11",
      "text": "High Court answered in negative (judgment March 28, 1961, Income-tax Reference No. 165 of 1954).",
      "type": "procedural",
      "date": "1961-03-28",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Commissioner preferred appeals with certificate under s. 66A(2) of Indian Income-tax Act.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Tribunal held receipts not capital, not casual/non-recurring.",
      "type": "disputed",
      "date": null,
      "source": "tribunal"
    },
    {
      "id": "f14",
      "text": "Allahabad High Court in Maheshwari Devi Jute Mills v. CIT (IT Misc. Case No. 177 of 1960, decided Sep 13, 1962) held similar receipts as income.",
      "type": "background",
      "date": "1962-09-13",
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether on the facts and in the circumstances of the case the receipts of the assessee by the sale of loom-hours amounting to Rs. 53,460/- and Rs. 1,85,230/- in the assessment years 1949-50 and 1950-51 respectively were revenue receipts liable to tax under the Indian Income-tax Act?",
      "framed_by": "tribunal"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Receipts for sale of loom-hours are revenue receipts as part of normal business activity to earn profit by exploiting asset, either by using it or letting it out; analogous to rent from idle plant.",
      "supporting_facts": [
        "f6",
        "f7",
        "f8"
      ],
      "legal_basis": "Commissioner of Excess Profits, Bombay City v. Shri Lakshmi Silk Mills Ltd."
    },
    {
      "id": "pa2",
      "text": "Plea that receipts are casual/non-recurring has no substance; receipt in ordinary course of business is taxable even if casual.",
      "supporting_facts": [
        "f13"
      ],
      "legal_basis": "s. 4(3)(vii) of Indian Income-tax Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Receipts for sale of loom-hours are capital receipts, or casual and non-recurring exempt under s. 4(3)(vii).",
      "supporting_facts": [
        "f7",
        "f8"
      ],
      "legal_basis": "s. 4(3)(vii) of Indian Income-tax Act"
    },
    {
      "id": "ra2",
      "text": "Loom-hours are a privilege, not an asset.",
      "supporting_facts": [],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Receipts not casual/non-recurring exempt under s. 4(3)(vii) as they arise from business; but not from business in loom-hours.",
      "addresses_issue": "i1",
      "key_observation": "No compensation paid by Association; facility to transfer provided to protect interests."
    },
    {
      "id": "cr2",
      "text": "Loom-hours treated as asset capable of transfer; respondent sold surplus due to inability to use full quota from preparatory inefficiency.",
      "addresses_issue": "i1",
      "key_observation": "Transfer is sale, not letting out; no interest retained, unlike plant rental."
    },
    {
      "id": "cr3",
      "text": "Distinguishes Shri Lakshmi Silk Mills: there plant retained, temporarily let out; here loom-hours sold outright, cannot be let while retaining property.",
      "addresses_issue": "i1",
      "key_observation": "Sale of asset (not circulating capital) yields capital receipt."
    },
    {
      "id": "cr4",
      "text": "Disagrees with Allahabad HC in IT Misc. Case 177/1960: surplus disposed of completely, no exploitation while retaining ownership.",
      "addresses_issue": "i1",
      "key_observation": "Receipt by sale of loom-hours is capital receipt, not income."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Receipts from sale of loom-hours are capital receipts and not taxable as income.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Commissioner of Excess Profits, Bombay City v. Shri Lakshmi Silk Mills Ltd.",
      "citation": "1952 S.C.R. 120; 20 I.T.R. 451",
      "treatment": "distinguished",
      "relevance": "Receipt from exploitation of commercial asset (plant let out temporarily while retaining ownership) is business income; unlike outright sale of loom-hours."
    },
    {
      "case_name": "Maheshwari Devi Jute Mills v. Commissioner of Income-tax, U.P., Lucknow",
      "citation": "I.T. Misc. Case No. 177 of 1960, decided on September 13, 1962",
      "treatment": "doubted",
      "relevance": "Held sale of loom-hours as income from exploitation of commercial asset; Court disagrees as no ownership retained."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act",
      "sections": [
        "s. 66A(2)",
        "s. 4(3)(vii)",
        "s. 12B"
      ],
      "relevance": "Certificate for appeal; exemption for casual non-recurring receipts not capital gains and not from business; applied to hold receipts capital, not taxable."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeals preferred by the Commissioner of Income-tax are dismissed. The High Court was right in holding that the receipts from sale of loom-hours were capital receipts and not taxable.",
    "relief_granted": "Receipts held not liable to tax",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"Receipt by the exploitation of a commercial asset is the profit of the business, irrespective of the manner in which the asset is exploited by the owner of the business\"",
      "speaker": "court",
      "significance": "Principle from Lakshmi Silk Mills, applied but distinguished."
    },
    {
      "text": "\"Loom-hours cannot from their very nature be let out while retaining property in them, for there can be no grant of a temporary right to use loom-hours.\"",
      "speaker": "court",
      "significance": "Key distinction making transaction a sale, yielding capital receipt."
    },
    {
      "text": "\"Receipt by sale of loom-hours must therefore be regarded in this case as a capital receipt and not income.\"",
      "speaker": "court",
      "significance": "Core holding affirming High Court."
    }
  ],
  "_case_id": "1965_190",
  "_label": 0,
  "_text_length": 13251,
  "_extracted_at": "2026-02-10T19:26:59.234681"
}