{
  "metadata": {
    "case_name": "V. N. Sarin v. Ajit Kumar Poplai & Anr.",
    "case_year": 1965,
    "court": "Supreme Court of India",
    "judges": [
      "Gajendragadkar, C.J."
    ],
    "case_number": "Civil Appeal No. 468 of 1965",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The premises in question are a part of a bungalow situate at Racquet Court Road, Civil Lines, Delhi.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The bungalow originally belonged to the joint Hindu family consisting of respondent No. 2, Mr. B. S. Poplai and his two sons, respondent No. 1, Major Ajit Kumar Poplai and Vinod Kumar Poplai.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The three members of this undivided Hindu family partitioned their coparcenary property on May 17, 1962, and as a result of the said partition, the present premises fell to the share of respondent No. 1.",
      "type": "material",
      "date": "1962-05-17",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The appellant V. N. Sarin had been inducted into the premises as a tenant by respondent No. 2 before partition at a monthly rental of Rs. 80.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "After respondent No. 1 got this property by partition, he applied to the Rent Controller for the eviction of the appellant on the ground that he required the premises bona fide for his own residence and that of his wife and children who are dependent on him. To this application, he impleaded the appellant and respondent No. 2.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The appellant contested the claim of respondent No. 1 on three grounds: (1) respondent No. 1 was not his landlord inasmuch as he was not aware of the partition and did not know what it contained; (2) even if respondent No. 1 was his landlord, he did not require the premises bona fide and so, the requirements of s. 14(1)(e) of the Act were not satisfied; (3) if respondent No. 1 got the property in suit by partition, in law it meant that he had acquired the premises by transfer within the meaning of s. 14(6) of the Act and the provisions of the said section make the present suit incompetent.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "The Rent Controller held that respondent No. 1 was the exclusive owner of the premises in suit by virtue of partition. As such, it was found that he was the landlord of the appellant. In regard to the plea made by respondent No. 1 that he needed the premises bona fide as prescribed by s. 14(1)(e), the Rent Controller rejected the case of respondent No. 1. The point raised by the appellant under s. 14(6) of the Act was not upheld on the ground that acquisition of the suit premises by partition cannot be said to be acquisition by transfer within the meaning of the said section. As a result of the finding recorded against respondent No. 1 under s. 14(1)(e) however, his application for the appellant's eviction failed.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Against this decision, respondent No. 1 preferred an appeal to the Rent Control Tribunal, Delhi. The said Tribunal agreed with the Rent Controller in holding that respondent No. 1 was the landlord of the premises in suit and had not acquired the said premises by transfer. In regard to the finding recorded by the Rent Controller under s. 14(1)(e), the Rent Control Tribunal came to a different conclusion. It held that respondent No.1 had established his case that he needed the premises bona fide for his personal use as prescribed by the said provision. In the result, the appeal preferred by respondent No. 1 was allowed and the eviction of the appellant was ordered.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "This decision was challenged by the appellant by preferring a second appeal before the Punjab High Court at Delhi in Second Appeal from Order No. 235/D of 1963. The High Court upheld the findings recorded by the Rent Control Tribunal on the question of the status of respondent No. 1 as the landlord of the premises and on the plea made by him that his claim for eviction of the appellant was justified under s. 14(1)(e). The main contention which was raised before the High Court was in regard to the construction of s. 14(6) and on this point, the High Court has agreed with the view taken by the Rent Control Tribunal and has held that respondent No. 1 cannot be said to have acquired the premises in suit by transfer within the meaning of the said section.",
      "type": "procedural",
      "date": "1965-03-01",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Appeal by special leave to Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the partition of the coparcenary property among the coparceners can be said to be an acquisition by transfer within the meaning of s. 14(6) of the Delhi Rent Control Act, 1958.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Partition of coparcenary property among coparceners amounts to acquisition by transfer within the meaning of s. 14(6) of the Act.",
      "supporting_facts": [
        "f3",
        "f6"
      ],
      "legal_basis": "s. 14(6) Delhi Rent Control Act, 1958; s. 53 Transfer of Property Act; s. 17(1)(b) Indian Registration Act; precedents like Soniram Raghushet v. Dwarkabai"
    },
    {
      "id": "pa2",
      "text": "Preponderance of judicial authority holds partition as transfer for s. 53 TPA.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": "s. 5 Transfer of Property Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Acquisition of premises by partition is not acquisition by transfer within s. 14(6).",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": "s. 14(6) Delhi Rent Control Act, 1958"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Object of s. 14(6) is to prevent transfers by landlords as a device to enable purchasers to evict tenants, circumventing s. 14(1)(e).",
      "addresses_issue": "i1",
      "key_observation": "Policy underlying s. 14(6) targets stranger-purchasers, not coparceners with antecedent title."
    },
    {
      "id": "cr2",
      "text": "Partition does not create title but enables coparcener to obtain what is his own in definite form; involves transformation of joint title to separate titles, not transfer to stranger.",
      "addresses_issue": "i1",
      "key_observation": "Each coparcener has antecedent title; partition is not conveyance from living person to other living persons under s. 5 TPA."
    },
    {
      "id": "cr3",
      "text": "s. 14(6) assumes title did not vest prior to transfer; in partition, coparcener had subsisting title beforehand.",
      "addresses_issue": "i1",
      "key_observation": "Change of landlord in partition differs from transfer to stranger."
    },
    {
      "id": "cr4",
      "text": "References CIT v. Keshavlal where oral partition not transfer under Income-tax Act.",
      "addresses_issue": "i1",
      "key_observation": "Similar considerations apply."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Partition of undivided Hindu family property allotted to coparcener is not acquisition by transfer under s. 14(6) of Delhi Rent Control Act, 1958.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Girja Bal v. Sadashiv Dhunadiraj",
      "citation": "43 I.A. 151",
      "treatment": "followed",
      "relevance": "Partition does not give or create title in coparcener, enables obtaining what is his own in specific form."
    },
    {
      "case_name": "Soniram Raghushet v. Dwarkabai Shridharshet",
      "citation": "A.I.R. 1951 Bom. 94",
      "treatment": "referred",
      "relevance": "Holds partition as transfer under s. 53 TPA (preponderance view, but distinguished for s.14(6))."
    },
    {
      "case_name": "Naramsetti Venkatappala Narasimhalu v. Naramsetti Someswara Rao",
      "citation": "A.I.R. 1943 Mad. 505",
      "treatment": "referred",
      "relevance": "Holds partition not transfer under s. 53 TPA."
    },
    {
      "case_name": "Gutta Radhakrishnayya v. Gutta Sarasamma",
      "citation": "A.I.R. 1951 Mad. 213",
      "treatment": "referred",
      "relevance": "Holds partition not transfer under s. 53 TPA."
    },
    {
      "case_name": "Commissioner of Income-tax, Gujarat v. Keshavlal Lallubhai Patel",
      "citation": null,
      "treatment": "followed",
      "relevance": "Oral partition not transfer under s. 16(3)(a)(iii & iv) Income-tax Act, 1922."
    }
  ],
  "statutes_cited": [
    {
      "name": "Delhi Rent Control Act, 1958 (Act No. 59 of 1958)",
      "sections": [
        "s. 2(e)",
        "s. 14(1)(e)",
        "s. 14(6)"
      ],
      "relevance": "Defines landlord; grounds for eviction including bona fide need; bar on eviction application by transfer-acquirer within 5 years."
    },
    {
      "name": "Transfer of Property Act",
      "sections": [
        "s. 5",
        "s. 53"
      ],
      "relevance": "Definition of transfer; whether partition is transfer."
    },
    {
      "name": "Indian Registration Act",
      "sections": [
        "s. 17(1)(b)"
      ],
      "relevance": "Deed of partition requires registration as creating right/title/interest."
    },
    {
      "name": "Indian Income-tax Act, 1922",
      "sections": [
        "s. 16(3)(a)(iii)",
        "s. 16(3)(a)(iv)"
      ],
      "relevance": "Whether partition is indirect transfer."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal is dismissed. The Supreme Court upholds the High Court, Rent Control Tribunal, and finds that partition does not constitute acquisition by transfer under s. 14(6), allowing eviction under s. 14(1)(e).",
    "relief_granted": "Eviction of appellant upheld.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"Partition does not give him a coparcener a title or create a title in him it only enables him to obtain what is his own in a definite and specific form.\"",
      "speaker": "court",
      "significance": "Core reasoning on nature of partition from Privy Council."
    },
    {
      "text": "The object which this provision is intended to achieve is to prevent transfers by landlords as a device to enable the purchasers to evict the tenants.",
      "speaker": "court",
      "significance": "Explains policy behind s. 14(6)."
    },
    {
      "id": "kq3",
      "text": "\"It would not be easy to uphold the broad contention raised by Mr. Purshottam that Partition of an undivided Hindu family property must necessarily mean transfer of the property to the individual coparceners.\"",
      "speaker": "court",
      "significance": "Rejects petitioner's main argument."
    }
  ],
  "_case_id": "1965_245",
  "_label": 0,
  "_text_length": 17705,
  "_extracted_at": "2026-02-10T19:27:38.891696"
}