{
  "metadata": {
    "case_name": "Appellant Company v. Income-tax Authorities",
    "case_year": null,
    "court": "Supreme Court of India",
    "judges": [
      "Shah, J."
    ],
    "case_number": null,
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "For the period July 1, 1944, to June 30, 1950, the appellant company was permitted under two separate agreements both dated September 14, 1944, with the Maharaja of Jeypore to collect sleepers and scantlings approved by the company from logs of sal trees marked by the forest department, in the Ramgiri Forest and Omerkote Nowrangpur range in the Jeypore Estate, in consideration of the company agreeing to pay as royalty specified percentages of the price at which the sleepers and scantlings were supplied by the company to the Indian railways.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "By a letter dated January 16, 1950, addressed to the Dewan of Jeypore the company offered to pay enhanced royalty for the period June 1, 1948, to June 30, 1950, in consideration of the Estate granting renewal of the agreements which were about to expire.",
      "type": "material",
      "date": "1950-01-16",
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "The Collector of Koraput who was the authority to sanction the grant or renewal of the agreement under section 31(a) of the Orissa Preservation of Private Forests Act, 1947, by order dated April 3, 1950, sanctioned renewal of the original agreement for one year from July 1, 1950, to June 30, 1951.",
      "type": "procedural",
      "date": "1950-04-03",
      "source": "lower_court"
    },
    {
      "id": "f4",
      "text": "A fresh agreement was thereafter executed on June 13, 1952 for a term of three years with effect from July 1, 1951 under which company was granted the right to cut sal trees marked by the Estates forest department in the area agreed upon and to convert the same into sleepers and scantlings and to remove them. The agreement provided that the company would pay to Estate subject to a minimum of Rs 40,000 annually which would not be altered during the term of the agreement at the rates specified in clause 6 for different types of sleepers and scantlings mentioned therein.",
      "type": "material",
      "date": "1952-06-13",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "During the course of negotiations for extension of the agreement from July 1, 1951, the company agreed to pay royalty at enhanced rates for the period July 1, 1948 to June 30, 1950, on condition that the agreement was extended for at least three years. This worked at the rate of Rs. 69,000 per annum.",
      "type": "material",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "The company then offered by its letter dated March 22, 1951, to pay an additional amount of Rs. 9,000 annually in addition to Rs. 69,000 already agreed to be paid.",
      "type": "material",
      "date": "1951-03-22",
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "By another letter dated June 10, 1952 it was confirmed that subject to a lease being signed in the terms of the draft enclosed with the company letter dated June 9, 1951, the company agreed to pay additional amounts in the aggregate at the rate of Rs. 83,000 annually during the term of the lease. A covenant about the additional payments offered to be made by the company was however not incorporated in the agreement dated June 13, 1952.",
      "type": "material",
      "date": "1952-06-10",
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "In proceedings for assessment of income-tax in the assessment year 1953-54, the claim of the company to deduct Rs. 83,157 paid during the year of account in addition to the royalty stipulated under the agreement dated June 13, 1952 as an allowable expenditure under section 10(2)(xv) of the Indian Income-tax Act was rejected by the Income-tax Officer.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f9",
      "text": "The order of the Income-tax Officer was reversed by the Appellate Assistant Commissioner who held that the agreement to pay amounts of money in addition to royalty stipulated to be paid under the formal agreement were additional royalty solely for the purpose of acquiring logs to be converted into sleepers for sale and the payments represented the prime cost of the company's stock-in-trade.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "In appeal by the Income-tax Officer, the Income-tax Appellate Tribunal confirmed the order of the Appellate Assistant Commissioner.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "The Tribunal drew up a statement and submitted the question: Whether on the facts and in the circumstances of the case, and on the correct interpretation of the three enclosures to the letter of the assessee dated the 8th day of July 1954, to the Income-tax Officer concerned the sum of Rs. 83,517 was allowable as an expenditure of a revenue nature?",
      "type": "procedural",
      "date": "1954-07-08",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "The High Court answered the question in the negative, holding the expenditure was capital in nature.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether on the facts and in the circumstances of the case, and on the correct interpretation of the three enclosures to the letter of the assessee dated the 8th day of July 1954, to the Income-tax Officer concerned the sum of Rs. 83,517 was allowable as an expenditure of a revenue nature under section 10(2)(xv) of the Indian Income-tax Act?",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The additional payments were additional royalty solely for the purpose of acquiring logs to be converted into sleepers for sale and represented the prime cost of the company's stock-in-trade.",
      "supporting_facts": [
        "f1",
        "f4",
        "f5",
        "f6",
        "f7"
      ],
      "legal_basis": "Section 10(2)(xv) of the Indian Income-tax Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The royalty payable under the agreement dated June 13, 1952 and the additional payment agreed by correspondence were of the same character; the company did not purchase standing timber but was given a right to extract sleepers; what was acquired was not stock-in-trade but the right to acquire it, a capital asset of enduring nature per Hood-Barrs; alternatively, additional amounts were in consideration of extension of expired agreements, securing benefit of enduring nature.",
      "supporting_facts": [
        "f4",
        "f2",
        "f3"
      ],
      "legal_basis": "Section 10(2)(xv) of the Indian Income-tax Act; Hood-Barrs v Inland Revenue Commissioners"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The High Court was not right in assuming that the royalty under the 1952 agreement and additional payments were of the same character, and royalty under 1952 agreement was revenue expenditure for acquiring stock-in-trade; but ITO only disallowed additional amounts relating to back royalty 1948-1950.",
      "addresses_issue": "i1",
      "key_observation": "Royalty under 1952 agreement is revenue, but additional payments are separate."
    },
    {
      "id": "cr2",
      "text": "Additional payments were offered conditionally to secure renewal/extension of agreements for longer period; persistent efforts to persuade authorities for new lease of 3-5 years; no legal obligation under original agreement; payment of premium to secure right to take stock-in-trade is capital expenditure.",
      "addresses_issue": "i1",
      "key_observation": "Payments secured enduring benefit of continued business via lease renewal."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The additional payments of Rs. 83,157 are capital expenditure, not allowable under section 10(2)(xv) as revenue expenditure.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Hood-Barrs v Inland Revenue Commissioners",
      "citation": null,
      "treatment": "followed",
      "relevance": "Principle that acquiring right to acquire stock-in-trade is capital asset of enduring nature."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act",
      "sections": [
        "10(2)(xv)"
      ],
      "relevance": "Allowance for expenditure not capital in nature, laid out wholly for business."
    },
    {
      "name": "Orissa Preservation of Private Forests Act, 1947",
      "sections": [
        "31(a)"
      ],
      "relevance": "Authority of Collector of Koraput to sanction renewal of agreements."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeals fail and are dismissed with costs, sustaining High Court's answer that additional payments are capital expenditure on alternative ground.",
    "relief_granted": null,
    "costs": "Dismissed with costs"
  },
  "key_quotes": [
    {
      "text": "money spent for acquiring stock-in-trade of the business is revenue expenditure.",
      "speaker": "court",
      "significance": "Distinguishes royalty under 1952 agreement as revenue."
    },
    {
      "text": "payment of premium in consideration of the owner of property agreeing to grant a right to take and remove the stock-in-trade of the taxpayer is in the nature of capital expenditure.",
      "speaker": "court",
      "significance": "Core holding on nature of additional payments."
    }
  ],
  "_case_id": "1965_171",
  "_label": 0,
  "_text_length": 10420,
  "_extracted_at": "2026-02-10T19:26:20.239831"
}