{
  "metadata": {
    "case_name": "State of U.P. (Appellant) v. Ex-Zamindar (Respondent)",
    "case_year": 1960,
    "court": "Supreme Court of India",
    "judges": [
      "Raghubar Dayal, J."
    ],
    "case_number": null,
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Respondent, an ex-Zamindar, assessed to agricultural income-tax in assessment year 1360 F. (corresponding to 1952-53) on agricultural income accruing in previous year 1359 F. (corresponding to 1951-52).",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Respondent did not pay assessed tax and was assessed to penalty, resulting in total dues of Rs. 868 for tax plus penalty.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Respondent's writ petition contending no liability to pay tax dismissed by High Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Agricultural income-tax authorities initiated proceedings for realisation of dues.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "On July 24, 1956, respondent applied to Agricultural Income-tax Assessing Officer, Allahabad, depositing bonds of Rs. 850 and Rs. 18 cash, praying acceptance in payment of dues. Application rejected as no rule for acceptance.",
      "type": "procedural",
      "date": "1956-07-24",
      "source": "respondent"
    },
    {
      "id": "f6",
      "text": "On August 1, 1956, respondent applied to Collector complaining Assessing Officer had no valid reason to refuse bonds as negotiable instruments. Rejected on report that bonds not accepted for tax dues, not negotiable, no provision.",
      "type": "procedural",
      "date": "1956-08-01",
      "source": "respondent"
    },
    {
      "id": "f7",
      "text": "Respondent filed writ petition in High Court of Allahabad for certiorari quashing orders, mandamus directing acceptance of bonds or deduction from rehabilitation grant, prohibition against coercive measures.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "Grounds in writ: bonds negotiable instruments, legal tender issued by Government, rule 8-A requires deduction from interim compensation.",
      "type": "background",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f9",
      "text": "Counter-affidavit by Naib-Tehsildar Agricultural Income-tax Officer: tax payable in four instalments, penalty Rs. 43 per default; bonds not acceptable under section 6(d) read with rule 48 as tax due from July 1, 1952.",
      "type": "background",
      "date": null,
      "source": "state"
    },
    {
      "id": "f10",
      "text": "High Court held orders wrong, quashed Collector's order dated August 24, 1956, directed Collector to decide application afresh in accordance with law (section 6(d), rule 8-A). Order dated April 8, 1960.",
      "type": "procedural",
      "date": "1960-04-08",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Appellant obtained special leave and appealed against High Court order.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Section 6(d) amended by U.P. Act XVI of 1953 retrospectively from July 1, 1952: arrears of ag income-tax recoverable by deducting from compensation money payable under Chapter III.",
      "type": "background",
      "date": "1952-07-01",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Rule 8-A added by Notification dated August 17, 1954: arrears of ag income-tax realised by deduction from interim compensation or compensation payable.",
      "type": "background",
      "date": "1954-08-17",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether Zamindari Abolition Compensation Bonds issued under U.P. Zamindari Abolition and Land Reforms Act, 1950, have to be accepted by authorities in payment of agricultural income-tax due from intermediaries.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Neither section 6(d) of the Act nor rule 8-A provides that bonds can be accepted in payment of agricultural income-tax; Collector's order correct.",
      "supporting_facts": [
        "f12",
        "f13"
      ],
      "legal_basis": "Section 6(d) U.P. Zamindari Abolition Act; Rule 8-A"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Rule 8-A makes it mandatory to realise tax from compensation payable, and compensation continues payable till bonds encashed; bonds are negotiable and legal tender.",
      "supporting_facts": [
        "f5",
        "f6",
        "f7",
        "f8"
      ],
      "legal_basis": "Rule 8-A; Section 6(d)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Section 6(d) and rule 8-A allow recovery of arrears by deduction from compensation money payable, but do not provide for acceptance of bonds in payment of tax.",
      "addresses_issue": "i1",
      "key_observation": "No provision mandates or permits acceptance of bonds for tax payment."
    },
    {
      "id": "cr2",
      "text": "Compensation paid upon delivery of bonds per section 68; bonds not legal tender, merely negotiable; cannot be encashed before due date per rules 62-65.",
      "addresses_issue": "i1",
      "key_observation": "Delivery of bonds satisfies compensation claim; compensation no longer payable thereafter."
    },
    {
      "id": "cr3",
      "text": "Provisions of section 6(d) apply to arrears assessed in 1360 F. on 1359 F. income; rule 8-A mandatory, per Collector of Sultanpur v. Raja Jagdish Prasad Singh.",
      "addresses_issue": "i1",
      "key_observation": "Confirmed applicability but no bond acceptance."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Zamindari Abolition Compensation Bonds cannot be accepted in payment of agricultural income-tax dues as no statutory provision requires or permits it.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Collector of Sultanpur v. Raja Jagdish Prasad Singh",
      "citation": null,
      "treatment": "followed",
      "relevance": "Holds section 6(d) applies to arrears of ag income-tax assessed in 1360 F. on 1359 F. income; rule 8-A mandatory."
    }
  ],
  "statutes_cited": [
    {
      "name": "Uttar Pradesh Zamindari Abolition and Land Reforms Act, 1950 (U.P. Act 1 of 1951)",
      "sections": [
        "Section 6(d)",
        "Section 68"
      ],
      "relevance": "Section 6(d) allows deduction of tax arrears from compensation payable; section 68 provides payment in cash or bonds."
    },
    {
      "name": "U.P. Agricultural Income-tax Act, 1948 (U.P. Act III of 1949)",
      "sections": [],
      "relevance": "Governs assessment and recovery of agricultural income-tax."
    },
    {
      "name": "U.P. Act XVI of 1953",
      "sections": [
        "Section 3"
      ],
      "relevance": "Amended section 6(d) retrospectively from July 1, 1952."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; High Court order set aside; Collector's order dated August 24, 1956, restored. Bonds not to be accepted in payment of tax dues.",
    "relief_granted": "None to respondent; recovery proceedings may proceed.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "It is clear from the above provisions that neither section 6(d) nor rule 8-A provide that bonds must or can be accepted in payment of tax on agricultural income.",
      "speaker": "court",
      "significance": "Core holding rejecting bond acceptance."
    },
    {
      "text": "The fact that the bonds are negotiable does not make them legal tender and does not make it obligatory on anyone, including Government, to accept them in payment of any dues.",
      "speaker": "court",
      "significance": "Clarifies legal status of bonds."
    }
  ],
  "_case_id": "1965_271",
  "_label": 1,
  "_text_length": 11083,
  "_extracted_at": "2026-02-10T19:27:37.077451"
}