{
  "metadata": {
    "case_name": "Commissioner of Income-tax v. Respondent (S. Raghbir Singh)",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "Shah, J."
    ],
    "case_number": "Civil Appeals Nos. 96 to 98 of 1964",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "On April 10, 1953 the estate of the joint Hindu family of which the respondent was a member was partitioned, and the respondent was allotted, besides other properties, 400 shares of the Simbhaoli Sugar Mills Private Ltd., and was made liable to pay a business debt amounting to Rs. 3,91,875/- due by the family to R.B. Seth Jessa Ram Fateh Chand of Delhi.",
      "type": "material",
      "date": "1953-04-10",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On April 14, 1953 the respondent executed a deed of trust in respect of 300 out of the shares of the Simbhaoli Sugar Mills which fell to his share.",
      "type": "material",
      "date": "1953-04-14",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The deed of trust provided that the author (respondent) as absolute owner of the said shares decided to settle on trust three hundred shares numbering 1 to 300 for the benefit of his creditors and other beneficiaries, divesting himself of all proprietary rights in the said shares irrevocably held on Trust by the Trustees to pay off debts in Schedule A (incurred for benefit of Joint Hindu Family), and after debts paid off, for maintenance and education of children and grandchildren, hospitals, schools, reading room, library, orphans, widows, poor people, scholarships, etc.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "By cl. 3 four persons including the respondent were appointed trustees, and the respondent was to hold the office of Chairman of the Trust during his lifetime. Shares to stand in name of Chairman who has power to operate bank accounts, preside at meetings, exercise right of vote.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Clause 5: Trustees entitled to sell shares except as provided, but can mortgage or pledge for raising funds to pay debts.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Clause 6: Payment of debts topmost priority, no spending till debts paid; if unable to pay from income within 10 years, sell shares; after debts, spend 80% on maintenance of children/grandchildren, remaining 20% on other objects.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "The respondent claimed before the Income-tax Officer that dividend received by trustees on 300 shares is income of Trust, he had no concern as divested ownership, and Rs. 19,856/- interest to R.B. Seth Jessa Ram Fateh Chand deductible.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "Income-tax Officer rejected, holding Trust fictitious.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Appellate Assistant Commissioner held respondent had not irrevocably transferred shares, s.16(1)(c) proviso applies.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Tribunal upheld, referred questions to High Court: (1) Whether dividend income of 300 shares transferred to Trust is income of assessee liable to tax? (2) Entitled to deduction of Rs.19,856/- interest?",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "High Court answered first question negative, declined second. Commissioner appealed to Supreme Court with special leave.",
      "type": "procedural",
      "date": "1960-09-22",
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the dividend income of 300 shares of the Simbhaoli Sugar Mills, Private Ltd. transferred by the assessee to S. Raghbir Singh Trust was the income of the assessee liable to tax?",
      "framed_by": "lower_court"
    },
    {
      "id": "i2",
      "text": "Whether the assessee was entitled to claim deduction of Rs. 19,856/- paid as interest to R.B. Seth Jessa Ram Fateh Chand against the dividend income of the aforesaid 300 shares?",
      "framed_by": "lower_court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Trust was a fictitious transaction.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Respondent had not irrevocably transferred the 300 shares, by virtue of s.16(1)(c) proviso liable to tax on dividend.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": "Income-tax Act, s.16(1)(c)"
    },
    {
      "id": "pa3",
      "text": "By direction for application of income for satisfaction of debts due by respondent, there is provision for retransfer indirectly of income or right to reassume power over income, making settlement revocable under first proviso to s.16(1)(c). Use of 'indirectly' brings cases where settlor discharges own liability.",
      "supporting_facts": [
        "f3",
        "f6"
      ],
      "legal_basis": "Income-tax Act, s.16(1)(c) first proviso"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Dividend received by trustees is income of Trust, respondent had divested himself irrevocably of ownership of shares.",
      "supporting_facts": [
        "f2",
        "f3"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Rs. 19,856/- interest to R.B. Seth Jessa Ram Fateh Chand permissible deduction in computing net income from dividend.",
      "supporting_facts": [
        "f1",
        "f7"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Genuineness of trust not in dispute. Shares to stand in Chairman's name due to s.33 Companies Act 1913 preventing notice of trust on register.",
      "addresses_issue": "i1",
      "key_observation": "Direction necessitated by Companies Act."
    },
    {
      "id": "cr2",
      "text": "Deed expressly irrevocable, but first proviso to s.16(1)(c) deems revocable if provision for retransfer directly/indirectly of income/assets or right to reassume power directly/indirectly. No such provision here; income arises to trustees, applied to debts settlor obliged to pay, but no retransfer or reassumption of power.",
      "addresses_issue": "i1",
      "key_observation": "Settlor benefits consequentially, but proviso not attracted."
    },
    {
      "id": "cr3",
      "text": "First proviso contemplates provision for retransfer or reassumption of power; even if settlor benefits, without such provision, not within proviso.",
      "addresses_issue": "i1",
      "key_observation": "Rejects revenue argument on 'indirectly' covering discharge of own liability."
    },
    {
      "id": "cr4",
      "text": "Cites Bombay HC cases: Ramji Keshavji and D.R. Shahapure, where trust/arrangement to discharge obligation (under consent decree or for wife) not attracted s.16(1)(c) as no provision for retransfer/reassumption.",
      "addresses_issue": "i1",
      "key_observation": "Person under obligation arising out of status may execute trust to discharge without attracting s.16(1)(c)."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Dividend income not income of assessee under s.16(1)(c) as no provision for retransfer or reassumption of power, settlement irrevocable.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Commissioner of Income-tax, Bihar and Orissa v. Rani Bhuwanesliwari Kuer",
      "citation": "53 I.T.R. 195",
      "treatment": "followed",
      "relevance": "Explains provisos to s.16(1)(c); settlements deemed revocable if provision for retransfer or reassumption of power."
    },
    {
      "case_name": "Ramji Keshavji v. Commissioner of Income-tax, Bombay",
      "citation": null,
      "treatment": "followed",
      "relevance": "Trust under consent decree for wife to maintain children not deemed income of assessee under s.16(1)(c)."
    },
    {
      "case_name": "D.R. Shahapure v. Commissioner of Income-tax, Bombay",
      "citation": null,
      "treatment": "followed",
      "relevance": "Irrevocable covenant to pay income to wife not attracted s.16(1)(c)."
    }
  ],
  "statutes_cited": [
    {
      "name": "Income-tax Act",
      "sections": [
        "s. 2(15)",
        "s. 4(1)",
        "s. 16(1)(c)"
      ],
      "relevance": "Defines total income; deems income from settlement where assets remain property of settlor or revocable transfer as income of settlor; provisos explain revocability."
    },
    {
      "name": "Indian Companies Act, 1913",
      "sections": [
        "s. 33"
      ],
      "relevance": "Prevented notice of trust on register, necessitating shares in Chairman's name."
    },
    {
      "name": "Indian Income-tax (Amendment) Act, 1939",
      "sections": null,
      "relevance": "Reference to commencement for settlements."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court upheld High Court's answer that dividend income from 300 shares transferred to irrevocable trust is not income of assessee liable to tax under s.16(1)(c), as no provision for retransfer or reassumption of power.",
    "relief_granted": "Appeal dismissed, confirming High Court view in favour of assessee.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The income has to be applied for satisfaction of debts which the settlor was under a obligation to discharge. but that is number to say that there is a provision for retransfer of the income or assets to the settlor, or that the settlor is invested with power to reassume the income or assets.",
      "speaker": "court",
      "significance": "Core reasoning why s.16(1)(c) first proviso not attracted."
    },
    {
      "text": "Clause  c  was intended... to circumvent attempts made by him to reduce his liability to pay income-tax by the expedient of so arranging a settlement or disposition of property that the income does number accrue to him, but he reserves a power over or interest in the property settled or disposed of.",
      "speaker": "court",
      "significance": "Explains purpose of s.16(1)(c)."
    }
  ],
  "_case_id": "1965_240",
  "_label": 0,
  "_text_length": 16548,
  "_extracted_at": "2026-02-10T19:27:04.721029"
}