{
  "metadata": {
    "case_name": "Life Insurance Corporation of India v. Crown Life Insurance Company",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "Wanchoo J."
    ],
    "case_number": "Civil Appeal No. 999 of 1964",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appeal by special leave from the order dated March 25, 1954 of the Life Insurance Tribunal, Bombay in Case No. 27 of 1962.",
      "type": "procedural",
      "date": "1954-03-25",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Respondent is Crown Life Insurance Company, incorporated in Canada.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Appellant, Life Insurance Corporation of India, took over the business of the respondent under the Life Insurance Corporation Act, No. 31 of 1956.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Respondent claimed Rs. 27,86,658 as compensation.",
      "type": "material",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f5",
      "text": "Appellant was prepared to pay Rs. 1,11,466 as compensation.",
      "type": "material",
      "date": null,
      "source": "appellant"
    },
    {
      "id": "f6",
      "text": "Respondent's life insurance fund was always in deficit before the Act came into force, as shown by Form I of the Fourth Schedule to the Insurance Act.",
      "type": "admitted",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f7",
      "text": "Appellant claimed surplus of Rs. 27,86,658 under cl. (d) of paragraph 4 of Part B of the First Schedule to the Act, leading to debit of Rs. 26,75,192 towards liabilities.",
      "type": "disputed",
      "date": null,
      "source": "appellant"
    },
    {
      "id": "f8",
      "text": "Life Insurance Tribunal accepted respondent's contention and awarded compensation at Rs. 27,86,658.",
      "type": "procedural",
      "date": "1954-03-25",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Respondent's business in India always showed deficit in Form I.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Respondent paid bonuses to policy-holders out of global surplus despite Indian deficit.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Respondent executed instrument of trust under s.27(6) Insurance Act with State Bank of India as trustee for assets to cover deficit under s.27(1).",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Funds brought by respondent from outside to cover deficit were never put in revenue account Form D and never part of life insurance fund.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Respondent repatriated excess assets of about Rs. 15-16 lakhs under s.35 LIC Act.",
      "type": "material",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Interpretation of the words 'life insurance fund' as used in paragraph 4 of Part B of the First Schedule to the Life Insurance Corporation Act, No. 31 of 1956.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Words 'life insurance fund' in cl. (d) meant the difference between the total assets and the liabilities under cls. (a) and (c) of paragraph 4, leading to surplus of Rs. 27,86,658 and debit of Rs. 26,75,192.",
      "supporting_facts": [
        "f5",
        "f7"
      ],
      "legal_basis": "Paragraph 4 Part B First Schedule, Life Insurance Corporation Act, 1956"
    },
    {
      "id": "pa2",
      "text": "Words 'life insurance fund' under Insurance Act have no one meaning only, or context requires different meaning in cl. (d).",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "Insurance Act, 1938 (ss.56,58, Regulation 7 Part I First Schedule)"
    },
    {
      "id": "pa3",
      "text": "Assets under s.27(1) Insurance Act to meet liabilities are part of life insurance fund.",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": "s.27(1) Insurance Act, 1938"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Words 'life insurance fund' in cl. (d) have the same meaning as under the Insurance Act, where there was always deficit in Form I Fourth Schedule, so no liability under cl. (d).",
      "supporting_facts": [
        "f4",
        "f6"
      ],
      "legal_basis": "s.2(10) Life Insurance Corporation Act, 1956; s.10(2) Insurance Act, 1938; Form D Third Schedule, Form I Fourth Schedule Insurance Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Under s.2(10) LIC Act, words defined in Insurance Act have same meaning unless context requires otherwise.",
      "addresses_issue": "i1",
      "key_observation": "Words 'life insurance fund' not defined in s.2 Insurance Act but specific meaning in s.10(2) read with s.11 and Form D Third Schedule."
    },
    {
      "id": "cr2",
      "text": "Life insurance fund under Insurance Act is receipts from premiums etc. forming separate fund, balance after revenue account Form D; not all assets (e.g. share capital excluded).",
      "addresses_issue": "i1",
      "key_observation": "Surplus/deficit per Form I Fourth Schedule: life insurance fund balance vs. net liability Form H."
    },
    {
      "id": "cr3",
      "text": "Words have same meaning throughout Insurance Act; ss.56,58, Reg.7 do not indicate different meaning.",
      "addresses_issue": "i1",
      "key_observation": "Marginal notes and context refer back to standard meaning."
    },
    {
      "id": "cr4",
      "text": "s.27(1) requires assets invested to cover deficit but such assets not automatically part of life insurance fund unless through Form D; in this case, never included.",
      "addresses_issue": "i1",
      "key_observation": "Trust fund under s.27(6) separate; Form I always showed deficit."
    },
    {
      "id": "cr5",
      "text": "Nothing in context of LIC Act requires different meaning; cl.(d) related to s.49(1) Insurance Act surplus for policyholders.",
      "addresses_issue": "i1",
      "key_observation": "Part B for insurers with no allocation under Part A, i.e. deficit or undistributed surplus per Form I."
    },
    {
      "id": "cr6",
      "text": "s.35 LIC Act explicitly refers to all assets/liabilities, unlike cl.(d); appellant's meaning leads to inconsistency with s.35.",
      "addresses_issue": "i1",
      "key_observation": "Same total recovery whether apply s.35 or not only if standard meaning."
    },
    {
      "id": "cr7",
      "text": "Appellant's meaning would absurdly include share capital as life insurance fund.",
      "addresses_issue": "i1",
      "key_observation": "cl.(d) for past surplus; future with-profits covered by cl.(b)."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Words 'life insurance fund' in cl.(d) para 4 Part B First Schedule LIC Act have same meaning as in s.10(2) Insurance Act read with s.11 and Form D Third Schedule; respondent had deficit, no liability under cl.(d).",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Life Insurance Corporation Act, 1956",
      "sections": [
        "s.2(10)",
        "s.35",
        "First Schedule Part A para (opening)",
        "First Schedule Part B para 4 cls.(a),(b),(c),(d)"
      ],
      "relevance": "Interpretation of 'life insurance fund'; principles for compensation; repatriation of assets."
    },
    {
      "name": "Insurance Act, 1938",
      "sections": [
        "s.10(1),(2),(3)",
        "s.11(c)",
        "s.13(1)",
        "s.27(1),(6)",
        "s.49(1)",
        "s.56(2)",
        "s.58(3)",
        "Third Schedule Form D",
        "Fourth Schedule Forms H, I"
      ],
      "relevance": "Definition and computation of life insurance fund, surplus/deficit, valuation, investments, dividends, winding-up."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal dismissed confirming Life Insurance Tribunal's order awarding compensation of Rs. 27,86,658 to respondent as no surplus in life insurance fund per cl.(d) para 4 Part B First Schedule LIC Act.",
    "relief_granted": "Compensation Rs. 27,86,658 upheld for respondent.",
    "costs": "Costs to the respondent."
  },
  "key_quotes": [
    {
      "text": "The only question that arises for determination in this appeal by special leave ... is the interpretation of the words life insurance fund as used in paragraph 4 of Part B of the First Schedule to the Life Insurance Corporation Act, No. 31 of 1956.",
      "speaker": "court",
      "significance": "States the sole issue."
    },
    {
      "text": "We must therefore reject the contention on behalf of the appellant that the words life insurance fund have any meaning other than that assigned to them in s. 10(2) of the Insurance Act so far as that Act is concerned.",
      "speaker": "court",
      "significance": "Rejects appellant's primary argument on Insurance Act meaning."
    },
    {
      "text": "We have therefore no doubt that the tribunal was right in its conclusion that the words life insurance fund as used in cl. (d) of the aforesaid 4th paragraph have the same meaning as that given to them in s. 10(2) of the Insurance Act read with s. 11 and form D of the Third Schedule to the Insurance Act.",
      "speaker": "court",
      "significance": "Core holding on interpretation."
    }
  ],
  "_case_id": "1965_27",
  "_label": 0,
  "_text_length": 37683,
  "_extracted_at": "2026-02-10T19:24:58.471019"
}