{
  "metadata": {
    "case_name": "Poona Electric Supply Co., Ltd. v. Commissioner of Income-tax",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "Subba Rao, J."
    ],
    "case_number": "Civil Appeals Nos. 633 and 634 of 1964",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The appellant, the Poona Electric Supply Co., Ltd., carried on the business of distribution of electricity in the city of Poona under a licence issued by the Government.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Under the Electricity Supply Act, 1948, the Company's clear profit in any year should not, as far as possible, exceed the amount of reasonable return as defined under the Act. The excess, if any, after making some deductions, the Company has to distribute to its consumers in the form of rebate.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "During the assessment years 1953-54 and 1954-55 the Company claimed deduction of two amounts of Rs. 42,148/- and Rs. 77,138/- for the said two years from its taxable income as they were credited to Consumers Benefit Reserve Account.",
      "type": "material",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "The Income-tax Officer disallowed the claim and on appeal the Appellate Assistant Commissioner agreed with the Income-tax Officer.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "On a further appeal, the Income-tax Appellate Tribunal accepted the contention of the appellant and allowed the deductions.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "At the instance of the Revenue, the Tribunal submitted the question of law to the High Court of Judicature at Bombay: Whether the two sums of Rs. 42,148/- in the assessment year 1953-54 and Rs. 77,138/- in the assessment year 1954-55 were deductible in computing income, profits and gains from the assessee's business assessable to tax.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "A Division Bench of the Bombay High Court answered the question in the negative and against the appellant on July 23 and 24, 1962 in Income-tax Reference No. 61 of 1961.",
      "type": "procedural",
      "date": "1962-07-23",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "The present appeals have been filed by the Company after obtaining the requisite certificate from the High Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "The Company follows the mercantile system of accounting and the statutory liability for the said two amounts arose in the accounting years of 1952 and 1953.",
      "type": "admitted",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f10",
      "text": "For the purposes of the Act, during the accounting years the assessee credited the said amounts to the Consumers Benefit Reserve Account. They were part of the excess amount paid to it and reserved to be returned to the consumers.",
      "type": "material",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the two sums of Rs. 42,148/- in the assessment year 1953-54 and Rs. 77,138/- in the assessment year 1954-55 were deductible in computing income, profits and gains from the assessee's business assessable to tax.",
      "framed_by": "tribunal"
    },
    {
      "id": "i2",
      "text": "Whether the amounts so reserved for future payment were deductible in computing the income, profits or gains from the assessee's business for the assessment years 1953-54 and 1954-55 under the mercantile system of accounting.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "There is a distinction between commercial profit of a company and clear profit under the Act---one is arrived at on commercial principles and the other is regulated by the statute. The real profit of a company under s. 10(1) of the Indian Income-tax Act can be determined only after excluding the amount statutorily transferred to the Consumers Benefit Reserve Account, for that amount represents a rebate to the customers of the excess amount collected from them.",
      "supporting_facts": [
        "f2",
        "f3",
        "f10"
      ],
      "legal_basis": "s. 10(1) Indian Income-tax Act"
    },
    {
      "id": "pa2",
      "text": "As the reservation of a part of the said excess is a statutory condition subject to which the Company carries on its business, it is an expenditure wholly and exclusively incurred for the purpose of the Company's business and, therefore, it is an allowance deductible under s. 10(2)(xv) of the Income-tax Act for computing the profit of the Appellant's business.",
      "supporting_facts": [
        "f2"
      ],
      "legal_basis": "s. 10(2)(xv) Income-tax Act"
    },
    {
      "id": "pa3",
      "text": "The Company follows the mercantile system of accounting and, therefore, the amount of rebate so reserved is deductible for arriving at the commercial profit of the Company in the year when the statutory liability arises and not when the amount is actually paid and in the present case the statutory liability for the said two amounts arose in the accounting years of 1952 and 1953.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": "Mercantile system of accounting"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Under the relevant provisions of the Act the transference of a part of the said excess to the consumers benefit reserve account would only amount to apportionment or distribution of the profit after it has been earned and, therefore, it is not a deductible item for ascertaining the profit of the Company under s. 10(1) of the Income-tax Act.",
      "supporting_facts": [
        "f2"
      ],
      "legal_basis": "Sixth Schedule to Electricity Supply Act, 1948; s. 10(1) Income-tax Act"
    },
    {
      "id": "ra2",
      "text": "The said amounts could not be said to be an expenditure wholly and exclusively incurred for the purpose of the business, as the expenditure was not incurred either during the course of the business or for the purpose of earning the profits of the business, but was only apportioned or distributed from and out of the profits already earned.",
      "supporting_facts": [
        "f2"
      ],
      "legal_basis": "s. 10(2)(xv) Income-tax Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "There is a clear-cut distinction between deductions made for ascertaining the profits and distributions made out of profits. Income-tax is a tax on the real income, i.e., the profits arrived at on commercial principles subject to the provisions of the Income-tax Act.",
      "addresses_issue": "i1",
      "key_observation": "Distinction between real/commercial profits and statutory clear profit."
    },
    {
      "id": "cr2",
      "text": "The real profit of a businessman under s. 10(1) of the Income-tax Act cannot obviously include the amounts returned by him by way of rebate to the consumers under statutory compulsion. It is as if he received only from the consumers the original amount minus the amount he returned to them.",
      "addresses_issue": "i1",
      "key_observation": "Amounts reserved for rebate are not part of real profits."
    },
    {
      "id": "cr3",
      "text": "The appellant-company is a commercial undertaking. Its real profit has to be ascertained on the principles of commercial accountancy. As a licensee governed by the statute its clear profit is ascertained in terms of the statute. The two profits are for different purposes.",
      "addresses_issue": "i1",
      "key_observation": "Commercial profits for tax; statutory profits for rate regulation."
    },
    {
      "id": "cr4",
      "text": "Where an assessee maintained his accounts on mercantile basis, the accrued liability and the estimated expenditure which it would incur in discharging the same could be deducted from the income of the accounting year in which the said liability accrued.",
      "addresses_issue": "i2",
      "key_observation": "Deductible in year liability arises under mercantile system."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "To arrive at the taxable income of the assessee from the business under s. 10(1) of the Income-tax Act, the said amounts have to be deducted from its total income as they did not form part of the assessee's real profits.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "The liability to return the amounts was incurred by the assessee during the relevant accounting years under mercantile system, hence deductible in assessment years 1953-54 and 1954-55.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Pondicherry Railway Co., Ltd. v. Commissioner of Income-tax, Madras",
      "citation": "1931 L.R. 58 A.C. 239",
      "treatment": "referred",
      "relevance": "Payment out of profits and conditional on profits being earned cannot accurately be described as a payment made to earn profits."
    },
    {
      "case_name": "Gresham Life Assurance Society v. Styles",
      "citation": "1892 A.C. 309",
      "treatment": "followed",
      "relevance": "Profits in natural sense; destination of profits immaterial for tax."
    },
    {
      "case_name": "Indian Radio and Cable Communications Company, Ltd. v. Commissioner of Income-tax, Bombay Presidency",
      "citation": "1937 5 I.T.R. 270",
      "treatment": "explained",
      "relevance": "Modifies Pondicherry; exception for commission on profits."
    },
    {
      "case_name": "Union Cold Storage Co. Ltd. v. Adamson, H.M. Inspector of Taxes",
      "citation": "1931 16 A.C. 328",
      "treatment": "explained",
      "relevance": "Rent abatement deductible in ascertaining profits, not distribution."
    },
    {
      "case_name": "British Sugar Manufacturers, Ltd. v. Harris, Inspector of Taxes",
      "citation": "1939 7 I.T.R. 101",
      "treatment": "followed",
      "relevance": "Profits may be used in different senses; payments to earn profits deductible."
    },
    {
      "case_name": "Raja Bejoy Singh Dudhuria v. Commissioner of Income-tax, Calcutta",
      "citation": "1933 60 I.A. 196",
      "treatment": "followed",
      "relevance": "Tax only on real income, not charges upon income."
    },
    {
      "case_name": "H.M. Kashiparekh & Co. Ltd. v. Commissioner of Income-tax, Bombay North",
      "citation": "1960 39 I.T.R. 706",
      "treatment": "followed",
      "relevance": "Principle of real income; surrender of commission deductible."
    },
    {
      "case_name": "Mersey Docks and Harbour Board v. Lucas",
      "citation": "1883 2 T.C. 25",
      "treatment": "distinguished",
      "relevance": "Surplus to sinking fund from profits, assessable."
    },
    {
      "case_name": "Paddington Burial Board v. Commissioners of Inland Revenue",
      "citation": "1884 2 T.C. 46",
      "treatment": "distinguished",
      "relevance": "Surplus applied for benefit of rate-payers, assessable as profit."
    },
    {
      "case_name": "Young v. Racecourse Betting Control Board",
      "citation": "1959 38 T.C. 452",
      "treatment": "distinguished",
      "relevance": "Voluntary payments not for purpose of trade."
    },
    {
      "case_name": "Calcutta Co. Ltd. v. Commissioner of Income-tax, West Bengal",
      "citation": null,
      "treatment": "followed",
      "relevance": "Accrued liability deductible under mercantile system."
    }
  ],
  "statutes_cited": [
    {
      "name": "Electricity (Supply) Act, 1948",
      "sections": [
        "s. 57(1)",
        "Sixth Schedule Para I, II",
        "Seventh Schedule"
      ],
      "relevance": "Regulates clear profit and reasonable return; excess to be distributed as rebate to consumers."
    },
    {
      "name": "Indian Electricity Act, 1910",
      "sections": [
        "s. 3(1)"
      ],
      "relevance": "Licence required from State Government to supply electric energy."
    },
    {
      "name": "Indian Income-tax Act",
      "sections": [
        "s. 10(1)",
        "s. 10(2)(xv)"
      ],
      "relevance": "Tax on real profits and gains of business; deductions for expenditure wholly and exclusively for business."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "The Supreme Court answered the question referred to the High Court in the affirmative and in favour of the assessee. The order of the High Court is set aside.",
    "relief_granted": "Deductions allowed for Rs. 42,148/- and Rs. 77,138/- in assessment years 1953-54 and 1954-55.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The real profit of a businessman under s. 10(1) of the Income-tax Act cannot obviously include the amounts returned by him by way of rebate to the consumers under statutory compulsion.",
      "speaker": "court",
      "significance": "Core holding on real vs statutory profits."
    },
    {
      "text": "There is a clear-cut distinction between deductions made for ascertaining the profits and distributions made out of profits.",
      "speaker": "court",
      "significance": "Key principle distinguishing the case."
    },
    {
      "text": "Income-tax is a tax on the real income, i.e., the profits arrived at on commercial principles subject to the provisions of the Income-tax Act.",
      "speaker": "court",
      "significance": "Defines taxable income."
    }
  ],
  "_case_id": "1965_28",
  "_label": 1,
  "_text_length": 25766,
  "_extracted_at": "2026-02-10T19:24:57.474379"
}