{
  "metadata": {
    "case_name": "Commissioner of Income-tax v. Cocanada Bank Ltd.",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "Subba Rao, J."
    ],
    "case_number": "Civil Appeals Nos. 55-157 of 1964",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Cocanada Bank Ltd. (assessee) is a private limited company carrying on banking business with head office at Kakinada and branch at Dayal Bagh. Sources of income: banking business and interest from government securities.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "For assessment year 1949-50, income assessed as: Interest on securities Rs. 84,880; Other banking activities Rs. 64,400 loss; Net loss Rs. 55,912.",
      "type": "material",
      "date": "1949-50",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "For assessment years 1950-51: Interest on securities Rs. 5,191, business income Rs. 886, total Rs. 6,077; 1951-52: Interest Rs. 2,174, business Rs. 1,177 loss, total Rs. 3,351; 1952-53: Interest Rs. 1,885, business Rs. 9,121 loss, total Rs. 11,006.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Department allowed business loss set off against income under business head but disallowed against interest on securities for three succeeding years.",
      "type": "procedural",
      "date": null,
      "source": "department"
    },
    {
      "id": "f5",
      "text": "View of Income-tax Officer confirmed by Appellate Assistant Commissioner and Income-tax Appellate Tribunal.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "Tribunal referred question to Andhra Pradesh High Court: Whether assessee entitled to set off business loss of Rs. 55,912 from preceding year against entire income including interest on securities.",
      "type": "procedural",
      "date": null,
      "source": "tribunal"
    },
    {
      "id": "f7",
      "text": "High Court, citing United Commercial Bank Ltd. v. CIT, remitted to Tribunal for fuller statement on whether securities formed part of trading assets in course of banking business and whether dealing with securities was part of business.",
      "type": "procedural",
      "date": "1961-08-08",
      "source": "high_court"
    },
    {
      "id": "f8",
      "text": "Tribunal held receipt of interest from securities was as much assessee's business as other banking activities like receiving deposits and withdrawals.",
      "type": "admitted",
      "date": null,
      "source": "tribunal"
    },
    {
      "id": "f9",
      "text": "High Court, on supplementary statement, answered reference in favour of assessee.",
      "type": "procedural",
      "date": null,
      "source": "high_court"
    },
    {
      "id": "f10",
      "text": "Revenue filed appeals by special leave to Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Tribunal and High Court found securities were assessee's trading assets; assessee invested in easily realisable securities.",
      "type": "disputed",
      "date": null,
      "source": "tribunal"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Construction of s. 24(2) of Indian Income-tax Act, 1922: Whether assessee entitled to set off business loss carried forward from preceding year against income including interest on securities, if securities form part of trading assets of banking business.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Income from business falls under s.10 and from securities under s.8; different heads mutually exclusive; losses under business head cannot be carried forward and set off under s.24(2) against income from securities.",
      "supporting_facts": [
        "f4",
        "f5"
      ],
      "legal_basis": "Sections 8, 10, 24(2) of Indian Income-tax Act, 1922"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Though computed separately, if securities part of trading assets of business, income therefrom is part of business income; business losses can be set off against total business income including from securities.",
      "supporting_facts": [
        "f1",
        "f11"
      ],
      "legal_basis": "Sections 6, 24(2) of Indian Income-tax Act, 1922"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "S.24(1) allows set off across heads in same year; s.24(2) allows carry forward of business loss against profits from same business in subsequent years, omitting 'head' reference; crucial: whether securities part of trading assets and income therefrom business income.",
      "addresses_issue": "i1",
      "key_observation": "S.6 classifies for computation only; interest on securities part of business income if securities trading assets, decided on commercial principles not s.6."
    },
    {
      "id": "cr2",
      "text": "Tribunal/High Court finding that securities trading assets accepted; thus income from securities is business income, attracting s.24(2) set off.",
      "addresses_issue": "i1",
      "key_observation": "Sub-s.(2) concerns business, not heads under s.6; provides relief for business losses even if income falls under different heads."
    },
    {
      "id": "cr3",
      "text": "Distinguished precedents: United Commercial Bank (mutually exclusive for computation, but income still business income); Punjab Cooperative Bank (securities part of bank trading assets); others not contrary.",
      "addresses_issue": "i1",
      "key_observation": "Heads under s.6 do not exhaustively delimit income sources; business income broken up only for computation."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Where securities form part of trading assets of banking business, interest therefrom is income from business despite classification under s.8; business loss under s.24(2) can be set off against such income.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "United Commercial Bank Ltd., Calcutta v. Commissioner of Income-tax, West Bengal",
      "citation": "1958 S.C.R. 79",
      "treatment": "distinguished",
      "relevance": "Heads mutually exclusive for computation; does not mean securities income not business income."
    },
    {
      "case_name": "Punjab Cooperative Bank Ltd. v. Commissioner of Income-tax, Punjab",
      "citation": null,
      "treatment": "followed",
      "relevance": "Securities of bank part of trading assets in ordinary banking business."
    },
    {
      "case_name": "East India Housing and Land Development Trust Ltd. v. Commissioner of Income-tax, West Bengal",
      "citation": "1961 42 I.T.R. 49",
      "treatment": "distinguished",
      "relevance": "Income from property under specific head s.9, but still business income."
    },
    {
      "case_name": "Commissioner of Income-tax, Madras v. Express Newspapers Ltd.",
      "citation": "1964 53 I.T.R. 250",
      "treatment": "distinguished",
      "relevance": "Capital gains not business profits despite connection to business assets."
    },
    {
      "case_name": "Commissioner of Income-tax, Bombay City v. Chugandas Co.",
      "citation": null,
      "treatment": "followed",
      "relevance": "Interest from securities part of business income; s.6 heads for computation only, income remains business income."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act, 1922",
      "sections": [
        "Section 6",
        "Section 8",
        "Section 10",
        "Section 24(1)",
        "Section 24(2)"
      ],
      "relevance": "Classifies income heads for computation (s.6); business loss carry forward and set off against same business profits (s.24(2)), even if under different heads."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court dismissed Revenue's appeals, upholding High Court decision in favour of assessee allowing set off of business loss against income including interest on securities as part of business income.",
    "relief_granted": "Assessee entitled to set off business loss of Rs. 55,912 against entire income including interest on securities.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"Though for the purpose of computation of the income, interest on securities is separately classified, income by way of interest from securities does not cease to be part of the income from business if the securities are part of the trading assets.\"",
      "speaker": "court",
      "significance": "Core holding on nature of income from trading assets despite head classification."
    },
    {
      "text": "\"The crucial words, therefore, are profits and gains of the assessee from the same business, i.e., the business in regard to which he sustained loss in the previous year.\"",
      "speaker": "court",
      "significance": "Interprets scope of s.24(2) set off provision."
    },
    {
      "text": "\"In the ordinary case of a bank, the business consists in its essence of dealing with money and credit... the banker has always to keep enough cash or easily realisable securities.\"",
      "speaker": "court",
      "significance": "Explains why bank securities are trading assets (quoting Punjab Cooperative Bank)."
    }
  ],
  "_case_id": "1965_239",
  "_label": 0,
  "_text_length": 14664,
  "_extracted_at": "2026-02-10T19:27:01.636949"
}