{
  "metadata": {
    "case_name": "Ranganadham Chetty & Ors. v. Seetharamamma & Ors.",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "Bachawat, J."
    ],
    "case_number": "Civil Appeal No. 434 of 1963",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The first respondent, Seetharamamma, is a Brahmin woman married to one Ramakrishnayya, who is still alive.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "During the lifetime of her husband, Seetharamamma became the concubine of Lingayya, a Sudra by caste, from 1938 until Lingayya's death in February 1948, and lived with him permanently, preserving sexual fidelity to him during this period and thereafter.",
      "type": "material",
      "date": "1938-02-1948",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The second, third and fourth respondents are the sons of the first respondent by Lingayya.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The appellants are the brothers and brother's sons of Lingayya, who was separate in estate from them.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Parties are residents of Choragudi, Bapatla, Andhra Pradesh, governed by Mitakshara school of Hindu law.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "In the plaint as originally filed, respondents claimed exclusive entitlement to Lingayya's estate.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Subordinate Judge and High Court found first respondent remained married woman, not lawfully wedded wife of Lingayya, children not legitimate sons or Dasiputras entitled to properties; suit originally dismissed by Subordinate Judge.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "High Court gave respondents leave to amend plaint for maintenance claim and remanded suit.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Subordinate Judge decreed respondents' claim for maintenance and consequential reliefs during their lifetime out of Lingayya's estate on September 20, 1954.",
      "type": "procedural",
      "date": "1954-09-20",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "During pendency of appellants' appeal to High Court, Hindu Adoptions and Maintenance Act, 1956 came into force.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "High Court Full Bench held: Act applies only to estates of Hindus dying after commencement; first respondent is Avaruddha Stree entitled to maintenance despite alive husband and adulterous connection; agreed on quantum.",
      "type": "procedural",
      "date": "1960-07-22",
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the provisions of the Hindu Adoptions and Maintenance Act, 1956 are retrospective and apply to the estate of Lingayya who died before its commencement.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether a married woman who left her husband and lived with another as his permanently kept mistress could be regarded as an Avaruddha Stree entitled to maintenance.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether respondents entitled to maintenance under Hindu law prior to the Act, given not Dasi/Dasiputras, husband alive, adulterous connection, and Pratiloma (Brahmin woman-Sudra man).",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Respondents not entitled to maintenance under pre-Act Hindu law because first respondent not a Dasi, sons not Dasiputras, concluded by previous final High Court judgment.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "Mitakshara, Ch. I, s.12 V. 1,2,3"
    },
    {
      "id": "pa2",
      "text": "Husband of first respondent still alive, connection with Lingayya adulterous during intimacy and birth of children.",
      "supporting_facts": [
        "f1",
        "f2"
      ],
      "legal_basis": "Rahi v. Govind; Narayan Bharthi v. Laving Bharthi; Tukaram Dinnkar"
    },
    {
      "id": "pa3",
      "text": "First respondent Brahmin adulteress, Lingayya Sudra, connection Pratiloma and illegal.",
      "supporting_facts": [
        "f1",
        "f2"
      ],
      "legal_basis": "Smriti-writers; Commentators; Bai Kashi Jamnadas; Ramchandra Doddappa v. Hanamnaik Dodnaik"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Claim maintenance as Avaruddha Stree and illegitimate sons under pre-Act Hindu law.",
      "supporting_facts": [
        "f2",
        "f3"
      ],
      "legal_basis": "Mitakshara, Ch. 2, s.1, Vs. 27,28 read with V.7"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Previous High Court judgment concluded sons not Dasiputras entitled to inheritance, but maintenance claim not concluded; illegitimate sons of Sudra entitled to lifetime maintenance independently of Mitakshara texts, even if mother married, connection adulterous.",
      "addresses_issue": "i3",
      "key_observation": "Illegitimate son of Sudra entitled to maintenance though mother not Dasi, born of adulterous intercourse (citing Muttusawmy, Rahi v. Govind, etc.)."
    },
    {
      "id": "cr2",
      "text": "First respondent qualifies as Avaruddha Stree: continuous exclusive keeping for 10 years till death, sexual fidelity preserved; includes Swairini/adulteress per Vijnaneswara; married woman leaving husband for permanent mistress status entitled (approving Akku Pralhad v. Ganesh Pralhad Full Bench).",
      "addresses_issue": "i2",
      "key_observation": "Concubinage immoral but recognized for maintenance; no disqualification for Brahmin caste or Pratiloma."
    },
    {
      "id": "cr3",
      "text": "Hindu Adoptions and Maintenance Act ss.21,22 prospective; apply to Hindus dying after commencement; s.4 does not affect vested rights to maintenance arising on death before Act under prior law; respects vested rights.",
      "addresses_issue": "i1",
      "key_observation": "Rights vested on Lingayya's death in 1948 not destroyed; distinguishes S. Kameswaramma (only on s.25)."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Respondents entitled to maintenance during lifetime out of Lingayya's estate under Hindu law as in force at his death in 1948, suit institution in 1949, and decree in 1954.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Hindu Adoptions and Maintenance Act, 1956 ss.21,22 not retrospective; do not affect vested maintenance rights from estates of Hindus dying before commencement.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Married woman in permanent exclusive concubinage with fidelity is Avaruddha Stree entitled to maintenance despite adulterous connection and alive husband; no bar for Brahmin-Sudra Pratiloma.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Gur Narain Das v. Gur Tahal Das",
      "citation": "1952 S.C.R. 869, 875",
      "treatment": "followed",
      "relevance": "Dasiputra of Sudra entitled to share in recognition of son status, not merely maintenance."
    },
    {
      "case_name": "Datti Parisi Nayudu v. Datti Bangaru Nayudu",
      "citation": "1869 4 Madras High Court Reports 204",
      "treatment": "followed",
      "relevance": "Illegitimate son from incestuous connection not entitled to inheritance."
    },
    {
      "case_name": "Rahi v. Govind Valad Teja",
      "citation": null,
      "treatment": "followed",
      "relevance": "Illegitimate son from adulterous connection not entitled to inheritance as Dasiputra."
    },
    {
      "case_name": "Narayan Bharthi v. Laving Bharthi",
      "citation": null,
      "treatment": "followed",
      "relevance": "Illegitimate son from adulterous connection not entitled to inheritance."
    },
    {
      "case_name": "Tukaram Dinnkar",
      "citation": "1931 33 B.L.R. 280",
      "treatment": "followed",
      "relevance": "Illegitimate son from adulterous connection not entitled to inheritance."
    },
    {
      "case_name": "Muttusawmy Jagavera Yettappa Naicker v. Vencataswara Yettayya",
      "citation": "1868 12 M.I.A. 203,220",
      "treatment": "followed",
      "relevance": "Illegitimate son of Sudra entitled to maintenance independently, even if mother not Dasi or casual/adulterous."
    },
    {
      "case_name": "Viraramuthi Udayan v. Singaravelu",
      "citation": "1877 I.L.R. 1 Mad.306",
      "treatment": "followed",
      "relevance": "Illegitimate son entitled to maintenance though mother married, adulterous."
    },
    {
      "case_name": "Subramania Mudaly v. Valu",
      "citation": "1911 I.L.R. 34 Mad.68",
      "treatment": "followed",
      "relevance": "Illegitimate son entitled to maintenance though mother married, adulterous."
    },
    {
      "case_name": "Bai Nagubai v. Bai Monghibai",
      "citation": "1926 I.L.R. 50 Bom.604,614 P.C.",
      "treatment": "followed",
      "relevance": "Permanent concubinage with fidelity entitles to maintenance even if not in family house (Mitakshara agrees with Mayukha)."
    },
    {
      "case_name": "Akku Pralhad v. Ganesh Pralhad",
      "citation": "I.L.R. 1945 Bom. 216",
      "treatment": "followed",
      "relevance": "Married woman as permanent mistress with fidelity is Avaruddha Stree entitled to maintenance (Full Bench)."
    },
    {
      "case_name": "Anandilal Bhagchand v. Chandrabai",
      "citation": "I.L.R 48 Bom. 203",
      "treatment": "distinguished",
      "relevance": "Overruled by Akku Pralhad."
    },
    {
      "case_name": "Khemkore v. Umiashankar",
      "citation": "1873 10 Bombay High Court Reports 381",
      "treatment": "followed",
      "relevance": "Supports Akku Pralhad."
    },
    {
      "case_name": "Bingareddi v. Lakshmawa",
      "citation": "1901 I.L.R. 26 Bom. 163",
      "treatment": "followed",
      "relevance": "Supports Akku Pralhad."
    },
    {
      "case_name": "Hargovind Kuari v. Dharam Singh",
      "citation": null,
      "treatment": "followed",
      "relevance": "Brahmin concubine and sons entitled to maintenance."
    },
    {
      "case_name": "Bai Kashi Jamnadas",
      "citation": null,
      "treatment": "referred",
      "relevance": "Pratiloma marriages invalid, but concubine entitled to maintenance."
    },
    {
      "case_name": "Ramchandra Doddappa v. Hanamnaik Dodnaik",
      "citation": null,
      "treatment": "referred",
      "relevance": "Pratiloma marriages invalid pre-1949 Act, but Brahmin concubine of Sudra entitled to maintenance."
    },
    {
      "case_name": "S. Kameswaramma v. SubramanYam",
      "citation": null,
      "treatment": "distinguished",
      "relevance": "s.25 allows alteration of pre-Act maintenance; broad observations on ss.21,22 obiter, do not affect vested rights."
    }
  ],
  "statutes_cited": [
    {
      "name": "Hindu Adoptions and Maintenance Act, 1956",
      "sections": [
        "Section 4",
        "Section 18",
        "Section 19",
        "Section 21",
        "Section 22",
        "Section 25"
      ],
      "relevance": "Amends/codifies adoption/maintenance; ss.21-22 define dependants/heirs' liability prospectively for deaths after commencement; s.4 ceases prior law only for covered matters; does not affect vested pre-Act rights."
    },
    {
      "name": "Hindu Marriage Validity Act, 1949",
      "sections": [],
      "relevance": "Declared Pratiloma marriages invalid."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court upheld High Court and Subordinate Judge decrees awarding respondents maintenance during their lifetime out of Lingayya's estate; Act not retrospective affecting vested rights; no interference with quantum.",
    "relief_granted": "Maintenance during lifetime to first, second, third and fourth respondents out of Lingayya's estate.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"We are satisfied that the respondents were entitled to maintenance during their lives out of the estate of Lingayya under the Hindu law as it stood in 1948, when Lingayya died...\"",
      "speaker": "court",
      "significance": "Core holding on entitlement under pre-Act law."
    },
    {
      "text": "\"ss. 21 and 22 read with s. 4 do not destroy or affect any right of maintenance out of the estate of a deceased Hindu vested on his death before the commencement of the Act...\"",
      "speaker": "court",
      "significance": "Rules Act prospective, preserves vested rights."
    },
    {
      "text": "\"Avaruddha Stree, as understood by Vijnaneswara, includes a Swairini or adulteress kept in concubinage.\"",
      "speaker": "court",
      "significance": "Interprets status including adulterous permanent concubine."
    }
  ],
  "_case_id": "1965_7",
  "_label": 0,
  "_text_length": 18964,
  "_extracted_at": "2026-02-10T19:24:32.508765"
}