{
  "metadata": {
    "case_name": "Commissioner of Income-tax v. M/s. Shri Govind Commercial Co. P. Ltd.",
    "case_year": null,
    "court": "Supreme Court of India",
    "judges": [
      "Sikri, J."
    ],
    "case_number": null,
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "For the assessment year 1958-59, the Income-tax Officer disallowed loss of Rs. 45,676 incurred by the assessee on the ground that this loss was incurred in speculative transaction on a large scale in hessian and gunny bags.",
      "type": "material",
      "date": "1958-59",
      "source": "lower_court"
    },
    {
      "id": "f2",
      "text": "Shri M. L. Sharma admitted that the transactions were of a speculative nature since the deliveries were not taken.",
      "type": "admitted",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "The assessee contended before the Appellate Assistant Commissioner that the admission was only to the effect that delivery of goods was not taken; on merits, assessee received delivery orders according to terms of purchase contracts and made over delivery orders as per sale contracts.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f4",
      "text": "Appellate Assistant Commissioner rejected assessee's contentions, distinguished Duni Chand Rataria v. Bhuwalka Brothers Ltd., and upheld ITO order.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "Appellate Tribunal accepted assessee's contentions, held transactions not speculative as payment made for full value of goods purchased, not settled by payment of differences; 'scrips' in Explanation 2 to section 24(1) refers to scrips pertaining to any commodity, not stocks and shares alone.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "Commissioner of Income-tax filed application under section 66(1) raising two questions; Tribunal rejected application as questions settled by Duni Chand Rataria case.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "Commissioner filed application under section 66(2) before High Court of Rajasthan, which dismissed it observing first question covered by Duni Chand v. Bhuwalka Brothers Ltd., second does not arise.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether, on the facts and in the circumstances of the case, the Tribunal was right in holding that there was actual delivery of the commodity within the meaning of Explanation 2 to section 24(1) of the Indian Income-tax Act, 1922?",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether, on the facts and in the circumstances of the case, the term 'scrips' in Explanation 2 to section 24(1) of the Indian Income-tax Act, 1922, can refer to scrips pertaining to any commodity or to stocks and shares alone?",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The High Court should not have rejected the application under section 66(2) because the questions were arguable questions of law.",
      "supporting_facts": [
        "f6",
        "f7"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "The first question is not concluded by the decision in Duni Chand Rataria v. Bhuwalka Brothers Ltd.; Calcutta High Court in D. M. Wadhwana v. Commissioner of Income-tax distinguished the Supreme Court decision and held that 'actual delivery' does not only mean physical delivery.",
      "supporting_facts": [
        "f2"
      ],
      "legal_basis": "Duni Chand Rataria v. Bhuwalka Brothers Ltd.; D. M. Wadhwana v. Commissioner of Income-tax"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Receiving and making over of delivery orders tantamount to actual delivery or transfer of the commodity or scrips within the meaning of Explanation 2 to section 24(1).",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": "Duni Chand Rataria v. Bhuwalka Brothers Ltd.; Explanation 2 to section 24(1)"
    },
    {
      "id": "ra2",
      "text": "Transactions not speculative as payment made for full value, not settled by differences; 'scrips' refers to any commodity.",
      "supporting_facts": [
        "f3",
        "f5"
      ],
      "legal_basis": "Explanation 2 to section 24(1)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Fairly arguable questions of law arise; need not express opinion on soundness of Tribunal's view or Calcutta High Court's view at this stage.",
      "addresses_issue": "i1",
      "key_observation": "High Court should have directed Tribunal to state the case and refer it."
    },
    {
      "id": "cr2",
      "text": "The first question is covered by principle in Duni Chand v. Bhuwalka Brothers Ltd. per High Court, but arguable per Solicitor-General.",
      "addresses_issue": "i1",
      "key_observation": "Questions are arguable."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Appeal by special leave accepted; Appellate Tribunal directed to state the case and refer it to the High Court.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Duni Chand Rataria v. Bhuwalka Brothers Ltd.",
      "citation": null,
      "treatment": "followed",
      "relevance": "Governs whether receiving/making over delivery orders constitutes actual delivery under Explanation 2 to section 24(1); relied on by assessee, Tribunal, High Court"
    },
    {
      "case_name": "D. M. Wadhwana v. Commissioner of Income-tax",
      "citation": "unreported judgment of Calcutta High Court",
      "treatment": "distinguished",
      "relevance": "Distinguished Supreme Court decision in Duni Chand Rataria case; held 'actual delivery' does not only mean physical delivery"
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act, 1922",
      "sections": [
        "section 24(1) Explanation 2",
        "section 66(1)",
        "section 66(2)"
      ],
      "relevance": "Definition of speculative transactions via actual delivery or transfer of commodity or scrips; reference to High Court procedure"
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "The appeal by special leave against the High Court of Rajasthan's judgment rejecting the application under section 66(2) is accepted. The Appellate Tribunal is directed to state the case and refer it to the High Court.",
    "relief_granted": "Direction to Appellate Tribunal to state the case and refer to High Court",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"We are of the opinion that fairly arguable questions of law arise and the High Court should have directed the Appellate Tribunal to state the case and refer it to the High Court.\"",
      "speaker": "court",
      "significance": "Core holding directing reference despite prior views"
    },
    {
      "text": "\"the transactions could not be regarded as speculative transactions.\"",
      "speaker": "court",
      "significance": "Tribunal's finding on merits, subject to reference"
    }
  ],
  "_case_id": "1965_148",
  "_label": 1,
  "_text_length": 5204,
  "_extracted_at": "2026-02-10T19:26:10.980621"
}