{
  "metadata": {
    "case_name": "Commissioner of Income-tax, U.P. v. Lala Manmohan Das",
    "case_year": null,
    "court": "Supreme Court of India",
    "judges": [
      "Shah, J."
    ],
    "case_number": null,
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Under an agreement dated January 2, 1931, Lala Manmohan Das (assessee) was appointed treasurer of the Allahabad Bank Ltd. in respect of certain branches, sub-agencies and pay offices.",
      "type": "background",
      "date": "1931-01-02",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The assessee was assessed to income-tax as representing his Hindu undivided family, and the income received under the agreement was treated as income of the Hindu undivided family.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "In the previous year corresponding to assessment year 1950-51, the assessee suffered a net loss of Rs. 38,027 in performing duties as treasurer.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "For assessment year 1951-52, profit and loss account showed receipts of Rs. 73,815 against outgoings of Rs. 39,370, including Rs. 20,000 loss from misappropriation by assistant cashier at Patna branch, netting profit of Rs. 34,445.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Income-tax Officer refused to allow set-off of 1950-51 loss against 1951-52 net profit and taxed Rs. 34,445 as remuneration.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Appellate Assistant Commissioner confirmed the Income-tax Officer's order.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Income-tax Appellate Tribunal held remuneration was income from profession or vocation under s. 10 and loss from preceding year liable to be set off.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "At instance of Commissioner of Income-tax, U.P., two questions referred to High Court of Allahabad under s. 66(1).",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "High Court held remuneration taxable under s. 10 and assessee could set off 1950-51 loss against 1951-52 profits.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Appeal to Supreme Court preferred by Commissioner with certificate from High Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "For 1950-51, Income-tax Officer declared loss could not be carried forward under s. 24(2) as not business loss.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether on true interpretation of deed dated 2nd January 1931, income earned as treasurer computed under s. 10 or s. 7 or s. 12 of Income-tax Act.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "If under s. 10, whether assessee could claim set-off of 1950-51 loss against 1951-52 profits despite no appeal against refusal to carry forward under s. 24(2).",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Remuneration received by assessee as servant of bank, taxable under s. 7; no right to set-off loss under s. 24(2). Relied on Shivnandan Sharma v. Punjab National Bank Ltd. and Piyare Lal Adishwar Lal v. Commissioner of Income-tax where similar contracts held treasurers as servants.",
      "supporting_facts": [
        "f1"
      ],
      "legal_basis": "Sections 7, 24(2); Shivnandan Sharma, Piyare Lal cases"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Remuneration from profession or vocation under s. 10; loss set-off allowed under s. 24(2).",
      "supporting_facts": [
        "f1",
        "f3",
        "f4",
        "f7"
      ],
      "legal_basis": "Sections 10, 24(2)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Second question: ITO's declaration in 1950-51 that loss not carry-forwardable under s. 24(3) not binding; ITO for subsequent year determines set-off under s. 24(2).",
      "addresses_issue": "i2",
      "key_observation": "Statutory right to set-off subject to conditions; decision of prior ITO not binding."
    },
    {
      "id": "cr2",
      "text": "Agreement terms show assessee not servant: includes heirs, treasurer appoints/dismisses staff (bank accepts proposals), responsible for staff acts/losses even for mistakes/negligence, liable for bad money etc., no bank control over manner of work, terminable by 3 months notice.",
      "addresses_issue": "i1",
      "key_observation": "No right of control by bank over how work done; contract for service, not of service."
    },
    {
      "id": "cr3",
      "text": "Dharangadhara Chemical Works: Test is right of control over manner of work; greater independence indicates professional services.",
      "addresses_issue": "i1",
      "key_observation": "Treasurer independent, supervises staff across branches, onerous responsibilities without bank supervision."
    },
    {
      "id": "cr4",
      "text": "Distinguished Shivnandan Sharma: There bank had direct control, orders to obey, summary dismissal power.",
      "addresses_issue": "i1",
      "key_observation": "Contracts not substantially similar."
    },
    {
      "id": "cr5",
      "text": "Distinguished Piyare Lal: There bank had control/supervision over treasurer, summary termination power.",
      "addresses_issue": "i1",
      "key_observation": "No such control or summary dismissal here."
    },
    {
      "id": "cr6",
      "text": "Occupation not profession/business but vocation: exercise of skill/judgment in appointments/supervision, guarantee against losses; computed under s. 10, loss carry-forward allowed.",
      "addresses_issue": "i1",
      "key_observation": "Vocation under s. 10."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Remuneration not salary under s. 7 but from vocation under s. 10.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Loss from 1950-51 under s. 10 vocation set-off allowed against 1951-52 profits under s. 24(2).",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Dharangadhra Chemical Works Ltd. v. State of Saurashtra",
      "citation": null,
      "treatment": "followed",
      "relevance": "Test of control to determine employer-employee relationship."
    },
    {
      "case_name": "Shivnandan Sharma v. Punjab National Bank Ltd.",
      "citation": null,
      "treatment": "distinguished",
      "relevance": "Treasurer held servant due to bank control; contracts differ."
    },
    {
      "case_name": "Piyare Lal Adishwar Lal v. Commissioner of Income-tax",
      "citation": null,
      "treatment": "distinguished",
      "relevance": "Treasurer held servant under s. 7 due to bank control and summary dismissal; not applicable here."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act, 1922",
      "sections": [
        "7",
        "10",
        "12",
        "24(1)",
        "24(2)",
        "24(3)",
        "66(1)"
      ],
      "relevance": "Computation of income as salary (s.7) vs. profession/vocation (s.10); set-off/carry-forward of losses (s.24); reference to High Court (s.66)."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal by Commissioner dismissed; High Court correct that income from treasurer activities taxable under s. 10 as vocation and 1950-51 loss set-off allowed against 1951-52 profits under s. 24(2).",
    "relief_granted": "Set-off of loss allowed to assessee.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The test which is uniformly applied in order to determine the relationship is the existence of a right of control in respect of the manner in which the work is to be done.",
      "speaker": "court",
      "significance": "Key test distinguishing contract for service from contract of service."
    },
    {
      "text": "A decision recorded by the Income-tax Officer who computes the loss in the previous year under s. 24(3) that the loss cannot be set off against the income of the subsequent year is not binding on the assessee.",
      "speaker": "court",
      "significance": "Clarifies set-off determination by subsequent year's ITO."
    },
    {
      "text": "The remuneration must therefore be computed under s. 10 of the Income-tax Act and loss of profit suffered in that vocation in any year may be carried forward to the next year.",
      "speaker": "court",
      "significance": "Final holding on head of income and set-off."
    }
  ],
  "_case_id": "1965_214",
  "_label": 0,
  "_text_length": 28506,
  "_extracted_at": "2026-02-10T19:27:03.392601"
}