{
  "metadata": {
    "case_name": "Mohd. Ayub Khan v. Commissioner of Police, Madras",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "Shah J."
    ],
    "case_number": "Civil Appeal No. 250 of 1964",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant Mohd. Ayub Khan petitioned the High Court of Madras for a writ of mandamus restraining the Commissioner of Police, Madras, from taking action pursuant to the order of the Government of Madras, Home Department, No. 83546, dated May 28, 1958 and from interfering with the appellants rights as a citizen of India.",
      "type": "procedural",
      "date": "1958-05-28",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The petition was dismissed by Balakrishna Ayyar, J., and the order was confirmed in appeal by a Division Bench of the High Court.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f3",
      "text": "Appellant claims that he had acquired the status of an Indian citizen on the commencement of the Constitution as a person who had been ordinarily resident in the territory of India for not less than five years immediately preceding that date.",
      "type": "background",
      "date": "1950-01-26",
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "Appellant was served with a notice dated July 17, 1957 informing him that as he had obtained Pakistan Passport No. 071377, dated April 1, 1953 he should leave India within one month from the date of service of the notice, and in default of compliance he would be prosecuted and deported from India under the Foreigners Act, 1946 as amended by the Foreigners Law Amendment Act, 1957.",
      "type": "material",
      "date": "1957-07-17",
      "source": "respondent"
    },
    {
      "id": "f5",
      "text": "On August 19, 1957, the appellant applied to the Collector of Madras for registration as a citizen of India.",
      "type": "procedural",
      "date": "1957-08-19",
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "Appellant applied to the Central Government under S. 9(2) of the Citizenship Act, 1955 to determine the question whether he continued to remain a citizen of India, and prayed that he may be given an opportunity to produce all necessary evidence in support of his claim as regards Indian citizenship.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "Government of India by order, dated May 7, 1958 rejected the application of the appellant under s. 9 of the Citizenship Act without affording him that opportunity.",
      "type": "material",
      "date": "1958-05-07",
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "Appellant urged that s. 9 of the Citizenship Act, 1955 was ultra vires the Parliament and cl. 3 of Sch. III to the Citizenship Rules was also ultra vires the Central Government, and that in any event Rule 30 of the Citizenship Rules contemplated a quasi-judicial inquiry in which an opportunity must be given to the party sought to be affected, to make a representation and to adduce evidence to show that the acquisition of a passport from the High Commissioner for Pakistan was not voluntary.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "In the High Court, Balakrishna Ayyar, J. observed that the appellant had not indicated on what points he intended to lead evidence and what kind of evidence he intended to adduce.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "High Court in appeal held that the appellant had in fact made a declaration on the basis of which the passport was obtained and the allegations made by him did not even imply that he was forced to make a false declaration.",
      "type": "admitted",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "High Court held that s. 9 lays down an objective test and when the individual had brought himself within it, the law determines the legal consequences of the situation, independently of his intent or understanding, and therefore there was no scope for an enquiry of the nature claimed by the appellant.",
      "type": "disputed",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "In this appeal, notice was issued calling upon the Union to produce the orders and proceedings under S. 9(2) of the Citizenship Act relating to the case of the appellant. Pursuant to the direction the relevant proceedings and order have been produced and an affidavit has been filed by the Under Secretary in the Ministry of Home Affairs.",
      "type": "procedural",
      "date": "1964-12-07",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "It is not common ground that in the inquiry contemplated by Rule 30 of the Citizenship Rules, no opportunity was afforded to the appellant to prove his case that he had not obtained the passport voluntarily from the High Commissioner for Pakistan.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Appellant raised plea that he was compelled to obtain the passport from the High Commissioner for Pakistan.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether s. 9 of the Citizenship Act, 1955 was ultra vires the Parliament and cl. 3 of Sch. III to the Citizenship Rules was ultra vires the Central Government.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether Rule 30 of the Citizenship Rules contemplated a quasi-judicial inquiry in which an opportunity must be given to the party to make a representation and adduce evidence to show that the acquisition of a passport from the High Commissioner for Pakistan was not voluntary.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether the Central Government was required to afford opportunity to the appellant to prove that he had not voluntarily obtained the Pakistan passport before terminating his Indian citizenship under s. 9(2).",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "s. 9 of the Citizenship Act, 1955 was ultra vires the Parliament and cl. 3 of Sch. III to the Citizenship Rules was also ultra vires the Central Government.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": "Constitution Articles 5, 9, 10, 11"
    },
    {
      "id": "pa2",
      "text": "Rule 30 of the Citizenship Rules contemplated a quasi-judicial inquiry in which an opportunity must be given to the party sought to be affected, to make a representation and to adduce evidence to show that the acquisition of a passport from the High Commissioner for Pakistan was not voluntary.",
      "supporting_facts": [
        "f6",
        "f7",
        "f13",
        "f14"
      ],
      "legal_basis": "Citizenship Act s.9(2); Citizenship Rules Rule 30, Sch. III"
    },
    {
      "id": "pa3",
      "text": "Certain important aspects of the plea of invalidity were not presented before the Court in Izhar Ahmad Khan's case, so the challenge to the validity of Rule 3 of Sch. III and s. 9 should be reconsidered.",
      "supporting_facts": [],
      "legal_basis": "Izhar Ahmad Khan v. Union of India"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Appellant had not indicated on what points he intended to lead evidence and what kind of evidence he intended to adduce.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Appellant had in fact made a declaration on the basis of which the passport was obtained and the allegations made by him did not even imply that he was forced to make a false declaration.",
      "supporting_facts": [
        "f10"
      ],
      "legal_basis": null
    },
    {
      "id": "ra3",
      "text": "s. 9 lays down an objective test and when the individual had brought himself within it, the law determines the legal consequences of the situation, independently of his intent or understanding, and therefore there was no scope for an enquiry of the nature claimed by the appellant.",
      "supporting_facts": [
        "f4",
        "f11"
      ],
      "legal_basis": "Citizenship Act s.9"
    },
    {
      "id": "ra4",
      "text": "The question whether the passport was voluntarily obtained must be decided by the foreign country's representative, and mere issue of a foreign passport must always be regarded as decisive.",
      "supporting_facts": [],
      "legal_basis": "Citizenship Rules Sch. III cl.3"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "This Court has held in Izhar Ahmad Khan v. Union of India that s. 9 of the Act was validly enacted by the Parliament, and that Rule 3 of Sch. III was competently made by the Central Government. No grounds for re-examination.",
      "addresses_issue": "i1",
      "key_observation": "Prior binding precedent upholds validity of s.9 and Rule 3 Sch.III."
    },
    {
      "id": "cr2",
      "text": "The judgment in Izhar Ahmad Khan was followed in Government of Andhra Pradesh v. Syed Mohd. Khan.",
      "addresses_issue": "i1",
      "key_observation": "Consistent precedent."
    },
    {
      "id": "cr3",
      "text": "Section 9(2) read with Rule 30 contemplates a quasi-judicial enquiry; the citizen must be given due notice and reasonable opportunity to convince the authority that the allegation is not true.",
      "addresses_issue": "i2",
      "key_observation": "Determination postulates quasi-judicial approach."
    },
    {
      "id": "cr4",
      "text": "Cl.3 Sch.III raises conclusive presumption that obtaining foreign passport means voluntary acquisition of foreign citizenship before that date, but if plea raised that passport not voluntarily obtained (e.g., by force, fraud), opportunity must be given to prove it.",
      "addresses_issue": "i3",
      "key_observation": "Presumption rebuttable if non-voluntary acquisition shown."
    },
    {
      "id": "cr5",
      "text": "High Court erred in holding objective test with no inquiry into intent; voluntary acquisition implicit in obtaining passport under free volition.",
      "addresses_issue": "i3",
      "key_observation": "Scheme requires enquiry into voluntariness."
    },
    {
      "id": "cr6",
      "text": "Termination of Indian citizenship does not depend on foreign country's action in issuing passport; determined by Central Government guided by statutory rules.",
      "addresses_issue": "i3",
      "key_observation": "Domestic authority decides per Indian law."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "s.9 Citizenship Act and Rule 3 Sch.III Citizenship Rules are valid.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Central Government must conduct quasi-judicial inquiry under s.9(2) and Rule 30, affording opportunity to citizen to prove non-voluntary acquisition of foreign passport before terminating citizenship.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h3",
      "text": "Order under s.9(2) invalid for lack of opportunity; deportation order unenforceable until proper determination.",
      "resolves_issue": "i3",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Izhar Ahmad Khan v. Union of India",
      "citation": "1962 Supp. 3 S.C.R. 235",
      "treatment": "followed",
      "relevance": "Upholds validity of s.9 Citizenship Act and Rule 3 Sch.III."
    },
    {
      "case_name": "Government of Andhra Pradesh v. Syed Mohd. Khan",
      "citation": "1962 Supp. 3 S.C.R. 288",
      "treatment": "followed",
      "relevance": "Follows Izhar Ahmad Khan on validity of s.9 and Rule 3 Sch.III."
    }
  ],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Article 5",
        "Article 6",
        "Article 7",
        "Article 8",
        "Article 9",
        "Article 10",
        "Article 11"
      ],
      "relevance": "Governs citizenship at commencement; Art.9 excludes voluntary acquisition of foreign citizenship; Art.11 authorizes Parliament to legislate on citizenship."
    },
    {
      "name": "Citizenship Act, 1955",
      "sections": [
        "Section 9",
        "Section 18"
      ],
      "relevance": "Provides for termination of citizenship upon voluntary acquisition of foreign citizenship; s.9(2) sets authority and manner to determine acquisition."
    },
    {
      "name": "Foreigners Act, 1946",
      "sections": [],
      "relevance": "Basis for prosecution and deportation if not Indian citizen."
    },
    {
      "name": "Citizenship Rules, 1956",
      "sections": [
        "Rule 30",
        "Schedule III Clause 1",
        "Schedule III Clause 2",
        "Schedule III Clause 3"
      ],
      "relevance": "Designates Central Government as authority; prescribes rules of evidence including conclusive presumption from foreign passport, rebuttable on voluntariness."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "The appeal is allowed, and it is ordered that the order of deportation passed by the Commissioner of Police, Madras shall not be enforced until the Central Government determines the status of the appellant according to law.",
    "relief_granted": "Deportation order stayed pending proper determination of citizenship by Central Government with opportunity to appellant.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"Determination of the question postulates an approach as in a quasi-judicial enquiry the citizen concerned must be given due notice of the nature of the action which in the view of the authority involves termination of Indian citizenship, and reasonable opportunity must be afforded to the citizen to convince the authority that what is alleged against him is not true.\"",
      "speaker": "court",
      "significance": "Establishes requirement of quasi-judicial procedure under s.9(2)."
    },
    {
      "text": "\"The fact that a citizen of India has obtained on any date a passport from the Government of any other country shall be conclusive proof of his having voluntarily acquired the citizenship of that country before that date.\"",
      "speaker": "court",
      "significance": "Quotes Sch.III cl.3, but court holds rebuttable if non-voluntary."
    },
    {
      "text": "\"We are therefore of the view that the High Court was in error in holding that the decision of the Government of India without giving an opportunity to the appellant to prove his case that he had been compelled by the police to obtain a passport from the High Commissioner for Pakistan will sustain the order of deportation against the appellant.\"",
      "speaker": "court",
      "significance": "Core holding reversing High Court."
    }
  ],
  "_case_id": "1965_103",
  "_label": 1,
  "_text_length": 20528,
  "_extracted_at": "2026-02-10T19:25:41.757211"
}