{
  "metadata": {
    "case_name": "Appellant v. Workmen-respondents",
    "case_year": null,
    "court": "Supreme Court of India",
    "judges": [
      "Wanchoo, J."
    ],
    "case_number": null,
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Dispute between the appellant and its workmen as to bonus for the year 1959. The workmen-respondents claimed six months wages as bonus. The appellant claimed that on a proper working of the Full Bench formula there would be no available surplus to entitle the respondents to any bonus.",
      "type": "background",
      "date": "1959",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "As the dispute could not be settled, the matter was referred by the Government of Bombay to the Industrial Tribunal, Maharashtra, at Bombay.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The tribunal went into the calculations on the basis of the Full Bench formula and came to the conclusion that there was sufficient available surplus to warrant payment of bonus at the rate of 10 per cent. of the basic earnings of each workman for the year 1959.",
      "type": "procedural",
      "date": "1959",
      "source": "lower_court"
    },
    {
      "id": "f4",
      "text": "The tribunal gave an award to the effect that the appellant would pay 10 per cent. of their basic earnings for the year 1959 as bonus to the workmen concerned.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "The appellant obtained special leave from this court and the matter came up before the Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "According to the written agreement between the appellant and the managing director, he is entitled to a salary of Rs. 3,500 per month. The tribunal reduced it to Rs. 2,500 per month.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "The appellant claimed a sum of Rs. 84,000 as further income-tax under section 23A of the Indian Income-tax Act, but no income-tax was in fact levied on the appellant under section 23A.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "The appellant examined an expert, Pathanky, who opined that rehabilitation amount was Rs. 8,28,163 per year, based on rehabilitation of machinery requiring just over rupees thirty-six lakhs within 4 1/2 years.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "The tribunal allowed only rupees one lakh as rehabilitation for the year in dispute, considering the appellant had done nothing throughout its existence to rehabilitate its machinery and an earlier reference where appellant contended for rupees one lakh.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "In an earlier reference, the appellant had contended that there was an agreement with the workmen for rehabilitation claim at rupees one lakh including notional normal depreciation for each year for 1957-1960.",
      "type": "background",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "It is admitted that whether MD remuneration of Rs. 12,000 per year is allowed or not makes no difference to the amount awarded as bonus.",
      "type": "admitted",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f12",
      "text": "If rehabilitation is only allowed at rupees one lakh, the order of the tribunal granting 10 per centum bonus cannot be assailed.",
      "type": "admitted",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the tribunal was justified in reducing the remuneration of the managing director from Rs. 3,500 per month to Rs. 2,500 per month",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether the tribunal was wrong in not allowing a sum of Rs. 84,000 as further income-tax under section 23A of the Indian Income-tax Act",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether the tribunal was wrong in allowing rehabilitation at rupees one lakh only and that a much larger sum was properly allowable as rehabilitation",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The tribunal was not justified in reducing the remuneration of the managing director from Rs. 3,500 per month to Rs. 2,500 per month as it was based on a written agreement binding on the appellant.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": "Crompton Parkinson Works Private Limited v. Its Workmen"
    },
    {
      "id": "pa2",
      "text": "The tribunal was wrong in not allowing Rs. 84,000 as further income-tax under section 23A of the Indian Income-tax Act.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "Section 23A of the Indian Income-tax Act"
    },
    {
      "id": "pa3",
      "text": "The tribunal was wrong in allowing only rupees one lakh as rehabilitation; expert evidence showed Rs. 8,28,163 required.",
      "supporting_facts": [
        "f8",
        "f9"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "It is not necessary to decide the point on managing director's remuneration as it is admitted it makes no difference to the bonus amount; question left open.",
      "addresses_issue": "i1",
      "key_observation": "No difference to bonus award whether Rs. 12,000 allowed or not."
    },
    {
      "id": "cr2",
      "text": "Levy of income-tax under section 23A depends on conditions being fulfilled; in absence, no tax due. Even notionally, cannot allow unless actually levied. No evidence of actual levy.",
      "addresses_issue": "i2",
      "key_observation": "Employer must show actual levy of income-tax under section 23A."
    },
    {
      "id": "cr3",
      "text": "Tribunal found nothing to discredit expert but allowed only one lakh due to appellant's past inaction on rehabilitation and earlier contention for one lakh. Appellant had alternatively asked for one lakh.",
      "addresses_issue": "i3",
      "key_observation": "Cannot say tribunal was wrong in circumstances."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Tribunal right in disallowing claim for income-tax under section 23A as none was actually levied.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Tribunal right in allowing only rupees one lakh as rehabilitation.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Question of reducing remuneration based on agreement left open.",
      "resolves_issue": "i1",
      "in_favor_of": "partial"
    },
    {
      "id": "h4",
      "text": "With rehabilitation at one lakh, 10% bonus award cannot be assailed. Open to re-agitate in 1961 on proper evidence.",
      "resolves_issue": "i3",
      "in_favor_of": "partial"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Crompton Parkinson Works Private Limited v. Its Workmen",
      "citation": null,
      "treatment": "referred",
      "relevance": "Reliance placed on this decision regarding tribunal reducing remuneration based on agreement"
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act",
      "sections": [
        "23A"
      ],
      "relevance": "Deduction for income-tax under s.23A allowable only if actually levied, not notionally"
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal is dismissed as the tribunal's award of 10% bonus on basic earnings for 1959 is upheld, with reasoning on the three points supporting the available surplus calculation.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "an employer if he claims deduction for income-tax under section 23A must shows that in actual fact such income-tax was levied on him for the year in dispute.",
      "speaker": "court",
      "significance": "Key principle for allowing income-tax deduction in bonus calculations"
    },
    {
      "text": "We cannot say that in the circumstances of this case, the tribunal was wrong.",
      "speaker": "court",
      "significance": "Upholds tribunal's discretion on rehabilitation allowance"
    }
  ],
  "_case_id": "1965_274",
  "_label": 0,
  "_text_length": 6826,
  "_extracted_at": "2026-02-10T19:27:45.824887"
}