{
  "metadata": {
    "case_name": "Defendants (Appellants) v. Plaintiffs (Respondents Nos. 1 to 7)",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "Shah J."
    ],
    "case_number": "Civil Appeal No. 771 of 1964",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "On May 5, 1964 the respondents (plaintiffs) instituted in the High Court of Mysore an action in the nature of a passing off action against the appellants (defendants) for a declaration that they are exclusive owners of the trade mark consisting of the letters R.S.F. and No. 806, for a permanent injunction restraining the defendants from passing off their washing soap as the goods of the plaintiffs and for incidental reliefs.",
      "type": "material",
      "date": "1964-05-05",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "By s. 105 of the Trade and Merchandise Marks Act 43 of 1958 a passing off action whether the trade mark is registered or unregistered may be instituted in any court number inferior to a District Court having jurisdiction to try the suit.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On May 5, 1964 the District Court of Mysore, within the territorial limits of which the cause of action was alleged to have arisen, was closed for the summer vacation, and it is common ground that on that day there was no Judge functioning in the District Court who was on duty and competent to exercise the powers of the District Court.",
      "type": "procedural",
      "date": "1964-05-05",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "At the request of the plaintiffs the High Court entertained the plaint and also an application for interim injunction restraining the defendants their agents or servants from using the trade mark R.S.F. on washing soap manufactured by them and from selling washing soap bearing the said offending mark pending disposal of the case.",
      "type": "procedural",
      "date": "1964-05-05",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "By order dated May 29, 1964 the High Court granted the temporary injunction in terms of the prayer in the application.",
      "type": "procedural",
      "date": "1964-05-29",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Appeal by special leave from the judgment and order dated May 29, 1964, of the Mysore High Court in Civil Petition No. 90 of 1964.",
      "type": "procedural",
      "date": "1964-05-29",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Exercise of jurisdiction by the High Court of Mysore is governed by Mysore Act 5 of 1962. The Act is purely a regulatory Act... s. 12 of the Mysore High Court Act 1 of 1884 has been repealed by s. 14 of Mysore Act 5 of 1962.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "The High Court of Mysore is by its constitution primarily a court exercising appellate jurisdiction it is competent to exercise original jurisdiction only in those matters in respect of which by special Acts it has been specifically invested with jurisdiction.",
      "type": "background",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the High Court of Mysore had jurisdiction to entertain the passing off action instituted by the plaintiffs under s. 105 of the Trade and Merchandise Marks Act 43 of 1958 and to grant temporary injunction.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the High Court of Mysore is a 'District Court' for the purposes of s. 105 of the Trade and Merchandise Marks Act by virtue of possessing ordinary original civil jurisdiction.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The High Court had no jurisdiction to entertain the action instituted by the plaintiffs and had no power to make an order issuing a temporary injunction. The action, as framed, could properly be instituted in the District Court.",
      "supporting_facts": [
        "f1",
        "f2",
        "f3"
      ],
      "legal_basis": "s. 105 Trade and Merchandise Marks Act 43 of 1958; s. 2(e) of Act 43 of 1958; s. 2(4) Code of Civil Procedure, 1908; Mysore Act 5 of 1962; Mysore High Court Act 1 of 1884 s.12 (repealed)"
    },
    {
      "id": "pa2",
      "text": "The High Court of Mysore is not invested with ordinary original civil jurisdiction of a District Court.",
      "supporting_facts": [
        "f7",
        "f8"
      ],
      "legal_basis": "Mysore Act 5 of 1962; constitution of Mysore High Court"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "In a State the High Court is at the apex of the hierarchy of civil courts and has all the powers which the subordinate courts may exercise, and it is competent to entertain all actions as a court of original jurisdiction which may lie in any court in the State.",
      "supporting_facts": [],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Reliance on s. 24 Code of Civil Procedure; s. 151 Code of Civil Procedure; summary of judgment in Kaverappa v. Narayanaswamy.",
      "supporting_facts": [],
      "legal_basis": "s. 24(1)(b)(i) CPC; s. 151 CPC"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The expression District Court has by virtue of s. 2(e) of Act 43 of 1958 the meaning assigned to that expression in the Code of Civil Procedure, 1908. Section 2(4) of the Code defines a district as meaning the local limits of the jurisdiction of a principal civil court- called the District Court-and includes the local limits of the ordinary original civil jurisdiction of a High Court. If therefore a High Court is possessed of ordinary original civil jurisdiction, it would, when exercising that jurisdiction be included, for the purpose of Act 43 of 1958, in the expression District Court.",
      "addresses_issue": "i2",
      "key_observation": "High Court of Mysore not possessed of ordinary original civil jurisdiction."
    },
    {
      "id": "cr2",
      "text": "The High Court of Mysore is by its constitution primarily a court exercising appellate jurisdiction it is competent to exercise original jurisdiction only in those matters in respect of which by special Acts it has been specifically invested with jurisdiction. The High Court is competent to exercise original jurisdiction under s. 105 of the Trade and Merchandise Marks Act 43 of 1958 if it is invested with the ordinary original civil jurisdiction of a District Court, and not otherwise.",
      "addresses_issue": "i1",
      "key_observation": "Mysore HC not invested with such jurisdiction."
    },
    {
      "id": "cr3",
      "text": "Jurisdiction of a Court means the extent of the authority of a Court to administer justice prescribed with reference to the subject-matter, pecuniary value and local limits. Barring cases in which jurisdiction is expressly conferred upon it by special statutes... the High Court of Mysore exercises appellate jurisdiction alone.",
      "addresses_issue": "i1",
      "key_observation": "No warrant for exalted claim that HC has all powers of subordinate courts."
    },
    {
      "id": "cr4",
      "text": "s. 24 CPC power to withdraw and try arises only if properly instituted in subordinate court and transferred. s. 151 preserves inherent powers but does not authorise investing itself with jurisdiction not conferred by law.",
      "addresses_issue": "i1",
      "key_observation": "Sections do not confer original jurisdiction."
    },
    {
      "id": "cr5",
      "text": "Disapproval of view in summary of Kaverappa v. Narayanaswamy that HC may confer original jurisdiction on itself in extraordinary situations.",
      "addresses_issue": "i1",
      "key_observation": "Jurisdiction cannot be enlarged by extraordinary situation."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "High Court of Mysore was incompetent to entertain a passing off action under s.105 Trade Marks Act as it lacks ordinary original civil jurisdiction of a District Court.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Jurisdiction cannot be assumed merely due to extraordinary situation like court vacation; must be conferred by constitution or statute.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Kaverappa v. Narayanaswamy",
      "citation": "Mysore Law Journal 1962 at p. 1 (summary of judgment dated June 6, 1962 by Narayana Pai, J.)",
      "treatment": "doubted",
      "relevance": "Reported view that s.24 and s.151 CPC allow HC to confer original jurisdiction in extraordinary situations disapproved."
    }
  ],
  "statutes_cited": [
    {
      "name": "Trade and Merchandise Marks Act 43 of 1958",
      "sections": [
        "s. 105",
        "s. 2(e)"
      ],
      "relevance": "Passing off action to be instituted in court not inferior to District Court; District Court defined with reference to CPC."
    },
    {
      "name": "Code of Civil Procedure, 1908",
      "sections": [
        "s. 2(4)",
        "s. 24(1)(b)(i)",
        "s. 151"
      ],
      "relevance": "Definition of district/District Court; power to withdraw and try from subordinate courts; inherent powers do not confer jurisdiction."
    },
    {
      "name": "Mysore High Court Act 5 of 1962",
      "sections": [
        "s. 14"
      ],
      "relevance": "Regulatory act; repealed s.12 of Mysore Act 1 of 1884 which invested original jurisdiction."
    },
    {
      "name": "Mysore High Court Act 1 of 1884",
      "sections": [
        "s. 12"
      ],
      "relevance": "Repealed; previously authorised investment of ordinary original civil jurisdiction."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "The appeal is allowed. Temporary injunction granted by the High Court is vacated and the plaint is ordered to be returned for presentation to the proper Court.",
    "relief_granted": "Temporary injunction vacated; plaint returned to proper court",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "Jurisdiction of a Court means the extent of the authority of a Court to administer justice prescribed with reference to the subject-matter, pecuniary value and local limits.",
      "speaker": "court",
      "significance": "Defines jurisdiction, rejecting claim of inherent original powers."
    },
    {
      "text": "Power to try and dispose of a proceeding after transfer from a court lawfully seized of it does not involve a power to entertain a proceeding which is not otherwise within the cognizance of the High Court.",
      "speaker": "court",
      "significance": "Clarifies limits of s.24 CPC."
    },
    {
      "text": "By jurisdiction is meant the extent of the power which is conferred upon the Court by its constitution to try a proceeding its exercise cannot be enlarged because what the learned Judge calls an extraordinary situation requires the Court to exercise it.",
      "speaker": "court",
      "significance": "Rejects assumption of jurisdiction due to vacation or extraordinary circumstances."
    }
  ],
  "_case_id": "1965_97",
  "_label": 1,
  "_text_length": 8516,
  "_extracted_at": "2026-02-10T19:25:36.322067"
}