{
  "metadata": {
    "case_name": "Heir of Rani Manraj Koer v. Custodian General Evacuee Property",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "Shah, J"
    ],
    "case_number": "Civil Appeal No. 124 of 1963",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Rani Manraj Koer obtained money decrees in two suits Nos. 9 of 1932 and 42 of 1932 filed by her in the Court of the Subordinate Judge, Lucknow against Nawab Mohammad Ali Khan Qazilbash Zamindar, Aliabad Estate, in Uttar Pradesh.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "From time to time execution applications were filed by the decree holder against the Zamindar, but nothing was recovered.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Rani Manraj Koer died on October 1, 1941 and the appellant was brought on the record as her heir and legal representative.",
      "type": "procedural",
      "date": "1941-10-01",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Nawab Mohammad Ali Khan Qazilbash also died and five persons amongst whom was one Nawab Ali Raza Khan were impleaded as legal representatives in the execution proceedings.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "In January 1950 Nawab Ali Raza Khan Talukdar of Aliabad Estate who was substantially the only judgment debtor from whose estate the amounts due were liable to be recovered migrated to Pakistan and he was declared an evacuee under the provisions of the Administration of Evacuee Property Ordinance 27 of 1949 which was later replaced by the Administration of Evacuee Property Act 31 of 1950.",
      "type": "material",
      "date": "1950-01",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The Custodian of Evacuee Property took possession of the estate of the evacuee.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "The Custodian applied to the Civil Judge, Lucknow for removal of attachment levied on the estate by the Civil Judge, Bahraich in execution of the decrees at the instance of the appellant.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "The Civil Judge, Lucknow, by order dated July 22, 1950 directed that the transfer certificates issued in the two decrees be recalled and the papers be consigned to the record.",
      "type": "procedural",
      "date": "1950-07-22",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Against the order passed by the Civil Judge, Lucknow appeals were preferred by the appellant to the High Court at Allahabad.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "By order dated February 22, 1960 the High Court held that after the Custodian entered upon the management of the properties of the evacuee by virtue of S. 17 of the Administration of Evacuee Property Act, so long as the property remained vested in the Custodian under the provisions of that Act it was not liable to be proceeded against in any manner whatsoever in execution of any decree or order of any court or other authority.",
      "type": "procedural",
      "date": "1960-02-22",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "On September 27, 1960 the appellant applied to the Custodian for an order under s. 10(2)(n) of the Administration of Evacuee Property Act, 1950, directing that his claim for Rs. 1,27,638/2/- under the two decrees in suits Nos. 9 of 1932 and 42 of 1932 be satisfied out of the assets belonging to the estate of Nawab Ali Raza Khan.",
      "type": "procedural",
      "date": "1960-09-27",
      "source": "petitioner"
    },
    {
      "id": "f12",
      "text": "The Assistant Custodian General, Evacuee Property, U.P. Lucknow, exercising the powers of the Custodian rejected the application holding that he had no power to grant relief to the appellant of the nature claimed.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f13",
      "text": "In exercise of his revisional jurisdiction, the Custodian General Evacuee Property, New Delhi, confirmed the order.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f14",
      "text": "The appellant has, with special leave, appealed against that order dated January 22, 1962.",
      "type": "procedural",
      "date": "1962-01-22",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the Custodian is entitled to entertain the claim of the holder of a money decree against the evacuee for satisfaction of his dues out of the assets vested in the Custodian by s. 7 of the Administration of Evacuee Property Act.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The expression 'any other person' in s.10(2)(n) must not be construed ejusdem generis with 'evacuee' or 'any member of his family'; the clause confers power coupled with duty to pay to any person entitled to money out of evacuee estate.",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": "Section 10(2)(n) Administration of Evacuee Property Act, 1950"
    },
    {
      "id": "pa2",
      "text": "Custodian holds property for evacuee and must administer including discharging obligations; s.17 protects from execution but not from paying debts.",
      "supporting_facts": [
        "f5",
        "f6",
        "f10"
      ],
      "legal_basis": "Sections 7, 10, 17 Administration of Evacuee Property Act, 1950"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Custodian has no power to grant relief to satisfy money decree claims; no jurisdiction to entertain such claims.",
      "supporting_facts": [
        "f12",
        "f13"
      ],
      "legal_basis": "Section 10 Administration of Evacuee Property Act, 1950"
    },
    {
      "id": "ra2",
      "text": "Amendment deleting s.10(2)(m) reference to debts and deletion of Rule 22 removed power to pay debts of evacuee.",
      "supporting_facts": [
        "f12"
      ],
      "legal_basis": "Section 10(2)(m) as originally stood, Rule 22, Act 91 of 1956"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Rule of ejusdem generis has no application to s.10(2)(n) as no genus indicated; clause empowers Custodian to pay any entitled person out of evacuee funds for purposes of securing, administering etc. under s.10(1).",
      "addresses_issue": "i1",
      "key_observation": "Powers under s.10(2) illustrate general powers under s.10(1); includes paying creditors."
    },
    {
      "id": "cr2",
      "text": "Vesting under s.7 is for Act's purposes; Custodian not owner but administers for evacuee; s.17 protects from execution but Legislature did not intend to absolve from debts.",
      "addresses_issue": "i1",
      "key_observation": "Administering includes discharging obligations; diverse powers in s.10(2) like carrying business, recovering debts imply paying obligations."
    },
    {
      "id": "cr3",
      "text": "Cl. (j) s.10(2) implies power to satisfy claims determined in proceedings; Custodian must act judicially on genuineness.",
      "addresses_issue": "i1",
      "key_observation": "Decree not decisive; Custodian opines on entitlement."
    },
    {
      "id": "cr4",
      "text": "Amendment to s.10(2)(m) and deletion of Rule 22 do not restrict s.10(2)(n) or general powers under s.10(1); clauses not mutually exclusive.",
      "addresses_issue": "i1",
      "key_observation": "Power to pay debts remains under s.10(2)(n)."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Custodian has power under s.10(2)(n) and s.10(1) to entertain and satisfy genuine creditor claims against evacuee out of vested funds if in opinion entitled, acting judicially.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Administration of Evacuee Property Act, 1950",
      "sections": [
        "Section 7",
        "Section 8",
        "Section 10",
        "Section 17",
        "Section 56"
      ],
      "relevance": "Vesting of property, powers/duties of Custodian to administer including paying entitled persons, protection from execution proceedings."
    },
    {
      "name": "Administration of Evacuee Property Ordinance, 1949",
      "sections": [],
      "relevance": "Declared evacuee under this, replaced by 1950 Act."
    },
    {
      "name": "Administration of Evacuee Property Amendment Act, 1951 (Act 22 of 1951)",
      "sections": [
        "Section 17(1)"
      ],
      "relevance": "Amended s.17 with retrospective operation prohibiting proceedings against vested property."
    },
    {
      "name": "Administration of Evacuee Property Amendment Act, 1956 (Act 91 of 1956)",
      "sections": [
        "Section 10(2)(m)"
      ],
      "relevance": "Deleted words authorizing payment of debts/employee amounts."
    }
  ],
  "outcome": {
    "disposition": "remanded",
    "summary": "Appeal allowed; orders of Custodian and Custodian General set aside; matter remanded to Custodian to determine on merits whether appellant entitled to payment out of evacuee funds for administration/management purposes.",
    "relief_granted": "Remand for decision on merits of claim under s.10(2)(n)",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The clause is intended to confer upon the Custodian power coupled with a duty to pay to the evacuee or to any member of his family or to any other person who in the opinion of the Custodian is entitled to any sum of money out of the estate of the evacuee.",
      "speaker": "court",
      "significance": "Interprets scope of s.10(2)(n)"
    },
    {
      "text": "By the vesting for purposes of the Act the Custodian does not become the owner of the property he holds it for the evacuee and is bound to administer it in the manner provided by the Act.",
      "speaker": "court",
      "significance": "Clarifies nature of Custodian's role"
    },
    {
      "text": "In our judgment, the power to administer is not merely a power to manage on behalf of the evacuee so as to authorise the Custodian merely to recover and collect the assets of the evacuee, but to discharge his obligations as well.",
      "speaker": "court",
      "significance": "Core holding on Custodian's powers"
    }
  ],
  "_case_id": "1965_244",
  "_label": 1,
  "_text_length": 18037,
  "_extracted_at": "2026-02-10T19:27:41.412732"
}