{
  "metadata": {
    "case_name": "Landlord (Appellant) v. Respondent",
    "case_year": 1965,
    "court": "Supreme Court of India",
    "judges": [
      "Mudholkar, J."
    ],
    "case_number": "Civil Appeal No. 480 of 1965",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Kanda Devan was a cultivating tenant of the land and died some time before the proceedings before the Sub-Collector commenced.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Kanda Devan left behind as his heirs his widow Palaniachi Ammal and his daughter Ramalakshmi Ammal.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The respondent is the daughter's husband and holds a power of attorney both from her and Palaniachi Ammal.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "There was default in payment of rent.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The respondent made an application in the year 1962 before the Sub-Collector under s. 33A of the Madras Cultivating Tenants Protection Act, 1955 for depositing the rental arrears.",
      "type": "procedural",
      "date": "1962",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The appellant who is the landlord contested the application on the ground that neither the wife nor the daughter of the deceased Kanda Devan was a cultivating tenant as defined in the Act because they were not personally cultivating the land.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "The Sub-Collector over-ruled the objection and directed the respondent to deposit the rental arrears.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "The Madras High Court dismissed the appellant's revision petition under s. 115 of the Code of Civil Procedure dated September 4, 1964.",
      "type": "procedural",
      "date": "1964-09-04",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "It is not disputed that Palaniachi Ammal and Ramalakshmi Ammal are the heirs of Kanda Devan, who, being a tenant, was entitled to the protection of the Act.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "After the death of Kanda Devan the land is being cultivated on behalf of these two women and that they are not personally cultivating them, in the sense that they are not contributing physical labour for its cultivation.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "There is no finding by the Sub-Collector as to the nature of work, if any, which the respondent is doing in connection with the supervision of the land in question.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "The Madras Cultivating Tenants Protection Act, 1955 was originally to remain in force for a period of three years but is still in force by virtue of amending acts extending its duration.",
      "type": "background",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the heirs of Kanda Devan qualify as cultivating tenants under the Madras Cultivating Tenants Protection Act, 1955, given that they are not personally contributing physical labour to the cultivation of the land.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the respondent, as son-in-law and power of attorney holder, can be regarded as a member of the heirs' family contributing physical labour for the purpose of the definition of 'carry on personal cultivation' under clause (ee) of s. 2.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Neither the wife nor the daughter of the deceased Kanda Devan was a cultivating tenant as defined in the Act because they were not personally cultivating the land and therefore not entitled to the protection afforded by the Act.",
      "supporting_facts": [
        "f6",
        "f10"
      ],
      "legal_basis": "s. 2(a) and clause (ee) of s. 2 of the Madras Cultivating Tenants Protection Act, 1955"
    },
    {
      "id": "pa2",
      "text": "Even if the respondent is a member of the family, he is not contributing any physical labour but is only doing some kind of supervision, which is not tantamount to physical labour.",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": "Abubucker Lebbai v. Zamindar of Ettayapuram"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "It is not necessary for a tenant to contribute physical labour before he can be held entitled to the benefit of the provision.",
      "supporting_facts": [
        "f10"
      ],
      "legal_basis": "Kunchitapatham Pillai v. Ranganatham Pillai"
    },
    {
      "id": "ra2",
      "text": "Though the heirs are not themselves exerting physical labour, the respondent who is the holder of a power of attorney from them is doing so and therefore the heirs must be regarded as cultivating tenants; a son-in-law can be regarded as a member of the family.",
      "supporting_facts": [
        "f3",
        "f10"
      ],
      "legal_basis": "clause (ee) of s. 2; Webster's New World Dictionary definition of family"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Cultivating tenant defined in s. 2(a) includes heirs who continue in possession, but must carry on personal cultivation by contributing own physical labour or that of family members per clause (ee).",
      "addresses_issue": "i1",
      "key_observation": "Heirs are not personally contributing physical labour."
    },
    {
      "id": "cr2",
      "text": "In the absence of a finding by the Sub-Collector as to whether the respondent was putting in physical labour or merely supervising, and no relevant material or evidence on record, the matter requires remand.",
      "addresses_issue": "i2",
      "key_observation": "Supervision does not amount to physical labour per precedents."
    },
    {
      "id": "cr3",
      "text": "Agreed with Rajamannar C.J. in Abubucker Lebbai case that physical labour is required and supervision does not qualify; distinguished Kunchitapatham Pillai as too wide.",
      "addresses_issue": "i1",
      "key_observation": "View requiring physical labour is correct."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Heirs of a cultivating tenant are entitled to protection only if they or family members contribute physical labour to cultivation; supervision does not suffice.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Matter remitted to Sub-Collector to decide if respondent contributed physical labour, allowing parties opportunity for pleadings and evidence if necessary.",
      "resolves_issue": "i2",
      "in_favor_of": "partial"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Kunchitapatham Pillai v. Ranganatham Pillai",
      "citation": "1958 1 M.L.J. 272",
      "treatment": "distinguished",
      "relevance": "Held not necessary to put muscular effort, but view held too wide."
    },
    {
      "case_name": "W. P. No. 426 of 1953 (unreported)",
      "citation": null,
      "treatment": "followed",
      "relevance": "Rajagopala Ayyangar J. observed physical labour required by self or family; supervision not physical labour."
    },
    {
      "case_name": "Abubucker Lebbai v. Zamindar of Ettayapuram",
      "citation": "1961 1 M.L.J. 256",
      "treatment": "followed",
      "relevance": "Rajamannar C.J. agreed physical labour required; supervision not tantamount to it."
    }
  ],
  "statutes_cited": [
    {
      "name": "Madras Cultivating Tenants Protection Act, 1955",
      "sections": [
        "s. 2(a)",
        "s. 2(ee)",
        "s. 33A"
      ],
      "relevance": "Defines cultivating tenant and personal cultivation; basis for deposit of arrears and protection."
    },
    {
      "name": "Madras Act 14 of 1956",
      "sections": [
        "cl. (ee) added to s. 2"
      ],
      "relevance": "Amends definition of carry on personal cultivation."
    },
    {
      "name": "Code of Civil Procedure",
      "sections": [
        "s. 115"
      ],
      "relevance": "Basis for High Court revision petition."
    }
  ],
  "outcome": {
    "disposition": "remanded",
    "summary": "The Supreme Court set aside the orders of the Sub-Collector and Madras High Court and remitted the matter to the Sub-Collector to determine if the respondent was putting in physical labour in the cultivation, directing opportunity for pleadings and evidence if needed.",
    "relief_granted": "Remand to Sub-Collector for fresh findings",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"a person is said to carry on personal cultivation on a land when he contributes his own physical labour or that of the members of his family in the cultivation of that land\"",
      "speaker": "court",
      "significance": "Definition under cl. (ee) central to determining eligibility as cultivating tenant."
    },
    {
      "text": "\"the work of supervision could be characterised as physical labour within the meaning of the definition clause.\"",
      "speaker": "court",
      "significance": "Rejects supervision as qualifying as physical labour, per cited precedent."
    },
    {
      "text": "\"In the absence of such a finding and in the absence of any relevant material before us we cannot deal with this argument.\"",
      "speaker": "court",
      "significance": "Justifies remand due to lack of factual determination on respondent's labour."
    }
  ],
  "_case_id": "1965_371",
  "_label": 1,
  "_text_length": 7430,
  "_extracted_at": "2026-02-10T19:28:51.048472"
}