{
  "metadata": {
    "case_name": "Ram Prasad v. State of Punjab",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "Satyanarayana Raju, J."
    ],
    "case_number": "Civil Appeal No. 530 of 1964",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Ram Prasad originally entered service as a Clerk, in the year 1924, in the Patiala Saddar Treasury in what was then the Patiala State.",
      "type": "background",
      "date": "1924",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "He was subsequently transferred in the same capacity to the Patiala State Bank on February 27, 1934 Bk and was confirmed in his appointment.",
      "type": "background",
      "date": "1934-02-27",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On September 1, 1935 Bk he was promoted to the next higher grade on the establishment of the Patiala State Bank.",
      "type": "background",
      "date": "1935-09-01",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Thereafter, he was promoted as Manager and posted to the Bhatinda branch of the Bank on April 1, 1944.",
      "type": "background",
      "date": "1944-04-01",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "On April 1, 1949 he was promoted as Selection Grade Manager by the Board of Directors of the Bank in the grade of Rs. 340-20-500-525-700.",
      "type": "background",
      "date": "1949-04-01",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "On September 23, 1953 he was compulsorily retired from service but was subsequently reinstated by the Government on June 10, 1954 since the order was legally defective.",
      "type": "procedural",
      "date": "1953-09-23",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "On June 11, 1958 the Board passed an order compulsorily retiring him from service.",
      "type": "material",
      "date": "1958-06-11",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Ram Prasad challenged the order of compulsory retirement passed by the Board on various grounds, by means of a suit instituted in the Court of the Subordinate Judge, Patiala.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "The Subordinate Judge, Patiala, framed appropriate issues. He found all but two issues in favour of the appellant and granted a decree substantially allowing the claims made by him.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "The respondent thereupon filed an appeal in the High Court of Punjab which allowed the appeal and set aside the judgment of the Subordinate Judge.",
      "type": "procedural",
      "date": "1962-12-19",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "During the pendency of the appeal in the High Court Ram Prasad died and his widow was brought on record as his legal representative.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "The Patiala State Regulations were first promulgated in the year 1908 and governed the employees of the State in matters relating to pay, allowances, leave, pension and travelling allowances.",
      "type": "background",
      "date": "1908",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "The Regulations were revised and re-published in the year 1931.",
      "type": "background",
      "date": "1931",
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Subsequently, they were again revised and re-issued as the Patiala Services Regulations in the year 1947.",
      "type": "background",
      "date": "1947",
      "source": "court"
    },
    {
      "id": "f15",
      "text": "In April 1941 these Regulations were made applicable expressly to the Bank staff of the Patiala State Bank by the Maharaja, with the exception of the rules relating to pension.",
      "type": "background",
      "date": "1941-04",
      "source": "court"
    },
    {
      "id": "f16",
      "text": "On August 20, 1948, Patiala became a constituent unit of the Patiala and East Punjab States Union (PEPSU).",
      "type": "background",
      "date": "1948-08-20",
      "source": "court"
    },
    {
      "id": "f17",
      "text": "On the formation of the Union, the Patiala Services Regulations were made applicable to the entire territories of the Union by Ordinance No. 1 of 1948 Bk.",
      "type": "background",
      "date": "1948",
      "source": "court"
    },
    {
      "id": "f18",
      "text": "On March 4, 1953, the President of India assumed the powers of the Government of PEPSU, in exercise of the powers conferred on him by art. 356 of the Constitution.",
      "type": "background",
      "date": "1953-03-04",
      "source": "court"
    },
    {
      "id": "f19",
      "text": "On February 27, 1954, the President, in exercise of the powers vested in him in relation to PEPSU by the Proclamation, issued the Bank of Patiala Regulation and Management Order, 1954.",
      "type": "background",
      "date": "1954-02-27",
      "source": "court"
    },
    {
      "id": "f20",
      "text": "The Regulation Order was published in the Gazette only on March 14, 1954.",
      "type": "background",
      "date": "1954-03-14",
      "source": "court"
    },
    {
      "id": "f21",
      "text": "By notification dated March 21, 1954, in exercise of the powers conferred by cl. (2) of art. 356 of the Constitution, the President revoked the Proclamation issued by him under the said article on March 4, 1953.",
      "type": "background",
      "date": "1954-03-21",
      "source": "court"
    },
    {
      "id": "f22",
      "text": "By virtue of the powers conferred upon it by cl. 4(1)(iii) of the Regulation Order, the Board of Directors of the Bank framed the Staff Rules on March 25, 1954, to be enforced from April 1, 1954.",
      "type": "background",
      "date": "1954-03-25",
      "source": "court"
    },
    {
      "id": "f23",
      "text": "Rule 27 of these rules: 'An employee shall retire at fifty five years of age provided that the Bank may, at its discretion and without giving any reasons, retire any employee from the Banks service after he has completed the age of fifty years or the service of twenty five years whichever happens first and no claim to special compensation on this account will be entertained the Bank retains the absolute right to retire any employee after he has completed 10 years of service without giving any reasons and no claim to special compensation on this account will be entertained. This right will not be exercised except when it is in the interest of the Bank to dispense with the further services of an employee such as on account of inefficiency, dishonesty, corruption or infamous conduct.'",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f24",
      "text": "The delegation in favour of the Board lapsed on March 7, 1954 with the termination of the Presidents rule in PEPSU.",
      "type": "disputed",
      "date": "1954-03-07",
      "source": "petitioner"
    },
    {
      "id": "f25",
      "text": "Exhibit P-8 dated July 19, 1940, order by Maharaja making Patiala State Regulations applicable to Bank staff with exceptions.",
      "type": "background",
      "date": "1940-07-19",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the Staff Rules, particularly Rule 27 providing for compulsory retirement, framed by the Board of Directors under the Bank of Patiala Regulation and Management Order, 1954, are valid.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the delegation of power to the Board under cl. 4(1)(iii) of the Regulation Order lapsed upon revocation of President's Proclamation under Art. 356 on March 21, 1954.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether Rule 27 amounts to dismissal or removal from service within the meaning of Art. 311 of the Constitution.",
      "framed_by": "petitioner"
    },
    {
      "id": "i4",
      "text": "Whether the Staff Rules violate Art. 14 by discriminating between public servants.",
      "framed_by": "petitioner"
    },
    {
      "id": "i5",
      "text": "Whether the Board was properly constituted to frame the Staff Rules.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The delegation in favour of the Board lapsed on March 7, 1954 with the termination of the Presidents rule in PEPSU. Thereafter, the Board had no authority or power or jurisdiction to approve of the Staff rules on March 25, 1954 and to enforce them from April 1, 1954.",
      "supporting_facts": [
        "f19",
        "f20",
        "f21",
        "f22",
        "f24"
      ],
      "legal_basis": "Art. 356 and 357"
    },
    {
      "id": "pa2",
      "text": "The Board, assuming the delegation in its favour to be valid, was not vested with the power to make rules regarding compulsory retirement of the servants of the Bank.",
      "supporting_facts": [
        "f22"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "The Staff rules seek to supersede the provisions of Regulation IX of the Patiala State Regulations. Rules made by the Board cannot abrogate the Regulations promulgated by the Ruler who exercised the powers of the legislature.",
      "supporting_facts": [
        "f14",
        "f15"
      ],
      "legal_basis": "Patiala Services Regulations"
    },
    {
      "id": "pa4",
      "text": "The Board which promulgated the Staff Rules had not been properly constituted inasmuch as all the Directors were not present at the meeting.",
      "supporting_facts": [
        "f22"
      ],
      "legal_basis": "cl. 3 of Regulation Order"
    },
    {
      "id": "pa5",
      "text": "The order of compulsory retirement amounted to dismissal or removal from service within the meaning of Art. 311 of the Constitution.",
      "supporting_facts": [
        "f7",
        "f23"
      ],
      "legal_basis": "Art. 311"
    },
    {
      "id": "pa6",
      "text": "Rule 27 violates Art. 14 as different rules govern different public servants in the same State.",
      "supporting_facts": [
        "f23"
      ],
      "legal_basis": "Art. 14"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The Staff Rules were validly made by the Board under legally and constitutionally valid rules governing the employees of the Bank.",
      "supporting_facts": [
        "f19",
        "f22",
        "f23"
      ],
      "legal_basis": "Bank of Patiala Regulation and Management Order, 1954"
    },
    {
      "id": "ra2",
      "text": "The Regulation Order came into force on February 27, 1954, before revocation, and its provisions continue under Art. 357(2).",
      "supporting_facts": [
        "f19",
        "f20",
        "f21"
      ],
      "legal_basis": "Art. 357(2)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The Regulation Order, though made on February 27, 1954, was published later, but cl. 1(b) provides it shall come into force at once, so effective from February 27, 1954, before revocation.",
      "addresses_issue": "i2",
      "key_observation": "Order came into operation on date made."
    },
    {
      "id": "cr2",
      "text": "The Regulation Order provisions, read as integrated whole, are 'things done' under Art. 357(2) and continue beyond one year post-Proclamation.",
      "addresses_issue": "i2",
      "key_observation": "Liberal construction of 'things done'; provisions for ongoing Bank management cannot lapse absurdly."
    },
    {
      "id": "cr3",
      "text": "cl. 4(1)(iii) power to frame rules on service conditions is 'things done' and continues; no lapse of delegation.",
      "addresses_issue": "i2",
      "key_observation": "Intention to preserve rules to avoid hiatus in Bank administration."
    },
    {
      "id": "cr4",
      "text": "Patiala Services Regulations extended to Bank staff by executive act of Maharaja in 1941 (Ex. P-8), which could be changed by similar executive act; not abrogating original rules.",
      "addresses_issue": "i3",
      "key_observation": "Extension was executive, superseding only the extension."
    },
    {
      "id": "cr5",
      "text": "Regulations themselves preserved Maharaja's right to change rules.",
      "addresses_issue": "i3",
      "key_observation": "Rules contained provision for modification by Ijlas-i-Khas."
    },
    {
      "id": "cr6",
      "text": "Compulsory retirement under Rule 27 does not amount to removal under Art. 311(2) as it is another mode of retirement after minimum service/age, per precedents; Rule prescribes minima.",
      "addresses_issue": "i3",
      "key_observation": "Distinguishes cases where no minimum prescribed."
    },
    {
      "id": "cr7",
      "text": "No violation of Art. 14; differentiation sustainable post-States Reorganisation Act on historical/geographical grounds.",
      "addresses_issue": "i4",
      "key_observation": "Per Lachhman Dass v. State of Punjab."
    },
    {
      "id": "cr8",
      "text": "Board properly constituted; majority of members can act for corporation.",
      "addresses_issue": "i5",
      "key_observation": "Law on corporations applies."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Regulation Order valid and continues under Art. 357(2); delegation to Board did not lapse.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Staff Rules, including Rule 27, valid; do not violate Art. 311 or Art. 14.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Compulsory retirement under Rule 27 is not dismissal/removal under Art. 311.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Moti Ram Deka v. N.E. Frontier Railway",
      "citation": "(1964) 5 SCR 683",
      "treatment": "referred",
      "relevance": "Reviewed law on compulsory retirement and Art. 311"
    },
    {
      "case_name": "State of Bombay v. Saubhag Chand M. Doshi",
      "citation": "1958 SCR 571; AIR 1957 SC 892",
      "treatment": "followed",
      "relevance": "Compulsory retirement not removal if after minimum service/age"
    },
    {
      "case_name": "Foster v. Pritchard",
      "citation": "1857 26 LJ Ex 215",
      "treatment": "referred",
      "relevance": "Liberal interpretation of 'things done' in savings clauses"
    },
    {
      "case_name": "Lachhman Dass v. State of Punjab",
      "citation": "(1963) 2 SCR 353; AIR 1963 SC 222",
      "treatment": "followed",
      "relevance": "Different rules in same State valid post-reorganisation on historical grounds; no Art. 14 violation"
    }
  ],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 311",
        "Art. 356",
        "Art. 357",
        "Art. 309",
        "Art. 14"
      ],
      "relevance": "Art. 311 on dismissal/removal; Art. 356/357 on President's rule and continuation of acts; Art. 14 equality; Art. 309 service rules"
    },
    {
      "name": "Bank of Patiala Regulation and Management Order, 1954",
      "sections": [
        "cl. 4(1)(iii)",
        "cl. 1(b)",
        "cl. 3"
      ],
      "relevance": "Empowered Board to frame Staff Rules on service conditions"
    },
    {
      "name": "Patiala Services Regulations",
      "sections": [
        "Regulation IX",
        "Rule 1.7"
      ],
      "relevance": "Governed service; extendable and modifiable by executive"
    },
    {
      "name": "Bank of Patiala Staff Rules, 1954",
      "sections": [
        "Rule 27"
      ],
      "relevance": "Provision for compulsory retirement upheld as valid"
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal is dismissed, upholding the Punjab High Court's decision setting aside the Subordinate Judge's decree in favour of the appellant. Staff Rules held valid.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "'The expression things done occurring in art. 357(2), in our opinion, must receive a liberal and extensive construction.'",
      "speaker": "court",
      "significance": "Key to upholding continuation of Regulation Order post-Proclamation"
    },
    {
      "text": "An employee shall retire at fifty five years of age provided that the Bank may, at its discretion... retire any employee... after he has completed the age of fifty years or... twenty five years...",
      "speaker": "court",
      "significance": "Text of Rule 27, central to validity challenge"
    },
    {
      "text": "Compulsory retirement does not amount to removal under art. 311(2) because it was another mode of retirement and it could be enforced only between the period of age of superannuation prescribed and after the minimum period of service indicated.",
      "speaker": "court",
      "significance": "Distinguishes from dismissal; upholds Rule 27"
    }
  ],
  "_case_id": "1966_195",
  "_label": 0,
  "_text_length": 30029,
  "_extracted_at": "2026-02-10T19:41:08.218045"
}