{
  "metadata": {
    "case_name": "Appellants (Jahuri Sah & Ors.) v. Respondents (Sons and Widows of Gajanand & Jurimal)",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "Mudholkar, J."
    ],
    "case_number": "Civil Appeal No. 193 of 1964",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Property in dispute situate within Bhagalpur municipality purchased jointly by Juri Mal, Gajanand, Ramsahai Sah, Jahuri Sah and Ramgali Sah on June 26, 1942. Juri Mal and Gajanand were father-son members of joint Hindu family (plaintiffs 1-6 represent them). Ramsahai, Jahuri Sah (defendant No.1, karta) and Ramgali Sah (defendant No.2) were brothers members of joint Hindu family (defendants represent them). Each family had half interest.",
      "type": "background",
      "date": "1942-06-26",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Plaintiffs: 1 to 4 sons of Gajanand, plaintiff 5 widow of Jurimal, plaintiff 6 widow of Gajanand. Gajanand had another son Shankarlal given in adoption to Sreelal (not joined as party).",
      "type": "admitted",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "At purchase, property in possession of tenant Mohanlal Marwari, evicted by court decree, then let to Government at Rs. 100 per mensem. Government vacated after some time.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Defendants occupied the house except portion occupied by tenants Isri Sah and Shib Charan Sah paying Rs. 30 monthly rent, half realised by each family.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Plaintiffs allege defendants agreed to pay Rs. 200 per mensem as compensation for plaintiffs' half share upon entering possession, but did not pay.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "Plaintiffs instituted suit for partition and separate possession of half share, compensation from May 2, 1947 to September 11, 1951 at Rs. 200 p.m. with interest, and from suit date till recovery of possession.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "Defendants denied agreement or claimed Rs. 50 p.m., pleaded suit barred by Bihar Buildings Lease, Rent and Eviction Control Act, 1947, estoppel, time-bar for prior 3 years.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "Trial court dismissed suit holding Act applies, no eviction or compensation, adoption not proved, non-joinder of Shankarlal.",
      "type": "procedural",
      "date": "1960-05-13",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Patna High Court reversed: Act inapplicable, adoption admitted (not specifically denied), suit maintainable, contract for Rs. 200 p.m. proved and enforceable, decreed partition, arrears limited to 3 years prior to suit with 6% interest.",
      "type": "procedural",
      "date": "1960-05-13",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "High Court allowed plaintiffs' application u/s 151 r/w O. XX r.18 CPC for mesne profits from suit date till possession or 3 years from decree, with costs.",
      "type": "procedural",
      "date": "1962-02-15",
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether suit for partition and separate possession maintainable due to non-joinder of Shankarlal and applicability of Bihar Buildings Lease, Rent and Eviction Control Act, 1947.",
      "framed_by": "respondent"
    },
    {
      "id": "i2",
      "text": "Whether contract for payment of compensation at Rs. 200 p.m. enforceable absent ouster of co-owners.",
      "framed_by": "respondent"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Agreement existed for Rs. 200 p.m. compensation for their half share; defendants entered possession and failed to pay.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Shankarlal given in adoption to Sreelal, not a co-owner; fact stated in plaint para 1.",
      "supporting_facts": [
        "f2"
      ],
      "legal_basis": "O. VIII r.5 CPC"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Suit not maintainable: non-joinder of Shankarlal as co-owner; barred by Bihar Act as landlord-tenant relationship.",
      "supporting_facts": [
        "f2",
        "f4"
      ],
      "legal_basis": "Bihar Act 3 of 1947 s.11(2)"
    },
    {
      "id": "ra2",
      "text": "Contract not enforceable without ouster; agreed amount was Rs. 50 p.m.; time-barred for prior period; estoppel.",
      "supporting_facts": [
        "f4",
        "f7"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "High Court right: Act inapplicable as parties are co-owners/tenants-in-common, no landlord-tenant relationship created by occupation or agreement to pay compensation.",
      "addresses_issue": "i1",
      "key_observation": "Each tenant-in-common entitled to possession of whole property; defendants' occupation of entire property does not make them tenants of plaintiffs."
    },
    {
      "id": "cr2",
      "text": "Adoption of Shankarlal admitted: not specifically denied in written statement (O.VIII r.5 CPC), no issue raised, prima facie proved by Sreelal's testimony; deed not essential, oral evidence admissible.",
      "addresses_issue": "i1",
      "key_observation": "Saying 'no knowledge' not denial; suit maintainable."
    },
    {
      "id": "cr3",
      "text": "Contract enforceable: co-owners competent to agree on compensation for enjoyment of undivided property; no principle requires ouster as sine qua non for compensation claim.",
      "addresses_issue": "i2",
      "key_observation": "Liability not only on ouster; parties free to arrange terms."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Bihar Buildings Lease, Rent and Eviction Control Act, 1947 inapplicable to co-owners in possession as tenants-in-common.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Non-joinder of adopted son not fatal as adoption admitted under O.VIII r.5 CPC.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h3",
      "text": "Agreement to pay compensation between co-owners enforceable without ouster.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Bihar Buildings (Lease, Rent and Eviction) Control Act, 1947",
      "sections": [
        "s. 11(2)"
      ],
      "relevance": "Provisions oust civil court jurisdiction for landlord-tenant eviction/rent claims; held inapplicable to co-owners"
    },
    {
      "name": "Code of Civil Procedure, 1908",
      "sections": [
        "O. VIII r. 5",
        "s. 151",
        "O. XX r. 18"
      ],
      "relevance": "Allegations not specifically denied deemed admitted; applications for mesne profits post-decree"
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court upheld High Court decree allowing plaintiffs' suit for partition, arrears of compensation limited to 3 years prior with interest, and mesne profits from suit till possession or 3 years from decree; rejected appellants' contentions on maintainability and enforceability.",
    "relief_granted": "Partition, arrears of compensation at Rs. 200 p.m. (3 years prior), interest at 6% p.a., mesne profits from suit date till possession or 3 years from High Court decree.",
    "costs": "High Court order on costs upheld."
  },
  "key_quotes": [
    {
      "text": "\"to say that a defendant has no knowledge of a fact pleaded by the plaintiff is not tantamount to a denial of the existence of that fact, not even an implied denial.\"",
      "speaker": "court",
      "significance": "Explains O.VIII r.5 CPC application to adoption fact"
    },
    {
      "text": "\"There is no principle of law which would exclude them from providing in the agreement that those of them as are in actual occupation... shall pay to the other co-owners compensation.\"",
      "speaker": "court",
      "significance": "Core holding on enforceability of co-owners' compensation agreement without ouster"
    }
  ],
  "_case_id": "1966_300",
  "_label": 0,
  "_text_length": 13867,
  "_extracted_at": "2026-02-10T19:42:25.759152"
}