{
  "metadata": {
    "case_name": "Divisional Operating Superintendent, Western Railway v. Respondent No. 1",
    "case_year": 1965,
    "court": "Supreme Court of India",
    "judges": [
      "Ramaswami, J."
    ],
    "case_number": "Criminal Appeal No. 44 of 1965",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "On March 14, 1961 respondent No. 1 filed a complaint against the appellant who was officiating in the post of Divisional Operating Superintendent, Western Railway, Rajkot, alleging offences under ss. 166, 167 and 182, Indian Penal Code.",
      "type": "material",
      "date": "1961-03-14",
      "source": "respondent"
    },
    {
      "id": "f2",
      "text": "Appellant objected before the trying Magistrate that the complaint under s. 182, Indian Penal Code by a private person was barred under s. 195(1)(a) of the Code of Criminal Procedure and that as the alleged acts were done in official capacity and appellant was a public servant not removable from office save with sanction of Central Government, complaint not maintainable without sanction under s. 197 CrPC.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "Objections overruled by Judicial Magistrate, First Class, Mehsana by order dated October 14, 1961.",
      "type": "procedural",
      "date": "1961-10-14",
      "source": "lower_court"
    },
    {
      "id": "f4",
      "text": "Appellant filed revision to Sessions Judge of Mehsana, who referred matter to High Court on January 31, 1962.",
      "type": "procedural",
      "date": "1962-01-31",
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "In Criminal Reference No. 14 of 1962, High Court held complaint under s. 182 bad under s. 195 CrPC but directed trial court to decide if appellant not removable save with sanction of Central Government.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Judicial Magistrate, First Class, Mehsana by order dated February 28, 1963 held appellant not removable save with sanction of Central Government and rejected complaint for lack of s. 197 CrPC sanction.",
      "type": "procedural",
      "date": "1963-02-28",
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "First respondent's revision to Sessions Judge of Mehsana dismissed, confirming Magistrate's order.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "First respondent filed Criminal Revision No. 385 of 1963 to Gujarat High Court, which by order dated July 29, 1964 held appellant as officiating Class I Officer removable by Railway Board, no Central Government sanction necessary under s. 197 CrPC, and directed case under ss. 166 and 167 IPC to proceed.",
      "type": "procedural",
      "date": "1964-07-29",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "On material date March 14, 1961, appellant officiating in senior scale as Class I Officer in Transportation (Traffic Commercial) Department of Western Railway, holding substantive post as Class II Officer.",
      "type": "admitted",
      "date": "1961-03-14",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Exhibits 22, 23 and 24 are copies of appointment orders showing appellant promoted to Class I by General Manager with approval of Railway Board.",
      "type": "admitted",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the appellant was, at the date of the complaint i.e., March 14, 1961, a public servant who was not removable from his office save by or with the sanction of the Central Government within the meaning of s. 197 of the Criminal Procedure Code and, therefore, whether sanction of Central Government was necessary for prosecuting the appellant for offences under ss. 166 and 167 of the Indian Penal Code.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Appellant as officiating Class I Officer treated as holding gazetted post substantively for penalty imposition per Note to Rule 1704; Rule 1705 (post-material date) confirms competent authority based on officiating post.",
      "supporting_facts": [
        "f9",
        "f10"
      ],
      "legal_basis": "Note to Rule 1704, Rule 1705 Discipline and Appeal Rules; Rule 1728, 1729, Schedule II Indian Railway Establishment Code"
    },
    {
      "id": "pa2",
      "text": "Railway Board is part and parcel of Ministry of Railways of Central Government per Allocation of Business Rules 1961, Indian Railway General Code paras 201, 205, s.2 Indian Railway Board Act 1905.",
      "supporting_facts": [],
      "legal_basis": "Allocation of Business Rules 1961 Item 15; Indian Railway General Code paras 201, 205; s.2 Indian Railway Board Act 1905"
    },
    {
      "id": "pa3",
      "text": "Even if delegated, principle qui facit per alium facit per se applies; removal by Railway Board equates to Central Government.",
      "supporting_facts": [],
      "legal_basis": "General principle"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Appellant as officiating Class I (substantive Class II) removable by Railway Board, not requiring Central Government sanction.",
      "supporting_facts": [
        "f9",
        "f10"
      ],
      "legal_basis": "Rules 124, 132, 134 Indian Railway Establishment Code Vol.1; Rule 1729, Schedule II Discipline and Appeal Rules; s.3(8)(b) General Clauses Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Under Rules, substantive promotions to Class I by President, but officiating appointments by General Manager/Railway Board; appellant's appointment by General Manager with Railway Board approval; officiating Class I not 'belong to Class I' per Schedule II Item 1.",
      "addresses_issue": "i1",
      "key_observation": "Appellant removable from office with sanction of Railway Board, sanction of President not necessary."
    },
    {
      "id": "cr2",
      "text": "Note to Rule 1704 applies to non-gazetted staff only; no similar provision for gazetted officers under Rule 1729; Rule 1705 post-dates material date.",
      "addresses_issue": "i1",
      "key_observation": "Rules do not treat officiating gazetted officer as substantive for removal authority."
    },
    {
      "id": "cr3",
      "text": "Railway Board separate entity deriving powers by delegation from Central Government per s.2 Railway Board Act 1905; not part of Central Government.",
      "addresses_issue": "i1",
      "key_observation": "Railway Board exercises delegated powers, not as Central Government itself."
    },
    {
      "id": "cr4",
      "text": "Once Central Government delegates appointment/removal power, public servant not treated as removable only by/with Central Government sanction u/s 197 CrPC.",
      "addresses_issue": "i1",
      "key_observation": "Delegation changes authority for s.197 purposes; qui facit per alium facit per se does not apply."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Appellant was not a public servant not removable from his office save by or with the sanction of the Central Government within meaning of s.197 CrPC; no sanction necessary for prosecution under ss.166,167 IPC.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Afzalur Rahman v. The King Emperor",
      "citation": null,
      "treatment": "followed",
      "relevance": "Police officer dismissible by Deputy Inspector-General not requiring Provincial Government sanction u/s 197 CrPC; delegation changes authority."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "166",
        "167",
        "182"
      ],
      "relevance": "Offences alleged in complaint"
    },
    {
      "name": "Code of Criminal Procedure",
      "sections": [
        "195(1)(a)",
        "197"
      ],
      "relevance": "Bar on private complaint u/s 182 without public servant complaint; sanction required for public servant not removable save by/with Central Government sanction"
    },
    {
      "name": "General Clauses Act",
      "sections": [
        "3(8)(b)"
      ],
      "relevance": "Central Government means President post-Constitution"
    },
    {
      "name": "Indian Railway Establishment Code Vol. I",
      "sections": [
        "124",
        "132",
        "134",
        "1728",
        "1729",
        "Schedule II",
        "Note to 1704",
        "1705"
      ],
      "relevance": "Appointment, promotion, officiating, penalties, competent authorities for Class I/II Railway officers"
    },
    {
      "name": "Indian Railway Board Act, 1905",
      "sections": [
        "2"
      ],
      "relevance": "Delegation of Central Government powers to Railway Board"
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court dismissed the appeal, holding that no sanction under s.197 CrPC was required as the appellant was removable by the Railway Board, and directed the trial under ss.166 and 167 IPC to proceed.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "It follows therefore that the appellant was removable from his office with the sanction of the Railway Board and the sanction of the President is not necessary for taking such action against the appellant.",
      "speaker": "court",
      "significance": "Core holding on removability authority"
    },
    {
      "text": "The Railway Board is a separate body which derives its powers and authority however wide they may be only because of delegation of powers from the Central Government in respect of the administration of the Railways.",
      "speaker": "court",
      "significance": "Distinguishes Railway Board from Central Government"
    },
    {
      "text": "If once the Central Government has delegated its power to another authority with regard to appointment and removal of a public servant, then for the purpose of s. 197, Criminal Procedure Code the public servant concerned will not be treated to be a public servant not removable from his office except by or with the sanction of the Central Government.",
      "speaker": "court",
      "significance": "Principle on effect of delegation for s.197"
    }
  ],
  "_case_id": "1966_287",
  "_label": 0,
  "_text_length": 15022,
  "_extracted_at": "2026-02-10T19:41:37.838956"
}