{
  "metadata": {
    "case_name": "Appellant v. S.K. Roy",
    "case_year": 1965,
    "court": "Supreme Court of India",
    "judges": [
      "Ramaswami, J."
    ],
    "case_number": "Criminal Appeal No. 158 of 1965",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The Bhowra Coke Plant originally belonged to the Bhowra Group of collieries owned by the Eastern Coal Company, but subsequently in or about the years 1945 to 1947 the Coke Plant was transferred by sale to the respondent.",
      "type": "background",
      "date": "1945-1947",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The group of Bhowra Collieries was subsequently sold to the Bhowra Kankanee Collieries Limited.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The respondent is the owner of the Coke Plant and the lessee of the land on which it stands on payment of certain royalty by way of the ground rent for the land, the lessor, at the relevant time, being the Bhowra Kankanee Collieries Limited owning the colliery mine and colliery field area, where the Bhowra Coal Mines are and the Coke Plant is situated.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The Coke Plant is not only adjacent to the colliery mine but is also situated on the surface land, which forms part of the colliery fields which and beneath which the colliery mine is worked by the Bhowra Kankanee Collieries Ltd.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The respondent does not carry on the work of any colliery mine therein, he does not excavate any coal by carrying on any operation for the purpose of obtaining coal.",
      "type": "disputed",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The Coke Plant is a bye-product coke plant in which hard coke as well as some other bye-products are manufactured.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "An Inspector appointed under the Act filed a complaint against the respondent alleging that he was the owner of the Bhowra Coke Plant and that he had contravened certain provisions of the Scheme.",
      "type": "procedural",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f8",
      "text": "It was alleged that the respondent had failed to pay the contribution for the Provident Fund, both employers and employees from April, 1960 to November, 1960 and had failed to submit returns in Form H with corresponding declaration in Form A and the statement in Form P as provided under the Regulations.",
      "type": "disputed",
      "date": "1960-04 to 1960-11",
      "source": "prosecution"
    },
    {
      "id": "f9",
      "text": "The respondent was prosecuted under para 70 of the Coal Mines Provident Fund Scheme for violation of cls. (a), (d) and (f) of paragraph 70 read with paragraphs 33A, 38, 42 and 69A of the Scheme.",
      "type": "procedural",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f10",
      "text": "The trying Magistrate held the respondent guilty and sentenced him to pay a fine of Rs. 500 and, in default, to undergo 3 months simple imprisonment under paragraph 70(a).",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "The Sessions Judge dismissed the appeal and confirmed the sentence imposed by the Magistrate.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "The Patna High Court allowed the Revision Application (Criminal Revision No. 1326 of 1963) dated September 15, 1965, set aside the conviction and sentence holding that the Coke Plant owned by the respondent was not a Coal Mine within the meaning of the Scheme and that the Coke plant was not subject to the provisions of the Scheme and the respondent was not the owner of the mine within the meaning of the Act and the Scheme.",
      "type": "procedural",
      "date": "1965-09-15",
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "whether the respondent-S. K. Roy-is the owner of a coal mine within the meaning of s. 2(b) and 2(e) of the Coal Mines Provident Fund and Bonus Schemes Act, 1948",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The Coke Plant owned by the respondent was not a Coal Mine within the meaning of the Scheme and that the Coke plant was not subject to the provisions of the Scheme and the respondent was not the owner of the mine within the meaning of the Act and the Scheme.",
      "supporting_facts": [
        "f3",
        "f4",
        "f5",
        "f6"
      ],
      "legal_basis": "s. 2(b) of the Coal Mines Provident Fund and Bonus Schemes Act, 1948"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Under S. 2(e) of the Act the expression Employer means the owner of a coal mine as defined in clause (g) of s. 3 of the Indian Mines Act, 1923. The Indian Mines Act, 1923 has been repealed and substituted by the Mines Act 1952 (Act 35 of 1952). In the latter Act the word owner has been defined in cl. (l) of s. 2. By virtue of s. 8 of the General Clauses Act, the definition of the word Employer in cl. (e) of s. 2 of the Act should be construed with reference to the definition of the word owner in cl. (l) of s. 2 of Act 35 of 1952.",
      "addresses_issue": "i1",
      "key_observation": "Definition of owner to be taken from Mines Act 1952."
    },
    {
      "id": "cr2",
      "text": "According to s. 2(l) of Act 35 of 1952 the word owner, when used in relation to a mine, means any person who is the immediate proprietor or lessee or occupier of the mine or of any part thereof.",
      "addresses_issue": "i1",
      "key_observation": "Owner definition from Mines Act."
    },
    {
      "id": "cr3",
      "text": "Coal mine means any excavation where any operation for the purpose of obtaining coal has been or is being carried on, and includes all works, machinery, tramways and sidings, whether above or below ground, in or adjacent to or belonging to a coal mine Provided that it shall not include any part of the coal mine on which a manufacturing process is being carried on unless such process is a process for coke-making or the dressing of minerals.",
      "addresses_issue": "i1",
      "key_observation": "Quoting s.2(b) of the Act."
    },
    {
      "id": "cr4",
      "text": "As a matter of construction it must be held that all works, machinery, tramways and sidings, whether above or below ground, in or adjacent to a coal mine will come within the scope and ambit of the definition only when they belong to the coal mine. In other words, the word or occurring before the expression belonging to a coal mine in the main definition has to be read to mean and.",
      "addresses_issue": "i1",
      "key_observation": "Read 'and' for 'or' in definition to avoid anomalous results."
    },
    {
      "id": "cr5",
      "text": "Any works, machinery, tramways and sidings which do not appertain to the coal mine in the sense of ownership cannot come within the meaning of the expression coal mine as given in the first part of cl. (b) of s. 2 of the Act.",
      "addresses_issue": "i1",
      "key_observation": "Ownership is key; subsidiary items must belong to the coal mine."
    },
    {
      "id": "cr6",
      "text": "The expression belonging to a coal mine is the controlling expression governing all aspects of the activities of the coal mine within the definition of s. 2(b) and all subsidiary things such as works, machinery, tramways and sidings are brought within the definition of the coal mine only if they appertain to the coal mine, that is to say, if they are under the same ownership.",
      "addresses_issue": "i1",
      "key_observation": "Same ownership required."
    },
    {
      "id": "cr7",
      "text": "In order to carry out the legislative intention it is necessary to substitute the conjunction and for the conjunction or in the definition of a coal mine in s. 2(b) of the Act.",
      "addresses_issue": "i1",
      "key_observation": "Legislative intention requires reading 'and'."
    },
    {
      "id": "cr8",
      "text": "Reference to the expanded definition of the word coal mine in s. 2(b) of the Coal Mines Provident Fund and Bonus Schemes Amendment Act, 1965 (Act 45 of 1965) which clarifies inclusion only if belonging to or under same management.",
      "addresses_issue": "i1",
      "key_observation": "Amendment Act fixes proper interpretation of earlier Act, not change in law."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The respondent is not the owner of a coal mine within the meaning of s. 2(b) and 2(e) of the Coal Mines Provident Fund and Bonus Schemes Act, 1948, as the Coke Plant does not belong to the coal mine in the sense of ownership and no excavation for coal is carried on there.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "State of Uttar Pradesh v. M.P. Singh etc.",
      "citation": "1960 2 S.C.R. 605 A.I.R. 1960 S.C. 569",
      "treatment": "followed",
      "relevance": "Decision of this Court on construction of definitions post-repeal."
    },
    {
      "case_name": "Ormond Investment Co. Ltd. v. Betts",
      "citation": null,
      "treatment": "referred",
      "relevance": "Subsequent legislation may be looked at to interpret earlier ambiguous Act."
    }
  ],
  "statutes_cited": [
    {
      "name": "Coal Mines Provident Fund and Bonus Schemes Act, 1948 (Act 46 of 1948)",
      "sections": [
        "s. 2(b)",
        "s. 2(e)"
      ],
      "relevance": "Definition of coal mine and employer; whether respondent is owner of coal mine."
    },
    {
      "name": "Mines Act, 1952 (Act 35 of 1952)",
      "sections": [
        "s. 2(l)"
      ],
      "relevance": "Definition of owner applicable via General Clauses Act."
    },
    {
      "name": "Indian Mines Act, 1923",
      "sections": [
        "s. 3(g)"
      ],
      "relevance": "Original definition of owner, repealed."
    },
    {
      "name": "General Clauses Act",
      "sections": [
        "s. 8"
      ],
      "relevance": "Construction of definitions post-repeal."
    },
    {
      "name": "Coal Mines Provident Fund and Bonus Schemes Amendment Act, 1965 (Act 45 of 1965)",
      "sections": [
        "s. 2(b)"
      ],
      "relevance": "Expanded definition clarifies interpretation of original s.2(b)."
    },
    {
      "name": "Coal Mines Provident Fund Scheme",
      "sections": [
        "para 70 (a), (d), (f)",
        "paras 33A, 38, 42, 69A"
      ],
      "relevance": "Provisions violated; para 70(a) for sentencing."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court interprets the definition of coal mine in s.2(b) requiring same ownership for subsidiary works like the Coke Plant, agreeing with High Court that respondent's Coke Plant is not a coal mine and he is not the owner thereunder, upholding the setting aside of conviction.",
    "relief_granted": "Conviction and sentence set aside confirmed",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "the word or occurring before the expression belonging to a coal mine in the main definition has to be read to mean and. Any other interpretation would lead to an anomalous and startling consequence.",
      "speaker": "court",
      "significance": "Key to interpreting s.2(b) definition."
    },
    {
      "text": "The expression belonging to a coal mine is the controlling expression governing all aspects of the activities of the coal mine within the definition of s. 2(b)",
      "speaker": "court",
      "significance": "Emphasizes ownership requirement."
    },
    {
      "text": "the change in the language of s. 2(b) of the earlier Act brought about by the amending Act (Act 45 of 1965) was not meant to bring about a change of law in this respect but was meant to fix a proper interpretation upon the earlier Act.",
      "speaker": "court",
      "significance": "Use of subsequent legislation for construction."
    }
  ],
  "_case_id": "1966_101",
  "_label": 0,
  "_text_length": 10779,
  "_extracted_at": "2026-02-10T19:39:40.697325"
}