{
  "metadata": {
    "case_name": "Stephen Court Limited v. Surendra Nath Bibra",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "Sikri J."
    ],
    "case_number": "Civil Appeal No. 661 of 1963",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Stephen Court Limited (plaintiff/respondent) filed suit in Court of Small Causes, Calcutta, for recovery of rent from September 1956 to November 1956 at Rs. 350 per mensem and interest against Surendra Nath Bibra (defendant/appellant).",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Defendant was monthly tenant by virtue of lease dated April 30, 1956, for flat No. 17 at 18A Park Street, Stephen Court, Calcutta, for 21 years.",
      "type": "admitted",
      "date": "1956-04-30",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Defendant pleaded that relying on plaintiff's representation and assurance that three bed-rooms, two bath rooms etc. would be available, he executed lease, but plaintiff put him in possession only of two bed-rooms, not three, entitling him to suspend rent altogether.",
      "type": "disputed",
      "date": null,
      "source": "defendant"
    },
    {
      "id": "f4",
      "text": "Small Causes Court Judge (Mr. Mandal) found defendant not put into possession of one of the three bed-rooms and held defendant entitled to suspend payment of rent, following Katyayani Debi v. Udoy Kumar Das and Abhoya Charan Sen v. Hem Chandra Pal.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "Plaintiff preferred application under s. 38 of Presidency Small Cause Courts Act against dismissal. Full Bench of Small Causes Court, following Ram Lal Dutt Sarkar v. Dhirendra Nath Roy, held plaintiff's claim for arrears succeeds despite failure to give possession of one bed-room, but tenant not debarred from other reliefs like apportionment or damages. Decreed suit.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "Defendant filed application under s. 115 CPC and Art. 227 Constitution praying suit dismissal or alternatively proportionate rent. High Court (judgment dated August 17, 1959 in Civil Rule No. 274 of 1958) dismissed application.",
      "type": "procedural",
      "date": "1959-08-17",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Defendant paid rent voluntarily for four months, but three months rent was paid in advance as security deposit.",
      "type": "admitted",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the defendant tenant is entitled to suspend payment of rent due to plaintiff landlord's failure to give possession of one out of three bed-rooms.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the defendant is entitled to proportionate rent for the portion of premises in possession.",
      "framed_by": "defendant"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Ram Lal Dutt Sarkar case distinguishable as it concerned agricultural tenancy and tenant raised point after years; doctrine of suspension of rent applies here as plaintiff deliberately did not give possession of one bed-room.",
      "supporting_facts": [
        "f3",
        "f4"
      ],
      "legal_basis": "Ram Lal Dutt Sarkar v. Dhirendra Nath Roy; Neale v. Mackenzie"
    },
    {
      "id": "pa2",
      "text": "In alternative, Full Bench and High Court should have ordered apportionment of rent.",
      "supporting_facts": [
        "f3",
        "f5",
        "f6"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Defendant paid rent voluntarily for four months, so no remand.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "As appeal arises from application under s. 115 CPC and Art. 227 Constitution, Supreme Court should not interfere even if erroneous.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": "s. 115 CPC; Art. 227 Constitution"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Ram Lal Dutt not distinguishable; principle from Neale v. Mackenzie not inflexible rule of justice, equity and good conscience in all cases; depends on circumstances whether tenant entitled to suspend rent or pay proportionate rent.",
      "addresses_issue": "i1",
      "key_observation": "Tenant enjoys substantial portion without much inconvenience; inequitable for windfall or to pay full when not in full possession."
    },
    {
      "id": "cr2",
      "text": "On facts, tenant not entitled to suspend rent but must pay proportionate part.",
      "addresses_issue": "i1",
      "key_observation": "Not deciding general applicability of suspension doctrine to partial eviction cases."
    },
    {
      "id": "cr3",
      "text": "High Court erred in rejecting apportionment on ground no specific plea in written statement or prayer to amend; inequitable to allow full rent when not full possession; Full Bench should have remanded for calculation.",
      "addresses_issue": "i2",
      "key_observation": "Technical view by High Court; voluntary payment not bar as three months was security deposit."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Doctrine of suspension of rent not applicable; tenant liable to pay proportionate rent for portion in possession.",
      "resolves_issue": "i1",
      "in_favor_of": "partial"
    },
    {
      "id": "h2",
      "text": "Case remanded to Small Causes Court for disposal in light of judgment, with liberty to lead evidence on apportionment.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Katyayani Debi v. Udoy Kumar Das",
      "citation": "30 C.W.N. P.C.",
      "treatment": "followed",
      "relevance": "By Small Causes Judge for suspension of rent"
    },
    {
      "case_name": "Abhoya Charan Sen v. Hem Chandra Pal",
      "citation": "33 C.W.N. 715",
      "treatment": "followed",
      "relevance": "By Small Causes Judge for suspension of rent"
    },
    {
      "case_name": "Ram Lal Dutt Sarkar v. Dhirendra Nath Roy",
      "citation": "70 I.A. 18",
      "treatment": "followed",
      "relevance": "By Full Bench and High Court for landlord's claim succeeding despite partial possession; not distinguishable per Supreme Court"
    },
    {
      "case_name": "Neale v. Mackenzie",
      "citation": "150 E.R. 635",
      "treatment": "referred",
      "relevance": "Principle not inflexible; subject-matter was dwelling house and land"
    },
    {
      "case_name": "Hakim Sardar Bahadur v. Parkash Singh",
      "citation": "A.I.R. 1962 Pun. 385",
      "treatment": "not considered",
      "relevance": "Mentioned but not decided upon"
    },
    {
      "case_name": "Jatindra Kumar Seal v. Raimohan Bai",
      "citation": "A.I.R. 1961 An. 52",
      "treatment": "not considered",
      "relevance": "Mentioned but not decided upon"
    },
    {
      "case_name": "Nilkantha Pati v. Kshitish Chandra Satati",
      "citation": "I.L.R. 1952 1 Cal. 59",
      "treatment": "not considered",
      "relevance": "Mentioned but not decided upon"
    }
  ],
  "statutes_cited": [
    {
      "name": "Code of Civil Procedure",
      "sections": [
        "s. 115"
      ],
      "relevance": "Defendant's application against Small Causes decree; basis of appeal"
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 227"
      ],
      "relevance": "Defendant's application; supervisory jurisdiction"
    },
    {
      "name": "Presidency Small Cause Courts Act",
      "sections": [
        "s. 38"
      ],
      "relevance": "Plaintiff's application against Small Causes dismissal"
    }
  ],
  "outcome": {
    "disposition": "remanded",
    "summary": "Appeal succeeds; orders of High Court, Full Bench Small Causes Court, and Small Causes Judge set aside; case remanded to Court of Small Causes, Calcutta, to dispose of suit in light of judgment with liberty to parties to lead evidence on apportionment of rent.",
    "relief_granted": "Remand for calculation and decree of proportionate rent",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"the doctrine laid down in Neale v. Mackenzie is too inflexible and cannot be applied to all cases.\"",
      "speaker": "court",
      "significance": "Rejects rigid application of suspension of rent doctrine"
    },
    {
      "text": "\"it will depend on the circumstances of each case, whether a tenant would be entitled to suspend payment of the rent or whether he should be held liable to pay proportionate part of the rent.\"",
      "speaker": "court",
      "significance": "Establishes discretionary approach based on facts"
    },
    {
      "text": "\"It would be inequitable to allow the plaintiff to recover the full rent when he has not delivered possession of the whole of the premises in question.\"",
      "speaker": "court",
      "significance": "Justifies remand for proportionate rent"
    }
  ],
  "_case_id": "1966_13",
  "_label": 1,
  "_text_length": 9227,
  "_extracted_at": "2026-02-10T19:38:50.839291"
}