{
  "metadata": {
    "case_name": "Manji Dana v. Commissioner of Income Tax",
    "case_year": null,
    "court": "Supreme Court of India",
    "judges": [
      "Shah, J."
    ],
    "case_number": null,
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "For the assessment year 1946-47 the appellant, Manji Dana, filed his return of income in the status of an individual, but the Income-tax Officer assessed him in the status of a Hindu undivided family.",
      "type": "material",
      "date": "1946",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "An appeal against the order of assessment was dismissed.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The Income-tax Officer thereafter having reason to believe that certain income had escaped assessment initiated action for assessment and served a notice upon Manji Dana under section 34(1)(a) on March 25, 1955, for assessment of escaped income.",
      "type": "procedural",
      "date": "1955-03-25",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "In response to the notice, Manji Dana filed his return in the status of an individual, and the order of assessment was completed in the status of an individual on March 15, 1956.",
      "type": "procedural",
      "date": "1956-03-15",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "In appeal the order passed by the Income-tax Officer was confirmed by the Appellate Assistant Commissioner.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Against that order an appeal was preferred to the Appellate Tribunal.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Neither before the Appellate Assistant Commissioner, nor before the Tribunal did Manji Dana set up a ground that since the original order of assessment was made in the status of a Hindu undivided family, it was not competent to the Income-tax Officer, pursuant to a notice under section 34(1)(a) to assess him in the status of an individual.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "In the course of the argument before the Tribunal, counsel for Manji Dana contended that the order of assessment pursuant to a notice under section 34(1)(a) made in the status of an individual was invalid, because the earlier order of assessment was made against Manji Dana in the status of a Hindu undivided family.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "The Tribunal declined to allow that argument to be raised and dismissed the appeal.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "On a direction by the High Court of Judicature at Bombay under section 66(2) of the Indian Income-tax Act, 1922, the Tribunal drew up a statement of the case and referred the question of law to the High Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "The High Court recorded an answer in the negative on that question.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "With special leave, Manji Dana has appealed to this Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "In the years before the assessment year 1946-47 Manji Dana was assessed in the status of a Hindu undivided family.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "In the assessment year 1946-47 he submitted a return both in the status of an individual and also in the name of Manji Dana Company.",
      "type": "material",
      "date": "1946",
      "source": "court"
    },
    {
      "id": "f15",
      "text": "The Income-tax Officer assessed the income of Manji Dana in the status of a Hindu undivided family on the return made as an individual.",
      "type": "material",
      "date": "1946-12-03",
      "source": "court"
    },
    {
      "id": "f16",
      "text": "How the return made in the name of Manji Dana Company was disposed of cannot be ascertained from the record.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f17",
      "text": "The notice issued under section 34(1)(a) by the Income-tax Officer has not been included in the printed paper-book, but it is common ground that pursuant to that notice Manji Dana submitted a return in the status of an individual and the Income-tax Officer proceeded to assess him in the status of an individual on his escaped income.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f18",
      "text": "Comparing the original assessment order dated December 3, 1946, with the order of assessment made under section 34(1)(a), it appears that the quantum of total business income included in the latter order does not tally with the business income which was computed in the original assessment.",
      "type": "disputed",
      "date": null,
      "source": "court"
    },
    {
      "id": "f19",
      "text": "There is no evidence on the record that the income which is assessed in proceedings under section 34(1)(a) was not his separate income, and from the fact that the original assessment was made on the footing of an undivided family in the year of account, it cannot be presumed in proceedings for assessment under section 34 that the income assessed was not of an individual.",
      "type": "disputed",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the Tribunal erred in law in not allowing the petitioner to raise and argue the following question, that is to say, Whether in view of the fact that the original assessment sought to be reopen was made on the petitioners Hindu undivided family, the reassessment purported to have been made on the petitioner as an individual is bad and void in law?",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Since the original order of assessment was made in the status of a Hindu undivided family, it was not competent to the Income-tax Officer, pursuant to a notice under section 34(1)(a) to assess him in the status of an individual.",
      "supporting_facts": [
        "f1",
        "f4",
        "f15"
      ],
      "legal_basis": "Rule 12 of the Appellate Tribunal Rules, 1946; section 25A(3) of the Income-tax Act"
    },
    {
      "id": "pa2",
      "text": "Once an assessment was made of a Hindu undivided family in that status, unless an order under section 25A(1) recording partition was made, the departmental authorities had no power to make an assessment of the members of that Hindu undivided family in the status of individuals.",
      "supporting_facts": [
        "f1",
        "f13",
        "f15"
      ],
      "legal_basis": "section 25A(3) of the Income-tax Act"
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "In refusing to allow a new point which was sought to be raised for the first time - a point which was not raised before the Income-tax Officer nor before the Appellate Assistant Commissioner, nor in the grounds of appeal - the Tribunal relied upon rule 12 of the Appellate Tribunal Rules, 1946.",
      "addresses_issue": "i1",
      "key_observation": "The contention sought to be raised before them had never been taken before the Income-tax Officer or before the Appellate Assistant Commissioner and since in arriving at a decision on the question raised thereby would necessitate investigation of fresh facts, they would not permit counsel for Manji Dana to raise the contention at that stage."
    },
    {
      "id": "cr2",
      "text": "Whether the discretion of the Tribunal has been properly exercised in a given case in refusing to allow a question to be raised which has not been set forth in the memorandum of appeal, would normally not be a question of law.",
      "addresses_issue": "i1",
      "key_observation": "In the present case, not only was the question not raised in the memorandum of appeal, but was not even set up before the Income-tax Officer."
    },
    {
      "id": "cr3",
      "text": "Under section 25A(1) the Income-tax Officer may, on an application that among the members of a Hindu family which has been hitherto assessed as a Hindu undivided family partition has taken place, record an order to that effect. Sub-section (3) provides that where such an order has not been made in respect of a Hindu family hitherto assessed as undivided, such family shall be deemed, for the purposes of the Act, to continue to be a Hindu undivided family.",
      "addresses_issue": "i1",
      "key_observation": "Sub-section (3) postulates the existence of a family which has been assessed as a Hindu undivided family. It is only where such family existed and the income earned was of the family that the Income-tax Officer is obliged to assess the income of the members of the family in the status of a Hindu undivided family, notwithstanding a plea that a partition has taken place among the members."
    },
    {
      "id": "cr4",
      "text": "But there is nothing in the Act which precludes the Income-tax Officer from coming to a conclusion that even though in the previous year the assessment was made on the footing that the assessee was a Hindu undivided family, there was in fact no Hindu undivided family and the income for the purpose of assessment belonged to an individual, and on that footing to make an order of assessment.",
      "addresses_issue": "i1",
      "key_observation": "It is also open to the Income-tax Officer to come to a conclusion, notwithstanding the terms of section 25A(3) that the income sought to be assessed or reassessed is not the income of the Hindu undivided family, and on that footing to assess such income as of an individual."
    },
    {
      "id": "cr5",
      "text": "Manji Dana submitted a return in the status of an individual pursuant to a notice issued under section 34(1)(a). It was open to the Income-tax Officer to accept the admission made by Manji Dana that the income belonged to the assessee and not to the Hindu undivided family.",
      "addresses_issue": "i1",
      "key_observation": "If, thereafter, it was contended that assessment could not be made pursuant to a notice under section 34(1)(a), it was necessary to investigate the question whether the income was of a Hindu undivided family or of the appellant individually and that unquestionably demanded enquiry into facts."
    },
    {
      "id": "cr6",
      "text": "The new plea is based on a two-fold assumption of facts - that a Hindu undivided family existed in the relevant previous year and that the income which was sought to be assessed in proceedings under section 34(1)(a) was the income of that family. The first may only be founded on evidence, and the second is contrary to the admissions made by Manji Dana.",
      "addresses_issue": "i1",
      "key_observation": "We are, therefore, unable to accept the argument of Mr. Pathak that the new plea sought to be raised did not necessitate enquiry into facts which had not been investigated."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The Tribunal did not err in refusing to allow the new point to be raised as it necessitated investigation of fresh facts and was not raised earlier.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Section 25A(3) does not preclude the Income-tax Officer from assessing income as belonging to an individual even if prior assessment was as HUF, if facts support it.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act, 1922",
      "sections": [
        "Section 34(1)(a)",
        "Section 25A(1)",
        "Section 25A(3)",
        "Section 5A(8)",
        "Section 66(2)"
      ],
      "relevance": "Governs escaped assessment, HUF partition recording, Tribunal rules, and reference to High Court"
    },
    {
      "name": "Appellate Tribunal Rules, 1946",
      "sections": [
        "Rule 12"
      ],
      "relevance": "Limits grounds of appeal to those in memorandum unless leave granted; Tribunal relied on this to refuse new point"
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court upheld the High Court's negative answer to the reference question, affirming the Tribunal's refusal to entertain the new contention regarding invalidity of reassessment as individual, as it required fresh factual inquiry and was not raised earlier.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "But there is nothing in the Act which precludes the Income-tax Officer from coming to a conclusion that even though in the previous year the assessment was made on the footing that the assessee was a Hindu undivided family, there was in fact no Hindu undivided family and the income for the purpose of assessment belonged to an individual.",
      "speaker": "court",
      "significance": "Core holding on scope of section 25A(3)"
    },
    {
      "text": "The new plea is based on a two-fold assumption of facts - that a Hindu undivided family existed in the relevant previous year and that the income which was sought to be assessed in proceedings under section 34(1)(a) was the income of that family.",
      "speaker": "court",
      "significance": "Explains why new plea required fresh evidence"
    }
  ],
  "_case_id": "1966_83",
  "_label": 0,
  "_text_length": 8550,
  "_extracted_at": "2026-02-10T19:39:36.811255"
}