{
  "metadata": {
    "case_name": "Appellant Exchange v. Workmen",
    "case_year": 1966,
    "court": "Supreme Court of India",
    "judges": [
      "Shah, J."
    ],
    "case_number": "Civil Appeal No. 131 of 1966",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The appellant is engaged in carrying on the business of regulating forward trade in groundnut oil and mustard-seed, and is recognised as an Exchange under the provisions of the Forward Contract Act, 1952.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On June 1, 1964 the Government of India issued an order prohibiting trading in diverse commodities including groundnut oil and mustard-seed, and in consequence thereof no further business could be carried on through the appellant Exchange.",
      "type": "material",
      "date": "1964-06-01",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On July 17, 1965 the appellant served notices of retrenchment upon 30 out of its 37 employees and paid them salary for the period of notice and retrenchment compensation under s. 25F of the Industrial Disputes Act 14 of 1947.",
      "type": "material",
      "date": "1965-07-17",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The workmen raised an industrial dispute. Conciliation proceedings failed, and the Delhi Administration referred to the Labour Court the dispute whether retrenchment of the workmen by the appellant was unjustified and illegal.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Workmen pleaded that retrenchment on the ground of the ban was mala fide and that in retaining seven workmen the appellant did not follow, without any adequate ground, the first come last go rule.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f6",
      "text": "Appellant denied mala fide or unfair labour practice, submitted reasons recorded in resolution for departing from first come last go rule, and adhered to s.25F as far as possible.",
      "type": "admitted",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "At hearing before Labour Court, counsel for workmen conceded appellant justified in retrenching and number of employees needed not exceed seven retained, but contended failure to observe first come last go made order illegal in entirety.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "Labour Court held departure from principle rendered retrenchment unjustified, ordered reinstatement of Accountant R.N. Seth and three senior clerks Shiv Das Sharma, Kishan Lal Grover, Surinder Singh with back wages; clerks 4-14 additional 50% wages as compensation no reinstatement; peons Tara Shanker, Om Prakash reinstated; peons 18-23 additional 50% wages.",
      "type": "procedural",
      "date": "1965-09-10",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Company appealed to Supreme Court with special leave.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Management recorded resolution setting reasons for retaining Ram Lal Sethi (accountant), Jagdish Pershad (share work, court work), Kidar Nath Thukral (typist), Om Prakash Juneja (records), Jai Narain, Budhpal Singh and Laljimal (chowkidars).",
      "type": "admitted",
      "date": null,
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether departure from the 'first come, last go' rule in retrenchment, for valid reasons such as special skills, renders the retrenchment mala fide, illegal or an unfair labour practice.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether management can retain junior employees with special aptitude in interests of business, departing from seniority rule.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether additional compensation beyond statutory retrenchment compensation can be awarded to properly retrenched workmen.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Retrenchment not mala fide or unfair labour practice; valid reasons recorded for departing from first come last go rule by retaining employees with special skills like accounting, share/court work, typing, record-keeping, chowkidar duties.",
      "supporting_facts": [
        "f3",
        "f6",
        "f10"
      ],
      "legal_basis": "s. 25F Industrial Disputes Act; principle that rule not immutable"
    },
    {
      "id": "pa2",
      "text": "Retrenchment justified due to ban on business; only 7 needed post-ban.",
      "supporting_facts": [
        "f2",
        "f3"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Retrenchment mala fide; failure to follow first come last go without adequate ground entitles all to reinstatement.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": "first come last go principle as part of industrial law"
    },
    {
      "id": "ra2",
      "text": "Conceded justification for retrenchment and number retained, but departure from rule makes entire order illegal; clerks interchangeable, no special skills.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "J.K. Iron and Steel Co. Ltd. v. Its Workmen"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Accepted principle that retrenchment ordinarily follows first come last go, but rule not immutable; may depart for valid reasons; Tribunal cannot assume mala fides from mere departure if valid justifiable reasons.",
      "addresses_issue": "i1",
      "key_observation": "Management decides who to retain in business interests if bona fide."
    },
    {
      "id": "cr2",
      "text": "Reviewed retentions: Ram Lal Sethi (accountant, upheld); Jagdish Pershad (special aptitude in share/court work, no senior alternative); Kidar Nath Thukral (only typist); Om Prakash Juneja (efficient record-keeper, special training needed); peons Jai Narain (upheld), Budhpal Singh & Laljimal (senior-most chowkidars, physique needed).",
      "addresses_issue": "i2",
      "key_observation": "Special aptitude justifies retention over seniors where other things not equal."
    },
    {
      "id": "cr3",
      "text": "Distinguished J.K. Iron case: there no special skill, clerks interchangeable; here retained had special skills/aptitude.",
      "addresses_issue": "i1",
      "key_observation": "Inference of mala fides only if no special skill and same work."
    },
    {
      "id": "cr4",
      "text": "No additional compensation beyond statutory retrenchment compensation for properly retrenched workmen; only if reinstatement ordered.",
      "addresses_issue": "i3",
      "key_observation": "Retrenchment compensation is solatium; no extra where valid."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Departure from first come last go permissible for valid business reasons like special skills; no mala fides here.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Management bona fide retention of staff with special aptitude not unfair even if juniors.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h3",
      "text": "No additional compensation payable beyond s.25F for valid retrenchment.",
      "resolves_issue": "i3",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Swadesamitran Ltd. v. Their Workmen",
      "citation": "1960 1 L.L.J. 504",
      "treatment": "followed",
      "relevance": "Rule of first come last go ordinary but employer decides who to retrench; follow where other things equal."
    },
    {
      "case_name": "J.K. Iron and Steel Company Ltd. v. Its Workmen",
      "citation": "1960 2 L.L.J. 64",
      "treatment": "distinguished",
      "relevance": "No departure justified for mere experience in clerical work without special skill; clerks interchangeable; here special aptitude present."
    }
  ],
  "statutes_cited": [
    {
      "name": "Forward Contracts (Regulation) Act, 1952",
      "sections": [],
      "relevance": "Appellant recognised as Exchange under this Act."
    },
    {
      "name": "Industrial Disputes Act, 1947",
      "sections": [
        "s. 25F"
      ],
      "relevance": "Notice and retrenchment compensation paid; adhered to as far as possible."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; Labour Court award set aside and substituted: retrenchment not unjustified or illegal; workmen not entitled to any relief. Orders of reinstatement and additional compensation vacated.",
    "relief_granted": "None to workmen",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "It is an accepted principle of industrial law that in ordering retrenchment ordinarily the management should commence with the latest recruit, and progressively retrench employees higher up in the list of seniority. But the rule is not immutable, and for valid reasons may be departed from.",
      "speaker": "court",
      "significance": "Core holding on flexibility of first come last go rule."
    },
    {
      "text": "The Tribunal has to determine in each case whether the management has in ordering retrenchment acted fairly and properly and not with any ulterior motive it cannot assume from mere departure from the rule that the management was actuated by improper motives.",
      "speaker": "court",
      "significance": "Limits Tribunal's role; no automatic mala fides inference."
    },
    {
      "text": "Retrenchment compensation is paid as solatium for termination of service resulting in unemployment and if that compensation be paid there can be no ground for awarding compensation in addition to statutory retrenchment compensation.",
      "speaker": "court",
      "significance": "Rejects additional compensation for valid retrenchment."
    }
  ],
  "_case_id": "1966_22",
  "_label": 1,
  "_text_length": 16723,
  "_extracted_at": "2026-02-10T19:38:55.135392"
}