{
  "metadata": {
    "case_name": "Income-tax Officer, Companies Circle 1(4), Bombay v. Respondent-Company",
    "case_year": null,
    "court": "Supreme Court of India",
    "judges": [
      "Shah, J."
    ],
    "case_number": null,
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The Income-tax Officer computed the respondent-company's total income for the assessment year 1952-53 at Rs. 23,596 and brought that amount to tax.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The respondent-company had distributed Rs. 2,66,788 as dividend in the previous year.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The Income-tax Officer, by order dated 27th July 1955, levied additional tax on the excess dividend declared by the respondent-company and ordered payment of Rs. 33,348-8-0 as additional tax, which was complied with.",
      "type": "procedural",
      "date": "1955-07-27",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Bombay High Court in Khatau Makanji Spinning and Weaving Co. Ltd. v. Commissioner of Income-tax held that the levy of tax on excess dividend was illegal.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Respondent-company applied to Income-tax Officer on 28 September 1956 for refund of the tax paid, expressly stating that the order be rectified under section 35 of the Indian Income-tax Act and an order for refund be made.",
      "type": "procedural",
      "date": "1956-09-28",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Income-tax Officer by order dated 2nd November 1957 declined the request, stating assessment completed before Bombay High Court judgment.",
      "type": "procedural",
      "date": "1957-11-02",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Respondent-company moved Commissioner of Income-tax under section 33A to revise the order.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Commissioner rejected the application, holding it barred as application for cancellation and not for revision of a mistake apparent.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Respondent-company filed petition in Bombay High Court on original side under Article 226 of the Constitution for order compelling Income-tax Officer to revise the order dated 2nd November 1957.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "High Court granted the application.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "This Court in Commissioner of Income-tax v. Khatau Makanji Spinning and Weaving Co. Ltd. held the levy of additional tax illegal.",
      "type": "background",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the respondent-company's application to the Income-tax Officer was an application for rectification under section 35 entitling it to refund of the illegally collected additional tax on excess dividend.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the income-tax authorities could refuse refund on the ground that no formal application under section 35 was presented.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "No application for rectification under section 35 was presented by the respondent-company, therefore not entitled to relief.",
      "supporting_facts": [
        "f5",
        "f6"
      ],
      "legal_basis": "Section 35 of the Indian Income-tax Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The application expressly requested rectification under section 35 and refund, which was implicit request for rectification.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": "Section 35 of the Indian Income-tax Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "In view of this Court's judgment in Commissioner of Income-tax v. Khatau Makanji Spinning and Weaving Co. Ltd., the levy of additional tax was illegal.",
      "addresses_issue": "i1",
      "key_observation": "Levy illegal"
    },
    {
      "id": "cr2",
      "text": "The application to ITO was one in which request for rectification was implicit; income-tax authorities treated it as under section 35 and rejected on merits; Commissioner treated it in that light.",
      "addresses_issue": "i2",
      "key_observation": "Application was effectively under section 35"
    },
    {
      "id": "cr3",
      "text": "High Court was right in directing refund of the amount illegally collected.",
      "addresses_issue": "i1",
      "key_observation": "Refund directed"
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Levy of additional tax on excess dividend is illegal as per this Court's judgment in Commissioner of Income-tax v. Khatau Makanji Spinning and Weaving Co. Ltd.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "The respondent's application qualified as one for rectification under section 35, entitling it to refund.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Khatau Makanji Spinning and Weaving Co. Ltd. v. Commissioner of Income-tax",
      "citation": null,
      "treatment": "followed",
      "relevance": "Bombay High Court held levy of tax on excess dividend illegal; affirmed by this Court"
    },
    {
      "case_name": "Commissioner of Income-tax v. Khatau Makanji Spinning and Weaving Co. Ltd.",
      "citation": null,
      "treatment": "followed",
      "relevance": "Supreme Court affirmed illegality of additional tax levy on excess dividend"
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act",
      "sections": [
        "Section 35",
        "Section 33A"
      ],
      "relevance": "Section 35 for rectification of orders and refund; Section 33A for revision by Commissioner"
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 226"
      ],
      "relevance": "High Court writ jurisdiction invoked for compelling revision and refund"
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal against the Bombay High Court's order directing refund of illegally collected additional tax is dismissed. The High Court was right in directing the Commissioner to refund the amount.",
    "relief_granted": "Direction to refund the additional tax of Rs. 33,348-8-0 illegally collected",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "There is no doubt that, in view of the judgment of this court in Commissioner of Income-tax v. Khatau Makanji Spinning and Weaving Co. Ltd., the levy of an additional tax was illegal.",
      "speaker": "court",
      "significance": "Confirms illegality of the tax levy"
    },
    {
      "text": "In our view, the High Court was right in making the order, directing the Commissioner to refund the amount of tax which was illegally collected.",
      "speaker": "court",
      "significance": "Upholds High Court's direction for refund"
    }
  ],
  "_case_id": "1966_127",
  "_label": 0,
  "_text_length": 3526,
  "_extracted_at": "2026-02-10T19:40:10.616489"
}