{
  "metadata": {
    "case_name": "Biswabahan Das v. Hazarika",
    "case_year": 1966,
    "court": "Supreme Court of India",
    "judges": [
      "Mitter, J."
    ],
    "case_number": "Civil Appeal No. 94 of 1966",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Biswabahan Das was the lessee of the excise shop in Dibrugarh area from 1956 to 1962.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The shop was settled with Biswabahan Das again for 1962-64 by the Deputy Commissioner.",
      "type": "procedural",
      "date": "1962-01-01",
      "source": "lower_court"
    },
    {
      "id": "f3",
      "text": "On appeal to the Board of Revenue, the settlement was set aside based on a report by the Inspector of Excise, and the shop was settled with Hazarika (respondent).",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f4",
      "text": "Biswabahan Das filed a writ petition in Assam High Court (Civil Rule No. 208 of 1964), succeeded on ground that Inspector's evidence was taken behind his back, but High Court held no useful purpose in granting relief as licence period about to expire.",
      "type": "procedural",
      "date": "1964-11-24",
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "Hazarika remained lessee when fresh settlement due; Deputy Commissioner settled shop with Hazarika for 1964-67.",
      "type": "procedural",
      "date": "1964-01-01",
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "Settlement challenged in appeal before Board of Revenue.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "Hazarika, as holder of firewood mahal licence and forest contractor, illegally felled green trees and converted to firewood (entitled only to dead/fallen trees); detected by Forest Beat Officer of Dibru Reserve.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Hazarika paid compensation of Rs. 50 to compound the forest offence.",
      "type": "material",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f9",
      "text": "Hazarika filed affidavit before Board stating mistake by labourers in collecting broken/fallen green trees in his absence.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f10",
      "text": "Board of Revenue not satisfied with explanation, held compounding did not clear conduct; forest mahals and excise shops under different rules; settling authority under Executive Instruction III to consider moral character and conduct.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Board set aside settlement with Hazarika, deeming him unsuitable.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "High Court quashed Board's order, holding compounding under Forest Regulation equivalent to acquittal under s.345(6) CrPC, so Board could not consider conduct.",
      "type": "procedural",
      "date": "1964-01-24",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the High Court was right in quashing the order of the Board of Revenue on the ground that the very basis on which the appellate order of the Board was founded did not exist and that the Board had gone wrong in taking into consideration the compounding of an offence under the Forest Regulation by the respondent as affecting his suitability for settlement of an excise shop.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Section 345(6) of CrPC has no application to offences under Assam Forest Regulation; sub-s.5 of s.3 defines forest offence; s.62(1) empowers Forest Officer to accept compensation, but payment does not wipe out wrongful conduct or have effect of acquittal; accepts truth of charge, does not clear character.",
      "supporting_facts": [
        "f7",
        "f8",
        "f10"
      ],
      "legal_basis": "Assam Forest Regulation VII of 1891 ss.3(5), 62(1),(2); CrPC s.345(1),(2),(6)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Compounding under s.62 Assam Forest Regulation has effect like acquittal under s.345(6) CrPC; no stigma or moral turpitude; trivial offences once compounded not to be raked up; protects from further proceedings.",
      "supporting_facts": [
        "f8",
        "f9"
      ],
      "legal_basis": "Assam Forest Regulation ss.58,59,62; CrPC s.345(6); precedents: Chandanmal v. Rupakula Ramkrishnayya; Reg. v. Rahimat"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "S.345 CrPC applies only to specified offences; compounding under s.62 Assam Forest Regulation empowers acceptance of compensation but does not use 'compounding'; payment avoids proceedings but accepts charge, does not vindicate character or equate to acquittal without express provision.",
      "addresses_issue": "i1",
      "key_observation": "Mere rendering of compensation does not amount to vindication of character unless expressly provided."
    },
    {
      "id": "cr2",
      "text": "Board competent to consider conduct under Executive Instruction III for suitability in excise shop settlement; different from forest mahals.",
      "addresses_issue": "i1",
      "key_observation": "Board consistently held conduct valid consideration."
    },
    {
      "id": "cr3",
      "text": "High Court erred in law; no error apparent on face of record or excess of jurisdiction by Board; certiorari not substitute for appeal.",
      "addresses_issue": "i1",
      "key_observation": "Powers of appellate authority co-extensive with primary authority."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Compounding under s.62 Assam Forest Regulation does not have effect of acquittal under s.345(6) CrPC; does not preclude consideration of conduct for suitability in excise shop settlement.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Nagendra Nath Bora v. Commissioner of Hills Division and Appeals, Assam",
      "citation": "1958 S.C.R. 1240",
      "treatment": "followed",
      "relevance": "Appellate authority powers co-extensive with primary; certiorari for excess of jurisdiction or error of law apparent on record, not every error."
    },
    {
      "case_name": "Chandanmal v. Rupakula Ramkrishnayya",
      "citation": "A.I.R. 1942 Mad. 173",
      "treatment": "referred",
      "relevance": "Agreement to compound under s.345(1) CrPC not violation of law or public policy (in respondent's argument)."
    },
    {
      "case_name": "Reg. v. Rahimat",
      "citation": "I.L.R. 1 Bom. 147",
      "treatment": "referred",
      "relevance": "Trivial wrongs redressable by compensation without stigma (in respondent's argument)."
    }
  ],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Article 226"
      ],
      "relevance": "High Court writ jurisdiction invoked to quash Board's order."
    },
    {
      "name": "Assam Forest Regulation VII of 1891",
      "sections": [
        "s.3(5)",
        "s.58",
        "s.59",
        "s.62(1),(2)"
      ],
      "relevance": "Defines forest offence; empowers compounding by compensation for minor offences; payment discharges suspect, releases property, no further proceedings, but no acquittal effect."
    },
    {
      "name": "Code of Criminal Procedure",
      "sections": [
        "s.345(1)",
        "s.345(2)",
        "s.345(6)"
      ],
      "relevance": "Compounding specified offences has effect of acquittal; not applicable to forest offences."
    },
    {
      "name": "Executive Instructions (Excise)",
      "sections": [
        "Instruction III"
      ],
      "relevance": "Settling authority to consider moral character and conduct of tenderer for excise shops."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; High Court order set aside; Board of Revenue's appellate order restored.",
    "relief_granted": "Restoration of Board's order setting aside settlement with Hazarika.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"the fact of Hazarika having compounded the offence did not clear his conduct although he had succeeded in getting a subsequent settlement of a forest mahal.\"",
      "speaker": "court",
      "significance": "Board's view on compounding not exonerating conduct upheld."
    },
    {
      "text": "\"In effect the payment of compensation amounts to his acceptance of the truth of the charge against him.\"",
      "speaker": "court",
      "significance": "Core reasoning distinguishing forest compounding from CrPC acquittal."
    },
    {
      "text": "\"The High Court, therefore, was not right in coming to the conclusion that the effect of s.62 of the Assam Regulation was the same as that of s.345(6) of the Criminal Procedure Code.\"",
      "speaker": "court",
      "significance": "Directly resolves the sole issue against High Court."
    }
  ],
  "_case_id": "1966_47",
  "_label": 1,
  "_text_length": 14691,
  "_extracted_at": "2026-02-10T19:38:51.091013"
}