{
  "metadata": {
    "case_name": "Uttar Pradesh Co-operative Federation Limited v. Sunder Brothers",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "Ramaswami, J."
    ],
    "case_number": "Civil Appeal No. 426 of 1964",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The Uttar Pradesh Co-operative Federation Limited (Society) was registered under the Co-operative Societies Act No. II of 1912 at Lucknow and was carrying on the business of plying public carriers on Kanpur-Delhi route with permits for seven vehicles granted by Uttar Pradesh Government and Delhi Administration.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "In March 1954, the Society entered into an agreement with the plaintiffs (M/s Sunder Brothers) through Bimal Kumar Jain and Dhan Kumar Jain appointing them as Managing Agents for carrying on the business as public carriers. Terms embodied in letter dated March 2, 1954 by Secretary of the Society.",
      "type": "material",
      "date": "1954-03-02",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Clause 28 of the agreement: In the event of any dispute regarding terms and conditions of agreement or appointment as Managing Agents or any matter arising therefrom or relating thereto or subject matter thereof, such dispute shall be decided by arbitration as provided under Co-operative Societies Act II of 1912 and parties agree to be bound thereby.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Agreement was to last for three years but on July 5, 1954, the Society terminated the agreement by letter dated July 5, 1954.",
      "type": "material",
      "date": "1954-07-05",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Plaintiffs brought suit on August 18, 1954 in Court of Subordinate Judge, First Class, Delhi praying for declaration that termination was illegal and plaintiffs entitled to continue as Managing Agents, and mandatory injunction restraining Society from terminating agreement.",
      "type": "procedural",
      "date": "1954-08-18",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Society made application under S.34 of Indian Arbitration Act, 1940 before Subordinate Judge, Delhi for stay of suit, claiming dispute to be adjudicated under S.51 of Co-operative Societies Act by Registrar, or alternatively by arbitration per agreement.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Trial court stayed proceedings; on plaintiffs' appeal, appellate court set aside stay and dismissed Society's application under S.34.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Society moved Punjab High Court in revision (Civil Revision No. 311-D of 1958); High Court dismissed revision on February 22, 1962, confirmed appellate court's order.",
      "type": "procedural",
      "date": "1962-02-22",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Appeal by special leave to Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Suit filed in 1954; by time of Supreme Court hearing, 12 years elapsed with nothing done in suit.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Respondent alleged Registrar of Co-operative Societies is ex-officio President of Society, approved termination of agreement, and is chief controlling and supervising officer under bye-laws.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the lower courts rightly exercised jurisdiction under S.34 of Indian Arbitration Act in not granting stay of suit proceedings.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether arbitration under Clause 28 is statutory arbitration under S.46 or agreement under S.47 of Indian Arbitration Act.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether there is sufficient reason not to refer matter to arbitration, including apprehension of bias by Registrar as arbitrator.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Arbitration under cl.28 is not statutory but parties agreed to abide by Co-operative Societies Act provisions; thus S.47 of Arbitration Act applies, not S.46.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": "Indian Arbitration Act S.47; Co-operative Societies Act"
    },
    {
      "id": "pa2",
      "text": "Lower courts erred in not granting stay under S.34; procedure under Co-op Rules not inconsistent with Arbitration Act.",
      "supporting_facts": [
        "f6",
        "f7",
        "f8"
      ],
      "legal_basis": "Indian Arbitration Act S.34"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Arbitration under cl.28 is statutory under Co-op Act, attracting S.46 Arbitration Act; difficult for arbitrator to determine consistent rules.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": "Indian Arbitration Act S.46"
    },
    {
      "id": "ra2",
      "text": "Registrar may not act fairly as he is ex-officio President, approved termination, and controls Society; improper for him to arbitrate.",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": "Indian Arbitration Act S.34"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "High Court's reasoning has substance: difficult for arbitrator to identify which Co-op Rules consistent with Arbitration Act.",
      "addresses_issue": "i2",
      "key_observation": "Reasoning of High Court has much substance."
    },
    {
      "id": "cr2",
      "text": "Even if stay not granted earlier, now after 12 years delay, not in interest of speedy disposal to further proceed without stay.",
      "addresses_issue": "i1",
      "key_observation": "12 years elapsed since 1954 suit with nothing done."
    },
    {
      "id": "cr3",
      "text": "Under Co-op Rules 115-117, reference to Registrar who may decide himself or appoint arbitrators; Registrar's role as President and approver of termination raises apprehension of bias.",
      "addresses_issue": "i3",
      "key_observation": "Good ground for apprehending arbitrator will not act fairly."
    },
    {
      "id": "cr4",
      "text": "S.34 discretion not to be interfered lightly by appellate court unless trial court acted unreasonably; High Court properly exercised discretion in refusing stay.",
      "addresses_issue": "i1",
      "key_observation": "Appellant has not made out case for interference."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Order of stay under S.34 not to be granted if good ground to apprehend arbitrator will not act fairly or improper for him to arbitrate.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Appellate court slow to interfere with lower court's S.34 discretion unless exercised unreasonably.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Bristol Corporation v. John And Co.",
      "citation": "1913 A.C. 241",
      "treatment": "followed",
      "relevance": "Engineer as arbitrator also witness creates sufficient reason not to stay; apprehension of bias justifies no stay."
    },
    {
      "case_name": "Charles Osenton Co. v. Johnston",
      "citation": null,
      "treatment": "referred",
      "relevance": "Principles on appellate interference with discretionary orders."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Arbitration Act, 1940",
      "sections": [
        "Section 34",
        "Section 46",
        "Section 47"
      ],
      "relevance": "Governs stay of proceedings; applicability to statutory vs. agreement arbitrations under Co-op Act."
    },
    {
      "name": "Co-operative Societies Act, 1912",
      "sections": [
        "Section 51",
        "Rules 115",
        "Rule 116",
        "Rule 117"
      ],
      "relevance": "Provides for arbitration of disputes; procedure for reference to Registrar or arbitrators."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court dismissed the appeal by special leave, upheld High Court's order refusing stay of suit proceedings under S.34 of Arbitration Act, confirming that proceedings should continue in court due to apprehension of bias in arbitration and proper exercise of discretion by lower courts.",
    "relief_granted": "None to appellant; suit to proceed.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"it would be a difficult task for the arbitrator to investigate as to which of the rules made under the Co-operative Societies Act are consistent with and which of those rules are not consistent with the provisions of the Indian Arbitration Act\"",
      "speaker": "court",
      "significance": "High Court's reasoning upheld as having substance for refusing stay."
    },
    {
      "text": "\"an order of stay of suit under s. 34 of the Indian Arbitration Act will not be granted if it can be shown that there is good ground for apprehending that the arbitrator will not act fairly\"",
      "speaker": "court",
      "significance": "Key principle applied to deny stay due to Registrar's potential bias."
    },
    {
      "text": "\"the appellant has made out no case for our interference with the order of the High Court refusing stay of the proceedings\"",
      "speaker": "court",
      "significance": "Final holding dismissing appeal."
    }
  ],
  "_case_id": "1966_100",
  "_label": 0,
  "_text_length": 19290,
  "_extracted_at": "2026-02-10T19:39:32.995655"
}