{
  "metadata": {
    "case_name": "Appellant v. State",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "Ramaswami, J."
    ],
    "case_number": "Criminal Appeal No. 157 of 1964",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The appellant was employed as Assistant Director Enforcement, Government of India, Ministry of Commerce at Kanpur and used to deal with matters regarding the cancellation of licences of cloth dealers at Kanpur.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On or about September 5, 1951 the appellant received a confidential letter dated August 30, 1951 from the District Magistrate, Kanpur.",
      "type": "material",
      "date": "1951-09-05",
      "source": "prosecution"
    },
    {
      "id": "f3",
      "text": "On the same date [September 5, 1951] the appellant called one Ram Lal Kapoor who was the legal adviser of New Victoria Mills Ltd. at his house. The appellant showed him the letter of the District Magistrate and on the strength of that letter he demanded through Ram Lal Kapoor a bribe of Rs. 30,000 from Sidh Gopal for saving his licence from being cancelled.",
      "type": "material",
      "date": "1951-09-05",
      "source": "prosecution"
    },
    {
      "id": "f4",
      "text": "Sidh Gopal was a partner of various firms dealing in cloth and it was suspected that these firms were indulging in black-marketing in cloth.",
      "type": "background",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f5",
      "text": "Sidh Gopal came to the appellant on September 9, 1951 to talk over the matter and the appellant made the same demand of bribe from him.",
      "type": "material",
      "date": "1951-09-09",
      "source": "prosecution"
    },
    {
      "id": "f6",
      "text": "On September 11, 1951, the appellant is alleged to have agreed with Ram Lal Kapoor to receive a sum of Rs. 10,000 as first instalment of the bribe from Sidh Gopal through Ram Lal Kapoor.",
      "type": "material",
      "date": "1951-09-11",
      "source": "prosecution"
    },
    {
      "id": "f7",
      "text": "Accordingly on September 11, 1951 at about 8 p.m. the appellant went to the house of Ram Lal Kapoor and accepted the bribe of Rs. 10,000 in currency notes and also a Than of long cloth from the said Ram Lal Kapoor undertaking that in lieu thereof the appellant would not report against Sidh Gopal and thereby save his licence from cancellation.",
      "type": "material",
      "date": "1951-09-11",
      "source": "prosecution"
    },
    {
      "id": "f8",
      "text": "A raid had been prearranged and the raiding party consisting of Shri Satish Chander P.W. 1 and Shri Onkar Singh P.W. 2, the District Magistrate and the Senior Superintendent of Police respectively were lying in wait at the premises of Ram Lal Kapoor.",
      "type": "procedural",
      "date": "1951-09-11",
      "source": "prosecution"
    },
    {
      "id": "f9",
      "text": "At about 9.45 p.m. the appellant came out of the bungalow of Ram Lal Kapoor and on the agreed signal being given, the raiding party came and on search of the appellant an amount of Rs. 10,000 was found from his person.",
      "type": "material",
      "date": "1951-09-11",
      "source": "prosecution"
    },
    {
      "id": "f10",
      "text": "At the time of the recovery of the money the appellant made a statement that the amount received by him was as a loan as he wanted to purchase a bungalow.",
      "type": "material",
      "date": "1951-09-11",
      "source": "prosecution"
    },
    {
      "id": "f11",
      "text": "The defence of the appellant was that he never negotiated with Ram Lal Kapoor or Sidh Gopal regarding the bribe but the appellant had been falsely implicated because he had prosecuted one Bhola Nath of the firm of Ms Mannulal Sidh Gopal under s. 7 of Essential Supplies Act and the District Magistrate had arrested Bhola Nath and kept him under detention under the powers conferred by the Preventive Detention Act. In order to take revenge for the arrest of Bhola Nath, Sidh Gopal and Ram Lal Kapoor had conspired together and falsely implicated the appellant.",
      "type": "disputed",
      "date": null,
      "source": "appellant"
    },
    {
      "id": "f12",
      "text": "Bhola Nath who was a Salesman of Ms Mannulal Sidh Gopal was arrested in August, 1951 on the report of the appellant.",
      "type": "background",
      "date": "1951-08",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "The appellant was tried for offences under s. 161, Indian Penal Code and s. 5(2) read with s. 5(1)(d) of the Prevention of Corruption Act by special Judge, Anti-Corruption, Lucknow who by his judgment dated January 8, 1962 convicted the appellant and sentenced him to three years rigorous imprisonment and a fine of Rs. 2,000. In default for payment of fine the appellant was further ordered to undergo rigorous imprisonment for one year.",
      "type": "procedural",
      "date": "1962-01-08",
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "The appellant preferred an appeal to the Allahabad High Court, Lucknow Bench, which dismissed the appeal by its judgment dated March 20, 1964 and affirmed the conviction and sentence imposed by the Special Judge upon the appellant.",
      "type": "procedural",
      "date": "1964-03-20",
      "source": "lower_court"
    },
    {
      "id": "f15",
      "text": "This appeal is brought, by special leave, from the judgment of the Allahabad High Court, Lucknow Bench.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f16",
      "text": "The Special Judge disbelieved the case of the appellant and held that the prosecution evidence sufficiently established the charges under S. 161, Indian Penal Code and S. 5(2) read with s. 5(1)(d) of the Prevention of Corruption Act. The findings of the trial court have been affirmed by the Allahabad High Court in appeal which also rejected the case of the appellant as untrue and held that the amount of Rs. 10,000 was received by the appellant from Ram Lal Kapoor by way of illegal gratification and not as a loan for purchasing a house.",
      "type": "admitted",
      "date": null,
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether a presumption under sub-s. (1) of S. 4 of the Prevention of Corruption Act arises.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "What is the burden of proof placed upon the accused person against whom the presumption is drawn under S. 4(1) of the Prevention of Corruption Act.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether the charges under s. 161, Indian Penal Code and s. 5(2) read with s. 5(1)(d) of the Prevention of Corruption Act have been proved against the appellant.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The circumstances found by the High Court in their totality do not establish that the appellant accepted the amount of Rs. 10,000 as illegal gratification and not as a loan.",
      "supporting_facts": [
        "f10",
        "f11"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "The appellant had adduced sufficient evidence to show that the amount was really given to him as a loan by Ram Lal Kapoor.",
      "supporting_facts": [
        "f10"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Ram Lal Kapoor was likely to lend Rs. 10,000 without formal document; appellant executed a hand-note or granted a receipt.",
      "supporting_facts": [
        "f10"
      ],
      "legal_basis": null
    },
    {
      "id": "pa4",
      "text": "Duty of District Magistrate and Senior Superintendent of Police to search Ram Lal Kapoor's bungalow for the receipt; failure proves appellant's case.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": null
    },
    {
      "id": "pa5",
      "text": "No panchanama prepared; no independent witness at search.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": null
    },
    {
      "id": "pa6",
      "text": "District Magistrate related to Sidh Gopal; evidence of DM, SSP, Sidh Gopal not reliable.",
      "supporting_facts": [
        "f2",
        "f8",
        "f9"
      ],
      "legal_basis": null
    },
    {
      "id": "pa7",
      "text": "High Court improperly considered statement of Ram Lal Kapoor from departmental proceeding.",
      "supporting_facts": [
        "f16"
      ],
      "legal_basis": null
    },
    {
      "id": "pa8",
      "text": "Statements Exs. P-3 and P-4 barred by s.162 CrPC.",
      "supporting_facts": [
        "f10"
      ],
      "legal_basis": "s.162 CrPC"
    },
    {
      "id": "pa9",
      "text": "Evidence of Sidh Gopal unreliable as appellant received letter on Sept 5, 1951, unlikely to contact on Aug 18/19.",
      "supporting_facts": [
        "f2",
        "f5"
      ],
      "legal_basis": null
    },
    {
      "id": "pa10",
      "text": "Appellant 66 years old, offence in 1951, proceedings protracted 15 years; reduce sentence.",
      "supporting_facts": [],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Statements Exs. P-3 and P-4 admissible as made to District Magistrate not police officer and before FIR on September 13, 1951 at 8:30 p.m.",
      "supporting_facts": [
        "f10"
      ],
      "legal_basis": "s.162 CrPC"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "In order to raise the presumption under sub-s. (1) of S. 4 what the prosecution has to prove is that the accused person has received gratification other than legal remuneration and when it is shown that he has received a certain sum of money which was not a legal remuneration, then the condition prescribed by this section is satisfied and the presumption thereunder must be raised. Mere receipt of the money was sufficient to raise a presumption under the sub-section.",
      "addresses_issue": "i1",
      "key_observation": "Requirements of sub-s. (1) of S. 4 fulfilled; presumption raised."
    },
    {
      "id": "cr2",
      "text": "Where the burden of an issue lies upon the accused, he is not required to discharge that burden by leading evidence to prove his case beyond a reasonable doubt... It is sufficient if the accused person succeeds in proving a preponderance of probability in favour of his case.",
      "addresses_issue": "i2",
      "key_observation": "Burden on accused is preponderance of probability, not beyond reasonable doubt."
    },
    {
      "id": "cr3",
      "text": "Having examined the findings of both the lower courts, we are satisfied that the appellant has not proved his case by the test of preponderance of probability and the lower courts rightly reached the conclusion that the amount was taken by the appellant not as a loan but as illegal gratification.",
      "addresses_issue": "i3",
      "key_observation": "Appellant failed to rebut presumption."
    },
    {
      "id": "cr4",
      "text": "Ram Lal Kapoor was not likely to lend a sum of Rs. 10,000 to the appellant without getting a formal document executed... The statement of the appellant was highly belated and the District authorities were justified in not making a search and ransacking the whole bungalow of Ram Lal Kapoor for the recovery of the alleged receipt.",
      "addresses_issue": "i3",
      "key_observation": "Defence of loan rejected."
    },
    {
      "id": "cr5",
      "text": "All the circumstances have been taken into account by the High Court in discussing the testimony of these witnesses and ordinarily it is not permissible for the appellant to reopen conclusions of fact in this Court, especially when both the lower Courts have agreed with those conclusions which relate to the credibility of witnesses.",
      "addresses_issue": "i3",
      "key_observation": "No interference with credibility findings."
    },
    {
      "id": "cr6",
      "text": "The High Court has properly held that the evidence of Ram Lal Kapoor dated December 16, 1952-Ex. P-11-was not admissible and has excluded it from its consideration in discussing the guilt of the appellant.",
      "addresses_issue": "i3",
      "key_observation": "Statement not used for conviction."
    },
    {
      "id": "cr7",
      "text": "Even if [Exs. P-3 and P-4] are excluded from consideration there is sufficient evidence to support the conviction of the appellant on the charges.",
      "addresses_issue": "i3",
      "key_observation": "Conviction sustainable without them."
    },
    {
      "id": "cr8",
      "text": "This is a question regarding the credibility of Sidh Gopal and it is not open to the appellant to contest the finding of the lower courts with regard to the credibility of that witness in this appeal.",
      "addresses_issue": "i3",
      "key_observation": "No challenge to witness credibility."
    },
    {
      "id": "cr9",
      "text": "We do not consider that the sentence is excessive in the circumstances of the case.",
      "addresses_issue": "i3",
      "key_observation": "Sentence affirmed."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Presumption under s.4(1) Prevention of Corruption Act arises upon proof of receipt of gratification other than legal remuneration.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Accused under s.4(1) must rebut presumption by preponderance of probability, not beyond reasonable doubt.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Appellant failed to prove by preponderance of probability that Rs.10,000 was a loan; received as illegal gratification. Charges proved.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Dhanvantrai Balwantrai Desai v. State of Maharashtra",
      "citation": "A.I.R. 1964 S.C. 575",
      "treatment": "followed",
      "relevance": "Mere receipt of money sufficient to raise presumption under s.4(1) PC Act."
    },
    {
      "case_name": "C. I. Emden v. State of Uttar Pradesh",
      "citation": "A.I.R. 1960 S.C. 548",
      "treatment": "followed",
      "relevance": "Mere receipt of gratification or valuable thing raises presumption under s.4(1); no need to prove incriminating character."
    },
    {
      "case_name": "Woolmington v. Director of Public Prosecutions",
      "citation": "1935 A.C. 462",
      "treatment": "referred",
      "relevance": "Prosecution must prove guilt beyond reasonable doubt; statutory burdens on accused do not whittle this down."
    },
    {
      "case_name": "Rex v. Carr-Briant",
      "citation": "1943 1 K.B. 607",
      "treatment": "followed",
      "relevance": "Burden on accused under presumption is preponderance of probability."
    },
    {
      "case_name": "Harbhajan Singh v. State of Punjab",
      "citation": "1965 3 S.C.R. 235",
      "treatment": "referred",
      "relevance": "Approved ratio of Carr-Briant on burden of proof under presumption."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "s. 161"
      ],
      "relevance": "Offence of accepting gratification as motive or reward."
    },
    {
      "name": "Prevention of Corruption Act",
      "sections": [
        "s. 5(2)",
        "s. 5(1)(d)",
        "s. 4(1)"
      ],
      "relevance": "Criminal misconduct in discharge of official duty; presumption on acceptance of gratification."
    },
    {
      "name": "Criminal Procedure Code",
      "sections": [
        "s. 162"
      ],
      "relevance": "Statements to police during investigation inadmissible; disputed applicability."
    },
    {
      "name": "Essential Supplies Act",
      "sections": [
        "s. 7"
      ],
      "relevance": "Prosecution of Bhola Nath leading to defence of false implication."
    },
    {
      "name": "Preventive Detention Act",
      "sections": [],
      "relevance": "Arrest of Bhola Nath under its powers."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal by special leave against the Allahabad High Court judgment affirming conviction and sentence by Special Judge under s.161 IPC and s.5(2) r/w s.5(1)(d) PC Act is dismissed. Courts below rightly raised presumption under s.4(1) PC Act and appellant failed to rebut it by preponderance of probability. Conviction and sentence of 3 years RI and Rs.2000 fine (default 1 year RI) affirmed.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "mere receipt of the money was sufficient to raise a presumption under the sub-section.",
      "speaker": "court",
      "significance": "Confirms conditions for s.4(1) presumption."
    },
    {
      "text": "It is sufficient if the accused person succeeds in proving a preponderance of probability in favour of his case.",
      "speaker": "court",
      "significance": "Defines standard for accused to rebut presumption."
    },
    {
      "text": "the onus on an accused person may well be compared to the onus on a party in civil proceedings.",
      "speaker": "court",
      "significance": "Analogizes burden to civil test of probabilities."
    }
  ],
  "_case_id": "1966_17",
  "_label": 0,
  "_text_length": 19102,
  "_extracted_at": "2026-02-10T19:39:02.005941"
}