{
  "metadata": {
    "case_name": "Appellant Company v. Income Tax Authorities",
    "case_year": 1949,
    "court": "Supreme Court of India",
    "judges": [
      "Bhargava, J."
    ],
    "case_number": null,
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The appellant is a public limited company carrying on the business of manufacturing and selling cloth and other textile goods.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "During the previous year ending on 31st December, 1948, corresponding to the assessment year 1949-50, the appellant entered into two contracts with two other parties for purchase of textile machinery in order to expand its factory.",
      "type": "material",
      "date": "1948-12-31",
      "source": "appellant"
    },
    {
      "id": "f3",
      "text": "Subsequently, the appellant-company, having regard to altered circumstances, decided to cancel both the contracts as, in its opinion, the machinery to be purchased would not be required for its business.",
      "type": "material",
      "date": null,
      "source": "appellant"
    },
    {
      "id": "f4",
      "text": "On cancellation of these contracts, the appellant had to pay a sum of Rs. 15,000 as compensation to one of the contracting parties and Rs. 20,000 to the other contracting party who demanded compensation for breach of contract.",
      "type": "material",
      "date": null,
      "source": "appellant"
    },
    {
      "id": "f5",
      "text": "The appellant claimed that these amounts were paid in the interest of its business as, otherwise, the appellant would have had to purchase very costly machinery which would not have served any useful purpose, so that this was an expenditure incurred by the company wholly and exclusively for the purpose of its business.",
      "type": "admitted",
      "date": null,
      "source": "appellant"
    },
    {
      "id": "f6",
      "text": "The deduction thus claimed under section 10(2)(xv) of the Income-tax Act was disallowed by the Income-tax Officer.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "That order was upheld by the Appellate Assistant Commissioner and the Income-tax Appellate Tribunal.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "On an application under section 66(1) of the Income-tax Act, the Tribunal referred the following question for the opinion of the High Court at Allahabad: 'Whether, on the facts of the case, the payment of compensation amounting to Rs. 35,000 has been rightly disallowed as capital expenditure within the meaning of section 10(2)(xv) of the Income-tax Act, 1922?'",
      "type": "procedural",
      "date": null,
      "source": "tribunal"
    },
    {
      "id": "f9",
      "text": "The High Court answered the question against the appellant and upheld the order of the Tribunal.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "The appellant has come up to this court in this appeal by special leave.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "On the facts put forward by the appellant itself and accepted by the Tribunal and the High Court.",
      "type": "admitted",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether, on the facts of the case, the payment of compensation amounting to Rs. 35,000 has been rightly disallowed as capital expenditure within the meaning of section 10(2)(xv) of the Income-tax Act, 1922?",
      "framed_by": "tribunal"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "These amounts were paid in the interest of its business as, otherwise, the appellant would have had to purchase very costly machinery which would not have served any useful purpose, so that this was an expenditure incurred by the company wholly and exclusively for the purpose of its business.",
      "supporting_facts": [
        "f2",
        "f3",
        "f4",
        "f5"
      ],
      "legal_basis": "section 10(2)(xv) of the Income-tax Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The payment of compensation amounting to Rs. 35,000 has been rightly disallowed as capital expenditure within the meaning of section 10(2)(xv) of the Income-tax Act, 1922.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": "section 10(2)(xv) of the Income-tax Act, 1922"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "On the facts put forward by the appellant itself and accepted by the Tribunal and the High Court, it is clear that the sum of Rs. 35,000 claimed as deduction under section 10(2)(xv) was really paid for breach of contracts in respect of purchase of textile machinery which would have been a capital asset.",
      "addresses_issue": "i1",
      "key_observation": "The payment was made to avoid a larger capital expenditure that would not have served the interests of the appellant-company."
    },
    {
      "id": "cr2",
      "text": "Such a payment made is clearly in the nature of a capital expenditure and not an expenditure incurred wholly or exclusively for the purpose of the business.",
      "addresses_issue": "i1",
      "key_observation": "The payment was neither made for the purpose of earning profits, nor for the purpose of furthering, protecting or continuing its business which was to be carried on from day to day."
    },
    {
      "id": "cr3",
      "text": "The payment was made with the object of avoiding an unnecessary investment in capital assets, and was an amount which was altogether outside the account of profits and gains, in the computation of which deductions are allowable for expenditure incurred wholly and exclusively for earning those profits and gains.",
      "addresses_issue": "i1",
      "key_observation": "It is, therefore, clear that this amount could not have been claimed as a legitimate deduction under section 10(2)(xv) of the Income-tax Act."
    },
    {
      "id": "cr4",
      "text": "Our view is supported by the observations of Rowlatt J. in Countess Warwick Steamship Co. Ltd. v. Ogg.",
      "addresses_issue": "i1",
      "key_observation": "Precedent supports the classification as capital expenditure."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The payment of Rs. 35,000 is capital expenditure and not allowable as a deduction under section 10(2)(xv) of the Income-tax Act, 1922.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Countess Warwick Steamship Co. Ltd. v. Ogg",
      "citation": null,
      "treatment": "followed",
      "relevance": "Observations of Rowlatt J. support the view that the payment is capital expenditure."
    }
  ],
  "statutes_cited": [
    {
      "name": "Income-tax Act, 1922",
      "sections": [
        "10(2)(xv)",
        "66(1)"
      ],
      "relevance": "Deduction claimed under s.10(2)(xv) disallowed as capital expenditure; reference under s.66(1)."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court upheld the High Court's answer against the appellant, confirming that the Rs. 35,000 compensation payment is capital expenditure not deductible under section 10(2)(xv) of the Income-tax Act, 1922.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "Such a payment made is clearly in the nature of a capital expenditure and not an expenditure incurred wholly or exclusively for the purpose of the business.",
      "speaker": "court",
      "significance": "Core reasoning classifying the payment as capital expenditure."
    },
    {
      "text": "The payment was made with the object of avoiding an unnecessary investment in capital assets, and was an amount which was altogether outside the account of profits and gains.",
      "speaker": "court",
      "significance": "Explains why deduction is not allowable under the Act."
    }
  ],
  "_case_id": "1966_173",
  "_label": 0,
  "_text_length": 3402,
  "_extracted_at": "2026-02-10T19:40:09.936812"
}