{
  "metadata": {
    "case_name": "Commissioner of War Profits Tax v. M/s Binodram Balchand",
    "case_year": 1965,
    "court": "Supreme Court of India",
    "judges": [
      "Sikri, J."
    ],
    "case_number": "Civil Appeal No. 225 of 1965",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Assessees were Managing Agents of Binod Mills Ltd., Ujjain, a private limited company carrying on business of manufacturing and selling textile goods in 1944.",
      "type": "background",
      "date": "1944",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Gwalior War Profits Tax Ordinance, Samvat 2001 promulgated by Ruler of Gwalior State, came into force on July 1, 1944, imposing tax on excess profits, originally for period July 1, 1944 to June 30, 1945, extended to June 30, 1946.",
      "type": "background",
      "date": "1944-07-01",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Assessees carried on Managing Agency business in Gwalior State during relevant period and submitted return for period July 1, 1944 to October 16, 1944.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Rs. 11,09,332 received by assessees on July 5, 1944, on account of dividend on shares of Binod Mills for the year 1943.",
      "type": "material",
      "date": "1944-07-05",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "War Profits Tax Officer by order dated July 9, 1951 included Rs. 11,09,332 in taxable income; view upheld by Appellate Assistant Commissioner and Commissioner.",
      "type": "procedural",
      "date": "1951-07-09",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Commissioner referred three questions to Madhya Pradesh High Court under s. 46 of Ordinance, including Question No. 1: Whether the dividend income of Rs. 11,09,332 received from Binod Mills was chargeable under the War Profits Tax?",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "High Court by judgment dated April 19, 1957 accepted first contention of assessees and answered Question No. 1 in their favour, did not deal with contentions 2 and 3.",
      "type": "procedural",
      "date": "1957-04-19",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Supreme Court by judgment dated December 20, 1961 set aside High Court judgment, answered first contention against assessees, remanded for consideration of other two contentions.",
      "type": "procedural",
      "date": "1961-12-20",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "High Court on remand by judgment dated September 6, 1962 accepted second contention of assessees and answered Question No. 1 in their favour.",
      "type": "procedural",
      "date": "1962-09-06",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Assessees' three contentions before High Court: (1) Holdings in Binod Mills were investments not connected with business; (2) Dividend income excluded under Explanation to Rule 3(1) of Schedule 1 as Binod Mills subject to Ordinance; (3) Dividend income for full accounting period Diwali 1943 to Diwali 1944 to be apportioned.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f11",
      "text": "Rule 3(1) of Schedule 1: Income received from investments included in profits unless no connection with business; Rule 3(2) deems income from investments in dealing businesses as profits.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Gwalior War Profits Tax Amendment Ordinance Samvat 2002 (Feb 28, 1946) added Explanation to Rule 3(2): Income from investments excludes dividends from company to whole of whose business Ordinance applies.",
      "type": "background",
      "date": "1946-02-28",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Gwalior War Profits Tax Amendment Ordinance Samvat 2004 (Sep 6, 1947) amended Explanation adding comma, deemed always in force from Ordinance's commencement.",
      "type": "background",
      "date": "1947-09-06",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the dividend income of Rs. 11,09,332 received from the Binod Mills was chargeable under the War Profits Tax?",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Explanation was not in existence at relevant time (July 1, 1944 to Oct 16, 1944) and cannot be considered.",
      "supporting_facts": [
        "f12",
        "f13"
      ],
      "legal_basis": "Gwalior War Profits Tax Ordinance Samvat 2001"
    },
    {
      "id": "pa2",
      "text": "Explanation is to Rule 3(2) only, not to Rule 3(1), so does not apply to general investments under Rule 3(1).",
      "supporting_facts": [
        "f11",
        "f12"
      ],
      "legal_basis": "Rule 3(1) and 3(2) of Schedule 1; Ordinance 2002"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Dividend income accrued from profits of Binod Mills Limited, to whole of whose business Ordinance applies, excluded under Explanation to Rule 3(1) of Schedule 1.",
      "supporting_facts": [
        "f4",
        "f10"
      ],
      "legal_basis": "Explanation to Rule 3 of Schedule 1, Gwalior War Profits Tax Ordinance Samvat 2001"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Explanation applies to computation of profits for chargeable period July 1, 1944 to Oct 16, 1944; reading Ordinance 2002 and 2004 together shows legislative intention for retrospectivity; Ordinance 2004 deems explanation in force from Ordinance's commencement.",
      "addresses_issue": "i1",
      "key_observation": "Legislative intention to make explanation retrospective clear from combined reading of amendments."
    },
    {
      "id": "cr2",
      "text": "Explanation meant for both Rule 3(1) and 3(2); words 'income from investments to be included... under this rule' comprehensive; no reason to distinguish; added below Rule 3(2) but applies generally.",
      "addresses_issue": "i1",
      "key_observation": "Language of explanation clear and applies to Rule 3(1)."
    },
    {
      "id": "cr3",
      "text": "High Court correctly held explanation applies on plain terms to exclude dividend from Binod Mills, subject to War Profits Tax, to avoid double taxation.",
      "addresses_issue": "i1",
      "key_observation": "Object is to avoid double taxation."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Dividend income of Rs. 11,09,332 from Binod Mills not chargeable under War Profits Tax; answer to Question No. 1 in negative.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Gwalior War Profits Tax Ordinance, Samvat 2001",
      "sections": [
        "s. 46",
        "Schedule 1 Rule 3(1)",
        "Schedule 1 Rule 3(2)"
      ],
      "relevance": "Imposed tax on excess profits; Rule 3 includes investment income unless no connection; reference under s.46"
    },
    {
      "name": "Gwalior War Profits Tax Amendment Ordinance, Samvat 2002",
      "sections": [
        "s. 2",
        "Explanation to Schedule 1 Rule 3(2)"
      ],
      "relevance": "Added Explanation excluding dividends from companies subject to Ordinance"
    },
    {
      "name": "Gwalior War Profits Tax Amendment Ordinance, Samvat 2004",
      "sections": [
        "s. 2"
      ],
      "relevance": "Amended Explanation deeming it in force from original Ordinance's date"
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court agreed with High Court on remand, held Explanation to Rule 3 applies retrospectively to chargeable period and covers dividend income under Rule 3(1); answered Question No. 1 in negative in favour of assessees.",
    "relief_granted": "Dividend income excluded from taxable income",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The language of the explanation is very plain, and it means that if income is received by way of dividends or profits from a company carrying on a business, to the whole of which the section of the Ordinance imposing the War Profits Tax applies, then the income has to be excluded...",
      "speaker": "court",
      "significance": "High Court observation adopted by SC on applicability of Explanation"
    },
    {
      "text": "If we read Ordinance 2002 and Ordinance 2004 together the legislative intention to make the explanation retrospective becomes clear.",
      "speaker": "court",
      "significance": "SC's key finding on retrospectivity"
    },
    {
      "text": "The words 'the income from investments to be included in the profits of the business under the provisions of this rule' are comprehensive and include income from investments both under r. 3(1) and r. 3(2).",
      "speaker": "court",
      "significance": "Explains why Explanation applies to Rule 3(1)"
    }
  ],
  "_case_id": "1966_103",
  "_label": 0,
  "_text_length": 12554,
  "_extracted_at": "2026-02-10T19:39:32.285526"
}