{
  "metadata": {
    "case_name": "Appellant Company v. Respondent",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "Shah, J."
    ],
    "case_number": "Civil Appeal No. 235 of 1963",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "In computing the total earned income of the appellant Company for the calendar year 1959, the Income-tax Officer, Trivandrum, disallowed a claim for deduction of Rs. 80,255/- in respect of liability for payment of tax under the Wealth Tax Act 27 of 1957 incurred by the Company for the calendar years 1957 and 1958.",
      "type": "material",
      "date": "1959",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The order disallowing the deduction was confirmed by the Appellate Assistant Commissioner and by the Appellate Tribunal.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On the question referred by the Wealth Tax Appellate Tribunal: Whether on the facts and circumstances of the case, the assessee Company is entitled to a deduction of Rs. 12,873/- being the wealth tax paid during the account year ended 29-2-1960 against the profits and gains of its business for the assessment year 1960-61 under Sec. 10(2)(xv) of the Indian Income-tax Act, the High Court of Kerala recorded an answer in the negative.",
      "type": "procedural",
      "date": "1963-08-26",
      "source": "lower_court"
    },
    {
      "id": "f4",
      "text": "The Company appealed to this Court with special leave.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether on the facts and circumstances of the case, the assessee Company is entitled to a deduction of Rs. 12,873/- being the wealth tax paid during the account year ended 29-2-1960 against the profits and gains of its business for the assessment year 1960-61 under Sec. 10(2)(xv) of the Indian Income-tax Act?",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether wealth-tax paid by the Company represented expenditure laid out wholly and exclusively for the purpose of its business, and on that account is a permissible allowance under s. 10(2)(xv) of the Income-tax Act.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Wealth-tax paid by it represented expenditure laid out wholly and exclusively for the purpose of its business, as for the purpose of its business, it holds assets and by the use of those assets profits are earned and therefore tax paid in respect of those assets is expenditure laid out for the purpose of the business.",
      "supporting_facts": [
        "f1",
        "f3"
      ],
      "legal_basis": "s. 10(2)(xv) of the Income-tax Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Wealth-tax is not deductible as it is a tax charged under S. 3 of the Wealth Tax Act, 1957, for every financial year in respect of the net wealth of every individual, Hindu undivided family and Company, and is not related to business or trading activity.",
      "supporting_facts": [
        "f1",
        "f3"
      ],
      "legal_basis": "Wealth Tax Act, 1957 s.3; Income-tax Act s.10(2)(xv)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Tax under the Wealth Tax Act is payable by all individuals, Hindu undivided families, and Companies on the value of taxable assets belonging to the taxpayer; it is charged on the net value of the assets, and not on the business or trading activity carried on by the taxpayer.",
      "addresses_issue": "i1",
      "key_observation": "The character of the tax is a tax charged upon the net wealth, and it is not made a tax related to or incidental to the carrying on of a business."
    },
    {
      "id": "cr2",
      "text": "An allowance permissible under cl. (xv) in the computation of taxable income is therefore expenditure incurred in the year of account in respect of a business carried on by the assessee; the expenditure must not be in the nature of capital expenditure or personal expenses of the assessee and it must have been laid out or expended wholly and exclusively for the purpose of the business.",
      "addresses_issue": "i1",
      "key_observation": "Whether an item of expenditure falls within that description has of necessity to be determined having regard to the nature of the business, the nature of the expenditure and the relation between the business and the expenditure."
    },
    {
      "id": "cr3",
      "text": "In adjudicating upon the claim that an outgoing is a permissible deduction under s. 10(2)(xv) of the Income-tax Act, the primary question is whether in the light of accepted commercial practice, trading principles and the relation between the business and the outgoing, the outgoing can be said to arise out of the carrying on of the business and to be incidental to that business.",
      "addresses_issue": "i1",
      "key_observation": "To be a permissible deduction, there must be a direct and intimate connection between the expenditure and the business i.e. between the expenditure and the character of the assessee as a trader, and not as owner of assets, even if they are assets of the business."
    },
    {
      "id": "cr4",
      "text": "The amount of tax paid on the net wealth of an assessee under the Wealth Tax Act is not a permissible deduction under s. 10(2)(xv) of the Indian Income-tax Act in his assessment to income-tax, for tax is imposed under the Wealth Tax Act on the owner of assets and not on any commercial activity.",
      "addresses_issue": "i1",
      "key_observation": "The charge of the tax is the same, whether the assets are part of or used in the trading organisation of the owner or are merely owned by him."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Wealth-tax paid is not a permissible deduction under s. 10(2)(xv) of the Income-tax Act as it is not expenditure laid out wholly and exclusively for the purpose of the business.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Commissioners of Inland Revenue v. The Anglo Brewing Company Ltd.",
      "citation": "12 T.C. 803",
      "treatment": "referred",
      "relevance": "Expression 'for the purpose of the trade' meant for the purpose of keeping the trade going, and of making it pay."
    },
    {
      "case_name": "Smith v. Lion Brewery Company Ltd.",
      "citation": "5 C. 568",
      "treatment": "referred",
      "relevance": "Brewery Company entitled to allowance of Compensation Fund Charges imposed on tenants, recouped from rents, as part of business."
    },
    {
      "case_name": "Ushers Wiltshire Brewery Ltd. v. Bruce",
      "citation": "6 T.C. 399",
      "treatment": "referred",
      "relevance": "Expenses in connection with licensed houses owned/lesed by brewery company allowed as incidental to business."
    },
    {
      "case_name": "Harrods (Buenos Aires) Ltd. v. Taylor-Gooby",
      "citation": "1 C. 450",
      "treatment": "referred",
      "relevance": "Substitute tax paid to Argentina Government deductible as expenditure without which business could not be carried on."
    },
    {
      "case_name": "Strong and Company of Romsey Ltd. v. Woodifield",
      "citation": "5 T.C. 215",
      "treatment": "followed",
      "relevance": "Damages for injury not deductible; only losses connected in the sense that they are really incidental to the trade itself."
    },
    {
      "case_name": "Badridas Daga v. Commissioner of Income-tax",
      "citation": "1959 S.C.R. 690 : 34 I.T.R. 10",
      "treatment": "followed",
      "relevance": "Expenditure admissible if it arises out of the carrying on of the business and be incidental to it."
    },
    {
      "case_name": "Commissioner of Income-tax, Bombay v. Abdullabhai Abdulkadar",
      "citation": "1961 2 S.C.R. 949 : 41 I.T.R. 545",
      "treatment": "followed",
      "relevance": "Reaffirmed that expenditure must arise out of carrying on business and be incidental."
    },
    {
      "case_name": "Commissioner of Income-tax, Kerala v. Malayalam Plantations Ltd.",
      "citation": "1964 7 S.C.R. 693 : 53 I.T.R. 140",
      "treatment": "followed",
      "relevance": "Estate duty not deductible; expenditure must be for carrying on business in capacity as trader, not owner of assets."
    }
  ],
  "statutes_cited": [
    {
      "name": "Wealth Tax Act, 1957",
      "sections": [
        "S. 3",
        "Schedule (Second Schedule, r. 5)"
      ],
      "relevance": "Tax charged on net wealth of individuals, HUFs, companies; not related to business activity; special provisions for companies link to profits but do not alter character."
    },
    {
      "name": "Indian Income-tax Act",
      "sections": [
        "s. 10(2)(xv)"
      ],
      "relevance": "Permissible allowance for expenditure laid out wholly and exclusively for purpose of business, not capital or personal."
    },
    {
      "name": "Estate Duty Act, 1953",
      "sections": [
        "s. 84"
      ],
      "relevance": "Referenced in Malayalam Plantations case for non-deductibility of estate duty."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court dismissed the appeal, affirming the Kerala High Court's negative answer that the assessee Company is not entitled to deduct wealth tax paid under s. 10(2)(xv) of the Income-tax Act.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"Tax is imposed under the Wealth Tax Act on the owner of assets and not on any commercial activity.\"",
      "speaker": "court",
      "significance": "Core holding distinguishing wealth tax from business expenditure."
    },
    {
      "text": "\"To be a permissible deduction, there must be a direct and intimate connection between the expenditure and the business ie. between the expenditure and the character of the assessee as a trader, and not as owner of assets, even if they are assets of the business.\"",
      "speaker": "court",
      "significance": "Defines test for deductibility under s.10(2)(xv)."
    },
    {
      "text": "\"The expression 'for the purpose of the business' is wider in scope than the expression 'for the purpose of earning profits'... The purpose shall be for the purpose of the business, that is to say, the expenditure incurred shall be for the carrying on of the business and the assessee shall incur it in his capacity as a person carrying on the business.\"",
      "speaker": "court",
      "significance": "Expands on scope from Malayalam Plantations precedent."
    }
  ],
  "_case_id": "1966_142",
  "_label": 0,
  "_text_length": 14692,
  "_extracted_at": "2026-02-10T19:40:13.492276"
}