{
  "metadata": {
    "case_name": "Appellant v. State",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "Ramaswami, J."
    ],
    "case_number": "Criminal Appeals Nos. 130 and 131 of 1964",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant was elected President of the Nerinjipet Panchayat Board on May 17, 1958. At that time he was a duly elected member of the Board.",
      "type": "background",
      "date": "1958-05-17",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "A sum of Rs. 4,000 of the Board had been invested in four National Plan Savings Certificates in the Bhavani Post Office.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Appellant allegedly cashed the certificates on February 11, 1959 and did not bring the amount in the account books of the Panchayat Board.",
      "type": "disputed",
      "date": "1959-02-11",
      "source": "prosecution"
    },
    {
      "id": "f4",
      "text": "Defence of the appellant: He signed the certificates and handed them over to P.W. 4, the Deputy Panchayat Officer, because P.W. 4 approached him and asked the Board to subscribe through him for small savings certificates for Rs. 7,000 just as the Panchayat had subscribed Rs. 7,000 through Tass liar representing the Revenue Department.",
      "type": "admitted",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "P.W. 4 got Rs. 500 in cash on December 2, 1958 and a cheque for Rs. 2,500 on February 9, 1959.",
      "type": "material",
      "date": "1958-12-02",
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "Appellant endorsed the National Plan Savings Certificates and handed them over to P.W. 4 to cash them along with Rs. 3,000 and purchase small savings certificates for Rs. 7,000, that being his quota from the Nerinjipet Panchayat.",
      "type": "disputed",
      "date": "1959-02-11",
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "Sub-Divisional Magistrate, Erode acquitted the appellant as not satisfied prosecution proved the charge.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Madras High Court in Criminal Appeal No. 380 of 1961 dated December 3, 1963 convicted appellant under s. 409 IPC and sentenced to rigorous imprisonment for one year (Appeal No. 130 of 1964).",
      "type": "procedural",
      "date": "1963-12-03",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Madras High Court in Criminal Appeal No. 72 of 1962 dated December 3, 1963 convicted appellant under s. 409 IPC and sentenced to rigorous imprisonment for 6 months (Appeal No. 131 of 1964).",
      "type": "procedural",
      "date": "1963-12-03",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Sanction for prosecution given by the Collector under powers purportedly delegated under s. 127 of Madras Village Panchayats Act, not by Government.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Appellant had ceased to hold the office of President when prosecution was launched.",
      "type": "background",
      "date": null,
      "source": "high_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the sanction of the Government under s. 106 of the Madras Village Panchayats Act is necessary for the prosecution of the appellant for the offence under s. 409, Indian Penal Code.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Prosecution not maintainable for want of sanction by the State Government under s. 106 of the Madras Village Panchayats Act.",
      "supporting_facts": [
        "f10"
      ],
      "legal_basis": "s. 106 Madras Village Panchayats Act"
    },
    {
      "id": "pa2",
      "text": "Sanction granted by the Collector was not valid in law and sanction should have been given under s. 106 by the State Government.",
      "supporting_facts": [
        "f10",
        "f11"
      ],
      "legal_basis": "s. 106 and s. 127 Madras Village Panchayats Act"
    },
    {
      "id": "pa3",
      "text": "s. 127(1) of the Madras Act has not authorised the Government to delegate the power for granting sanction under s. 106 to the Collector, as delegation was for powers in regard to any panchayat but s. 106 power is in regard to the President or member.",
      "supporting_facts": [
        "f10"
      ],
      "legal_basis": "s. 127(1) Madras Village Panchayats Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "No sanction of the Government was necessary as the appellant had ceased to hold the office of President when the prosecution was launched.",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": "s. 106 Madras Village Panchayats Act"
    },
    {
      "id": "ra2",
      "text": "Sanction of the Collector was sufficient in law under delegated powers.",
      "supporting_facts": [
        "f10"
      ],
      "legal_basis": "s. 127 Madras Village Panchayats Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "It is not necessary to express opinion on validity of delegation under s. 127, as no sanction under s. 106 is necessary for prosecution under s. 409 IPC.",
      "addresses_issue": "i1",
      "key_observation": "No sanction necessary"
    },
    {
      "id": "cr2",
      "text": "Citing Hori Ram Singh v. Emperor: Sanction not required for s. 409 as official capacity material only for entrustment, not for misappropriation.",
      "addresses_issue": "i1",
      "key_observation": "Official capacity does not enter into act of misappropriation"
    },
    {
      "id": "cr3",
      "text": "Citing Gill v. The King: Public servant acts in discharge of official duty only if act lies within scope of official duty; test is whether can reasonably claim done in virtue of office.",
      "addresses_issue": "i1",
      "key_observation": "Misappropriation under s. 409 not within scope"
    },
    {
      "id": "cr4",
      "text": "Not every offence by public servant requires sanction under s. 197 CrPC or similar; only if act directly concerned with official duties and claimable as done by virtue of office.",
      "addresses_issue": "i1",
      "key_observation": "Quality of act important; s. 409 not protected"
    },
    {
      "id": "cr5",
      "text": "Citing Om Prakash Gupta, Satwant Singh, Baijnath Gupta: Sanction not necessary for s. 409 as criminal breach of trust not acting in official capacity; official status only provides opportunity.",
      "addresses_issue": "i1",
      "key_observation": "No direct connection with official duties"
    },
    {
      "id": "cr6",
      "text": "s. 106 Madras Act similar to s. 197 CrPC; sanction not necessary.",
      "addresses_issue": "i1",
      "key_observation": "Same principle applies"
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Sanction of the Government under s. 106 of the Madras Village Panchayats Act is not necessary for prosecution under s. 409 IPC, as the act of criminal misappropriation is not committed while acting or purporting to act in discharge of official duties.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Hori Ram Singh v. Emperor",
      "citation": "1939 F.C.R. 159",
      "treatment": "followed",
      "relevance": "Sanction not required under s. 270 GOI Act for s. 409 IPC as official capacity not in misappropriation act"
    },
    {
      "case_name": "Gill v. The King",
      "citation": "1948 F.C.R. 19",
      "treatment": "followed",
      "relevance": "No sanction under s. 197 CrPC if act not within scope of official duty; test of acting in virtue of office"
    },
    {
      "case_name": "Albert West Meads v. The King",
      "citation": "75 I.A. 185",
      "treatment": "followed",
      "relevance": "Followed Gill on scope of sanction"
    },
    {
      "case_name": "Phanindra Chandra v. The King",
      "citation": "76 I.A. 10",
      "treatment": "followed",
      "relevance": "Followed Gill on scope of sanction"
    },
    {
      "case_name": "R. W. Mathams v. State of West Bengal",
      "citation": "1955 1 S.C.R. 216",
      "treatment": "approved",
      "relevance": "Approved Judicial Committee view on s. 197 CrPC"
    },
    {
      "case_name": "Om Prakash Gupta v. State of U.P.",
      "citation": "1957 S.C.R. 423",
      "treatment": "followed",
      "relevance": "No sanction for s. 409 as not acting in official capacity"
    },
    {
      "case_name": "Satwant Singh v. State of Punjab",
      "citation": "1960 2 S.C.R. 89",
      "treatment": "followed",
      "relevance": "Cheating or abetment not in discharge of official duty"
    },
    {
      "case_name": "Baijnath Gupta v. State of Madhya Pradesh",
      "citation": "1966 1 S.C.R. 210",
      "treatment": "followed",
      "relevance": "No sanction for s. 409; official status only opportunity for offence"
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "s. 409"
      ],
      "relevance": "Offence of criminal breach of trust by public servant; no sanction required as not in official duty"
    },
    {
      "name": "Madras Village Panchayats Act (Madras Act X of 1950)",
      "sections": [
        "s. 106",
        "s. 127"
      ],
      "relevance": "s. 106 requires sanction for offences in discharge of official duty; s. 127 delegation; held no sanction needed for s. 409"
    },
    {
      "name": "Code of Criminal Procedure",
      "sections": [
        "s. 197"
      ],
      "relevance": "Similar to s. 106; sanction only if act within scope of official duty"
    },
    {
      "name": "Government of India Act, 1935",
      "sections": [
        "s. 270"
      ],
      "relevance": "Similar to s. 197 CrPC and s. 106; cited in precedents"
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Both appeals dismissed. Supreme Court held that no sanction under s. 106 of Madras Village Panchayats Act was necessary for prosecution under s. 409 IPC, upholding the convictions and sentences by Madras High Court.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"A public servant can only be said to act or to purport to act in the discharge of his official duty, if his act is such as to lie within the scope of his official duty.\"",
      "speaker": "court",
      "significance": "Test from Gill v. King for when sanction required"
    },
    {
      "text": "\"The test may well be whether the public servant, if challenged, can reasonably claim that, what he does, he does in virtue of his office.\"",
      "speaker": "court",
      "significance": "Key test applied to hold no sanction needed for s. 409"
    },
    {
      "text": "\"It is not therefore every offence committed by a public servant that requires sanction for prosecution under s. 197(1) of the Criminal Procedure Code nor even every act done by him while he is actually engaged in the performance of his official duties.\"",
      "speaker": "court",
      "significance": "Clarifies limited scope of sanction requirement"
    }
  ],
  "_case_id": "1966_37",
  "_label": 0,
  "_text_length": 12649,
  "_extracted_at": "2026-02-10T19:38:51.881902"
}