{
  "metadata": {
    "case_name": "O.RM.M.SP. SV. Firm v. Commissioner of Income-tax",
    "case_year": 1965,
    "court": "Supreme Court of India",
    "judges": [
      "Ramaswami, J."
    ],
    "case_number": "Civil Appeal No. 751 of 1965",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The appellant (assessee) was a firm called O.RM.M.SP. SV. Firm registered under s. 26A of the Income-tax Act, 1922.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Prior to constitution of the firm, partners were members of a Hindu undivided family consisting of Meyyappa Chettiar and his two brothers carrying on money-lending business in India and former Federated Malaya States, assessed under Indian Income-tax Act, 1918.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Disruption of joint family status on June 2, 1938, after which members continued business as partners.",
      "type": "material",
      "date": "1938-06-02",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "In assessment for year 1939-40, Meyyappa Chettiar claimed income of family from April 13, 1938 to June 2, 1938 not liable to tax under s. 25(3) of 1918 Act due to severance.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "Income-tax Officer accepted partition but rejected contention that family not liable to pay tax on profits for April 13, 1938 to June 2, 1938.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "Madras High Court on reference held no discontinuance of business under s. 25(3) of 1918 Act; viewed as succession by firm of business of family.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Firm dissolved on March 2, 1952.",
      "type": "material",
      "date": "1952-03-02",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "In assessment for 1952-53, assessee applied for relief under s. 25(3) of 1922 Act; rejected by Income-tax Officer on March 7, 1956.",
      "type": "procedural",
      "date": "1956-03-07",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Appellate Assistant Commissioner dismissed appeal, holding foreign business not assessed under s. 3 of 1918 Act but only receipt of income in British India.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Appellate Tribunal held assessee entitled to relief under s. 25(3) except for income from house properties in Malaya; allowed appeal in part.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Tribunal referred questions to High Court; High Court held assessee not entitled to relief under s. 25(3) as foreign business not charged under 1918 Act, only remittances taxed.",
      "type": "procedural",
      "date": "1962-12-18",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Appellate Tribunal found assessee taxed on remittances received from and out of profits of foreign business under 1918 Act; entire profits remitted and assessed.",
      "type": "admitted",
      "date": null,
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the assessee is entitled to both parts of the relief contemplated under section 25(3) of the 1922 Act in respect of foreign business at Penang, Ipoh and Kambar?",
      "framed_by": "appellate_tribunal"
    },
    {
      "id": "i2",
      "text": "Whether the assessee is entitled to relief under section 25(3) of the 1922 Act with regard to rental income from house properties owned by the foreign firm which was discontinued in the year of assessment?",
      "framed_by": "appellate_tribunal"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Assessee entitled to relief under s. 25(3) of 1922 Act as foreign business was charged under 1918 Act since entire profits remitted and taxed.",
      "supporting_facts": [
        "f12"
      ],
      "legal_basis": "Section 25(3) of 1922 Act; Section 3 of 1918 Act"
    },
    {
      "id": "pa2",
      "text": "Words 'on which tax was at any time charged' in s. 25(3) mean 'with reference to which tax was charged'; assessment of income from business treated as assessment of business.",
      "supporting_facts": [],
      "legal_basis": "Section 25(3) of 1922 Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Foreign business not charged under 1918 Act; only remittances received in British India taxed, not the business itself.",
      "supporting_facts": [
        "f9",
        "f11"
      ],
      "legal_basis": "Section 3 of 1918 Act; Section 25(3) of 1922 Act"
    },
    {
      "id": "ra2",
      "text": "Rental income from house properties not part of business charged under 1918 Act.",
      "supporting_facts": [
        "f10"
      ],
      "legal_basis": "Section 25(3) of 1922 Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Foreign business of assessee charged under 1918 Act as entire profits remitted to British India and taxed under s. 3; charge on receipt of income derived from foreign business constitutes charge on the business within meaning of s. 25(3) of 1922 Act.",
      "addresses_issue": "i1",
      "key_observation": "Tax under 1918 Act charged upon assessee in respect of activity styled 'foreign business'."
    },
    {
      "id": "cr2",
      "text": "High Court's view following CIT v. S.V.R.M. Palaniappa Chettiar impliedly overruled by CIT v. Chugandas Co.; business not a unit of assessment, tax charged on owner of business.",
      "addresses_issue": "i1",
      "key_observation": "S. 25(3) applies if tax charged on owner in respect of business income under 1918 Act."
    },
    {
      "id": "cr3",
      "text": "Rental income from house properties qualifies for relief under s. 25(3) following Chugandas; heads of income are for computation only, do not delimit sources; income remains business income.",
      "addresses_issue": "i2",
      "key_observation": "Exemption under s. 25(3) is general, not restricted to specific heads."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Assessee entitled to both parts of relief under s. 25(3) of 1922 Act for foreign business at Penang, Ipoh and Kambar.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Assessee entitled to relief under s. 25(3) of 1922 Act for rental income from house properties owned by discontinued foreign firm.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Commissioner of Income-tax, Madras v. S.V.R.M. Palaniappa Chettiar and Others",
      "citation": "20 I.T.R. 170",
      "treatment": "overruled",
      "relevance": "High Court followed this for denying relief on foreign business; SC holds impliedly overruled by Chugandas."
    },
    {
      "case_name": "Commissioner of Income-tax, Bombay City-I v. Chugandas & Co.",
      "citation": "1964 8 S.C.R. 332",
      "treatment": "followed",
      "relevance": "Business not unit of assessment; tax on owner suffices; exemption not limited to specific heads; applies to interest on securities and by ratio to rental income."
    }
  ],
  "statutes_cited": [
    {
      "name": "Income-tax Act, 1922",
      "sections": [
        "Section 25(3)",
        "Section 25(4)",
        "Section 26A",
        "Section 3",
        "Section 6"
      ],
      "relevance": "Provides relief on discontinuance of business charged under 1918 Act; applies to foreign business and rental income as business income."
    },
    {
      "name": "Indian Income-tax Act, 1918",
      "sections": [
        "Section 3",
        "Section 5",
        "Section 9",
        "Section 14(2)",
        "Section 25(3)"
      ],
      "relevance": "Charging section on income received in British India; business income taxed on remittances; prior assessments on family and firm."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Supreme Court allowed the appeal, set aside Madras High Court judgment dated December 18, 1962, held assessee entitled to relief under s. 25(3) of 1922 Act for both foreign business and rental income from house properties.",
    "relief_granted": "Both parts of relief under s. 25(3) of 1922 Act for foreign business at Penang, Ipoh, Kambar and rental income from house properties.",
    "costs": "Appeal allowed with costs."
  },
  "key_quotes": [
    {
      "text": "\"the foreign business of the assessee must be held to be charged under the provisions of the 1918 Act within the meaning of s. 25(3) of the 1922 Act.\"",
      "speaker": "court",
      "significance": "Core holding on eligibility for relief for foreign business."
    },
    {
      "text": "\"tax is charged under the Income-tax Acts on specific units, such as, individuals, Hindu undivided families... and business, profession or vocation is not a unit of assessment.\"",
      "speaker": "court",
      "significance": "Explains interpretation of 'charged under' in s. 25(3), overruling narrow view."
    }
  ],
  "_case_id": "1966_213",
  "_label": 1,
  "_text_length": 18004,
  "_extracted_at": "2026-02-10T19:40:53.772202"
}