{
  "metadata": {
    "case_name": "Ellerman Bucknall Steamship Company Ltd. v. Sha Misrimal Bherajee",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "Subba Rao, J."
    ],
    "case_number": "Civil Appeal No. 274 of 1964",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant Ellerman Bucknall Steamship Company Ltd. are common carriers by sea owning ship CITY OF LUCKNOW. Messrs. Best & Co. Ltd., Madras, are local agents.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Respondent Sha Misrimal Bherajee entered two contracts with British Mercantile Company Limited, New York (seller) for Fresh Monsanto Polystyrene Injection Moulding Powder reground in granules. First contract: indents dated December 26, 1950 (Rs. 13,500) and December 27, 1950 (Rs. 6,750), packed in new fibre drums each containing 250 lbs. nett. Second contract: indent January 23, 1951 for 24 drums worth Rs. 16,000.",
      "type": "material",
      "date": "1950-12-26",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Buyer opened irrevocable Letter of Credit No. 4748 dated December 28, 1950 for U.S. $4535 plus war risk with Eastern Bank Limited, Madras. Second Letter of Credit No. 5012 dated January 31, 1951 for U.S. $3,330.",
      "type": "material",
      "date": "1950-12-28",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Eastern Bank arranged with Marine Midland Trust Company, New York for payment of bills presented by seller.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Seller delivered consignments in reused fibre drums to shipowners. Mates receipt described as 'packed in reused drums'. Seller gave letter of indemnity to shipowners against loss for issuing clean bills of lading.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Shipowners issued clean bills of lading describing goods as '21 drums' of 'Polystyrene, Powder', with recital 'Received in apparent good order and condition... weight, gauge, measurement, contents, conditions, quality and value unknown'.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Seller negotiated bills with Marine Midland Trust Company, obtained U.S. $6,998.75. Bills forwarded to Eastern Bank, Madras; buyer paid Rs. 33,012-5-9 to bank.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "On arrival at Madras, drums contained only coal dust and factory shavings, not matching description.",
      "type": "disputed",
      "date": null,
      "source": "buyer"
    },
    {
      "id": "f9",
      "text": "Buyer sued seller in American courts, realized Rs. 13,604-9-0.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Buyer instituted suit in City Civil Court, Madras for Rs. 23,760-15-6 against Bank (1st defendant) and shipowners (2nd defendant). Claim against bank: paid against unclean bills. Against shipowners: misrepresentation in issuing clean bills.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f11",
      "text": "City Civil Judge: Bills clean but bank liable partially for one LC. Dismissed against shipowners.",
      "type": "procedural",
      "date": "1960-11-03",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Madras High Court (Division Bench) in C.C.C. Appeal No. 61 of 1957: Shipowners issued clean bills knowingly when unclean should have been; buyer damnified. Decree full against shipowners, dismissed against bank.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Letters of credit instructed 'Clean on Board Bills of Lading'.",
      "type": "material",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether shipowners liable to buyer in contract for breach in carriage or delivery.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether shipowners liable in tort for deceit by issuing clean bills of lading knowingly false, in collusion with seller, leading bank to pay under letters of credit.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "What constitutes a clean bill of lading; whether omission of 'reused' made it unclean.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Cause of action pleaded was breach of contract, not deceit; High Court gave relief on different cause.",
      "supporting_facts": [
        "f10"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "No duty under common law or contract to state drums were old; non-mention would not mislead bank.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Bills of lading were clean; oldness/newness of drums had no real impact on contents, as both suitable containers.",
      "supporting_facts": [
        "f5",
        "f6"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Fraudulent misrepresentation by shipowners in collusion with seller issuing clean bills when unclean; bank paid relying on it, which it would not have otherwise.",
      "supporting_facts": [
        "f5",
        "f6",
        "f7",
        "f13"
      ],
      "legal_basis": "Doctrine of deceit"
    },
    {
      "id": "ra2",
      "text": "Pleadings support claim in tort (para 9 of plaint alleges misrepresentation, collusion, indemnity shows consciousness of wrong).",
      "supporting_facts": [
        "f10"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Pleadings, conduct at trial, issues and arguments support tort claim of misrepresentation; not new case.",
      "addresses_issue": "i1",
      "key_observation": "Para 9 of plaint contains all necessary allegations for tort."
    },
    {
      "id": "cr2",
      "text": "No liability in contract: Bill of lading is receipt, evidence of contract of carriage, document of title. Shipowners delivered in drums as shipped; damage due to seller sending wrong goods.",
      "addresses_issue": "i1",
      "key_observation": "Shipowners not liable for seller's breach."
    },
    {
      "id": "cr3",
      "text": "Deceit: False statement of fact knowingly/recklessly with intent acted upon causing damage. Shipowners knew drums reused (mates receipt), took indemnity, issued clean bills intending seller to negotiate LCs requiring clean bills.",
      "addresses_issue": "i2",
      "key_observation": "All elements of deceit present."
    },
    {
      "id": "cr4",
      "text": "Clean bill of lading: No reservation as to apparent good order/condition/packing. Refers to external/apparent condition discernible on reasonable examination. Here, contract required new drums; reused known, omission misrepresented.",
      "addresses_issue": "i3",
      "key_observation": "Creates estoppel; if 'reused' mentioned, not clean."
    },
    {
      "id": "cr5",
      "text": "Letters of credit require strict compliance; normally mean clean bills if unqualified.",
      "addresses_issue": "i2",
      "key_observation": "Bank would not pay on unclean bills."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "No liability in contract.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Shipowners liable in tort for deceit: knowingly issued false clean bills intending reliance under LCs, causing damage.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Clean bill unqualified admits apparent good order/condition; omission of 'reused' where known and contract specified new makes unclean.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Brown Jenkinson Co., Ltd. v. Percy Dalton (London) Ltd.",
      "citation": "L.R. 1957 2 Q.B. 621",
      "treatment": "followed",
      "relevance": "Shipowners issuing clean bills for known defective old/leaking barrels despite indemnity commits deceit; indemnity unenforceable."
    },
    {
      "case_name": "Silver v. Ocean Steamship Co., Ltd.",
      "citation": "L.R. 1930 1 K.B. 416",
      "treatment": "followed",
      "relevance": "Clean bill estops denying apparent good order where cans gashed/perforated."
    },
    {
      "case_name": "Compania Naviera Vasconzada v. Churchill & Sim",
      "citation": "L.R. 1906 1 K.B. 237",
      "treatment": "referred",
      "relevance": "Condition refers to external/apparent; 'quality/measure unknown' not qualifying."
    },
    {
      "case_name": "The Peter der Grosse",
      "citation": "L.R. 1876 1 P. 414",
      "treatment": "referred",
      "relevance": "'Weight, contents, value unknown' not qualifying clean bill."
    },
    {
      "case_name": "The Tromp",
      "citation": "L.R. 1921 P. 337",
      "treatment": "distinguished",
      "relevance": "Potatoes in wet bags/damaged: clean bill estops denying external good order, but packing defective."
    },
    {
      "case_name": "The Restitution Steamship Co., Ltd. v. Sir John Pirie & Co.",
      "citation": null,
      "treatment": "referred",
      "relevance": "Marginal notes on weights etc. make unclean bill."
    },
    {
      "case_name": "The Skarp",
      "citation": "L.R. 1935 134",
      "treatment": "referred",
      "relevance": "Qualification refers to external/apparent condition."
    },
    {
      "case_name": "Pavia & Co., S.P.A. v. Thurmann Nielsen",
      "citation": "1952 2 Q.B. 84",
      "treatment": "referred",
      "relevance": "Letters of credit in international trade; strict compliance."
    },
    {
      "case_name": "British Imex Industries Ltd. v. Midland Bank Ltd.",
      "citation": "L.R. 1958 1 Q.B. 542",
      "treatment": "referred",
      "relevance": "Unqualified bills of lading under LC mean clean."
    }
  ],
  "statutes_cited": [],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal against Madras High Court decree holding shipowners liable for full suit claim in tort of deceit dismissed. High Court decree upheld; shipowners liable for damages due to issuing clean bills of lading knowingly false.",
    "relief_granted": "Full decree for Rs. 23,760-15-6 against shipowners upheld.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"Deceit is a false statement of a fact made by a person knowingly or recklessly with the intent that it shall be acted upon by another who does act upon it and thereby suffers damage.\"",
      "speaker": "court",
      "significance": "Definition of deceit applied to facts."
    },
    {
      "text": "The shipowners with the knowledge that the bills of lading would be negotiated gave, at the request of the seller, clean bills of lading while as a matter of fact only unclean bills of lading should have been given.",
      "speaker": "court",
      "significance": "High Court finding affirmed; basis of liability."
    },
    {
      "text": "\"A clean bill of lading is defined... as one which does not contain any reservation as to the apparent good order and condition of the goods or the packing.\"",
      "speaker": "court",
      "significance": "Explains clean bill; omission made it misrepresentation."
    }
  ],
  "_case_id": "1966_289",
  "_label": 0,
  "_text_length": 30547,
  "_extracted_at": "2026-02-10T19:42:15.987750"
}