{
  "metadata": {
    "case_name": "Baban Singh and Dharichhan Kuer v. Jagdish Singh and Parmhans",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "Hidayatullah, J."
    ],
    "case_number": "Criminal Appeal No. 74 of 1964",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Jagdish Singh and Parmhans were appellants in F. A. 301 of 1952 in the High Court at Patna. Mst. Dharichhan Kuer was respondent No. 13 in that appeal.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "During the pendency of the appeal a compromise was said to have been arrived at between Dharichhan Kuer on the one hand and Jagdish Singh and Parmhans on the other.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Dharichhan Kuer and Jagdish Singh swore an affidavit on June 22, 1953 in support of the petition for compromise which was filed in the High Court.",
      "type": "material",
      "date": "1953-06-22",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Baban Singh's brother identified Dharichhan Kuer before the Oath Commissioner and Rs. 4,000 were paid to Dharichhan Kuer under the terms of the compromise in the Commissioner's presence.",
      "type": "material",
      "date": "1953-06-22",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Dharichhan Kuer also passed a receipt and her thumb impression was identified by Baban Singh's brother.",
      "type": "material",
      "date": "1953-06-22",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The petition of compromise was filed in court on July 13, 1953.",
      "type": "procedural",
      "date": "1953-07-13",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "The same day Baban Singh swore an affidavit Ex. B denying the compromise or that his wife had received Rs. 4,000. This affidavit was filed in the High Court on July 31, 1953.",
      "type": "material",
      "date": "1953-07-13",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "On September 9, 1953 Dharichhan Kuer also filed an affidavit Ex. A in support of her husband.",
      "type": "material",
      "date": "1953-09-09",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "As the compromise was in dispute the High Court ordered the Registrar to hold an enquiry. Nine witnesses were examined on behalf of Jagdish Singh and Parmhans including the Oath Commissioner. Dharichhan Kuer and her husband Baban Singh gave evidence on their own behalf.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "The Registrar reported on July 14, 1954 that the compromise was genuine and that Dharichhan Kuer had, in fact, sworn the affidavit before the Oath Commissioner and had received Rs. 4,000.",
      "type": "material",
      "date": "1954-07-14",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "B. N. Rai and Kanhaiya Singh, JJ. accepted the report by their order dated October 5, 1956.",
      "type": "procedural",
      "date": "1956-10-05",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "One of the terms of the compromise was that if Dharichhan Kuer resiled from it the amount of Rs. 4,000 would be refunded with costs Rs. 500. Dharichhan Kuer deposited this amount in court on October 9, 1956.",
      "type": "material",
      "date": "1956-10-09",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "The first appeal was then heard and disposed of.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "The application under s. 476 out of which this appeal has arisen was filed during the pendency of the first appeal and was taken up for hearing after the appeal was disposed of.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f15",
      "text": "Patna High Court ordered the Registrar to file a complaint against Baban Singh and Dharichhan Kuer under s. 199 IPC for making false affidavits by judgment and order dated October 3, 1963 in Criminal Misc. Case No. 366 of 1956.",
      "type": "procedural",
      "date": "1963-10-03",
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether S. 476 could at all be invoked because of the bar contained in S. 479A sub S. (6).",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether proceedings under s. 479A could be taken against Baban Singh and his wife.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Does the swearing of the false affidavits amount to an offence under s. 199 IPC or under either s. 191 or 192 IPC.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "A prosecution under S. 199 of the Indian Penal Code would be equally covered by s. 479A and as the procedure under that section was not followed an application for prosecution under S. 476 was barred.",
      "supporting_facts": [
        "f7",
        "f8",
        "f15"
      ],
      "legal_basis": "CrPC s.476, s.479A; IPC s.199"
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The short question in this case is whether S. 476 could at all be invoked because of the bar contained in S. 479A sub S. (6). The sixth sub-section lays down that no proceedings shall be taken under ss. 476 to 479 both inclusive for the prosecution of a person for giving or fabricating false evidence if in respect of such a person proceedings may be taken under s. 479A.",
      "addresses_issue": "i1",
      "key_observation": "If proceedings under s. 479A could be taken, then action ought to have been taken under that section and s. 476 cannot be invoked."
    },
    {
      "id": "cr2",
      "text": "Section 479A provides procedure in certain cases of false evidence for witnesses who intentionally give false evidence or fabricate false evidence. The first refers to an offence under s. 191/193 and the second to that under s. 192/193 IPC.",
      "addresses_issue": "i2",
      "key_observation": "In respect of such offences when committed by a witness, action under s. 479-A alone can be taken."
    },
    {
      "id": "cr3",
      "text": "The offence constituted by swearing falsely when one is bound by oath to state the truth because an affidavit is a declaration made under an oath. The definition of the offence of giving false evidence thus applies to the affidavits. The offence may also fall within s.192 IPC.",
      "addresses_issue": "i3",
      "key_observation": "Their offence came within the words of ss. 191/192 rather than S. 199 IPC. They were thus prima facie guilty of an offence of giving false evidence or of fabricating false evidence."
    },
    {
      "id": "cr4",
      "text": "The appellants were witnesses in the inquiry in the High Court and they had fabricated false evidence. If any prosecution was to be started against them the High Court ought to have followed the procedure under S. 479-A. Not having done so, the action under s. 476 was not open because of sub-s. (6) of s. 479-A.",
      "addresses_issue": "i1",
      "key_observation": "The order under appeal cannot be allowed to stand."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Swearing of false affidavits amounts to offence under ss. 191/192 IPC rather than s.199 IPC, attracting s.479A CrPC procedure exclusively due to bar in s.479A(6).",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Proceedings under s.476 CrPC not maintainable where s.479A applies.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Code of Criminal Procedure",
      "sections": [
        "476",
        "476-B",
        "479",
        "479A"
      ],
      "relevance": "Governs procedure for prosecution for false evidence; s.479A bars proceedings under ss.476-479 if applicable."
    },
    {
      "name": "Indian Penal Code",
      "sections": [
        "191",
        "192",
        "193",
        "199"
      ],
      "relevance": "Defines offences of giving false evidence on oath (s.191), fabricating false evidence (s.192), punishable under s.193; s.199 for false declarations capable of use as evidence."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "The appeal succeeds and is allowed. The order for the prosecution of the appellants is set aside.",
    "relief_granted": "Order of Patna High Court directing filing of complaint under s.199 IPC set aside.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The short question in this case is whether S. 476 could at all be invoked because of the bar contained in S. 479A sub S. (6).",
      "speaker": "court",
      "significance": "Frames the core legal issue decided by the Supreme Court."
    },
    {
      "text": "In respect of such offenses- when committed by a witness, action under s. 479-A alone can be taken.",
      "speaker": "court",
      "significance": "Explains the exclusive application of s.479A procedure."
    },
    {
      "text": "Their offence came within the words of ss. 191/192 rather than S. 199 of the Indian Penal Code.",
      "speaker": "court",
      "significance": "Determines the applicable IPC sections triggering s.479A bar."
    }
  ],
  "_case_id": "1966_226",
  "_label": 1,
  "_text_length": 11193,
  "_extracted_at": "2026-02-10T19:40:57.022129"
}