{
  "metadata": {
    "case_name": "Bihta Co-operative Development Cane Marketing Union Ltd. & Anr. v. Bank of Bihar Ltd. & Ors.",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "Mitter J."
    ],
    "case_number": "Civil Appeal No. 699 of 1964",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The first appellant, Bihta Co-operative Development Cane Marketing Union Ltd. (the Union), is a society registered under the Bihar and Orissa Co-operative Societies Act, 1935.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The second plaintiff was a Secretary of the Union at the time when the suit was filed in 1951.",
      "type": "background",
      "date": "1951",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Under a Resolution dated 16th April 1947 of the Executive Committee of the Union, defendant No. 6, Babu Lal Varma (Joint Secretary), and defendant No. 7, Ram Janame Varma (Treasurer), were jointly authorised to withdraw moneys of the Union from defendant No. 1, Bank of Bihar Ltd., with which it had a running account.",
      "type": "material",
      "date": "1947-04-16",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On 26th May 1948, defendant No. 6 and defendant No. 7 went to the bank to encash a cheque on behalf of the Union and learnt that the funds in the account were not sufficient.",
      "type": "material",
      "date": "1948-05-26",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "On 16th April 1948, a sum of Rs. 11,000/- was withdrawn from the Union's account by means of a cheque which did not come out of the cheque book of the Union; a loose cheque form surrendered by an ex-constituent, issued on 23rd March 1948, was converted into a cheque purporting to bear signatures of defendant No. 6 and defendant No. 7.",
      "type": "material",
      "date": "1948-04-16",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The spurious cheque bore the signature of defendant No. 7 but the purported signature of defendant No. 6 was a forgery.",
      "type": "disputed",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Criminal proceedings were started against five defendants including defendants Nos. 6 and 7 (employees of Union) and defendants Nos. 3, 4 and 5 (employees of the bank); all accused were acquitted.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Suit instituted by two plaintiffs against seven defendants; defendant No. 2 was Manager of the Bank in charge at relevant time.",
      "type": "procedural",
      "date": "1951",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Cause of action against defendants 3 to 7: they in collusion and conspiracy authorised illegal withdrawal of Rs. 11,000/-; bank liable as trustee for abusing trust by gross negligence allowing embezzlement.",
      "type": "material",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f10",
      "text": "Subordinate Judge found cheque forged and fabricated; defendants 4, 5 and 7 acting in collusion and conspiracy withdrew Rs. 11,000/- fraudulently; insufficient evidence against defendants 3 and 6; decreed suit against defendants 1, 2, 4, 5 and 7 jointly.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Defendants 1 and 2 appealed to Patna High Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Patna High Court concurred with Subordinate Judge on conspiracy by defendants 4, 5 and 7; absolved defendant No. 2 from liability on negligence; held no negligence by Union or its agents defendants 6 and 7; allowed bank's appeal on ground of s.48(1) r/w s.57 ousting civil court jurisdiction.",
      "type": "procedural",
      "date": "1961-04-14",
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Appeal to Supreme Court on certificate from Patna High Court; appellants are original plaintiffs; contesting respondents are Bank of Bihar Ltd. (def1), Madan Mohan Pandit (def2), Babu Lal Varma (def6).",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the suit was entertainable by a civil court, in view of provisions of s.48(1) read with s.57 of the Bihar and Orissa Co-operative Societies Act, 1935.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the Bank of Bihar Ltd. was liable for negligence of its employees in allowing withdrawal via forged cheque, despite alleged negligence by Union's officers.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The dispute is not covered by s.48(1) as it does not fall under clauses (a) to (e); Bank of Bihar is a non-member and not a financing bank under s.16(1); Explanation does not enlarge scope to include all disputes with non-members.",
      "supporting_facts": [
        "f1",
        "f13"
      ],
      "legal_basis": "Bihar and Orissa Co-operative Societies Act, 1935 s.48(1), s.57; Sagauli Sugar Works Pvt. Ltd. v. Assistant Registrar"
    },
    {
      "id": "pa2",
      "text": "Bank liable for gross negligence in paying forged cheque; Union's officers not negligent.",
      "supporting_facts": [
        "f3",
        "f5",
        "f6",
        "f10"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Suit not entertainable by civil court; dispute touches business of registered society and covered by s.48(1) r/w s.57; Explanation widens scope to include claims against non-members.",
      "supporting_facts": [
        "f1",
        "f9"
      ],
      "legal_basis": "Bihar and Orissa Co-operative Societies Act, 1935 s.48(1), Explanation; s.57"
    },
    {
      "id": "ra2",
      "text": "Even if bank negligent, Union negligent via its officers (defendants 6 and 7); both parties blameworthy, plaintiff's claim fails.",
      "supporting_facts": [
        "f3",
        "f5",
        "f6",
        "f12"
      ],
      "legal_basis": "London Joint Stock Bank v. Macmillan"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Dispute not covered by s.48(1) clauses (a)-(e): not between members/sureties (a), non-member not surety (b), bank not officer/agent/servant (c), not between societies (d), bank not financing bank under s.16(1) (e); Explanation clarifies admitted debts but does not add new categories or enlarge scope post-1948 amendment.",
      "addresses_issue": "i1",
      "key_observation": "High Court not justified in ousting civil court jurisdiction."
    },
    {
      "id": "cr2",
      "text": "On merits, cheque signatures not genuine (one forged), no mandate to bank; bank's negligence in not verifying signatures and using loose form; Union's resolution required joint signatures, no negligence by Union as proximate cause was bank's complicity.",
      "addresses_issue": "i2",
      "key_observation": "Principle of London Joint Stock Bank inapplicable as no genuine mandate existed."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Dispute not within s.48(1) r/w s.57; civil court has jurisdiction.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Bank liable for payment on forged cheque due to negligence; no contributory negligence by plaintiff Union barring claim.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Sagauli Sugar Works Pvt. Ltd. v. Assistant Registrar, Co-operative Societies, Motihari & Ors.",
      "citation": "1962 Supp. 3 S.C.R. 804; A.I.R. 1962 S.C. 1367",
      "treatment": "followed",
      "relevance": "Held Explanation to s.48(1) does not enlarge scope to include all claims by society against non-members."
    },
    {
      "case_name": "Union of India v. Registrar, Co-operative Societies Patna",
      "citation": "I.L.R. 40 Patna 7",
      "treatment": "referred",
      "relevance": "Followed by Patna HC in Sagauli case."
    },
    {
      "case_name": "London Joint Stock Bank, Limited v. Macmillan & Arthur",
      "citation": "1918 A.C. 777",
      "treatment": "distinguished",
      "relevance": "Customer must take precautions against forgery in drawing cheque; inapplicable here as no genuine signatures/mandate."
    },
    {
      "case_name": "Young v. Grote",
      "citation": "4 Bing. 253",
      "treatment": "referred",
      "relevance": "Principle of negligence in cheque drawing not extended beyond immediate transaction."
    },
    {
      "case_name": "C. Kurbar & Anr. v. Balaji Ramji Dange",
      "citation": "A.I.R. 1941 Bombay 274",
      "treatment": "distinguished",
      "relevance": "No application to facts of forged cheque."
    }
  ],
  "statutes_cited": [
    {
      "name": "Bihar and Orissa Co-operative Societies Act, 1935",
      "sections": [
        "s.48(1)",
        "s.57",
        "s.16(1)",
        "s.32",
        "s.63"
      ],
      "relevance": "s.48(1) requires certain disputes touching society business to be referred to Registrar, barring civil court jurisdiction under s.57; dispute not covered."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal succeeds; judgment of Patna High Court set aside and decree of Subordinate Judge restored, except no decree against respondent No. 7 (defendant No. 7) as appellants do not want it; other respondents to pay costs of appeal.",
    "relief_granted": "Decree against defendants 1,2,4,5 (Bank, Manager, employees); no decree vs respondent 7.",
    "costs": "Other respondents must pay costs of this appeal."
  },
  "key_quotes": [
    {
      "text": "\"The Explanation cannot be read as adding a new head to the categories (a) to (e) under s.48(1) of disputes which may be referred to the Registrar.\"",
      "speaker": "court",
      "significance": "Core holding on scope of s.48(1) and civil court jurisdiction."
    },
    {
      "text": "\"If the signatures on the cheque or at least that of one of the joint signatories to the cheque are not or is not genuine, there is no mandate on the bank to pay.\"",
      "speaker": "court",
      "significance": "Distinguishes precedents; basis for bank liability on forged cheque."
    },
    {
      "text": "\"As the customer and the banker are under a contractual relation in this matter, it appears obvious that in drawing a cheque the customer is bound to take usual and reasonable precautions to prevent forgery.\"",
      "speaker": "court",
      "significance": "Quote from London Joint Stock Bank, explained why inapplicable."
    }
  ],
  "_case_id": "1966_212",
  "_label": 1,
  "_text_length": 24714,
  "_extracted_at": "2026-02-10T19:41:01.225409"
}