{
  "metadata": {
    "case_name": "Commissioner of Income-tax v. Respondent Company",
    "case_year": 1965,
    "court": "Supreme Court of India",
    "judges": [
      "Shah, J."
    ],
    "case_number": "Civil Appeals Nos. 729-732 of 1965",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The respondent, a public limited company, carried on business of insurance - life and general.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "In each of the calendar years 1944 to 1948 relating to the assessment years 1945-46 to 1950-51, the Company suffered loss in the life insurance section, and made profit in the general insurance section.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Till the assessment year 1950-51 the loss suffered in the life insurance section was allowed by the Revenue authorities to be carried forward and set off under s. 24(2) of the Indian Income-tax Act, 1922, against profits from the general insurance section in the subsequent year.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "In proceedings for assessment for the assessment year 1951-52 the Income-tax Officer held that the life insurance business and the general insurance business carried on by the Company were distinct and separate and the loss carried forward from the previous year in respect of life insurance business could not be set off under s. 24(2) against the profit of the general insurance business.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The Appellate Assistant Commissioner and the Tribunal confirmed the view of the Income-tax Officer.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The Tribunal referred the following question to the High Court of Madras under s. 66(1) of the Income-tax Act: Whether the unabsorbed losses incurred by the assessee in the earlier years in its life insurance business are available to be set off against its profits from general insurance business for the assessment years 1951-52 to 1954-55?",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "The High Court answered the question in the affirmative.",
      "type": "procedural",
      "date": "1963-05-03",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "With certificate granted by the High Court, these appeals have been preferred by the Commissioner of Income-tax.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "The Company was entitled to carry on the life insurance business and the general insurance business under its Memorandum of Association, and the businesses were attended to by the Branch Managers and the Agents without any distinction, there was one common administrative organization and the expenses incurred in connection with the business both for administration and for heads of expenditure such as salary of the staff, postage, staff welfare fund and general charges, were common.",
      "type": "material",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the unabsorbed losses incurred by the assessee in the earlier years in its life insurance business are available to be set off against its profits from general insurance business for the assessment years 1951-52 to 1954-55?",
      "framed_by": "tribunal"
    },
    {
      "id": "i2",
      "text": "Whether the business of life insurance and the business of general insurance could be regarded as the same business within the meaning of s. 24(2)?",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The business of life insurance possesses peculiar characteristics which do not exist in respect of other insurance businesses: life insurance policies are not contracts of indemnity they are forms of investments; contract in general insurance is generally annual while in life business the risk continues until death; life business is controlled by principles essentially variant from those which control general insurance; life premia do not represent life profits nor can total claims be set off; law for life different from general; assessable profits of life computed separately from general.",
      "supporting_facts": [
        "f1"
      ],
      "legal_basis": "Schedule to Indian Income-tax Act, 1922 (Rules 1, 2, 6)"
    },
    {
      "id": "pa2",
      "text": "Life insurance business and general insurance business were separate businesses primarily upon the method of computation of taxable income.",
      "supporting_facts": [
        "f4",
        "f5"
      ],
      "legal_basis": "s. 10(7), Schedule Rules"
    },
    {
      "id": "pa3",
      "text": "Test whether one of the businesses can be closed without affecting the conduct of the other is decisive.",
      "supporting_facts": [],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Life insurance business and general insurance business constitute the same business.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Computation of assessable income of life or general insurance made in accordance with Schedule rules and not by s.10(1) after allowances in s.10(2).",
      "addresses_issue": "i1",
      "key_observation": "Special methods of computation do not make businesses distinct for s.24(2)."
    },
    {
      "id": "cr2",
      "text": "Whether two lines of businesses are same or different depends not upon special methods of computation but upon nature of businesses, organisation, management, source of capital, methods of book-keeping etc.",
      "addresses_issue": "i2",
      "key_observation": "In present case, two businesses constituted one composite business: common MoA entitlement, branch managers/agents without distinction, common admin org, common expenses."
    },
    {
      "id": "cr3",
      "text": "Test of closing one business without affecting other not decisive; strong indication if cannot, but not conclusive.",
      "addresses_issue": "i2",
      "key_observation": "Tribunal relied primarily on computation methods, not distinctive organisation etc."
    },
    {
      "id": "cr4",
      "text": "Adequate test: inter-connection, interlacing, inter-dependence, unity embracing the two businesses (citing Scales v. George Thompson). Here: common management, organisation, administration, fund, place of business.",
      "addresses_issue": "i2",
      "key_observation": "Life and general constitute same business under s.24(2)."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The life insurance business and the general insurance business constitute the same business within the meaning of s. 24(2) of the Act.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "High Court was right in holding that unabsorbed losses in life insurance available to set off against general insurance profits.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Scales v. George Thompson Co. Ltd",
      "citation": "13 T.C. 83",
      "treatment": "followed",
      "relevance": "Test for same business: inter-connection, interlacing, inter-dependence, unity."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act, 1922",
      "sections": [
        "s. 10(1)",
        "s. 10(2)",
        "s. 10(7)",
        "s. 24(1)",
        "s. 24(2)",
        "s. 66(1)",
        "Schedule Rule 1",
        "Schedule Rule 2",
        "Schedule Rule 6"
      ],
      "relevance": "Governs computation of insurance profits separately but set-off of losses from same business."
    },
    {
      "name": "Insurance Act, 1938",
      "sections": [],
      "relevance": "Basis for actuarial valuation and annual accounts furnished to Controller of Insurance."
    },
    {
      "name": "Income Tax Amendment Act, 1953",
      "sections": [
        "Act 25 of 1953"
      ],
      "relevance": "Amended wording of s.24(2) but at relevant time loss set off against same business."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeals preferred by the Commissioner of Income-tax are dismissed, upholding the High Court's view that life and general insurance businesses constitute the same business under s.24(2), allowing set-off of losses.",
    "relief_granted": "None to petitioner; respondent's claim upheld.",
    "costs": "Dismissed with costs."
  },
  "key_quotes": [
    {
      "text": "\"Was there any inter-connection, any interlacing, any inter-dependence, any unity at all embracing those two businesses?\"",
      "speaker": "court",
      "significance": "Test applied to determine if life and general insurance are same business."
    },
    {
      "text": "\"the two businesses constituted one composite business\"",
      "speaker": "court",
      "significance": "Court's finding on unity of businesses allowing loss set-off."
    },
    {
      "text": "\"the High Court was right in holding that the life insurance business and the general insurance business constitute the same business within the meaning of s. 24(2) of the Act.\"",
      "speaker": "court",
      "significance": "Core holding resolving the issue."
    }
  ],
  "_case_id": "1966_57",
  "_label": 0,
  "_text_length": 13884,
  "_extracted_at": "2026-02-10T19:38:51.599785"
}