{
  "metadata": {
    "case_name": "Hazrat Pir Mohamed Shah Saheb Roza Committee v. Commissioner of Income-tax",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "Ramaswami, J."
    ],
    "case_number": null,
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Hazrat Pirmahomed Shah Saheb was a renowned Muslim saint who lived in Gujarat in the early half of the eighteenth Century. At his death in 1742, he left about 400 Murids (disciples initiated during lifetime) whose descendants also became Murids.",
      "type": "background",
      "date": "1742",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "After saint's death, disciples and devotees subscribed moneys and collected donations to build Roza (mausoleum) and mosque for Fatiahs and prayers. All Muslims, Murids or non-Murids, had unrestricted access per Islamic doctrine.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Gifts of properties made by Murids and purchases from offerings for maintenance of Roza, mosque, and festive occasions like Urs, death anniversaries. Income after outgoings used for these purposes.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Surplus income from 1942-43 to 1956-57 used partly for madrassas, library, langar, bhandar for pilgrims on festive occasions. No evidence of such use prior to 1942-43.",
      "type": "material",
      "date": "1942-43 to 1956-57",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Murids had rights: residence in contributed rooms, dates from trees. Surplus not used for personal benefit of Murids.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Earliest records (1870-1880 survey) recognize Roza and mosque as wakf in revenue records. Purchased properties described as sold to wakf.",
      "type": "material",
      "date": "1870-1880",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Prior to 1888, management by general body of Murids through agents. On October 15, 1888, meeting passed resolutions describing properties as Roza's, appointed Roza Committee to manage, maintain Roza/mosque, defray Urs expenses.",
      "type": "procedural",
      "date": "1888-10-15",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "1923 Mussalman Wakf Act led to litigation between Roza Committee and Anjuman-i-Islam. Committee claimed Act inapplicable as wakf for Murids only.",
      "type": "procedural",
      "date": "1923",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Bombay Public Trusts Act, 1950 effective Jan 21, 1952. Roza Committee applied for registration May 30, 1952 under protest (not public trust), withdrew Nov 2, 1953. Assistant Charity Commissioner started suo motu inquiry.",
      "type": "procedural",
      "date": "1952-01-21",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Roza Committee re-applied Apr 28, 1955 conceding public benefit, registered as public trust Apr 29, 1955.",
      "type": "procedural",
      "date": "1955-04-29",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "ITO issued notices Mar 28, 1953 u/s 44(1)(a) for AY 1944-45 to 1948-49 (SY 1999-2003) as income escaped assessment due to no return u/s 22.",
      "type": "procedural",
      "date": "1953-03-28",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Appellant claimed exemption u/s 4(3)(i). ITO rejected, affirmed by AAC. Tribunal held wakf for private religious purpose, not public religious/charitable as Murids not section of community.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "High Court on reference Sep 25, 1964 answered against appellant: purpose includes madrassas/library (not wholly religious), Murids not section of community.",
      "type": "procedural",
      "date": "1964-09-25",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether, on the facts and in the circumstances of the case, the properties of the Hazrat Pir Mohamed Shah Saheb Roza Committee are held under trust or other legal obligation for public, religious or charitable object?",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the income from the wakf properties for the relevant assessment years is entitled to exemption under section 4(3)(i) and/or 4(3)(ii) of the Indian Income-tax Act?",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Income derived from Roza properties exempt u/s 4(3)(i) as held under trust wholly for religious purposes.",
      "supporting_facts": [
        "f2",
        "f3",
        "f7"
      ],
      "legal_basis": "Section 4(3)(i) Income-tax Act, 1922"
    },
    {
      "id": "pa2",
      "text": "Alternatively, Roza properties held for wholly charitable purposes as Murids constitute appreciable section of Sunni Bohra community.",
      "supporting_facts": [
        "f1"
      ],
      "legal_basis": "Section 4(3)(i) Income-tax Act, 1922"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Wakf not wholly religious as includes madrassas/library. Murids not section of community but fluctuating private individuals; no public benefit.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": "Oppenheim v. Tobacco Securities Trust Co. Ltd.; Section 4(3)(i)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "High Court erred in interfering with Tribunal's finding of fact that wakf wholly for religious purpose (maintenance Roza/mosque, Urs etc.); madrassas/library from 1942-43 not original purpose. High Court cannot reopen Tribunal facts in reference u/s 66.",
      "addresses_issue": "i1",
      "key_observation": "Object of wakf is question of fact; Tribunal finding binding."
    },
    {
      "id": "cr2",
      "text": "All Muslims (Murids/non-Murids) have unrestricted access to Roza/mosque per Islamic doctrine; wakf for wholly religious purpose of public character.",
      "addresses_issue": "i1",
      "key_observation": "Public character established."
    },
    {
      "id": "cr3",
      "text": "No need to decide alternative charitable purpose argument as religious purpose exemption applies.",
      "addresses_issue": "i2",
      "key_observation": "Exemption granted on religious ground."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Roza properties held under trust wholly for religious purpose of public character; income exempt u/s 4(3)(i).",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Questions answered in affirmative; exemption u/s 4(3)(i).",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Oppenheim v. Tobacco Securities Trust Co. Ltd.",
      "citation": null,
      "treatment": "referred",
      "relevance": "High Court relied to hold Murids not section of community; SC notes but does not apply as religious exemption suffices."
    },
    {
      "case_name": "India Cements Ltd. v. Commissioner of Income-tax",
      "citation": null,
      "treatment": "followed",
      "relevance": "High Court must accept Tribunal fact findings in s.66 reference; cannot reopen unless challenged."
    },
    {
      "case_name": "Commissioner of Income-tax v. M. Ganapathi Mudaliar",
      "citation": null,
      "treatment": "followed",
      "relevance": "High Court not appellate court over Tribunal fact findings."
    },
    {
      "case_name": "Mohamed Falil Abdul Gaffoor v. Commissioner of Income-tax, Colombo",
      "citation": null,
      "treatment": "referred",
      "relevance": "Trust prioritizing family not public charitable; cited by respondent."
    }
  ],
  "statutes_cited": [
    {
      "name": "Income-tax Act, 1922",
      "sections": [
        "Section 4(3)(i)",
        "Section 4(3)(ii)",
        "Section 22",
        "Section 44(1)(a)",
        "Section 66"
      ],
      "relevance": "Exemption for income from property held wholly for religious/charitable purposes; basis for assessment, reference."
    },
    {
      "name": "Mussalman Wakf Act, 1923",
      "sections": [],
      "relevance": "Led to litigation; Committee claimed inapplicable."
    },
    {
      "name": "Bombay Public Trusts Act, 1950",
      "sections": [],
      "relevance": "Required registration; Committee registered under protest then conceded public trust."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Supreme Court allowed appeals, set aside High Court judgment, answered reference questions in affirmative in favour of assessee, holding wakf wholly for public religious purpose exempt u/s 4(3)(i).",
    "relief_granted": "Exemption from income tax for relevant years; appeals allowed.",
    "costs": "With costs."
  },
  "key_quotes": [
    {
      "text": "\"the purpose of the wakf was the maintenance of the Roza and the mosque and the observance of festive occasions such as the Urs, death anniversaries, etc., at these institutions.\"",
      "speaker": "court",
      "significance": "Defines original wholly religious purpose per Tribunal."
    },
    {
      "text": "\"in accordance with Islamic doctrine, all Muslims, whether Murids or non-Murids, had unrestricted access to the Roza and the mosque.\"",
      "speaker": "court",
      "significance": "Establishes public character."
    },
    {
      "text": "\"the question as to what was the object of the wakf is essentially a question of fact and the High Court had, therefore, no justification for interfering with the finding of the Tribunal.\"",
      "speaker": "court",
      "significance": "Limits High Court role in reference."
    }
  ],
  "_case_id": "1966_64",
  "_label": 1,
  "_text_length": 15973,
  "_extracted_at": "2026-02-10T19:39:39.840868"
}