{
  "metadata": {
    "case_name": null,
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "Subba Rao, J."
    ],
    "case_number": "Civil Appeal No. 1039 of 1963",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Respondents claiming to be khatedars of 57.07 acres of land in Mauza Bhanpur, Tahsil Huzur, Western District Bhopal, filed suit against appellant for recovery of possession and mesne profits on ground that appellant was in illegal possession.",
      "type": "background",
      "date": null,
      "source": "respondents"
    },
    {
      "id": "f2",
      "text": "Appellant contested suit claiming he was khatedar of the land and in possession in that capacity.",
      "type": "disputed",
      "date": null,
      "source": "appellant"
    },
    {
      "id": "f3",
      "text": "Appellant as khatedar filed suit under s.71 of Bhopal State Land Revenue Act, 1932 in Tahsildar court for ejectment of respondents as his shikmi tenants; Tahsildar held appellant khatedar and respondents shikmi tenants.",
      "type": "material",
      "date": null,
      "source": "appellant"
    },
    {
      "id": "f4",
      "text": "Learned Subordinate Judge, Bhopal held respondents were khatedars and in possession in that capacity; suit maintainable in civil court.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "On appeal, Additional District Judge agreed with trial court findings.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "On second appeal to Madhya Pradesh High Court, Shiv Dayal J. admitted certain affidavits as evidence, held same conclusion on title and jurisdiction, dismissed second appeal; judgment dated June 24, 1959.",
      "type": "procedural",
      "date": "1959-06-24",
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Patta granted in favour of ancestors of respondents in 1929.",
      "type": "background",
      "date": "1929",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Under new settlement of 1935, appellant's name recorded in register of rights; continued in subsequent khasras up to 1953.",
      "type": "background",
      "date": "1935",
      "source": "appellant"
    },
    {
      "id": "f9",
      "text": "Respondents dispossessed of land on March 5, 1953.",
      "type": "material",
      "date": "1953-03-05",
      "source": "respondents"
    },
    {
      "id": "f10",
      "text": "Suit originally filed for declaration of title; plaint amended on July 24, 1954 to pray for possession after dispossession.",
      "type": "procedural",
      "date": "1954-07-24",
      "source": "respondents"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the decision of the revenue court on the question of title to the suit land bars the jurisdiction of the civil court.",
      "framed_by": "appellant"
    },
    {
      "id": "i2",
      "text": "Whether the concurrent finding given by the lower courts on the question of title was vitiated by an error of law by the courts wrongly throwing the burden of establishing title on the appellant notwithstanding the fact that in the Record of Rights the said land was entered in the name of the appellant.",
      "framed_by": "appellant"
    },
    {
      "id": "i3",
      "text": "Whether the suit was barred by limitation.",
      "framed_by": "appellant"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Decision of Tahsildar under s.71 of the Act was by court of exclusive jurisdiction on title as khatedar, barring civil court jurisdiction under s.200(1) of the Act.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": "Bhopal State Land Revenue Act, 1932 ss.71, 200(1)"
    },
    {
      "id": "pa2",
      "text": "Provisions relating to Record of Rights (ss.89,92,93,95) give revenue officer exclusive jurisdiction to determine title as khatedar, barring civil suit except as prescribed.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": "Bhopal State Land Revenue Act, 1932 ss.89,92,93,95,200"
    },
    {
      "id": "pa3",
      "text": "Courts below erred in burden of proof; presumption under s.95 from entry in Record of Rights in appellant's favour not rebutted; respondents failed to prove title.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": "Bhopal State Land Revenue Act, 1932 s.95"
    },
    {
      "id": "pa4",
      "text": "Suit barred by limitation.",
      "supporting_facts": [
        "f9",
        "f10"
      ],
      "legal_basis": "Indian Limitation Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Respondents are khatedars entitled to possession; appellant in illegal possession.",
      "supporting_facts": [
        "f1",
        "f7"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Under s.9 CPC, civil court jurisdiction barred only if expressly or impliedly by statute; party ousting must prove; statutes ousting jurisdiction strictly construed. Suit for title and possession by khatedar against trespasser not barred by s.200(1) or s.71, as s.71 presupposes landlord-tenant relation and does not decide title.",
      "addresses_issue": "i1",
      "key_observation": "Question of title foreign to scope of s.71."
    },
    {
      "id": "cr2",
      "text": "Record of Rights entries under ss.89,93 presumptive evidence only under s.95; does not bar suit on title; entry presumed correct unless rebutted; s.95 assumes entry can be questioned in civil suit.",
      "addresses_issue": "i1",
      "key_observation": "Effect of entry is only presumptive piece of evidence."
    },
    {
      "id": "cr3",
      "text": "Cited precedents not in pari materia with Act provisions.",
      "addresses_issue": "i1",
      "key_observation": "Gokhul Sahu v. Jodu Nundun Roy and Jatindra Nath Chowdhury v. Azizur Rahaman distinguished."
    },
    {
      "id": "cr4",
      "text": "All courts below considered entire evidence, held respondents established title and rebutted presumption from Record of Rights; High Court rightly held first appellate finding conclusive but reviewed evidence and confirmed; no interference under Art.136 on facts.",
      "addresses_issue": "i2",
      "key_observation": "Concurrent findings of fact not to be canvassed."
    },
    {
      "id": "cr5",
      "text": "Suit outside Act; governed by Limitation Act Art.142; filed originally for declaration, amended post dispossession on 1953-03-05; not barred.",
      "addresses_issue": "i3",
      "key_observation": "Art.142 applies."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Civil court has jurisdiction to entertain suit for declaration of title as khatedar and possession; not barred by s.200(1) read with ss.71, 89-95 of Bhopal Act.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Concurrent findings on title in favour of respondents correct; presumption rebutted.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Suit not barred by limitation under Art.142.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Gokhul Sahu v. Jodu Nundun Roy",
      "citation": "1890 I.L.R. 17 Cal. 721",
      "treatment": "distinguished",
      "relevance": "Turned on provisions not in pari materia with Bhopal Act."
    },
    {
      "case_name": "Jatindra Nath Chowdhury v. Azizur Rahaman Shanao",
      "citation": "A.I.R. 1923 Cal. 433",
      "treatment": "distinguished",
      "relevance": "Turned on provisions not in pari materia with Bhopal Act."
    }
  ],
  "statutes_cited": [
    {
      "name": "Bhopal State Land Revenue Act, 1932",
      "sections": [
        "71",
        "89",
        "92",
        "93",
        "95",
        "200"
      ],
      "relevance": "s.200(1) does not bar civil suit on title; s.71 for ejectment of shikmi, not title; Record of Rights presumptive only."
    },
    {
      "name": "Code of Civil Procedure",
      "sections": [
        "9"
      ],
      "relevance": "Civil courts entertain suits of civil nature unless expressly or impliedly barred."
    },
    {
      "name": "Indian Limitation Act",
      "sections": [
        "142"
      ],
      "relevance": "Applies to suit for possession after dispossession; suit not barred."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "136"
      ],
      "relevance": "No interference with concurrent findings of fact in special leave appeal."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal by special leave dismissed; civil court had jurisdiction; respondents established title; suit not barred by limitation or revenue decision.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "It is settled principle that it is for the party who seeks to oust the jurisdiction of a civil court to establish his contention. It is also equally well settled that a statute ousting the jurisdiction of a civil court must be strictly construed.",
      "speaker": "court",
      "significance": "Principle governing jurisdiction bar."
    },
    {
      "text": "The question of title is a matter foreign to the scope of S.71.",
      "speaker": "court",
      "significance": "Limits scope of revenue court under s.71."
    },
    {
      "text": "Any entry in the register of rights shall be presumed to be correct until the contrary is proved.",
      "speaker": "court",
      "relevance": "s.95 Bhopal Act; presumptive evidence only."
    }
  ],
  "_case_id": "1966_267",
  "_label": 0,
  "_text_length": 12796,
  "_extracted_at": "2026-02-10T19:41:37.073796"
}