{
  "metadata": {
    "case_name": "Bijendra Narain v. Mode Narain & Ors.",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "Shah J."
    ],
    "case_number": "Civil Appeal No. 756 of 1964",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "One Mankishun had four sons: Talebar, Indra Narain, Chandra Narain and Shyam Narain.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Talebar had two sons: Hanuman and Raghu Nandan. Hanuman died leaving no lineal descendant. Raghu Nandan adopted Udit Narain - grandson of his uncle Shyam Narain.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "In 1923, Udit Narain and the sons of Shyam Narain instituted suit No. 27 of 1923 in the court of the Subordinate Judge, Purnea, against descendants of Indra Narain and Chandra Narain for partition of half share in joint family properties.",
      "type": "procedural",
      "date": "1923",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Bijendra Narain, son of Ishwari Narain, a minor at the time, was impleaded as 8th defendant in suit No. 27/1923 by his guardian-ad-litem Bidya Narain (4th defendant). Mode Narain, Hari Narain and Rajballav Narain, sons of Bidya Narain, were defendants 5,6,7.",
      "type": "procedural",
      "date": "1923",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Preliminary decree passed in suit No. 27/1923 on July 1924 by consent of parties. Adoption of Udit Narain admitted. Shares specified: Plaintiffs No.1 four annas; Pl.1-3 one anna four pie; etc. Family estate joint except partitioned in Sch.D. Partition by metes and bounds according to shares. Three allotments: one for def 1-3 (four annas), one for def 4-8 (four annas).",
      "type": "procedural",
      "date": "1924-07",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Final decree in suit No. 27/1923 made on February 15, 1937. Properties divided in three lots: first eight anna share of Udit Narain and sons of Shyam Narain; second four anna of Indra Narain branch; third four anna of defendants 4 to 8 (Chandra Narain branch).",
      "type": "procedural",
      "date": "1937-02-15",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Bijendra Narain attained majority in 1934.",
      "type": "background",
      "date": "1934",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Bijendra Narain instituted suit No.17/1942 on July 10, 1942 for partition and separate possession of half share in properties in Sch. A,B,C possessed by Bidya Narain, his sons and grandsons. Alleged Bidya Narain and sons purchased properties with joint family funds in their names and in name of Bashisht Narain (24th def, daughter's son of Bidya Narain). In Sept 1941, panchas approached; Bidya Narain and sons admitted properties joint but refused separate share.",
      "type": "material",
      "date": "1942-07-10",
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "Sons of Bidya Narain and Bashisht Narain contested: 1923 decree ended jointness; held as tenants-in-common; separate living/business; plaintiff's share managed by mother and maternal uncle Rudra Narain; private properties ascertained in 1923 compromise; exclusive possession since acquisition.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f10",
      "text": "Bashisht Narain (24th def) claimed properties in his name bought with own funds, no concern with others.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f11",
      "text": "Trial Court (Subordinate Judge, Purnea): No severance by 1923 decree between plaintiff and Bidya Narain branch; properties joint; decreed half share in Sch.A immovable; commissioner for Sch.B movables; accounts from 1941 demand; rejected 24th def claim.",
      "type": "procedural",
      "date": "1957-11-19",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Patna High Court in Appeal from Original Decree No. 258/1848 confirmed decree with modification on Sch.B movables; remanded for determining existence of Sch.B properties.",
      "type": "procedural",
      "date": "1957-11-19",
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Girdhar Narain (grandson of Indra Narain) appointed receiver in 1923 suit till 1936; claimed paid Rs.1500 to Bijendra in 1944 from surplus for two anna share.",
      "type": "disputed",
      "date": "1936-1944",
      "source": "respondent"
    },
    {
      "id": "f14",
      "text": "Recital in Ext.29(c) certified copy of 1923 preliminary decree: certain properties purchased in name of Mode Narain etc. private; rest held equally by def 4-8. Trial/High Court held interpolation (not in other certified copies).",
      "type": "disputed",
      "date": null,
      "source": "court"
    },
    {
      "id": "f15",
      "text": "Many properties in name of 24th def acquired by Bidya Narain/sons with joint funds, including court auctions.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f16",
      "text": "Mode Narain (def1) died during High Court appeal; Rajballav (def6) during trial court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether by the decree in suit No. 27 of 1923 there was severance of joint family status between Bijendra Narain and Bidya Narain and his sons.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether properties standing in name of 24th defendant Bashisht Narain belonged to joint family, acquired with joint funds, including court auction purchases, and whether s.66 CPC bars claim.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether decree for accounts can be passed against estates of deceased defendants Mode Narain and Rajballav Narain.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "By specification of shares in preliminary decree of suit No.27/1923, there was severance not only between branches of Indra and Chandra Narain but also between Bijendra Narain and Bidya Narain.",
      "supporting_facts": [
        "f5",
        "f13",
        "f14"
      ],
      "legal_basis": "Mitakshara law; specification of shares constitutes partition"
    },
    {
      "id": "pa2",
      "text": "Properties purchased at court auctions in name of 24th def cannot be claimed by plaintiff due to s.66 CPC.",
      "supporting_facts": [
        "f15"
      ],
      "legal_basis": "Section 66(1) CPC"
    },
    {
      "id": "pa3",
      "text": "No decree for accounts against estates of deceased Mode Narain and Rajballav as personal claim.",
      "supporting_facts": [
        "f16"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "No severance between Bijendra Narain and Bidya Narain by 1923 decree as decree provided division in three lots only (branches of Talebar-Shyam, Indra, Chandra); Bijendra minor, represented by Bidya Narain as guardian.",
      "supporting_facts": [
        "f5",
        "f6"
      ],
      "legal_basis": "Mitakshara law; no unequivocal intention to sever inter se branches"
    },
    {
      "id": "ra2",
      "text": "Properties in names of Bidya Narain, sons and Bashisht Narain acquired with joint family funds; admitted before panchas as joint.",
      "supporting_facts": [
        "f8",
        "f15"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "In Hindu undivided family under Mitakshara, no individual can predicate definite share pre-partition. Partition by defining shares; actual division not necessary. Severance by unequivocal intention via suit, arbitration, demand, conduct or agreement. Mere specification of shares without intention to sever does not result in partition. No presumption of severance inter se other members.",
      "addresses_issue": "i1",
      "key_observation": "1923 suit severed branches of Talebar-Shyam from others, and Indra from Chandra, but not within Chandra branch (Bijendra and Bidya) as no intention expressed; minor Bijendra represented by Bidya; decree directed three allotments."
    },
    {
      "id": "cr2",
      "text": "Receiver Girdhar Narain's payment in 1944 post-suit does not evidence 1923 severance. Recital in Ext.29(c) interpolation, not in other certified copies.",
      "addresses_issue": "i1",
      "key_observation": "Trial court finding on evidence upheld."
    },
    {
      "id": "cr3",
      "text": "Properties of 24th def acquired with joint funds by Bidya/sons. Claim not that purchased benami for plaintiff, but joint family properties thrown into common stock. Not barred by s.66(1) CPC which bars suits claiming certified purchaser bought for plaintiff or predecessor.",
      "addresses_issue": "i2",
      "key_observation": "Strict construction of s.66; plaint para 13,19 claims joint family properties."
    },
    {
      "id": "cr4",
      "text": "Account claim not personal, survives death; not ex delicto or nugatory post-death.",
      "addresses_issue": "i3",
      "key_observation": "Plaintiff entitled to accounts from 1941 demand despite some possession."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "No severance of joint status between Bijendra Narain and Bidya Narain branch by 1923 decree.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Properties in name of 24th def are joint family properties; s.66 CPC does not bar claim.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Decree for accounts valid against estates of deceased defendants.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Palani Ammal v. Muthuvenkatacharla Moniagar",
      "citation": "L.R. 52 I.A. 83",
      "treatment": "followed",
      "relevance": "Principles for determining severance in Mitakshara family: presumed joint until proved separated; mere ascertainment of shares not necessarily separation."
    },
    {
      "case_name": "Addanki Venkatasubbaiah v. Chilakamarthi Kotaiah",
      "citation": null,
      "treatment": "distinguished",
      "relevance": "Turned on s.66(2) CPC for fraudulent insertion without consent of real purchaser; not applicable here."
    }
  ],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Article 133(1)(a)"
      ],
      "relevance": "Certificate for appeal to Supreme Court"
    },
    {
      "name": "Code of Civil Procedure, 1908",
      "sections": [
        "Section 66(1)",
        "Section 66(2)"
      ],
      "relevance": "Bars suits claiming court auction purchase benami for plaintiff; strictly construed; does not bar joint family property claims."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal dismissed. Decree of Trial Court and Patna High Court confirmed: Bijendra Narain entitled to half share in joint properties including those in Sch.A and acquired in names of Bidya Narain, sons and Bashisht Narain; accounts from 1941; modification on Sch.B movables upheld.",
    "relief_granted": "Partition and separate possession of half share; accounts of assets/liabilities since 1941.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"In a Hindu undivided family governed by the Mitakshara law, no individual member of that family, while it remains undivided, can predicate that he has a certain definite share in the property of the family.\"",
      "speaker": "court",
      "significance": "Defines rights pre-partition under Mitakshara law."
    },
    {
      "text": "\"It is from the intention to sever followed by conduct which seeks to effectuate that intention, that partition results; mere specification of shares without evidence of intention to sever does not result in partition.\"",
      "speaker": "court",
      "significance": "Core holding on what constitutes severance."
    },
    {
      "text": "\"A Mitakshara family is presumed in law to be a joint family until it is proved that the members have separated.\"",
      "speaker": "court",
      "significance": "Presumption of jointness from Palani Ammal."
    }
  ],
  "_case_id": "1966_255",
  "_label": 0,
  "_text_length": 28495,
  "_extracted_at": "2026-02-10T19:41:40.604830"
}