{
  "metadata": {
    "case_name": "Appellants v. Respondents",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "Wanchoo J.",
      "Mudholkar J.",
      "Sarkar J."
    ],
    "case_number": "Civil Appeal No. 1018 of 1963",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "On May 16, 1949, a notification was issued under S. 4(1) of the Land Acquisition Act, 1894 declaring that lands in eleven villages including village Chhawani were likely to be needed for a public purpose, i.e., the erection of an iron and steel plant.",
      "type": "procedural",
      "date": "1949-05-16",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Thereafter notifications were issued under S. 6 with respect to the villages notified in the S. 4(1) notification and it is not in dispute that a number of such notifications under S. 6 were issued with respect to village Chhawani and some land in that village was acquired under those notifications, the last of such acquisitions being in the year 1956.",
      "type": "procedural",
      "date": "1949 to 1956",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On August 12, 1960, another notification under S. 6 of the Act was issued by the appropriate government proposing to acquire 486-17 acres of land in village Chhawani and the area which was proposed to be acquired was demarcated on a map kept in the office of the Collector of Durg for inspection. The notification also stated that the provisions of S. 5-A of the Act shall not apply thereto.",
      "type": "procedural",
      "date": "1960-08-12",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The respondents who are interested in some of the land notified filed a writ petition in the High Court challenging the validity of the notification under S. 6.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f5",
      "text": "The Madhya Pradesh High Court in Misc. Petition No. 275 of 1961 allowed the petition and quashed the notification dated August 12, 1960 by judgment and order dated February 21, 1962.",
      "type": "procedural",
      "date": "1962-02-21",
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "The appellant applied to the High Court for a certificate which was granted.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether it is open to the appropriate government to issue successive notifications under S. 6 of the Land Acquisition Act, 1894 with respect to land comprised within one notification under S. 4(1) of the Act.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "It was open to the appropriate government to issue as many notifications as it deemed fit under S. 6 of the Act with respect to lands comprised in one notification under S. 4(1) and that it was not correct that the notification under S. 4(1) was exhausted as soon as one notification under S. 6 was issued with respect to a part of the land comprised in the notification under S. 4(1), and that it was always open to the appropriate government to issue successive notifications under S. 6 so long as these notifications were with respect to land comprised within the notification under S. 4(1).",
      "supporting_facts": [
        "f1",
        "f3"
      ],
      "legal_basis": "Land Acquisition Act, 1894 Ss. 4, 6, 17, 48, 49"
    },
    {
      "id": "pa2",
      "text": "Government may have difficulty in making the plan of its project complete at a time, particularly where the project is large, and therefore it is necessary that it should have power to make a number of declarations under S. 6.",
      "supporting_facts": [],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "If the Government has not finalised its plan when it makes a declaration under S. 6, it would have to start fresh acquisition proceedings beginning with a notification under S. 4 to provide for the complete plan if it could not make any more declarations and in such a case, in conceivable circumstances, it may have to pay more for the land.",
      "supporting_facts": [],
      "legal_basis": null
    },
    {
      "id": "pa4",
      "text": "Ss. 17(1) and 17(4) give power to take possession of waste and arable lands before enquiry under S. 5A, implying separate declarations for different kinds of lands.",
      "supporting_facts": [],
      "legal_basis": "Land Acquisition Act Ss. 17(1), 17(4)"
    },
    {
      "id": "pa5",
      "text": "S. 48 implies that a notification under S. 4 remains in force till withdrawal, allowing successive declarations under S. 6.",
      "supporting_facts": [],
      "legal_basis": "Land Acquisition Act S. 48"
    },
    {
      "id": "pa6",
      "text": "Ss. 49(2) and (3) support successive declarations under S. 6.",
      "supporting_facts": [],
      "legal_basis": "Land Acquisition Act Ss. 49(2), 49(3)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The notification under S. 6 of the Act was void as it had not been preceded by a fresh notification under S. 4(1) and the notification under S. 4(1) issued in 1949 had exhausted itself when notifications under S. 6 with respect to this village had been issued previously and could not support the issue of another notification under S. 6. In substance the contention was that a notification under S. 4(1) could be followed only by one notification under S. 6 and that there could be no successive notifications under S. 6 with respect to lands comprised in one notification under S. 4(1).",
      "supporting_facts": [
        "f1",
        "f2",
        "f3"
      ],
      "legal_basis": "Land Acquisition Act Ss. 4(1), 5A, 6"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Ss. 4, 5A and 6 of the Act have to be read together and so read, the conclusion is clear that the Act contemplates only a single declaration under S. 6 in respect of a notification under S. 4.",
      "addresses_issue": "i1",
      "key_observation": "Sections 4, 5A and 6 are integrally connected; S.4 specifies locality, S.5A for objections (single report), S.6 for declaration of particular land."
    },
    {
      "id": "cr2",
      "text": "A supposed difficulty of government in completing plan does not justify departing from plain meaning; government can issue fresh S.4 notification.",
      "addresses_issue": "i1",
      "key_observation": "Act is expropriatory, interpretation should put least burden on owner."
    },
    {
      "id": "cr3",
      "text": "S.17 does not support multiple declarations in normal cases; special provision needed, and government can issue separate S.4 notifications.",
      "addresses_issue": "i1",
      "key_observation": "Present case not under S.17."
    },
    {
      "id": "cr4",
      "text": "S.48 withdrawal does not imply S.4 remains for successive S.6; S.4 exhausted by one S.6, can be rescinded under General Clauses Act S.21.",
      "addresses_issue": "i1",
      "key_observation": "S.48 is special power post-S.9 notice."
    },
    {
      "id": "cr5",
      "text": "S.49(2),(3) is special case, does not support general successive declarations.",
      "addresses_issue": "i1",
      "key_observation": "Special provision implies no general power."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "A notification under S. 4(1) can only be followed by one notification under S. 6 and it is not open to the appropriate government to issue successive notifications with respect to parts of the land comprised in one notification under S. 4(1); as soon as one notification is issued under S. 6, the notification under S. 4(1) is exhausted.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Babu Barkya Thakur v. The State of Bombay",
      "citation": "1961 1 S.C.R. 128",
      "treatment": "referred",
      "relevance": "Notification under S. 4 envisages preliminary investigation; firm declaration under S. 6."
    }
  ],
  "statutes_cited": [
    {
      "name": "Land Acquisition Act, 1894",
      "sections": [
        "4",
        "4(1)",
        "4(2)",
        "5",
        "5A",
        "6",
        "7",
        "8",
        "9",
        "9(1)",
        "11",
        "15",
        "16",
        "17",
        "17(1)",
        "17(4)",
        "23(1)",
        "24",
        "48",
        "48(1)",
        "48(2)",
        "48(3)",
        "49",
        "49(2)",
        "49(3)"
      ],
      "relevance": "Core provisions for acquisition process; only single S.6 per S.4; special cases in 17,48,49 do not alter general rule."
    },
    {
      "name": "General Clauses Act, 1897",
      "sections": [
        "21"
      ],
      "relevance": "Power to issue notification includes power to rescind it."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal is dismissed. The High Court was right in quashing the S.6 notification dated August 12, 1960 as previous S.6 notifications had exhausted the 1949 S.4 notification.",
    "relief_granted": "Notification under S.6 dated August 12, 1960 quashed (confirmed).",
    "costs": "Dismissed with costs."
  },
  "key_quotes": [
    {
      "text": "\"Ss. 4, 5-A and 6 in our opinion are integrally connected. Section 4 specifies the locality... Section 5-A provides for hearing of objections... When it has so made up its mind it makes a declaration as to the particular land...\"",
      "speaker": "court",
      "significance": "Core reasoning on scheme of sections."
    },
    {
      "text": "\"Reading ss. 4, 5-A and 6 together it seems to us clear that the notification under S. 4(1) specifies merely the locality... and then under S. 4(2) survey is made... followed by a declaration under s. 6.\"",
      "speaker": "court",
      "significance": "Explains exhaustion of S.4 after one S.6."
    },
    {
      "text": "\"As the Act is an expropriatory Act, that interpretation of it should be accepted which puts the least burden on the expropriated owner.\"",
      "speaker": "court",
      "significance": "Principle of strict construction."
    }
  ],
  "_case_id": "1966_288",
  "_label": 0,
  "_text_length": 43985,
  "_extracted_at": "2026-02-10T19:41:39.621545"
}