{
  "metadata": {
    "case_name": "State of Gujarat v. Respondent",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "Ramaswami, J."
    ],
    "case_number": "Criminal Appeal No. 167 of 1964",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "On January 31, 1962 at about 9 p.m. the respondent was found accepting bets on American futures.",
      "type": "material",
      "date": "1962-01-31",
      "source": "prosecution"
    },
    {
      "id": "f2",
      "text": "On being searched in the presence of panchas currency notes of Rs. 119/- and two slips on which American futures were recorded were found.",
      "type": "material",
      "date": "1962-01-31",
      "source": "prosecution"
    },
    {
      "id": "f3",
      "text": "The trying Magistrate held that slips were not instruments of gaming within the meaning of s. 7 of the Act.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f4",
      "text": "The Magistrate was not satisfied that the police officer who carried out the search and seized the articles had reasonable grounds to believe that the slips and other articles recovered from the respondent were instruments of gaming.",
      "type": "disputed",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "The Magistrate held that the presumption under s. 7 of the Act could not be raised. The respondent was acquitted of the charge.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "Against the order of acquittal the State of Gujarat preferred an appeal to the High Court of Gujarat at Ahmedabad in Criminal Appeal No. 734 of 1962.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "The appeal was dismissed by Raju, J. on November 4, 1963.",
      "type": "procedural",
      "date": "1963-11-04",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "The respondent did not appear.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether it is necessary to examine an expert to corroborate the evidence of the prosecuting Sub-Inspector that the articles seized were instruments of gaming.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether the evidence of the Police Inspector to whom the warrant was issued under s. 6 of the Act required corroboration in each and every case.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The High Court was in error in holding that it is necessary to examine an expert to corroborate the evidence of the prosecuting Sub-Inspector that the articles seized were instruments of gaming.",
      "supporting_facts": [
        "f2",
        "f3"
      ],
      "legal_basis": "Section 7 of the Bombay Prevention of Gambling Act, 1887"
    },
    {
      "id": "pa2",
      "text": "The High Court was not right in taking the view that the evidence of the Police Inspector to whom the warrant was issued under s. 6 of the Act required corroboration in each and every case.",
      "supporting_facts": [
        "f1",
        "f2",
        "f4"
      ],
      "legal_basis": "Section 6 of the Bombay Prevention of Gambling Act, 1887"
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Section 3 of the Act defines the expression instruments of gaming as including any article used or intended to be used as a subject or means of gaming, any document used or intended to be used as a register or record or evidence of any gaming, the proceeds of any gaming, and any winnings or prizes in money or otherwise distributed or intended to be distributed in respect of any gaming.",
      "addresses_issue": "i1",
      "key_observation": "Definition provided under s.3"
    },
    {
      "id": "cr2",
      "text": "There is nothing in the Act to suggest that in order to prove that the articles seized are instruments of gaming it is the duty of the prosecution to examine an expert in every case. It is open to the prosecution to prove that the articles seized are instruments of gaming by proper evidence and it is not necessary to examine an expert for the purpose in each and every case.",
      "addresses_issue": "i1",
      "key_observation": "No mandatory requirement for expert evidence"
    },
    {
      "id": "cr3",
      "text": "It is also not proper to make a distinction between the evidence of an officer who makes a complaint under the proviso to s. 6 of the Act and to whom a warrant is issued for search and the evidence of a person to whom a warrant is issued but who makes no such complaint under the proviso. The question as to whether the evidence of the person who executes the warrant requires corroboration depends on the facts and circumstances of each case and no legal distinction can be made merely because the person who executes the warrant happens to be the person who makes the complaint under the proviso to s. 6 of the Act to the Commissioner of Police or to the Magistrate.",
      "addresses_issue": "i2",
      "key_observation": "Corroboration depends on facts, no automatic distinction"
    },
    {
      "id": "cr4",
      "text": "Both the contentions of Mr. Patwardhan are well-founded.",
      "addresses_issue": "i1",
      "key_observation": "Court agrees with petitioner on legal points"
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "It is not necessary to examine an expert in every case to prove that articles seized are instruments of gaming; prosecution can prove by proper evidence.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Evidence of the person executing the search warrant under s.6 does not require corroboration in each case; depends on facts and circumstances, no legal distinction based on who made the complaint.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Bombay Prevention of Gambling Act, 1887 (Bombay Act IV of 1887)",
      "sections": [
        "Section 3",
        "Section 4",
        "Section 5",
        "Section 6",
        "Section 7"
      ],
      "relevance": "Defines instruments of gaming (s.3), charges under ss.4 and 5, entry and search (s.6), presumptive proof (s.7); court interprets no need for expert or automatic corroboration"
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court held that the High Court erred on the legal points raised but did not interfere with the order of acquittal because the offence is petty and was committed several years back.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "There is nothing in the Act to suggest that in order to prove that the articles seized are instruments of gaming it is the duty of the prosecution to examine an expert in every case.",
      "speaker": "court",
      "significance": "Rejects mandatory expert evidence requirement"
    },
    {
      "text": "We do not, however, propose to interfere with the order of acquittal in this case, because the offence is petty and the offence was committed several years back.",
      "speaker": "court",
      "significance": "Explains why appeal dismissed despite agreeing on law"
    }
  ],
  "_case_id": "1966_227",
  "_label": 0,
  "_text_length": 6620,
  "_extracted_at": "2026-02-10T19:40:51.026057"
}