{
  "metadata": {
    "case_name": "Narayanan and Viswanathan v. Income Tax Authorities",
    "case_year": null,
    "court": "Supreme Court of India",
    "judges": [
      "Shah, J."
    ],
    "case_number": null,
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Chockalingam Chettiar and his son Annamalai were members of a Hindu joint family. On March 28, 1939, the joint family status was severed.",
      "type": "background",
      "date": "1939-03-28",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On February 2, 1943, Chockalingam executed a will devising the property which fell to his share in favour of his two grandsons Narayanan and Viswanathan and the other grandsons that may be born of his son Annamalai.",
      "type": "material",
      "date": "1943-02-02",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Relevant provisions of the will: 'After my lifetime, the minor sons of my divided son the aforesaid Annamalai Chettiar, viz., Narayanan and Viswanathan and the male children that may be born hereafter to the aforesaid Annamalai Chettiar shall take and enjoy in equal shares and with absolute rights all assets and liabilities in respect of immovable and movable properties'. Appoints Annamalai Chettiar and wife Meenakshi Achi as executors to manage properties as guardians until minors attain majority and then deliver to them.",
      "type": "material",
      "date": "1943-02-02",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Chockalingam died on February 7, 1943.",
      "type": "material",
      "date": "1943-02-07",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "After Chockalingam's death, Meenakshi gave birth to two sons: Chockalingam on August 11, 1946, and Ramaswami on March 23, 1948.",
      "type": "material",
      "date": "1946-08-11",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "In assessment year 1951-52, Income-tax Officer assessed income of property devised under the will on footing that Narayanan and Viswanathan, in existence at time of death, each entitled to moiety. Similar assessments for 1952-53, 1953-54, 1956-57.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Appellate Assistant Commissioner confirmed ITO orders. Appeals to Income-tax Tribunal failed.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Tribunal referred to High Court of Judicature at Madras under section 66(1) of Indian Income-tax Act: 'Whether the assessment on Viswanathan and Narayanan on a half share of the income of the estate of S.N.A.S. Chockalingam Chettiar is valid on a proper construction of the will dated 2nd February, 1943?' High Court answered affirmatively.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "High Court observed: though bequest to class of heirs, no provision indicating period of distribution later than death of testator or deferring possession beyond death; date of ascertainment of class per section 111 Indian Succession Act is date of testator's death.",
      "type": "admitted",
      "date": null,
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the assessment on Viswanathan and Narayanan on a half share of the income of the estate is valid on a proper construction of the will dated 2nd February, 1943?",
      "framed_by": "tribunal"
    },
    {
      "id": "i2",
      "text": "Whether possession of the legatees (grandsons) is deferred until a time after the death of the testator, such that later-born grandsons also take under section 111 of Indian Succession Act?",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Property devolves upon the four grandsons of the testator (including two born after death), and order of assessment levying tax from two only who were alive at testator's death is not valid.",
      "supporting_facts": [
        "f4",
        "f5"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Members of the class designated were under the will to take possession as and when each member attained the age of majority, deferring possession.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": "Section 111, Indian Succession Act (exception for deferred possession)"
    },
    {
      "id": "pa3",
      "text": "Testator was ailing, died within five days of will; could not have believed Meenakshi would give birth during lifetime; infer intention that estate taken by Narayanan, Viswanathan and male children born after testator's death.",
      "supporting_facts": [
        "f2",
        "f4"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Bequest to class of persons; no provision express or implied indicating period of distribution later than death or deferring possession beyond death; class ascertained at testator's death per section 111 Indian Succession Act; only Narayanan and Viswanathan entitled.",
      "supporting_facts": [
        "f2",
        "f3",
        "f4"
      ],
      "legal_basis": "Section 111, Indian Succession Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Ordinarily will speaks from date of death. Bequest to class goes to members alive at death per section 111 Indian Succession Act, unless exception: if class described in relation to specified individual and possession deferred after death, then taken by those alive at deferred date.",
      "addresses_issue": "i2",
      "key_observation": "Bequest to grandsons standing in particular degree to testator; question is whether possession deferred."
    },
    {
      "id": "cr2",
      "text": "On plain terms of will, possession not deferred beyond death. Grandsons to 'take and enjoy... with absolute rights' after testator's lifetime. Appointment of guardians to manage until majority does not defer possession or vesting.",
      "addresses_issue": "i2",
      "key_observation": "No prior bequest; legal possession vested in grandsons in existence at death; no postponement."
    },
    {
      "id": "cr3",
      "text": "No ambiguity in will terms. Not open to court to speculate on testator's contemplation of births during lifetime.",
      "addresses_issue": "i1",
      "key_observation": "High Court right; estate belongs only to two grandsons Narayanan and Viswanathan."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Assessment on Narayanan and Viswanathan each on half share valid; only grandsons alive at testator's death take the property; later-born do not.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Possession of legatees not deferred beyond testator's death; exception under section 111 Indian Succession Act not applicable.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Indian Succession Act, 1925",
      "sections": [
        "Section 111"
      ],
      "relevance": "Governs vesting of bequest to class; rule and exception for deferred possession applied to hold class ascertained at testator's death."
    },
    {
      "name": "Indian Income-tax Act",
      "sections": [
        "Section 66(1)"
      ],
      "relevance": "Basis for Tribunal's reference to High Court."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeals against High Court order upholding income tax assessments on Narayanan and Viswanathan each for half share of estate income dismissed; estate held to belong only to the two grandsons alive at testator's death.",
    "relief_granted": null,
    "costs": "Dismissed with costs."
  },
  "key_quotes": [
    {
      "text": "'After my lifetime, the minor sons of my divided son the aforesaid Annamalai Chettiar, viz., Narayanan and Viswanathan and the male children that may be born hereafter to the aforesaid Annamalai Chettiar shall take and enjoy in equal shares and with absolute rights...'",
      "speaker": "court",
      "significance": "Core will provision construed; shows no deferment of possession."
    },
    {
      "text": "Appointment of the parents... as guardians... had no the effect of deferring possession. The property was expressly given to the grandsons... There was no postponement of vesting of legal possession.",
      "speaker": "court",
      "significance": "Key reasoning rejecting deferment argument."
    },
    {
      "text": "Legal possession of the legatees was not deferred, and it is not open to the Court to speculate whether the testator could have contemplated the birth of any male children...",
      "speaker": "court",
      "significance": "Rejects speculation on testator's intent."
    }
  ],
  "_case_id": "1966_241",
  "_label": 0,
  "_text_length": 7548,
  "_extracted_at": "2026-02-10T19:41:41.007575"
}