{
  "metadata": {
    "case_name": "Satrughan v. Subujpari and Sujan Devi",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "Shah, J."
    ],
    "case_number": "Civil Appeal No. 939 of 1963",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Musamat Chando Kuer, widow of Babuji, instituted a suit on April 23, 1949 in the Court of the Subordinate Judge, Darbhanga, against the collaterals of her husband for a decree for partition and separate possession of a half share in the properties described in Schedules A to E and a fourth share in Sch. F annexed to the plaint.",
      "type": "procedural",
      "date": "1949-04-23",
      "source": "petitioner"
    },
    {
      "id": "f2",
      "text": "It was the case of Chando Kuer that her husband Babuji separated in 1934 from the coparcenary of which he was a member.",
      "type": "disputed",
      "date": "1934",
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "Babuji died on October 28, 1937.",
      "type": "material",
      "date": "1937-10-28",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Defendants (collaterals of Babuji) failed and neglected to divide the estate and deliver to Chando Kuer the share inherited by her; suit resisted by collaterals.",
      "type": "admitted",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f5",
      "text": "Chando Kuer died on March 9, 1951, and her daughters Subujpari and Sujan Devi were brought on the record of the suit as her heirs and legal representatives.",
      "type": "procedural",
      "date": "1951-03-09",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Trial Court dismissed the suit, being of the opinion that the plea of separation of Babuji from the coparcenary in 1934 was not established, and that the interest of Babuji in the coparcenary property devolved upon the surviving coparceners.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "In appeal, the Patna High Court granted a decree for possession of a share in the property as at the date of the suit.",
      "type": "procedural",
      "date": "1958-03-28",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "High Court held that on the death of Babuji on October 28, 1937, Chando Kuer by virtue of the Hindu Women's Rights to Property Act, 18 of 1937, acquired in the property of the coparcenary the same interest which Babuji had, and by the institution of the suit for partition that interest became defined, and on her death it devolved upon the appellants (daughters) as heirs to the estate of Babuji.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "On the finding recorded by the Trial Court which was not challenged in appeal before the High Court, Babuji did not separate in 1934 from the other coparceners.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Appeal to Supreme Court by Satrughan, son of Ghiran, with certificate granted by the High Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the interest acquired by a Hindu widow under Section 3(1) of the Hindu Women's Rights to Property Act, 1937, in her husband's coparcenary property becomes defined upon institution of a suit for partition, extinguishing the surviving coparceners' right of survivorship, and devolves upon her husband's heirs on her death, or reverts to the coparceners.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether 'partition' under Section 3(3) means severance of status by claim/suit or requires actual division by metes and bounds and exclusive possession.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The right vested in the surviving coparceners to take the interest vested in the widow enures so long as the widow does not, by suit or by private arrangement, reduce her interest in the property of the coparcenary to exclusive possession. The expression 'partition' in S. 3(3) means not merely severance of status, but division of interest by metes and bounds followed by assumption of exclusive possession by the widow.",
      "supporting_facts": [
        "f3",
        "f5"
      ],
      "legal_basis": "Hindu Women's Rights to Property Act, 1937, Section 3(3)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Institution of suit for partition by Chando Kuer defined her interest, which devolved to her heirs (daughters) on her death.",
      "supporting_facts": [
        "f1",
        "f3",
        "f5",
        "f7"
      ],
      "legal_basis": "Hindu Women's Rights to Property Act, 1937, Section 3"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Under Mitakshara law, coparcenary consists of males, unity of ownership, interest devolves by survivorship, not inheritance; widow entitled only to maintenance. Act 18 of 1937 invests widow with same interest as husband had at death, right to partition as male owner; her interest is Hindu woman's estate.",
      "addresses_issue": "i1",
      "key_observation": "Act introduces widow into coparcenary by statutory substitution, suspending survivorship; no dissolution on husband's death."
    },
    {
      "id": "cr2",
      "text": "If widow claims partition, she severs from others, interest becomes defined, survivorship extinguished; on her death post-partition claim, interest devolves to husband's heirs.",
      "addresses_issue": "i1",
      "key_observation": "Partition means adjustment of rights, severance of status; suit for partition defines interest."
    },
    {
      "id": "cr3",
      "text": "Rejects appellant's view that partition requires metes and bounds; widow has same right as male to claim partition, which severs status per Girja Bai.",
      "addresses_issue": "i2",
      "key_observation": "No warrant for requiring exclusive possession; claim defines interest."
    },
    {
      "id": "cr4",
      "text": "Disapproves cases like Movva Subba Rao, Shamrao Bhagvantrao, Bhagabai holding interest reverts or ends with widow even after suit.",
      "addresses_issue": "i1",
      "key_observation": "Such views denude partition right of reality; follows Parappagari Parappa."
    },
    {
      "id": "cr5",
      "text": "Babuji did not separate in 1934; Chando Kuer invested with interest by Act 18/1937 as extended by Bihar Act 6/1942; suit defined it, free from coparceners' claims.",
      "addresses_issue": "i1",
      "key_observation": "Survivorship right extinguished."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Institution of suit for partition by widow defines her interest in coparcenary property under Section 3, Hindu Women's Rights to Property Act, 1937, extinguishing coparceners' survivorship right; interest devolves to husband's heirs on widow's death.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Partition under Section 3(3) effects severance of status upon claim, not requiring actual division by metes and bounds.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Lakshmi Perumallu v. Krishnavenamma",
      "citation": "1965 1 S.C.R. 26",
      "treatment": "followed",
      "relevance": "No dissolution of coparcenary on coparcener's death; widow's interest by statutory substitution."
    },
    {
      "case_name": "Girja Bai v. Sadashiv Dhundiraj and Others",
      "citation": "L.R. 43 I.A. 151",
      "treatment": "followed",
      "relevance": "Partition means severance of status and division of title, not just physical division."
    },
    {
      "case_name": "Pratapmull Agarwalla v. Dhanabati Bibi and Others",
      "citation": null,
      "treatment": "referred",
      "relevance": "Wife/mother's share not owned until actual division pre-Act."
    },
    {
      "case_name": "Movva Subba Rao and Another v. Movva Krishna Prasadam and Anr",
      "citation": "I.L.R. 1954 Mad. 257",
      "treatment": "doubted",
      "relevance": "Widow's interest personal and ends on death - incorrect."
    },
    {
      "case_name": "Shamrao Bhagvantrao v. Kashibai and others",
      "citation": "A.I.R. 1956 Nag. 110",
      "treatment": "doubted",
      "relevance": "Widow's right ends with death even during suit pendency - incorrect."
    },
    {
      "case_name": "Bhagabai v. Bhaiyalal Others",
      "citation": "I.L.R. 1957 M.P. 14",
      "treatment": "doubted",
      "relevance": "Property reverts to coparcenary on widow's death - inconsistent with law."
    },
    {
      "case_name": "Parappagari Parappa alias Hanumanthappa and Another v. Parappagari Nagamma and Others",
      "citation": null,
      "treatment": "followed",
      "relevance": "If widow partitions, interest devolves as husband's separate property to his heirs."
    }
  ],
  "statutes_cited": [
    {
      "name": "Hindu Women's Rights to Property Act, 1937",
      "sections": [
        "Section 3(1)",
        "Section 3(2)",
        "Section 3(3)"
      ],
      "relevance": "Invests widow with husband's interest in coparcenary property as Hindu woman's estate with right to partition as male owner; interest defined on partition claim, devolves to husband's heirs."
    },
    {
      "name": "Hindu Women's Rights to Property (Amendment) Act, 1938",
      "sections": [
        "Act 11 of 1938"
      ],
      "relevance": "Amends Section 3 of 1937 Act."
    },
    {
      "name": "Bihar Act VI of 1942",
      "sections": [],
      "relevance": "Extends 1937 Act to agricultural lands in Bihar retrospectively from April 14, 1937."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal is dismissed, upholding the Patna High Court's decree granting the respondents (daughters of Chando Kuer) possession of the share in the coparcenary property as defined by the suit for partition instituted by Chando Kuer under the Hindu Women's Rights to Property Act, 1937; the surviving coparceners' right of survivorship was extinguished.",
    "relief_granted": "Decree for possession of share to respondents",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"When a Hindu governed by any school of Hindu law other than the Dayabhaga school... dies having at the time of his death an interest in a Hindu joint family property, his widow shall... have the same interest as he himself had.\"",
      "speaker": "court",
      "significance": "Quotes Section 3(1) of 1937 Act central to widow's rights."
    },
    {
      "text": "\"provided however that she shall have the same right of claiming partition as a male owner.\"",
      "speaker": "court",
      "significance": "Key proviso in Section 3 enabling severance by claim."
    },
    {
      "text": "\"To assume... that the right of the coparceners to take her interest on determination of the widows interest survives even after the interest has become definite, because of a claim for partition, is to denude the right to claim partition of all reality.\"",
      "speaker": "court",
      "significance": "Core reasoning rejecting survivorship post-partition claim."
    },
    {
      "text": "\"On the making of a claim for partition the interest of the widow gets defined.\"",
      "speaker": "court",
      "significance": "Defines effect of suit on widow's interest."
    }
  ],
  "_case_id": "1966_39",
  "_label": 0,
  "_text_length": 16158,
  "_extracted_at": "2026-02-10T19:38:55.917578"
}