{
  "metadata": {
    "case_name": "Tirunagar Panchayat v. Madurai Co-operative House Construction Society",
    "case_year": 1965,
    "court": "Supreme Court of India",
    "judges": [
      "Ramaswami, J."
    ],
    "case_number": "Civil Appeal No. 374 of 1965",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Tirunagar Colony formed by the Society consists of about 300 houses and total population exceeds 1,500.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "At inception, colony was within jurisdiction of Tirupparakundram Panchayat.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On February 21, 1955, Tirunagar colony excluded from Tirupparakundram Panchayat, declared separate village, constituted as Tirunagar Panchayat.",
      "type": "material",
      "date": "1955-02-21",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Society laid out and set apart public roads, parks, playgrounds and other public common places in formation of colony.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Change in Board of Directors of defendant-Society; as consequence, Society passed resolution on July 23, 1956 cancelling previous resolution handing over roads, streets and scavenging arrangements to Panchayat.",
      "type": "material",
      "date": "1956-07-23",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Panchayat filed suit O.S. 38 of 1957 in District Munsifs Court of Tirumangalam for permanent injunction restraining Society and servants from obstructing/interfering with Panchayat's statutory duties re roads/streets, cleaning latrines public/private, lighting houses/roads, civic needs.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Society contested suit: constitution of Panchayat illegal (non-compliance with Madras Village Panchayats Act 10 of 1950); public no right to use roads/streets; colony closed, outsiders except members no right to enter; parks, central oval, playgrounds, open spaces exclusive property of Society.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "Trial court overruled Society's contentions, granted permanent injunction to Panchayat as prayed.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Subordinate Judge of Madurai affirmed trial court in A.S. 92 of 1958.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Society's Second Appeal to High Court partly allowed by Ramakrishnan, J.: streets/roads vest in Panchayat; injunction confined to streets/roads, not extended to parks, oval park, playgrounds, schools, library, club, other amenities.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "High Court in Letters Patent Appeal No. 45 of 1962 affirmed Ramakrishnan, J.; injunction confined to roads/streets and cleaning public/private latrines; decree set aside re parks, playgrounds, bus-stand, other public places.",
      "type": "procedural",
      "date": "1963-08-09",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Government assigned to House Building Society free of cost area of about 5 acres for proposed public amenities like schools, markets etc.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Layout plan Ex. A-44 for Tirunagar Housing Colony.",
      "type": "admitted",
      "date": null,
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether there is statutory vesting in the Panchayat of parks, playgrounds, schools, libraries and other public places provided by Society for its members, and whether Panchayat entitled to permanent injunction restraining Society as decreed by trial court.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Parks, playgrounds, hospitals, schools etc. of Tirunagar Housing Colony vest in Panchayat under s.58 of Madras Village Panchayats Act.",
      "supporting_facts": [
        "f3",
        "f4",
        "f12",
        "f13"
      ],
      "legal_basis": "Sections 56 and 58 of Madras Village Panchayats Act 10 of 1950; rules under Co-operative Societies Act requiring provisions for schools, markets etc. in layout"
    },
    {
      "id": "pa2",
      "text": "If parks/playgrounds/markets dedicated to public, Panchayat acquires title under s.58.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": "Section 58 of the Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Constitution of Panchayat illegal as provisions of Madras Village Panchayats Act not complied with; public cannot use roads/streets as matter of right; entire colony closed, no outsider except members right to enter; parks, central oval, playgrounds, open spaces exclusive properties of Society.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "Madras Village Panchayats Act 10 of 1950"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Under s.56, all public roads vest in Panchayat; public road defined in s.20 as any street/road etc. over which public have right of way.",
      "addresses_issue": "i1",
      "key_observation": "Roads vest under s.56."
    },
    {
      "id": "cr2",
      "text": "S.58 vests communal property/income which by custom belongs to villagers in common or administered for their benefit as matter of custom; expression 'by custom' qualifies both belonging and administration.",
      "addresses_issue": "i1",
      "key_observation": "Vesting under s.58 requires proof of custom."
    },
    {
      "id": "cr3",
      "text": "Dedication not relevant for s.58; legislature did not contemplate vesting of dedicated parks/playgrounds/schools etc. merely by dedication; requires proof of customary right.",
      "addresses_issue": "i1",
      "key_observation": "No customary right proved for Society-provided amenities."
    },
    {
      "id": "cr4",
      "text": "Scope of s.58 confined to communal property/income by custom; cannot extend to parks/playgrounds/hospitals/libraries/schools provided by Society for members.",
      "addresses_issue": "i1",
      "key_observation": "Society retains ownership; no startling result like vesting private trusts."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "No statutory vesting under s.58 of parks, playgrounds, schools, libraries, other public places provided by Society; Panchayat not entitled to injunction beyond roads/streets as per High Court.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Madras Village Panchayats Act 10 of 1950",
      "sections": [
        "Section 56",
        "Section 58",
        "Section 20",
        "Section 2(20)"
      ],
      "relevance": "Governs vesting of public roads in Panchayat under s.56; communal property by custom under s.58; public road definition in s.2(20)"
    },
    {
      "name": "Co-operative Societies Act",
      "sections": [],
      "relevance": "Rules require provisions for schools, markets etc. in residential colony layouts"
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court holds no vesting of parks, playgrounds etc. under s.58; affirms High Court judgment and decree in Letters Patent Appeal No. 45 of 1962 confining injunction to roads/streets and latrine cleaning.",
    "relief_granted": "None to appellant; High Court decree upheld limiting Panchayat's injunction.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "It is manifest that s. 58 provides for the vesting of such property and income to which the villagers have acquired title as a matter of custom or which has been administered for the benefit of the villagers as a matter of custom.",
      "speaker": "court",
      "significance": "Defines scope of s.58 requiring proof of custom"
    },
    {
      "text": "We are accordingly of the opinion that the scope of s. 58 of the Act must be confined to communal property and income of the panchayat which by custom belongs to the villagers in common or has been administered for their benefit as a matter of custom.",
      "speaker": "court",
      "significance": "Limits s.58 to customary communal property, rejects extension to Society amenities"
    }
  ],
  "_case_id": "1966_281",
  "_label": 0,
  "_text_length": 10562,
  "_extracted_at": "2026-02-10T19:41:31.148121"
}