{
  "metadata": {
    "case_name": "State of Madhya Pradesh & Forest Authorities v. Forest Contractor",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "Shah, J."
    ],
    "case_number": "Civil Appeal No. 255 of 1964",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Under a contract dated October 14, 1956, the respondent was granted a right to the forest produce from Coupe No. 9, Lendara in the Saiura Borgain Reserved Forest in the Kanker Forest Division of Bastar District of Madhya Pradesh, for the period October 14, 1956 to March 31, 1958.",
      "type": "material",
      "date": "1956-10-14",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The Divisional Forest Officer held an enquiry in respect of certain breaches committed by the respondent of the terms of the contract, and by order dated January 30, 1958 directed the respondent to pay Rs. 8,500 as compensation assessed by him for damage done in the reserved forest under r. 15(1) of the Forest Contract Rules and Rs. 500 as penalty under r. 30(1) of the Forest Contract Rules.",
      "type": "material",
      "date": "1958-01-30",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "An appeal against the order to the Conservator of Forests was unsuccessful.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "A revision petition to the Chief Conservator of Forests, Madhya Pradesh, was unsuccessful.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The respondent moved the High Court of Madhya Pradesh by a petition under Art. 226 of the Constitution for a writ quashing the order dated January 30, 1958 and restraining enforcement.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The High Court granted the petition, quashed the order, and restrained the State and forest authorities from recovering Rs. 9,000.",
      "type": "procedural",
      "date": "1960-11-14",
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Notification issued under S. 20 of the Indian Forest Act, 1927, declaring State forests of Bastar District in Tahsil Kanker including Sainmura-Borgaon as reserved forests.",
      "type": "background",
      "date": null,
      "source": "appellants"
    },
    {
      "id": "f8",
      "text": "It was the case of the Divisional Forest Officer that the contractor had, contrary to the terms of the contract, cut trees not marked with the geru band.",
      "type": "disputed",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f9",
      "text": "The Chief Conservator of Forests upheld the order in revisional jurisdiction but did not act as arbitrator, recorded no evidence, and held no obligation to refer under cl. 9.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the Divisional Forest Officer was authorised under r. 15(1) to assess and direct payment of compensation for damage in the coupe, or whether disputes as to breach of contract must be referred to Chief Conservator under cl. 9.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the High Court erred in holding that r. 15(1) did not apply because the coupe was not in a reserved forest.",
      "framed_by": "appellants"
    },
    {
      "id": "i3",
      "text": "Whether the Chief Conservator's revisional order satisfied the arbitration requirement under cl. 9.",
      "framed_by": "appellants"
    },
    {
      "id": "i4",
      "text": "Whether Divisional Forest Officer could impose penalty under r. 30(1) without prior determination of breach under cl. 9.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "High Court erred in holding r. 15(1) inapplicable as coupe not reserved forest; no such plea raised by respondent; coupe part of reserved forest per notification under S.20.",
      "supporting_facts": [
        "f1",
        "f7"
      ],
      "legal_basis": "r. 15(1) Forest Contract Rules; S.20 Indian Forest Act"
    },
    {
      "id": "pa2",
      "text": "DFO authorised under r.15(1) and r.30(1) to assess compensation and penalty; cl.9 does not override as no inconsistency; procedure not clumsy as intended.",
      "supporting_facts": [
        "f2"
      ],
      "legal_basis": "cl.6 contract incorporating Forest Contract Rules; r.15(1), r.30(1)"
    },
    {
      "id": "pa3",
      "text": "Chief Conservator's decision in revision complied with cl.9 requirements.",
      "supporting_facts": [
        "f4",
        "f9"
      ],
      "legal_basis": "cl.9 contract"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Dispute as to whether contractor caused damage in reserved forest or committed breach must be decided under cl.9 by Chief Conservator, not by DFO under r.15(1).",
      "supporting_facts": [
        "f2",
        "f8"
      ],
      "legal_basis": "cl.9 contract; r.15(1) Forest Contract Rules"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "High Court erred on ground that coupe not reserved forest; no such plea or evidence; assumption unwarranted.",
      "addresses_issue": "i2",
      "key_observation": "Plea never raised in any proceedings."
    },
    {
      "id": "cr2",
      "text": "r.15(1) declares liability for damage by contractor but DFO assesses quantum only, not whether damage caused by contractor; dispute on breach referred under cl.9 to Chief Conservator.",
      "addresses_issue": "i1",
      "key_observation": "No inconsistency between cl.9 and r.15(1)."
    },
    {
      "id": "cr3",
      "text": "Chief Conservator acted in revisional jurisdiction, not as arbitrator under cl.9; no evidence recorded; cannot be award.",
      "addresses_issue": "i3",
      "key_observation": "Decision as supervisor, not between contesting parties."
    },
    {
      "id": "cr4",
      "text": "Penalty under r.30(1) conditioned on breach; dispute on breach requires cl.9 reference, not done.",
      "addresses_issue": "i4",
      "key_observation": "Same infirmity as compensation order."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Where dispute arises on performance or breach of contract, including whether damage done by contractor in reserved forest, must be referred to Chief Conservator under cl.9; DFO cannot determine liability, only quantum after liability fixed.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "DFO order imposing compensation under r.15(1) and penalty under r.30(1) not sustainable without cl.9 arbitration.",
      "resolves_issue": "i4",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Indian Forest Act, 1927",
      "sections": [
        "S. 20",
        "S. 85"
      ],
      "relevance": "Notification declaring reserved forest; recovery as arrears of land revenue"
    },
    {
      "name": "Forest Contract Rules",
      "sections": [
        "r. 15(1)",
        "r. 30(1)",
        "r. 28"
      ],
      "relevance": "Contractor liable for damage in reserved forest; assessment by DFO final subject to appeal; penalty for breach not exceeding Rs.500"
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 226"
      ],
      "relevance": "Writ petition to quash order"
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal by special leave dismissed; High Court order upheld on grounds that DFO lacked authority to determine breach/dispute without reference under cl.9 to Chief Conservator; orders imposing compensation and penalty set aside.",
    "relief_granted": "Quashing of DFO order dated January 30, 1958 upheld; restraint on recovery continued",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"The rule only declares that for damage that may be done, by the contractor, his servants or agents, in the forest, the contractor shall be liable the rule also invests the Divisional Forest Officer with authority to determine the amount of compensation payable by the contractor, but not to determine whether the contractor, his servants or his agents have committed breach of the contract.\"",
      "speaker": "court",
      "significance": "Distinguishes DFO's role in quantum vs. liability/breach determination"
    },
    {
      "text": "\"Clause 9 of the contract confers authority upon the Chief Conservator of Forests to adjudicate upon disputes, inter alia, as to the performance or breach of the contractor.\"",
      "speaker": "court",
      "significance": "Establishes primacy of cl.9 arbitration for breach disputes"
    },
    {
      "text": "\"If in truth the dispute had to be referred for adjudication to the Chief Conservator of Forests, his decision that he found no reason to interfere with the findings of the Divisional Forest Officer who was one of the parties to the dispute, cannot conceivably be regarded as an award between two contesting parties.\"",
      "speaker": "court",
      "significance": "Rejects revisional order as substitute for arbitration"
    }
  ],
  "_case_id": "1966_29",
  "_label": 0,
  "_text_length": 14921,
  "_extracted_at": "2026-02-10T19:38:55.485945"
}