{
  "metadata": {
    "case_name": "Decree-holders (Appellants) v. Legal representatives of Hazarilal (Respondents 1-5) and Jagat Narain (Respondent 6)",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "Hidayatullah, J."
    ],
    "case_number": "Civil Appeal No. 246 of 1964",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "On January 17, 1946, Hazarilal (predecessor of respondents 1 to 5) and Jagat Narain (respondent 6) executed a simple mortgage deed for Rs. 50,000 with interest at 9% per annum or in default of payment of interest for 3 months at Re. 1 per cent per month for the period of default.",
      "type": "material",
      "date": "1946-01-17",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Mortgagors made default in payment of interest and did not pay anything out of the mortgaged amount.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Suit filed for enforcement of the mortgage by sale of properties, claiming Rs. 76,692/9/8, calculating interest at 9% per cent per annum for first 3 months and at 12% per cent per annum till institution of suit, allowing credit for Rs. 14,000 as repayment.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Defendants admitted the mortgage and consideration but pleaded that the rate of interest was both penal and excessive. Plea not accepted.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f5",
      "text": "Preliminary decree passed for the full claim on August 12, 1953.",
      "type": "procedural",
      "date": "1953-08-12",
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "Hazarilal appealed on January 5, 1954 (R.F.A. No. 1-D of 1954), asking for reduction of interest by Rs. 7,900 and future interest at 9% per cent per annum. Court fee paid on Rs. 7,900.",
      "type": "procedural",
      "date": "1954-01-05",
      "source": "respondent"
    },
    {
      "id": "f7",
      "text": "During pendency of appeal, decree made final on April 3, 1954.",
      "type": "procedural",
      "date": "1954-04-03",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Inderjit and Satya Narain, sons of Hazarilal, filed suit for declaration that properties were ancestral and belonged to joint family, claimed properties could not be sold, temporary injunction granted then vacated.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f9",
      "text": "Against order vacating stay, appeal filed (F.A.O. 68-D of 1957), temporary stay obtained from High Court.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f10",
      "text": "Mortgagees filed petition (S.M. 1318-D of 1957) for vacation of stay order.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f11",
      "text": "On February 10, 1958, conditional stay order passed by single Judge of High Court.",
      "type": "procedural",
      "date": "1958-02-10",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Punjab Relief of Indebtedness Act extended to Delhi on June 8, 1956 under s. 2 of Part C States Laws Act, 1950.",
      "type": "background",
      "date": "1956-06-08",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "On October 29, 1958, legal representatives of Hazarilal (respondents 1 to 5) presented application under s. 3 of Usurious Loans Act as amended by s. 5 of Punjab Relief of Indebtedness Act, claiming interest in excess of 7½ per cent per annum could not be awarded.",
      "type": "procedural",
      "date": "1958-10-29",
      "source": "respondent"
    },
    {
      "id": "f14",
      "text": "R.F.A. 1-D of 1954 heard on October 15, 1959 by Divisional Bench of Punjab High Court, interest reduced by Rs. 15,027 by applying Punjab Relief of Indebtedness Act, interest up to suit date to Rs. 11,665 at 7½% simple, future interest same rate; followed L. Ram Sukh Das v. Hafiz-ul-Rahman.",
      "type": "procedural",
      "date": "1959-10-15",
      "source": "lower_court"
    },
    {
      "id": "f15",
      "text": "Judgment debtors ordered to make good court fee on Rs. 7,127.",
      "type": "procedural",
      "date": "1959-10-15",
      "source": "lower_court"
    },
    {
      "id": "f16",
      "text": "Unsuccessful proceedings including application for review and for certificate; decree-holders obtained special leave, filed Civil Appeal No. 246 of 1964.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether, in the facts of the case, the High Court was right in reducing interest in a preliminary mortgage decree dated August 12, 1953 by applying ss. 5 and 6 of the Punjab Relief of Indebtedness Act which were extended to Delhi on June 8, 1956.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether 'suit' in s. 6 of the Punjab Relief of Indebtedness Act includes a pending appeal after a preliminary decree has been passed.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "S. 5 of the Punjab Relief of Indebtedness Act merely amended s. 3 of the Usurious Loans Act; neither applied to the facts; no such plea taken in court below.",
      "supporting_facts": [
        "f5",
        "f14"
      ],
      "legal_basis": "ss. 5 and 6 Punjab Relief of Indebtedness Act"
    },
    {
      "id": "pa2",
      "text": "S. 5 can only apply to a suit instituted or pending after the section comes into force, not in an appeal after the suit has ended in a decree.",
      "supporting_facts": [
        "f6",
        "f7",
        "f12"
      ],
      "legal_basis": "s. 6 Punjab Relief of Indebtedness Act"
    },
    {
      "id": "pa3",
      "text": "Retrospective effect limited to suits pending on or instituted after commencement; cannot affect vested right given by judgment.",
      "supporting_facts": [
        "f5",
        "f7"
      ],
      "legal_basis": "s. 6 Punjab Relief of Indebtedness Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Appeal court must apply provisions of Relief of Indebtedness Act same as court of trial; word 'suit' includes an appeal from the decision in the suit.",
      "supporting_facts": [
        "f6",
        "f12",
        "f14"
      ],
      "legal_basis": "s. 6 Punjab Relief of Indebtedness Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Amended s. 3 of Usurious Loans Act is mandatory: court shall re-open transaction if reason to believe interest excessive; interest exceeding 7½% per annum simple deemed excessive for secured loans.",
      "addresses_issue": "i1",
      "key_observation": "If amended s. 3 applies, High Court was right."
    },
    {
      "id": "cr2",
      "text": "S. 6 gives retrospective effect to s. 5 for suits pending on or instituted after commencement.",
      "addresses_issue": "i2",
      "key_observation": "Issue is whether suit was pending on June 8, 1956 when only appeal was pending."
    },
    {
      "id": "cr3",
      "text": "Appeal is continuation of suit; preliminary decree does not terminate suit; appeal part of cause as preliminary decree emerges from appeal.",
      "addresses_issue": "i2",
      "key_observation": "'Suit' includes stages before final executable decree, including appeal."
    },
    {
      "id": "cr4",
      "text": "If not applied to appeal, anomaly: appeal court cannot but trial court on remand must; legislature intended to include appeals.",
      "addresses_issue": "i2",
      "key_observation": "Pending suit means live suit in first instance or appeal court."
    },
    {
      "id": "cr5",
      "text": "New procedural laws retrospective; even substantive if expressly retrospective; s. 6 expressly retrospective.",
      "addresses_issue": "i1",
      "key_observation": "Courts must apply if intention clear."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Provisions of ss. 5 and 6 of Punjab Relief of Indebtedness Act apply to pending appeals from preliminary decrees in mortgage suits.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "High Court was right in applying amended s. 3 of Usurious Loans Act to reduce interest.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "L. Ram Sukh Das v. Hafiz-ul-Rahman and others",
      "citation": "A.I.R. 1945 Lah. 177",
      "treatment": "followed",
      "relevance": "Provisions of Punjab Relief of Indebtedness Act apply to case where decree passed and appeal pending when amendment brought into force."
    },
    {
      "case_name": "Quilter v. Mapleson",
      "citation": "1892 9 Q.B.D. 672",
      "treatment": "referred",
      "relevance": "New law applied to take away vested rights after judgment."
    },
    {
      "case_name": "Stovin v. Fairbrass",
      "citation": "1919 88 L.J. K.B. 1004",
      "treatment": "referred",
      "relevance": "New law applied to vested right after judgment."
    },
    {
      "case_name": "Attorney General v. Sillem",
      "citation": "11 E.R. 1200",
      "treatment": "referred",
      "relevance": "Appeal is right to enter superior court to redress error below; continuation of suit."
    },
    {
      "case_name": "Mukerjee K.C. v. Mst. Ramratan",
      "citation": "63 I.A. 47",
      "treatment": "referred",
      "relevance": "Amendments applied to pending cases without saving clause."
    }
  ],
  "statutes_cited": [
    {
      "name": "Punjab Relief of Indebtedness Act",
      "sections": [
        "Section 5",
        "Section 6"
      ],
      "relevance": "S.5 amends s.3 Usurious Loans Act making it mandatory to deem interest >7.5% excessive for secured loans and re-open; s.6 gives retrospective effect to pending/instituted suits."
    },
    {
      "name": "Usurious Loans Act, 1918",
      "sections": [
        "Section 3"
      ],
      "relevance": "Amended to require court to re-open transactions with excessive interest; excessive if >7.5% pa simple for secured loans."
    },
    {
      "name": "Part C States Laws Act, 1950",
      "sections": [
        "Section 2"
      ],
      "relevance": "Extended Punjab Relief of Indebtedness Act to Delhi on June 8, 1956."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court upheld the Punjab High Court's judgment reducing the interest in the preliminary mortgage decree by applying ss. 5 and 6 of the Punjab Relief of Indebtedness Act to the pending appeal, holding that 'suit' includes appeals and the provisions are retrospective.",
    "relief_granted": "None to appellants; High Court order affirmed reducing interest to 7½% per annum simple.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The amended section 3 of the Usurious Loans Act is plainly mandatory because it makes it obligatory for a court to re-open a transaction if there is reason to believe that the interest is excessive.",
      "speaker": "court",
      "significance": "Establishes mandatory nature of relief against excessive interest."
    },
    {
      "text": "In the present Act the intention is to give relief in respect of excessive interest in a suit which is pending and a preliminary decree in a suit of this kind does not terminate the suit.",
      "speaker": "court",
      "significance": "Clarifies that pending suit includes appeal stage before final decree."
    },
    {
      "text": "The words of the section we are concerned with, speak, of a suit pending on the commencement of the Act and it means a live suit whether in the court of first instance or in an appeal court.",
      "speaker": "court",
      "significance": "Defines scope of retrospective application to appeals."
    }
  ],
  "_case_id": "1966_81",
  "_label": 0,
  "_text_length": 14529,
  "_extracted_at": "2026-02-10T19:39:42.488564"
}