{
  "metadata": {
    "case_name": "Ram Kumar Agarwalla Brothers v. Commissioner of Income Tax",
    "case_year": 1966,
    "court": "Supreme Court of India",
    "judges": [
      "Shah J."
    ],
    "case_number": "Civil Appeal No. 176 of 1966",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Ms. Ram Kumar Agarwalla Brothers (assessees) were carrying on business at Calcutta as share-brokers, share dealers and paper merchants.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Swadeshi Cotton Mills Co. Ltd. (public limited company) operates at Kanpur a large unit producing cotton textiles. Originally managed by Ms. Horseman Brothers.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Early in 1946, Ms. Horseman Brothers desired to dispose of their share-holding in the Company and to part with the Managing Agency.",
      "type": "material",
      "date": "1946-early",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "David Mitchell (partner of Ms. Lovelock Lewis, accountants of the Company), Rowan Hodge (of Ms. Orr Dignam Co., solicitors of the Company), and the assessees started joint negotiations with Ms. Horseman Brothers to purchase controlling interest in the Company.",
      "type": "material",
      "date": "1946",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "About April 1946, Ms. Mangturam Jaipuria (acting through partner Anandram Gajadhar) were also negotiating to secure controlling interest in the Company.",
      "type": "material",
      "date": "1946-04",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Ms. Mangturam Jaipuria addressed a letter on April 29, 1946 to David Mitchell: 'With reference to your negotiations to acquire the controlling interest in the Swadeshi Cotton Mills Co. Ltd., we confirm that we and our associates are desirous of purchasing the same and in the event of your securing the same for us and upon your giving up all claims to purchase the same and assigning to us and our associates any interest that you may have acquired therein, we hereby agree to pay you and your colleagues a capital sum of Rs. 6,00,000/-. Such payment to be made upon completion of the purchase by us.'",
      "type": "material",
      "date": "1946-04-29",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Ms. Mangturam Jaipuria obtained a letter of guarantee for Rs. 6,00,000/- from the Imperial Bank of India in favour of David Mitchell.",
      "type": "material",
      "date": "1946",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Ms. Mangturam Jaipuria purchased the shareholding of Ms. Horseman Brothers for Rs. 4,03,00,000/-.",
      "type": "material",
      "date": "1946-after April",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Rs. 6,00,000/- was duly paid to David Mitchell, Rowan Hodge and the assessees, divided equally between them—each receiving Rs. 2 lakhs.",
      "type": "material",
      "date": "1946-after purchase",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Assessees paid Rs. 25,000/- out of their share to one Ratan Lal Goel for services rendered in the deal, and credited the balance of Rs. 1,75,000/- as brokerage in their profit loss account.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Assessees submitted a return of income for assessment year 1947-48 showing Rs. 1,75,000/- as income from brokerage in the course of business.",
      "type": "procedural",
      "date": "1947-48 assessment year",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Assessees later submitted a revised return excluding Rs. 1,75,000/-.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Income-tax Officer rejected claim that Rs. 1,75,000/- was non-recurring casual receipt exempt under s. 4(3)(vii) or capital/non-revenue receipt. Order confirmed by Appellate Assistant Commissioner.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Assessees pleaded Rs. 2,00,000 was consideration for agreeing to refrain from carrying on business, non-taxable, or non-recurring casual receipt. Difference of opinion between two Members of Appellate Tribunal; referred to third Member who remanded for findings.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f15",
      "text": "Appellate Assistant Commissioner reported that payment of Rs. 6,00,000/- was not only inducement to refrain from competition but to remunerate services rendered by assessees and associates in helping Ms. Mangturam Jaipuria acquire controlling interest.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f16",
      "text": "Tribunal agreed with report, dismissed appeal. Observed: assessees never had intention or money to buy Mills worth crores; associates show no intention; partners of solicitors/auditors had no intention; Rs. 2 lakhs accrued from venture in nature of trade; services of auditors, brokers, solicitors employed in completing sale.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f17",
      "text": "Tribunal submitted statement of case on questions under s. 66(1): (1) Whether material for President's finding that assessee's intention to buy was baseless? (2) Was receipt revenue from venture in trade, rightly taxed?",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f18",
      "text": "Calcutta High Court held ample material supporting Tribunal's finding that receipt was revenue from venture in trade. Judgment dated March 11, 1963 in Income-tax Reference No. 80 of 1959.",
      "type": "procedural",
      "date": "1963-03-11",
      "source": "lower_court"
    },
    {
      "id": "f19",
      "text": "Appeal by special leave to Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f20",
      "text": "Principal partner Ram Kumar Agarwalla did not give evidence; Ramgopal Agarwalla (another partner) had no personal knowledge of negotiations/finances.",
      "type": "disputed",
      "date": null,
      "source": "court"
    },
    {
      "id": "f21",
      "text": "David Mitchell and Rowan Hodge had left India, could not be examined.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether there was any material on record before the President to give a finding to the effect that the intention of the assessee that it intended to buy the Mills was without any basis whatsoever?",
      "framed_by": "lower_court"
    },
    {
      "id": "i2",
      "text": "Was the receipt in question a revenue receipt from a venture in the nature of trade and has it been rightly brought to tax?",
      "framed_by": "lower_court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Rs. 6 lakhs paid to assessees and associates for dissuading them from competing with Ms. Mangturam Jaipuria; not open to third Member to ignore concurrent finding of original two Members.",
      "supporting_facts": [
        "f14"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Rs. 2,00,000 received as consideration for agreeing to refrain from carrying on business, non-taxable; in any event, non-recurring casual receipt exempt under s. 4(3)(vii).",
      "supporting_facts": [
        "f10",
        "f12"
      ],
      "legal_basis": "Income-tax Act s. 4(3)(vii)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Payment remunerated services rendered by assessees and associates in helping acquire controlling interest, not merely inducement to refrain from competition.",
      "supporting_facts": [
        "f15"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "On difference of opinion, entire appeal referred to third Member, not bound by original findings. Accountant Member viewed receipt not in course of business but for refraining from competing; Judicial Member disagreed.",
      "addresses_issue": "i1",
      "key_observation": "Third Member not bound by prior views."
    },
    {
      "id": "cr2",
      "text": "Letter from Ms. Mangturam Jaipuria to David Mitchell makes clear Rs. 6 lakhs primarily remuneration for services: 'in the event of your securing the same for us and upon your giving up all claims...'.",
      "addresses_issue": "i2",
      "key_observation": "Payment for services rendered."
    },
    {
      "id": "cr3",
      "text": "Appellate Assistant Commissioner reported payment for services in acquiring interest, not dissuading from competing; Tribunal accepted.",
      "addresses_issue": "i2",
      "key_observation": "Tribunal finding based on evidence."
    },
    {
      "id": "cr4",
      "text": "Assessees had no intention to buy: principal business paper, some shares/brokerage; no disclosure of financing crores transaction; solicitor/auditor/brokers unlikely for genuine project costing Rs. 4 crores.",
      "addresses_issue": "i1",
      "key_observation": "No genuine intention to acquire."
    },
    {
      "id": "cr5",
      "text": "Receipt regarded as revenue receipt earned in course of assessees' business.",
      "addresses_issue": "i2",
      "key_observation": "Arises from business activities."
    },
    {
      "id": "cr6",
      "text": "Cases like Higgs v. Oliver and Mills Store Co. have no relevance on Tribunal's findings.",
      "addresses_issue": "i2",
      "key_observation": "Distinguished on facts."
    },
    {
      "id": "cr7",
      "text": "S. 4(3)(vii) excludes casual non-recurring receipts, but does not apply to business receipts; here arose from business.",
      "addresses_issue": "i2",
      "key_observation": "Not exempt."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Tribunal's finding that assessees had no intention to acquire controlling interest supported by material/evidence.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Rs. 6,00,000/- (Rs. 2 lakhs to assessees) received as remuneration for services rendered, not for refraining from competing; revenue receipt from venture in nature of trade, taxable.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Higgs v. Oliver",
      "citation": "33 T.C. 136",
      "treatment": "distinguished",
      "relevance": "Payment for refraining from acting/producing/directing films held not taxable; no relevance here as payment for services."
    },
    {
      "case_name": "Commissioner of Income-tax Bombay v. The Mills Store Co. Karachi",
      "citation": "9 I.T.R. 642",
      "treatment": "distinguished",
      "relevance": "Annual payments for extending non-compete held not business profits; no relevance on facts."
    }
  ],
  "statutes_cited": [
    {
      "name": "Income-tax Act",
      "sections": [
        "s. 4(3)(vii)",
        "s. 66(1)"
      ],
      "relevance": "s. 4(3)(vii) exempts casual non-recurring receipts but not those from business; s. 66(1) for reference of questions."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court upheld Tribunal and High Court findings that the receipt of Rs. 1,75,000/- (net) was a revenue receipt from a venture in the nature of trade, taxable as brokerage income.",
    "relief_granted": null,
    "costs": "Dismissed with costs."
  },
  "key_quotes": [
    {
      "text": "\"in the event of your securing the same for us and upon your giving up all claims to purchase the same and assigning to us and our associates any interest that you may have acquired therein, we hereby agree to pay you and your colleagues a capital sum of Rs. 6,00,000/-.\"",
      "speaker": "respondent",
      "significance": "Letter evidences payment primarily for services rendered in securing interest."
    },
    {
      "text": "He never had the intention or the money to buy the Mills worth a few crores. ... I think that the sum of Rs. 2 lacs has accrued to the assessee as a result of a venture in the nature of trade.",
      "speaker": "lower_court",
      "significance": "Tribunal's key finding on no intention and nature of receipt."
    },
    {
      "text": "The receipt must therefore be regarded as a revenue receipt earned in the course of the business of the assessees.",
      "speaker": "court",
      "significance": "Supreme Court's holding on taxability."
    }
  ],
  "_case_id": "1966_65",
  "_label": 0,
  "_text_length": 11628,
  "_extracted_at": "2026-02-10T19:39:37.095109"
}