{
  "metadata": {
    "case_name": "Appellant (Tenant) v. Respondent (Landlord)",
    "case_year": 1966,
    "court": "Supreme Court of India",
    "judges": [
      "Wanchoo, J."
    ],
    "case_number": "Civil Appeal No. 2009 of 1966",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The appellant was the tenant of certain land at Lahori Gate, Patiala, taken for the purpose of a firewood stall, which is rented land within the meaning of s. 2(f) of the Act.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The original owner of the land became an evacuee, and the respondent purchased the land from the Managing Officer; a sale certificate was issued in his favour on May 31, 1963.",
      "type": "admitted",
      "date": "1963-05-31",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The appellant thus became the respondent's tenant.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The respondent filed an application for ejectment of the appellant on a number of grounds, including that the respondent needed the land for erection of a residential house.",
      "type": "material",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f5",
      "text": "The Rent Controller held that the respondent did not need the land for running any business but only for constructing a residential house for himself; rented land could only be vacated under s. 13(3)(a)(ii) if needed for business purpose; dismissed the application.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "The Appellate Authority allowed the respondent's appeal, holding that under s. 13(3)(a)(ii) landlord could evict for any purpose of own use; followed Municipal Committee, Abohar v. Daulat Ram; directed tenant to put landlord in possession.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "The Punjab High Court in Civil Revision 1077 of 1966 upheld the Appellate Authority and dismissed the revision on July 15, 1966.",
      "type": "procedural",
      "date": "1966-07-15",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Appellant obtained special leave to appeal to Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Interpretation of s. 13(3)(a)(ii) of the East Punjab Urban Rent Restriction Act, 1949: whether a landlord can evict a tenant from rented land if he requires it for his own use for constructing a residential house, or only if required principally for business or trade.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Even if the respondent requires the land for construction of a residential house, he could not be given an order of ejectment under s. 13(3)(a)(ii); the words 'for his own use' must be read as qualified by sub-cls. (b) and (c), meaning use principally for trade or business.",
      "supporting_facts": [
        "f1",
        "f4"
      ],
      "legal_basis": "s. 13(3)(a)(ii) read with (b) and (c) of East Punjab Urban Rent Restriction Act, 1949"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Under s. 13(3)(a)(ii), landlord may evict tenant from rented land if he requires it for his own use, regardless of the purpose (including residential).",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": "s. 13(3)(a)(ii) of East Punjab Urban Rent Restriction Act, 1949; Municipal Committee, Abohar v. Daulat Ram"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Sub-cl. (a) must be read with sub-cls. (b) and (c); 'for his own use' in (a) is restricted to use principally for business or trade, as otherwise restrictions in (b) and (c) would be meaningless.",
      "addresses_issue": "i1",
      "key_observation": "Presence of sub-cls. (b) and (c) qualifies 'for his own use' in sub-cl. (a) to mean business purpose, given the ameliorative nature of the Act protecting tenants."
    },
    {
      "id": "cr2",
      "text": "If landlord occupies other rented land for business (per (b)), or vacated rented land without sufficient cause after commencement of Act (per (c)), he cannot evict; this implies 'own use' means business use.",
      "addresses_issue": "i1",
      "key_observation": "High Court in Municipal Committee, Abohar overlooked effect of sub-cls. (b) and (c)."
    },
    {
      "id": "cr3",
      "text": "Act is ameliorative legislation to protect tenants from eviction; interpretation limits eviction to same purpose (business) for which land was let.",
      "addresses_issue": "i1",
      "key_observation": "Respondent requires land only for residential house, not business."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Under s. 13(3)(a)(ii), landlord entitled to evict from rented land only if requires it principally for business or trade, not for constructing residential house.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Municipal Committee, Abohar v. Daulat Ram",
      "citation": "I.L.R. 1959 Punj. 1131",
      "treatment": "overruled",
      "relevance": "Held that s. 13(3)(a)(ii) allows eviction for any own use; Supreme Court holds this incorrect as it ignores sub-cls. (b) and (c)"
    }
  ],
  "statutes_cited": [
    {
      "name": "East Punjab Urban Rent Restriction Act, No. III of 1949",
      "sections": [
        "s. 2(f)",
        "s. 13(3)(a)(ii)",
        "s. 13(1)",
        "s. 13(2)",
        "s. 13(3)(a)",
        "s. 13(3)(b)",
        "s. 13(3)(c)"
      ],
      "relevance": "Defines rented land and grounds for eviction; court interprets s. 13(3)(a)(ii) restrictively to business use when read with (b) and (c)"
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; view of High Court and Appellate Authority set aside; respondent not entitled to eject appellant under s. 13(3)(a)(ii) as he requires land for residential house, not business.",
    "relief_granted": "Ejectment application dismissed",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"the words for his own use in sub-cl. a in the circumstances must be limited... to use principally for business or trade.\"",
      "speaker": "court",
      "significance": "Core holding restricting scope of eviction ground"
    },
    {
      "text": "\"We are of opinion therefore that sub-cls. a, b and c in this provision must be read together, and reading them together there can be no doubt that... the meaning there is restricted to use principally for business or trade.\"",
      "speaker": "court",
      "significance": "Explains interpretive approach to the provision"
    }
  ],
  "_case_id": "1966_135",
  "_label": 1,
  "_text_length": 13486,
  "_extracted_at": "2026-02-10T19:40:09.134852"
}