{
  "metadata": {
    "case_name": "Plaintiffs v. Third Defendant",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "Bachawat, J."
    ],
    "case_number": "Civil Appeal No. 196 of 1964",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Nursingdas Seal was the owner of garden land measuring 31 bighas known as premises Nos. 26, 27 and 28, Dum Dum Cossipore Road, Ghooghoodanga.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Nursingdas Seal died in December 1888 leaving a will dated December 11, 1888 appointing his widow Sukheswari as executrix and bequeathing his estate to Sukheswari for her natural life and thereafter to his son Nilakantha absolutely by way of vested remainder.",
      "type": "material",
      "date": "1888-12-11",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On September 9, 1899, Sewdas Mobata purchased the interest of Nilkantha in the garden lands at an auction sale held in execution of a decree passed in a suit to enforce a mortgage dated September 7, 1893 executed by Nilkantha.",
      "type": "material",
      "date": "1899-09-09",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Nilkantha became an insolvent and his estate vested in the Official Assignee of Bengal.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Sewdas's title to the property subject to the life interest of Sukheswari was confirmed by a compromise decree dated February 17, 1904 passed in Suit No. 595 of 1901 and a conveyance dated August 17, 1904 executed by Sukheswari and the Official Assignee of Bengal.",
      "type": "material",
      "date": "1904-02-17",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "On April 20, 1933, Sukheswari died.",
      "type": "material",
      "date": "1933-04-20",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "The title of Sewdas to the property subsequently devolved on the plaintiffs.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "On July 30, 1901, Upendra Nath Addey obtained from Sukheswari a Mourashi Mokrari lease of 6 bighas out of the 31 bighas of garden land (comprised in C.S. Dags Nos. 144-150) on payment of Rs. 1,300/- by way of salami or premium.",
      "type": "material",
      "date": "1901-07-30",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "The lease was executed by Sukheswari in pursuance of a decree passed against her on September 2, 1899, in a suit for specific performance of an agreement executed by her in or about 1891.",
      "type": "material",
      "date": "1899-09-02",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "The leasehold interest of Upendra Nath became subsequently vested in the third defendant.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "On September 15, 1945, the plaintiffs instituted the suit claiming declaration of title, recovery of khas possession of the garden lands and other reliefs.",
      "type": "procedural",
      "date": "1945-09-15",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "The trial Court decreed the suit.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "The decree passed against defendants other than the third defendant was confirmed by the High Court and has become final.",
      "type": "procedural",
      "date": "1954-09-08",
      "source": "court"
    },
    {
      "id": "f14",
      "text": "In the appeal by the third defendant, the High Court confirmed the trial Court's decree declaring plaintiffs' title to 6 bighas in C.S. Dags Nos. 144-150, but set aside decree for khas possession and mesne profits, and passed decree for 3 years' rent.",
      "type": "procedural",
      "date": "1954-09-08",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the will of Nursingdas Seal imposed any restriction on the power of the executrix Sukheswari to dispose of his immovable properties vested in her as executrix, specifically to grant the lease.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Sukheswari had no power to grant the lease as clause 4 of the will imposed restriction on her power to dispose of the estate.",
      "supporting_facts": [
        "f2",
        "f8"
      ],
      "legal_basis": "Clause 4 of the will"
    },
    {
      "id": "pa2",
      "text": "Specific authority in clause 4 to sell portion of estate for marriage expenses negatived authority to deal with estate in other ways.",
      "supporting_facts": [
        "f2"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Lease was executed to raise money for marriage expenses of her daughter, and under clause 4 she could only sell, not lease or otherwise.",
      "supporting_facts": [
        "f8",
        "f9"
      ],
      "legal_basis": "Clause 4 of the will"
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Clause 4 authorised Sukheswari to sell portion for marriages but does not impose general restriction on power to dispose under s. 90 of Probate and Administration Act, 1881.",
      "addresses_issue": "i1",
      "key_observation": "Specific authority does not negative other powers; testator could not have intended restriction for debts/maintenance payments."
    },
    {
      "id": "cr2",
      "text": "Even assuming lease for marriage expenses, clause 4 does not fetter power to lease; clear language required to restrict s. 90 power.",
      "addresses_issue": "i1",
      "key_observation": "No such language in will; expressum facit cessare tacitum has no application."
    },
    {
      "id": "cr3",
      "text": "Agreed with Purna Chandra Bakshi v. Nobin Chandra Gangopadhya that authority to sell does not prohibit mortgaging or other disposals under s. 90.",
      "addresses_issue": "i1",
      "key_observation": "Clause 4 not general restriction."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Clause 4 of Nursingdas's will did not impose any restriction on executrix's power to lease property under s. 90 of Probate and Administration Act, 1881.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Lease is binding on plaintiffs; they cannot recover khas possession.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Purna Chandra Bakshi v. Nobin Chandra Gangopadhya",
      "citation": "1913 8 C.W.N. 362",
      "treatment": "followed",
      "relevance": "Provision authorising sale to pay debts does not prohibit mortgaging under s. 90; express power to sell does not restrict other disposals."
    }
  ],
  "statutes_cited": [
    {
      "name": "Probate and Administration Act, 1881 (Act No. 5 of 1881)",
      "sections": [
        "s. 90"
      ],
      "relevance": "Conferred power on executrix to lease unless restricted by will; no such restriction found."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal is dismissed as clause 4 of the will imposed no restriction on the executrix's power to grant the lease under s. 90 of the Probate and Administration Act, 1881. The lease is binding on the plaintiffs, and they cannot recover khas possession. This finding suffices for disposal.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The only question arising in this certificates appeal is whether the will of Nursingdas Seal imposed any restriction on the power of the executrix appointed by the will to dispose of his immovable properties vested in her as the executrix.",
      "speaker": "court",
      "significance": "Frames the sole issue in the appeal."
    },
    {
      "text": "Clear language was required for restricting the power of the executrix to deal with the property under s. 90 of the Probate and Administration Act, 1881. The will contained no such language.",
      "speaker": "court",
      "significance": "Key reasoning rejecting restriction on executrix powers."
    },
    {
      "text": "In our opinion, clause 4 of the will of Nursingdas did not impose any restriction on the power of the executrix to lease the property in due course of administration.",
      "speaker": "court",
      "significance": "Core holding upholding the lease."
    }
  ],
  "_case_id": "1966_164",
  "_label": 0,
  "_text_length": 7567,
  "_extracted_at": "2026-02-10T19:40:11.487281"
}