{
  "metadata": {
    "case_name": "Commissioner of Income Tax v. Tata Locomotive and Engineering Co. Ltd.",
    "case_year": 1965,
    "court": "Supreme Court of India",
    "judges": [
      "Sikri, J."
    ],
    "case_number": "Civil Appeal No. 236 of 1965",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The respondent, Tata Locomotive and Engineering Co. Ltd., is a limited company registered under the Indian Companies Act VII of 1913, with registered office at Bombay. Main business is manufacture of locomotive boilers and locomotives.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Assessee appointed Messrs. Tata Inc., New York, as its purchasing agent in the U.S.A.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "With sanction of Exchange Control Authorities, remittance of 33,830 made in 1949 to Tata Inc. for purchasing capital goods from U.S.A. and meeting other expenses connected therewith.",
      "type": "material",
      "date": "1949",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Assessee was selling agent of Baldwin Locomotive Works for sale of their products in India, incurred expenses on their behalf in India, reimbursed by Baldwin by paying to Tata Inc.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Amount reimbursed retained in assessee's account with Tata Inc. for purchase of capital goods.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "As sole selling agent, assessee entitled to commission from Baldwin Locomotive Works. Commission payable in dollars made over to Tata Inc. with sanction of Exchange Control Authorities.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Reason: Assessee's letter dated October 26, 1948 to Reserve Bank of India stated it would be more convenient if commission deposited into account with Tata Inc. to reduce remittances from India; to be utilised for purchase of capital goods as per letter TC-679 dated August 15, 1946.",
      "type": "material",
      "date": "1948-10-26",
      "source": "assessee"
    },
    {
      "id": "f8",
      "text": "Amount received as commission taxed in relevant assessment years on accrual basis; tax paid.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "On September 16, 1949, balance of 48,572.30 in assessee's account with Tata Inc.: Remittances from Bombay 33,850 less spent 30,282.96 = 3,567.04; Reimbursed by Baldwin 8,882.24; Commission 36,123.02; Total 48,572.30.",
      "type": "material",
      "date": "1949-09-16",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "On September 16, 1949, pound sterling devalued; rate rupee-dollar prior Rs. 3.330 per dollar, post Rs. 4.775 per dollar.",
      "type": "material",
      "date": "1949-09-16",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Assessee decided to repatriate dollars due to higher cost and import restrictions; applied to Reserve Bank on December 17, 1949.",
      "type": "material",
      "date": "1949-12-17",
      "source": "assessee"
    },
    {
      "id": "f12",
      "text": "Reserve Bank permitted repatriation of 40,000; later 9,500 in October 1950. Treated as accounting year ended March 31, 1950.",
      "type": "procedural",
      "date": "1950",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Repatriation of 49,500 including 48,572.30 gave surplus Rs. 70,147 on conversion.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Income-tax Officer assessed Rs. 70,147 as profits incidental to business.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f15",
      "text": "Appellate Assistant Commissioner affirmed except reduced by Rs. 6,894; viewed commission and reimbursement as circulating capital.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f16",
      "text": "Tribunal excluded profits on 3,567.04 and 8,882.24 as capital; on 36,123.02 held taxable as trading profit from commission.",
      "type": "procedural",
      "date": null,
      "source": "tribunal"
    },
    {
      "id": "f17",
      "text": "High Court answered questions in negative: commission appropriated for capital goods, became fixed capital; surplus capital accretion, not taxable.",
      "type": "procedural",
      "date": "1961-08-30",
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether on the facts and in the circumstances of the case, the surplus or difference arising as a result of devaluation in the process of converting dollar currency in regard to the sum of 36,123/02 repatriated to India was profit which was taxable in the hands of the assessee?",
      "framed_by": "tribunal"
    },
    {
      "id": "i2",
      "text": "Whether the said sum of 36,123/02 having been taxed in the relevant earlier years, the surplus or difference in dollar exchange account arising by reason of the repatriation thereof as a result of devaluation was rightly taken as profit taxable?",
      "framed_by": "tribunal"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "If commission had remained in U.S.A. and repatriated post-devaluation, taxable; permission of Reserve Bank and decision to hold for capital goods does not change; crediting rupee equivalent and paying tax on accrual irrelevant.",
      "supporting_facts": [
        "f8",
        "f10"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Assessee not a dealer in foreign exchange; did not hold for revenue or trading; when kept/used on capital account to acquire capital assets, not circulating capital, profit is capital appreciation though originally revenue receipt.",
      "supporting_facts": [
        "f3",
        "f6",
        "f7"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Answer depends on whether keeping 36,123.02 for capital purposes after Reserve Bank sanction was part of trading transaction. It was revenue receipt initially, but instead of repatriating, sanction obtained to utilise for buying capital goods in manufacturing business - independent transaction, first step to acquisition of capital goods, not trading.",
      "addresses_issue": "i1",
      "key_observation": "Keeping money there same as repatriating and remitting back; new transaction for capital acquisition."
    },
    {
      "id": "cr2",
      "text": "No need to discuss cited cases as none exactly in point.",
      "addresses_issue": "i2",
      "key_observation": "High Court right in answering questions negative."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Surplus on 36,123.02 not taxable as trading profit; capital accretion.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Prior taxation on accrual does not make devaluation surplus taxable.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Davies v. The Shell Company of China",
      "citation": "22 I.T.R. Supp. 1",
      "treatment": "followed",
      "relevance": "High Court relied on ratio supporting view that amount became fixed capital."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income Tax Act, 1922",
      "sections": [
        "s. 66A(2)"
      ],
      "relevance": "Basis for certificate and reference to High Court."
    },
    {
      "name": "Indian Companies Act, 1913",
      "sections": [
        "VII"
      ],
      "relevance": "Assessee registered under this Act."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court upheld Bombay High Court judgment answering both questions in negative; surplus arising from devaluation on repatriation of dollar commission amount utilised for capital purposes not taxable as business profit.",
    "relief_granted": "Appeal dismissed; assessee not liable to tax on surplus.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "In our view it was not a trading transaction in the business of manufacture of locomotive boilers and locomotives it was clearly a transaction of accumulating dollars to pay for capital goods, the first step to the acquisition of capital goods.",
      "speaker": "court",
      "significance": "Core reasoning distinguishing capital from trading transaction."
    },
    {
      "text": "If the assessee had repatriated 36,123.02 and then after obtaining the sanction of the Reserve Bank remitted 36,123.02 to the U.S.A., Mr. Sastri does not contest that any profit made on devaluation would have been a capital profit.",
      "speaker": "court",
      "significance": "Hypothetical confirming nature unchanged by location."
    }
  ],
  "_case_id": "1966_141",
  "_label": 0,
  "_text_length": 13946,
  "_extracted_at": "2026-02-10T19:40:12.955033"
}