{
  "metadata": {
    "case_name": "State of Madras v. M/s Radio Electricals Ltd. & Ors.",
    "case_year": 1965,
    "court": "Supreme Court of India",
    "judges": [
      "Shah, J."
    ],
    "case_number": "Civil Appeals Nos. 334, 335 and 338 of 1965",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "M/s Radio Electricals Ltd., respondents in Civil Appeal No. 334 of 1965, carry on business in the State of Madras in electrical equipment and are registered as dealers under the Central Sales Tax Act.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Bombay State Electricity Board, Saurashtra Division, engaged in production of electric energy, purchased transformers and other goods of total value of Rs. 1,42,020/- from M/s Radio Electricals Ltd. for the year 1957-58.",
      "type": "material",
      "date": "1957-58",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "M/s Radio Electricals Ltd. claimed liability to pay tax at 1% on the turnover under s. 8(1) of Central Sales Tax Act.",
      "type": "procedural",
      "date": "1957-58",
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "Deputy Commercial Tax Officer rejected the claim on ground that Bombay State Electricity Board was not a dealer engaged in selling goods.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "Appellate Assistant Commissioner confirmed, holding transformers etc. not intended for manufacture of goods for sale as electricity was not goods.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "Sales Tax Appellate Tribunal, Madras confirmed the order.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "High Court of Madras, following Deputy Commissioner v. Manohar Brothers, modified order: for turnover Rs. 42,080/- certificates mentioned manufacture of electrical energy (not a purpose in s.8(3)(b)), denied concessional rate; for Rs. 47,340/- accepted certificates even if all purposes mentioned.",
      "type": "procedural",
      "date": "1963-01-01",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "M/s Stanes Motors (South India) Ltd., respondents in Civil Appeal No. 335 of 1965, dealers in automobiles, tractors and spare parts.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "For year 1957-58, claimed concessional rate under s.8(1) on turnover of Rs. 1,38,572/12/- from sale of tractors to four tea factories in Kerala, registered dealers.",
      "type": "material",
      "date": "1957-58",
      "source": "respondent"
    },
    {
      "id": "f10",
      "text": "Purchasing tea factories delivered Form C certificates declaring tractors intended for use in manufacture of tea for sale.",
      "type": "material",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f11",
      "text": "Tax Officer denied concessional rate as tractors not for resale and not directly relatable to manufacturing process.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Appellate Assistant Commissioner confirmed, tractors used for transporting tea leaves not used in manufacture.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Sales Tax Appellate Tribunal held entitled for sales to two out of four factories holding Form B specifying machinery under s.8(3)(b).",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "High Court confirmed Tribunal's order in revisional jurisdiction.",
      "type": "procedural",
      "date": "1962-11-07",
      "source": "lower_court"
    },
    {
      "id": "f15",
      "text": "Civil Appeals Nos. 335 and 338 concern same assessee for different periods.",
      "type": "background",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "When a purchasing dealer furnishes Form C declaration certifying goods covered by registration certificate in Form B and intended for resale, manufacture for sale, execution of contracts, or packing, is it open to Sales Tax authority to deny selling dealer concessional rate under s.8(1) on grounds that Form C mentions more than one purpose, goods incapable of such use, or applied to other purpose?",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Commercial Tax Officer can scrutinise transactions: whether Form C genuine and valid in law, purchasing dealer holds valid Form B, goods can be used for purpose in Form C, and goods applied for declared purpose.",
      "supporting_facts": [
        "f4",
        "f11"
      ],
      "legal_basis": "Central Sales Tax Act, 1956"
    },
    {
      "id": "pa2",
      "text": "Form C specifying more purposes than one is invalid.",
      "supporting_facts": [],
      "legal_basis": "Central Sales Tax (Registration & Turnover) Rules, 1957, Form C"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "If selling dealer produces Form C setting out one or more purposes in s.8(3)(b), and authorities do not deny purchasing dealer is registered, concessional rate cannot be denied even if goods utilised otherwise.",
      "supporting_facts": [
        "f7",
        "f14"
      ],
      "legal_basis": "s.8(1), s.8(3)(b) Central Sales Tax Act"
    },
    {
      "id": "ra2",
      "text": "Whether goods used or usable for purpose irrelevant if declaration furnished; selling dealer not to examine judicially.",
      "supporting_facts": [],
      "legal_basis": "s.8(1) Central Sales Tax Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Form C allows retaining multiple purposes; not defective if more than one purpose specified as goods may be for multiple uses or purpose undecided but within permitted.",
      "addresses_issue": "i1",
      "key_observation": "Act and Rules do not require declaring only one purpose."
    },
    {
      "id": "cr2",
      "text": "Sales Tax authority can check genuineness of Form C and if goods covered by purchasing dealer's Form B, but cannot enquire if goods usable for declared purpose or actually used as such.",
      "addresses_issue": "i1",
      "key_observation": "Usability determined by notifying authority issuing Form B objectively."
    },
    {
      "id": "cr3",
      "text": "Selling dealer relies on representations in Form C; no duty to check application of goods. Penalty for misuse on purchasing dealer under s.10.",
      "addresses_issue": "i1",
      "key_observation": "Seller has no control over purchaser's use."
    },
    {
      "id": "cr4",
      "text": "High Court observation that no enquiry if within Form B inaccurate; authority can check coverage by Form B.",
      "addresses_issue": "i1",
      "key_observation": "But cannot challenge inclusion in Form B."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Selling dealer entitled to concessional rate under s.8(1) if Form C genuine, goods specified in purchasing dealer's Form B, regardless of multiple purposes, usability, or actual use.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Deputy Commissioner of Commercial Taxes, Madras Division v. Manohar Brothers",
      "citation": "13 S.T.C. 686",
      "treatment": "followed",
      "relevance": "High Court followed this for allowing concessional rate on Form C production."
    },
    {
      "case_name": "Indian Copper Corporation Ltd. v. Commissioner of Commercial Taxes, Bihar",
      "citation": null,
      "treatment": "referred",
      "relevance": "Legality of refusing Form B for certain goods."
    },
    {
      "case_name": "J. Cotton Spinning & Weaving Co. Ltd. v. Sales Tax Officer, Kanpur",
      "citation": "16 S.T.C. 563",
      "treatment": "referred",
      "relevance": "Challenge to Form B issuance."
    }
  ],
  "statutes_cited": [
    {
      "name": "Central Sales Tax Act, 1956",
      "sections": [
        "s.6",
        "s.7",
        "s.8(1)",
        "s.8(3)(a)",
        "s.8(3)(b)",
        "s.8(4)",
        "s.10",
        "s.13",
        "s.14"
      ],
      "relevance": "Imposes tax on inter-State sales, concessional rate for registered dealers on specified goods with Form C; penalties for misuse."
    },
    {
      "name": "Central Sales Tax (Registration & Turnover) Rules, 1957",
      "sections": [
        "r.5(1)",
        "r.12",
        "Form B",
        "Form C"
      ],
      "relevance": "Prescribes registration, Forms B and C for declarations."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "All appeals by State of Madras dismissed; High Court orders confirmed allowing concessional rates where Form C produced and goods covered by Form B.",
    "relief_granted": "Concessional rate of tax under s.8(1) upheld for respondents.",
    "costs": "Dismissed with costs."
  },
  "key_quotes": [
    {
      "text": "When the purchasing dealer furnishes a certificate in Form C without striking out any of the four alternatives, it is a representation that the goods purchased are intended to be used for all or any of the purposes, and the certificate complies with the requirements of the Act and the Rules.",
      "speaker": "court",
      "significance": "Clarifies validity of Form C with multiple purposes."
    },
    {
      "text": "It is not for the Tax Officer to hold an enquiry whether the goods specified in the certificate of registration of the purchaser can be used by him for any of the purposes mentioned by him in Form C, or that the goods purchased have in fact not been used for the purpose declared in the certificate.",
      "speaker": "court",
      "significance": "Limits scope of enquiry by tax authorities."
    },
    {
      "text": "The selling dealer is under no further obligation to see to the application of the goods for the purpose for which it was represented that the goods were intended to be used.",
      "speaker": "court",
      "significance": "Protects selling dealer relying on Form C."
    }
  ],
  "_case_id": "1966_303",
  "_label": 0,
  "_text_length": 26714,
  "_extracted_at": "2026-02-10T19:42:18.310283"
}