{
  "metadata": {
    "case_name": "Heirs of Lalji Jetha and Kanji Jetha v. Respondents Nos. 1 and 2",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "Shelat, J."
    ],
    "case_number": "Civil Appeal No. 727 of 1964",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "One Soni Virji Sundarji for himself and on behalf of the Hindu joint family of which he was the Karta executed a deed of mortgage dated December 11, 1907 in respect of two shops in Jamnagar in favour of Jetha Roopchand, to secure repayment of Rs. 800 advanced to the said family. The said mortgage was with possession and was redeemable in 8 years.",
      "type": "background",
      "date": "1907-12-11",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Virji died in the meantime.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On August 25, 1930 the co-parceners of Virji, by an agreement of sale agreed to sell and respondents 1 and 2 agreed to purchase the said two shops together with certain other properties for Rs. 3,200, subject to the said mortgage.",
      "type": "material",
      "date": "1930-08-25",
      "source": "respondents"
    },
    {
      "id": "f4",
      "text": "In spite of the said agreement of sale the co-parceners of Virji by a registered deed of sale dated September 10, 1930 sold the said shops and the said properties to Lalji Jetha and Kanji Jetha, the sons of said Jetha Roopchand, for Rs. 3,400.",
      "type": "material",
      "date": "1930-09-10",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The said Lalji and Kanji both died and the appellants and respondents 3 to 9 are the heirs and legal representatives of the said Lalji and Kanji respectively.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "On October 1, 1930, respondents 1 and 2 filed a suit being suit No. 263 of Samwat Year 1987 (1931 A.D.) for specific performance of the said agreement dated August 25, 1930 against the said mortgagors and the said Kanji, being defendant No. 5 therein. Lalji, however, was not made a party defendant.",
      "type": "procedural",
      "date": "1930-10-01",
      "source": "respondents"
    },
    {
      "id": "f7",
      "text": "Respondents 1 and 2 alleged in the suit inter alia that as Kanji was anxious to purchase the said shops, he, in collusion with the said mortgagors and with mala fide intention, sought to purchase the said properties for a sum higher than the one agreed to by them and got the mortgagors to commit breach of the said agreement in order to deprive them of the benefit of the said agreement.",
      "type": "disputed",
      "date": null,
      "source": "respondents"
    },
    {
      "id": "f8",
      "text": "The plaint contained a prayer for specific performance against the mortgagees being defendants 1 to 4 and for a decree against Kanji to hand over possession of the said shops on respondents 1 and 2 paying off the amount due under the said mortgage. The basis of the suit thus was that Kanji had not acquired any ownership in the said shops and only possessed the mortgagees rights therein.",
      "type": "material",
      "date": null,
      "source": "respondents"
    },
    {
      "id": "f9",
      "text": "The Trial Court declined to grant specific performance and awarded damages.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "On appeal by respondents 1 and 2 the Joint Civil Judge by his judgment and decree dated August 16, 1943 reversed the judgment and decree of the Trial Court dismissing the suit and allowing the appeal passed a decree for specific performance against the said mortgagors.",
      "type": "procedural",
      "date": "1943-08-16",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "The defence of Kanji that he was a bona fide purchaser without notice was rejected.",
      "type": "admitted",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "The Joint Civil Judge observed that all the equities in the case are in favour of the plaintiffs and passed a decree for specific performance of the contract as prayed for by them in their plaint subject to the modification mentioned above re, their deferred right to secure possession of the shops later on after redeeming the same from the 5th defendant.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "He directed Kanji on payment of Rs. 2,065 to him by respondents 1 and 2 to hand over possession of the said shops and also directed that all the defendants respondents should execute the necessary registered formal sale deeds about all the five properties in favour of the plaintiffs subject to Kanji Jetha's right to continue in possession of the two shops till the plaintiffs redeem the mortgage of 1907.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "Neither Kanji nor the mortgagors filed any appeal against the said judgment and decree and therefore that decree became final and binding as between the parties.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f15",
      "text": "On October 8, 1947 respondents 1 and 2 filed Suit No. 283 of 1949 for redemption and possession against Kanji and Lalji.",
      "type": "procedural",
      "date": "1947-10-08",
      "source": "respondents"
    },
    {
      "id": "f16",
      "text": "In his written statement Lalji alleged that since he was not a party to the earlier suit the said decree was not binding upon him, that as a result of the said deed of sale dated September 10, 1930 he and Kanji became absolute owners and the right of redemption by the mortgagors and those claiming through them became extinguished, that Kanji had by an oral sale transferred his right, title and interest to him and therefore he was the absolute owner, and lastly that as a result of the sale deed he acquired ownership, that his possession was to the knowledge of the plaintiffs and was adverse against them and therefore the suit was barred by limitation.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f17",
      "text": "Kanji also filed a written statement supporting Lalji in regard to his having transferred to him his right, title and interest in the said shops.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f18",
      "text": "The Trial Court held that as Lalji was not a party to the former suit the said decree was not binding on him, that on the passing of the said sale deed Kanji and Lalji claimed their possession as owners, that their possession was adverse, that the said decree did not affect Lalji's title, ripened as a result of adverse possession, that the present suit ought to have been filed before 1942 and therefore a preliminary decree for redemption could only be passed against Kanji. On this footing, the Trial Court dismissed the suit against Lalji.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f19",
      "text": "This decree meant that the Trial Court did not accept the contention of Kanji and Lalji that the former had parted with his right, title and interest in favour of Lalji as alleged by them.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f20",
      "text": "Respondents 1 and 2 filed Appeal No. 104 of 1951 in the District Court, Jamnagar.",
      "type": "procedural",
      "date": null,
      "source": "respondents"
    },
    {
      "id": "f21",
      "text": "Lalji also filed cross-objections on the ground that he had purchased Kanji's right, title and interest in the said properties before the decree was passed in the former suit and therefore the decree being only against Kanji it was not binding upon him.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f22",
      "text": "By his judgment and decree dated November 18, 1952 the District Judge allowed the appeal of respondents 1 and 2 holding that Kanji being the elder brother, became the Karta and manager of the said joint family on the death of the said Jetha, that Kanji represented the joint family and therefore it was not necessary to join Lalji as a party in the said suit and the decree was valid and binding on both the brothers.",
      "type": "procedural",
      "date": "1952-11-18",
      "source": "lower_court"
    },
    {
      "id": "f23",
      "text": "The District Judge also rejected Lalji's plea of his having acquired Kanji's interest in the said shops and dismissed his cross-objections.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f24",
      "text": "The District Judge held that the sale deed in favour of Lalji and Kanji conferred no right on them as against respondents 1 and 2 and since their agreement was in point of time earlier than the said sale deed they were entitled to a decree for specific performance.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f25",
      "text": "He also held that though 12 years had passed since the execution of the said deed Lalji could not become the owner of those properties by adverse possession as a mortgagee-in-possession cannot by merely asserting possession as an owner under an invalid sale convert his possession into adverse possession.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f26",
      "text": "Lalji filed a second appeal, being Second Appeal No. 20 of 1953 in the High Court of Saurashtra.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f27",
      "text": "By his judgment and decree dated September 3, 1955 the learned Single Judge allowed the appeal and dismissed the suit holding that though Lalji and Kanji as mortgagees in possession could not convert their possession during the subsistence of the said mortgage into adverse possession by assertion of ownership in the property or otherwise by a unilateral act, if by common consent the mortgagors and the mortgagees agree to put an end to the mortgagee's estate by the mortgagors executing a deed of sale and the mortgagees assert their right by ownership under such a sale, even if such sale were to be declared to be invalid their possession becomes adverse and such adverse possession ripens into a title if it continues for the statutory period.",
      "type": "procedural",
      "date": "1955-09-03",
      "source": "lower_court"
    },
    {
      "id": "f28",
      "text": "Aggrieved by the said judgment and decree respondents 1 and 2 filed a Letters Patent Appeal.",
      "type": "procedural",
      "date": null,
      "source": "respondents"
    },
    {
      "id": "f29",
      "text": "The Division Bench of the High Court of Bombay at Rajkot allowed the appeal, reversed the judgment and decree passed by the learned Single Judge and restored the judgment and decree passed by the District Judge.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f30",
      "text": "The Division Bench took into account the fact of a deed of conveyance dated April 29, 1947 having been executed through the court in pursuance of the said decree for specific performance by the mortgagors and signed by Kanji as an attesting witness.",
      "type": "material",
      "date": "1947-04-29",
      "source": "lower_court"
    },
    {
      "id": "f31",
      "text": "On the strength of this deed the Division Bench held that Kanji and Lalji held the said shops in their capacity as mortgagees only, as the said shops were not conveyed to respondents 1 and 2. But the Division Bench also held that even before the execution of the said deed dated April 29, 1947 Kanji and Lalji were not in adverse possession since their possession could never amount to adverse possession in law and therefore Kanji and Lalji were at no point of time in adverse possession of the said shops.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f32",
      "text": "The appellants then applied for a certificate in the High Court and on its refusal obtained special leave from this Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the possession of Kanji and Lalji after the sale deed of September 10, 1930 was adverse to respondents 1 and 2, such that the suit for redemption filed in 1947 was barred by limitation.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the decree for specific performance in suit No. 263 of 1930 bound Lalji, who was not a party, and affected the character of possession.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether Kanji represented the joint family as Karta, binding Lalji to the decree.",
      "framed_by": "respondent"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Lalji was not a party to the earlier suit, so the decree was not binding on him; the sale deed of 1930 made them absolute owners, extinguishing redemption rights; Kanji orally transferred his share to Lalji; possession was adverse and suit barred by limitation.",
      "supporting_facts": [
        "f16",
        "f18"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "The sale of 1930 to mortgagees ended the mortgage estate; even if sale invalid as to respondents 1 and 2, possession became adverse and ripened into title.",
      "supporting_facts": [
        "f4",
        "f27"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "The specific performance decree did not disturb the adverse possession; Kanji was only attesting witness in 1947 conveyance, not conveying party.",
      "supporting_facts": [
        "f30",
        "f31"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Kanji colluded with mortgagors to breach the prior agreement; Kanji only had mortgagee rights, not ownership.",
      "supporting_facts": [
        "f7",
        "f8"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Kanji as elder brother and Karta represented the joint family, so decree bound Lalji.",
      "supporting_facts": [
        "f22"
      ],
      "legal_basis": null
    },
    {
      "id": "ra3",
      "text": "Mortgagee-in-possession cannot convert possession to adverse by asserting ownership under invalid sale.",
      "supporting_facts": [
        "f25"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "As mortgagees-in-possession, Kanji and Lalji could not unilaterally convert possession to adverse, but mortgagor can sell to mortgagee, ending mortgage and converting possession to owner's; even if sale voidable, possession as owner ripens if continued.",
      "addresses_issue": "i1",
      "key_observation": "Sale valid between mortgagors and Kanji/Lalji, but subject to prior contract rights."
    },
    {
      "id": "cr2",
      "text": "Section 40 TPA: Third party with prior contract obligation enforced against transferee with notice; s91 Trusts Act: Purchaser with notice holds for benefit of prior contractor; sale not void but voidable; possession not adverse to prior purchasers.",
      "addresses_issue": "i1",
      "key_observation": "Kanji/Lalji in fiduciary position to respondents 1 and 2; possession never adverse against them."
    },
    {
      "id": "cr3",
      "text": "Specific performance decree did not alter adverse character per precedents like Subbaiya Pandaram; but due to fiduciary duty, no adverse possession anyway.",
      "addresses_issue": "i1",
      "key_observation": "Reach same result as High Court on different reasons."
    },
    {
      "id": "cr4",
      "text": "Kanji attesting 1947 conveyance aware of rights; decree required all defendants including Kanji to execute, misconception not changing conclusion.",
      "addresses_issue": "i3",
      "key_observation": "Possession not adverse to respondents 1 and 2."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Sale to mortgagees valid between parties, converts possession to owner's, but subject to prior agreement; transferee with notice holds as trustee per s40 TPA and s91 Trusts Act; possession not adverse to prior specific performance claimants; redemption suit not barred.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Subbaiya Pandaram v. Mohamad Mustapha Maracayar",
      "citation": "50 I.A. 295",
      "treatment": "followed",
      "relevance": "Declaration of invalidity does not disturb adverse possession quality if no execution."
    },
    {
      "case_name": "Dagadabhai v. Sakharam",
      "citation": "A.I.R. 1948 Bom. 149",
      "treatment": "followed",
      "relevance": "Decree not executed does not interrupt adverse possession."
    },
    {
      "case_name": "Bogilal v. Ratanlal",
      "citation": "A.I.R. 1939 Bom. 261",
      "treatment": "referred",
      "relevance": "Supports that unexecuted decree does not affect possession nature."
    },
    {
      "case_name": "Lala Durga Prasad v. Lala Deep Chand",
      "citation": "1954 S.C.R. 360",
      "treatment": "followed",
      "relevance": "Sale to subsequent purchaser with notice voidable; holds as trustee; decree should join vendor and purchaser."
    },
    {
      "case_name": "Gafur v. Bhikaji Govind",
      "citation": "26 I.L.R. Bom. 159",
      "treatment": "followed",
      "relevance": "Purchaser with notice of prior contract holds for benefit of prior purchaser."
    },
    {
      "case_name": "Sathiraju v. Venkanna",
      "citation": "A.I.R. 1935 Mad. 333",
      "treatment": "followed",
      "relevance": "s91 Trusts Act makes purchaser with notice hold for prior contractor."
    },
    {
      "case_name": "Appa Rao v. Veeranna",
      "citation": "A.I.R. 1953 Mad. 409",
      "treatment": "referred",
      "relevance": "Decree for specific performance requires purchaser to join conveyance."
    }
  ],
  "statutes_cited": [
    {
      "name": "Transfer of Property Act, 1882",
      "sections": [
        "Section 40 paragraph 2",
        "Section 54"
      ],
      "relevance": "Obligation from prior contract enforced against transferee with notice; contract does not create equitable estate."
    },
    {
      "name": "Specific Relief Act, 1877",
      "sections": [
        "Section 3"
      ],
      "relevance": "Defines obligation enforceable by law; trustee includes constructive trustee for prior contractor."
    },
    {
      "name": "Indian Trusts Act, 1882",
      "sections": [
        "Section 91"
      ],
      "relevance": "Purchaser with notice of prior enforceable contract holds property for benefit of prior party."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court dismissed the appeal, upholding the High Court's decree allowing respondents 1 and 2's suit for redemption and possession, holding that possession of Kanji and Lalji was not adverse against respondents 1 and 2 due to their fiduciary obligation under prior contract, and the suit was not barred by limitation.",
    "relief_granted": "Redemption and possession to respondents 1 and 2 against appellants.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"a mortgagor can sell the mortgaged property to his mortgagee and thus put the mortgagee's estate to an end and thereafter all the right, title and interest in the property would vest in the mortgagee.\"",
      "speaker": "court",
      "significance": "Explains validity of sale between mortgagor and mortgagee."
    },
    {
      "text": "\"Kanji and Lalji being in a fiduciary position, their possession was not adverse as against respondents 1 and 2. Therefore their suit for redemption cannot be said to be barred even though the statutory period had expired.\"",
      "speaker": "court",
      "significance": "Core holding on non-adverse possession and limitation."
    },
    {
      "text": "\"All the equities in the case are in favour of the plaintiffs and I therefore pass a decree for specific performance of the contract as prayed for by them\"",
      "speaker": "lower_court",
      "significance": "Joint Civil Judge's decree in first suit."
    }
  ],
  "_case_id": "1966_130",
  "_label": 0,
  "_text_length": 21246,
  "_extracted_at": "2026-02-10T19:40:33.402374"
}