{
  "metadata": {
    "case_name": "Appellants (Mortgagees) v. Respondents (Custodian)",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "Wanchoo, J."
    ],
    "case_number": "Civil Appeal No. 102 of 1964",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellants were mortgagees of certain properties, including a house, on the basis of a mortgage-bond dated July 19, 1928. Consideration of the bond was Rs. 25,000 and interest was provided at nine per cent per annum compoundable annually.",
      "type": "background",
      "date": "1928-07-19",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Out of the properties covered by the bond, one of the properties was sold to Bibi Chand Tara on October 23, 1937 subject to the earlier mortgage of 1928.",
      "type": "material",
      "date": "1937-10-23",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "In October 1949, Bibi Chand Tara was declared an evacuee.",
      "type": "material",
      "date": "1949-10",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "In 1939 the appellants filed a suit against the original mortgagors and others including Bibi Chand Tara for the amount due under the mortgage. A preliminary decree was passed in their favour in March 1942 and the final decree followed in April 1945.",
      "type": "procedural",
      "date": "1939 / 1942-03 / 1945-04",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Certain sums were received by the appellants before they had filed the suit. Certain other sums were also received after the preliminary and final decrees.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Certain Zamindari properties which were also included in the mortgage had been sold after the final decree and the money appropriated towards the decree. Another house which was also included in the mortgage bond was sold later and the sale money was again appropriated towards the decree.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Appellants put the decree in execution in November 1952 against the house in dispute for a sum of Rs. 60,000 and odd. There was a sale in that execution proceeding, but it was set aside on the application of the Assistant Custodian, Patna.",
      "type": "procedural",
      "date": "1952-11",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Appellants made an application before the Assistant Custodian for the recovery of the mortgage money claimed by them for Rs. 40,000 and odd. This application was dismissed as it was filed before a wrong authority.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Appellants filed a claim for the same amount before the Competent Officer under the Act as the property in dispute was composite property in which the evacuee had mortgagor's interest while the appellants who are non-evacuees had mortgagee's interest which had ripened into a decree for sale.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Competent Officer held that provisions of s. 9(1) were retrospective to a certain extent but could not be stretched to reopen past accounts; amount received as interest prior to the decree could not be taken into account to reduce principal; ordered interest at six per cent from suit date till Nov 26, 1952, then five per cent thereafter, and costs.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Custodian appealed to Appellate Officer, who held entire account must be made afresh on basis of five per cent simple from mortgage date, excess reducing principal; allowed appeal and set aside Competent Officer's order.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Appellants applied to Punjab High Court by writ petition, dismissed in limine. Application for leave to appeal dismissed, but special leave obtained from Supreme Court.",
      "type": "procedural",
      "date": "1962-07-30",
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether under s. 9(1) of the Evacuee Interest (Separation) Act, 1951, the Competent Officer must reopen the entire mortgage transaction from the date of the mortgage, calculate interest at five per cent per annum simple on principal, and credit excess interest received towards principal reduction.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Provisions of s. 9(1) do not permit reopening past accounts or reducing principal on account of excess interest realised before the Act came into force; past receipts as interest prior to decree cannot be adjusted against principal.",
      "supporting_facts": [
        "f1",
        "f4",
        "f5",
        "f10"
      ],
      "legal_basis": "s. 9(1) of Evacuee Interest (Separation) Act, 1951"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Appellants not entitled to interest higher than five per cent per annum simple from date of mortgage under s. 9(1); entire transaction should be reopened from mortgage date, amounts received taken into account after allowing five per cent simple interest, excess credited towards principal.",
      "supporting_facts": [
        "f1",
        "f5",
        "f9"
      ],
      "legal_basis": "s. 9(1) of Evacuee Interest (Separation) Act, 1951"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "s. 9(1) begins with non-obstante clause and provides mortgaged property of evacuee shall be liable for interest not exceeding five per cent simple on principal money; applies to liability still due when claim made before Competent Officer; does not authorise reopening past accounts or treating past excess interest payments (within contractual rate) as reducing principal.",
      "addresses_issue": "i1",
      "key_observation": "Key words 'mortgaged property shall be liable' indicate calculation of remaining liability only, not past payments."
    },
    {
      "id": "cr2",
      "text": "Competent Officer bound by civil court decree (except ex parte post-14.8.1947) subject to ss. 9 and 10; must recalculate remaining liability at five per cent simple interest on principal, ignoring higher contractual/decree rates for future interest, but cannot reopen pre-suit payments.",
      "addresses_issue": "i1",
      "key_observation": "No specific provision in Act for reopening all accounts from mortgage date."
    },
    {
      "id": "cr3",
      "text": "For this case: pre-suit payments (even if >5% but <=contractual) not to reduce principal; from suit date to final decree and thereafter, only five per cent simple on principal; post-suit payments adjusted first to five per cent interest, excess to principal; costs of suit allowed, no interest on costs.",
      "addresses_issue": "i1",
      "key_observation": "Decree subject to s. 9(1) via proviso to s. 8(3)."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "s. 9(1) applies only to liability still due under mortgage; does not permit reopening accounts from mortgage date or crediting past excess interest (within contractual rate) to principal; Competent Officer to calculate remaining liability at five per cent simple interest on principal advanced.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Evacuee Interest (Separation) Act, 1951",
      "sections": [
        "s. 2(d)",
        "s. 2(h)",
        "s. 3",
        "s. 4 to 8",
        "s. 9(1)",
        "s. 9(2)",
        "s. 8(3)",
        "s. 10",
        "s. 10(b)"
      ],
      "relevance": "Governs separation of evacuee and non-evacuee interests in composite properties; s. 9(1) limits interest to five per cent simple on principal for remaining liability; decrees binding subject to ss. 9 and 10."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; writ petition allowed; order of Appellate Officer set aside; order of Competent Officer varied to calculate liability as: pre-suit payments not reducing principal if within contractual rate; five per cent simple interest from suit date onwards on principal; post-suit excess payments first to interest then principal; costs of suit allowed without interest; Competent Officer to proceed under s. 10(b) or (c).",
    "relief_granted": "Appellants entitled to revised calculation of mortgage liability at five per cent simple interest on remaining principal, with costs of suit.",
    "costs": "Appellants entitled to costs of the suit decreed in their favour, but no interest on such costs."
  },
  "key_quotes": [
    {
      "text": "\"Notwithstanding anything to the contrary in any law or contract or any decree or order of a civil court or other authority, where the claim is made by a mortgagee, mortgaged property of an evacuee shall, subject to the provisions of sub-section (2) be liable for the payment of interest at a rate exceeding five per cent per annum simple on the principal money advanced.\"",
      "speaker": "court",
      "significance": "Exact text of s. 9(1) central to interpretation."
    },
    {
      "text": "The key words in the provision are mortgaged property shall be liable. These words indicate that the Competent Officer when he comes to deal with a liability under a mortgage must calculate this liability on the basis that interest should be allowed only on the principal amount and only at the rate of five per cent per annum simple.",
      "speaker": "court",
      "significance": "Crux of court's reasoning limiting scope to remaining liability."
    },
    {
      "text": "Section 9(1) in our opinion only deals with liability still due and does not contemplate that any payments made already under the contract as interest should be taken partly towards interest and partly towards principal if they are above five per cent per annum simple interest.",
      "speaker": "court",
      "significance": "Rejects reopening of past accounts."
    }
  ],
  "_case_id": "1966_230",
  "_label": 1,
  "_text_length": 18887,
  "_extracted_at": "2026-02-10T19:40:56.724921"
}