{
  "metadata": {
    "case_name": "Messrs. T. D. Kumar Bros. Private Ltd. v. Income-tax Authorities",
    "case_year": null,
    "court": "Supreme Court of India",
    "judges": [
      "Shah, J."
    ],
    "case_number": null,
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The company was incorporated in 1923 under the Indian Companies Act, 1913. The paid up capital was Rs. 1,02,000 representing 1,020 shares of Rs. 100 each. The entire share capital was held by three persons called Kumars.",
      "type": "background",
      "date": "1923",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Between September 19 to November 14, 1952, the shareholding of Kumars was transferred to five persons called Ghoshes.",
      "type": "material",
      "date": "1952-09-19 to 1952-11-14",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "As part of the scheme for transfer of shares, investments of the company of the value of Rs. 1,01,000 odd were transferred to Kumars.",
      "type": "material",
      "date": "1952",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The company purchased 400 shares of Messrs. East India Housing and Land Development Trust Ltd. (the Trust), held by two out of the five Ghoshes at the rate of Rs. 257-4-0 per share.",
      "type": "material",
      "date": "1952",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The company sold the shares of the Trust to Messrs. Chandoo Lall, a registered sharebroker, at the rate of Rs. 60 per share.",
      "type": "disputed",
      "date": "1952-1953",
      "source": "company"
    },
    {
      "id": "f6",
      "text": "Messrs. Chandoo Lall sold the shares to Bijan Mohan Kundu at the rate of Rs. 61 per share.",
      "type": "material",
      "date": "1952-1953",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "In proceedings for assessment for the assessment year 1953-54, the company claimed a total loss of Rs. 76,241 in the transactions of purchase and sale of shares.",
      "type": "material",
      "date": "1953-54",
      "source": "company"
    },
    {
      "id": "f8",
      "text": "The Income-tax Officer disallowed the claim. The order was confirmed by the Appellate Assistant Commissioner.",
      "type": "procedural",
      "date": null,
      "source": "ito | aac"
    },
    {
      "id": "f9",
      "text": "In appeal, the Income-tax Appellate Tribunal held that the transaction was not a part of the company's business and the loss was capital in nature and could not be set off against profits. Tribunal did not express opinion on genuineness.",
      "type": "procedural",
      "date": null,
      "source": "tribunal"
    },
    {
      "id": "f10",
      "text": "During pendency of assessment proceedings, Income-tax Officer, Companies District IV, Calcutta, initiated proceedings under section 28(1)(c) of the Indian Income-tax Act, 1922, and imposed penalty of Rs. 42,000 on September 29, 1955, holding overwhelming proof that company neither purchased nor sold the shares.",
      "type": "material",
      "date": "1955-09-29",
      "source": "ito"
    },
    {
      "id": "f11",
      "text": "Appellate Assistant Commissioner confirmed the penalty order.",
      "type": "procedural",
      "date": null,
      "source": "aac"
    },
    {
      "id": "f12",
      "text": "Tribunal in second appeal held that company failed to substantiate sale, there was deliberate fabrication of accounts, penalty under section 28(1)(c) called for, but reduced to Rs. 25,000.",
      "type": "procedural",
      "date": null,
      "source": "tribunal"
    },
    {
      "id": "f13",
      "text": "Company applied to Tribunal for statement of case under section 66(1) on two questions. Tribunal rejected.",
      "type": "procedural",
      "date": null,
      "source": "company | tribunal"
    },
    {
      "id": "f14",
      "text": "Company filed petition under section 66(2) before Calcutta High Court. High Court rejected citing no question arose out of Tribunal order and Scindia Steam case.",
      "type": "procedural",
      "date": null,
      "source": "company | high_court"
    },
    {
      "id": "f15",
      "text": "With special leave, company appealed to Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether, on the facts and circumstances, the Tribunal had evidence or material for finding deliberate fabrication of accounts and whether imposition of penalty under section 28(1)(c) was proper.",
      "framed_by": "company"
    },
    {
      "id": "i2",
      "text": "Whether, in view of Tribunal's finding in assessment appeal that transaction was not trading transaction, company could be liable for penalty under section 28(1)(c).",
      "framed_by": "company"
    },
    {
      "id": "i3",
      "text": "Whether loss alleged is 'income' within meaning of section 28(1)(c).",
      "framed_by": "company"
    },
    {
      "id": "i4",
      "text": "Whether questions arose out of Tribunal's order so as to direct reference under section 66(2).",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "First question is one of fact, not pressing it.",
      "supporting_facts": [
        "f13"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Second question arises out of Tribunal order: since Tribunal in assessment appeal found transaction genuine but not trading, no penalty under section 28(1)(c).",
      "supporting_facts": [
        "f9",
        "f12"
      ],
      "legal_basis": "Section 28(1)(c), Section 66(2)"
    },
    {
      "id": "pa3",
      "text": "Even if facts found correct, section 28(1)(c) not attracted as loss not 'income'.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "Section 28(1)(c)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "No question of law arose out of Tribunal order; proceedings under section 28(1)(c) consider concealment of inaccurate particulars.",
      "supporting_facts": [
        "f12",
        "f13"
      ],
      "legal_basis": "Section 28(1)(c), Section 66(1)"
    },
    {
      "id": "ra2",
      "text": "Questions not raised before or decided by Tribunal.",
      "supporting_facts": [
        "f13"
      ],
      "legal_basis": "Commissioner of Income-tax v. Scindia Steam Navigation Co. Ltd., Section 66(2)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Counsel concedes first question is fact. Second question not raised before Tribunal. Argument that loss not 'income' under s28(1)(c) never asked to be referred.",
      "addresses_issue": "i1",
      "key_observation": "Only questions raised before or decided by Tribunal arise out of its order."
    },
    {
      "id": "cr2",
      "text": "Question whether penalty possible given assessment finding not raised or decided by Tribunal.",
      "addresses_issue": "i2",
      "key_observation": "In Scindia case, only if question itself in issue before Tribunal."
    },
    {
      "id": "cr3",
      "text": "Distinguishes Scindia: there question was in general terms and decided against assessee; here new question not raised before Tribunal.",
      "addresses_issue": "i4",
      "key_observation": "Reference under s66(2) cannot be for question not raised or decided."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "High Court right in rejecting prayer for order under section 66(2).",
      "resolves_issue": "i4",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Commissioner of Income-tax v. Scindia Steam Navigation Co. Ltd.",
      "citation": null,
      "treatment": "followed | referred",
      "relevance": "Only question raised before or decided by Tribunal arises out of order; aspects of question argued ok, but not new questions."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act, 1922",
      "sections": [
        "28(1)(c)",
        "66(1)",
        "66(2)"
      ],
      "relevance": "Penalty for concealment; reference to High Court on questions of law arising from Tribunal order."
    },
    {
      "name": "Indian Companies Act, 1913",
      "sections": [],
      "relevance": "Company incorporation."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court dismissed the company's appeal, holding that the High Court was correct in rejecting the petition under section 66(2) as no question of law arose out of the Tribunal's order.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "it is only a question that has been raised before or decided by the Tribunal that could be held to arise out its order.",
      "speaker": "court",
      "significance": "Core principle applied to deny reference."
    },
    {
      "text": "The Tribunal having decided the question against him, the assessee applied for reference of that very question.",
      "speaker": "court",
      "significance": "Distinction from Scindia case."
    }
  ],
  "_case_id": "1966_237",
  "_label": 0,
  "_text_length": 9050,
  "_extracted_at": "2026-02-10T19:41:37.232189"
}