{
  "metadata": {
    "case_name": "Commissioner of Income-tax v. Murlidhar Jhawar",
    "case_year": 1965,
    "court": "Supreme Court of India",
    "judges": [
      "Shah, J."
    ],
    "case_number": "Civil Appeal No. 327 of 1965",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "In the account year ending November 6, 1953 Murlidhar Jhawar, Pannalal Lahoti and Govindbai carried on business in groundnut, cotton and cotton-seed.",
      "type": "material",
      "date": "1953-11-06",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "In the year of assessment 1954-55 the Income-tax Officer, Nanded, brought to tax a third share in Rs. 51,280 computed as profits from the business in the hands of each of the three parties.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Thereafter the Income-tax Officer called upon Murlidhar to submit a return of the income of the joint venture on the footing that the parties thereto constituted an unregistered firm.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Murlidhar complied with the requisition and submitted in November 1957 a return, but later applied to withdraw it by application dated December 18, 1957.",
      "type": "procedural",
      "date": "1957-11",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The Income-tax Officer rejected the application for withdrawal of return and completed the assessment of the three parties to the joint venture under S. 23(3) of the Income-tax Act, 1922 in the status of an unregistered firm and computed the income of the joint venture at Rs. 80,925.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "In appeal to the Appellate Assistant Commissioner the order passed by the Income-tax Officer was confirmed.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "In second appeal, the Income-tax Appellate Tribunal set aside the order of the Appellate Assistant Commissioner holding that the Income-tax Officer had the option to assess the individual parties to the joint venture, and he having exercised that option it was no longer open to him thereafter to reassess the same income collectively in the hands of the three parties to the joint venture in the status of an unregistered firm.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "But on a concession made by counsel for the three parties, the Tribunal directed that the assessment be rectified so as to restore the status quo ante.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "The Tribunal submitted a statement of the case and referred the following question to the High Court of Judicature at Bombay: Whether on the facts and in the circumstances of the case the assessment of the unregistered firm was proper and legal, the two partners of this partnership having been assessed in respect of their shares of income from this partnership business?",
      "type": "procedural",
      "date": null,
      "source": "tribunal"
    },
    {
      "id": "f10",
      "text": "The High Court recorded an answer in the negative dated July 4, 1962.",
      "type": "procedural",
      "date": "1962-07-04",
      "source": "high_court"
    },
    {
      "id": "f11",
      "text": "With certificate granted by the High Court, this appeal has been preferred.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "The transactions in various commodities were carried on by Pannalal and Govindbai who were partners of Messrs. Purna Ginning Pressing Factory and by Murlidhar.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "The Income-tax Officer had assessed the income of the three parties separately and added to the individual income of each party his or her share in the profits of the joint venture.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "The Income-tax Officer had information that the three parties, two of whom were members of a registered trading firm had effected transactions in groundnut, cotton and cotton-seed.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f15",
      "text": "Apparently returns in respect of these trading transactions were separately made and a third share was included in the individual assessment of each of the three parties.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f16",
      "text": "Only the final order of the Income-tax Officer which directs 'Add Joint venture income with Messrs. Purna Ginning and Pressing Factory taken provisionally subject to rectification after the assessment of the joint venture' is incorporated in the order of the Appellate Assistant Commissioner.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f17",
      "text": "It is common ground that the assessment made by the Income-tax Officer was not a provisional assessment within the meaning of s. 23B.",
      "type": "admitted",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether on the facts and in the circumstances of the case the assessment of the unregistered firm was proper and legal, the two partners of this partnership having been assessed in respect of their shares of income from this partnership business?",
      "framed_by": "tribunal"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The Income-tax Officer making the first assessment of the three parties to the joint venture was not informed that the three parties constituted an unregistered firm and therefore the Income-tax Officer was in law competent to assess the entity which was in truth liable to be assessed to tax, and in making the earlier order of assessment he cannot be deemed to have exercised an option which precluded him from assessing the income of the three parties as an unregistered firm.",
      "supporting_facts": [
        "f2",
        "f5"
      ],
      "legal_basis": "Income-tax Officer, Awadh, Lucknow v. Bachulal Kapoor"
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Under s. 3 of the Indian Income-tax Act, income-tax is charged in respect of the total income of the previous year of every individual, Hindu undivided family, company and local authority, and of every firm and other association of persons or the partners of the firm or the members of the association individually.",
      "addresses_issue": "i1",
      "key_observation": "This Court in Commissioner of Income-tax, U.P. v. Kanpur Coal Syndicate observed that s. 3 expressly treats an association of persons and the individual members of an association as two distinct and different assessable entities. On the terms of the section the tax can be levied on either of the said two entities according to the provisions of the Act. The same principle would apply to the cases of assessment of partners individually of an unregistered firm. The partners may be assessed individually or they may be assessed collectively in the status of an unregistered firm the Income-tax Officer cannot however seek to assess the one income twice-once in the hands of the partners and again in the hands of the unregistered firm."
    },
    {
      "id": "cr2",
      "text": "On the materials before the Court we are unable to accept the plea that the Income-tax Officer was not in possession of information relying on which, if he desired, he could have assessed the three parties collectively as an unregistered firm.",
      "addresses_issue": "i1",
      "key_observation": "There is no warrant for the assumption that information about the true state of affairs was not with the Income-tax Officer when the first assessment was made by him."
    },
    {
      "id": "cr3",
      "text": "The Income-tax Officer had assessed the three parties separately and added to the individual income of each party his or her share in the profits of the joint venture. The Income-tax Officer had information that the three parties, two of whom were members of a registered trading firm had effected transactions in groundnut, cotton and cotton-seed.",
      "addresses_issue": "i1",
      "key_observation": "When the Income-tax Officer assessed the three parties separately he unquestionably exercised an option knowing that they had entered into a trading transaction in which they were jointly interested."
    },
    {
      "id": "cr4",
      "text": "Apart from an association of individuals or a firm, the Income-tax Act does not recognize a collection of individuals as an entity capable of being assessed to tax. The three parties were not a registered firm, and they could be assessed to tax collectively as an association of individuals or as an unregistered firm if the relation between them was of partners.",
      "addresses_issue": "i1",
      "key_observation": "It would be reasonable to hold that the income of the three parties was assessed under s. 23(3) of the Income-tax Act, for the income was earned in commercial transactions in different commodities."
    },
    {
      "id": "cr5",
      "text": "The Income-tax Officer in assessing the income of the joint venture, could not have proceeded without scrutinizing the accounts and other relevant documentary evidence and without determining the shares of the three parties to the joint venture. In determining the shares of the three parties, he had also to determine the contractual relation which gave rise to the right to a share in the profit.",
      "addresses_issue": "i1",
      "key_observation": "The order of the Income-tax Officer clearly indicates that he was cognizant of the fact that the income of the joint venture was taxable collectively, but he thought that he could in law in the first instance make an assessment provisionally of the three parties separately and then rectify the assessments later."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The assessment of the unregistered firm was not proper and legal after assessing the shares in the hands of the individual parties.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Commissioner of Income-tax, U.P. v. Kanpur Coal Syndicate",
      "citation": "53 I.T.R. 225; 1964 8 S.C.R 85",
      "treatment": "followed",
      "relevance": "Section 3 expressly treats an association of persons and the individual members of an association as two distinct and different assessable entities. The tax can be levied on either entity."
    },
    {
      "case_name": "Income-tax Officer, Awadh, Lucknow v. Bachulal Kapoor",
      "citation": "1966 3 S.C.R. 68",
      "treatment": "referred",
      "relevance": "Exercise of the option to assess one or the other assumes knowledge on the part of the officer of the existence of two alternatives."
    }
  ],
  "statutes_cited": [
    {
      "name": "Income-tax Act, 1922",
      "sections": [
        "Section 3",
        "Section 23(3)",
        "Section 23B"
      ],
      "relevance": "Governs charging of income-tax on individuals or firms/associations; option to assess either individually or collectively but not both; assessment under s.23(3) for unregistered firm; not provisional under s.23B."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court upheld the High Court's negative answer to the question referred, holding that the Income-tax Officer had exercised the option to assess the three parties individually and could not thereafter assess the same income collectively as an unregistered firm.",
    "relief_granted": "Assessment of unregistered firm set aside",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The Income-tax Officer cannot however seek to assess the one income twice-once in the hands of the partners and again in the hands of the unregistered firm.",
      "speaker": "court",
      "significance": "Core principle preventing double taxation of the same income."
    },
    {
      "text": "When the Income-tax Officer assessed the three parties separately he unquestionably exercised an option knowing that they had entered into a trading transaction in which they were jointly interested.",
      "speaker": "court",
      "significance": "Determines that ITO had knowledge and chose individual assessment."
    }
  ],
  "_case_id": "1966_294",
  "_label": 0,
  "_text_length": 8166,
  "_extracted_at": "2026-02-10T19:42:19.321686"
}