{
  "metadata": {
    "case_name": "State of Bihar v. Rambalak Singh",
    "case_year": 1965,
    "court": "Supreme Court of India",
    "judges": [
      "Gajendragadkar, C.J."
    ],
    "case_number": "Criminal Appeal No. 200 of 1965",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Rambalak Singh detained under Rule 30 of the Defence of India Rules.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Habeas corpus petition filed on behalf of detenu Rambalak Singh under Art. 226 of the Constitution in Patna High Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Patna High Court ordered release of detenu Rambalak Singh on bail of Rs. 500 with two sureties of Rs. 250 each to the satisfaction of the Registrar; Mr. Girish Nandan Sinha gave undertaking that detenu will not indulge in any prejudicial activity or commit any prejudicial act during pendency.",
      "type": "procedural",
      "date": "1965-11-24",
      "source": "lower_court"
    },
    {
      "id": "f4",
      "text": "State of Bihar filed appeal by special leave to Supreme Court against High Court order.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the High Court has jurisdiction under Art. 226 to release a detenu on bail pending final disposal of habeas corpus petition challenging detention under Rule 30 of the Defence of India Rules.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "High Court order releasing detenu on bail is without jurisdiction due to policy and object of Defence of India Rules and Rule 30; detention to prevent prejudicial activities affecting defence of India, public safety etc.; distinguishes from other habeas corpus cases; bail not interim but final as detention has no fixed period.",
      "supporting_facts": [
        "f1",
        "f3"
      ],
      "legal_basis": "Rule 30 of Defence of India Rules; Art. 226 of Constitution"
    },
    {
      "id": "pa2",
      "text": "Principle from Special Reference No. 1 of 1964 does not apply to detentions under Rule 30 due to special considerations of preventive detention.",
      "supporting_facts": [],
      "legal_basis": "Special Reference No. 1 of 1964"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "High Court has jurisdiction to grant interim bail in habeas corpus proceedings under Art. 226, analogous to other cases.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "High Court has jurisdiction under Art. 226 to grant interim bail as auxiliary to main relief of release if detention order invalid; principle from Special Reference applies equally; interim relief in aid of final relief.",
      "addresses_issue": "i1",
      "key_observation": "Jurisdiction conferred implies power for essential acts including interim orders."
    },
    {
      "id": "cr2",
      "text": "Exercise of jurisdiction circumscribed by special considerations of preventive detention under Rule 30; narrow scope of judicial review (e.g., mala fides, facial invalidity); prefer expedited hearing over interim bail; unwise bail may harm public interest.",
      "addresses_issue": "i1",
      "key_observation": "Distinction between existence of jurisdiction and its proper exercise."
    },
    {
      "id": "cr3",
      "text": "Not deciding propriety, reasonableness or validity of the specific bail order; appellant sought only decision on jurisdiction.",
      "addresses_issue": "i1",
      "key_observation": "Appeal limited to jurisdictional question."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "High Court has jurisdiction to grant bail pending habeas corpus under Art. 226 challenging detention under Rule 30, but exercise circumscribed by considerations relevant to preventive detention.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Special Reference No. 1 of 1964",
      "citation": "1965 1 S.C.R. 413",
      "treatment": "followed",
      "relevance": "High Court jurisdiction to grant interim bail in habeas corpus not exceeded; applies analogously to Rule 30 detentions."
    },
    {
      "case_name": "State of Orissa v. Madan Gopal Rungta",
      "citation": "1952 S.C.R. 28",
      "treatment": "referred",
      "relevance": "Interim relief granted only in aid of and auxiliary to main relief."
    }
  ],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Article 226"
      ],
      "relevance": "Confers jurisdiction on High Court for habeas corpus; includes power for interim orders."
    },
    {
      "name": "Defence of India Rules",
      "sections": [
        "Rule 30"
      ],
      "relevance": "Authorizes preventive detention to prevent prejudicial activities; special considerations limit interim bail exercise."
    },
    {
      "name": "Code of Criminal Procedure",
      "sections": [
        "Section 491"
      ],
      "relevance": "Mentioned in context of habeas corpus proceedings in Special Reference."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court holds that Patna High Court had jurisdiction to grant interim bail to detenu pending habeas corpus petition; does not examine propriety or reasonableness of the order as appellant sought only jurisdictional clarification; order stands.",
    "relief_granted": "Jurisdiction affirmed; bail order not interfered with.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"if jurisdiction is conferred by a statute upon a Court, the conferment of jurisdiction implies the conferment of the power of doing all such acts, or employing such means, as are essentially necessary to its execution.\"",
      "speaker": "court",
      "significance": "Basis for holding interim bail within jurisdiction."
    },
    {
      "text": "\"the High Court has jurisdiction to grant bail, but the exercise of the said jurisdiction is inevitably circumscribed by the considerations which are special to such proceedings.\"",
      "speaker": "court",
      "significance": "Core holding balancing jurisdiction with limitations."
    },
    {
      "text": "\"We do not propose to consider the question as to whether the order under appeal is proper, reasonable or valid.\"",
      "speaker": "court",
      "significance": "Limits scope of appeal to jurisdiction only."
    }
  ],
  "_case_id": "1966_143",
  "_label": 0,
  "_text_length": 18677,
  "_extracted_at": "2026-02-10T19:40:06.644043"
}