{
  "metadata": {
    "case_name": "State of Gujarat v. Messrs. Kailash Engineering Co.",
    "case_year": 1965,
    "court": "Supreme Court of India",
    "judges": [
      "Bhargava, J."
    ],
    "case_number": "Civil Appeal No. 945 of 1965",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Messrs. Kailash Engineering Co. (respondent) was an engineering concern having workshop at Morvi on meter gauge section of Western Railway.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Respondent obtained contract from Western Railway Administration for construction of III class passenger coaches on conditions of tender, reduced to writing as agreement.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Respondent constructed three coaches and submitted bill certified by Railway on October 4, 1958; net value Rs. 1,22,035/- received.",
      "type": "material",
      "date": "1958-10-04",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "After receipt, respondent wrote to Additional Collector of Sales Tax under S.27 Bombay Sales Tax Act, 1953 requesting ruling that it was works contract, not sale, no sales-tax payable.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f5",
      "text": "Additional Collector held: (1) transaction covered by bill is sale; (2) tax payable. Both against respondent.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "Appeal to Gujarat Sales Tax Tribunal failed.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Tribunal referred to Gujarat High Court: Whether on proper construction of agreement, work under Contract Certificate No. M/60 1 B-PRTN dated 4th October 1958 for building, erecting and furnishing 3 B.G. Coaches over chassis supplied by Railway is works contract not sale, or transaction of sale.",
      "type": "procedural",
      "date": "1962-12-14",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "High Court answered in favour of respondent: transaction was works contract, not sale.",
      "type": "procedural",
      "date": "1962-12-14",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Contract clause: ownership in plant and materials vests in Railway as soon as brought to site.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Another clause: on removal of contractor or rescission, Railway entitled to take possession of materials, tools etc.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Clause 29: Contractor liable if materials lost, stolen etc., despite ownership in Railway.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Preamble and clauses describe contract for work of building, erecting, furnishing coach bodies on Broad Gauge underframes belonging to Railway.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Tribunal held ownership passed only when completed and handed over, so contract for supply of coach bodies.",
      "type": "disputed",
      "date": null,
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether on proper construction of the agreement as a whole and its general conditions and specification, the work done and covered by Contract Certificates No. M/60 1 B-PRTN dated 4th October 1958 for performance of works of building, erecting and furnishing 3 B.G. Coaches over chassis supplied by Railway is a works contract not amounting to sale, or a transaction of sale.",
      "framed_by": "lower_court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Transaction is sale of coach bodies, as ownership passed only when completed and handed over; amount received as sale consideration.",
      "supporting_facts": [
        "f9",
        "f10",
        "f13"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Relied on Patnaik & Co. v. State of Orissa where supply of bus bodies held to be sale.",
      "supporting_facts": [],
      "legal_basis": "Patnaik & Co. v. State of Orissa"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Contract is for performance of work of building, erecting and furnishing coach bodies on underframes already belonging to Railway; ownership vests in Railway as soon as materials brought to site; respondent acted as agent.",
      "supporting_facts": [
        "f9",
        "f11",
        "f12"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Terms show ownership in materials vests in Railway on bringing to site; respondent to erect and furnish; property in ready coach bodies vests automatically, never in respondent.",
      "addresses_issue": "i1",
      "key_observation": "Risk on Railway but contractor liable per clause 29 as in custody."
    },
    {
      "id": "cr2",
      "text": "Contract entire and indivisible for carrying out works; no sale of materials or coach bodies.",
      "addresses_issue": "i1",
      "key_observation": "Unfinished bodies property of Railway from earliest stage."
    },
    {
      "id": "cr3",
      "text": "Distinguishes Patnaik: here coach bodies not described as units to supply; no delivery of ready bodies; unfinished treated as Railway property; special liability clause due to ownership vesting early.",
      "addresses_issue": "i1",
      "key_observation": "Terms markedly different from Patnaik."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Contract is works contract which did not involve any sale; property vested in Railway even during construction.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Patnaik & Co. v. State of Orissa",
      "citation": "1965 2 S.C.R. 782",
      "treatment": "distinguished",
      "relevance": "Held supply of bus bodies as sale; distinguished due to different contract terms on ownership, delivery, and risk."
    }
  ],
  "statutes_cited": [
    {
      "name": "Bombay Sales Tax Act III of 1953",
      "sections": [
        "S. 27"
      ],
      "relevance": "Respondent sought ruling under this that no sales-tax payable as works contract."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal against High Court decision fails; High Court correctly held transaction was works contract not sale; appeal dismissed with costs.",
    "relief_granted": null,
    "costs": "Dismissed with costs"
  },
  "key_quotes": [
    {
      "text": "\"This was, therefore, clearly a works contract which did not involve any sale.\"",
      "speaker": "court",
      "significance": "Core holding affirming High Court."
    },
    {
      "text": "\"the respondent, in purchasing those materials, was acting more or less in the capacity of an agent for the Railway.\"",
      "speaker": "court",
      "significance": "Explains why no sale despite purchase by respondent."
    }
  ],
  "_case_id": "1966_118",
  "_label": 0,
  "_text_length": 11119,
  "_extracted_at": "2026-02-10T19:39:27.867684"
}