{
  "metadata": {
    "case_name": "Appellants v. Respondents",
    "case_year": 1961,
    "court": "Supreme Court of India",
    "judges": [
      "Ramaswami, J."
    ],
    "case_number": null,
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellants applied for compensation to the Jagir Abolition Officer, Baroda under s. 13 of the Bombay Merged Territories Areas Jagirs Abolition Act, 1953, in respect of their proprietary jagirs.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Against the award of compensation made by the Jagir Abolition Officer, appellants preferred appeals under s. 16 of the Jagirs Abolition Act to the Revenue Tribunal at Bombay.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Appeals were transferred to the Gujarat Revenue Tribunal at Ahmedabad after bifurcation of Bombay State.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Gujarat Revenue Tribunal dismissed the appeals for non-prosecution on account of non-appearance of the advocate of the appellants on February 1, 2 and 3, 1961.",
      "type": "procedural",
      "date": "1961-02-01",
      "source": "tribunal"
    },
    {
      "id": "f5",
      "text": "Orders dismissing appeals received by appellants on April 9 and April 20, 1961.",
      "type": "procedural",
      "date": "1961-04-09",
      "source": "appellants"
    },
    {
      "id": "f6",
      "text": "Appellants filed applications for restoration before the Tribunal on May 6, 1961, contending they were within 30 days of receipt under Regulation 21 and prevented by sufficient cause from appearing.",
      "type": "procedural",
      "date": "1961-05-06",
      "source": "appellants"
    },
    {
      "id": "f7",
      "text": "Tribunal rejected restoration applications on July 18, 1961, holding them barred under Art. 168 of Limitation Act read with Regulation 55 and O.41 rr.17 and 19 CPC, as beyond 30 days from date of dismissal order.",
      "type": "procedural",
      "date": "1961-07-18",
      "source": "tribunal"
    },
    {
      "id": "f8",
      "text": "Appellants filed Special Civil Applications Nos. 704 to 707 of 1961 under Art. 227 of Constitution in Gujarat High Court to quash Tribunal's order dated July 18, 1961.",
      "type": "procedural",
      "date": null,
      "source": "appellants"
    },
    {
      "id": "f9",
      "text": "Gujarat High Court summarily dismissed the Special Civil Applications on November 27, 1961.",
      "type": "procedural",
      "date": "1961-11-27",
      "source": "high_court"
    },
    {
      "id": "f10",
      "text": "Four consolidated appeals brought by special leave against High Court order.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the orders of the Tribunal dated February 1, 2 and 3, 1961 dismissing the appeals for non-prosecution are illegal and ultra vires because the Tribunal did not decide the appeals on merits as required by s. 17 of the Jagirs Abolition Act.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the applications for restoration made by the appellants were barred by limitation under Regulations 19, 20 and 21 of the Bombay Revenue Tribunal Regulations, 1958.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Tribunal orders dismissing appeals for non-prosecution are illegal and ultra vires as s. 17(1) of Jagirs Abolition Act makes it obligatory to decide appeals on merits and record decision.",
      "supporting_facts": [
        "f4",
        "i1"
      ],
      "legal_basis": "s. 17 Jagirs Abolition Act"
    },
    {
      "id": "pa2",
      "text": "Restoration applications filed on May 6, 1961 were within 30 days of receipt of dismissal orders on April 9 and 20, 1961 under Regulation 21, and appellants prevented by sufficient cause from appearing.",
      "supporting_facts": [
        "f5",
        "f6"
      ],
      "legal_basis": "Regulation 21 Bombay Revenue Tribunal Regulations"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Regulation 20 for restoration applies only to cases where appeal heard and decided ex-parte on merits under latter part of Regulation 19(1) and 19(2), not to dismissal for want of prosecution under first part of Regulation 19(1).",
      "supporting_facts": [
        "f4",
        "f7"
      ],
      "legal_basis": "Regulations 19, 20 Bombay Revenue Tribunal Regulations"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Under s. 17(1) Jagirs Abolition Act, Tribunal must decide appeal on merits and record decision even if appellant defaults in appearance; dismissal for non-prosecution does not constitute 'decide' in context of s. 20 finality.",
      "addresses_issue": "i1",
      "key_observation": "Tribunal has no power to dismiss for non-prosecution; obligatory to decide on merits."
    },
    {
      "id": "cr2",
      "text": "Regulation 20 applies to appeals dismissed for non-prosecution under Reg 19(1) as well as those decided ex-parte on merits; language 'decided ex-parte' covers both, followed by Reg 21 limitation from date of receipt.",
      "addresses_issue": "i2",
      "key_observation": "Restoration applications within 30 days of receipt; Tribunal erred in law."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Tribunal orders dated February 1, 2, 3, 1961 dismissing appeals for non-prosecution are ultra vires and illegal.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Restoration applications not barred by limitation; Tribunal's rejection erroneous.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Bombay Merged Territories Areas Jagirs Abolition Act, 1953",
      "sections": [
        "s. 13",
        "s. 14",
        "s. 15",
        "s. 16",
        "s. 17",
        "s. 20"
      ],
      "relevance": "Governs compensation applications, awards, appeals, mandatory decision on merits by Tribunal, finality."
    },
    {
      "name": "Bombay Revenue Tribunal Act, 1957",
      "sections": [
        "s. 14"
      ],
      "relevance": "Empowers regulations on practice and procedure."
    },
    {
      "name": "Bombay Revenue Tribunal Regulations, 1958",
      "sections": [
        "Reg. 19",
        "Reg. 20",
        "Reg. 21",
        "Reg. 55"
      ],
      "relevance": "Procedure on non-appearance, restoration, limitation from receipt date, apply CPC where not provided."
    },
    {
      "name": "Limitation Act",
      "sections": [
        "Art. 168"
      ],
      "relevance": "Applied by Tribunal for limitation but held inapplicable."
    },
    {
      "name": "Code of Civil Procedure, 1908",
      "sections": [
        "O. 41 rr. 17, 19"
      ],
      "relevance": "Applied via Reg. 55 by Tribunal for limitation."
    },
    {
      "name": "Land Acquisition Act, 1894",
      "sections": [
        "s. 23(1)",
        "s. 24",
        "s. 26"
      ],
      "relevance": "Applies to form and manner of awards under Jagirs Act."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 227"
      ],
      "relevance": "Basis for High Court applications."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeals allowed; Gujarat High Court order dismissing SCA 704-707/1961 and Tribunal order dated July 18, 1961 dismissing restoration applications set aside; Tribunal dismissal orders of appeals REV.A. 27-30/1960 ultra vires and set aside; appeals remanded to Gujarat Revenue Tribunal for rehearing.",
    "relief_granted": "Appeals restored and remanded for decision on merits.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"it is obligatory on the part of the Tribunal to decide an appeal on merits even though there is default in the appearance of the appellants and to record its decision regarding the merits of the appeal.\"",
      "speaker": "court",
      "significance": "Core holding on s.17 Jagirs Act mandating merits decision."
    },
    {
      "text": "\"the language of Regulation 20, on its true interpretation, applies not only to a case where the appeal has been decided on merits but also to a case where the appeal has been dismissed for want of prosecution\"",
      "speaker": "court",
      "significance": "Interprets Reg 20 to cover non-prosecution dismissals for restoration."
    }
  ],
  "_case_id": "1966_231",
  "_label": 1,
  "_text_length": 14834,
  "_extracted_at": "2026-02-10T19:41:03.303338"
}