{
  "metadata": {
    "case_name": "State of Jammu and Kashmir & Ors. v. Bakshi Ghulam Mohammad",
    "case_year": 1966,
    "court": "Supreme Court of India",
    "judges": [
      "Sarkar C.J."
    ],
    "case_number": "Civil Appeal No. 1102 of 1966",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "After the accession of the State of Jammu and Kashmir to India in 1947, a responsible Government was set up there under the Prime Ministership of Sheikh Mohammad Abdullah. Bakshi Ghulam Muhammad was the Deputy Prime Minister in that Government and G. M. Sadiq was also in the Cabinet.",
      "type": "background",
      "date": "1947",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "In 1953 Sheikh Mohammad Abdullah was dismissed from office and a new Government was formed with Bakshi Ghulam Mohammad as the Prime Minister and G. M. Sadiq and D. P. Dhar were included in the Cabinet.",
      "type": "background",
      "date": "1953",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On January 26, 1957, a new Constitution was framed for Jammu Kashmir.",
      "type": "background",
      "date": "1957-01-26",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "In the first elections held under the Constitution, a party called the National Conference got the majority of votes. Bakshi Ghulam Mohammad and Sadiq were members of this party. A Ministry was then formed with Bakshi Ghulam Mohammad as the Prime Minister.",
      "type": "background",
      "date": "1957",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "G. M. Sadiq left the party sometime after 1957 and rejoined it along with D. P. Dhar in December 1960 and they were taken into the Cabinet.",
      "type": "background",
      "date": "1960-12",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The next General Elections were held in 1962. Again, the National Conference Party came into power. In the Government that was formed, Bakshi Ghulam Mohammad became the Prime Minister and G. M. Sadiq and D. P. Dhar were taken in the Ministry.",
      "type": "background",
      "date": "1962",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "In September 1963, Bakshi Ghulam Mohammad resigned from the Ministry under what is called the Kamraj Plan and Shamsuddin became the Prime Minister in his place.",
      "type": "background",
      "date": "1963-09",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "In February 1964, Shamsuddin left office and a new Government was formed with G. M. Sadiq as the Prime Minister.",
      "type": "background",
      "date": "1964-02",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Shortly thereafter, political rivalry between G. M. Sadiq and Bakshi Ghulam Mohammad started.",
      "type": "background",
      "date": "1964-02",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "In August 1964, a notice was issued fixing a session of the Legislature of the State in the following September.",
      "type": "procedural",
      "date": "1964-08",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Some of the legislators wanted to bring in vote of no-confidence against G. M. Sadiq's Ministry and by September 21, 1964 the no-confidence motion had obtained the support of the majority of members of the Assembly. G. M. Sadiq challenges the genuineness of the signatures on the notice of the motion and also denies that it had the support of a majority of the Assembly.",
      "type": "disputed",
      "date": "1964-09-21",
      "source": "petitioner | respondent"
    },
    {
      "id": "f12",
      "text": "On September 22, 1964, at 5 o'clock in the morning, Bakshi Ghulam Mohammad and some of his supporters were arrested under the Defence of India Rules.",
      "type": "material",
      "date": "1964-09-22",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "At 8.30 a.m. on September 22, 1964 the notice of the motion of no-confidence with the signatures of some members was handed over to the Secretary of the Legislative Assembly.",
      "type": "procedural",
      "date": "1964-09-22",
      "source": "court"
    },
    {
      "id": "f14",
      "text": "At 9 a.m. on September 22, 1964 the Legislative Assembly which was to meet on that day, was prorogued by the Speaker under the directions of the Sadar-i-Riyasat.",
      "type": "procedural",
      "date": "1964-09-22",
      "source": "court"
    },
    {
      "id": "f15",
      "text": "Sometime in November 1964, a petition for a writ of habeas corpus for the release of Bakshi Ghulam Mohammad was presented to the High Court of Jammu and Kashmir.",
      "type": "procedural",
      "date": "1964-11",
      "source": "court"
    },
    {
      "id": "f16",
      "text": "On December 15, 1964, before the petition could be heard and decided, Bakshi Ghulam Mohammad was released from arrest by the State Government.",
      "type": "procedural",
      "date": "1964-12-15",
      "source": "court"
    },
    {
      "id": "f17",
      "text": "On January 30, 1965, a Notification was issued by the State Government appointing a Commission of Inquiry constituted by N. Rajagopala Ayyangar to enquire into (i) the nature and extent of the assets and pecuniary resources of Bakshi Ghulam Mohammad and the members of his family and other relatives mentioned in the first Schedule to the Order, in October 1947 and in October 1963 and (ii) whether during this period, Bakshi Ghulam Mohammad and the others mentioned in the Schedule had obtained any assets and pecuniary resources or advantages by Bakshi Ghulam Mohammad abusing the official positions held by him or by the aforesaid people set out in the first Schedule by exploiting that position with his knowledge, consent and connivance. The Notification provided that in making the inquiry under head (ii) the Commission would examine only the allegations set out in the second Schedule to it.",
      "type": "material",
      "date": "1965-01-30",
      "source": "court"
    },
    {
      "id": "f18",
      "text": "The Commission held certain sittings between February 1965 and August 1965 in which Bakshi Ghulam Mohammad took part.",
      "type": "procedural",
      "date": "1965-02 to 1965-08",
      "source": "court"
    },
    {
      "id": "f19",
      "text": "On September 1, 1965, Bakshi Ghulam Mohammad moved the High Court of Jammu and Kashmir under ss. 103 and 104 of the Constitution of Jammu and Kashmir for a writ striking down the Notification and quashing the proceedings of the Commission taken till then.",
      "type": "procedural",
      "date": "1965-09-01",
      "source": "court"
    },
    {
      "id": "f20",
      "text": "The High Court allowed the petition, set aside the Notification and quashed the proceedings of the Commission by judgment and order dated December 27, 1965.",
      "type": "procedural",
      "date": "1965-12-27",
      "source": "court"
    },
    {
      "id": "f21",
      "text": "Bakshi Ghulam Mohammad held offices for a total period of about sixteen years: Deputy Prime Minister from 1947 to 1953 and Prime Minister from 1953 to 1963.",
      "type": "background",
      "date": "1947 to 1963",
      "source": "court"
    },
    {
      "id": "f22",
      "text": "The second Schedule to the Notification contains 38 instances, the first repeating the second head of inquiry, others referring to individual instances of people being made to part with property under pressure by abuse of official position and of public money being misappropriated. At the end, a note states that the gravamen of the charge was that Bakshi Ghulam Mohammad abused his official position and the other persons named exploited that position with his consent, knowledge or connivance in committing the acts whereby they acquired vast wealth.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f23",
      "text": "Since about July 1964 various allegations of abuse of power by Bakshi Ghulam Mohammad some of which formed the subject matter of inquiry, had come to the notice of the Government and thereupon investigations were started by the Criminal Investigation Department.",
      "type": "background",
      "date": "1964-07",
      "source": "appellants"
    },
    {
      "id": "f24",
      "text": "The prorogation had been decided upon before the arrest of Bakshi Ghulam Mohammad but the order could not be passed because the Sadar-i-Riyasat was out of Srinagar from before September 15, 1964 and did not return till some time on September 21, 1964.",
      "type": "admitted",
      "date": "1964-09-15 to 1964-09-21",
      "source": "appellants"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the Notification was justified by the Jammu Kashmir Commission of Inquiry Act, 1962, given S. 37 of the J&K Constitution providing collective responsibility of Ministers to the Legislative Assembly.",
      "framed_by": "respondent"
    },
    {
      "id": "i2",
      "text": "Whether the matters into which the Commission was asked to inquire were definite matters of public importance.",
      "framed_by": "high_court | respondent"
    },
    {
      "id": "i3",
      "text": "Whether the inquiry directly into the conduct of Bakshi Ghulam Mohammad was permitted under the Act, based on interpretation of s. 10.",
      "framed_by": "respondent"
    },
    {
      "id": "i4",
      "text": "Whether the Notification was issued mala fide due to political rivalry.",
      "framed_by": "respondent"
    },
    {
      "id": "i5",
      "text": "Whether the Notification violated Art. 14 by discriminating against Bakshi Ghulam Mohammad.",
      "framed_by": "respondent"
    },
    {
      "id": "i6",
      "text": "Whether the proceedings of the Commission violated rules of natural justice or statutory provisions, particularly regarding inspection of documents and right to cross-examine deponents of affidavits.",
      "framed_by": "respondent"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "S. 37 of J&K Constitution does not prevent Government from setting up Commission; Act s.3 empowers Government to appoint Commission, and even Legislative Council can require it.",
      "supporting_facts": [
        "f17"
      ],
      "legal_basis": "J&K Commission of Inquiry Act, 1962 s.3; J&K Constitution s.37"
    },
    {
      "id": "pa2",
      "text": "Matters are definite matters of public importance: inquiry into assets in 1947 and 1963 and whether acquired by abuse/exploitation of official position during 16 years in office; confined to 38 instances in Schedule.",
      "supporting_facts": [
        "f17",
        "f21",
        "f22"
      ],
      "legal_basis": "J&K Commission of Inquiry Act, 1962"
    },
    {
      "id": "pa3",
      "text": "Inquiry into past acts of former PM remains of public importance even after he left office; public entitled to know if entrusted affairs to unworthy man.",
      "supporting_facts": [
        "f21"
      ],
      "legal_basis": "Ram Krishna Dalmia v. Shri Justice S.R. Tendolkar"
    },
    {
      "id": "pa4",
      "text": "S.10 applies to direct inquiry into conduct; wide power under s.3.",
      "supporting_facts": [
        "f17"
      ],
      "legal_basis": "J&K Commission of Inquiry Act, 1962 ss.3,10"
    },
    {
      "id": "pa5",
      "text": "No mala fides: Arrest under Defence Rules due to investigations into abuse of power, rowdyism endangering public order amid threats from Pakistan/China; released due to ill-health after investigation; prorogation to prevent trouble.",
      "supporting_facts": [
        "f12",
        "f14",
        "f16",
        "f23",
        "f24"
      ],
      "legal_basis": null
    },
    {
      "id": "pa6",
      "text": "No Art.14 violation: Inquiry specific to wealth acquired by Bakshi and relatives/friends by his abuse of position; rational classification.",
      "supporting_facts": [
        "f17"
      ],
      "legal_basis": "Article 14"
    },
    {
      "id": "pa7",
      "text": "No violation of natural justice or s.4(c): Inspection now given; cross-examination not absolute right under Act/rules; affidavits permissible, Commission regulates procedure.",
      "supporting_facts": [
        "f18"
      ],
      "legal_basis": "J&K Commission of Inquiry Act, 1962 ss.4(c),9,10; CPC Order 19 r.1; Rules under Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Notification not justified by Act as Minister responsible only to Legislature per S.37 J&K Constitution; inquiry only at instance of Legislature.",
      "supporting_facts": [
        "f17"
      ],
      "legal_basis": "J&K Constitution s.37; J&K Commission of Inquiry Act, 1962"
    },
    {
      "id": "ra2",
      "text": "Matters not of public importance as Bakshi out of office; no public agitation; into allegations, not definite matter.",
      "supporting_facts": [
        "f7",
        "f8"
      ],
      "legal_basis": "Ram Krishna Dalmia v. Shri Justice S.R. Tendolkar"
    },
    {
      "id": "ra3",
      "text": "S.10 shows inquiry into conduct only incidentally; no direct inquiry into individual's conduct.",
      "supporting_facts": [
        "f17"
      ],
      "legal_basis": "J&K Commission of Inquiry Act, 1962 s.10"
    },
    {
      "id": "ra4",
      "text": "Notification mala fide due to political rivalry, arrest to stultify no-confidence motion, personal animosity.",
      "supporting_facts": [
        "f9",
        "f11",
        "f12"
      ],
      "legal_basis": null
    },
    {
      "id": "ra5",
      "text": "Art.14 violation: Discriminated by picking Bakshi from Cabinet whose decisions were collective.",
      "supporting_facts": [
        "f17"
      ],
      "legal_basis": "Article 14"
    },
    {
      "id": "ra6",
      "text": "Proceedings violated natural justice: No inspection of documents; denied cross-examination of affidavit deponents.",
      "supporting_facts": [
        "f18"
      ],
      "legal_basis": "J&K Commission of Inquiry Act, 1962 s.4(c); CPC Order 19 r.1"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "S.37 concerns collective responsibility of Council of Ministers to Assembly; Bakshi not in Council at time; Act s.3 empowers Government to appoint Commission independently.",
      "addresses_issue": "i1",
      "key_observation": "High Court rightly rejected this contention."
    },
    {
      "id": "cr2",
      "text": "Matters are definite matters of public importance: Specific assets comparison 1947-1963; abuse of position in 38 instances; public importance persists post-office; no need for public agitation; object to expose lapses in public life.",
      "addresses_issue": "i2",
      "key_observation": "Acts of PM by abuse of office grave enough for public importance; resignation doesn't change character."
    },
    {
      "id": "cr3",
      "text": "S.3 wide enough for direct inquiry into conduct; s.10 applies to such persons; strange if incidental but not direct.",
      "addresses_issue": "i3",
      "key_observation": "No justification to limit s.3 by s.10."
    },
    {
      "id": "cr4",
      "text": "No mala fides established: Political rivalry exists but arrest justified by investigations, public order threats; release due to ill-health post-investigation; prorogation apprehension real; prima facie satisfaction required.",
      "addresses_issue": "i4",
      "key_observation": "On facts, cannot hold mala fide."
    },
    {
      "id": "cr5",
      "text": "No Art.14 discrimination: Inquiry into Bakshi's specific abuse for his/relatives' wealth; rational nexus.",
      "addresses_issue": "i5",
      "key_observation": "Bakshi in class by himself."
    },
    {
      "id": "cr6",
      "text": "No natural justice violation: Inspection now given; no absolute right to cross-examine affidavit deponents; s.4(c) power independent, not subject to CPC proviso fully; s.10 limits cross to viva voce; Commission regulates procedure for fact-finding.",
      "addresses_issue": "i6",
      "key_observation": "Act contemplates affidavits for quick disposal; cross where necessary."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Notification valid under Act; not limited by S.37 Constitution.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Matters specified are definite matters of public importance.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h3",
      "text": "Direct inquiry into conduct permitted; s.10 applies.",
      "resolves_issue": "i3",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h4",
      "text": "No mala fides.",
      "resolves_issue": "i4",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h5",
      "text": "No Art.14 violation.",
      "resolves_issue": "i5",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h6",
      "text": "Proceedings not contrary to natural justice or Act; no absolute cross-examination right on affidavits.",
      "resolves_issue": "i6",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Ram Krishna Dalmia v. Shri Justice S.R. Tendolkar",
      "citation": "1959 S.C.R. 279",
      "treatment": "followed | referred",
      "relevance": "Observation on matters of public importance; not exhaustive definition; past acts can be of public importance."
    },
    {
      "case_name": "Meenglas Tea Estates v. Their Workmen",
      "citation": "1964 2 S.C.R. 165",
      "treatment": "distinguished",
      "relevance": "Viva voce evidence requires cross; not applicable to affidavit evidence before fact-finding body."
    },
    {
      "case_name": "Nagendra Nath Bora v. Commissioner of Hills Division and Appeals, Assam",
      "citation": "1958 S.C.R. 1240",
      "treatment": "followed",
      "relevance": "Rules of natural justice vary with statutory body and rules; decide in light of statute."
    },
    {
      "case_name": "Khandesh Spinning etc. Co. Ltd. v. Rashtriya Girni Kamgar Sangh",
      "citation": "1960 2 S.C.R. 841",
      "treatment": "distinguished",
      "relevance": "Obiter on affidavits subject to O.19 r.1 in different statute; not applicable here."
    }
  ],
  "statutes_cited": [
    {
      "name": "Jammu and Kashmir Commission of Inquiry Act, 1962",
      "sections": [
        "s.3",
        "s.4(c)",
        "s.9",
        "s.10"
      ],
      "relevance": "Empowers appointment of Commission for definite matters of public importance; powers like civil court for affidavits; hearing and limited cross; regulate procedure."
    },
    {
      "name": "Constitution of Jammu and Kashmir",
      "sections": [
        "s.37",
        "ss.103,104"
      ],
      "relevance": "Collective responsibility to Assembly; writ jurisdiction like Arts.226,227."
    },
    {
      "name": "Code of Civil Procedure (J&K)",
      "sections": [
        "Order 18 r.4",
        "Order 19 r.1"
      ],
      "relevance": "Evidence oral in open court generally; affidavits for sufficient reason, proviso on cross where bona fide desire."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 14"
      ],
      "relevance": "Equality; no discrimination in singling out Bakshi."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "The Supreme Court allowed the appeal, set aside the judgment of the High Court of Jammu and Kashmir which had quashed the Notification appointing the Commission of Inquiry and the proceedings thereof, holding the Notification valid and proceedings proper.",
    "relief_granted": "High Court judgment set aside; Commission proceedings restored.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The cleanliness of public life in which the public should be vitally interested, must be a matter of public importance. The people are entitled to know whether they have entrusted their affairs to an unworthy man.",
      "speaker": "court",
      "significance": "Defines public importance of inquiring into ministerial lapses."
    },
    {
      "text": "It would be strange indeed if the Act provided for rights of a person whose conduct incidentally came to be enquired into but did not do so in the case of persons whose conduct has directly to be inquired into under the order setting up the Commission.",
      "speaker": "court",
      "significance": "Interprets s.10 to cover direct inquiries."
    },
    {
      "text": "We are not aware of any such rule of natural justice. No authority has been cited in support of it.",
      "speaker": "court",
      "significance": "Rejects absolute right to cross-examine affidavit witnesses."
    }
  ],
  "_case_id": "1966_32",
  "_label": 1,
  "_text_length": 46612,
  "_extracted_at": "2026-02-10T19:39:10.961914"
}