{
  "metadata": {
    "case_name": "Ram Chandra Aggarwal & Anr. v. Brij Gopal Binani & Ors.",
    "case_year": 1965,
    "court": "Supreme Court of India",
    "judges": [
      "Mudholkar, J."
    ],
    "case_number": "Criminal Appeal No. 113 of 1965",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Proceedings under s. 145, Cr. P.C. were initiated by a Magistrate on the basis of a report of a police officer to the effect that a dispute likely to cause a breach of the peace exists concerning a plot of land situate within the jurisdiction of the Magistrate between the parties mentioned in the report.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The learned Magistrate upon being satisfied about the possibility of a breach of the peace made a preliminary order under s. 145, Cr. P.C., attached the property to which the dispute related and called upon the parties to adduce evidence in respect of their respective claims.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "In due course he recorded the evidence but he was unable to make up his mind as to which of the parties was in possession on the date of the preliminary order and within two months thereof.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "He, therefore, referred the case under s. 146(1) of the Cr. P.C. to a civil court for decision, as to which of the parties was in possession at the material point of time and in the meanwhile directed that the attachment of the Property shall continue.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The reference went to the court of the Munsiff within whose territorial jurisdiction the property was situate.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Thereafter one of the parties Brij Gopal Binani, respondent No. 2, made an application to the District Judge under S. 24, C.P.C. for transfer of the case to some other court. The ground given was that in the execution case out of which proceedings under s. 145, Cr.P.C. had arisen, the same Munsiff had made an order against him depriving him of costs.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f7",
      "text": "The Munsiff having no objection to the transfer the District Judge transferred the case to the court of another Munsiff.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "The opposite parties, that is, the appellants before us Ram Chandra Aggarwal and Kedar Prasad Aggarwal acquiesced in the order of transfer and did not raise any question as to the jurisdiction of the transferee court to hear and decide the reference.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Eventually evidence was led by both sides and a finding given by the transferee court. This finding was in favour of the second respondent.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "After receiving the finding the Magistrate heard the parties and held that it was the second respondent who was in possession at the relevant date and passed an order under s. 145(6), Cr. P.C. pursuant thereto.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "A revision application was preferred by the appellants before the court of Sessions in which the objection was taken for the first time that the decision of the civil court was a nullity because it had no territorial jurisdiction over the subject-matter of the dispute.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f12",
      "text": "It was further contended that the District Judge had no jurisdiction to transfer the case and that consequently the ultimate order made by the learned Magistrate was a nullity.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f13",
      "text": "The learned Additional Sessions Judge who heard the revision application rejected these contentions on the ground that they were not raised earlier.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "The appellants then took the matter to the High Court in revision. The appellants rested their revision application on the sole ground that s. 24, C.P.C. was not available in respect of a reference under s. 146(1) Cr. P.C. and that, therefore, the proceedings subsequent to the transfer of the reference from the court of one Munsiff to that of another are a nullity.",
      "type": "procedural",
      "date": "1964-10-26",
      "source": "petitioner"
    },
    {
      "id": "f15",
      "text": "The High Court permitted the point to be urged... The High Court negatived both the grounds on which the contention was based.",
      "type": "procedural",
      "date": "1964-10-26",
      "source": "court"
    },
    {
      "id": "f16",
      "text": "Appeal to Supreme Court by certificate granted by the High Court at Allahabad.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "whether the District Judge has jurisdiction under s. 24 of the Code of Civil Procedure to transfer a reference made by a Magistrate to a particular civil court under s. 146 of the Code of Criminal Procedure to another civil court.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The reference under s. 146(1), Cr. P.C. was to a persona designata.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": "Balakrishna Udayar v. Vasudeva Aiyar; Central Talkies Ltd. v. Dwarka Prasad"
    },
    {
      "id": "pa2",
      "text": "The provisions of s. 24, C.P.C. were not available with respect to it because the proceeding before the civil court was not a civil proceeding within the meaning of s. 141, C.P.C.",
      "supporting_facts": [
        "f4",
        "f7",
        "f11",
        "f12",
        "f14"
      ],
      "legal_basis": "Sri Sheonath Prasad v. City Magistrate, Varanasi"
    },
    {
      "id": "pa3",
      "text": "Since the proceeding before the criminal court under s. 145 is a criminal proceeding any matter arising out of it, including a reference to a civil court, does not lose its initial character of a criminal proceeding.",
      "supporting_facts": [
        "f1",
        "f2",
        "f4"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Conceded that a reference under s. 146(1) is to a constituted court and not to a persona designata.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "If the proceeding before the civil court is a civil proceeding then all the rules of procedure contained in the Civil Procedure Code, including those relating to appeals or revision would apply to the proceeding, which would be contrary to the provisions of s. 146(1-D) of Code of Criminal Procedure which bar an appeal, review or revision from any finding of the civil court.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": "s. 146(1-D) Cr. P.C."
    },
    {
      "id": "ra3",
      "text": "A proceeding upon a reference under s. 146(1) entertained by a civil court not being an original proceeding the provisions of s. 141, C.P.C. are not attracted and therefore those provisions of the Civil Procedure Code which relate to suits are not applicable.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": "s. 141 C.P.C."
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Reference under s. 146(1) Cr. P.C. is to a constituted court and not to a persona designata. When a special or local law provides for an adjudication to be made by a constituted court it enlarges the ordinary jurisdiction of such a court.",
      "addresses_issue": "i1",
      "key_observation": "The power is not to refer the matter to the presiding Judge of a particular civil court but to a court."
    },
    {
      "id": "cr2",
      "text": "The proceeding before the civil court is a civil proceeding. When a legal right is in dispute and the ordinary courts of the country are seized of such dispute the courts are governed by the ordinary rules of procedure applicable to them.",
      "addresses_issue": "i1",
      "key_observation": "A proceeding stemming from a criminal matter does not always bear the stamp of a criminal proceeding."
    },
    {
      "id": "cr3",
      "text": "The Magistrate does not confer a part of his criminal jurisdiction upon the civil court when referring under s.146. There is no provision under which he can clothe a court not specified in the CrPC with criminal jurisdiction.",
      "addresses_issue": "i1",
      "key_observation": "The civil court acts in its civil jurisdiction."
    },
    {
      "id": "cr4",
      "text": "S.24 C.P.C. applies to 'any suit, appeal or other proceeding' pending in any court subordinate to it, not confined to civil proceedings. The term 'proceeding' in s.24(1)(b) includes all matters coming up for judicial adjudication.",
      "addresses_issue": "i1",
      "key_observation": "A proceeding before a civil court arising out of a reference under s.146 CrPC can be transferred under s.24 CPC."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The District Judge has jurisdiction under s.24 CPC to transfer a reference made by a Magistrate under s.146 CrPC to another civil court.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Balakrishna Udayar v. Vasudeva Aiyar",
      "citation": null,
      "treatment": "followed",
      "relevance": "Distinction between persona designata and legal tribunal."
    },
    {
      "case_name": "Central Talkies Ltd. v. Dwarka Prasad",
      "citation": null,
      "treatment": "followed",
      "relevance": "Meaning of persona designata."
    },
    {
      "case_name": "Chatur Mohan v. Ram Behari Dixit",
      "citation": null,
      "treatment": "referred",
      "relevance": "Cases dealing with reference to constituted court summarised."
    },
    {
      "case_name": "Sri Sheonath Prasad v. City Magistrate, Varanasi",
      "citation": "A.I.R. 1959 All. 467",
      "treatment": "distinguished",
      "relevance": "Held reference retains criminal character; court disagrees."
    },
    {
      "case_name": "Adaikappa Chettiar v. Chandrasekharca Theyar",
      "citation": "74 I.A. 264",
      "treatment": "followed",
      "relevance": "Ordinary courts governed by ordinary rules of procedure."
    },
    {
      "case_name": "Maung Ba Thaw v. Ma Pin",
      "citation": "61 I.A. 158",
      "treatment": "followed",
      "relevance": "Ordinary courts governed by ordinary rules of procedure."
    },
    {
      "case_name": "South Asia Industries P. Ltd. v. S. B. Sarup Singh",
      "citation": "1966 2 S.C.R. 756; A.I.R. 1956 S.C. 1818",
      "treatment": "followed",
      "relevance": "Appeal regulated by practice and procedure of High Court."
    },
    {
      "case_name": "Narayan Row v. Ishwarlal",
      "citation": null,
      "treatment": "followed",
      "relevance": "Civil proceeding not restricted to suits."
    },
    {
      "case_name": "Maha Ram v. Harbans",
      "citation": "I.L.R. 1941 All. 193",
      "treatment": "referred",
      "relevance": "S.141 CPC applies to proceedings beyond suits."
    },
    {
      "case_name": "Munshi Ram v. Banwarilal",
      "citation": "I.L.R. 1962 S.C. 903",
      "treatment": "followed",
      "relevance": "S.141 CPC applies to non-original proceedings."
    },
    {
      "case_name": "Kochadai Naidu v. Nagavasami Naidu",
      "citation": "I.L.R. 1961 Mad. 413",
      "treatment": "followed",
      "relevance": "Reference under s.146(1) CrPC is a proceeding transferable under s.24 CPC."
    }
  ],
  "statutes_cited": [
    {
      "name": "Code of Criminal Procedure",
      "sections": [
        "s. 145",
        "s. 146",
        "s. 146(1)",
        "s. 146(1-D)",
        "s. 145(6)"
      ],
      "relevance": "Proceedings for breach of peace disputes; reference to civil court on possession; bar on appeal/revision from civil court finding."
    },
    {
      "name": "Code of Civil Procedure",
      "sections": [
        "s. 24",
        "s. 24(1)(b)",
        "s. 141"
      ],
      "relevance": "Transfer of proceedings by District Judge; procedure applicable to civil proceedings."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court upheld the High Court's decision negativing the appellants' contentions that the District Judge lacked jurisdiction under s.24 CPC to transfer the s.146 CrPC reference, holding that the reference is to a constituted civil court and the proceeding is transferable under s.24 CPC.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "the only point which falls to be decided in this appeal... is whether the District Judge has jurisdiction under s. 24 of the Code of Civil Procedure to transfer a reference made by a Magistrate to a particular civil court under s. 146 of the Code of Criminal Procedure to another civil court.",
      "speaker": "court",
      "significance": "Frames the sole issue."
    },
    {
      "text": "Section 146(1) Cr. P.C. empowers a Magistrate to refer the question... to a civil court of competent jurisdiction. The power is not to refer the matter to the presiding Judge of a particular civil court but to a court.",
      "speaker": "court",
      "significance": "Rejects persona designata argument."
    },
    {
      "text": "the term proceeding indicates something in which business is conducted according to a prescribed mode it would be only right to give it... a comprehensive meaning so as to include within it all matters coming up for judicial adjudication and not to confine it to a civil proceeding alone.",
      "speaker": "court",
      "significance": "Interprets s.24 CPC broadly."
    }
  ],
  "_case_id": "1966_33",
  "_label": 0,
  "_text_length": 18249,
  "_extracted_at": "2026-02-10T19:39:00.331300"
}