{
  "metadata": {
    "case_name": "Dolai Molliko and others v. Respondents",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "Wanchoo, J"
    ],
    "case_number": "Civil Appeal No. 836 of 1963",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "A suit was brought by eleven plaintiffs including Dolai Molliko for a declaration that the plaintiffs were tenants with occupancy rights in the lands in dispute.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The suit was resisted by the defendants who are respondents.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The Munsif dismissed the suit.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f4",
      "text": "Plaintiffs appealed to the Subordinate Judge.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Dolai Molliko died in March 1958 during pendency of appeal before Subordinate Judge.",
      "type": "procedural",
      "date": "1958-03",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Application made within time to bring on record Dolai's heirs: widow and major son. No objection raised, and they were substituted.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Subordinate Judge allowed the appeal, decreed the suit and gave declaration prayed for.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Defendants filed second appeal to Orissa High Court in S.A. No. 90 of 1960.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "During pendency in High Court, discovered Dolai left three other heirs: minor son, married daughter, unmarried daughter, besides widow and major son.",
      "type": "background",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f10",
      "text": "Objection raised in High Court that not all heirs brought on record, so appeal before Subordinate Judge abated in toto.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f11",
      "text": "Orissa High Court accepted contention, allowed second appeal on January 4, 1962, held appeal abated, restored Munsif's judgment dismissing suit.",
      "type": "procedural",
      "date": "1962-01-04",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Appellants obtained special leave from Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Respondents did not object in Subordinate Judge court that some heirs left out; case proceeded as if estate fully represented.",
      "type": "admitted",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the estate of Dolai deceased appellant was sufficiently represented before the Subordinate Judge by the widow and the major son, or did the appeal abate in toto for not bringing all heirs on record.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Principle from Daya Ram v. Shyam Sundari and N.K. Mohd. Sulaiman Sahib v. N.C. Mohd. Ismail Saheb applies; widow and major son sufficiently represent entire estate of Dolai; leaving out three heirs makes no difference.",
      "supporting_facts": [
        "f6",
        "f13"
      ],
      "legal_basis": "Daya Ram v. Shyam Sundari; N.K. Mohd. Sulaiman Sahib v. N.C. Mohd. Ismail Saheb"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "As heirs of deceased appellant, widow and major son must have known of other heirs; not all heirs brought on record, so appeal before Subordinate Judge abated in toto.",
      "supporting_facts": [
        "f9",
        "f10"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Distinguishes present case as death of appellant (not defendant/respondent), so no question of diligent enquiry; however, extends principle unless fraud, collusion, no fair trial, or special defence to absent heir.",
      "addresses_issue": "i1",
      "key_observation": "No fraud, collusion, or other circumstances; respondents did not object earlier; estate fully represented."
    },
    {
      "id": "cr2",
      "text": "Cites Abdul Rahman v. Shahab-ud-Din, Mohd. Zafaryab Khan v. Abdul Razaq, Ram Charan v. Bansidhar, Babuie Shanti Devi v. Khodai Prasad Singh supporting that oversight in bringing all heirs does not cause abatement absent fraud etc.",
      "addresses_issue": "i1",
      "key_observation": "Heirs brought on record represent entire estate unless deliberate exclusion or vitiating factors."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Estate of Dolai was fully represented by widow and major son; appeal before Subordinate Judge did not abate; absent heirs bound by decree.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Daya Ram v. Shyam Sundari",
      "citation": "1965 1 S.C.R. 231",
      "treatment": "followed",
      "relevance": "Heirs brought on record after bona fide enquiry represent entire estate; no abatement."
    },
    {
      "case_name": "N. K. Mohd. Sulaiman Sahib v. N. C. Mohd. Ismail Saheb",
      "citation": "1966 1 S.C.R. 937",
      "treatment": "followed",
      "relevance": "Plaintiff after due enquiry binds whole estate including unimpleaded heirs absent fraud/collusion."
    },
    {
      "case_name": "Abdul Rahman v. Shahab-ud-Din",
      "citation": "I.L.R. 1920 1 Lah. 481",
      "treatment": "followed",
      "relevance": "Sons brought on record as sole heirs; appeal did not abate despite other heirs under Mohammadan law."
    },
    {
      "case_name": "Mohd. Zafaryab Khan v. Abdul Razaq",
      "citation": "I.L.R. 1928 1 All. 857",
      "treatment": "followed",
      "relevance": "Final order bringing heir on record prevents abatement argument for other heirs."
    },
    {
      "case_name": "Ram Charan v. Bansidhar",
      "citation": "I.L.R. 1942 All. 671",
      "treatment": "followed",
      "relevance": "One daughter substituted represents entire estate; no abatement."
    },
    {
      "case_name": "Babuie Shanti Devi v. Khodai Prasad Singh",
      "citation": null,
      "treatment": "followed",
      "relevance": "Failure to bring widow technical defect; suit did not abate."
    }
  ],
  "statutes_cited": [],
  "outcome": {
    "disposition": "accepted",
    "summary": "Supreme Court allowed the appeal, set aside Orissa High Court judgment, held that appeal before Subordinate Judge did not abate and estate was fully represented, restoring decree in favour of plaintiffs.",
    "relief_granted": "Declaration of tenancy rights upheld; High Court judgment reversed.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "unless there is fraud or collusion or there are other circumstances which indicate that there has not been a fair or real trial or that against the absent heir there was a special case which was not and could not be tried in the proceeding",
      "speaker": "court",
      "significance": "Key condition for representation by partial heirs; none present here."
    },
    {
      "text": "the heirs who have applied for being brought on record should not be held to represent the entire estate including the interests of the heirs not brought on the record.",
      "speaker": "court",
      "significance": "Holds partial heirs represent full estate absent vitiating factors."
    }
  ],
  "_case_id": "1966_19",
  "_label": 1,
  "_text_length": 10494,
  "_extracted_at": "2026-02-10T19:38:47.452794"
}