{
  "metadata": {
    "case_name": "Shrichand Khetwani v. State",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "Raghubar Dayal, J."
    ],
    "case_number": "Criminal Appeal No. 184 of 1964",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "A. G. Nelson, Assistant Controller of Imports; P.H. Shingrani, Upper Division Clerk in the Quota Licensing Section; Shrichand Khetwani (appellant); and Ramshankar Ramayan Bhargava were tried for offence punishable under s. 120-B read with s. 409 I.P.C. and s. 5(2) read with s. 5(1)(d) of the Prevention of Corruption Act.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "All four accused were convicted by the trial Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On appeal, the Bombay High Court acquitted Bhargava and dismissed the appeals of the other three persons.",
      "type": "procedural",
      "date": "1964-07-16",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Present appeal by Khetwani by special leave; other two convicted persons have not appealed.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Prosecution case: In pursuance of the conspiracy, a number of licences in the name of several companies which had no existence were prepared; some of these were actually issued; two of those licences issued were in the name of M.L. Trading Co., Bombay, and were delivered to the appellant by Prabhakar Karmik, P.W. 20, a postman, on May 15, 1959.",
      "type": "material",
      "date": "1959-05-15",
      "source": "prosecution"
    },
    {
      "id": "f6",
      "text": "Appellant denied having received any such licences and having conspired with Nelson and Shingrani.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "Courts below relied on the statement of Karmik and found that the appellant received the licences issued in the name of the fictitious firm, M.L. Trading Co., and therefore the appellant was a member of the conspiracy.",
      "type": "admitted",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Various firms to whom licences were issued were fictitious.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Karmik delivered the registered envelope to the appellant on being told by him a day or so earlier that he would be getting some registered cover in the name of M.L. Trading Co., and that it be delivered to him.",
      "type": "material",
      "date": "1959-05-15",
      "source": "prosecution"
    },
    {
      "id": "f10",
      "text": "Karmik had been delivering letters to the appellant for a few years previously and knew the accused No. 3 for a long time before delivery; did not think it necessary to obtain any attestation for his signatures.",
      "type": "background",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f11",
      "text": "Investigating officer obtained specimen writings of the appellant but did not send for handwriting expert opinion as he could not secure admitted writings of the appellant.",
      "type": "procedural",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f12",
      "text": "Appellant waited for three or four days before approaching the Joint Chief Controller after receiving letter of Mishra asking him to meet the same evening or next day.",
      "type": "material",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the charge of a single conspiracy was established or whether facts proved existence of at least eight conspiracies, each related to issue of licences to one particular company.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether Karmik, P.W.20, was an accomplice.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether handwriting expert should have been examined to prove endorsement on postal receipt was in handwriting of appellant.",
      "framed_by": "petitioner"
    },
    {
      "id": "i4",
      "text": "Whether High Court erroneously sought corroboration of Karmik's statement from a single circumstance for which there was no evidence and which was not put to accused under s.342 Cr.P.C.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Charge of single conspiracy while facts proved at least eight conspiracies, each related to one particular company; charge therefore not established.",
      "supporting_facts": [
        "f5",
        "f7",
        "f8"
      ],
      "legal_basis": "R. v. Griffith"
    },
    {
      "id": "pa2",
      "text": "Karmik was an accomplice due to circumstances; High Court misread evidence by stating intimate relationship between appellant and Karmik.",
      "supporting_facts": [
        "f9",
        "f10"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Handwriting expert should have been examined especially since investigating officer obtained specimen writings.",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": null
    },
    {
      "id": "pa4",
      "text": "High Court sought corroboration from single circumstance (delay in meeting Joint Chief Controller) for which no evidence and not put to accused under s.342 Cr.P.C.",
      "supporting_facts": [
        "f12"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Charge describes single general conspiracy to issue licences in names of fictitious firms and share benefits; not separate conspiracies for each firm; members joined knowing modus operandi and to share profits.",
      "addresses_issue": "i1",
      "key_observation": "Mere fact that licences issued to eight different companies does not make eight different conspiracies."
    },
    {
      "id": "cr2",
      "text": "R. v. Griffith distinguished: there farmers were genuine and independent with no link; here no genuine companies, recipients posed with full knowledge of conspiracy.",
      "addresses_issue": "i1",
      "key_observation": "Case does not fit facts; contention that charge is wrong not sound."
    },
    {
      "id": "cr3",
      "text": "Karmik not accomplice; public servant who simply delivered envelope as instructed; knew appellant from prior deliveries in duty; High Court did not misread evidence.",
      "addresses_issue": "i2",
      "key_observation": "Intimacy from postal contacts; independent and disinterested witness."
    },
    {
      "id": "cr4",
      "text": "Not necessary to examine handwriting expert in every case; investigating officer could not get admitted writings, only specimens; practice requires admitted writings; material scanty, opinion might be deceptive; no adverse inference for failure to obtain evidence.",
      "addresses_issue": "i3",
      "key_observation": "Bona fides not questioned; adverse inference only if evidence withheld, not for failure to obtain."
    },
    {
      "id": "cr5",
      "text": "Karmik not accomplice so no need for corroboration; High Court believed him; delay not put to accused so cannot corroborate, but does not affect case as no corroboration required.",
      "addresses_issue": "i4",
      "key_observation": "Belief in Karmik's statement sufficient."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Charge of single conspiracy established; not multiple conspiracies.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Karmik is not an accomplice.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "No necessity to examine handwriting expert; no adverse inference.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    },
    {
      "id": "h4",
      "text": "No corroboration required for Karmik; delay circumstance does not affect.",
      "resolves_issue": "i4",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "R. v. Griffith",
      "citation": "1965 2 All. E.R. 448",
      "treatment": "distinguished",
      "relevance": "Petitioner relied on to argue multiple conspiracies; distinguished as farmers there genuine and independent, unlike fictitious firms here with shared knowledge."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "120-B",
        "409"
      ],
      "relevance": "Offence of conspiracy to abuse official positions and criminal breach of trust."
    },
    {
      "name": "Prevention of Corruption Act",
      "sections": [
        "5(2)",
        "5(1)(d)"
      ],
      "relevance": "Criminal misconduct by public servant in conspiracy."
    },
    {
      "name": "Code of Criminal Procedure",
      "sections": [
        "342"
      ],
      "relevance": "Examination of accused; circumstance not put to accused."
    },
    {
      "name": "Indian Evidence Act",
      "sections": [
        "114",
        "g"
      ],
      "relevance": "Adverse inference only if evidence withheld, not for failure to obtain."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal is dismissed; conviction of the appellant under s.120B r/w s.409 IPC and s.5(2) r/w s.5(1)(d) POCA is correct.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The conspiracy was a general conspiracy to keep on issuing licences in the names of fictitious firms and to share the benefits arising out of those licences when no real independent person was the licensee.",
      "speaker": "court",
      "significance": "Defines the nature of the single conspiracy upheld."
    },
    {
      "text": "On the whole we feel that Karmik is an independent and disinterested witness. There is no reason why Karmik should have perjured himself to implicate an innocent person.",
      "speaker": "court",
      "significance": "High Court's view on Karmik's credibility, affirmed by Supreme Court."
    },
    {
      "id": "kq3",
      "text": "An adverse inference against the prosecution can be drawn only if it withholds certain evidence and not merely on account of its failure to obtain certain evidence.",
      "speaker": "court",
      "significance": "Rules out adverse inference for not examining handwriting expert."
    }
  ],
  "_case_id": "1966_170",
  "_label": 0,
  "_text_length": 13275,
  "_extracted_at": "2026-02-10T19:40:14.266680"
}