{
  "metadata": {
    "case_name": "Appellant v. Habibur Rahman and Abdul Rahim",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "Wanchoo, J."
    ],
    "case_number": "Civil Appeal No. 1006 of 1964",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The appellant is carrying on business in petroleum products in the Patna district.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Habibur Rahman was serving as a watchman and Abdul Rahim as a driver in the permanent employ of the appellant at the Dinapore depot.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Habibur Rahman and Abdul Rahim were charged with gross misconduct and an enquiry was held by the appellant.",
      "type": "disputed",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Habibur Rahman was discharged on May 5, 1960 and one month's pay in lieu of notice was offered to him.",
      "type": "procedural",
      "date": "1960-05-05",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Abdul Rahim was dismissed on April 22, 1960.",
      "type": "procedural",
      "date": "1960-04-22",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Habibur Rahman and Abdul Rahim made applications under s. 26 of the Act in December 1960 before the labour court. These applications were obviously barred by time.",
      "type": "procedural",
      "date": "1960-12",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "The labour court condoned the delay without giving any notice to the appellant on the question and issued notice to show cause why the dismissal/discharge be not set aside.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "On receipt of notice, the appellant learnt that delay had been condoned without hearing it and consequently moved the High Court at Patna under Art. 226 of the Constitution for quashing the order of the labour court condoning the delay.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Thereafter in March 1961 the appellant moved the labour court for recalling the ex parte order of condonation.",
      "type": "procedural",
      "date": "1961-03",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "The labour court heard the appellant on March 27, 1961 and decided on April 4, 1961 to condone the delay and confirm the ex parte order already passed.",
      "type": "procedural",
      "date": "1961-04-04",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "The appellant filed another writ petition in the High Court attacking the order dated April 4, 1961 and the validity of s. 26 of the Act.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "A number of other petitions attacking the validity of s. 26 were filed before the High Court. All heard together. Patna High Court held s. 26 constitutionally valid and that the order of April 4, 1961 showed delay condoned after hearing the appellant.",
      "type": "procedural",
      "date": "1963-08-07",
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "High Court refused certificate to appeal to Supreme Court. Appellant applied for special leave, which was granted.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Constitutionality of the proviso to s. 26 of the Bihar Shops and Establishments Act, 1954, on the ground of excessive delegation.",
      "framed_by": "appellant"
    },
    {
      "id": "i2",
      "text": "Validity of the labour court's order dated April 4, 1961 condoning delay after hearing.",
      "framed_by": "appellant"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The proviso to s. 26 suffers from the vice of excessive delegation as it gives arbitrary and naked power to the State Government to specify any misconduct on proof of which notice could be dispensed with.",
      "supporting_facts": [
        "f3",
        "f4",
        "f5"
      ],
      "legal_basis": "Proviso to s. 26 of Bihar Shops and Establishments Act, 1954"
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "There is no substance in the contention of excessive delegation. Under s. 40(c) of the Act, State Government empowered to frame rules for nature of misconduct. R. 20(1) specifies 11 acts of misconduct treated as such for dispensing with notice.",
      "addresses_issue": "i1",
      "key_observation": "Guidance in the words of the section itself for specifying major misconducts justifying dismissal/discharge."
    },
    {
      "id": "cr2",
      "text": "In industrial law, misconduct divided into major (justifying dismissal) and minor (lesser punishment). Legislature indicated State Government to prescribe major misconducts.",
      "addresses_issue": "i1",
      "key_observation": "Sufficient guidance; legislature kept flexibility for State Government."
    },
    {
      "id": "cr3",
      "text": "Rule 20(1) properly understood guidance, lists major misconducts including breach of Standing Orders under 1946 Act.",
      "addresses_issue": "i1",
      "key_observation": "Proviso not ultra vires."
    },
    {
      "id": "cr4",
      "text": "First condonation ex parte but after writ, labour court heard appellant on March 27, 1961 and confirmed on April 4, 1961. High Court did not interfere. No ground for Supreme Court interference in special leave appeal.",
      "addresses_issue": "i2",
      "key_observation": "Order made after hearing both parties."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Proviso to s. 26(1) is constitutionally valid; no excessive delegation.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "No interference with labour court's order condoning delay dated April 4, 1961.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Bihar Shops and Establishments Act, 1954",
      "sections": [
        "s. 26",
        "s. 40",
        "r. 20(1)"
      ],
      "relevance": "S.26 requires notice for dismissal/discharge except for prescribed misconduct; proviso delegates to State Govt; s.40 empowers rules; r.20(1) lists misconducts."
    },
    {
      "name": "Industrial Employment (Standing Orders) Act, 1946",
      "sections": [],
      "relevance": "Breach of certified Standing Orders included as misconduct under r.20(1)."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 226"
      ],
      "relevance": "Basis for writ petitions to High Court."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal by special leave against the Patna High Court judgment upholding the constitutionality of s.26 proviso and the labour court's order condoning delay is dismissed. No interference warranted.",
    "relief_granted": null,
    "costs": "Costs to respondent No. 4"
  },
  "key_quotes": [
    {
      "text": "We are of opinion that there is no substance in this contention.",
      "speaker": "court",
      "significance": "Rejects argument of excessive delegation."
    },
    {
      "text": "This in our opinion is sufficient guidance to the State Government to specify in the rule it was expected to make such misconduct as is generally understood in industrial law to call for the punishment of discharge dismissal.",
      "speaker": "court",
      "significance": "Explains legislative guidance for delegation."
    },
    {
      "text": "The appeal therefore fails and is hereby dismissed with costs to respondent No.",
      "speaker": "court",
      "significance": "Final disposition of the appeal."
    }
  ],
  "_case_id": "1966_249",
  "_label": 0,
  "_text_length": 9831,
  "_extracted_at": "2026-02-10T19:41:32.656557"
}