{
  "metadata": {
    "case_name": "M/s Fatehchand Murlidhar & Anr. v. Commissioner of Income-tax",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "Sikri, J."
    ],
    "case_number": "Civil Appeal Nos. 1108 to 1110 of 1964",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Murlidhar Himatsingka was carrying on business in shellac, jute, hessian etc. under the name and style of Fatehchand Murlidhar at 14/1, Clive Row and 71, Burtolla Street, Calcutta.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Murlidhar Himatsingka was also a partner in the registered firm, Messrs Basantlal Ghanshyamdas having 2/8 share.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On December 21, 1949, a deed of partnership was executed by Murlidhar Himatsingka and his two sons, Madanlal Himatsingka and Radhaballav Himatsingka and a grandson named Mahabir Prasad Himatsingka.",
      "type": "material",
      "date": "1949-12-21",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The deed recited that Murlidhar Himatsingka had become too old and infirm to look after the various businesses and that Madanlal and Radha Ballav were already practically managing the business and that they had signified their intention to become the partners of the said firm Fatehchand Murlidhar and had agreed to contribute capital, Rupees ten thousand, Rupees five thousand and Rupees five thousand respectively.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Clause 5 of the deed: The profits and losses for the share of the said Murlidhar Himatsingka as partner in the said partnership firm of Basantlal Ghanshyamdas shall belong to the present partnership and shall be divided and borne by the parties hereto in accordance with the shares as specified hereafter, but the capital with its assets and liabilities will belong exclusively to Murlidhar Himatsingka the party hereto of the First Part and the Parties hereto of the Second, Third and Fourth parts shall have no lien or claim upon the said share capital or assets of the party hereto of the first part in the business of the said Messrs Basantlal Ghanshyamdas.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Clause 10: The Profits and losses if any of the partnership including the shares of the profits and losses of the said partnership firm of Basantlal Ghanshyamdas aforesaid shall be divided and borne by and between the parties in the following manner-- Party hereto of the First Part-Six annas (Murlidhar Himatsingka). Party hereto of the Second Part-Four annas (Madanlal Himatsingka). Party hereto of the Third Part-Three annas (Radhaballav Himatsingka). Party hereto of the Fourth Part-Three annas (Mahabirprasad Himatsingka).",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "For the assessment year 1955-56 the Income Tax Officer included the income from the share in the registered firm of Basantlal Ghanshyamdas in the individual assessment of Murlidhar Himatsingka.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "In Income Tax Reference No. 20 of 1959 made at the instance of M/s Fatehchand Murlidhar, the question referred was whether on the facts and in the circumstances of the case, the income of Murlidhar Himatsingka for his share in the firm of Messrs. Basantlal Ghanshyamdas for the assessment years 1952-53 and 1953-54 was rightly excluded from the income of the applicant firm.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "In Income Tax Reference No. 21 of 1959 made at the instance of Shri Murlidhar Himatsingka, the question referred was whether on the facts and circumstances of the case the income of Murlidhar Himatsingha for his share in the firm of Messrs. Basantlal Ghanshyamdas for the assessment year 1955-56 was rightly included in his personal assessment for that year.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Murlidhar Himatsingka appealed to the Appellate Assistant Commissioner who held that as Murlidhar Himatsingka was a partner in the registered firm of Basantlal Ghanshyamdas, his share had to be assessed in his hands under s. 23(5)(a) of the Act. He further held that the agreement was merely an arrangement which came into force after the profits were earned and not before they were earned.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "The Appellate Tribunal dismissed the appeal agreeing with the Appellate Assistant Commissioner.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "The High Court held that it was a case of diversion of income by Murlidhar Himatsingka after it had accrued to him and it was not a diversion at the source by any overriding interest. The High Court answered the questions in the affirmative in both the references.",
      "type": "procedural",
      "date": "1962-08-01",
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Murlidhar Himatsingka and M/s Fatehchand Murlidhar obtained special leave, leading to these appeals.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the income of Murlidhar Himatsingka from the firm of Messrs. Basantlal Ghanshyamdas, in which he was a partner, should be included in his personal assessment or in the assessment of the firm of Fatehchand Murlidhar, to which Murlidhar Himatsingka had purported to assign the profits and losses from Messrs. Basantlal Ghanshyamdas.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the agreement dated December 21, 1949, has succeeded in diverting the income from Murlidhar's share in Messrs. Basantlal Ghanshyamdas to Messrs. Fatehchand Murlidhar before it reached Murlidhar.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "A partner's share is property capable of being assigned, mortgaged, charged and dealt with as any other property, and where a partner sells his share to a stranger, though that stranger does not become a partner yet the vendor partner holds the property as trustee for the purchaser and consequently the income received by the partner is not his income but the income of the purchaser.",
      "supporting_facts": [],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "By the agreement dated December 21, 1949, Murlidhar Himatsingka had entered into a sub-partnership with his two sons and a grandson in respect of his share in the firm Basantlal Ghanshyamdas, and it is the sub-partnership that is entitled to the income from the firm Basantlal Ghanshyamdas and not Murlidhar Himatsingka who must be taken to be acting on behalf of the firm Fatehchand Murlidhar.",
      "supporting_facts": [
        "f3",
        "f5",
        "f6"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "The Indian Income Tax Act taxes real income and not notional income and the real income in this case belonged not to Murlidhar but to M/s Fatehchand Murlidhar.",
      "supporting_facts": [],
      "legal_basis": "Indian Income-tax Act, 1922"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "This agreement is a mere device for dividing income which had accrued to Murlidhar Himatsingka among his sons and grandson.",
      "supporting_facts": [],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "The Indian Income Tax Act does not contemplate the application of s. 23(5)(a) twice. The firm of Basantlal Ghanshyamdas was a registered firm and the Income Tax Officer was bound under s. 23(5)(a), to assess Murlidhar in respect of the income received from this firm; he could not carry this income to the assessment of another registered firm, namely, Fatehchand Murlidhar, and then apply s. 23(5)(a).",
      "supporting_facts": [
        "f2",
        "f7"
      ],
      "legal_basis": "Section 23(5)(a) of the Indian Income-tax Act, 1922"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The agreement dated December 21, 1949, constituted a sub-partnership in respect of Murlidhar's share in Messrs. Basantlal Ghanshyamdas.",
      "addresses_issue": "i2",
      "key_observation": "Losses were also to be shared and the right to receive profits and pay losses became an asset of the firm, Fatehchand Murlidhar."
    },
    {
      "id": "cr2",
      "text": "The true test is whether the amount sought to be deducted, in truth, never reached the assessee as his income. Obligations, no doubt, there are in every case, but it is the nature of the obligation which is the decisive fact. There is a difference between an amount which a person is obliged to apply out of his income and an amount which by the nature of the obligation cannot be said to be a part of the income of the assessee. Where by the obligation income is diverted before it reaches the assessee, it is deductible but where the income is required to be applied to discharge an obligation after such income reaches the assessee, the same consequence, in law, does not follow.",
      "addresses_issue": "i1",
      "key_observation": "From Commissioner of Income-tax, Bombay v. Sitaldas Tirathdas."
    },
    {
      "id": "cr3",
      "text": "A sub-partnership is, as it were, a partnership within a partnership, it presupposes the existence of a partnership to which it is itself subordinate. An agreement to share profits only constitutes a partnership between the parties to the agreement. If, therefore, several persons are partners and one of them agrees to share the profits derived by him with a stranger, this agreement does not make the stranger a partner in the original firm. The result of such an agreement is to constitute what is called a sub-partnership.",
      "addresses_issue": "i2",
      "key_observation": "From Lindley on Partnership."
    },
    {
      "id": "cr4",
      "text": "In the case of a sub-partnership the sub-partnership creates a superior title and diverts the income before it becomes the income of the partner. In other words, the partner in the main firm receives the income not only on his behalf but on behalf of the partners in the sub-partnership.",
      "addresses_issue": "i1",
      "key_observation": "Reversing the High Court's view."
    },
    {
      "id": "cr5",
      "text": "There is no substance in the contention that s. 23(5)(a) cannot be applied twice, as a benamidar can be a partner in a firm and income can be assessable in the hands of the real owner.",
      "addresses_issue": "i1",
      "key_observation": "The object of s. 23(5)(a) is not to assess the firm itself but to apportion the income among the various partners."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The High Court was in error in holding that there was no question of an overriding obligation in this case and that the income remained the income of Murlidhar Himatsingka in spite of the sub-partnership created by him under the agreement dated December 21, 1949.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "The agreement dated December 21, 1949, constituted a sub-partnership which diverts the income at source to the sub-partnership firm Fatehchand Murlidhar.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Commissioner of Income-tax, Bombay v. Sitaldas Tirathdas",
      "citation": "1961 3 S.C.R. 634",
      "treatment": "followed",
      "relevance": "Laid down the test for diversion of income at source vs application after receipt."
    },
    {
      "case_name": "Ratilal B. Daftari v. Commissioner of Income-tax, Bombay",
      "citation": "33 I.T.R. 390",
      "treatment": "followed",
      "relevance": "Similar facts where sub-partnership held to divert income from assessee."
    },
    {
      "case_name": "Motilal Manekchand v. Commissioner of Income-tax",
      "citation": "31 I.T.R. 735",
      "treatment": "referred",
      "relevance": "Relied upon in Ratilal case."
    },
    {
      "case_name": "Commissioner of Income-tax, Punjab v. Laxmi Trading Company",
      "citation": "24 I.T.R. 173",
      "treatment": "referred",
      "relevance": "Sub-partnerships recognised and registered under Income Tax Act."
    },
    {
      "case_name": "Charandas Haridas v. Commissioner of Income-tax",
      "citation": "1960 3 S.C.R. 296",
      "treatment": "followed",
      "relevance": "Karta's change in character vis-a-vis family after partial partition of income."
    },
    {
      "case_name": "Mahaliram Santhalia v. Commissioner of Income-tax",
      "citation": "33 I.T.R. 261",
      "treatment": "overruled",
      "relevance": "Wrongly held no diversion in similar sub-partnership agreement."
    },
    {
      "case_name": "Commissioner of Income-tax, Gujarat v. Abdul Rahim",
      "citation": "55 I.T.R. 651",
      "treatment": "followed",
      "relevance": "Benamidar partner; real owner assessable."
    },
    {
      "case_name": "Commissioner of Income-tax, West Bengal v. Kalu Babu Lal Chand",
      "citation": "37 I.T.R. 123",
      "treatment": "followed",
      "relevance": "Income from partnership received by karta assessable in HUF."
    },
    {
      "case_name": "Kaniram Hazarimull v. Commissioner of Income-tax",
      "citation": "27 I.T.R. 294",
      "treatment": "followed",
      "relevance": "Karta's partnership income assessable in HUF."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act, 1922",
      "sections": [
        "s. 66(1)",
        "s. 23(5)(a)"
      ],
      "relevance": "References under s.66(1); assessment of partner's share in registered firm under s.23(5)(a); object to apportion income among partners."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "The Supreme Court allowed the appeals by special leave against the Calcutta High Court's judgment dated August 1, 1962, holding that the agreement created a sub-partnership diverting the income from Murlidhar Himatsingka's share in Basantlal Ghanshyamdas to the firm Fatehchand Murlidhar before it reached him personally.",
    "relief_granted": "Income from Murlidhar's share in Basantlal Ghanshyamdas to be assessed in the hands of Fatehchand Murlidhar firm, not Murlidhar personally.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"In our opinion, the true test is whether the amount sought to be deducted, in truth, never reached the assessee as his income.\"",
      "speaker": "court",
      "significance": "Test for diversion of income from Sitaldas Tirathdas case."
    },
    {
      "text": "\"A sub-partnership is, as it were, a partnership within a partnership, it presupposes the existence of a partnership to which it is itself subordinate.\"",
      "speaker": "court",
      "significance": "Definition and effect of sub-partnership from Lindley on Partnership."
    },
    {
      "text": "\"In the case of a sub-partnership the sub-partnership creates a superior title and diverts the income before it becomes the income of the partner.\"",
      "speaker": "court",
      "significance": "Core holding on why income is diverted at source."
    }
  ],
  "_case_id": "1966_204",
  "_label": 1,
  "_text_length": 25246,
  "_extracted_at": "2026-02-10T19:41:04.221292"
}