{
  "metadata": {
    "case_name": "Deputy Commercial Tax Officer, Madurai v. Madurai Mills Co., Ltd.",
    "case_year": 1965,
    "court": "Supreme Court of India",
    "judges": [
      "Ramaswami, J."
    ],
    "case_number": "Civil Appeal No. 539 of 1965",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The respondent, Madurai Mills Co., Ltd., is a dealer in yarn, purchasing raw material like cotton staple-fibre, manufacturing into yarn and selling yarn.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "In assessment year 1950-51, respondent showed return of Rs. 15,27,61,883-8-4 before Deputy Commercial Tax Officer, Madurai, who determined net turnover at Rs. 15,44,09,109-3-1.",
      "type": "procedural",
      "date": "1950-51",
      "source": "lower_court"
    },
    {
      "id": "f3",
      "text": "Deputy CTO included Rs. 1,44,294-14-4 as commission paid to Comorin Investment Trading Company Limited for purchase of cotton, and Rs. 81,546-0-1 as sale proceeds of empty drums etc.",
      "type": "disputed",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f4",
      "text": "Respondent appealed to Commercial Tax Officer Madurai South, contending exclusion of Rs. 1,44,294-14-4 (commission) and Rs. 81,546-0-1 (drums). CTO excluded commission but rejected drums exclusion.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f5",
      "text": "Deputy CTO issued revised assessment after CTO order.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "Respondent filed revision before Deputy Commissioner of Commercial Taxes, objecting only to inclusion of tax collected Rs. 6,57,971-4-9 in taxable turnover. Dismissed on 21st August, 1954, holding not entitled to raise for first time and permitted by Madras General Sales Tax (Definition of Turnover and Validation of Assessments) Act, 1954.",
      "type": "procedural",
      "date": "1954-08-21",
      "source": "respondent"
    },
    {
      "id": "f7",
      "text": "Deputy CTO's revised assessment order dated 28th November, 1952, excluded Rs. 7,74,62,706-1-6 value of cotton purchased from outside State of Madras.",
      "type": "material",
      "date": "1952-11-28",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Board of Revenue issued notice on 4th August, 1958, proposing to revise Deputy CTO assessment by including Rs. 7,74,62,706-1-6 wrongly excluded.",
      "type": "procedural",
      "date": "1958-08-04",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Respondent objected to Board's revision on ground barred by limitation under s.12 Madras General Sales Tax Act and no wrong exclusion.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f10",
      "text": "Board of Revenue overruled objections on 25th August, 1958, fixed net taxable turnover at Rs. 23,17,15,948-15-2.",
      "type": "procedural",
      "date": "1958-08-25",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Respondent appealed to Madras High Court against Board's order; High Court allowed appeal on 13th September, 1961, holding Board could not invoke revisional jurisdiction after limitation under s.12(4)(b), set aside Board's order.",
      "type": "procedural",
      "date": "1961-09-13",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Appellant filed appeal by special leave to Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the order of the Board of Revenue dated 25th August, 1958 was illegal because there was a contravention of the rule of limitation laid down by s.12(4)(b) of the Madras General Sales Tax Act, as made after 4 years from the date on which the order of the Deputy Commercial Tax Officer was communicated to the assessee.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether there was merger of the Deputy CTO's assessment order dated 28th November, 1952 with the Deputy Commissioner's revisional order dated 21st August, 1954, such that Board's revision was from the later date.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The order revised by Board was the revisional order of Deputy Commissioner dated 21st August, 1954, not the Deputy CTO order, so within 4 years limitation under s.12(4)(b).",
      "supporting_facts": [
        "f6",
        "f10"
      ],
      "legal_basis": "s.12(4)(b) Madras General Sales Tax Act"
    },
    {
      "id": "pa2",
      "text": "Doctrine of merger applies: appellate/revisional order merges original order; here Deputy Commissioner's order affirms, so merger, and Board's revision from 1954 order.",
      "supporting_facts": [
        "f6",
        "f7"
      ],
      "legal_basis": "Commissioner of Income-tax, Bombay v. Amritlal Bhogilal & Co."
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Board's proceeding barred by limitation under s.12(4)(b) from date of Deputy CTO order.",
      "supporting_facts": [
        "f7",
        "f8",
        "f9"
      ],
      "legal_basis": "s.12(4)(b) Madras General Sales Tax Act"
    },
    {
      "id": "ra2",
      "text": "No wrong exclusion of Rs. 7,74,62,706-1-6 by Deputy CTO.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Subject-matter of Board's revision was revised assessment order of Deputy CTO dated 28th November, 1952 regarding exemption on cotton from outside Madras, not raised before Deputy Commissioner.",
      "addresses_issue": "i1",
      "key_observation": "Order made beyond 4 years from 1952 order, invalid."
    },
    {
      "id": "cr2",
      "text": "Doctrine of merger not applicable rigidly; depends on subject-matter and scope. Here, no merger because exemption issue not before Deputy Commissioner, who dealt only with tax inclusion.",
      "addresses_issue": "i2",
      "key_observation": "Different issues; no fusion of orders."
    },
    {
      "id": "cr3",
      "text": "Cited Amritlal Bhogilal: registration order did not merge as not subject of appeal. Similarly Mohammed Nooh: no merger where issues differ.",
      "addresses_issue": "i2",
      "key_observation": "Merger not universal; not applicable here."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Board of Revenue's order dated 25th August, 1958 invalid as beyond 4-year limitation under s.12(4)(b) from Deputy CTO's 28th November, 1952 order.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Doctrine of merger does not apply as subject-matters differed between Deputy Commissioner's revision (tax inclusion) and Board's (exemption on inter-state cotton).",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Commissioner of Income-tax, Bombay v. Amritlal Bhogilal & Co.",
      "citation": "1959 S.C.R. 713; 34 I.T.R. 130",
      "treatment": "followed",
      "relevance": "Doctrine of merger not rigid; no merger if issue not subject of appeal/revision."
    },
    {
      "case_name": "The State of Uttar Pradesh v. Mohammed Nooh",
      "citation": "1958 S.C.R. 595",
      "treatment": "followed",
      "relevance": "Principle of merger does not apply where orders on different matters."
    }
  ],
  "statutes_cited": [
    {
      "name": "Madras General Sales Tax Act, 1939",
      "sections": [
        "s.12(1)",
        "s.12(2)",
        "s.12(3)",
        "s.12(4)(b)"
      ],
      "relevance": "Governs revisional powers and 4-year limitation from communication of assessment order to assessee."
    },
    {
      "name": "Madras General Sales Tax (Definition of Turnover and Validation of Assessments) Act, 1954",
      "sections": [],
      "relevance": "Permitted inclusion of tax in taxable turnover."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court dismissed the appeal against Madras High Court judgment, upholding that Board of Revenue's revisional order was barred by limitation under s.12(4)(b), as it targeted the 1952 assessment order beyond 4 years, with no merger doctrine applicable.",
    "relief_granted": "High Court order upheld; Board of Revenue order set aside.",
    "costs": "Appeal dismissed with costs."
  },
  "key_quotes": [
    {
      "text": "The doctrine of merger is not a doctrine of rigid and universal application and it cannot be said that wherever there are two orders, one by the inferior Tribunal and the other by a superior Tribunal... there is a fusion or merger of two orders irrespective of the subject-matter...",
      "speaker": "court",
      "significance": "Core reasoning rejecting merger argument."
    },
    {
      "text": "It follows that the order of the Board of Revenue was made beyond the limit of four years prescribed by s.12(4)(b) of the Act and it is, therefore, invalid.",
      "speaker": "court",
      "significance": "Direct holding on limitation violation."
    }
  ],
  "_case_id": "1966_55",
  "_label": 0,
  "_text_length": 12866,
  "_extracted_at": "2026-02-10T19:38:53.887102"
}