{
  "metadata": {
    "case_name": "Customs Authorities v. Respondents",
    "case_year": 1966,
    "court": "Supreme Court of India",
    "judges": [
      "Shelat, J."
    ],
    "case_number": "Civil Appeal No. 275 of 1966",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "On March 31, 1959 the respondents obtained a licence to import certain machinery from West Germany. The import licence contained particulars of the machinery to be imported and inter alia stated that its value would be C.I.F. value of Rs. 45,000.",
      "type": "material",
      "date": "1959-03-31",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "One of the conditions upon which the licence was issued was that the above application is accepted and import licence is granted having quantity and value as the limiting factor and is number valid for clearance if the actual value of any item exceeds the C.I.F. value indicated in the licence by more than five per cent.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The machinery arrived at the port of Calcutta sometime in July 1960 and was allowed to be cleared on the bill of entry submitted on behalf of the respondents. The bill of entry showed the C.I.F. value of the machinery at Rs. 44,843.61 nP.",
      "type": "material",
      "date": "1960-07",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The customs authorities thereafter assessed the duty payable on the said machinery and the duty so assessed was paid by the respondents.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "On May 6, 1961, in consequence of certain information received by the authorities a search was made of the business premises of the respondents and also of Stahlumon Co., Ltd., the agents of the exporters. As a result of the search certain documents and papers were seized by the customs authorities.",
      "type": "procedural",
      "date": "1961-05-06",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "On June 19/20, 1961 a notice was served upon the respondents calling upon them to show cause why action should number be taken against them under s. 167(8) of the Sea Customs Act, 1878. The notice alleged that the respondents were guilty of illegal import of goods worth Rs. 6,730.74 nP, that being the excess value of the goods permitted to be imported under the said licence.",
      "type": "procedural",
      "date": "1961-06-19",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "The respondents in due course gave their explanation.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Thereafter an amended show cause notice dated September 21, 1961 was served upon the respondents charging them under s. 167(8) of the Sea Customs Act read with s. 3(2) of the Imports and Exports Control Act, 1947 for illegally importing the said consignment.",
      "type": "procedural",
      "date": "1961-09-21",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "The respondents were given a personal hearing and thereafter the first petitioner passed an order dated March 17, 1962 directing confiscation of the said machinery and imposing a fine of Rs. 20,000 in lieu of confiscation and further imposing a personal penalty of Rs. 25,000/-",
      "type": "procedural",
      "date": "1962-03-17",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Aggrieved by this order the respondents filed a petition in the High Court under Art. 226 of the Constitution praying for mandamus directing the petitioners to rescind the order dated March 17, 1962 and for certiorari quashing the said order.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "The learned single Judge who heard the petition passed an order dated September 2, 1963 dismissing the petition holding that the said import was illegal.",
      "type": "procedural",
      "date": "1963-09-02",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Thereupon the respondents filed an appeal against the said order and the Appellate Bench of the High Court by its orders dated December 18, 1964 allowed the respondents appeal directing the petitioners to forbear from giving effect to the said order of the first petitioner.",
      "type": "procedural",
      "date": "1964-12-18",
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "The petitioners filed an application for a certificate under Art. 133 but the Appellate Bench of the High Court by its order dated August 17, 1965 dismissed the said application on the ground that it was barred by limitation, though holding that the valuation tests laid down in sub-cl. (a) and (b) of Art. 133(1) were satisfied, and that the order being one of reversal the petitioners were otherwise entitled to a certificate.",
      "type": "procedural",
      "date": "1965-08-17",
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "On December 19, 1964 the petitioners applied for certified copies of the said judgment and the said order.",
      "type": "procedural",
      "date": "1964-12-19",
      "source": "petitioner"
    },
    {
      "id": "f15",
      "text": "The certified copy of the judgment was furnished to the petitioners on January 18, 1965.",
      "type": "procedural",
      "date": "1965-01-18",
      "source": "court"
    },
    {
      "id": "f16",
      "text": "The petitioners however waited for the certified copy of the said order which was yet number furnished to them.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f17",
      "text": "As the certified copy of the said order was number finalised and was number ready the petitioners filed the said application for leave on May 10, 1965 annexing thereto the certified copy of the judgment only.",
      "type": "procedural",
      "date": "1965-05-10",
      "source": "petitioner"
    },
    {
      "id": "f18",
      "text": "On July 17, 1965, a certified copy of the said order was furnished to the petitioners but they did number annex it to their application for leave as it was already filed.",
      "type": "procedural",
      "date": "1965-07-17",
      "source": "court"
    },
    {
      "id": "f19",
      "text": "The High Court however observed, that if the petitioners had annexed the certified copy of the said order furnished to them on July 17, 1965 they would have been entitled to exclude the time taken in obtaining it from the period of limitation under s.12(2) of the Limitation Act.",
      "type": "background",
      "date": null,
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the application for leave to appeal was barred by limitation and the petitioners were number entitled under s. 12(2) of the Limitation Act to exclude the time taken in obtaining the certified copy of the said order.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Sub-ss. 2 and 3 of s. 12 enact the rule of exclusion as a positive direction. The object of the sub-section being to afford a party opportunity to consider his position even where a certified copy of the judgment gives all the necessary information enabling the party to decide to proceed further or number, he would nevertheless be entitled to exclude the time for obtaining the certified copy of the decree or order.",
      "supporting_facts": [
        "f13",
        "f14",
        "f15",
        "f16",
        "f17",
        "f18"
      ],
      "legal_basis": "Limitation Act s.12(2), s.12(3)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The right of exclusion of time is qualified by the words time requisite for obtaining a copy of the decree, sentence or order in sub-section 2. Therefore, if an application for leave to appeal does number require a certified copy of the order in question to be annexed to the application, it is number possible to say that the time required for obtaining such a copy was requisite.",
      "supporting_facts": [
        "f17"
      ],
      "legal_basis": "Limitation Act s.12(2); Rules of the High Court of Calcutta, Chapter XXXIIIA, Rule 4, Form No. 3"
    },
    {
      "id": "ra2",
      "text": "Since under Art. 132 of the Limitation Act the application for leave had to be made within 60 days, the petitioners application lodged on May 10, 1965 was clearly beyond 60 days even after the certified copy of the judgment was furnished to them on January 18, 1965.",
      "supporting_facts": [
        "f15",
        "f17"
      ],
      "legal_basis": "Limitation Act Art. 132"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "On a plain reading of these sub-sections, it is clear that the time for obtaining the certified copy of both the judgment and the decree or order as the case may be must be excluded while computing the period of limitation. The object of the exclusion is to enable the person desiring to appeal to consider the terms of the decree, judgment and order before he decides to launch a further proceeding in respect of it.",
      "addresses_issue": "i1",
      "key_observation": "Section 12(2) provides a positive direction for exclusion irrespective of court rules."
    },
    {
      "id": "cr2",
      "text": "The Privy Council in Surty v. Chettyar held that s. 12(2) plainly lays down a positive direction for exclusion of time without any reference to the Code of Civil Procedure or any other Act, and applies irrespective of whether the rules permitted the filing without annexing the copy.",
      "addresses_issue": "i1",
      "key_observation": "Preponderance of practice in India and grammatical construction support exclusion even if not required to annex."
    },
    {
      "id": "cr3",
      "text": "The view contended for on behalf of the respondents is thus number only contrary to the decision of the Privy Council but if accepted would lead to a somewhat surprising result.",
      "addresses_issue": "i1",
      "key_observation": "Rules conferring privilege do number govern the positive direction in s.12."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Provisions of s. 12(2) and (3) are a positive direction excluding the time taken in obtaining a copy of the judgment and decree or order as the case may be and those provisions are irrespective of the Code of Civil Procedure or the rules made by a court under s. 122 of the Code.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Surty v. Chettyar",
      "citation": "55 I.A. 161",
      "treatment": "followed",
      "relevance": "Holds that s.12(2) is positive direction for exclusion of time for certified copies irrespective of court rules permitting filing without annexing copies."
    },
    {
      "case_name": "Imperial Bucket Co. v. Smt. Bhagwati Basak",
      "citation": "A.I.R. 1954 Cal. 520",
      "treatment": "referred",
      "relevance": "Observations that appellant gets benefit of s.12 where copy annexed even if number required."
    },
    {
      "case_name": "Gangaram Beharilal",
      "citation": "A.I.R. 1952 Bhopal 39",
      "treatment": "doubted",
      "relevance": "View that s.12(2),(3) only apply when copy accompanies application; contrary to Privy Council."
    },
    {
      "case_name": "Abdul Aziz v. Jai Ram",
      "citation": "A.I.R. 1951 H P. 67",
      "treatment": "doubted",
      "relevance": "Similar view to Gangaram; contrary to Privy Council."
    },
    {
      "case_name": "Haji Hassum v. Noor Mohammedan",
      "citation": "I.L.R. Bom. 643",
      "treatment": "followed",
      "relevance": "Entitled to exclusion even if rules permit filing without copy."
    },
    {
      "case_name": "Kalipada v. Shakhar",
      "citation": "24 Cal. 235",
      "treatment": "followed",
      "relevance": "Entitled to exclusion even if rules permit filing without copy."
    },
    {
      "case_name": "Waji-Ali Shah v. Nawal Kishore",
      "citation": "I.L.R. 17 All. 213",
      "treatment": "followed",
      "relevance": "Entitled to exclusion even if rules permit filing without copy."
    }
  ],
  "statutes_cited": [
    {
      "name": "Sea Customs Act, 1878",
      "sections": [
        "167(8)"
      ],
      "relevance": "Basis for show cause notice and confiscation order."
    },
    {
      "name": "Imports and Exports (Control) Act, 1947",
      "sections": [
        "3(2)"
      ],
      "relevance": "Read with Sea Customs Act for charging illegal import."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "226",
        "133"
      ],
      "relevance": "Art.226 for writ petition; Art.133 for certificate of fitness to appeal."
    },
    {
      "name": "Limitation Act",
      "sections": [
        "12(2)",
        "12(3)"
      ],
      "relevance": "Exclusion of time for obtaining certified copies in computing limitation for leave to appeal."
    },
    {
      "name": "Code of Civil Procedure",
      "sections": [
        "122"
      ],
      "relevance": "Rules made under it do number override s.12 Limitation Act."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed, High Court's order of dismissal set aside, case remanded to High Court to decide the application for leave under Art.133 in light of this judgment. No order on condonation of delay petition. Special Leave Petition 1110 of 1965 allowed to be withdrawn.",
    "relief_granted": "Remand to High Court for decision on merits of leave application",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "On a plain reading of these sub-sections, it is clear that the time for obtaining the certified copy of both the judgment and the decree or order as the case may be must be excluded while computing the period of limitation.",
      "speaker": "court",
      "significance": "Core interpretation of s.12(2) and (3) Limitation Act."
    },
    {
      "text": "The provisions of s. 12(2) and (3) are a positive direction excluding the time taken in obtaining a copy of the judgment and decree or order as the case may be and those provisions are irrespective of the Code of Civil Procedure or the rules made by a court under s. 122 of the Code.",
      "speaker": "court",
      "significance": "Holding affirming exclusion irrespective of court rules."
    },
    {
      "text": "if, indeed, it could be shown that in some particular class of cases there could be no object in obtaining the two documents, an argument might be offered that no time could be requisite for obtaining something not requisite. But this is not so.",
      "speaker": "court",
      "significance": "Quoting Privy Council to justify universal exclusion under s.12."
    }
  ],
  "_case_id": "1966_228",
  "_label": 1,
  "_text_length": 21187,
  "_extracted_at": "2026-02-10T19:41:03.138086"
}