{
  "metadata": {
    "case_name": "State of Mysore v. Respondent",
    "case_year": 1966,
    "court": "Supreme Court of India",
    "judges": [
      "Shelat, J."
    ],
    "case_number": "Civil Appeal No. 1420 of 1966",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Respondent entered government service as an officiating compositor in the Government Press on March 11, 1958 and continued in that post until September 1, 1958.",
      "type": "background",
      "date": "1958-03-11",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Respondent was thereafter appointed from time to time in officiating capacity in different posts in the same department until December 3, 1959 when he was appointed as a proof examiner.",
      "type": "background",
      "date": "1959-12-03",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Respondent continued as proof examiner until February 28, 1961.",
      "type": "background",
      "date": "1961-02-28",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "There was a break in respondent's service on March 1, 1961 (a holiday) as his service was terminated on February 28, 1961 and he was reappointed on March 2, 1961 as a second division clerk industrial.",
      "type": "disputed",
      "date": "1961-03-01",
      "source": "appellant"
    },
    {
      "id": "f5",
      "text": "Respondent continued in the post of second division clerk industrial until July 4, 1963 when the impugned memorandum terminating his service was passed.",
      "type": "material",
      "date": "1963-07-04",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Respondent was throughout working in officiating capacity and was a local candidate appointed by direct recruitment by Government instead of regular recruitment by the Public Service Commission.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "State Government passed Government Order No. GAD 46 SRR dated September 22, 1961 to regularise appointments of local candidates to Class III Direct Recruitment Posts made up to December 31, 1959.",
      "type": "procedural",
      "date": "1961-09-22",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Mysore High Court in Writ Petition No. 2173 of 1964 quashed the termination order dated July 4, 1963 by judgment and order dated October 21, 1965.",
      "type": "procedural",
      "date": "1965-10-21",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Respondent was in service on January 1, 1960 and continued to be in service at the time of regularisation order.",
      "type": "admitted",
      "date": "1960-01-01",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the respondent's service qualifies for regularisation under Government Order dated September 22, 1961 despite the one-day break on March 1, 1961, requiring continuous service from the date of appointment prior to December 31, 1959, provided in service on January 1, 1960 and continuing till date of order.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether regularisation under the Order entitles the respondent to protection under Article 311(2) of the Constitution, treating him as a permanent servant.",
      "framed_by": "respondent"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The order of regularisation does not apply to the respondent as his service was not continuous as required by the said order due to break on March 1, 1961; therefore no question of Article 311 applying and State entitled to terminate service by order dated July 4, 1963.",
      "supporting_facts": [
        "f4",
        "f5"
      ],
      "legal_basis": "Government Order dated September 22, 1961, clause 2 sub-clauses ii and iv"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Though a local candidate appointed from time to time, entitled to have service regularised under the said order; as entitled to regularisation, also entitled to protection of Article 311(2); service could not be terminated by impugned order.",
      "supporting_facts": [
        "f1",
        "f2",
        "f3",
        "f6",
        "f9"
      ],
      "legal_basis": "Government Order dated September 22, 1961; Article 311(2)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Sub-clause ii of clause 2 requires continuity of service from January 1, 1960 until September 22, 1961 as a condition for regularisation; supported by sub-clause iii for leave, pension, increments and sub-clause iv not condoning breaks.",
      "addresses_issue": "i1",
      "key_observation": "High Court erred in holding that only service on termini dates (Jan 1, 1960 and Sept 22, 1961) required, ignoring continuity; such construction unjust to regularly recruited candidates."
    },
    {
      "id": "cr2",
      "text": "Proper interpretation: local candidate must be appointed prior to Dec 31, 1959, in service on Jan 1, 1960 and continue without break till Sept 22, 1961; harmonises all provisions and ensures fairness.",
      "addresses_issue": "i1",
      "key_observation": "High Court's construction cannot be sustained."
    },
    {
      "id": "cr3",
      "text": "Parties assumed regularisation means permanence; Court not deciding that issue as Govt assures no adverse effect to respondent due to one-day break.",
      "addresses_issue": "i2",
      "key_observation": "No interference needed despite differing interpretation."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Government Order dated September 22, 1961 requires continuous service from January 1, 1960 to September 22, 1961 for regularisation of local candidates' services.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "High Court's interpretation of the Order reversed, but appeal dismissed due to Government's assurance not to adversely affect respondent's service.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Mysore Civil Service Rules, 1958",
      "sections": [
        "Rule 8(27A)"
      ],
      "relevance": "Defines local candidate as temporary Government servant not appointed regularly in accordance with Rules of Recruitment."
    },
    {
      "name": "Mysore Government Servants (Seniority) Rules, 1957",
      "sections": [
        "Rule 1A"
      ],
      "relevance": "Rules do not apply to local candidate until regularised; seniority determined from date of regularisation as if appointed regularly."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 311(2)"
      ],
      "relevance": "Protection against termination without following procedure; applicable if service regularised treating as permanent."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal by State dismissed; High Court's order quashing termination upheld due to Government's assurance not to adversely affect respondent's service despite reversing High Court's interpretation of the regularisation order.",
    "relief_granted": "Termination order quashed; respondent's service regularised and treated as permanent per High Court.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"It is clear from the express words used in this sub-clause that continuity of service from January 1, 1960 until the date of the order is a condition prescribed for regularisation.\"",
      "speaker": "court",
      "significance": "Core holding on interpretation of Government Order clause 2(ii)."
    },
    {
      "text": "\"The construction which we are inclined to adopt thus harmonises all the provisions of the Order and besides, results in fairness to all the local candidates.\"",
      "speaker": "court",
      "significance": "Justification for rejecting High Court's interpretation."
    },
    {
      "text": "\"Though the construction which we are inclined to adopt is in support of the stand taken by the State Government, in view of the assurance given by counsel on behalf of the Government... it is not necessary to interfere.\"",
      "speaker": "court",
      "significance": "Reason for dismissing appeal despite agreeing with State on interpretation."
    }
  ],
  "_case_id": "1966_233",
  "_label": 0,
  "_text_length": 14472,
  "_extracted_at": "2026-02-10T19:40:53.769582"
}