{
  "metadata": {
    "case_name": "Inamdars of Wanz and Dindoli v. State (Civil Appeals Nos. 1048-1050 of 1963)",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "Sarkar J.",
      "Mudholkar J.",
      "Bachawat J."
    ],
    "case_number": "Civil Appeals Nos. 1048-1050 of 1963",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellants held shares in the inam village of Wanz and some in that of Dindoli.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Inams granted in 1794 and 1803 respectively; nature depends on sanad or terms of grant.",
      "type": "background",
      "date": "1794-1803",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "High Court held on construction of sanads that inams were grants of villages with exemption from land revenue, conveying soil and rights over trees, water, mines etc.",
      "type": "admitted",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f4",
      "text": "Survey introduced in villages in 1900 under Bombay Land Revenue Code, 1879; amounts payable by tenants to inamdars assessed under the Code.",
      "type": "background",
      "date": "1900",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Under S.216 of Bombay Land Revenue Code, 1879, settlement introduced in both villages at different times; after survey, inferior holders liable to pay land revenue assessed to inamdar instead of variable rent.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Appellants moved Bombay High Court by petitions under Arts. 226 and 227 for quashing decision of Bombay Revenue Tribunal on compensation; High Court disposed by common judgment dated September 1958.",
      "type": "procedural",
      "date": "1958-09",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Inams abolished by Bombay Personal Inams Abolition Act, 1952; all inam villages/lands liable to land revenue under S.5.",
      "type": "material",
      "date": "1952",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Inferior holders: persons claiming through tillers in possession at time of grant; rights to possession intact, inamdars entitled to rents/assessments.",
      "type": "background",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Collector asked appellants to produce evidence for claims on right to forfeit tenancies and reversion; appellants failed to do so, no instance cited.",
      "type": "disputed",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Grantees exempt from land revenue not only for lands held by inferior holders but also lands in own possession or held by persons through them.",
      "type": "admitted",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether appellants entitled to compensation under S.17(1) Bombay Personal Inams Abolition Act, 1952 for loss of assessment payable by inferior holders, or barred by S.17(5).",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Nature of inams: grants of villages with exemption from land revenue (S.2(1)(e)(i)) or grants of land revenue only (S.2(1)(e)(ii)).",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether compensation payable for loss of right to forfeit inferior holders' tenancies and right of reversion.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Inams were grants of land revenue only, not villages exempt from revenue; thus S.17(5) does not apply.",
      "supporting_facts": [
        "f2",
        "f3"
      ],
      "legal_basis": "S.2(1)(e)(ii), S.17(5) Bombay Personal Inams Abolition Act, 1952"
    },
    {
      "id": "pa2",
      "text": "Even if grants of villages exempt from revenue, not claiming on ground that villages made subject to revenue; loss due to inferior holders now paying to Government, not appellants.",
      "supporting_facts": [
        "f5",
        "f7",
        "f10"
      ],
      "legal_basis": "S.5 Bombay Personal Inams Abolition Act, 1952; S.17(1)"
    },
    {
      "id": "pa3",
      "text": "After survey under Bombay Land Revenue Code, payments by tenants were land revenue.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": "Bombay Land Revenue Code, 1879"
    },
    {
      "id": "pa4",
      "text": "Right to recover assessment from inferior holders lost not due to subjection to revenue but directly by Act; entitled under S.17(1).",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": "S.17(1) Bombay Personal Inams Abolition Act, 1952"
    },
    {
      "id": "pa5",
      "text": "Rights of reversion and forfeiture taken away without compensation.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": "S.17(1)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Inams were grants of villages partially exempt from land revenue; bar of S.17(5) applies.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": "S.2(1)(e)(i), S.17(5) Bombay Personal Inams Abolition Act, 1952"
    },
    {
      "id": "ra2",
      "text": "Loss of assessment from inferior holders due to lands made subject to full revenue under S.5; claim barred by S.17(5).",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "S.5, S.17(5)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Sanads convey soil and rights over trees etc.; inams are grants of villages exempt from revenue, not mere land revenue grants.",
      "addresses_issue": "i2",
      "key_observation": "Appellants' contention that pre-grant tenants paid revenue to government idle; no evidence of prior tenants; post-grant payments were rent, not revenue."
    },
    {
      "id": "cr2",
      "text": "Survey fixed assessment but did not alter nature; inamdar remained grantee of soil, exempt from revenue; tenant paid rent/assessment to inamdar.",
      "addresses_issue": "i2",
      "key_observation": "Distinction between grant of village exempt from revenue and grant of revenue only preserved in S.2(1)(e)."
    },
    {
      "id": "cr3",
      "text": "Loss of right to assessment from inferior holders occasioned by lands subjected to revenue under S.5(2)(b); inferior holders now pay to government; claim barred by S.17(5).",
      "addresses_issue": "i1",
      "key_observation": "Inamdar's exemption enabled retention of assessment; subjection to revenue causes loss."
    },
    {
      "id": "cr4",
      "text": "No distinction intended between lands in own possession and those of inferior holders for compensation under S.17(5).",
      "addresses_issue": "i1",
      "key_observation": "Loss nil if right not abolished, as would collect and pay identical amount to government."
    },
    {
      "id": "cr5",
      "text": "No evidence produced for loss of forfeiture/reversion rights; impossible to value.",
      "addresses_issue": "i3",
      "key_observation": "Appellants failed to cite instances or furnish material."
    },
    {
      "id": "cr6",
      "text": "Survey settlement did not confer occupant status on inferior holders or make them pay revenue to government; continued as inferior holders paying to inamdar.",
      "addresses_issue": "i2",
      "key_observation": "Villages remained alienated."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Inams were grants of villages with partial exemption from land revenue under S.2(1)(e)(i); bar of S.17(5) applies to claim for loss of assessment from inferior holders.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "No compensation for loss of reversion/forfeiture rights due to lack of evidence.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Secretary of State for India v. Shantaram Naravan",
      "citation": null,
      "treatment": "referred",
      "relevance": "Grants of inam lands may include right to mines or mineral products, preserved by S.9."
    }
  ],
  "statutes_cited": [
    {
      "name": "Bombay Personal Inams Abolition Act, 1952",
      "sections": [
        "S.2(1)(e)",
        "S.4",
        "S.5",
        "S.7",
        "S.9",
        "S.10",
        "S.17(1)",
        "S.17(5)"
      ],
      "relevance": "Abolished inams, subjected lands to revenue, barred certain compensation claims, provided for others."
    },
    {
      "name": "Bombay Land Revenue Code, 1879",
      "sections": [
        "S.216"
      ],
      "relevance": "Introduced survey settlement; fixed assessments payable by inferior holders to inamdars."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 226",
        "Art. 227",
        "Art. 31(1)"
      ],
      "relevance": "Writ petitions under 226/227; no argument on unconstitutionality raised."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeals against Bombay High Court judgment dismissing writ petitions challenging denial of compensation by Revenue Tribunal dismissed; no compensation awarded for claimed losses.",
    "relief_granted": "None",
    "costs": "No order as to costs"
  },
  "key_quotes": [
    {
      "text": "\"The appellants' contention would in effect wipe out this distinction and cannot therefore be accepted.\"",
      "speaker": "court",
      "significance": "Rejects equation of village grants with revenue grants."
    },
    {
      "text": "\"The loss consequential on the abolition of the right to recover assessment is, therefore, nil.\"",
      "speaker": "court",
      "significance": "Explains why no compensable loss from inferior holders' assessments."
    },
    {
      "text": "\"No compensation can, therefore, be assessed or awarded for the loss of these rights.\"",
      "speaker": "court",
      "significance": "On lack of evidence for reversion/forfeiture claims."
    }
  ],
  "_case_id": "1966_145",
  "_label": 0,
  "_text_length": 23932,
  "_extracted_at": "2026-02-10T19:40:16.615172"
}