{
  "metadata": {
    "case_name": "Biswambar Roy (predecessor of appellants) v. Respondents",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "Shah, J."
    ],
    "case_number": "Civil Appeal No. 891 of 1963",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Biswambar Roy was granted a lease on February 20, 1928, for ten years (1335 B.S. to 1344 B.S.) at an annual rental of Rs. 75/- in respect of a plot of land, part of Dag No. 3615 in the town of Silchar, District Cachar, Assam.",
      "type": "background",
      "date": "1928-02-20",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Biswambar Roy constructed on the land buildings, some for residential use, and others as warehouses.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On expiry of original lease, Biswambar Roy obtained a fresh lease on February 22, 1938, in respect of a part of the land for ten years (Baisakh 1345 B.S. to Chaitra 1354 B.S.) at Rs. 70/- annual rental.",
      "type": "background",
      "date": "1938-02-22",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Respondents purchased the interest of the landlords in the land.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Respondents instituted suit on August 3, 1951, in Court of Sadar Munsiff, Silchar, against Biswambar Roy for decree for vacant possession. Suit decreed by Munsiff.",
      "type": "procedural",
      "date": "1951-08-03",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Biswambar Roy appealed to Subordinate Judge, Silchar. During pendency, Non-agricultural Urban Areas Tenancy Act 12 of 1955 enacted and brought into force.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Subordinate Judge held Biswambar Roy acquired rights of permanent tenant under s.5(1)(a) as he constructed permanent structures for residential or business purposes within prescribed period; reversed trial court decree and dismissed suit.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Appeal to Assam High Court. Deka, J. held no protection under s.5(1)(a) since buildings let out to tenants; expression 'for residential or business purposes' means for tenant's own use.",
      "type": "procedural",
      "date": "1959-06-26",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Letters Patent Appeal: Sinha, C.J. held protection applies as structures conform to residential or business purposes; Mehrotra, J. disagreed, held must be for tenant's own purposes. Judges differed; appeal dismissed under s.98(2) CPC.",
      "type": "procedural",
      "date": "1959-06-26",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Appeal to Supreme Court by special leave against High Court decree.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Biswambar Roy let out the buildings constructed on the land to tenants.",
      "type": "disputed",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether a tenant qualifies for protection under s.5 of Assam Act 12 of 1955 only after building permanent structures on the land of the tenancy if he occupies them for his own residential or business purposes, or if the structures are adapted for residential or business purposes regardless of letting out.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Permanent structures constructed by Biswambar Roy conform to description 'residential or business purposes'; becomes permanent tenant under Act 12 of 1955, not liable to eviction except for non-payment of rent.",
      "supporting_facts": [
        "f2",
        "f3"
      ],
      "legal_basis": "Assam Non-agricultural Urban Areas Tenancy Act 12 of 1955, s.5(1)(a)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Tenant who builds not for own residential or business purposes but for letting out to others does not build permanent structure for residential or business purposes; cannot claim protection under s.5(1)(a). Legislature did not intend to confer protection upon sub-tenants.",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": "Assam Non-agricultural Urban Areas Tenancy Act 12 of 1955, s.5(1)(a), s.3(g)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "S.5 has retrospective operation. Protection under first part of s.5(1)(a) if: (i) entitled to build under contract, (ii) built within 5 years permanent structure, (iii) for residential or business purposes. First two conditions fulfilled; third means structure adapted for such purposes, not necessarily for tenant's own use.",
      "addresses_issue": "i1",
      "key_observation": "Legislature has not enacted qualification of personal use; reading in 'for his own' adds words not in section."
    },
    {
      "id": "cr2",
      "text": "Protection conferred on tenant of land, not buildings. Letting out does not forfeit possession of land or change character of structure. Sub-tenant argument misconceived as tenant of land claims protection.",
      "addresses_issue": "i1",
      "key_observation": "Tenant remains in possession of land even after letting out buildings."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Protection of s.5(1)(a) extends to tenant who constructed permanent structures adapted for residential or business purposes, even if let out; does not forfeit protection.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Refiquennessa v. Lal Bahadur Chetri",
      "citation": "1964 6 S.C.R. 876",
      "treatment": "followed",
      "relevance": "Holds s.5 of Assam Act 12 of 1955 has retrospective operation"
    }
  ],
  "statutes_cited": [
    {
      "name": "Assam Non-agricultural Urban Areas Tenancy Act 12 of 1955",
      "sections": [
        "s.3(g)",
        "s.5(1)(a)"
      ],
      "relevance": "Defines tenant and confers permanent tenancy rights if permanent structures built for residential or business purposes"
    },
    {
      "name": "Code of Civil Procedure",
      "sections": [
        "s.98(2)"
      ],
      "relevance": "Dismissal of Letters Patent Appeal due to difference of opinion among judges"
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed, decree of High Court vacated, plaintiffs' suit dismissed. Appellants entitled to costs in Supreme Court.",
    "relief_granted": "Dismissal of eviction suit; costs to appellants",
    "costs": "Appellants entitled to costs in this Court"
  },
  "key_quotes": [
    {
      "text": "the permanent structure must be one adapted for residential or business purposes. If the structure is not adapted to such purposes, the protection of s.5(1)(a) will not be available.",
      "speaker": "court",
      "significance": "Defines key phrase 'for residential or business purposes' as character of structure, not personal use"
    },
    {
      "text": "By merely letting the premises constructed on the land obtained by him on lease, the tenant does not cease to be in possession of the land.",
      "speaker": "court",
      "significance": "Explains tenant retains possession despite sub-letting"
    }
  ],
  "_case_id": "1966_201",
  "_label": 1,
  "_text_length": 8554,
  "_extracted_at": "2026-02-10T19:40:58.720435"
}