{
  "metadata": {
    "case_name": "Appellants v. Delhi Improvement Trust",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "Shah, J."
    ],
    "case_number": "Civil Appeal No. 1107 of 1963",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "By a notification issued on March 2, 1937 under s. 7 of the Delhi Laws Act, 13 of 1912, the Government of India extended, subject to certain modifications, the United Provinces Town Improvement Act, 8 of 1919, to the territory of Delhi.",
      "type": "background",
      "date": "1937-03-02",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Thereafter set up an Improvement Trust under the Act for that territory.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The Trust prepared an industrial development scheme with the object of relieving congestion by inducing a flow of population from the crowded parts of the town of Delhi to certain other areas.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Under the scheme land in those areas was to be developed and after construction of roads, storm water drains, street-lighting, refuse and sewage disposal works, schools, parks, playgrounds, dispensaries, welfare centres and police-station a part of the land was to be allotted to industrial concerns for construction of industrial buildings and the rest for construction of residential and other buildings.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The scheme was sanctioned under s. 42 of the Act by the government of India, and was duly promulgated.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Thereafter the Trust resolved in June 1942 to make a supplementary scheme as the land covered by the original scheme was inadequate.",
      "type": "procedural",
      "date": "1942-06",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "The Trust had agreed to provide under the original scheme a block of land comprising 268 acres of land to the Delhi Cloth General Mills Co. Ltd. (the Company) on certain terms and conditions embodied in a resolution dated January 9, 1942, but the Trust was able to offer to the Company under the lay-out of the original scheme only 174.84 acres.",
      "type": "material",
      "date": "1942-01-09",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "It was therefore proposed by the Trust to modify the scheme as sanctioned and to provide for acquisition of an additional area of 103.16 acres under a supplementary scheme.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "On July 18, 1942 notice under S. 36 of the Act was published in respect of the supplementary scheme for development of the industrial area, specifying the boundaries of the land in which the scheme was to be worked and inviting objections to the scheme, within one month from the date of publication.",
      "type": "procedural",
      "date": "1942-07-18",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "No objections were raised to the proposed supplementary scheme.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "It was finally approved by resolution dated July 31, 1944, and was notified under S. 42 of the Act on June 28, 1946.",
      "type": "procedural",
      "date": "1944-07-31",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Land acquisition proceedings were then commenced under s. 58 of the Act and awards were made assessing compensation to be paid to the owners of the land for compulsory acquisition.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "In the scheme so notified was included an area of 13 bighas of land belonging to the appellants and that land was acquired.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "On May 3, 1949 the appellants sued the Delhi Improvement Trust for a declaration that the awards were wrong and illegal and did not result in acquisition of the suit property and for an order restraining the Trust from taking possession of their lands under the awards and from interfering in any way with their enjoyment of the lands.",
      "type": "procedural",
      "date": "1949-05-03",
      "source": "court"
    },
    {
      "id": "f15",
      "text": "The Subordinate Judge, Delhi, held that the Act was properly extended to the Delhi territory, that the scheme was valid and the Trust had power to acquire the land, but there was nothing on the record to show that the area in suit was necessary for or was affected by the execution of this scheme, and that the Act does not authorise compulsory acquisition for purposes of recoupment or for allotment to some company. The Subordinate Judge accordingly decreed the suit as claimed by the appellants.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f16",
      "text": "In appeal to the Senior Subordinate Judge with appellate powers the decree passed by the Trial Court was affirmed.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f17",
      "text": "In second appeal to the High Court of Punjab, Falshaw, J., reversed the decree passed by the First Appellate Court.",
      "type": "procedural",
      "date": "1959-09-08",
      "source": "lower_court"
    },
    {
      "id": "f18",
      "text": "Falshaw, J. held that since the original industrial area scheme framed in 1940 was a valid scheme, acquisition of an additional area of land for meeting the requirements of that scheme was a legitimate extension thereof and merely because the Trust had resolved to acquire land for sale to the Company after development, the scheme was not open to challenge.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f19",
      "text": "Falshaw, J. also held that the acquisition not being for the Company, Part VII of the Land Acquisition Act had no application and that the supplementary scheme was not invalid merely because the plan for development was to be worked out not by the Trust directly but by the Company under the general supervision and control of the Trust, and in accordance with the town planning scheme framed under S. 192 of the Punjab Municipal Act.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f20",
      "text": "The decree passed by Falshaw, J., was confirmed by a Division Bench of the High Court.",
      "type": "procedural",
      "date": "1959-09-08",
      "source": "lower_court"
    },
    {
      "id": "f21",
      "text": "With certificate granted by the High Court, this appeal has been preferred.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f22",
      "text": "On June 30, 1942 it was resolved by the Trust to acquire an additional area of 103.16 acres to be sold to the Company.",
      "type": "material",
      "date": "1942-06-30",
      "source": "court"
    },
    {
      "id": "f23",
      "text": "The resolution dated March 29, 1940 clearly indicates that the original scheme was intended to secure growth of an industrial area and thereby to relieve congestion in the over-crowded localities in the town of Delhi.",
      "type": "material",
      "date": "1940-03-29",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether acquisition of land of the appellants under the supplementary scheme was for the purposes of the Act",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether for executing the supplementary scheme the Trust had power to compulsorily acquire land",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether land of the appellants could be acquired only in the manner provided by Part VII of the Land Acquisition Act, 1894",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The notification extending the United Provinces Town Improvement Act, 8 of 1919, was invalid",
      "supporting_facts": [
        "f1"
      ],
      "legal_basis": "Delhi Laws Act, 13 of 1912 s.7"
    },
    {
      "id": "pa2",
      "text": "The Improvement Trust was not lawfully constituted",
      "supporting_facts": [
        "f2"
      ],
      "legal_basis": "United Provinces Town Improvement Act, 1919"
    },
    {
      "id": "pa3",
      "text": "The industrial development schemes were invalid",
      "supporting_facts": [
        "f3",
        "f4",
        "f5",
        "f6",
        "f11"
      ],
      "legal_basis": null
    },
    {
      "id": "pa4",
      "text": "The Trust had no power to acquire lands for the purposes mentioned in the scheme",
      "supporting_facts": [
        "f12",
        "f13"
      ],
      "legal_basis": null
    },
    {
      "id": "pa5",
      "text": "The resolutions and proceedings of the Trust being procedurally defective the scheme was illegal",
      "supporting_facts": [
        "f9",
        "f11"
      ],
      "legal_basis": null
    },
    {
      "id": "pa6",
      "text": "The scheme was framed at the instance of and solely for the benefit of the Company, since the land was intended to be given after acquisition to that Company or to other industrialists for development by them for their own benefit",
      "supporting_facts": [
        "f7",
        "f8",
        "f22"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Since the original industrial area scheme framed in 1940 was a valid scheme, acquisition of an additional area of land for meeting the requirements of that scheme was a legitimate extension thereof",
      "supporting_facts": [
        "f3",
        "f23"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Merely because the Trust had resolved to acquire land for sale to the Company after development, the scheme was not open to challenge",
      "supporting_facts": [
        "f22"
      ],
      "legal_basis": null
    },
    {
      "id": "ra3",
      "text": "The acquisition not being for the Company, Part VII of the Land Acquisition Act had no application",
      "supporting_facts": [
        "f12"
      ],
      "legal_basis": "Land Acquisition Act, 1894 Part VII"
    },
    {
      "id": "ra4",
      "text": "The supplementary scheme was not invalid merely because the plan for development was to be worked out not by the Trust directly but by the Company under the general supervision and control of the Trust, and in accordance with the town planning scheme framed under S. 192 of the Punjab Municipal Act",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": "Punjab Municipal Act s.192"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The original scheme was intended to secure growth of an industrial area and thereby to relieve congestion in the over-crowded localities in the town of Delhi. Such a scheme was primarily a town expansion scheme within the meaning of s. 24(h) read with s. 32.",
      "addresses_issue": "i1",
      "key_observation": "Original scheme valid and unchallenged."
    },
    {
      "id": "cr2",
      "text": "The supplementary scheme was framed for the further progress of the original scheme. The scheme was one for town expansion, and acquisition of land for town expansion, i.e. providing for industrial development and making provision for the residence of employees in the industries and of others, would clearly fall within the terms of S. 24(h) read with S. 32.",
      "addresses_issue": "i1",
      "key_observation": "Original and supplementary schemes regarded as one composite scheme conceived in the interests of industrial development and relief of congestion."
    },
    {
      "id": "cr3",
      "text": "Resort to the provisions of the Act for acquiring land with a view to hand it over to an industrial concern for private gain may not fall within the terms of the Act. But in the circumstances a scheme framed which contemplates acquisition of land for effectuating the object of the original scheme is not open to challenge on the ground that it is a device to acquire land to be disposed of for private gain of an industrialist.",
      "addresses_issue": "i1",
      "key_observation": "Not solely for private benefit."
    },
    {
      "id": "cr4",
      "text": "It is clear from the scheme that the general supervision and control over the execution of the supplementary scheme as over the original scheme was retained by the Trust and the Company was to develop the land subject to control under the Town Planning Scheme.",
      "addresses_issue": "i1",
      "key_observation": "Trust retains control."
    },
    {
      "id": "cr5",
      "text": "In a town expansion scheme under s. 32 read with s. 24(h) of the Act, there is power to acquire land compulsorily. Section 23(a) in terms authorises acquisition by purchase, exchange, or otherwise of any property necessary for or affected by the execution of the scheme.",
      "addresses_issue": "i2",
      "key_observation": "Power conferred by s.23(a), s.55, s.56."
    },
    {
      "id": "cr6",
      "text": "If the land is to be notified for acquisition under the Land Acquisition Act for a Company, the requirements of Part VII of the Land Acquisition Act must undoubtedly be complied with. In this case, land was not to be acquired for the Company it was to be acquired for carrying out the industrial development and town expansion scheme of the Trust, and then it was to be allotted for carrying out the scheme to the Company for development.",
      "addresses_issue": "i3",
      "key_observation": "Part VII not applicable as acquisition for Trust's scheme."
    },
    {
      "id": "cr7",
      "text": "Power to include provision for sale of land comprised in the scheme may competently be conferred under s. 23(g) of the Act and may be exercised under s. 65. Mere inclusion of a power of sale of land acquired under a scheme does therefore not vitiate a scheme.",
      "addresses_issue": "i3",
      "key_observation": "Sale provision valid."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Acquisition of land of the appellants under the supplementary scheme was for the purposes of the Act",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "For executing the supplementary scheme the Trust had power to compulsorily acquire land",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Land of the appellants could be acquired without following Part VII of the Land Acquisition Act, 1894 as it was for the Trust's scheme, not directly for the Company",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "United Provinces Town Improvement Act, 1919",
      "sections": [
        "s.2",
        "s.7",
        "s.23",
        "s.24",
        "s.30",
        "s.32",
        "s.33",
        "s.36",
        "s.38",
        "s.40",
        "s.41",
        "s.42",
        "s.43",
        "s.55",
        "s.56",
        "s.58",
        "s.65",
        "s.72",
        "Schedule"
      ],
      "relevance": "Extended to Delhi; governs constitution of Trust, framing, sanction and execution of improvement schemes including town expansion and development schemes; authorizes compulsory acquisition for schemes."
    },
    {
      "name": "Delhi Laws Act, 1912",
      "sections": [
        "s.7"
      ],
      "relevance": "Notification under s.7 extended U.P. Town Improvement Act to Delhi."
    },
    {
      "name": "Land Acquisition Act, 1894",
      "sections": [
        "Part VII",
        "s.3(ee)",
        "s.4",
        "s.6",
        "s.16",
        "s.17",
        "s.17A"
      ],
      "relevance": "Modified for Trust acquisitions; Part VII applicable only if acquisition directly for a company; awards under s.58 final."
    },
    {
      "name": "Punjab Municipal Act",
      "sections": [
        "s.192"
      ],
      "relevance": "Town planning scheme under which Company to develop under Trust supervision."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court dismissed the appeal, upholding the validity of the acquisition of the appellants' land under the supplementary industrial development scheme framed by the Delhi Improvement Trust as part of a town expansion scheme under the United Provinces Town Improvement Act, 1919, extended to Delhi. The Court held the schemes valid, the Trust empowered to compulsorily acquire the land, and Part VII of the Land Acquisition Act inapplicable.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The original and the supplementary schemes must be regarded as one composite scheme conceived in the interests of industrial development and relief of congestion by inducing a flow of population from the congested areas.",
      "speaker": "court",
      "significance": "Core holding on validity of schemes as integrated town expansion."
    },
    {
      "id": "kq2",
      "text": "In this case, land was not to be acquired for the Company it was to be acquired for carrying out the industrial development and town expansion scheme of the Trust, and then it was to be allotted for carrying out the scheme to the Company for development.",
      "speaker": "court",
      "significance": "Distinguishes from direct company acquisition, avoiding Part VII LAA."
    }
  ],
  "_case_id": "1966_155",
  "_label": 0,
  "_text_length": 24714,
  "_extracted_at": "2026-02-10T19:40:22.050272"
}