{
  "metadata": {
    "case_name": "Mrs. Menezes v. Yusuf Khan",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "Shah, J."
    ],
    "case_number": "Appeal No. 209 of 1964",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant Mrs. Menezes is owner of a house in Bombay; wife of first respondent Yusuf Khan is tenant of part of first floor.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On January 17, 1963, Robert, servant of appellant, called wife of first respondent a thief and Halkat.",
      "type": "material",
      "date": "1963-01-17",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On January 18, 1963, first respondent slapped face of Robert; heated exchange of abusive words between first respondent and appellant's husband; first respondent threw file of papers at appellant's husband, which missed but hit elbow of appellant causing scratch.",
      "type": "material",
      "date": "1963-01-18",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Appellant lodged information at Bandra police station complaining first respondent committed house trespass to commit offence punishable with imprisonment, threw shoe at her, slapped Robert, caused bleeding incised wound on forearm.",
      "type": "procedural",
      "date": "1963-01-18",
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "Appellant's version was gross exaggeration; Sub-Inspector found mere scratch on elbow.",
      "type": "disputed",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Appellant and Robert declined public hospital; examined by private practitioner who certified bleeding incised wound skin deep 1\" length on right forearm for appellant, swelling 1.5\" diameter roundish soft tender no bruises for Robert.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "Case transferred from Presidency Magistrate Bandra to Presidency Magistrate VI Court Mazagaon Bombay, entrusted to special prosecutor.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Trial Magistrate held story of trespass false, made to make cognizable offence; story of hurling shoe disbelieved; convicted first respondent under S.323 IPC for simple injuries to Robert and appellant, fined Rs.10 on each of two counts.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Revisional application to Bombay High Court in Criminal Revision Application No. 913 of 1963; appellant impleaded due to compounding negotiations.",
      "type": "procedural",
      "date": "1964-01-31",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "High Court viewed appellant grossly exaggerated story; medical evidence not inspiring confidence; appellant's husband used provocative insults; in excitement respondent hurled file missing husband scratching appellant; injuries trivial, harm so slight no person of ordinary sense and temper would complain; set aside conviction and acquitted.",
      "type": "procedural",
      "date": "1964-01-31",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Appellant's husband had beaten first respondent's child for rude behaviour; Robert rude to respondent's wife and unrepentant.",
      "type": "background",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether High Court had power to apply S.95 IPC when bodily hurt was intentionally caused.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether harm caused was so slight that no person of ordinary sense and temper would complain thereof under S.95 IPC.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "High Court had no power to act under S.95 IPC since bodily hurt intentionally caused; S.95 applies only where no physical injury actually caused to complainant.",
      "supporting_facts": [
        "f3",
        "f4",
        "f6"
      ],
      "legal_basis": "S.95 IPC"
    },
    {
      "id": "pa2",
      "text": "Harm in S.95 includes financial loss, reputation, mental worry, apprehension, but not physical injury actually caused.",
      "supporting_facts": [],
      "legal_basis": "S.95 IPC"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Appellant grossly exaggerated; medical evidence unreliable; provocative abuses by appellant's husband and servant; injuries trivial.",
      "supporting_facts": [
        "f2",
        "f3",
        "f5",
        "f11"
      ],
      "legal_basis": "S.95 IPC"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "S.95 IPC applies if harm caused, intended or known likely, so slight no ordinary person complains; object to exclude trivial cases within letter but not spirit of law.",
      "addresses_issue": "i1",
      "key_observation": "Harm includes physical injury; plain terms of S.95 not restricted."
    },
    {
      "id": "cr2",
      "text": "Harm in IPC wide meaning including physical injury (as in ss.81,87 etc.); no warrant for restriction in S.95.",
      "addresses_issue": "i1",
      "key_observation": "Expression harm has wide connotation inclusive of physical injury."
    },
    {
      "id": "cr3",
      "text": "Triviality depends on injury nature, parties' position, intention, circumstances; no absolute standard; here provocative context, mere scratch and slap trivial.",
      "addresses_issue": "i2",
      "key_observation": "High Court view justified; no interference under Art.136."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "S.95 IPC applies to acts causing slight physical harm which ordinary person would not complain of.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Harm caused trivial given circumstances; acquittal proper.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "S.323",
        "S.95",
        "S.81",
        "S.87",
        "S.88",
        "S.89",
        "S.91",
        "S.92",
        "S.100",
        "S.104",
        "S.106",
        "S.93",
        "S.415",
        "S.469",
        "S.499"
      ],
      "relevance": "S.323 for conviction of simple hurt; S.95 general exception for trivial harm applied to acquit; others illustrate meaning of harm."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court maintained High Court order setting aside conviction under S.323 IPC and acquitting first respondent, holding harm trivial under S.95 IPC.",
    "relief_granted": "Acquittal upheld",
    "costs": "Rs.1,500 deposited by appellant as costs of respondents; State of Maharashtra did not appear."
  },
  "key_quotes": [
    {
      "text": "\"Nothing is an offence by reason that it causes, or that it is intended to cause, or that it is known to be likely to cause, any harm, if that harm is so slight that no person of ordinary sense and temper would complain of such harm.\"",
      "speaker": "court",
      "significance": "Verbatim text of S.95 IPC central to decision."
    },
    {
      "text": "\"The section applies if the act causes harm or is intended to cause harm or is known to be likely to cause harm, provided the harm is so slight that no person of ordinary sense and temper would complain of such harm.\"",
      "speaker": "court",
      "significance": "Court's interpretation confirming S.95 covers intentional physical harm if trivial."
    },
    {
      "text": "\"Whether an act which amounts to an offence is trivial would undoubtedly depend upon the nature of the injury, the position of the parties, the knowledge or intention with which the offending act is done, and other related circumstances.\"",
      "speaker": "court",
      "significance": "Test for applying S.95 to trivial offences."
    }
  ],
  "_case_id": "1966_21",
  "_label": 0,
  "_text_length": 10025,
  "_extracted_at": "2026-02-10T19:38:47.960455"
}