{
  "metadata": {
    "case_name": "Appellant-company v. Commissioner of Income-tax",
    "case_year": null,
    "court": "Supreme Court of India",
    "judges": [
      "Ramaswami, J."
    ],
    "case_number": null,
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The appellant-company is a public limited company which is managed by a firm of managing agents known as Jaipuria Brothers Ltd., another public limited company.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Under article 135 of the articles of association of the appellant-company the managing agents were entrusted with general management of the affairs of the company. The remuneration for such management was an office allowance at Rs. 5,000 per month plus a commission of 10 per cent. of the net profits of the company. The total remuneration for the managing agents for the relevant accounting year was computed at Rs. 11,70,899.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "For the relevant accounting year there were five directors of the appellant-company. Two of these directors were Sri Gajadhar Jaipuria and Sri Mungturam Jaipuria. These two directors were the nominees of the managing agents and were also the directors of Jaipuria Brothers Ltd., the managing agents.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Under article 118 of the articles of association of the appellant-company, the five directors were entitled during the accounting year to directors fees at the rate of Rs. 100 per month to each director besides traveling expenses for attending the meetings. For the accounting period a sum of Rs. 6,900 was paid on account of such directors fees to the five directors.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "On July 26, 1948, the directors of the appellant-company passed a resolution recommending to the shareholders of the company to amend article 118 by providing that the directors should be paid a commission at the rate of 1 per cent. of the net profits of the company after providing for necessary expenses and charges, but before deducting the amount of commission itself in addition to their fees at the rate of Rs. 100 per month for each one of the directors.",
      "type": "procedural",
      "date": "1948-07-26",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "This recommendation was adopted at an extraordinary general meeting of the shareholders of the company held on August 26, 1948, by a special resolution by which article 118 was amended to make provision for payment of commission also in addition to fees to the directors.",
      "type": "procedural",
      "date": "1948-08-26",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "By reason of the amendment of article the directors became entitled to and were paid an additional remuneration amounting to Rs. 1,11,000 for the accounting year ending December 31, 1948. Out of this amount each of the directors became entitled to a sum of Rs. 22,218.",
      "type": "material",
      "date": "1948-12-31",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Before the Income-tax Officer the appellant-company claimed the said remuneration of Rs. 1,11,000 paid to the directors as a deduction under section 10(2)(xv) of the Income-tax Act on the ground that the said sum had been laid out or expended wholly and exclusively for the purposes of the companys business.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "The Income-tax Officer disallowed the claim of the appellant-company on the ground that the directors had not rendered any extra service so as to entitle them to the additional remuneration.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "The appellant-company preferred an appeal to the Appellate Assistant Commissioner but the appeal was dismissed.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "The appellant-company took the matter in further appeal to the Appellate Tribunal which affirmed the view of the income-tax authorities that the amount was not admissible as a deduction under section 10(2)(xv) of the Income-tax Act.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Under section 66(2) of the Income-tax Act the Appellate Tribunal referred the following question of law for the opinion of the High Court: Whether the sum of Rs. 1,11,090 paid as remuneration to the five directors of the assessee-company during the relevant previous year was an expenditure incurred wholly and exclusively for the purpose of the business under section 10(2)(xv) of the Income-tax Act?",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "By its order dated April 23, 1962, the High Court answered this question of law in favour of the income-tax department and against the assessee.",
      "type": "procedural",
      "date": "1962-04-23",
      "source": "court"
    },
    {
      "id": "f14",
      "text": "This appeal is brought, by special leave, against the order of the High Court dated April 23, 1962, in the income-tax reference.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f15",
      "text": "The finding of the Appellate Tribunal is that the payment of the commission was made to the directors for extra-commercial business.",
      "type": "disputed",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f16",
      "text": "The directors did not render any special service in the accounting year which justified the payment of additional remuneration to them.",
      "type": "disputed",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f17",
      "text": "The work of the appellant-company was done substantially by the firm of managing agents known as Jaipuria Brothers Ltd. and very little work was done by the directors.",
      "type": "disputed",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f18",
      "text": "In the past the directors were paid only the directors fee at the rate of Rs. 100 per month and this was not considered by the directors to be inadequate for discharging their responsibility.",
      "type": "background",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f19",
      "text": "In the accounting year the gross profits of the company had increased by about 30 lakhs rupees, but the Appellate Tribunal found that the increase was due to the control of cloth having been lifted on January 23, 1948, in the first month of the commencement of the accounting period, and due to cloth remaining uncontrolled till August 2, 1948, the company made abnormal profits.",
      "type": "disputed",
      "date": "1948-01-23",
      "source": "lower_court"
    },
    {
      "id": "f20",
      "text": "Thus the increase in profits was not due to any special exertion of the directors which alone could justify the payment of any extra remuneration.",
      "type": "disputed",
      "date": null,
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the sum of Rs. 1,11,090 paid as remuneration to the five directors of the assessee-company during the relevant previous year was an expenditure incurred wholly and exclusively for the purpose of the business under section 10(2)(xv) of the Income-tax Act?",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The amount of Rs. 1,11,090 paid to the directors was spent wholly and exclusively for the purpose of the company and was therefore properly claimed as a deduction under section 10(2)(xv) of the Income-tax Act.",
      "supporting_facts": [
        "f6",
        "f7"
      ],
      "legal_basis": "section 10(2)(xv) of the Income-tax Act"
    },
    {
      "id": "pa2",
      "text": "The amendment to article 118 was adopted by a special resolution of the shareholders and the amendment was made in accordance with law and the payment cannot be called in question in income-tax proceedings.",
      "supporting_facts": [
        "f5",
        "f6"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "As soon as an assessee has established two facts, viz., the existence of an agreement between the employer and the employee and the fact of actual payment, no discretion is left to the Income-tax Officer except to hold that the payment was made wholly and exclusively for the purposes of the business.",
      "supporting_facts": [
        "f6",
        "f7"
      ],
      "legal_basis": "section 10(2)(xv) of the Income-tax Act"
    },
    {
      "id": "pa4",
      "text": "The payment of remuneration to the directors was in accordance with the practice of about three companies mentioned in paragraph 19 of the special leave application.",
      "supporting_facts": [],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The directors had not rendered any extra service so as to entitle them to the additional remuneration.",
      "supporting_facts": [
        "f16",
        "f17",
        "f20"
      ],
      "legal_basis": "section 10(2)(xv) of the Income-tax Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "It is true that as between the directors and the company the resolution had a binding effect and the payment had to be legally made. But it is for the Income-tax Officer to decide whether the amount so paid to the directors was wholly and exclusively spent for the purpose of the business within the meaning of section 10(2)(xv) of the Income-tax Act.",
      "addresses_issue": "i1",
      "key_observation": "Legal bindingness between company and directors does not preclude scrutiny by ITO under section 10(2)(xv)"
    },
    {
      "id": "cr2",
      "text": "It is an erroneous proposition to contend that as soon as an assessee has established two facts, viz., the existence of an agreement between the employer and the employee and the fact of actual payment, no discretion is left to the Income-tax Officer except to hold that the payment was made wholly and exclusively for the purposes of the business.",
      "addresses_issue": "i1",
      "key_observation": "ITO must consider all relevant factors to determine if expenditure is wholly and exclusively for business"
    },
    {
      "id": "cr3",
      "text": "The question as to whether an amount claimed as expenditure was laid out or expended wholly and exclusively for the purpose of such business, profession or vocation has to be decided on the facts and in the light of the circumstances of each case.",
      "addresses_issue": "i1",
      "key_observation": "Decision on admissibility is based on facts of each case"
    },
    {
      "id": "cr4",
      "text": "The final conclusion on the admissibility of an allowance claimed is one of law, as observed in Eastern Investments Ltd. v. Commissioner of Income-tax.",
      "addresses_issue": "i1",
      "key_observation": "Final conclusion is question of law"
    },
    {
      "id": "cr5",
      "text": "It is manifest that the Income-tax Officer is entitled to examine the circumstances of each case to determine for himself whether the remuneration paid to the employee or any portion thereof was properly deducted under section 10(2)(xv) of the Income-tax Act.",
      "addresses_issue": "i1",
      "key_observation": "ITO has authority to examine circumstances"
    },
    {
      "id": "cr6",
      "text": "The view expressed is supported by Aspro Limited v. Commissioner of Taxes (Judicial Committee) and Jethabhai Hirji and Co. v. Commissioner of Income-tax (Bombay High Court).",
      "addresses_issue": "i1",
      "key_observation": "Consistent with precedents"
    },
    {
      "id": "cr7",
      "text": "The finding of the Appellate Tribunal that the directors did not render any special service, work was done by managing agents, past fees were adequate, and profit increase due to decontrol of cloth not directors' exertion.",
      "addresses_issue": "i1",
      "key_observation": "Tribunal findings upheld"
    },
    {
      "id": "cr8",
      "text": "No evidence produced of practice in other companies; solitary example of Courepore Co. Ltd. insufficient.",
      "addresses_issue": "i1",
      "key_observation": "No established practice"
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The sum of Rs. 1,11,090 paid as remuneration to the directors was not an expenditure incurred wholly and exclusively for the purpose of the business under section 10(2)(xv) of the Income-tax Act.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Eastern Investments Ltd. v. Commissioner of Income-tax",
      "citation": null,
      "treatment": "followed",
      "relevance": "Final conclusion on admissibility of allowance is one of law"
    },
    {
      "case_name": "Aspro Limited v. Commissioner of Taxes",
      "citation": null,
      "treatment": "followed",
      "relevance": "ITO entitled to refuse deduction if no evidence that payment exclusively incurred in production of assessable income"
    },
    {
      "case_name": "Jethabhai Hirji and Co. v. Commissioner of Income-tax",
      "citation": null,
      "treatment": "followed",
      "relevance": "Tribunal right in disallowing commission payment under section 10(2)(xv)"
    }
  ],
  "statutes_cited": [
    {
      "name": "Income-tax Act",
      "sections": [
        "10(2)(xv)",
        "66(2)"
      ],
      "relevance": "Deduction for expenditure wholly and exclusively for business; reference of question of law"
    },
    {
      "name": "Articles of Association of the appellant-company",
      "sections": [
        "135",
        "118"
      ],
      "relevance": "Governed management by agents and directors' remuneration"
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal by special leave against the High Court order dated April 23, 1962, is dismissed. The High Court's view that the additional remuneration to directors is not deductible under section 10(2)(xv) is upheld, as the Tribunal's findings on lack of extra service and other circumstances are not vitiated in law.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "But it is for the Income-tax Officer to decide whether the amount so paid to the directors was wholly and exclusively spent for the purpose of the business within the meaning of section 10(2)(xv) of the Income-tax Act.",
      "speaker": "court",
      "significance": "Establishes ITO's authority to scrutinize payments despite legal agreements"
    },
    {
      "text": "It is an erroneous proposition to contend that as soon as an assessee has established two facts, viz.,the existence of an agreement between the employer and the employee and the fact of actual payment, no discretion is left to the Income-tax Officer",
      "speaker": "court",
      "significance": "Rejects petitioner's main argument on sufficiency of agreement and payment"
    },
    {
      "text": "the question as to whether an amount claimed as expenditure was laid out or expended wholly and exclusively for the purpose of such business, profession or vocation has to be decided on the facts and in the light of the circumstances of each case.",
      "speaker": "court",
      "significance": "Sets test for deductibility under section 10(2)(xv)"
    }
  ],
  "_case_id": "1966_256",
  "_label": 0,
  "_text_length": 10885,
  "_extracted_at": "2026-02-10T19:41:50.309087"
}