{
  "metadata": {
    "case_name": "Messrs. Nandram Hunatram v. Union of India",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "Hidayatullah, J."
    ],
    "case_number": "Civil Appeal No. 257 of 1964",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant Messrs. Nandram Hunatram, a firm consisting of four partners including Kishan Lal Aggarwal, held a mining lease for Handidhua Colliery for 30 years commencing April 6, 1959.",
      "type": "background",
      "date": "1959-04-06",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Under Part VII Clause 3 of the lease, lessee undertook to commence mining within one year and continue work without voluntary intermission in skilful and workman-like manner.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Firm appointed M.L. Goel as Manager and Kishan Lal Aggarwal as occupier.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Partners fell out, none willing to spend money, work deteriorated and stopped in May 1962.",
      "type": "material",
      "date": "1962-05",
      "source": "admitted"
    },
    {
      "id": "f5",
      "text": "Goel reported to State Government that wages unpaid for weeks, work stopped, essential services not maintained.",
      "type": "material",
      "date": "1962-05-early",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Goel warned firm and Government of flooding risk if essential services stopped.",
      "type": "material",
      "date": "1962-05-first week",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "On May 9, 1962, essential services stopped due to unpaid wages for several weeks; colliery began flooding.",
      "type": "material",
      "date": "1962-05-09",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Government intervened, promised wages to essential workmen, saved colliery.",
      "type": "material",
      "date": "1962-05-09",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "On May 14, 1962, Kishan Lal Aggarwal informed Chief Inspector of Mines he was restrained by partners from paying running expenses, resigned as occupier.",
      "type": "material",
      "date": "1962-05-14",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Goel resigned.",
      "type": "material",
      "date": "1962-05",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "On May 16, 1962, Sub-divisional Officer, Talchar informed Government of alarming situation requiring action.",
      "type": "material",
      "date": "1962-05-16",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "On May 19, 1962, Government issued notice to firm to remedy defects within 60 days, else take over colliery.",
      "type": "procedural",
      "date": "1962-05-19",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Firm did nothing to remove defects, no request for extension; Government took over colliery and terminated lease.",
      "type": "material",
      "date": "1962-after 05-19",
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Firm filed application for revision before Central Government under Rule 54 of Mineral Concession Rules 1960.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f15",
      "text": "Central Government obtained comments from State Government, invited firm's representations, rejected revision on February 19, 1963.",
      "type": "procedural",
      "date": "1963-02-19",
      "source": "court"
    },
    {
      "id": "f16",
      "text": "Admitted: partners quarrelling, work stopped, wages unpaid for 5 weeks before May 19, 1962 notice, essential services stopped, colliery nearly flooded but for Government action.",
      "type": "admitted",
      "date": "1962-05",
      "source": "petitioner"
    },
    {
      "id": "f17",
      "text": "Wages paid in full on July 17, 1962.",
      "type": "disputed",
      "date": "1962-07-17",
      "source": "petitioner"
    },
    {
      "id": "f18",
      "text": "Firm's performance: April 1962 less than 2,000 tons raised, nothing in May, June, July.",
      "type": "material",
      "date": "1962-04 to 07",
      "source": "court"
    },
    {
      "id": "f19",
      "text": "Telegrams and letters from Workers Association complaining of unpaid wages.",
      "type": "material",
      "date": "1962",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether there was breach of lease covenants and Mineral Concession Rules by voluntary intermission in working the colliery, entitling State Government to terminate lease.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether Central Government's order rejecting revision was invalid for lack of hearing and reasons.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Action by State Government arbitrary and high-handed.",
      "supporting_facts": [
        "f17"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Firm had plans to raise 240,000 tons of coal per year.",
      "supporting_facts": [
        "f18"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Central Government did not give hearing or reasons in dismissing revision.",
      "supporting_facts": [
        "f15"
      ],
      "legal_basis": "Harinagar Sugar Mills Ltd. v. Shyam Sundar Jhunjhunwala; Madhya Pradesh Industries Ltd. v. Union of India; Aluminium Corporation of India Ltd. v. Union of India"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Breach of lease covenants (Part VII Clause 3) and Rules 41 (1949), 27(5), 27(1)(f) (1960) by stopping work, non-payment of wages, endangering colliery.",
      "supporting_facts": [
        "f4",
        "f5",
        "f7",
        "f9",
        "f11",
        "f16",
        "f19"
      ],
      "legal_basis": "Mineral Concession Rules 1960 Rule 27(5); lease covenants"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Clear breach by lessee: stopped working colliery, non-payment led to stoppage, flooding risk; action necessary to save colliery.",
      "addresses_issue": "i1",
      "key_observation": "Even if firm did not order stoppage, non-payment caused it; voluntary intermission occurred."
    },
    {
      "id": "cr2",
      "text": "Later wage payment does not undo prior intermission; performance dismal.",
      "addresses_issue": "i1",
      "key_observation": "Firm guilty of voluntary intermission and neglect endangering colliery."
    },
    {
      "id": "cr3",
      "text": "Central Government followed procedure: obtained State comments, heard firm's representations; facts clear, no detailed reasons needed as affirming justified State action.",
      "addresses_issue": "i2",
      "key_observation": "Unlike cited cases, no dispute on facts or secret reports; order sustainable."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "State Government entitled to terminate lease under lease terms and Mineral Concession Rules due to breach.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Central Government's order rejecting revision valid; procedure followed, reasons not required in circumstances.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Harinagar Sugar Mills Ltd. v. Shyam Sundar Jhunjhunwala",
      "citation": "1962 2 S.C.R. 339",
      "treatment": "followed",
      "relevance": "Government should give reasons in quasi-judicial functions like revisions."
    },
    {
      "case_name": "Madhya Pradesh Industries Ltd. v. Union of India",
      "citation": "1966 1 S.C.R. 466",
      "treatment": "followed",
      "relevance": "Order affirming earlier decision need not repeat reasons."
    },
    {
      "case_name": "Aluminium Corporation of India Ltd. v. Union of India",
      "citation": "C.A. No. 635 of 1964 decided on September 23, 1965",
      "treatment": "distinguished",
      "relevance": "Decision based on secret report without reasons; unlike here where facts clear."
    }
  ],
  "statutes_cited": [
    {
      "name": "Mineral Concession Rules, 1960",
      "sections": [
        "Rule 54",
        "Rule 27(5)",
        "Rule 27(1)(f)"
      ],
      "relevance": "Revision application; power to require remedy of breach within 60 days and terminate lease; conduct operations skilfully."
    },
    {
      "name": "Mineral Concession Rules, 1949",
      "sections": [
        "Rule 41 (clauses i to x)"
      ],
      "relevance": "Power to require removal of breach within 60 days and determine lease."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal against Central Government's rejection of revision dismissed; State Government's termination of lease upheld as justified due to breach and neglect.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "It is obvious that there was a breach by the lessee of the covenants and the Mineral Concession Rules when the firm stopped working the colliery.",
      "speaker": "court",
      "significance": "Core finding on breach justifying termination."
    },
    {
      "text": "but for the timely action of the Government, the colliery would have been flooded in a matter of hours and probably rendered unworkable till dewatered.",
      "speaker": "court",
      "significance": "Highlights urgency and necessity of government intervention."
    },
    {
      "text": "a detailed order was really not required because after all the Central Government was merely approving of the action taken by the State Government, which stood completely vindicated.",
      "speaker": "court",
      "significance": "Justifies lack of detailed reasons in Central Government's order."
    }
  ],
  "_case_id": "1966_96",
  "_label": 0,
  "_text_length": 9855,
  "_extracted_at": "2026-02-10T19:39:36.367045"
}