{
  "metadata": {
    "case_name": "Appellant v. Pritam Singh",
    "case_year": 1965,
    "court": "Supreme Court of India",
    "judges": [
      "Wanchoo, J."
    ],
    "case_number": "Civil Appeal No. 459 of 1965",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "In the general election held in 1962 for House of the People, the appellant was elected from the Sangrur parliamentary constituency.",
      "type": "background",
      "date": "1962",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Pritam Singh, respondent, was a contesting candidate but lost the election and filed an election petition challenging the appellant's election on several grounds, including improper rejection of Wazir Singh's nomination papers.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f3",
      "text": "Wazir Singh filed three nomination papers; one attached with a copy of part of the electoral roll (Part IV of Simla legislative assembly electoral roll).",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Returning officer rejected the first nomination paper (with copy) on grounds that name of parliamentary constituency, village, assembly constituency, part number of candidate not mentioned, and name of proposer's parliamentary constituency not given.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Returning officer rejected the other two nomination papers because no copy of electoral roll or relevant part or certified copy filed with them, and refused to look at the copy from the first rejected paper.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The copy filed was incomplete: not complete copy of Part IV, missing pages 19 to 22 and page 25 (which contained second list of amendments).",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Election Tribunal held that even if copy could be looked into, it was not complete, so no compliance with s.33(5), rejection justified notwithstanding s.36(4).",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Punjab High Court (judgment dated July 14, 1964, Bishan Narain, J.) held returning officer wrong in not looking at copy from first paper; copy of assembly constituency sufficient for parliamentary; incomplete copy sufficient for s.33(5); one nomination improperly rejected, materially affected result, set aside election.",
      "type": "procedural",
      "date": "1964-07-14",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "High Court refused certificate; appellant obtained special leave from Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether a copy under s.33(5) must be produced with every nomination paper separately, or one copy with one paper suffices and returning officer can look at it for others.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the copy must be of the parliamentary constituency electoral roll, or copy of assembly constituency roll included therein suffices.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether production of an incomplete copy of the relevant part of the electoral roll complies with s.33(5), or is a substantial defect under s.36(4) justifying rejection under s.36(2)(b).",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Necessary copy under s.33(5) must be produced with every nomination paper separately; not enough if filed with only one when multiple filed.",
      "supporting_facts": [
        "f3",
        "f5"
      ],
      "legal_basis": "s.33(5), proviso to s.33(6) of Representation of the People Act, 1950"
    },
    {
      "id": "pa2",
      "text": "Copy produced was of assembly constituency, not parliamentary House of the People constituency.",
      "supporting_facts": [
        "f3",
        "f6"
      ],
      "legal_basis": "s.33(5), s.4(d) of the Act"
    },
    {
      "id": "pa3",
      "text": "Copy was not complete (missing pages), no compliance with s.33(5); defect substantial, s.36(4) not applicable; rejection proper under s.36(2)(b).",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": "s.33(5), s.36(2)(b), s.36(4) of the Act; Registration of Electors Rules, 1960"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Returning officer wrong in not looking into copy filed with first nomination paper for scrutiny of other two papers; merely because first rejected, not precluded from using the copy.",
      "supporting_facts": [
        "f3",
        "f4",
        "f5"
      ],
      "legal_basis": "s.33(5) of the Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "s.33(5) does not require copy with each nomination paper; one copy suffices, can be shown repeatedly or used from one paper even if rejected; purpose served if RO can check qualification.",
      "addresses_issue": "i1",
      "key_observation": "No sense in requiring multiple copies; RO can look at copy from rejected paper for others."
    },
    {
      "id": "cr2",
      "text": "Electoral roll for parliamentary constituency consists of rolls of comprised assembly constituencies (s.13D); copy of assembly roll sufficient to show elector status in parliamentary.",
      "addresses_issue": "i2",
      "key_observation": "Parliamentary roll made by stitching assembly rolls."
    },
    {
      "id": "cr3",
      "text": "s.33(5) requires complete copy of relevant part (as per r.5 Rules); incomplete copy (missing pages with amendments) is substantial defect as RO cannot verify qualification (possible deletion in later amendments); s.36(4) inapplicable.",
      "addresses_issue": "i3",
      "key_observation": "Candidate's name in first amendment but second amendment (not produced) might delete it; only complete copy allows proper check."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "One copy under s.33(5) with one nomination paper suffices; RO can use it for others even if first rejected.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Copy of assembly constituency roll suffices for parliamentary constituency qualification under s.33(5).",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Incomplete copy of relevant part is substantial defect under s.36(2)(b); justifies rejection notwithstanding s.36(4); invalidates all nomination papers.",
      "resolves_issue": "i3",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Representation of the People Act, 1950",
      "sections": [
        "s.33(5)",
        "s.36(2)(b)",
        "s.36(4)",
        "s.32",
        "s.4(d)",
        "s.2(e)",
        "s.13D",
        "proviso to s.33(6)"
      ],
      "relevance": "Governs nomination papers, qualifications, scrutiny, defects; requires copy of electoral roll or relevant part to verify elector status."
    },
    {
      "name": "Registration of Electors Rules, 1960",
      "sections": [
        "r.5",
        "r.10",
        "r.11",
        "r.12",
        "r.18",
        "r.19",
        "r.20",
        "r.22",
        "r.23"
      ],
      "relevance": "Defines parts of roll; process of preparation, amendments, publication; complete copy must include all amendments for verification."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; nomination papers of Wazir Singh rightly rejected due to incomplete copy under s.33(5), a substantial defect; election petition dismissed.",
    "relief_granted": "Election of appellant upheld",
    "costs": "With costs"
  },
  "key_quotes": [
    {
      "text": "\"The purpose of filing the copy is to ensure that the returning officer is able to check whether the candidate concerned is qualified or not and that purpose would be effectively served even if only one copy is filed with one nomination paper.\"",
      "speaker": "court",
      "significance": "Rejects need for copy with each paper."
    },
    {
      "text": "\"If the copy is not a complete copy it is possible that a name which may have been included in the draft or in the first amendment may have been excluded in the second amendment.\"",
      "speaker": "court",
      "significance": "Explains why incomplete copy is substantial defect."
    },
    {
      "text": "\"Non-production of a complete copy of the relevant part in our opinion is a defect of a substantial character for it makes it impossible for the returning officer to decide whether the candidate is qualified or not.\"",
      "speaker": "court",
      "significance": "Core holding on s.36(4) inapplicability."
    }
  ],
  "_case_id": "1966_307",
  "_label": 1,
  "_text_length": 24172,
  "_extracted_at": "2026-02-10T19:42:13.733148"
}