{
  "metadata": {
    "case_name": "State of Mysore v. Respondent (Dealer at Bijapur)",
    "case_year": 1965,
    "court": "Supreme Court of India",
    "judges": [
      "Mudholkar, J."
    ],
    "case_number": "Criminal Appeals Nos. 150-152 of 1965",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The respondent was at the relevant time a dealer at Bijapur in groundnuts, cotton seed and other commodities and was registered as a dealer under the Mysore Sales Tax Act, 1957.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "For the period between November 12, 1958 and October 31, 1959 he was assessed to sales tax amounting to Rs. 9,864-31 ps. by the Commercial Tax Officer, Bijapur in his order dated December 4, 1963.",
      "type": "material",
      "date": "1963-12-04",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On January 3, 1964 the Commercial Tax Officer served on him a notice of demand requiring him to pay the tax assessed on him within 21 days.",
      "type": "procedural",
      "date": "1964-01-03",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "He was similarly assessed to pay tax for two subsequent periods by two separate orders passed by the Commercial Tax Officer. Two separate notices of demand were served on him requiring him to pay the tax assessed within 21 days.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "It is common ground that the respondent did not comply with any of the three notices.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Three separate complaints were preferred against him by the Commercial Tax Officer before the Judicial Magistrate, First Class, second court, Bijapur for offences punishable under s. 29(1)(d) of the Act.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "The respondent had preferred appeals against each of the three orders of assessment under sub-s. (1) of s. 20 of the Act.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "He did not, however, pay the tax assessed against him or any portion thereof as contemplated in the second proviso of sub-s. (1) of s. 20 nor did he seek or obtain from the appellate authority any order under the proviso to sub-s. (5) of s. 20.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "The learned Magistrate held that since the respondent had preferred appeals against the orders of assessment and those appeals were still pending when the complaints were made before him the respondent was not liable for offences under s. 29(1)(d). On this ground the learned Magistrate acquitted the respondent in all the three cases.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Appeals preferred by the State of Mysore against the orders of acquittal passed in favour of the respondent were rejected by the Mysore High Court on the ground that as the State could avail itself of other remedies under the Act for enforcing the payment of tax levied on the respondent it did not think it fit to exercise its discretion under s. 421(1) of the Code of Criminal Procedure and entertain the appeals.",
      "type": "procedural",
      "date": "1965-03-17",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "When special leave was granted an undertaking was given by the State that irrespective of the result of the appeal the respondent would not be prosecuted.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the respondent is liable for offences under s. 29(1)(d) of the Mysore Sales Tax Act, 1957 despite having preferred appeals against the assessment orders which were pending, without paying the tax or obtaining stay orders.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the proviso to sub-s. (3) of s. 13 bars proceedings under s. 29(1)(d) unless the assessee fails to comply with an order by the appellate authority.",
      "framed_by": "respondent"
    },
    {
      "id": "i3",
      "text": "Whether pendency of appeal suspends the liability to pay tax.",
      "framed_by": "respondent"
    },
    {
      "id": "i4",
      "text": "Whether there was wilful default by the respondent in paying the tax.",
      "framed_by": "respondent"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The acquittal of the respondent was unwarranted as he failed to pay tax despite notices of demand, making him liable under s. 29(1)(d).",
      "supporting_facts": [
        "f2",
        "f3",
        "f4",
        "f5"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Unless the requirements of the proviso to sub-s. (3) of s. 13 are satisfied he is not liable to be proceeded against under s. 29(1)(d), and no order has been made by the appellate authority dealing with payment.",
      "supporting_facts": [
        "f7",
        "f8"
      ],
      "legal_basis": "Proviso to s.13(3), Mysore Sales Tax Act"
    },
    {
      "id": "ra2",
      "text": "In view of the fact that an appeal has been preferred the liability of the assessee to pay the tax must be deemed to have been suspended during the pendency of the appeal.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": null
    },
    {
      "id": "ra3",
      "text": "There was no wilful default on the part of the respondent.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The proviso to sub-s. (3) of s. 13 deals with recovery under cl. (a) or (b) and affords interim protection only if the assessee obtains a stay order from the appellate authority and complies with its conditions; it does not apply to prosecution under s. 29(1)(d).",
      "addresses_issue": "i2",
      "key_observation": "The liability to pay tax is created by the order of assessment. Where tax so assessed is not paid despite service of notice of demand the substantive portion of sub-s. (3) of s. 13 renders the assessee liable to be proceeded against under cl. (a) or cl. (b)."
    },
    {
      "id": "cr2",
      "text": "What is rendered an offence under s. 29(1)(d) is the failure of the assessee to pay the tax within the time allowed, and where the assessee has not paid within time allowed by notice of demand he immediately renders himself liable under s. 29(1)(d).",
      "addresses_issue": "i1",
      "key_observation": "Apart from that, we fail to see how the proviso to sub-s. (3) of s. 13 can at all be an answer to a prosecution under s. 29(1)(d)."
    },
    {
      "id": "cr3",
      "text": "Sub-s. (5) of s. 20 provides that notwithstanding appeal, tax shall be paid in accordance with assessment, and appellate authority may give directions for payment if security furnished; pendency of appeal does not suspend liability.",
      "addresses_issue": "i3",
      "key_observation": "The provision we have just quoted is a complete answer to Mr. Chaudhuri's contention."
    },
    {
      "id": "cr4",
      "text": "The respondent knew he was required to pay within certain time and did not comply; his action was deliberate and therefore wilful.",
      "addresses_issue": "i4",
      "key_observation": "It is difficult to appreciate what he means by saying that there was no wilful default."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The acquittal of the respondent for offences under s. 29(1)(d) was unwarranted.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Mysore Sales Tax Act, 1957",
      "sections": [
        "s.13(3) and proviso",
        "s.20(1), second proviso",
        "s.20(5) and proviso",
        "s.29(1)(d)"
      ],
      "relevance": "Liability to pay tax arises from assessment order and notice of demand; failure to pay constitutes offence under s.29(1)(d); proviso to s.13(3) protects only against recovery under cl.(a)/(b) if stay obtained and complied with; s.20(5) requires payment pending appeal unless stayed with security."
    },
    {
      "name": "Code of Criminal Procedure",
      "sections": [
        "s.421(1)"
      ],
      "relevance": "High Court discretion to entertain appeals against acquittal."
    }
  ],
  "outcome": {
    "disposition": "partially_accepted",
    "summary": "The Supreme Court held the acquittal unwarranted and would have convicted and sentenced the respondent under s.29(1)(d) in each case, but refrained due to the State's undertaking given at special leave stage that it would not press for conviction and sentence irrespective of appeal result.",
    "relief_granted": "None; no conviction or sentence imposed due to undertaking.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The liability to pay tax is created by the order of assessment. Where tax so assessed is not paid despite service of notice of demand the substantive portion of sub-s. (3) of s. 13 renders the assessee liable to be proceeded against under cl. (a) or cl. (b) of that provision.",
      "speaker": "court",
      "significance": "Clarifies creation of liability independent of appellate proceedings."
    },
    {
      "text": "We fail to see how the proviso to sub-s. (3) of s. 13 can at all be an answer to a prosecution under s. 29(1)(d).",
      "speaker": "court",
      "significance": "Distinguishes recovery proceedings from criminal prosecution for non-payment."
    },
    {
      "text": "The provision we have just quoted [s.20(5)] is a complete answer to Mr. Chaudhuri's contention.",
      "speaker": "court",
      "significance": "Rejects suspension of tax liability during appeal pendency."
    }
  ],
  "_case_id": "1966_99",
  "_label": 1,
  "_text_length": 7908,
  "_extracted_at": "2026-02-10T19:39:37.378375"
}