{
  "metadata": {
    "case_name": "Associated Clothiers Ltd. v. Commissioner of Income-tax, Calcutta",
    "case_year": 1965,
    "court": "Supreme Court of India",
    "judges": [
      "Shah, J."
    ],
    "case_number": "Civil Appeal No. 969 of 1965",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Ms. Phelps Company Ltd. was registered as a private limited company on September 30, 1939 to carry on the business of Clothiers and Tailors.",
      "type": "background",
      "date": "1939-09-30",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On March 21, 1952 under an order made under s. 114 of the Indian Companies Act, 1913, the name of the Company was altered to Messrs Associated Clothiers Ltd.",
      "type": "background",
      "date": "1952-03-21",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On the same day a company styled Messrs. Phelps Co. Ltd. was incorporated.",
      "type": "background",
      "date": "1952-03-21",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "By a written agreement also of the same date the appellant Company agreed to transfer its assets and liabilities to Messrs. Phelps Co. Ltd. in consideration of allotment of shares of the value of Rs. 12,30,000/- of Messrs. Phelps Co. Ltd. and Rs 23,291/10/5 payable in cash, and Messrs. Phelps Co. Ltd. taking over liabilities of the appellant Company of the aggregate amount of Rs. 6,05,601/-/6.",
      "type": "material",
      "date": "1952-03-21",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Under the terms of the agreement the appellant Company purported to transfer seven items of property described in the Schedules annexed to the deed one of the properties so agreed to be transferred was described in the second schedule building at Connaught Place, New Delhi, valued at Rs. 2,24,673/-.",
      "type": "material",
      "date": "1952-03-21",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "No deed of conveyance was executed in pursuance of the agreement.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "On July 1, 1952, Messrs. Phelps Co. Ltd. took over possession of the properties agreed to be sold.",
      "type": "material",
      "date": "1952-07-01",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "The original cost of the building described in the second schedule was Rs. 97,258/- and the written down value of the building after deducting depreciation allowed from time to time in the records of the Income-tax Officer was Rs. 57,011/-.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "In the balance sheet of the appellant Company dated March 31, 1953 the building was valued at Rs. 2,24,673/- the price for which it was agreed to be sold.",
      "type": "material",
      "date": "1953-03-31",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "In proceedings for assessment for the account year 1952-53 the Income-tax Officer, Companies, District IV, Calcutta, brought to tax the difference between the original cost and the written down value of the building on the date of the transfer as deemed profit of the appellant Company under the second proviso to s. 10(2)(vii) of the Indian Income-tax Act, 1922.",
      "type": "procedural",
      "date": "1952-53",
      "source": "prosecution"
    },
    {
      "id": "f11",
      "text": "Before the Appellate Tribunal it was contended that the sale of assets to the appellant Company was in substance a sale to self and no profit had resulted to the Company and the amount sought to be brought to tax was not liable to be included in the Company's profit.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f12",
      "text": "The Tribunal relying upon the decision of the Bombay High Court in Commissioner of Income-tax, Bombay City v. Sir Homi Mehtas Executors upheld that contention.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "At the instance of the Commissioner of Income-tax, Calcutta the following question was referred to the High Court of Calcutta: Whether on the facts and in the circumstances of the case the Tribunal was right in holding that the sum of rupees forty thousand two hundred and forty seven could not be deemed to be profits of the assessee company under second proviso to, s. 10(2)(vii) of the Indian Income-tax Act?",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f14",
      "text": "The High Court answered the question in the negative.",
      "type": "procedural",
      "date": "1963-02-05",
      "source": "lower_court"
    },
    {
      "id": "f15",
      "text": "Against the order passed by the High Court, with certificate under s. 66A(2) of the Indian Income-tax Act, this appeal is preferred.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f16",
      "text": "The statement of the case which is based upon the judgment of the Tribunal, there is a clear recital that all the assets and liabilities of the appellant Company were transferred to Messrs. Phelps Co. Ltd.",
      "type": "admitted",
      "date": null,
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether on the facts and in the circumstances of the case the Tribunal was right in holding that the sum of rupees forty thousand two hundred and forty seven could not be deemed to be profits of the assessee company under second proviso to, s. 10(2)(vii) of the Indian Income-tax Act?",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The sale of assets was in substance a sale to self and no profit had resulted to the Company.",
      "supporting_facts": [
        "f4",
        "f5",
        "f11"
      ],
      "legal_basis": "Commissioner of Income-tax, Bombay City v. Sir Homi Mehtas Executors; Rogers Co. v. Commissioner of Income-tax, Bombay City"
    },
    {
      "id": "pa2",
      "text": "The High Court gravely erred in recording its opinion relying on evidence which was never placed before the Income-tax Officer or the Tribunal, such as that the companies continued to exist side by side.",
      "supporting_facts": [
        "f14"
      ],
      "legal_basis": "s. 66(1) or (2) of the Indian Income-tax Act"
    },
    {
      "id": "pa3",
      "text": "The Tribunal was in error in observing that the appellant Company had transferred all its assets and liabilities to the new Company.",
      "supporting_facts": [
        "f4",
        "f16"
      ],
      "legal_basis": null
    },
    {
      "id": "pa4",
      "text": "There was no evidence about the market value of the property transferred and in the absence of any evidence to show that the property was sold for a price exceeding the written down value, liability under s. 10(2)(vii) second proviso will not arise.",
      "supporting_facts": [
        "f8",
        "f9"
      ],
      "legal_basis": "s. 10(2)(vii) second proviso"
    },
    {
      "id": "pa5",
      "text": "The transfer was a slump sale of the assets and there being no separate sale of the property described in the second schedule, the difference between the written down value and the cost price was not liable to be included as income.",
      "supporting_facts": [
        "f4",
        "f5"
      ],
      "legal_basis": "Doughty v. Commissioner of Taxes"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "In ignoring the legal form and relying upon the substance of the transaction the High Court of Bombay has erred.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": "Bank of Chettinad Ltd. v. Commissioner of Income-tax, Madras"
    },
    {
      "id": "ra2",
      "text": "The doctrine that no man can make a profit out of himself is not applicable to transactions between a person and a limited company, even though all the shares in the company are owned by that person, because from a legal point of view a company is an entity entirely distinct from its shareholders.",
      "supporting_facts": [],
      "legal_basis": "Maharajadhiraj Sir Kameshwar Singh v. Commissioner of Income-tax, Bihar Orissa"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The High Court in a reference under s. 66(1) or (2) is bound to proceed on the findings recorded by the Income-tax Appellate Tribunal it has no power to admit on record additional evidence.",
      "addresses_issue": "i1",
      "key_observation": "There is no evidence before the Tribunal and no finding of the Tribunal that after transferring its assets the appellant Company carried on business."
    },
    {
      "id": "cr2",
      "text": "This Court must accept the statement made by the Tribunal in the statement of the case, especially when no objection was raised thereto before the Tribunal or before the High Court on behalf of the appellant Company at any time.",
      "addresses_issue": "i1",
      "key_observation": "All assets and liabilities transferred."
    },
    {
      "id": "cr3",
      "text": "The present is not a case in which persons carrying on business have floated a private limited company and have attempted to readjust their business position. Here is a case in which the assets of one company have been sold to another.",
      "addresses_issue": "i1",
      "key_observation": "Two distinct corporations."
    },
    {
      "id": "cr4",
      "text": "The question is whether there was by the agreement, a transaction of sale in a commercial sense.",
      "addresses_issue": "i1",
      "key_observation": "Where a private limited company transferred some of its assets to a partnership consisting of three shareholders who held the entire issue of shares of the company for a consideration, there was in truth a sale."
    },
    {
      "id": "cr5",
      "text": "The contention that the transaction was merely a nominal transaction and the property in the shares remained with the same Company was never raised before or decided by the Tribunal, and it does not arise out of the order of the Tribunal.",
      "addresses_issue": "i1",
      "key_observation": "Not raised earlier."
    },
    {
      "id": "cr6",
      "text": "In the agreement the properties sold were allotted specific values and no attempt was made at any time before the Tribunal to prove that the values so allotted to the various properties were not true.",
      "addresses_issue": "i1",
      "key_observation": "Burden on company to prove consideration less."
    },
    {
      "id": "cr7",
      "text": "The transfer was not a slump sale with no separate sale of the building as specific values allotted.",
      "addresses_issue": "i1",
      "key_observation": "Unlike Doughty where no separate valuation."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The transaction by which the appellant Company transferred its assets to Messrs. Phelps Co. Ltd. was a transaction of sale, and the difference between the original cost and the written down value is taxable under second proviso to s. 10(2)(vii).",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Commissioner of Income-tax, Bombay City v. Sir Homi Mehtas Executors",
      "citation": "28 I.T.R. 928",
      "treatment": "distinguished",
      "relevance": "Tribunal relied on it to hold sale to self, but inapplicable as two distinct companies here."
    },
    {
      "case_name": "Rogers Co. v. Commissioner of Income-tax, Bombay City",
      "citation": "34 I.T.R. 336",
      "treatment": "distinguished",
      "relevance": "Principle of substance over form, but inapplicable to distinct companies."
    },
    {
      "case_name": "Bank of Chettinad Ltd. v. Commissioner of Income-tax, Madras",
      "citation": "8 I.T.R. 522",
      "treatment": "referred",
      "relevance": "Protest against regarding substance over strict legal position in revenue cases."
    },
    {
      "case_name": "Maharajadhiraj Sir Kameshwar Singh v. Commissioner of Income-tax, Bihar Orissa",
      "citation": "48 I.T.R. 483",
      "treatment": "referred",
      "relevance": "Company distinct from shareholders; cannot ignore corporate entity."
    },
    {
      "case_name": "Chittoor Motor Transport Co. (P) Ltd. v. Income-tax Officer, Chittoor",
      "citation": "59 I.T.R. 238",
      "treatment": "followed",
      "relevance": "Transfer of assets by company to partnership of shareholders is a sale in commercial sense."
    },
    {
      "case_name": "Doughty v. Commissioner of Taxes",
      "citation": null,
      "treatment": "distinguished",
      "relevance": "Slump sale with no separate valuation of items; not applicable here as specific values allotted."
    },
    {
      "case_name": "Commissioner of Income-tax v. Mugneeram Bangur & Co.",
      "citation": null,
      "treatment": "referred",
      "relevance": "Affirmed principle in Doughty's case."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act, 1922",
      "sections": [
        "s. 10(2)(vii) second proviso",
        "s. 66(1)",
        "s. 66(2)",
        "s. 66A(2)"
      ],
      "relevance": "Deemed profit on transfer of capital assets; reference procedure; taxability of difference between original cost and WDV."
    },
    {
      "name": "Indian Companies Act, 1913",
      "sections": [
        "s. 114"
      ],
      "relevance": "Name change of company."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court upheld the High Court's view that the Tribunal erred in holding no deemed profit under s.10(2)(vii), as the transfer was a sale between two distinct companies. The appeal is dismissed.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The present is not a case in which persons carrying on business have floated a private limited company and have attempted to readjust their business position. Here is a case in which the assets of one company have been sold to another.",
      "speaker": "court",
      "significance": "Distinguishes from cases like Sir Homi Mehta; holds it a commercial sale."
    },
    {
      "text": "Their Lordships think it necessary once more to protest against the suggestion that in revenue cases the substance of the matter may be regarded as distinguished from the strict legal position.",
      "speaker": "court",
      "significance": "Cites Bank of Chettinad to limit substance over form."
    }
  ],
  "_case_id": "1966_49",
  "_label": 0,
  "_text_length": 17690,
  "_extracted_at": "2026-02-10T19:38:55.255592"
}