{
  "metadata": {
    "case_name": "Appellant v. Respondent",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "Shelat, J."
    ],
    "case_number": "Civil Appeal No. 230 of 1964",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Authorities appointed under the Hindu Religious and Charitable Endowments Act, Madras Act 11 of 1927 held that premises No. 29 South Masi Street, Madurai, wherein the idol of Sri Srinivasaparumal and certain other idols were located constituted a temple within the meaning of the said Act.",
      "type": "procedural",
      "date": null,
      "source": "authorities"
    },
    {
      "id": "f2",
      "text": "Appellant filed an application in the District Court for a declaration that the said premises were private property and for an order setting aside the said decision.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "The said application was converted into a suit by an order of the High Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "District Judge, Madurai, decreed the suit in favour of the appellant holding that the premises did not constitute a temple and set aside the decision of the authorities.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "On appeal, the High Court reversed the judgment and decree and found that the premises constituted a temple.",
      "type": "procedural",
      "date": "1961-01-11",
      "source": "high_court"
    },
    {
      "id": "f6",
      "text": "Appellant filed a petition for leave to appeal to Supreme Court under Art. 133(1)(a) and (b), submitting that value of subject-matter exceeded Rs. 20,000/- and High Court reversed trial court.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "High Court dismissed the leave application on grounds: (a) subject-matter incapable of valuation as no market value whether private or public temple; (b) cl. (b) not applicable as no claim respecting property of Rs. 20,000/-; (c) no substantial question of law.",
      "type": "procedural",
      "date": "1961-01-11",
      "source": "high_court"
    },
    {
      "id": "f8",
      "text": "Appellant claimed property belonged to Thoguluva family, managed by him on behalf of family; originally purchased by ancestor Thoguluva Thirumalayyan in execution of decree in Suit No. 650 of 1882 for Rs. 1,060/- from Kuppaiyan.",
      "type": "background",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "Original mandapam improved, additional structures like shops added, expenses met by descendants of Thoguluva Thirumalayyan; property private and alienable.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f10",
      "text": "Respondents' case: property was a public temple for public religious worship; allegation of private property capable of alienation false.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f11",
      "text": "Shops let out to tenants for years; property taxes levied by Madurai Municipality on rateable value.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Appellant has municipal receipts: property tax half year ending 30-09-1950 Rs. 94-0-6; half year ending 31-03-1961 Rs. 130.36nP; equivalent to one month's rent, annual rental Rs. 1,126-6-0 (1950) and Rs. 1,672.32nP (1961); capitalised at 20 times exceeds Rs. 20,000/-.",
      "type": "material",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f13",
      "text": "Suit originally filed as O.P. No. 37 of 1950 under s. 84 of Madras Act 11 of 1927 with fixed court fee.",
      "type": "procedural",
      "date": "1950",
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the High Court was right in holding that the property in question, whether as a private or a public temple, was incapable of valuation for the purpose of certificate under Art. 133(1)(a) and (b).",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the subject-matter of the dispute involved a claim respecting property of the value of Rs. 20,000/- or more under Art. 133(1)(b).",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Refusal to grant leave under Art. 133(1)(a) and (b) incorrect; value of subject-matter in District Court and High Court appeal more than Rs. 20,000/-; High Court reversed trial court judgment.",
      "supporting_facts": [
        "f6",
        "f12"
      ],
      "legal_basis": "Art. 133(1)(a) and (b) of the Constitution"
    },
    {
      "id": "pa2",
      "text": "Property is private alienable property of Thoguluva family, capable of valid transfer and valuation; purchased by ancestor, improvements made; shops let out, taxes paid indicating rateable value.",
      "supporting_facts": [
        "f8",
        "f9",
        "f11",
        "f12",
        "f13"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "High Court wrong to assume no market value whether private or public; value to be as per plaint claim of private property.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Subject-matter incapable of valuation as no market value whether private or public temple.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Art. 133(1)(b) not applicable as judgment did not involve claim or question respecting property of Rs. 20,000/- or more.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "Art. 133(1)(b)"
    },
    {
      "id": "ra3",
      "text": "Property is public temple, not private alienable property.",
      "supporting_facts": [
        "f10"
      ],
      "legal_basis": "Madras Act 19 of 1951"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "High Court wrong in holding property incapable of valuation regardless of private or public nature; subject-matter to be valued per plaintiff's claim of private alienable property.",
      "addresses_issue": "i1",
      "key_observation": "Dispute centred on whether private alienable family property or public temple; value accordingly as per plaint."
    },
    {
      "id": "cr2",
      "text": "Appellant entitled to contend value not less than Rs. 20,000/-; original application under fixed fee but converted to suit.",
      "addresses_issue": "i2",
      "key_observation": "Evidence of rental value from taxes supports valuation over Rs. 20,000/-."
    },
    {
      "id": "cr3",
      "text": "High Court ought to have valued property as private per plaint, not assumed inalienable.",
      "addresses_issue": "i1",
      "key_observation": "High Court proceeded on incorrect assumption."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "High Court erred in refusing certificate under Art. 133(1)(a) and (b) by holding property incapable of valuation irrespective of its character.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Subject-matter of dispute to be valued with reference to claim in plaint as private property.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 133(1)(a)",
        "Art. 133(1)(b)"
      ],
      "relevance": "Criteria for certificate to appeal to Supreme Court; whether subject-matter valuation exceeds Rs. 20,000/- and substantial reversal."
    },
    {
      "name": "Hindu Religious and Charitable Endowments Act (Madras Act 11 of 1927)",
      "sections": [
        "s. 84"
      ],
      "relevance": "Application filed under this for declaration against temple status; fixed court fee."
    },
    {
      "name": "Madras Act 19 of 1951",
      "sections": [],
      "relevance": "Definition of temple; whether premises constituted a temple."
    },
    {
      "name": "Code of Civil Procedure",
      "sections": [
        "O. 45, r. 1"
      ],
      "relevance": "Inquiry into value of property directed by appellant."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed, High Court order dated January 11, 1961 set aside, case remanded to High Court to decide leave application per observations; High Court may hold inquiry or remit to trial court.",
    "relief_granted": "Remand for inquiry into value and decision on certificate under Art. 133(1)(a) and (b)",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The subject-matter of the dispute has to be ascertained with reference to the claim made by the plaintiff in his plaint and since according to the plaint, the property is the private property of the said family capable of alienation, the High Court ought to have valued the property accordingly",
      "speaker": "court",
      "significance": "Core reasoning on valuation for Art. 133 certificate."
    },
    {
      "text": "We would therefore allow the appeal, set aside the order passed by the High Court and remand the case to the High Court to decide the application for leave in accordance with the observations made in this judgment.",
      "speaker": "court",
      "significance": "Final disposition of the appeal."
    }
  ],
  "_case_id": "1966_202",
  "_label": 1,
  "_text_length": 7599,
  "_extracted_at": "2026-02-10T19:40:56.076142"
}