{
  "metadata": {
    "case_name": "Gowli Buddanna v. Commissioner of Income-tax",
    "case_year": null,
    "court": "Supreme Court of India",
    "judges": [
      "Shah, J."
    ],
    "case_number": null,
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "One Buddappa, his wife, his two unmarried daughters and his adopted son Buddanna were members of a Hindu undivided family.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Buddappa died on July 9, 1952.",
      "type": "material",
      "date": "1952-07-09",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "In respect of the business dealings of the family, Buddappa was assessed during his life-time in the status of a manager of the Hindu undivided family.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "For the assessment year 1951-52 the Additional Income-tax Officer, Raichur, assessed Buddanna in respect of the income of the previous year which ended on November 8, 1950 as a Hindu undivided family under the title Sri. Gowli Buddappa deceased represented by his legal successor Sri. Gowli Buddanna, Oil Mills Owner, Raichur.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The order of assessment was confirmed in appeal by the Appellate Assistant Commissioner, subject to the variation that the assessment was made under the title Buddanna - a Hindu undivided family.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The Income-tax Appellate Tribunal confirmed the order of the Appellate Assistant Commissioner.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "The Tribunal referred the following questions of law to the High Court of Mysore for opinion under s. 66(1) of the Indian Income-tax Act: Whether the sole male surviving coparcener of the Hindu joint family, his widowed mother and sisters constitute a Hindu undivided family within the meaning of the Income-tax Act? Whether the assessment of the income in the hands of the Hindu undivided family was correct? Whether the Appellate Assistant Commissioner was entitled to correct the status?",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "The High Court recorded answers in the affirmative on all the questions.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "With certificate granted by the High Court under s. 66-A of the Indian Income-tax Act, Buddanna has appealed to this Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Before the Appellate Assistant Commissioner it was contended by Buddanna that he could in law have only been assessed as an individual and that the Income-tax Officer was precluded by virtue of the proviso to s. 26(2) to pass the order for assessment for the year 1951-52 against him.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f11",
      "text": "The Appellate Assistant Commissioner and the Appellate Tribunal rejected that contention.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Buddappa was a resident of and carried on business at Raichur which before January 26, 1950, formed part of the territory of H.E.H. the Nizam.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "The joint family of Buddappa and Buddanna was governed by the Mitakshara School of Hindu law, and there was at the material time no legislation in force in the territory by which on the death of a male member in a joint Hindu family interest in the family estate devolved upon his widow. Such a widow had therefore only a right to receive maintenance from the estate.",
      "type": "background",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the sole male surviving coparcener of the Hindu joint family, his widowed mother and sisters constitute a Hindu undivided family within the meaning of the Income-tax Act?",
      "framed_by": "tribunal"
    },
    {
      "id": "i2",
      "text": "Whether the assessment of the income in the hands of the Hindu undivided family was correct?",
      "framed_by": "tribunal"
    },
    {
      "id": "i3",
      "text": "Whether the Appellate Assistant Commissioner was entitled to correct the status?",
      "framed_by": "tribunal"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The expression Hindu undivided family used in s. 3 of the Income-tax Act means a Hindu coparcenary and when on the death of one out of two coparceners the entire property devolves upon a single coparcener, assessment cannot be made on the surviving coparcener in the status of a Hindu undivided family.",
      "supporting_facts": [
        "f2",
        "f13"
      ],
      "legal_basis": "s. 3 of the Income-tax Act"
    },
    {
      "id": "pa2",
      "text": "Even if the entity Hindu undivided family in the charging section of the Income-tax Act is intended to mean a Hindu joint family, there must be at least two male members in the family, and where there are no two such members the sole surviving male member of the family, even if there be widows entitled to maintenance out of the estate, may be assessed in the status of an individual, and not of a Hindu undivided family, unless the widows of deceased male members are entitled to the benefit of the Hindu Womens Rights to Property Act, 1937, or the Hindu Succession Act, 1956.",
      "supporting_facts": [
        "f2",
        "f13"
      ],
      "legal_basis": "Hindu Womens Rights to Property Act, 1937; Hindu Succession Act, 1956"
    },
    {
      "id": "pa3",
      "text": "He could in law have only been assessed as an individual and that the Income-tax Officer was precluded by virtue of the proviso to s. 26(2) to pass the order for assessment for the year 1951-52 against him.",
      "supporting_facts": [
        "f4",
        "f10"
      ],
      "legal_basis": "proviso to s. 26(2) of the Income-tax Act"
    },
    {
      "id": "pa4",
      "text": "There are certain intrinsic indications in the annual Finance Acts which support the contention that the income received or arising from property in the hands of a sole surviving male member in a joint Hindu family, even if there be females having a right to maintenance out of that property, is taxable as income of an individual, and not of the family.",
      "supporting_facts": [],
      "legal_basis": "Finance Act, 1951, First Schedule"
    },
    {
      "id": "pa5",
      "text": "Reliance upon the form of Return prescribed under the Rules, which by s. 59 of the Income-tax Act, 1922 have effect as if enacted in the Act.",
      "supporting_facts": [],
      "legal_basis": "s. 59 of the Income-tax Act, 1922; Part IIIA of the Form"
    },
    {
      "id": "pa6",
      "text": "Sub-section (1) of s. 25-A on which reliance was placed also does not imply that a Hindu undivided family must consist of more male members than one.",
      "supporting_facts": [],
      "legal_basis": "s. 25-A(1) of the Income-tax Act"
    },
    {
      "id": "pa7",
      "text": "Strong reliance upon certain observations of the Judicial Committee in Kalyanji Vithaldas case.",
      "supporting_facts": [],
      "legal_basis": "Kalyanji Vithaldas v. CIT"
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The first contention is plainly unsustainable. Under s. 3 of the Income-tax Act not a Hindu coparcenary but a Hindu undivided family is one of the assessable entities. A Hindu joint family consists of all persons lineally descended from a common ancestor, and includes their wives and unmarried daughters. A Hindu coparcenary is a much narrower body than the joint family it includes only those persons who acquire by birth an interest in the joint or coparcenary property, these being the sons, grandsons and great-grandsons of the holder of the joint property for the time being. Therefore there may be a joint Hindu family consisting of a single male member and widows of deceased coparceners.",
      "addresses_issue": "i1",
      "key_observation": "HUF broader than coparcenary; can consist of single male and widows."
    },
    {
      "id": "cr2",
      "text": "The plea that there must be at least two male members to form a Hindu undivided family as a taxable entity also has no force. The expression Hindu undivided family in the Income-tax Act is used in the sense in which a Hindu joint family is understood under the personal law of Hindus. Under the Hindu system of law a joint family may consist of a single male member and widows of deceased male members, and apparently the Income-tax Act does not indicate that a Hindu undivided family as an assessable entity must consist of at least two male members.",
      "addresses_issue": "i1",
      "key_observation": "No requirement of two male members for HUF under IT Act."
    },
    {
      "id": "cr3",
      "text": "The Schedule sets out the limits of exempted income it does not state or imply that a Hindu undivided family must consist of at least two members entitled to claim partition. The text of the clause furnishes a clear indication to the contrary.",
      "addresses_issue": "i1",
      "key_observation": "Finance Act proviso does not define HUF composition."
    },
    {
      "id": "cr4",
      "text": "The information is required to be given in Part IIIA of the Form merely to enable the Income-tax Officer to consider which of the two parts of the proviso in the First Schedule to the relevant Finance Act prescribing the limit of exemption in respect of the Hindu undivided family applies.",
      "addresses_issue": "i1",
      "key_observation": "Return form does not require two partition claimants for HUF status."
    },
    {
      "id": "cr5",
      "text": "The sub-section only prescribes the procedure whereby the members of a family which has hitherto been assessed in the status of a Hindu undivided family may obtain an order that they may, because of partition of the joint status, be assessed as separated members. The clause is purely procedural it does not enact either expressly or by implication that a Hindu undivided family assessed as a unit must consist of at least two male members who are capable of demanding a partition.",
      "addresses_issue": "i1",
      "key_observation": "s.25A(1) is procedural, does not define HUF."
    },
    {
      "id": "cr6",
      "text": "Distinguishes Kalyanji Vithaldas: In Kalyanji, income was separate or ancestral but not family income; here property belonged to HUF and continued to.",
      "addresses_issue": "i1",
      "key_observation": "Distinction in facts: here subsisting HUF property."
    },
    {
      "id": "cr7",
      "text": "In Gomedalli Lakshminarayans case the property was ancestral in the hands of the father, and the son had acquired by birth an interest therein. There was a subsisting Hindu undivided family during the life-time of the father and that family did not come to an end on his death.",
      "addresses_issue": "i1",
      "key_observation": "Similar to present case."
    },
    {
      "id": "cr8",
      "text": "Cites Attorney-General of Ceylon v. A. R. Arunachalam Chettiar: Property of a joint family therefore does not cease to belong to the family merely because the family is represented by a single coparcener who possesses rights which an owner of property may possess.",
      "addresses_issue": "i1",
      "key_observation": "Single coparcener represents continuing HUF."
    },
    {
      "id": "cr9",
      "text": "In the case in hand the property which yielded the income originally belonged to a Hindu undivided family. On the death of Buddappa the family which included a widow and females born in the family was represented by Buddanna alone but the property still continued to belong to that undivided family and income received therefrom was taxable as income of the Hindu undivided family.",
      "addresses_issue": "i2",
      "key_observation": "Assessment as HUF correct."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "There may be a joint Hindu family consisting of a single male member and widows of deceased coparceners.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "The expression Hindu undivided family in the Income-tax Act is used in the sense in which a Hindu joint family is understood under the personal law of Hindus. Under the Hindu system of law a joint family may consist of a single male member and widows of deceased male members.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "The assessment of the income in the hands of the Hindu undivided family was correct.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h4",
      "text": "The High Court was therefore right in recording their answers referred for opinion.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Kalyanji Vithaldas Other v. Commissioner of Income-tax, Bengal",
      "citation": "5 I.T.R. 90 L.R. 64 I.A. 28",
      "treatment": "followed",
      "relevance": "Phrase Hindu undivided family used in statute refers to joint family, not just coparcenary; distinguished on facts as income there was separate, not family property."
    },
    {
      "case_name": "Commissioner of Income-tax, Bombay v. Gomedalli Laksminarayan",
      "citation": "3 I.T.R. 123 / 367",
      "treatment": "followed",
      "relevance": "HUF can consist of sole surviving male and females entitled to maintenance; property ancestral, family subsists after father's death."
    },
    {
      "case_name": "Commissioner of Income-tax v. A. P. Swamy Gomedalli",
      "citation": "5 I.T.R. 416",
      "treatment": "distinguished",
      "relevance": "Bound by Kalyanji; income by survivorship taxed as individual for super-tax."
    },
    {
      "case_name": "Attorney-General of Ceylon v. A. R. Arunachalam Chettiar and Others",
      "citation": "L.R. 1957 A.C. 540 34 I.T.R. Suppl. 42",
      "treatment": "followed",
      "relevance": "Single coparcener represents continuing HUF; property remains joint family property."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act, 1922",
      "sections": [
        "s. 3",
        "s. 26(2)",
        "s. 55",
        "s. 66(1)",
        "s. 66A",
        "s. 25A(1)",
        "s. 59"
      ],
      "relevance": "Defines assessable entities including HUF; status correction; reference to HC; return forms; partition procedure."
    },
    {
      "name": "Finance Act, 1951",
      "sections": [
        "First Schedule"
      ],
      "relevance": "Rates and exemption limits for HUF do not require two male members."
    },
    {
      "name": "Hindu Womens Rights to Property Act, 1937",
      "sections": [],
      "relevance": "Mentioned hypothetically for widow rights."
    },
    {
      "name": "Hindu Succession Act, 1956",
      "sections": [],
      "relevance": "Mentioned hypothetically for widow rights."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court dismissed the appeal, upholding the High Court's affirmative answers to the referred questions. The assessment on Buddanna as representing the HUF was correct, as the family continued post-Buddappa's death with Buddanna as sole male member and female members entitled to maintenance.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"A Hindu joint family consists of all persons lineally descended from a common ancestor, and includes their wives and unmarried daughters. A Hindu coparcenary is a much narrower body than the joint family.\"",
      "speaker": "court",
      "significance": "Distinguishes HUF from coparcenary, key to holding."
    },
    {
      "text": "\"Therefore there may be a joint Hindu family consisting of a single male member and widows of deceased coparceners.\"",
      "speaker": "court",
      "significance": "Directly resolves whether sole male + widows = HUF."
    },
    {
      "text": "\"Property of a joint family therefore does not cease to belong to the family merely because the family is represented by a single coparcener who possesses rights which an owner of property may possess.\"",
      "speaker": "court",
      "significance": "From Arunachalam, crux of continuity of HUF."
    }
  ],
  "_case_id": "1966_189",
  "_label": 0,
  "_text_length": 22207,
  "_extracted_at": "2026-02-10T19:41:10.826135"
}