{
  "metadata": {
    "case_name": "Ammathayee and another v. Minor son of Rangaswami Chettiar",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "Wanchoo, J."
    ],
    "case_number": "Civil Appeal No. 618 of 1964",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Rangaswami Chettiar was a man of considerable property and used to live in Poolathur village.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Rangaswami Chettiar first married Bappini and had a son by her, but both died.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Rangaswami Chettiar married Ammathayee (defendant No. 2, appellant No. 1), had a son and two daughters, all died.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Rangaswami Chettiar married Lakshmiammal (first defendant) in 1943.",
      "type": "background",
      "date": "1943",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "No child born to Lakshmiammal for about three years after marriage, so Rangaswami married fourth time to Supputhayee, sister of second wife.",
      "type": "background",
      "date": "circa 1946",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Dispute whether Lakshmiammal left husband around 1945 due to quarrels.",
      "type": "disputed",
      "date": "circa 1945",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Fourth wife had no children.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "In February 1949, Lakshmiammal gave birth to a son (plaintiff-respondent).",
      "type": "material",
      "date": "1949-02",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "In June 1953, Rangaswami Chettiar fell ill, treated as out-patient then in-patient at Batlagundu hospital.",
      "type": "background",
      "date": "1953-06",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "On June 16, 1953, Rangaswami executed registered deed of gift of immovable joint family property to Ammathayee.",
      "type": "material",
      "date": "1953-06-16",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Lakshmiammal published notice in newspaper accusing second and fourth wives of depriving her and son of share, claiming gift invalid.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "On September 4, 1953, Rangaswami sent notice accusing Lakshmiammal of leaving him 1.5 years after marriage, promiscuity, and denying paternity of son born Feb 1949.",
      "type": "material",
      "date": "1953-09-04",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "On September 15, 1953, Lakshmiammal replied maintaining son is Rangaswami's, mind poisoned by other wives, denied other connections.",
      "type": "material",
      "date": "1953-09-15",
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Rangaswami Chettiar died in December 1953.",
      "type": "background",
      "date": "1953-12",
      "source": "court"
    },
    {
      "id": "f15",
      "text": "Suit filed on January 3, 1955 by minor son claiming half share in joint family properties; defendants: three widows (def1 Lakshmiammal, def2 Ammathayee, def3 Supputhayee).",
      "type": "procedural",
      "date": "1955-01-03",
      "source": "court"
    },
    {
      "id": "f16",
      "text": "Main defence of step-mothers (appellants): plaintiff not son of Rangaswami, not entitled to share; Ammathayee: gift valid, plaintiff entitled only to half of non-gifted properties.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f17",
      "text": "Trial court: plaintiff son of Rangaswami; gift invalid as of joint family immovable property; decreed half share including gifted properties.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f18",
      "text": "High Court upheld trial court on paternity (s.112 Evidence Act, no non-access proved) and gift invalid; dismissed appeal of step-mothers; allowed appeal of def4,5; dismissed cross-objection re def6 properties.",
      "type": "procedural",
      "date": "1960-11-29",
      "source": "lower_court"
    },
    {
      "id": "f19",
      "text": "Lakshmiammal lived in father's house in same village, one furlong from Rangaswami's house.",
      "type": "admitted",
      "date": null,
      "source": "appellants"
    },
    {
      "id": "f20",
      "text": "Gift to Ammathayee was about one-tenth of entire property.",
      "type": "background",
      "date": null,
      "source": "donee-appellant"
    },
    {
      "id": "f21",
      "text": "Gift deed recital: promise by father K.K. Ramasami Chettiar at marriage time, directions to execute document, affection, obedience.",
      "type": "material",
      "date": "1953-06-16",
      "source": "court"
    },
    {
      "id": "f22",
      "text": "Def6 Natarajan Chettiar: schedule D properties not joint family; upheld by trial court.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f23",
      "text": "Schedule B items: gold chain (item 6), promissory notes (items 2-4) - no proof of existence.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the plaintiff-respondent was the son of Rangaswami Chettiar.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the deed of gift executed by Rangaswami Chettiar in favour of Ammathayee was valid.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Plaintiff not son of Rangaswami Chettiar; notice by Rangaswami denying paternity is strong evidence rebutting presumption, especially as he married four times for a son.",
      "supporting_facts": [
        "f12",
        "f8"
      ],
      "legal_basis": "Section 112 Indian Evidence Act"
    },
    {
      "id": "pa2",
      "text": "High Court erred in accepting evidence and holding non-access not proved.",
      "supporting_facts": [
        "f17",
        "f18"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Gift valid as reasonable portion (1/10th) out of love/affection to wife.",
      "supporting_facts": [
        "f10",
        "f20",
        "f21"
      ],
      "legal_basis": "Hindu law on gifts out of affection"
    },
    {
      "id": "pa4",
      "text": "Gift to fulfil pious obligation from father's promise at marriage.",
      "supporting_facts": [
        "f21"
      ],
      "legal_basis": "Pious purposes under Hindu law"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Lakshmiammal never quarrelled or left, fourth marriage with consent due to no child; co-wives jealous after son's birth, influenced Rangaswami; lived nearby in father's house.",
      "supporting_facts": [
        "f4",
        "f5",
        "f8",
        "f19"
      ],
      "legal_basis": "Section 112 Indian Evidence Act (presumption of paternity, non-access not proved)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Concurrent finding of trial and High Court that plaintiff is son; no interference unless compelling; High Court considered evidence including notice but Lakshmiammal's evidence not disbelieved; lived one furlong away; appellants failed to prove non-access at conception time.",
      "addresses_issue": "i1",
      "key_observation": "Notice by Rangaswami not better than his testimony; s.112 requires proof of non-access, not proved."
    },
    {
      "id": "cr2",
      "text": "Hindu law: gifts of ancestral immovable property circumscribed; only for pious purposes within reasonable limits; extended to daughter's marriage promise, not to wife or daughter-in-law.",
      "addresses_issue": "i2",
      "key_observation": "No case upholds husband gifting ancestral immovable to wife out of affection; father's promise not pious purpose for son to fulfil via gift."
    },
    {
      "id": "cr3",
      "text": "Father-in-law cannot gift ancestral immovable to daughter-in-law; thus son cannot fulfil as pious obligation; stridhan gifts typically movable or non-ancestral.",
      "addresses_issue": "i2",
      "key_observation": "Cannot indirectly do what directly not permitted."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Plaintiff-respondent is legitimate son of Rangaswami Chettiar; appellants failed to rebut s.112 presumption.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Gift of ancestral immovable property to wife invalid under Hindu law; not permitted out of affection or to fulfil father-in-law's promise.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Kamala Devi v. Bachu Lal Gupta",
      "citation": "1957 S.C.R. 452",
      "treatment": "followed",
      "relevance": "Gift of ancestral immovable within reasonable limits to daughter fulfilling antenuptial promise is pious purpose."
    },
    {
      "case_name": "Guramma Bhratar Chanbassappa Deshmukh v. Malappa",
      "citation": "1964 4 S.C.R. 497",
      "treatment": "followed",
      "relevance": "Moral obligation allows reasonable gift to daughter/sister for maintenance, not confined to marriage time; pious purpose."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Evidence Act, 1872",
      "sections": [
        "Section 112"
      ],
      "relevance": "Conclusive presumption of legitimacy unless non-access proved; heavy burden on deniers not discharged."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal dismissed upholding trial and High Court decrees that plaintiff is son of Rangaswami and entitled to half share including gifted properties; gift invalid; no relief against respondent No.3; costs to plaintiff-respondent.",
    "relief_granted": "Plaintiff's half share in joint family properties upheld, including gifted ones.",
    "costs": "Dismissed with costs to plaintiff-respondent; respondent No.3 gets costs from appellants but no hearing fee."
  },
  "key_quotes": [
    {
      "text": "The fact that any person was born during the continuance of a valid marriage... shall be conclusive proof that he is the legitimate son of that man, unless... no access to each other at any time when he could have been begotten.",
      "speaker": "court",
      "significance": "Quotes s.112 Evidence Act central to paternity holding."
    },
    {
      "text": "We see no reason to extend the scope of the words 'pious purposes' beyond what has already been done in the two decisions of this Court.",
      "speaker": "court",
      "significance": "Limits Hindu law on gifts of ancestral immovable property."
    },
    {
      "text": "If that is so, we cannot see how what the father-in-law himself could not do could be made into a pious obligation on the son.",
      "speaker": "court",
      "significance": "Rejects fulfilling father-in-law's promise via gift."
    }
  ],
  "_case_id": "1966_168",
  "_label": 0,
  "_text_length": 20929,
  "_extracted_at": "2026-02-10T19:40:14.277809"
}