{
  "metadata": {
    "case_name": "Appellant (Landlord) v. Respondent (Cultivating Tenant)",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "Bachawat, J."
    ],
    "case_number": "Civil Appeal No. 797 of 1963",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "On April 24, 1958, the respondent claiming to be the cultivating tenant of the appellant in respect of certain lands in Manapparavaivattam, Nannilam Taluk deposited Rs. 462/- as rent for 1367 fasli in the Revenue Court the Court of the Revenue Divisional Officer, Tanjore under s. 3(3) of the Madras Cultivating Tenants Protection Act, 1955 (Madras Act No. 25 of 1955) and filed an application before the Court praying for a declaration that the amount deposited represented the correct amount of rent due from him.",
      "type": "procedural",
      "date": "1958-04-24",
      "source": "respondent"
    },
    {
      "id": "f2",
      "text": "The appellant denied that the respondent was his cultivating tenant.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "On July 31, 1958, the Revenue Court, Tanjore held that the respondent was not a cultivating tenant of the appellant and could not claim the benefit of s. 3(3) and dismissed the application.",
      "type": "material",
      "date": "1958-07-31",
      "source": "lower_court"
    },
    {
      "id": "f4",
      "text": "The respondent filed a petition in revision before the Madras High Court under s. 6-B of the Act read with s. 115 of the Code of Civil Procedure in C.R.P. No. 1282 of 1958.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f5",
      "text": "The High Court came to the conclusion that the respondent was a cultivating tenant of the appellant and by its order dated March 27, 1959, allowed the revision petition and declared that the amount deposited by the respondent represented the correct amount due from him to the appellant.",
      "type": "material",
      "date": "1959-03-27",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The appellant appeals to this Court by special leave.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "The Act came into force on September 27, 1955 and was amended from time to time. Originally, the Act was temporary, recently it has been made permanent.",
      "type": "background",
      "date": "1955-09-27",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the finding of the Revenue Court that the respondent was not a cultivating tenant was a finding of fact not subject to revision by the High Court under s. 6-B of the Act read with s. 115 CPC, or whether it was a collateral fact touching the jurisdiction of the Revenue Court under s. 3(3) and thus revisable.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The finding of the Revenue Court that the respondent was not a cultivating tenant was a finding of fact and the High Court had no jurisdiction to set it aside on revision.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": "s. 115 CPC"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The finding was in respect of a collateral fact upon the existence of which the jurisdiction of the Revenue Court under s. 3(3) depended and the High Court had ample power to revise the finding under s. 6-B of the Act.",
      "supporting_facts": [
        "f1",
        "f3"
      ],
      "legal_basis": "s. 6-B Madras Act r/w s. 115 CPC"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Section 6-B empowers the High Court to revise the decision of the Revenue Divisional Officer under s. 115 CPC. Sub-s. (a) empowers correction of erroneous assumption of jurisdiction, sub-s. (b) erroneous refusal. Decision on questions of law and fact not touching jurisdiction is final, but erroneous decision on preliminary fact upon which jurisdiction depends is revisable.",
      "addresses_issue": "i1",
      "key_observation": "The Revenue Divisional Officer is a court of limited jurisdiction; existence of landlord-cultivating tenant relation is essential condition for jurisdiction."
    },
    {
      "id": "cr2",
      "text": "To attract jurisdiction of Revenue Divisional Officer, there must be dispute between landlord and cultivating tenant; relation is preliminary fact. Tribunal's summary enquiry decision on it is not final, subject to High Court revision under s. 6-B.",
      "addresses_issue": "i1",
      "key_observation": "Legislature could not have intended finality on preliminary fact involving title without appeal."
    },
    {
      "id": "cr3",
      "text": "Revenue Court declined jurisdiction under s. 3(3) finding no tenancy; High Court could review, found tenancy on evidence, set aside under s. 115(b). Finding not erroneous.",
      "addresses_issue": "i1",
      "key_observation": "No reason to interfere with High Court decision."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The High Court had power under s. 6-B r/w s. 115(a) and (b) CPC to review the Revenue Court's decision on the preliminary fact of tenancy existence, as it touched jurisdiction; erroneous refusal of jurisdiction corrected.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Madras Cultivating Tenants Protection Act, 1955 (Madras Act No. 25 of 1955)",
      "sections": [
        "s. 2",
        "s. 3(1)",
        "s. 3(2)",
        "s. 3(3)",
        "s. 3(4)",
        "s. 4(1)",
        "s. 4(5)",
        "s. 4-A(1)",
        "s. 4-A(2)",
        "s. 4-AA(2)",
        "s. 4-AA(3)",
        "s. 4-B",
        "s. 6",
        "s. 6-A",
        "s. 6-B",
        "s. 7"
      ],
      "relevance": "Defines cultivating tenant, landlord; protects from eviction; enables deposit of rent and declaration of correct amount by RDO; vests jurisdiction in RDO for eviction, restoration, resumption; bars civil court jurisdiction; provides revision to HC."
    },
    {
      "name": "Code of Civil Procedure, 1908 (Central Act 5 of 1908)",
      "sections": [
        "s. 115"
      ],
      "relevance": "Governs High Court's revisional jurisdiction over RDO deemed subordinate court under s. 6-B of the Act; allows correction of jurisdictional errors."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal by special leave against the Madras High Court's order dated March 27, 1959 allowing revision and declaring the deposited amount as correct rent is dismissed. The High Court's finding that respondent is cultivating tenant upheld.",
    "relief_granted": "Declaration that Rs. 462/- deposited represents correct rent upheld.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The existence of the relation of landlord and cultivating tenant between the contesting parties is the essential condition for the assumption of jurisdiction by the Revenue Divisional Officer in all proceedings under the Act.",
      "speaker": "court",
      "significance": "Defines the jurisdictional prerequisite central to the decision."
    },
    {
      "text": "If by an erroneous decision on a question of fact or law touching its jurisdiction, e.g., on a preliminary fact upon the existence of which its jurisdiction depends, the subordinate Court assumes a jurisdiction not vested in it by law or fails to exercise a jurisdiction so vested, its decision is not final, and is subject to review by the High Court.",
      "speaker": "court",
      "significance": "Explains scope of revisional jurisdiction under s. 115 CPC."
    }
  ],
  "_case_id": "1966_149",
  "_label": 0,
  "_text_length": 10654,
  "_extracted_at": "2026-02-10T19:40:10.665584"
}