{
  "metadata": {
    "case_name": "Srinivasavaradachariar v. Dr. Gopala Menon & Ors.",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "Mitter, J."
    ],
    "case_number": "Civil Appeal No. 636 of 1964",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Original mortgagor Dhanakoti Ammal succeeded to the properties of her father along with her sisters under a will executed by him on the basis that the properties were his self-acquired properties.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Her brother Alavandar filed a suit in the year 1919 through a next friend claiming that the properties were not the self-acquired properties of his father and as such not capable of bequest under a will. This suit was dismissed as also the appeal therefrom to the Madras High Court preferred in 1922.",
      "type": "background",
      "date": "1919",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "By the year 1936 when the first mortgage in favour of Srinivasavaradachariar, the appellant, was executed, Dhanakoti Ammal was involved in debts.",
      "type": "background",
      "date": "1936",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The most important item of her properties was a market on the outskirts of the city of Madras which had become dilapidated and the Corporation of Madras was refusing to renew the licence unless it was put in good order.",
      "type": "background",
      "date": "1936",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "She had further borrowed a sum of money repayable with interest at 20 per cent compoundable monthly.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Her brother Alavandar who was due to attain majority very soon threatened to file another suit impeaching the decree in the earlier suit.",
      "type": "background",
      "date": "1936",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "The first two mortgages were executed in 1936 before Alavandar had filed his suit and the last mortgage was executed in January 1938. Four mortgages executed between March 20, 1936 and January 2, 1938.",
      "type": "material",
      "date": "1936-03-20 to 1938-01-02",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Dhanakoti Ammal got more and more involved in debt and was adjudicated an insolvent in O. P. 148 of 1949. Her properties got vested in the Official Assignee of Madras.",
      "type": "procedural",
      "date": "1949",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "The Official Assignee brought the properties to sale which were ultimately purchased by Dr. Gopala Menon for Rs. 50,001/-.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Dr. Gopala Menon tried to come to an arrangement with Srinivasavaradachariar but nothing came out of it and the suit out of which this appeal has arisen was filed in the year 1950.",
      "type": "procedural",
      "date": "1950",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Learned trial Judge Ramaswami J. reduced the rate of interest from 15 per cent compoundable every quarter to 15 per cent compoundable with yearly rests.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Bench of two Judges in appeal reduced the rate to 10 per cent compound interest with yearly rests and scaled down the rate of interest to 6 per cent from the date of the institution of the suit.",
      "type": "procedural",
      "date": "1959-09-01",
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Amount advanced under the old mortgages came to nearly Rs. 48,000/- that there was already a prior mortgage in respect of which nearly Rs. 8,000/- was due.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "Value of the security though not very ample could not be said to be markedly inadequate and there was a shadow on the title of the mortgagor by reason of the threat of suit by her brother.",
      "type": "disputed",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f15",
      "text": "Even after the institution of Alavandar's suit in 1937 the appellant advanced further sums of money to Dhanakoti Ammal at the same rate of interest as before.",
      "type": "material",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "The main question in this appeal relates to the rate of interest payable in respect of four mortgages executed in between March 20, 1936 and January 2, 1938.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the provision for interest in the impugned mortgages should be reduced under s. 3 of the Usurious Loans Madras Amendment Act VIII of 1937, and if so, to what rate.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The creditor's substantial complaint is that the rate of interest should not have been cut down by the Division Bench of the Madras High Court.",
      "supporting_facts": [
        "f7",
        "f11",
        "f12"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "15 per cent compound interest calculated with quarterly rests was certainly excessive.",
      "supporting_facts": [
        "f13",
        "f14"
      ],
      "legal_basis": "s. 3 Usurious Loans Madras Amendment Act VIII of 1937"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Power of the court to reduce interest derived from s. 3 of the Usurious Loans Madras Amendment Act VIII of 1937. If court has reason to believe transaction substantially unfair, can reopen and relieve debtor of excessive interest. Presumption if interest excessive, rebuttable.",
      "addresses_issue": "i2",
      "key_observation": "Excessive means in excess of that which the court deems reasonable having regard to risk incurred, security, debtor's condition, etc."
    },
    {
      "id": "cr2",
      "text": "Court must go back to date of original transaction and form opinion as to reasonable rate after considering value of security, financial condition of debtor, known risks, compound interest frequency.",
      "addresses_issue": "i2",
      "key_observation": "Security was not inadequate and threat of suit by Alavandar never regarded seriously, as appellant advanced further after suit at same rate."
    },
    {
      "id": "cr3",
      "text": "Division Bench made correct assessment; 10 per cent compound interest with yearly rests meets justice of case. No reason to interfere with scaling down to 6 per cent from suit date as discretion pendente lite.",
      "addresses_issue": "i1",
      "key_observation": "Interest at 10% compound annually over years more in creditor's interest than 12% simple."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "10 per cent compound interest with yearly rests prior to suit date not excessive; scaling down to 6% from suit date upheld.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Division Bench pronouncement with regard to rate of interest prior to suit ought not to be disturbed.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Venkatarao v. Venkataratnam",
      "citation": null,
      "treatment": "followed",
      "relevance": "Anything above 12 per cent per annum simple interest is excessive."
    },
    {
      "case_name": "Sri Balasaraswati v. A. Parameswara Aiyar",
      "citation": "A.I.R. 1952 Madras 872",
      "treatment": "followed",
      "relevance": "In normal cases with ample security, more than 12 per cent simple excessive; where security not sound, 10 per cent compound allowed."
    },
    {
      "case_name": "C. S. 163 of 1949 (Subba Rao J.)",
      "citation": null,
      "treatment": "referred",
      "relevance": "Reduced 15% compound to 12% simple; dictum that above 12% simple excessive not principle for all cases."
    }
  ],
  "statutes_cited": [
    {
      "name": "Usurious Loans Madras Amendment Act VIII of 1937",
      "sections": [
        "s. 3(1)",
        "s. 3(2)(a)",
        "s. 3(2)(b)",
        "s. 3(2)(c)",
        "s. 3(2)(d)"
      ],
      "relevance": "Gives court power to reduce excessive interest if transaction substantially unfair; defines excessive based on risk, security, debtor condition."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal dismissed. Supreme Court upholds Madras High Court Division Bench reduction of interest rate to 10 per cent compound with yearly rests till suit institution and 6 per cent thereafter under s.3 of Usurious Loans Madras Amendment Act.",
    "relief_granted": "None to appellant; reduction in interest upheld for respondents.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "It is difficult to predicate of any rate of interest as being excessive divorced from the circumstances of the case unless the rate fixed is so high as to be suggestive of an unfair transaction on the face of things.",
      "speaker": "court",
      "significance": "Emphasizes contextual assessment of excessiveness under the Act."
    },
    {
      "text": "In our opinion the learned Judges of the Division Bench of the Madras High Court were right in holding that 10 per cent compound interest with yearly rests would meet the justice of the case.",
      "speaker": "court",
      "significance": "Core holding upholding the reduced rate."
    }
  ],
  "_case_id": "1966_67",
  "_label": 0,
  "_text_length": 13712,
  "_extracted_at": "2026-02-10T19:39:31.416116"
}