{
  "metadata": {
    "case_name": "Hindu Undivided Family of Kishanchand Bajaj v. Commissioner of Income-tax",
    "case_year": 1965,
    "court": "Supreme Court of India",
    "judges": [
      "Shah, J."
    ],
    "case_number": "Civil Appeal No. 234 of 1965",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Kishanchand Bajaj and his seven sons formed a Hindu undivided family which owned shares exceeding Rs. 91,000 in value, in public limited companies.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The family commenced business in money-lending and commission agents on May 16, 1956 in the name of Messrs. Mangoomal Kishanchand and in the books of account of the firm the shares which stood registered in the name of Kishanchand with the companies were credited as capital of the business.",
      "type": "material",
      "date": "1956-05-16",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On August 22, 1956 Shyam Sundar and Girdharlal, two of the sons of Kishanchand separated from the family, each receiving rupees two lakhs in lieu of his share.",
      "type": "material",
      "date": "1956-08-22",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On August 23, 1956 a partnership was formed between Kishanchand representing the Hindu undivided family of himself and his five sons and Shyam Sundar and Girdharlal, for carrying on the business of Messrs. Mangoomal Kishanchand. Under the deed of partnership, Shyam Sundar and Girdharlal were each entitled to a seventh share and the remaining five-sevenths share was to belong to Kishanchand as karta of the Hindu undivided family.",
      "type": "material",
      "date": "1956-08-23",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Dividends received in respect of the shares were credited to the profit loss account of the firm.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "In proceedings for assessment of the firm for the year 1959-60 it was claimed that the shares which stood registered in the name of Kishanchand belonged not to the Hindu undivided family but to the firm of Messrs. Mangoomal Kishanchand.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "The Income-tax Officer rejected that contention. He held that the Hindu undivided family was the real and legal owner of the shares, and that the shares were at no time the property of the firm.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "The order of the Income-tax Officer was confirmed in appeal by the Appellate Assistant Commissioner.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "In second appeal to the Income-tax Appellate Tribunal it was contended on behalf of the Hindu undivided family that the dividend from the shares could be assessed only in the hands of the person who held ownership legal as well as equitable in the shares, and as the family had ceased to be the equitable owner of the shares, the Hindu undivided family could not be assessed under the Income-tax Act, 1922 on the dividend.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f10",
      "text": "The Tribunal rejected the contention.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "The Tribunal then referred under s. 66(1) of the Indian Income-tax Act, 1922, the following question to the High Court of Mysore for opinion: Whether on the facts and circumstances of the case, the dividend income from shares standing in the name of Kishanchand Lunidasingh Bajaj and acquired with the funds of the Hindu undivided family of which the said person was the karta was assessable in the hands of the assessee family?",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "The High Court answered the question in the affirmative, and with special leave the Hindu undivided family has appealed to this Court.",
      "type": "procedural",
      "date": "1963-07-19",
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether on the facts and circumstances of the case, the dividend income from shares standing in the name of Kishanchand Lunidasingh Bajaj and acquired with the funds of the Hindu undivided family of which the said person was the karta was assessable in the hands of the assessee family?",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Where one taxable entity is the registered holder of shares in a company and the real owner of the shares is another taxable entity, the registered shareholder alone is liable to be assessed to tax in respect of the dividend from those shares, and therefore Kishanchand alone was liable to be taxed in respect of the dividend income from the shares, and not the Hindu undivided family.",
      "supporting_facts": [
        "f2",
        "f4",
        "f5"
      ],
      "legal_basis": "s. 16(2) of the Indian Income-tax Act, 1922; Howrah Trading Company Ltd. v. Commissioner of Income-tax"
    },
    {
      "id": "pa2",
      "text": "The dividend from the shares could be assessed only in the hands of the person who held ownership legal as well as equitable in the shares, and as the family had ceased to be the equitable owner of the shares, the Hindu undivided family could not be assessed on the dividend.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": "Indian Income-tax Act, 1922"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The Hindu undivided family was the real and legal owner of the shares, and that the shares were at no time the property of the firm.",
      "supporting_facts": [
        "f1",
        "f2",
        "f7"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Under s. 3, total income of the previous year of every ... Hindu undivided family ... is charged to tax. By s.4 the total income ... includes ... all income ... which are received ... by or on behalf of such person ... Tax being charged by s 3 upon dividend income and not being excluded under s.4 such income would be chargeable to income-tax under the Act in the hands of the person to whom it accrues or by whom it is received.",
      "addresses_issue": "i1",
      "key_observation": "A company ... merely recognises the registered shareholder as the owner and pays the dividend to that shareholder. But the shares may ... belong to a person other than the registered shareholder, and the dividend distributed by the company would for the purpose of tax be deemed to accrue or arise to the real owner of the shares."
    },
    {
      "id": "cr2",
      "text": "Section 16(2) ... does not direct the inclusion of any item of income in the computation of the total income of an assessee to whom it does not accrue or arise it is only a processing clause applicable in respect of dividend income ... designates the year in which the dividend income is to be included ... Since the same income cannot be taxed twice over, dividend income will be taxed in the hands of the real owner of the shares ... Grossing up only if the registered shareholder is the real owner.",
      "addresses_issue": "i1",
      "key_observation": "Sub-s. 2 of s. 16 does not operate as an exemption ... nor does it provide that liability to tax arises only when the person by whom dividend is received from the company is the real owner of the shares."
    },
    {
      "id": "cr3",
      "text": "Reviewed Howrah Trading, Arvind Mafatlal, Shakuntala cases: In Howrah, dividend income was included in total income of real owner though not registered. Grossing up denied to non-registered. Shakuntala on s.23A fictional income, shareholder means registered.",
      "addresses_issue": "i1",
      "key_observation": "The observations in Howrah ... are not susceptible of ... meaning that dividend may be taxed only in the hands of a person who is in law as well as in equity the shareholder."
    },
    {
      "id": "cr4",
      "text": "We are unable to accept the argument ... that because the dividend income ... cannot be grossed up, and credit for tax paid cannot be obtained by the appellants, the appellants are not liable to be taxed in respect of dividend received by them. There is no provision in the Act which supports this plea, and the scheme of the Act lends no countenance to an expedient which may lead to gross evasion of tax.",
      "addresses_issue": "i1",
      "key_observation": "Dividend income taxable to real owner regardless of registration."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Dividend income from shares is assessable in the hands of the real owner (Hindu undivided family), even if shares are registered in the name of the karta, as the income accrues to the real owner under ss. 3 and 4 of the Income-tax Act, 1922.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Section 16(2) does not exempt real owner from tax on dividend; it only governs timing and grossing up for registered real owners.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Howrah Trading Company Ltd. v. Commissioner of Income-tax, Central, Calcutta",
      "citation": "1959 Supp. 2 S.C.R. 448, 36 I.T.R. 215",
      "treatment": "followed | referred",
      "relevance": "Explained: Real owner taxed on dividend even if not registered; grossing up only for registered real owner."
    },
    {
      "case_name": "Income-tax Officer, North Satara v. Arvind N. Mafatlal & Others",
      "citation": "1962 Supp. 3 S.C.R. 455, 45 I.T.R. 271",
      "treatment": "followed",
      "relevance": "Registered shareholder alone entitled to grossing up and credit under ss.16(2) and 18(5)."
    },
    {
      "case_name": "Commissioner of Income-tax, Bombay City II v. Shakuntala & others",
      "citation": "1962 2 S.C.R. 871, 43 I.T.R. 352",
      "treatment": "distinguished",
      "relevance": "For s.23A, shareholder means registered; not applicable to actual dividend under s.16(2)."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act, 1922",
      "sections": [
        "Section 3",
        "Section 4",
        "Section 16(1)",
        "Section 16(2)",
        "Section 16(3)",
        "Section 16(5)",
        "Section 18(5)",
        "Section 66(1)",
        "Section 23A"
      ],
      "relevance": "Dividend income chargeable to real owner under ss.3,4; s.16(2) for timing and grossing up of registered real owners; s.66(1) for reference."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court dismissed the appeal by special leave, upholding the Mysore High Court's affirmative answer that the dividend income was assessable in the hands of the assessee Hindu undivided family, as it was the real owner of the shares despite registration in the karta's name.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "Tax being charged by s 3 upon dividend income and not being excluded under s.4 such income would be chargeable to income-tax under the Act in, the hands of the person to whom it accrues or by whom it is received.",
      "speaker": "court",
      "significance": "Establishes tax liability on real owner/recipient."
    },
    {
      "text": "dividend income will be taxed in the hands of the real owner of the shares and in the year designated by s. 16(2).",
      "speaker": "court",
      "significance": "Confirms taxation follows real ownership, not registration."
    },
    {
      "text": "the scheme of the Act lends no countenance to an expedient which may lead to gross evasion of tax.",
      "speaker": "court",
      "significance": "Rejects argument that lack of grossing up exempts real owner from tax."
    }
  ],
  "_case_id": "1966_89",
  "_label": 0,
  "_text_length": 18797,
  "_extracted_at": "2026-02-10T19:39:38.442501"
}