{
  "metadata": {
    "case_name": "Election Petitioners v. Brij Bhushan Saran",
    "case_year": 1965,
    "court": "Supreme Court of India",
    "judges": [
      "Wanchoo, J."
    ],
    "case_number": "Civil Appeal No. 1141 of 1965",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "In the election to the U.P. Legislative Assembly from Dehra Dun City constituency in 1962, Brij Bhushan Saran respondent was one of the candidates and was declared elected.",
      "type": "material",
      "date": "1962",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Raturi Vaid was another candidate at the same election. He withdrew his candidature within the time fixed for withdrawal under s. 37 of the Act. He belonged to the same party as the returned candidate and worked for him.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "After the election, an election petition was filed by two electors praying that the election of Brij Bhushan Saran be set aside.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "One of the grounds was that Raturi Vaid had threatened an elector after the date of his withdrawal from the candidature that the elector's bones would be broken if he did not cast his vote for Brij Bhushan Saran and also did not work for him and persuade others to vote for him.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "The Election Tribunal held that this amounted to a corrupt practice within the meaning of s. 123(2) read with the proviso (a)(i) thereof, committed by a candidate namely Raturi Vaid.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "Tribunal held that as this corrupt practice was committed by Raturi Vaid, it was necessary to join him as respondent to the petition under s. 82(b). As this was not done, the Tribunal dismissed the petition under s. 90(3) of the Act.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Appeal to the Allahabad High Court in First Appeal No. 2 of 1963, judgment dated April 17, 1963, which upheld the view taken by the Tribunal.",
      "type": "procedural",
      "date": "1963-04-17",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "High Court granted certificate to appeal to Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether there was an allegation of corrupt practice against Raturi Vaid.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether Raturi Vaid can be said to be 'any other candidate' within the meaning of s. 82(b) of the Representation of the People Act, 1951, even after withdrawal of candidature under s. 37.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "There was no allegation of corrupt practice against Raturi Vaid.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Even if allegation against Raturi Vaid, he could not come within the meaning of the words 'any other candidate' used in s. 82(b) inasmuch as he withdrew his candidature as provided in s. 37 of the Act.",
      "supporting_facts": [
        "f2"
      ],
      "legal_basis": "s. 82(b), s. 37; Kapildeo Singh v. Suraj Narayan Singh, A.I.R. 1959 Pat. 250"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Raturi Vaid would certainly be covered by the words 'any other candidate' in s. 82(b) even though he withdrew his candidature under s. 37.",
      "supporting_facts": [
        "f2",
        "f5"
      ],
      "legal_basis": "s. 82(b), s. 79(b)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The allegation was that it was Raturi Vaid who gave the threat, though in furtherance of the election of Brij Bhushan Saran and on his behalf. The primary allegation certainly was that it was Raturi Vaid who had committed the corrupt practice.",
      "addresses_issue": "i1",
      "key_observation": "There was an allegation of corrupt practice against Raturi Vaid."
    },
    {
      "id": "cr2",
      "text": "Raturi Vaid is covered by the definition of 'candidate' in s. 79(b) as he was duly nominated though he later withdrew. The context of s. 82(b) does not limit 'any other candidate' to those who have not withdrawn under s. 37.",
      "addresses_issue": "i2",
      "key_observation": "The words 'any other candidate' in cl. (b) of s. 82 contrast with candidates under cl. (a) and include withdrawn candidates."
    },
    {
      "id": "cr3",
      "text": "Purity of elections requires that a nominated candidate remains a candidate even after withdrawal till the election is over, and if he commits corrupt practice before or after withdrawal, he must be joined under s. 82(b).",
      "addresses_issue": "i2",
      "key_observation": "Date of withdrawal cannot be a dividing line; full meaning to s. 79(b) must be given in s. 82(b)."
    },
    {
      "id": "cr4",
      "text": "Patna High Court decision in Kapildeo Singh v. Suraj Narayan Singh is incorrect; Allahabad High Court view is correct. Supported by Mohan Singh v. Bhanwarlal.",
      "addresses_issue": "i2",
      "key_observation": "By definition in s. 79(b), 'any other candidate' in s. 82(b) includes a candidate who had withdrawn."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "There was an allegation of corrupt practice against Raturi Vaid.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Raturi Vaid is 'any other candidate' under s. 82(b) even after withdrawal under s. 37; must be joined as respondent.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Kapildeo Singh v. Suraj Narayan Singh",
      "citation": "A.I.R. 1959 Pat. 250",
      "treatment": "distinguished",
      "relevance": "Relied by appellants; held incorrect by Supreme Court."
    },
    {
      "case_name": "Mohan Singh v. Bhanwarlal",
      "citation": null,
      "treatment": "followed",
      "relevance": "Held that by definition of 'candidate' in s. 79(b), 'any other candidate' in s. 82(b) includes withdrawn candidate."
    }
  ],
  "statutes_cited": [
    {
      "name": "Representation of the People Act, 1951",
      "sections": [
        "s. 82(b)",
        "s. 79(b)",
        "s. 123(2)",
        "s. 37",
        "s. 90(3)",
        "s. 80",
        "s. 81"
      ],
      "relevance": "Interpretation of 'candidate' and requirement to join respondents in election petition; corrupt practice definition."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court upheld the Allahabad High Court and Election Tribunal's view that Raturi Vaid, having committed alleged corrupt practice, was a necessary party under s. 82(b) despite withdrawal, and since not joined, petition rightly dismissed under s. 90(3). Appeal dismissed.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "Purity of elections is a matter of great importance, and it is for the purpose of maintaining this purity that we have the provisions contained in S. 123 of the Act.",
      "speaker": "court",
      "significance": "Emphasizes rationale for treating withdrawn candidates as parties if corrupt practice alleged."
    },
    {
      "text": "If purity of elections has to be maintained a person who is a candidate as defined in s. 79(b) of the Act will remain a candidate even after he withdraws till the election is over.",
      "speaker": "court",
      "significance": "Core holding on scope of 'candidate' in s. 82(b)."
    }
  ],
  "_case_id": "1966_297",
  "_label": 0,
  "_text_length": 12502,
  "_extracted_at": "2026-02-10T19:42:11.934049"
}