{
  "metadata": {
    "case_name": "Union of India v. Metal Corporation of India Ltd.",
    "case_year": 1966,
    "court": "Supreme Court of India",
    "judges": [
      "Subba Rao, C.J."
    ],
    "case_number": "Civil Appeal No. 1222 of 1966",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The 1st respondent, The Metal Corporation of India Limited, was a limited company constituted under the Indian Companies Act, having for its objects, inter alia, the development of zinc and lead mines at Zawar in the State of Rajasthan and the construction of a zinc smelter and other connected works for producing electrolytic zinc and by-products.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The Government was satisfied that it was necessary to acquire the said Corporation in public interest.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On October 22, 1965, the President of India promulgated Ordinance No. 6 of 1965 providing for the acquisition of the Corporation by the Central Government.",
      "type": "procedural",
      "date": "1965-10-22",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Pursuant to the said Ordinance, on or about October 23, 1965, the Central Government took over the possession, control and administration of the said Corporation.",
      "type": "procedural",
      "date": "1965-10-23",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The Corporation, the 1st respondent and its Managing Director, the 2nd respondent filed a Writ Petition under Art. 226 of the Constitution in the High Court of Judicature for the State of Punjab, Circuit Bench at New Delhi, being Petition No. 631-D of 1965, challenging the validity of the said Ordinance.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The Parliament passed the Act on the same terms as contained in Ordinance No. 6 of 1965; it received the assent of the President of India on December 12, 1965.",
      "type": "procedural",
      "date": "1965-12-12",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "The respondent filed another writ petition in the said High Court, being Writ Petition No. 832-D of 1965, for a declaration that the Act was ultra vires the Constitution.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "The said High Court held that the Ordinance and the Act contravened the relevant provisions of Art. 31 of the Constitution and, therefore, were constitutionally void.",
      "type": "procedural",
      "date": "1966-03-14",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "The present appeal is preferred against the said judgment of the High Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "The constitutional validity of the Metal Corporation of India, Acquisition of Undertaking Act No. XLIV of 1965, particularly whether it provides for compensation within the meaning of Art. 31(2) of the Constitution, focusing on the principles in cl. (b) of para II of the Schedule for valuing machinery.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The Act laid down the broad principle that compensation shall be paid for the entire undertaking as a unit, but provided different modes for the ascertainment of the value of different parts thereof in such a way that the deficiency in the valuation of one part was offset by the liberal valuation of the other part.",
      "supporting_facts": [],
      "legal_basis": "Art. 31 of the Constitution"
    },
    {
      "id": "pa2",
      "text": "The reasoning of the High Court did not appreciate the true scope of the decision in Vajravelu v. Special Deputy Collector and went wrong in applying the principle of the said decision to the provisions of the Act.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": "Vajravelu v. Special Deputy Collector (1965) 1 S.C.R. 614"
    },
    {
      "id": "pa3",
      "text": "Compensation in Art. 31 of the Constitution meant that compensation which was regarded as just in the context of public acquisitions and that test was satisfied in the present case.",
      "supporting_facts": [],
      "legal_basis": "Art. 31 of the Constitution"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Though under the Act compensation was to be given to the undertaking as one unit, the Act laid down principles for arriving at the valuation of the parts to arrive at the valuation of the whole and that, therefore, every such principle should stand the test laid down by this Court.",
      "supporting_facts": [],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Both the principles laid down in cl. (b) of para II of the Schedule had no nexus to the ascertainment of compensation for the machinery acquired, for in the case of unused machinery, its cost price was the guide and in the case of used machinery its written-down value was the criterion and that both the methods were arbitrary.",
      "supporting_facts": [],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Though a single compensation for the undertaking is given, the said compensation shall be determined in accordance with the principles specified in the Schedule. Under the Schedule, the compensation for the entire undertaking shall be the amount equal to the sum total of the value of the properties and assets of the Corporation calculated in accordance with the provisions of para II of the Schedule less liabilities. If all the said principles laid down in para II of the Schedule do not provide for the just equivalent of all the parts of the undertaking mentioned therein, the sum total also cannot obviously be a just equivalent of the undertaking.",
      "addresses_issue": "i1",
      "key_observation": "Machinery is the most valuable part of the undertaking."
    },
    {
      "id": "cr2",
      "text": "Apropos the unused machinery in good condition, how can the price for which the said machinery was purchased years ago possibly represent its price at the time of its acquisition? It is common knowledge that there has been an upward spiral in prices of the machinery in recent years.",
      "addresses_issue": "i1",
      "key_observation": "The cost price of a machinery purchased about ten years ago is a consideration not relevant for fixing compensation for its acquisition in 1965."
    },
    {
      "id": "cr3",
      "text": "The doctrine of written-down value accepted in the Income-tax law can afford no guide for ascertaining the compensation for the used machinery acquired under the Act. This artificial rule of depreciation evolved for income-tax purposes has no relation to the value of the said assets.",
      "addresses_issue": "i1",
      "key_observation": "Application of the principle laid down in cl. (b) of para II of the Schedule to the Act in regard to used machinery gives the owner no compensation at all."
    },
    {
      "id": "cr4",
      "text": "The two principles of valuation embodied in cl. (b) of Para II of the Schedule to the Act are not relevant to the fixation of the value of the said machinery as on the date of acquisition.",
      "addresses_issue": "i1",
      "key_observation": "The impugned Act has not provided for compensation within the meaning of Art. 31(2) of the Constitution and, therefore, it is void."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Under Art. 31(2) of the Constitution, no property shall be compulsorily acquired except under a law which provides for compensation for the property acquired and either fixes the amount of compensation or specifies the principles on which and the manner in which compensation is to be determined and given. Compensation means a just equivalent of what the owner has been deprived of.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "The principles laid down in cl. (b) of para II of the Schedule to the Act, namely, (i) compensation equated to the cost price in the case of unused machinery in good condition, and (ii) written-down value as understood in the Income-tax law as the value of used machinery, are irrelevant to the fixation of the value of the said machinery as on the date of acquisition.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "The impugned Act has not provided for compensation within the meaning of Art. 31(2) of the Constitution and, therefore, it is void. The constitutional invalidity of cl. (b) of Para II of the Schedule to the Act affects the totality of the compensation payable to the entire undertaking.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Vajravelu v. Special Deputy Collector",
      "citation": "1965 1 S.C.R. 614",
      "treatment": "followed",
      "relevance": "Principles for determining if compensation principles are relevant to the value of the property at or about the time of acquisition; if irrelevant, the law is bad."
    },
    {
      "case_name": "State of West Bengal v. Mrs. Bela Banerjee",
      "citation": "1954 S.C.R. 558",
      "treatment": "followed",
      "relevance": "Compensation under Art. 31(2) means a just equivalent; value at anterior date is not compensation."
    },
    {
      "case_name": "State of Madras v. D. Namasivaya Mudaliar",
      "citation": "1964 6 S.C.R. 936",
      "treatment": "followed",
      "relevance": "Fixation of anterior date for market value without relevant considerations is arbitrary and violates Art. 31(2)."
    },
    {
      "case_name": "Jeejeebhoy v. Assistant Collector",
      "citation": "1965 1 S.C.R. 636",
      "treatment": "followed",
      "relevance": "Fixation of anterior date without reference to relevant considerations is arbitrary."
    }
  ],
  "statutes_cited": [
    {
      "name": "Metal Corporation of India (Acquisition of Undertaking) Act, 1965 (No. XLIV of 1965)",
      "sections": [
        "Section 3",
        "Section 10",
        "Schedule Paragraph I",
        "Schedule Paragraph II (cl. b)",
        "Schedule Paragraph III"
      ],
      "relevance": "Provides for acquisition of undertaking and principles for determining compensation; held unconstitutional as principles irrelevant."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 31(2)",
        "Article 226",
        "Article 32"
      ],
      "relevance": "Requires law for compulsory acquisition to provide compensation as just equivalent; no such law can be questioned on adequacy if principles relevant."
    },
    {
      "name": "Income-tax Act, 1961 (XLIII of 1961)",
      "sections": [],
      "relevance": "Written-down value under this Act held irrelevant for compensation valuation."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal against the High Court's judgment declaring the Metal Corporation of India (Acquisition of Undertaking) Act, 1965 unconstitutional is dismissed. The Act is held void for not providing compensation within Art. 31(2) due to irrelevant principles for machinery valuation.",
    "relief_granted": "High Court judgment upheld; Act declared unconstitutional and void.",
    "costs": "Appeal dismissed with costs."
  },
  "key_quotes": [
    {
      "text": "\"Compensation under Art. 31(2) of the Constitution means a just equivalent of what the owner has been deprived of.\"",
      "speaker": "court",
      "significance": "Defines the core test for constitutional validity under Art. 31(2)."
    },
    {
      "text": "\"If the principles laid down are relevant to the fixation of compensation and are not arbitrary, the adequacy of the resultant product cannot be questioned in a court of law.\"",
      "speaker": "court",
      "significance": "Distinguishes judicial review of principles from adequacy."
    },
    {
      "text": "\"The two principles of valuation embodied in cl. (b) of Para II of the Schedule to the Act are not relevant to the fixation of the value of the said machinery as on the date of acquisition.\"",
      "speaker": "court",
      "significance": "Direct holding on the invalidity of the specific compensation principles."
    }
  ],
  "_case_id": "1966_209",
  "_label": 0,
  "_text_length": 25051,
  "_extracted_at": "2026-02-10T19:40:57.519620"
}