{
  "metadata": {
    "case_name": "Samyukta Socialist Party v. Election Commission & Praja Socialist Party",
    "case_year": 1966,
    "court": "Supreme Court of India",
    "judges": [
      "Hidayatullah, J."
    ],
    "case_number": "Civil Appeal No. 1653 of 1966 and Writ Petition No. 193 of 1966",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Praja Socialist Party (PSP) formed by merger of Socialist Party and Kisan Mazdoor Praja Party (KMPP), recognised as national party after First General Election in 1952.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Socialist Party recognised as State Party in Uttar Pradesh, Rajasthan and Union Territory of Manipur after Second General Election in 1957.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "In 1962 General Election, PSP recognised in nine States with Hut as reserved symbol, secured 12 Lok Sabha seats and 172 Assembly seats; Socialist Party recognised in UP, Rajasthan, Manipur with Tree symbol, secured 6 Lok Sabha and 47 Assembly seats.",
      "type": "background",
      "date": "1962",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "June 1964: Merger of PSP and Socialist Party into Samyukta Socialist Party (SSP); SSP allotted Hut as reserved symbol, Tree became free symbol.",
      "type": "material",
      "date": "1964-06",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "SSP contested four bye-elections and Kerala elections but saw deterioration in seats; union short-lived.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "January 31, 1965: At inaugural meeting of National Ad Hoc Committee at Banaras, parties broke apart; PSP claims restoration to pre-merger position, SSP claims merger final with some defections.",
      "type": "material",
      "date": "1965-01-31",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Election Commission, after enquiry, found original PSP leaders and bulk of members left SSP; relative strengths showed reversion to original state; allotted Hut to PSP, Tree to SSP.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "SSP filed petition under Art. 226 before Punjab High Court (Civil Writ No. 7011-D of 1965), dismissed on November 18, 1965; appeal by special leave.",
      "type": "procedural",
      "date": "1965-11-18",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Mr. Madhu Limaye filed Writ Petition No. 193 of 1966 under Art. 32 challenging same order as breach of fundamental rights.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "What are the powers of the Election Commission in relation to the allotment of symbols?",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether in the circumstances, the Election Commission's powers were legally exercised?",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Election Commission lacked jurisdiction to take away Hut symbol allotted to SSP; merger was final, only some members defected.",
      "supporting_facts": [
        "f4",
        "f6"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Change in Rule 5 denies power to amend list of symbols; new rule only imposes restrictions, choice once made is final.",
      "supporting_facts": [],
      "legal_basis": "Conduct of Elections Rules, 1961 Rule 5"
    },
    {
      "id": "pa3",
      "text": "Facts do not justify assumption that parties reverted to pre-merger state.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Merger unsuccessful and quick break-up; original PSP leaders and bulk of members quit SSP; parties reverted to original state justifying restoration of symbols.",
      "supporting_facts": [
        "f4",
        "f5",
        "f6",
        "f7"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Election Commission has power under Rule 5 to notify and amend symbols based on circumstances like party mergers or splits.",
      "supporting_facts": [],
      "legal_basis": "Conduct of Elections Rules, 1961 Rule 5"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Under Rule 5, Election Commission notifies symbols and restrictions; can issue fresh notifications if circumstances change (parties unite or separate); must act based on facts, not arbitrarily.",
      "addresses_issue": "i1",
      "key_observation": "Restrictions permit amendment of notification to reflect changed circumstances."
    },
    {
      "id": "cr2",
      "text": "Facts show genuine merger then quick break-up; PSP original leaders and bulk rejoined; EC enquired strengths and restored original symbols; action bona fide, within jurisdiction.",
      "addresses_issue": "i2",
      "key_observation": "Reversion logical and just; Hut identified with successful PSP."
    },
    {
      "id": "cr3",
      "text": "Symbols essential for illiterate voters; EC can regulate in suitable cases to restore lost advantage without imposing wishes arbitrarily.",
      "addresses_issue": "i1",
      "key_observation": "No absolute discretion but jurisdiction in merger/split scenarios."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Election Commission has jurisdiction under Rule 5 to amend symbol allocations based on factual changes in party status.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "EC's action in restoring Hut to PSP and Tree to SSP was within jurisdiction, bona fide and supported by facts.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Representation of the People Act, 1951",
      "sections": [
        "Section 169"
      ],
      "relevance": "Empowers Central Government, after consulting EC, to make rules for voting including for illiterate voters."
    },
    {
      "name": "Conduct of Elections Rules, 1961",
      "sections": [
        "Rule 5"
      ],
      "relevance": "EC notifies symbols and restrictions for elections; permits amendments based on circumstances."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 32",
        "Article 226"
      ],
      "relevance": "Basis for writ petitions challenging EC order."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal against High Court dismissal and companion writ petition challenging EC's symbol allotment dismissed; EC's action upheld as within jurisdiction and based on facts; no order as to costs.",
    "relief_granted": null,
    "costs": "No order as to costs"
  },
  "key_quotes": [
    {
      "text": "Symbols are its very soul and without them the exercise of franchise by the majority of our citizens would be impossible.",
      "speaker": "court",
      "significance": "Highlights critical role of symbols in Indian elections for illiterate voters."
    },
    {
      "text": "The Election Commission is required to give effect to restrictions of its own making but that does not restrict its own powers so long as what it does is in consonance with facts.",
      "speaker": "court",
      "significance": "Defines scope of EC's jurisdiction over symbol allotment."
    },
    {
      "text": "If disagreement led to a quick break up before the new party or its symbol could become properly grounded, the reversion to the original position was not only logical but also eminently just.",
      "speaker": "court",
      "significance": "Justifies EC's decision on facts of party split."
    }
  ],
  "_case_id": "1966_53",
  "_label": 0,
  "_text_length": 20211,
  "_extracted_at": "2026-02-10T19:38:47.308453"
}