{
  "metadata": {
    "case_name": "Appellant v. Respondents (sons of Narayana Iyer)",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "Mudholkar, J."
    ],
    "case_number": "Civil Appeal No. 543 of 1963",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant executed a promissory note at Madras for Rs. 10,600 in favour of Narayana Iyer on January 28, 1946, agreeing to pay interest at 12% p.a.",
      "type": "admitted",
      "date": "1946-01-28",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "No repayment was made by the appellant on the promissory note.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Narayana Iyer instituted suit against appellant for recovery of Rs. 14,402-5-0, including interest on Rs. 10,600.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f4",
      "text": "Appellant contended the 1946 promissory note was renewal of previous promissory note, tracing back to original promissory note for Rs. 1,000 executed by appellant's brother in 1930.",
      "type": "disputed",
      "date": "1930",
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "Appellant renewed the debt in 1932.",
      "type": "disputed",
      "date": "1932",
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "Promissory note renewed on January 11, 1937 by appellant for Rs. 4,000, including interest on first advance and additional Rs. 350 advanced by Narayana Iyer; taken in name of General Bank (under Narayana Iyer's control).",
      "type": "disputed",
      "date": "1937-01-11",
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "Debt renewed in favour of General Bank on January 3, 1940 by promissory note for Rs. 5,650.",
      "type": "disputed",
      "date": "1940-01-03",
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "Debt renewed on September 13, 1944 by promissory note for Rs. 9,275 in favour of General Bank.",
      "type": "disputed",
      "date": "1944-09-13",
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "Respondents contended Narayana Iyer paid off dues to General Bank at instance of appellant and obtained promissory note for Rs. 10,600 in his favour.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f10",
      "text": "Narayana Iyer died during pendency of suit; represented by his sons, the respondents.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Appellant is an agriculturist entitled to benefits of Madras Agriculturists Relief Act IV of 1938 for scaling down debts.",
      "type": "material",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f12",
      "text": "Single Judge of Madras High Court upheld appellant's plea, scaled down debt to Rs. 1,350 with interest at 6 1/4% from March 22, 1938.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Madras High Court in O.S. Appeal No. 1 of 1954 (judgment dated October 10, 1958) modified decree, allowing respondents Rs. 10,600 plus interest at 6% p.a.",
      "type": "procedural",
      "date": "1958-10-10",
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "Narayana Iyer paid Rs. 10,600 by cheque to General Bank to credit of appellant; paid off debt at request of appellant.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f15",
      "text": "Madras Agriculturists Relief Act IV of 1938 assented March 11, 1938; published March 22, 1938; into force from March 11, 1938.",
      "type": "background",
      "date": "1938-03-11",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether Explanation III to Section 8 of Madras Agriculturists Relief Act IV of 1938 applies to entitle appellant to scaling down of debt, given renewals in favour of General Bank (different from original creditor Narayana Iyer).",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Interpretation of 'in his interest' in Explanation III to Section 8 as amended by Madras Act 24 of 1950.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Promissory note of 1946 is renewal tracing back to 1930 original debt; entitled to scaling down under Section 8 and Explanation III as amended.",
      "supporting_facts": [
        "f4",
        "f5",
        "f6",
        "f7",
        "f8"
      ],
      "legal_basis": "Madras Agriculturists Relief Act IV of 1938, S.8 Explanation III (as amended by Act 24 of 1950)"
    },
    {
      "id": "pa2",
      "text": "General Bank under Narayana Iyer's control; acted in his interest or on his behalf; same creditor for practical purposes.",
      "supporting_facts": [
        "f6",
        "f7",
        "f8"
      ],
      "legal_basis": "Explanation III to S.8 (words 'acting in his interest')"
    },
    {
      "id": "pa3",
      "text": "Amendments to Explanation III extended benefit even to different creditor or debtor to defeat narrow interpretations.",
      "supporting_facts": [],
      "legal_basis": "Amending Acts 23 of 1948 and 24 of 1950 to Explanation III"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Narayana Iyer paid off dues to General Bank at appellant's instance, obtaining fresh promissory note for Rs. 10,600; not a renewal attracting scaling down.",
      "supporting_facts": [
        "f9",
        "f14"
      ],
      "legal_basis": "Madras Agriculturists Relief Act IV of 1938, S.8 Explanation III"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Explanation III (as per Act 24 of 1950) requires renewal by same debtor or representatives and in favour of same creditor or acting on behalf/in interest; General Bank has independent existence, not identical to Narayana Iyer.",
      "addresses_issue": "i1",
      "key_observation": "No material shows Bank acted on behalf of Narayana Iyer in obtaining 1940 and 1944 notes."
    },
    {
      "id": "cr2",
      "text": "'In his interest' means 'for the benefit of'; but Narayana Iyer paid off Bank's debt at appellant's request, not in interest of original creditor.",
      "addresses_issue": "i2",
      "key_observation": "High Court findings that Narayana Iyer discharged appellant's liability to Bank unchallenged."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Explanation III to S.8 does not apply; no scaling down; respondents entitled to full principal Rs. 10,600 plus interest.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Madras Agriculturists Relief Act IV of 1938",
      "sections": [
        "Section 7",
        "Section 8",
        "Section 8 Explanation III (original, amended by Act 23 of 1948, Act 24 of 1950)"
      ],
      "relevance": "Provides for scaling down of debts of agriculturists; Explanation III determines principal for pre-1932 debts upon renewal."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court upholds Madras High Court Division Bench decree allowing respondents full recovery of Rs. 10,600 plus interest at 6% p.a., rejecting appellant's claim for scaling down under the Act.",
    "relief_granted": "Decree for Rs. 10,600 with interest at 6% p.a.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The General Bank has an independent existence and even though the controlling interest therein was with Narayana Iyer and his family it would not be correct to say that there is an identity between that bank and Narayana Iyer.",
      "speaker": "court",
      "significance": "Rejects equation of Narayana Iyer and General Bank for Explanation III."
    },
    {
      "text": "It has been found as a fact by the appeal court that Narayana Iyer actually paid Rs. 10,600 by cheque in favour of the General Bank Ltd., to the credit of the appellant.",
      "speaker": "court",
      "key_observation": "Upholds finding that payment discharged debt to Bank, not acting in interest of creditor."
    }
  ],
  "_case_id": "1966_6",
  "_label": 0,
  "_text_length": 11286,
  "_extracted_at": "2026-02-10T19:38:14.672557"
}