{
  "metadata": {
    "case_name": "Pampapathy and Shekarappa v. State",
    "case_year": 1966,
    "court": "Supreme Court of India",
    "judges": [
      "Ramaswami J."
    ],
    "case_number": "Criminal Appeals Nos. 121 and 122 of 1966",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellants Pampapathy and Shekarappa tried in Court of Sessions at Chitradurga for offences under ss. 147, 148, 307, 323, 302 read with s. 149 and s. 325 read with s. 149 of the Indian Penal Code.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Prosecution case: Appellants along with others (dismissed workers of Devangiri Cotton Mills and Shri Ganeshar Textiles Mills, office bearers and members of unions) conspired with common object of committing murder and other offences to strengthen their associations, weaken rival unions, create fear in management for more bonus and reinstatement; formed unlawful assembly, armed with deadly weapons, attacked deceased Heggappa and other loyal workers on night of March 19, 1964, causing death of Heggappa and injuries to 4 persons.",
      "type": "material",
      "date": "1964-03-19",
      "source": "prosecution"
    },
    {
      "id": "f3",
      "text": "Sessions Judge by judgment dated December 7, 1964 convicted both appellants for offences under ss. 147, 148, 323, 324 and 325 read with s. 149, Indian Penal Code (acquitted of ss. 307 and 302/149).",
      "type": "procedural",
      "date": "1964-12-07",
      "source": "lower_court"
    },
    {
      "id": "f4",
      "text": "Appellants preferred appeals to Mysore High Court; on admission, directed to be released on bail.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "On March 7, 1966, State made applications under ss. 498(2) and 561A CrPC for cancellation of bail; affidavit by Deputy Superintendent of Police, Devangiri Division Sri K. Srinivasa Alwa stating appellants misusing liberty by acts of violence, instigating labour unions of Devangiri Cotton Mills and Shankara Textile Mills to paralyse mills, constituted as ring leaders, taking part in unlawful assemblies, committed offences against peaceful workers.",
      "type": "procedural",
      "date": "1966-03-07",
      "source": "respondent"
    },
    {
      "id": "f6",
      "text": "Appellants filed counter-affidavit denying misuse of liberty or acts likely to cause breach of peace or endanger lives of workers.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "Mysore High Court on March 14, 1966 allowed State's applications, cancelled bail, ordered rearrest and commitment to jail custody.",
      "type": "procedural",
      "date": "1966-03-14",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Specific incidents: December 31, 1965 Crime No. 360/1965 under ss. 143, 448, 324 IPC; February 11, 1966 Crime No. 53/1966 (one appellant) under ss. 341, 323 IPC; February 12, 1966 Crime No. 54/1966 under ss. 143, 147, 341, 323, 324 IPC.",
      "type": "material",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f9",
      "text": "Supreme Court appeals by special leave from Mysore High Court order dated March 14, 1966 in Criminal Revision Petitions Nos. 120 and 123 of 1966.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether, in the case of a person convicted of a bailable offence where bail has been granted to him under s. 426 of the Criminal Procedure Code, it can be cancelled in a proper case by the High Court in exercise of its inherent power under s. 561A of the Criminal Procedure Code?",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the present case is a proper one for exercise of inherent power under s. 561A to cancel bail.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "After High Court made order under s. 426 CrPC suspending sentence and granting bail, no power to cancel it subsequently; no express power to cancel bail under s. 426, unlike ss. 497(5) and 498(2) for accused persons; omission deliberate, cannot use s. 561A; even if commit further offences, prosecute separately, not cancel bail.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": "s. 426 CrPC; s. 497(5) CrPC; s. 498(2) CrPC; Lala Jairam Das v. King-Emperor"
    },
    {
      "id": "pa2",
      "text": "Ch. XXXIX CrPC together with s. 426 contains complete and exhaustive statement of High Court's powers re bail, excludes inherent power under s. 561A; High Court has no power to grant bail to convicted person under s. 498.",
      "supporting_facts": [],
      "legal_basis": "Lala Jairam Das v. King-Emperor; s. 498 CrPC"
    },
    {
      "id": "pa3",
      "text": "Case does not fall under s. 561A; not proper case to cancel bail.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": "s. 561A CrPC"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Appellants misusing liberty granted on bail by committing acts of violence, instigating unions to paralyse mills, acting as ring leaders in unlawful assemblies, committing offences against peaceful workers.",
      "supporting_facts": [
        "f5",
        "f8"
      ],
      "legal_basis": "ss. 498(2), 561A CrPC"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "No justification for appellants' argument; express provisions in ss. 497, 498 for accused, but lacuna in s. 426 due to oversight/inadvertence, not deliberate; if no power, leads to absurd results (appellant can commit further crimes without bail cancellation); High Court not helpless, can use inherent power under s. 561A in proper case.",
      "addresses_issue": "i1",
      "key_observation": "Omission in s. 426 due to oversight; s. 561A preserves inherent power necessary for ends of justice."
    },
    {
      "id": "cr2",
      "text": "Inherent power under s. 561A exercisable only for three purposes: give effect to orders, prevent abuse of process, secure ends of justice; not if covered by specific provisions or inconsistent.",
      "addresses_issue": "i1",
      "key_observation": "s. 426 lacuna allows s. 561A operation."
    },
    {
      "id": "cr3",
      "text": "Pre-s. 498(2), judicial consensus allowed cancellation under s. 561A (cited cases); Lala Jairam Das distinguished as it concerned grant of bail to convicted person pending SC appeal, not cancellation.",
      "addresses_issue": "i1",
      "key_observation": "Ratio of Lala Jairam Das inapplicable."
    },
    {
      "id": "cr4",
      "text": "Allegations in State's affidavit (supported by specific FIRs) show prima facie abuse of process; High Court entitled to accept State's case over counter-affidavit and cancel bail under s. 561A.",
      "addresses_issue": "i2",
      "key_observation": "Appellants misusing liberty, indulging in violence."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "High Court has inherent power under s. 561A CrPC to cancel order of suspension of sentence and bail granted under s. 426 CrPC and order rearrest and commitment to jail custody, in a proper case.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Present case is proper for exercise of s. 561A as appellants prima facie abusing process by misusing liberty.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Mirza Mohammad Ibrahim v. Emperor",
      "citation": "A.I.R. 1932 All. 534",
      "treatment": "followed",
      "relevance": "Consensus that bail under s. 498(1) can be cancelled under s. 561A even before s. 498(2)."
    },
    {
      "case_name": "Seoti v. Rex",
      "citation": "A.I.R. 1948 All. 366",
      "treatment": "followed",
      "relevance": "Consensus that bail under s. 498(1) can be cancelled under s. 561A."
    },
    {
      "case_name": "Bachchu Lal v. State",
      "citation": "A.I.R. 1951 All. 836",
      "treatment": "followed",
      "relevance": "Consensus that bail under s. 498(1) can be cancelled under s. 561A."
    },
    {
      "case_name": "Munshi Singh v. State",
      "citation": "I.L.R. 1946 Mad. 62",
      "treatment": "followed",
      "relevance": "Consensus that bail under s. 498(1) can be cancelled under s. 561A."
    },
    {
      "case_name": "The Crown Prosecutor, Madras v. Krishnan",
      "citation": "A.I.R. 1962 All. 39",
      "treatment": "followed",
      "relevance": "Consensus that bail under s. 498(1) can be cancelled under s. 561A."
    },
    {
      "case_name": "Lala Jairam Das v. King-Emperor",
      "citation": "72 I.A. 120",
      "treatment": "distinguished",
      "relevance": "HC no power to grant bail to convicted person pending SC appeal under CrPC; does not apply to cancellation power under s. 561A."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "147",
        "148",
        "307",
        "323",
        "302/149",
        "325/149",
        "143",
        "448",
        "324",
        "341"
      ],
      "relevance": "Offences for which appellants convicted and alleged further offences while on bail."
    },
    {
      "name": "Code of Criminal Procedure",
      "sections": [
        "426",
        "496",
        "497",
        "498",
        "561A"
      ],
      "relevance": "Provisions on bail, suspension of sentence pending appeal, cancellation of bail, inherent powers of High Court."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court dismissed the appeals, upholding the Mysore High Court's order cancelling bail granted under s. 426 CrPC using inherent powers under s. 561A, as appellants were misusing liberty.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "If the contention of the appellants is sound it will lead to fantastic results. The argument is that once an order of suspension of sentence is made under s. 426 by the appellate court and the appellant is ordered to be released on bail. the subsequent conduct of the appellant. howsoever reprehensible it may be. cannot justify the appellate court in revoking the order of bail.",
      "speaker": "court",
      "significance": "Illustrates absurdity of no cancellation power, justifying use of s. 561A."
    },
    {
      "text": "We are, therefore, of the opinion that in a proper case the High Court has inherent power under s. 561 A. Criminal Procedure Code to cancel the order of suspension of sentence and grant of bail to the appellant made under s. 426.",
      "speaker": "court",
      "significance": "Core holding on High Court's power."
    },
    {
      "text": "In our opinion, the allegations made against the appellants would prima facie indicate abuse of the process of the Court and the provisions of s. 561A are attracted to the case and the High Court was entitled to cancel the bail of the appellants.",
      "speaker": "court",
      "significance": "Justifies application to facts."
    }
  ],
  "_case_id": "1966_161",
  "_label": 0,
  "_text_length": 19575,
  "_extracted_at": "2026-02-10T19:40:15.316504"
}