{
  "metadata": {
    "case_name": "Appellant v. Respondent",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "Bachawat, J."
    ],
    "case_number": "Civil Appeal No. 615 of 1964",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The appellant, the respondent and two other persons carried on business in partnership under the name and style of Nayagaon Farm.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The respondent was the managing partner and was incharge of the partnership assets.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The firm was dissolved and a suit was instituted by the appellant for the taking of the accounts of the dissolved firm.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Eventually a final decree was passed in the suit in favour of the appellant against the respondent for Rs. 17,143/11/0 and Rs. 3,171/6 as on account of companys.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The appellant applied for execution of the decree by arrest and detention of the respondent in prison.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "In this affidavit in support of the application, the appellant relied upon the grounds mentioned in clauses a and b of the proviso to s. 51 of the Code of Civil Procedure 1908.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "At the hearing of the application those grounds were number pressed but his companynsel relied upon the ground mentioned in cl. c of the proviso.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "The executing companyrt held that the provisions of cl. c were satisfied and issued a warrant for the arrest of the respondent.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "On appeal, the High Court of Allahabad, set aside this order.",
      "type": "procedural",
      "date": "1960-03-03",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "The decree holder number appeals to this companyrt under a certificate granted by the High Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the decree is for a sum for which the judgment debtor was bound in a fiduciary capacity to account, so as to empower execution by detention in prison under cl. c of the proviso to s. 51 CPC.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The respondent as the managing partner of the firm was bound in a fiduciary capacity to account for the assets of the partnership in his hands and the decree against him must be regarded as a decree for a sum for which he was bound in a fiduciary capacity to account.",
      "supporting_facts": [
        "f2",
        "f4"
      ],
      "legal_basis": "ss. 9, 15, 18, 46 of the Indian Partnership Act 1932 and ss. 88, 94 and 95 of the Indian Trusts Act 1882"
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Partnership itself does number create a fiduciary relation between the partners or make one of them a trustee for the other or for his representatives. The relation may, however, arise on the death of one of them or be created by other special circumstances.",
      "addresses_issue": "i1",
      "key_observation": "This statement of law is companysistent with the provisions of the Indian Partnership Act 1932 and the Indian Trusts Act 1882."
    },
    {
      "id": "cr2",
      "text": "In Piddocke v. Burt, Chitty, J. held that a partner failing to pay moneys in his hands and received by him on account of the partnership was number liable to be imprisoned under s. 43 of the Debtors Act 1869 as a person acting in a fiduciary capacity within the meaning of that statute.",
      "addresses_issue": "i1",
      "key_observation": "I should be straining the law if I were to hold that a partner receiving money on account of the partnership-that is, on behalf of himself and his companypartners- received it in a fiduciary capacity towards the other partners."
    },
    {
      "id": "cr3",
      "text": "The last case received the approval observe the utmost good faith in his dealings with the other partners. He is bound to render accounts of the partnership assets in his hands. But in the absence of special circumstances he cannot be regarded as a kind of trustee for the other partners or liable to render accounts to them in a fiduciary capacity.",
      "addresses_issue": "i1",
      "key_observation": "In the present case, the respondent as the managing partner was liable to render accounts of the partnership assets in his hands."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "A managing partner is bound to observe the utmost good faith and render accounts but in the absence of special circumstances is not a trustee or liable in a fiduciary capacity for execution by detention under cl. c proviso to s.51 CPC.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Piddocke v. Burt",
      "citation": "1894 1 Ch. 343",
      "treatment": "followed",
      "relevance": "Partner receiving money on account of partnership not in fiduciary capacity for imprisonment."
    },
    {
      "case_name": "Rodriguez v. Speyer Brothers",
      "citation": null,
      "treatment": "followed",
      "relevance": "Approved Piddocke v. Burt (Lord Atkinson)."
    },
    {
      "case_name": "Bhuban Mohan Rana v. Surender Mohan Das",
      "citation": null,
      "treatment": "followed",
      "relevance": "Approved Piddocke; partner must observe good faith but not fiduciary absent special circumstances (Harries, C.J.)."
    }
  ],
  "statutes_cited": [
    {
      "name": "Code of Civil Procedure, 1908",
      "sections": [
        "s. 51 (proviso cl. c)"
      ],
      "relevance": "Empowers execution of money decree by detention if JD bound in fiduciary capacity to account."
    },
    {
      "name": "Indian Partnership Act, 1932",
      "sections": [
        "ss. 9",
        "15",
        "18",
        "46"
      ],
      "relevance": "Cited by appellant; consistent with no fiduciary relation per se between partners."
    },
    {
      "name": "Indian Trusts Act, 1882",
      "sections": [
        "ss. 88",
        "94",
        "95"
      ],
      "relevance": "Cited by appellant; consistent with no fiduciary relation per se between partners."
    },
    {
      "name": "Debtors Act, 1869",
      "sections": [
        "s. 43"
      ],
      "relevance": "Applied in Piddocke v. Burt to deny fiduciary capacity for partner."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court upheld the Allahabad High Court's order setting aside the executing court's warrant for arrest of the respondent under cl. c proviso to s.51 CPC, as the managing partner was not held to be in a fiduciary capacity absent special circumstances.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "Partnership itself does number create a fiduciary relation between the partners or make one of them a trustee for the other or for his representatives.",
      "speaker": "court",
      "significance": "Core holding on absence of fiduciary relation in partnerships per se."
    },
    {
      "text": "I should be straining the law if I were to hold that a partner receiving money on account of the partnership... received it in a fiduciary capacity towards the other partners.",
      "speaker": "court",
      "significance": "Quote from Piddocke v. Burt explaining no fiduciary capacity."
    }
  ],
  "_case_id": "1966_139",
  "_label": 0,
  "_text_length": 4534,
  "_extracted_at": "2026-02-10T19:40:09.253592"
}