{
  "metadata": {
    "case_name": "Padmanabha Setty v. K. P. Papiah Setty",
    "case_year": 1965,
    "court": "Supreme Court of India",
    "judges": [
      "Sikri, J."
    ],
    "case_number": "Civil Appeal No. 756 of 1965",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Padmanabha Setty is the tenant of non-residential premises No. 281, Old Tharagupet, Bangalore City, and had installed some machinery in the premises.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "K. P. Papiah Setty, the landlord, purchased the premises for his own use and occupation to shift his business from a rented building to the premises in dispute.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Landlord filed application under s.8(3)(a)(ii) of the Mysore House Rent and Accommodation Control Act, 1951 for eviction of tenant on ground of requiring premises for own business use.",
      "type": "procedural",
      "date": null,
      "source": "landlord"
    },
    {
      "id": "f4",
      "text": "First Munsiff, Bangalore directed eviction of the tenant.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "III Additional District Judge, Bangalore set aside the Munsiff's order, finding landlord required premises bona fide but held under s.8(3)(a)(ii) landlord not entitled unless prepared to vacate shops in which trading.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "Landlord filed Civil Revision Petition No. 1044 of 1962 under s.17 of the Act in Mysore High Court.",
      "type": "procedural",
      "date": null,
      "source": "landlord"
    },
    {
      "id": "f7",
      "text": "Mysore High Court on April 9, 1965 set aside order of III Additional District Judge, following S. G. Narayanappa and Bros. v. A. N. Narasimhiah.",
      "type": "procedural",
      "date": "1965-04-09",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Tenant obtained special leave to appeal to Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Construction of s.8(3)(a)(ii) of the Mysore House Rent and Accommodation Control Act, 1951: whether landlord entitled to possession of non-residential building if in occupation of another non-residential building as tenant (not owner).",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether High Court was right in setting aside order of Additional District Judge in revision under s.17 of the Act.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Construction of s.8(3)(a)(ii) by Mysore High Court erroneous; Madras High Court construction in V. Thanappa Chetty v. Arcot Govindaswami Naicker correct.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "s.8(3)(a)(ii) of Mysore Act; V. Thanappa Chetty v. Arcot Govindaswami Naicker (AIR 1952 Mad. 553)"
    },
    {
      "id": "pa2",
      "text": "High Court not right in setting aside Additional District Judge's order in revision under s.17.",
      "supporting_facts": [
        "f5",
        "f7"
      ],
      "legal_basis": "s.17 of the Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Landlord entitled to eviction under s.8(3)(a)(ii) without needing to vacate tenanted premises.",
      "supporting_facts": [
        "f2",
        "f3"
      ],
      "legal_basis": "s.8(3)(a)(ii); S. G. Narayanappa and Bros. v. A. N. Narasimhiah (1962 Mys. L.J. 76)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Tenant under the Act has statutory immunity from eviction, not a right to possession; cannot be equated to entitlement to possession.",
      "addresses_issue": "i1",
      "key_observation": "A tenant who can be evicted under conditions in s.8(2) cannot be said to be entitled to possession."
    },
    {
      "id": "cr2",
      "text": "Words 'entitled to possession' in s.8(3)(a)(ii) have positive content akin to owner's right; landlord need not vacate tenanted premises to claim own premises.",
      "addresses_issue": "i1",
      "key_observation": "Object of Act is to prevent unreasonable evictions; unreasonable to deny landlord shift to own premises while in precarious tenanted position."
    },
    {
      "id": "cr3",
      "text": "Agrees with Mysore HC in S. G. Narayanappa (Ahmed Ali Khan, J.); dissents from Madras HC (Subba Rao, J.) with respect.",
      "addresses_issue": "i1",
      "key_observation": "Immunity from eviction restricts landlord's right but does not create tenant's right to possession."
    },
    {
      "id": "cr4",
      "text": "High Court jurisdiction under s.17 limited, but Additional District Judge acted with material irregularity by not following Mysore HC decision in same matter.",
      "addresses_issue": "i2",
      "key_observation": "High Court not wrong in interfering."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Under s.8(3)(a)(ii), landlord not disentitled if occupying non-residential building as tenant; 'entitled to possession' requires owner-like right, not mere tenancy.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "High Court correct in setting aside Additional District Judge's order in revision under s.17.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "S. G. Narayanappa and Bros. v. A. N. Narasimhiah",
      "citation": "1962 Mys. L.J. 76",
      "treatment": "followed",
      "relevance": "Correct construction of s.8(3)(a)(ii); tenant has immunity, not right to possession."
    },
    {
      "case_name": "V. Thanappa Chetty v. Arcot Govindaswami Naicker",
      "citation": "AIR 1952 Mad. 553",
      "treatment": "distinguished",
      "relevance": "Erroneous view that tenant's statutory immunity equals entitlement to possession under similar Madras provision."
    },
    {
      "case_name": "Kai Khushrao v. Bai Jerbai",
      "citation": "AIR 1949 FC 124",
      "treatment": "referred",
      "relevance": "Statutory immunity from eviction is not right to possession."
    }
  ],
  "statutes_cited": [
    {
      "name": "Mysore House Rent and Accommodation Control Act, 1951 (Mysore Act 30 of 1951)",
      "sections": [
        "s.2(9)",
        "s.4",
        "s.5",
        "s.6",
        "s.7",
        "s.7A",
        "s.7B",
        "s.7C",
        "s.8(2)",
        "s.8(3)(a)(ii)",
        "s.17"
      ],
      "relevance": "Regulates eviction; s.8(3)(a)(ii) allows landlord eviction for own business use if not entitled to possession of another non-residential building; tenant has no right to possession, only immunity."
    },
    {
      "name": "Madras Buildings (Lease and Rent Control) Act, 1946 (Madras Act 15 of 1946)",
      "sections": [],
      "relevance": "Similar provision interpreted differently by Madras HC."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal by special leave dismissed; High Court order upheld allowing landlord's eviction application under s.8(3)(a)(ii).",
    "relief_granted": "Eviction of tenant upheld in favor of landlord.",
    "costs": "Dismissed with costs."
  },
  "key_quotes": [
    {
      "text": "\"A tenant who can be evicted under the conditions prescribed in s.8(2) of the Act cannot be said... to be entitled to the possession of the premises.\"",
      "speaker": "court",
      "significance": "Core holding distinguishing immunity from right to possession."
    },
    {
      "text": "\"The words 'entitled to possession' have a more positive content and are more akin to the right of possession which an owner has.\"",
      "speaker": "court",
      "significance": "Interprets key phrase in s.8(3)(a)(ii)."
    }
  ],
  "_case_id": "1966_295",
  "_label": 0,
  "_text_length": 14875,
  "_extracted_at": "2026-02-10T19:42:16.322239"
}