{
  "metadata": {
    "case_name": "Wazirchand Mahajan & Anr. v. Union of India",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "Shah, J."
    ],
    "case_number": "Civil Appeal No. 601 of 1964",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Under an agreement dated November 1, 1950, with the State of Himachal Pradesh, Triloknath Mahajan-second appellant-purchased the right to extract and collect certain medicinal herbs from the forests of Chamba District. The period of the agreement was one year from September 1, 1950.",
      "type": "background",
      "date": "1950-11-01",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "By cl. 22 of the agreement it was provided that all disputes between the parties arising under the agreement or under any clause thereunder or in any manner connected with or arising out of the agreement or the operation thereof, or the rights, duties or liabilities of either parties thereunder including the dispute or difference as to the construction of the agreement shall be referred to the sole arbitration of the Deputy Commissioner, Mandi District, Himachal Pradesh, and if that officer be unable or unwilling to act, to such Assistant as the Deputy Commissioner shall appoint as the sole arbitrator.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Triloknath Mahajan transferred all his rights, title and interest under the agreement to Wazirchand Mahajan-the first appellant-with the permission of the State of Himachal Pradesh.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Disputes arose in October 1950 between the appellants and the State of Himachal Pradesh regarding the right to collect herbs from certain areas and the failure of the State authorities to prevent trespassers from removing herbs, the right to which was granted to the second appellant.",
      "type": "disputed",
      "date": "1950-10",
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "The appellants addressed a letter on May 30, 1952 to the Chief Conservator of Forests, Himachal Pradesh, requiring that Officer to submit the matters in difference to the arbitration of the Deputy Commissioner, Mandi District.",
      "type": "procedural",
      "date": "1952-05-30",
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "By his reply dated June 23, 1952, the Chief Conservator declined to agree to a reference contending that the matters desired to be referred to were outside the arbitration clause.",
      "type": "procedural",
      "date": "1952-06-23",
      "source": "respondent"
    },
    {
      "id": "f7",
      "text": "On June 22, 1955 the appellants applied to the District Court of Chamba for an order that the agreement dated November 1, 1950 be filed in the Court and that the disputes between them and the State be referred to the sole arbitration of the Deputy Commissioner, Mandi District.",
      "type": "procedural",
      "date": "1955-06-22",
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "The State of Himachal Pradesh contended, inter alia, that the application for filing the arbitration agreement was barred by the law of limitation as the right to apply, if any, arose in the year 1950 and not on June 23, 1952, as alleged.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f9",
      "text": "The Court of First Instance held that the Limitation Act did not govern an application for filing an arbitration agreement under s. 20 of the Arbitration Act, 1940, and that even if the application was governed by Art. 181 of Sch. 1 of the Limitation Act, 1908, since the application was made within three years from the date on which the Chief Conservator of Forests, Himachal Pradesh, declined to make a reference, it was not barred. The Court accordingly ordered that the agreement be filed and the disputes be referred to the arbitrator named in the agreement.",
      "type": "procedural",
      "date": "1958",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "During the pendency of this application before the Trial Court, the Part C State of Himachal Pradesh became Union Territory, and the Union of India was substituted as a party in place of the State of Himachal Pradesh.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "In appeal by the Union of India, the Judicial Commissioner, Himachal Pradesh, reversed the order of the Trial Court dated May 27, 1961. In the view of the Judicial Commissioner an application for filing an arbitration agreement under s. 20 of the Arbitration Act is governed by Art. 181 of the Limitation Act, and since the period of three years prescribed thereby commences to run from the date on which the differences arose between the parties, i.e., about the month of September-October 1950, and in any case on September 1, 1951, the application for reference filed by the appellants was barred.",
      "type": "procedural",
      "date": "1961-05-27",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Appeal from the judgment and order dated May 27, 1961 of the Judicial Commissioner, Himachal Pradesh, in first Civil Appeal Order No. 16 of 1958.",
      "type": "procedural",
      "date": "1961-05-27",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether an application for filing an arbitration agreement under s. 20 of the Arbitration Act, 1940 is governed by Art. 181 of the Limitation Act, 1908, and if so, from when the period of limitation commences to run.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether s. 37(1) of the Arbitration Act, 1940 applies to an application under s. 20 for filing the agreement, such that the court decides limitation.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The Limitation Act did not govern an application for filing an arbitration agreement under s. 20 of the Arbitration Act, 1940, and even if governed by Art. 181, the application was made within three years from the date on which the Chief Conservator declined to make a reference on June 23, 1952.",
      "supporting_facts": [
        "f5",
        "f6",
        "f7",
        "f9"
      ],
      "legal_basis": "Arbitration Act, 1940 s.20; Limitation Act, 1908 Art.181"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The application for filing the arbitration agreement was barred by Art. 181 of the Limitation Act, as the right to apply arose in 1950, or at latest June 23, 1952, but period commences from when differences arose in September-October 1950 or September 1, 1951.",
      "supporting_facts": [
        "f4",
        "f8",
        "f11"
      ],
      "legal_basis": "Limitation Act, 1908 Art.181; Arbitration Act, 1940"
    },
    {
      "id": "ra2",
      "text": "S.37(1) of Arbitration Act indicates contrary intention that Limitation Act applies.",
      "supporting_facts": [],
      "legal_basis": "Arbitration Act, 1940 s.37(1)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Art. 181 of Limitation Act, 1908 governs only applications under the Code of Civil Procedure for which no period is provided elsewhere; catena of authorities hold expression 'under the Code of Civil Procedure' implicit.",
      "addresses_issue": "i1",
      "key_observation": "Long catena of decisions added words 'under the Code' to Art.181."
    },
    {
      "id": "cr2",
      "text": "Amendment to Arts.158 and 178 by Arbitration Act 1940 did not change interpretation of Art.181 which prevailed for 60 years.",
      "addresses_issue": "i1",
      "key_observation": "Reason for implying 'under the Code' in Art.181 did not disappear entirely."
    },
    {
      "id": "cr3",
      "text": "S.37(1) Arbitration Act provides Limitation Act applies to arbitrations as to court proceedings, meaning arbitrator applies Limitation Act to claims referred; does not govern court application under s.20 to file agreement.",
      "addresses_issue": "i2",
      "key_observation": "Court not concerned with whether claim barred by limitation in s.20 application; that is for arbitrator."
    },
    {
      "id": "cr4",
      "text": "In s.20 application, court checks existence of valid subsisting written agreement before suit, and dispute within jurisdiction; limitation question for arbitrator.",
      "addresses_issue": "i1",
      "key_observation": "Judicial Commissioner erred in rejecting application as barred."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Application under s.20 Arbitration Act not governed by Art.181 Limitation Act as it is not under Code of Civil Procedure; court does not decide limitation, arbitrator does.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "S.37(1) Arbitration Act applies Limitation Act to arbitrator's decision on referred disputes, not to court's s.20 application.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Hansraj Gupta and Others v. Official Liquidators of the Dehradun-Mussoorie Electric Tramway Company Ltd.",
      "citation": null,
      "treatment": "followed",
      "relevance": "Art.181 only relates to applications under Code of Civil Procedure."
    },
    {
      "case_name": "Bai Manekbai v. Manekji Kayasji",
      "citation": "I.L.R. 7 Bom. 213",
      "treatment": "followed",
      "relevance": "Series of authorities starting here holding Art.181 limited to CPC applications."
    },
    {
      "case_name": "Sha Mulchand Company Ltd. In liquidation v. Jawahar Mills Ltd.",
      "citation": "1953 S.C.R. 351",
      "treatment": "followed",
      "relevance": "Catena of decisions added 'under the Code' to Art.181."
    },
    {
      "case_name": "Bombay Gas Company Ltd. v. Gopal Bhiva Others",
      "citation": "1964 3 S.C.R. 709",
      "treatment": "followed",
      "relevance": "Art.181 applies only to applications under Code of Civil Procedure."
    },
    {
      "case_name": "Ramdutt Ramkissen-dass v. F. D. Sasson and Company",
      "citation": "L.R. 561. 128",
      "treatment": "referred",
      "relevance": "Genesis of s.37 Arbitration Act; Limitation applies to arbitrator as implicit in contract."
    }
  ],
  "statutes_cited": [
    {
      "name": "Arbitration Act, 1940",
      "sections": [
        "s.20",
        "s.37(1)"
      ],
      "relevance": "Application to file agreement and refer disputes; Limitation applies to arbitrations as court proceedings but court does not decide limitation on s.20 app."
    },
    {
      "name": "Limitation Act, 1908",
      "sections": [
        "Art.181",
        "Arts.158",
        "178"
      ],
      "relevance": "Art.181 applies only to CPC applications; amended for Arbitration Act."
    },
    {
      "name": "Code of Civil Procedure, 1908",
      "sections": [
        "Sch. II"
      ],
      "relevance": "Previously governed consensus arbitration, repealed by Arbitration Act 1940."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; order of Judicial Commissioner set aside; order of Trial Court directing filing of arbitration agreement dated November 1, 1950 and reference of disputes to arbitrator restored.",
    "relief_granted": "Filing of arbitration agreement and reference to arbitration of Deputy Commissioner, Mandi District.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"Art. 181 of the Limitation Act, 1908, governed applications under the Code of Civil Procedure.\"",
      "speaker": "court",
      "significance": "Core holding limiting scope of Art.181."
    },
    {
      "text": "\"In dealing with an application for filing an arbitration agreement, the Court must satisfy itself about the existence of a written agreement which is valid and subsisting... But the Court is not concerned... to deal with the question whether the claim... is barred by the law of limitation.\"",
      "speaker": "court",
      "significance": "Defines court's role under s.20 vs arbitrator's on limitation."
    },
    {
      "text": "\"This long catena of decisions may well be said to have, as it were, added the words 'under the Code' in the first column of that article.\"",
      "speaker": "court",
      "significance": "Explains judicial gloss on Art.181 from precedents."
    }
  ],
  "_case_id": "1966_211",
  "_label": 1,
  "_text_length": 12928,
  "_extracted_at": "2026-02-10T19:41:01.227645"
}