{
  "metadata": {
    "case_name": "Appellants (Vendees) v. Respondents (Pre-emptors)",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "Wanchoo, J."
    ],
    "case_number": "Civil Appeal No. 822 of 1963",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The property in suit consisted of agricultural land as well as some baras in village Jalalpur.",
      "type": "background",
      "date": null,
      "source": "courts below"
    },
    {
      "id": "f2",
      "text": "Punnu Singh and Mansha Singh, who were parties to the suit as defendants, sold the property in suit on January 15, 1955 to the appellants (vendees).",
      "type": "material",
      "date": "1955-01-15",
      "source": "courts below"
    },
    {
      "id": "f3",
      "text": "Consolidation proceedings took place in this village and came to an end before the present suit was filed on January 14, 1956.",
      "type": "procedural",
      "date": null,
      "source": "courts below"
    },
    {
      "id": "f4",
      "text": "Of the vendees, six had no share in the village from before while four already had some share in the village.",
      "type": "background",
      "date": null,
      "source": "courts below"
    },
    {
      "id": "f5",
      "text": "As a result of the consolidation proceedings, six of the vendees who had no share in the village from before were allotted other land in place of the land which they had purchased under the sale-deed.",
      "type": "material",
      "date": null,
      "source": "courts below"
    },
    {
      "id": "f6",
      "text": "The other four vendees who had some share in the village from before were allotted land in two blocks in lieu of the land they had in the village from before as well as the land which they had purchased by the sale deed in question.",
      "type": "material",
      "date": null,
      "source": "courts below"
    },
    {
      "id": "f7",
      "text": "The plaintiffs-respondents instituted the suit on the basis of their being collaterals and co-sharers and wanted that they should be given out of the land allotted to the vendees in consolidation proceedings such land as they would be entitled to after pre-emption of the sale in question.",
      "type": "procedural",
      "date": "1956-01-14",
      "source": "respondents"
    },
    {
      "id": "f8",
      "text": "The trial court held in favour of the plaintiffs-respondents and granted a decree for pre-emption.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "On appeal to the Punjab High Court in Regular First Appeal No. 32 of 1957, the High Court dismissed the appeal by judgment and decree dated April 7, 1961.",
      "type": "procedural",
      "date": "1961-04-07",
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the suit was maintainable with respect to the land which had been obtained by the vendees during consolidation proceedings in lieu of the land which was the subject matter of the sale deed, depending upon the interpretation of s. 24 of the Patiala and East Punjab States Union Holdings Consolidation and Prevention of Fragmentation Act, No. 5 of 2007 Bk.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether for four vendees who had land from before, it was not possible to distinguish which land had been allotted to them in place of the land sold and therefore no pre-emption decree should be granted.",
      "framed_by": "appellants"
    },
    {
      "id": "i3",
      "text": "Whether the form of the decree is incorrect.",
      "framed_by": "appellants"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The suit is not maintainable as it is not open to the pre-emptor to follow the land which might have been obtained by the vendees in lieu of the land actually sold to them; the pre-emptor's remedial right is merely to follow the thing sold, namely, the very property which is the subject-matter of the sale-deed.",
      "supporting_facts": [
        "f2",
        "f5",
        "f6"
      ],
      "legal_basis": "Bishan Singh v. Khazan Singh, 1959 S.C.R. 878"
    },
    {
      "id": "pa2",
      "text": "In the case of four appellants who had land from before in the village, it was not possible to distinguish which land had been allotted to them in place of the land sold.",
      "supporting_facts": [
        "f4",
        "f6"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "The form of the decree is incorrect as the trial court stated it does not mean that the land is not distinguishable and can be considered during execution.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": null
    },
    {
      "id": "pa4",
      "text": "Section 25 of the Act specifically provides for rights with respect to a lease, mortgage or other encumbrance to attach to the land allotted, showing no other rights were intended to survive.",
      "supporting_facts": [
        "f5",
        "f6"
      ],
      "legal_basis": "Section 25 of the Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "It was open to the pre-emptor to follow the land which had been given to the vendees in consolidation proceedings in lieu of the land which was the subject matter of the sale deed.",
      "supporting_facts": [
        "f5",
        "f6",
        "f7"
      ],
      "legal_basis": "S. 24 of the Patiala and East Punjab States Union Holdings Consolidation and Prevention of Fragmentation Act, No. 5 of 2007 Bk."
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The right of pre-emption is an incident of property and attaches to the land itself; the benefit as well as the burden run with the land.",
      "addresses_issue": "i1",
      "key_observation": "Cited Shri Audh Behari Singh v. Gajadhar Jaipuria"
    },
    {
      "id": "cr2",
      "text": "Section 24 provides that a land-owner or tenant at will shall have the same right in the land allotted to him in pursuance of the scheme of consolidation as he had in his original holding or tenancy; this preserves both rights and obligations attached to the original holding.",
      "addresses_issue": "i1",
      "key_observation": "Obligations like pre-emption disability continue to attach to substituted land"
    },
    {
      "id": "cr3",
      "text": "Bishan Singh v. Khazan Singh does not affect the earlier view that pre-emption attaches to the land; ordinarily follows the sold property, but S.24 expands this to substituted land.",
      "addresses_issue": "i1",
      "key_observation": "Pre-emptor can enforce against land allotted in lieu if right exists on sale, suit, and decree dates"
    },
    {
      "id": "cr4",
      "text": "Section 25 is specific for leases/mortgages/encumbrances which do not automatically attach to new land, unlike incidents of ownership like pre-emption liability which continue per S.24.",
      "addresses_issue": "i1",
      "key_observation": "S.25 does not negative S.24 implications"
    },
    {
      "id": "cr5",
      "text": "No difficulty in finding out how much of the land allotted to four vendees pertains to the sold land, as land is valued for allotment purposes in consolidation.",
      "addresses_issue": "i2",
      "key_observation": "Distinguishable based on valuation"
    },
    {
      "id": "cr6",
      "text": "Point on form of decree not permitted as not raised in High Court.",
      "addresses_issue": "i3",
      "key_observation": "New point rejected"
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "By virtue of S.24, pre-emptor has right to pre-empt land allotted to vendees in consolidation proceedings in lieu of the land subject to the sale-deed, as pre-emption right/obligation runs with the land.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Land allotted to four vendees with prior holdings can be distinguished based on consolidation valuation.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Shri Audh Behari Singh v. Gajadhar Jaipuria",
      "citation": "1955 S.C.R. 70",
      "treatment": "followed",
      "relevance": "Right of pre-emption is incident of property, attaches to land, benefit and burden run with land"
    },
    {
      "case_name": "Bishan Singh v. Khazan Singh",
      "citation": "1959 S.C.R. 878",
      "treatment": "referred",
      "relevance": "Pre-emptor has primary right to offer and secondary remedial right to follow thing sold; does not negate attachment to land"
    }
  ],
  "statutes_cited": [
    {
      "name": "Patiala and East Punjab States Union Holdings (Consolidation and Prevention of Fragmentation) Act, No. 5 of 2007 Bk.",
      "sections": [
        "24",
        "25"
      ],
      "relevance": "S.24 preserves same rights and obligations (including pre-emption disability) in allotted land as in original holding; S.25 specific for leases etc., does not limit S.24"
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal by special leave against the Punjab High Court's decree upholding the trial court's pre-emption decree is dismissed, confirming pre-emptors' right to pre-empt substituted land under S.24 of the Act.",
    "relief_granted": "None; lower courts' decree upheld",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"The right of preemption is an incident of property and attaches to the land itself.\"",
      "speaker": "court",
      "significance": "Core principle that pre-emption runs with land, enabling following substituted land"
    },
    {
      "text": "\"A land-owner or a tenant at will shall have the same right in the land allotted to him in pursuance of the scheme of consolidation as he had in his original holding or tenancy as the case may be.\"",
      "speaker": "court",
      "significance": "Direct quote of S.24, basis for preserving obligations like pre-emption"
    },
    {
      "text": "\"The law of preemption imposes a limitation or disability upon the ownership of a property to the extent that it restricts the owners unfettered right of sale.\"",
      "speaker": "court",
      "significance": "Explains nature of pre-emption as disability running with land"
    }
  ],
  "_case_id": "1966_200",
  "_label": 0,
  "_text_length": 12041,
  "_extracted_at": "2026-02-10T19:41:03.981798"
}