{
  "metadata": {
    "case_name": "Kantamani Venkata Narayana & Sons v. Income Tax Officer",
    "case_year": 1966,
    "court": "Supreme Court of India",
    "judges": [
      "Shah, J."
    ],
    "case_number": "Civil Appeals Nos. 154 to 165 of 1966",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Ms. Kantamani Venkata Narayana Sons is a Hindu undivided family assessed to tax on income derived principally from money-lending.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "In the course of proceedings for assessment of Motu Industries Ltd., the Income-tax Officer, Rajahmundry discovered a large accretion to the wealth of the assessee which had not been disclosed in its assessment proceedings.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On March 12, 1959, the Income-tax Officer issued a notice seeking to reopen the assessment for the year 1950-51. The assessee filed a return under protest.",
      "type": "procedural",
      "date": "1959-03-12",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On March 14, 1960, the Income-tax Officer issued notice of re-assessment for the year 1951-52.",
      "type": "procedural",
      "date": "1960-03-14",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "On December 19, 1960, the Income-tax Officer intimated the reasons that had prompted him to issue the notices of re-assessment.",
      "type": "procedural",
      "date": "1960-12-19",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "On March 24, 1962, the Income-tax Officer issued notices under s. 34 for re-assessment of income for the years 1940-41 to 1949-50.",
      "type": "procedural",
      "date": "1962-03-24",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "The assessee presented petitions in the High Court of Andhra Pradesh for writs of prohibition directing the Income-tax Officer to refrain from proceeding in pursuance of the notices for assessment years 1940-41 to 1949-50, 1950-51 and 1951-52.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "A single Judge of the High Court rejected the petitions and the order was confirmed in appeal by a Division Bench of the High Court on February 3, 1965.",
      "type": "procedural",
      "date": "1965-02-03",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "The assessee appealed to the Supreme Court with special leave.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Scrutiny of money-lending statements for years ended 31-3-50 and 31-3-51 revealed large investments in money-lending business. Assessee did not file balance sheets for those years or earlier.",
      "type": "material",
      "date": null,
      "source": "income_tax_officer"
    },
    {
      "id": "f11",
      "text": "In 1949-50, total investments in money-lending increased by Rs. 1,33,000/- and in 1950-51 by Rs. 49,000/-.",
      "type": "material",
      "date": null,
      "source": "income_tax_officer"
    },
    {
      "id": "f12",
      "text": "Assessee's plea of growth due to cash from partition share and gifts from father-in-law not supported by evidence; deed of partition not produced; account books prior to April 1, 1949 suppressed.",
      "type": "disputed",
      "date": null,
      "source": "income_tax_officer"
    },
    {
      "id": "f13",
      "text": "Net wealth on April 1, 1937 less than Rs. 50,000/- including Rs. 21,000/- investments; aggregate income from 1937-38 to 1948-49 around Rs. 30,000/- plus manager's professional and agricultural income not exceeding Rs. one lakh.",
      "type": "material",
      "date": null,
      "source": "income_tax_officer"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the Income-tax Officer had jurisdiction to issue notices under s. 34(1)(a) of the Income-tax Act for reassessment, i.e., whether he had reason to believe that due to non-disclosure of material facts by the assessee, income had escaped assessment.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the notice under s. 34 must specifically refer to s. 34(1)(a) or set out the clause under which it is issued.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Account books and statements of account were produced year after year; Income-tax Officer computed taxable income on materials furnished; no case for exercising power under s. 34 as it would be mere change of opinion.",
      "supporting_facts": [
        "f10"
      ],
      "legal_basis": "s. 34 Income-tax Act"
    },
    {
      "id": "pa2",
      "text": "Notice did not specifically refer to s. 34(1)(a) or set out the clause.",
      "supporting_facts": [
        "f3",
        "f4",
        "f6"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "High Court did not decide if primary facts were not disclosed.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Information from scrutiny of money-lending statements showed large unexplained investments and accretion to wealth disproportionate to known sources; assessee failed to disclose fully and truly material facts; no evidence for partition, gifts, etc.",
      "supporting_facts": [
        "f2",
        "f10",
        "f11",
        "f12",
        "f13"
      ],
      "legal_basis": "s. 34(1)(a) Income-tax Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Notice under s. 34 need not specify clause (a) or (b); main notice is under s. 22(2), s. 34 authorizes it.",
      "addresses_issue": "i2",
      "key_observation": "Proceeding not vitiated for lack of specific reference."
    },
    {
      "id": "cr2",
      "text": "For s. 34(1)(a), ITO must have reason to believe income escaped due to non-disclosure of material facts; belief must be in good faith with rational connection, but sufficiency not justiciable.",
      "addresses_issue": "i1",
      "key_observation": "Two conditions: under-assessment and due to non-disclosure."
    },
    {
      "id": "cr3",
      "text": "ITO's affidavit shows prima facie reason to believe non-disclosure based on large investments, unexplained wealth accretion, lack of evidence for sources.",
      "addresses_issue": "i1",
      "key_observation": "Affidavits establish jurisdiction."
    },
    {
      "id": "cr4",
      "text": "Mere production of books does not amount to full disclosure; assessee must bring material facts to notice; Explanation confirms this.",
      "addresses_issue": "i1",
      "key_observation": "Duty not discharged by mere production."
    },
    {
      "id": "cr5",
      "text": "High Court correctly found prima facie evidence of non-disclosure; no need for enquiry at this stage.",
      "addresses_issue": "i1",
      "key_observation": "Writs properly rejected."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Income-tax Officer had reason to believe that by reason of omission or failure to disclose fully and truly material facts, income escaped assessment, justifying notices under s. 34(1)(a).",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Notice under s. 34 need not specify the clause.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "P. R. Mukherjee v. Commissioner of Income-tax West Bengal",
      "citation": "30 I.T.R. 535",
      "treatment": "followed",
      "relevance": "Notice under s. 34 need not specify clause (a) or (b)."
    },
    {
      "case_name": "Calcutta Discount Company Ltd. v. Income-tax Officer, Companies District I and Another",
      "citation": "1961 2 S.C.R. 241",
      "treatment": "followed",
      "relevance": "Conditions for issuing notice under s. 34(1)(a): reason to believe under-assessment due to non-disclosure; adequacy of grounds not justiciable."
    },
    {
      "case_name": "S. Narayanappa Others v. The Commissioner of Income-tax, Bangalore",
      "citation": "1967 1 S.C.R. 596",
      "treatment": "followed",
      "relevance": "Reasonable grounds for belief in non-disclosure suffice; existence of belief challengeable but not sufficiency; belief must have rational connection."
    }
  ],
  "statutes_cited": [
    {
      "name": "Income-tax Act",
      "sections": [
        "s. 34(1)(a)",
        "s. 34(1)(b)",
        "s. 22(2)",
        "s. 23"
      ],
      "relevance": "Power to reassess income that escaped assessment due to non-disclosure of material facts; Explanation on disclosure."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court dismissed the appeals with special leave, upholding the High Court's rejection of writ petitions. The notices under s. 34 for reassessment were held valid as the ITO had prima facie reason to believe income escaped assessment due to non-disclosure of material facts.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"before the Income-tax Officer may issue a notice under s. 34(1)(a) of the Indian Income-tax Act, two conditions precedent must exist: the Income-tax Officer must have reason to believe (1) that income, profits or gains had been under-assessed, and (2) that such under assessment was due to non-disclosure of material facts by the assessee.\"",
      "speaker": "court",
      "significance": "Defines jurisdictional requirements for reassessment."
    },
    {
      "text": "\"the sufficiency of the grounds which induced the Income-tax Officer to act is not a justiciable issue.\"",
      "speaker": "court",
      "significance": "Limits judicial review to existence, not adequacy, of belief."
    },
    {
      "text": "\"Production before the Income-tax Officer of account books or other evidence from which material facts could with due diligence have been discovered by the Income-tax Officer will not necessarily amount to disclosure within the meaning of this section.\"",
      "speaker": "court",
      "significance": "Explanation clarifying non-disclosure despite production of books."
    }
  ],
  "_case_id": "1966_122",
  "_label": 0,
  "_text_length": 14854,
  "_extracted_at": "2026-02-10T19:39:33.884629"
}