{
  "metadata": {
    "case_name": "Jugal Kishore Baldeo Sahai (Hindu Undivided Family) v. Commissioner of Income-tax",
    "case_year": 1965,
    "court": "Supreme Court of India",
    "judges": [
      "Bhargava, J."
    ],
    "case_number": "Civil Appeal Nos. 594 to 600 of 1965",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The assessee was a Hindu undivided family carrying on a joint family business of commission agency in cloth under the name of Jugal Kishore Baldeo Sahai and was, in addition, deriving income from some property and from some partnership business in which the karta Babu Ram was a partner representing the interest of the Hindu undivided family.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The family consisted of Babu Ram, his brother Gobardhandas and their sons.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "In June, 1946, the karta Babu Ram wrote a letter to his brother Gobardhandas, who was the only other adult member of the family, stating that, since he was managing all the business, he ought to get a salary of Rs. 1,000 per month. Gobardhandas promptly agreed to this proposal.",
      "type": "material",
      "date": "1946-06",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Consequently in the account books of the family for the year in question a sum of Rs. 12,000 was debited in the expense account of the Hindu undivided family business, viz., of Jugal Kishore Baldeo Sahai and the same amount was credited in the name of Babu Ram as an individual.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The first such credit was made in the account year relevant to the assessment year 1946-47 and similar credits continued to be made in subsequent accounting years upto the year relevant to the assessment year 1952-53. Thus, the debit against the Hindu family business at the rate of Rs. 12,000 per year and similar credit in the name of Babu Ram was made in the accounts for seven years.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "In each of these seven years the Hindu undivided family as the assessee claimed that this sum of Rs.12,000 every year should be deducted as an expenditure under s. 10(2)(xv) of the Income-tax Act.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "The Income-tax Officer rejected the claim and that order was upheld by the Appellate Assistant Commissioner as well as by the Tribunal.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "Thereupon at the request of the assessee appellant, the question was referred by the Tribunal for the opinion of the High Court.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "The High Court answered the question against the appellant and upheld the view of the Tribunal on March 28, 1962.",
      "type": "procedural",
      "date": "1962-03-28",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "The other members of the Hindu undivided family were minor sons of Babu Ram himself or of Gobardhandas.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Subsequently, when there was a partition in which even the sons of Babu Ram separated from him the amount to the credit of Babu Ram in the accounts was treated as his separate asset and was not included in the assets of the Hindu undivided family without any objection from any of the members of the family who were minors at the earlier stage when the agreement was entered into.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Some of the minors subsequently attained majority and none of them challenged the validity of this agreement on the ground that it had been executed during their minority and that it was against their interest.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "There is no indication of any finding that the payment to Babu Ram was at all high, or was not commensurate with the services rendered by him.",
      "type": "admitted",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether on the facts and circumstances of the case the salary paid or credited to a Karta of the family for looking after the family’s business was a permissible deduction under s. 10(2)(xv) in computing the income of the family business.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The remuneration paid to the karta Babu Ram under the agreement with Gobardhandas is deductible under s. 10(2)(xv) as it was made as a matter of commercial or business expediency.",
      "supporting_facts": [
        "f3",
        "f4",
        "f5",
        "f11"
      ],
      "legal_basis": "Jitmal Bhuramal v. Commissioner of Income-tax Bihar and Orissa"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Under Hindu Law, a karta is bound to manage the family business without remuneration; it is anomalous for karta to be employee of himself.",
      "supporting_facts": [],
      "legal_basis": "Gopalchandra Sarkar Sastri's Hindu Law; N. E. Raghavachariar's Hindu Law; Mayne's Hindu Law; Krishnswami Ayyangar v. Rajagopala Ayyangar"
    },
    {
      "id": "ra2",
      "text": "No valid agreement possible on behalf of minors; Babu Ram cannot represent minors he benefits from.",
      "supporting_facts": [
        "f10"
      ],
      "legal_basis": null
    },
    {
      "id": "ra3",
      "text": "Remuneration was for other businesses including partnerships, not just family business.",
      "supporting_facts": [
        "f1"
      ],
      "legal_basis": "Jitmal Bhuramal v. Commissioner of Income-tax, Bihar and Orissa"
    },
    {
      "id": "ra4",
      "text": "Distinction from Jitmal Bhuramal as that case involved junior members, not karta.",
      "supporting_facts": [],
      "legal_basis": "Jitmal Bhuramal v. Commissioner of Income-tax Bihar and Orissa"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Under Hindu Law, karta can receive remuneration under special arrangement or agreement; not absolutely prohibited.",
      "addresses_issue": "i1",
      "key_observation": "Right to remuneration negatived with qualifications; ordinarily not entitled but possible under agreement."
    },
    {
      "id": "cr2",
      "text": "Test for deductibility under s. 10(2)(xv): agreement made by/on behalf of all members, in interest of business, justified on commercial expediency.",
      "addresses_issue": "i1",
      "key_observation": "Same test as any expenditure under s. 10(2)(xv)."
    },
    {
      "id": "cr3",
      "text": "Jitmal Bhuramal applies generally to family members including karta; no distinction.",
      "addresses_issue": "i1",
      "key_observation": "Karta has no obligation to carry on particular business; can have separate income."
    },
    {
      "id": "cr4",
      "text": "Agreement valid as Babu Ram and Gobardhandas (only competent adults) agreed; they represent minors; no prejudice to minors; later conduct confirms.",
      "addresses_issue": "i1",
      "key_observation": "Agreement for benefit of minors; not invalidated by representative benefiting."
    },
    {
      "id": "cr5",
      "text": "Payment genuine, not excessive, commensurate with services; for family businesses only, not partnerships.",
      "addresses_issue": "i1",
      "key_observation": "'Businesses' means family businesses including looking after family interests in partnerships."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "If remuneration paid to karta under valid, bona fide agreement in interest of and expedient for family business, genuine and not excessive, deductible under s. 10(2)(xv).",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Krishnswami Ayyangar v. Rajagopala Ayyangar",
      "citation": "I.L.R. 18 Mad. 73",
      "treatment": "distinguished",
      "relevance": "Managing partner not entitled to remuneration absent valid special agreement; court clarifies test for validity."
    },
    {
      "case_name": "Jitmal Bhuramal v. Commissioner of Income-tax Bihar and Orissa",
      "citation": "44 I.T.R. 887",
      "treatment": "followed",
      "relevance": "HUF can deduct salary to family member if commercial expediency; applies to karta too; services must be to family business."
    },
    {
      "case_name": "Commissioner of Income-tax, Bihar and Orissa v. Jainarain Jagannath",
      "citation": "13 I.T.R. 410",
      "treatment": "referred",
      "relevance": "Family member can render services to family firm for reasonable remuneration if not excessive or tax device."
    },
    {
      "case_name": "Jitmal Bhuramal v. Commissioner of Income-Tax, Bihar Orissa",
      "citation": "37 I.T.R. 528",
      "treatment": "followed",
      "relevance": "Calcutta HC decision affirmed by SC; no deduction if services to partnership, not family."
    }
  ],
  "statutes_cited": [
    {
      "name": "Income-tax Act",
      "sections": [
        "10(2)(xv)"
      ],
      "relevance": "Deduction for expenditure wholly and exclusively for business purposes; applies to remuneration to karta if valid and expedient."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "The appeals by special leave are allowed; the judgment of the Allahabad High Court is set aside; salary paid to karta is deductible under s. 10(2)(xv).",
    "relief_granted": "Deduction of Rs. 12,000 per year allowed for the seven years.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "the test, we think, which should be applied, is whether the agreement has been made by or on behalf of all the members of the Hindu undivided family and whether it was in the interest of the business of the family, so that it could be justified on grounds of commercial expediency.",
      "speaker": "court",
      "significance": "Defines test for deductibility of karta's remuneration."
    },
    {
      "text": "if a remuneration is paid to the karta of the family under a valid agreement which is bonafide and in the interest of, and expedient for, the business of the family and the payment is genuine and not excessive, such remuneration must be held to be an expenditure laid out wholly And exclusively for the purpose of the business",
      "speaker": "court",
      "significance": "Core holding on when deduction allowed."
    }
  ],
  "_case_id": "1966_236",
  "_label": 0,
  "_text_length": 16604,
  "_extracted_at": "2026-02-10T19:41:37.945017"
}