{
  "metadata": {
    "case_name": "State of Mysore v. Respondents (Cotton Dealers)",
    "case_year": 1965,
    "court": "Supreme Court of India",
    "judges": [
      "Bhargava, J."
    ],
    "case_number": "Civil Appeals Nos. 714-724 of 1965",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Respondents were registered dealers in cotton, including kappas, groundnuts and cotton seeds with Head Office at Bellary and Branch Offices at a number of places.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Respondents were licensees under s. 8 of the Madras General Sales Tax Act, 1939 in respect of cotton.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Respondents made various purchases of cotton at their places of business and subsequently sold them to different parties, including non-resident parties outside the area to which the Act applied.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Non-resident foreign buyers placed orders for bales of cotton specifying quality and rate sometimes by phone confirmed by telegrams or letters and finally by written agreements.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "Respondents consigned cotton bales in their own name, the consignee being the non-resident foreign buyers except for specific turnovers listed, and sent railway receipts to their bankers for collection of amount.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "Contracts provided 90% of invoice amounts paid to bankers when railway receipts delivered, but provision rendered nugatory as consignee could get cotton without payment.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Moment respondents consigned goods, they lost complete control and dominion over the cotton.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Non-resident foreign buyers obtained necessary transport permit under Cotton Control Order, 1950, insured cotton bales as owners and transmitted from Bellary to destination, even when consigned to respondents themselves.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Sales completed at Bellary where property in goods transferred and buyers transported cotton.",
      "type": "disputed",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Disputed turnovers related to years 1954-55 and 1955-56 with specific items listed.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Area originally in State of Madras, after Reorganisation became Madras Area of State of Mysore, but Madras Sales Tax Act continued to apply.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Mysore Sales Tax Appellate Tribunal allowed appeals of respondents, set aside orders directing payment of sales-tax by respondents.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Mysore High Court upheld Tribunal's order in Civil Revision Petitions dated January 29, 1962.",
      "type": "procedural",
      "date": "1962-01-29",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether situs of sales by respondents to non-resident parties was within the Madras area (Bellary).",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether sales were in course of inter-State trade.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether for purposes of s. 5(2) of the Act read with Rule 4-A(iv)(b) of the Rules, respondents were the dealers who bought cotton in the State and last dealers not exempt from taxation, or the non-resident buyers.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Situs of sales not within State as parties came to Bellary for contracts or delivery to common carrier, so sales completed outside at destinations.",
      "supporting_facts": [
        "f4",
        "f5"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Sales were in course of inter-State trade.",
      "supporting_facts": [
        "f5",
        "f8"
      ],
      "legal_basis": "Central Sales Tax Act, 1956 s.3(a),(b)"
    },
    {
      "id": "pa3",
      "text": "Non-resident buyer could not be held to be the last dealer under Rule 4-A(iv)(b); situs of seller and buyer determines applicability, not situs of sale.",
      "supporting_facts": [
        "f3",
        "f9"
      ],
      "legal_basis": "Madras General Sales Tax (Turnover and Assessment) Rules, 1939 Rule 4-A(iv)(b)"
    },
    {
      "id": "pa4",
      "text": "Outside buyers not dealers carrying on business of purchase in State, so their purchases ignored; respondents last buyers in State.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Cotton sold within State to parties residing outside State; sales made within State, so respondents not dealers who bought cotton in State and last dealers not exempt; buyers liable under s.5(2) and Rule 4-A(iv)(b).",
      "supporting_facts": [
        "f3",
        "f9"
      ],
      "legal_basis": "s.5(2) Act; Rule 4-A(iv)(b)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Situs of sales within Madras area at Bellary where sales completed and delivery to common carrier as agent of buyer; buyers insured goods during transit recognising ownership.",
      "addresses_issue": "i1",
      "key_observation": "Delivery to common carrier within State; insurance by buyers."
    },
    {
      "id": "cr2",
      "text": "Sales not in course of inter-State trade as property passed within State before movement; movement by buyers post property transfer; no covenant/incident of contract causing movement.",
      "addresses_issue": "i2",
      "key_observation": "Distinguished Tata Iron case: no transfer of documents during movement; movement not result of contract."
    },
    {
      "id": "cr3",
      "text": "Rule 4-A(iv)(b) taxes dealer who buys in State and is last not exempt; test is purchase in State, not location of dealer; non-resident buyers bought in State, so they are last dealers liable.",
      "addresses_issue": "i3",
      "key_observation": "Language: 'dealer who buys it in the State'; location of dealer immaterial."
    },
    {
      "id": "cr4",
      "text": "Alternative argument that buyers not dealers not raised earlier, not open; anyway, mills purchasing for manufacturing are dealers.",
      "addresses_issue": "i3",
      "key_observation": "Not open for first time in SC."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Situs of sales within Madras area.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Sales not in course of inter-State trade.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Non-resident buyers are dealers who bought cotton in State and last not exempt; tax under s.5(2) levied on them, not respondents.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Tata Iron and Steel Co. Limited, Bombay v. S. R. Sarkar and Others",
      "citation": "1961 1 S.C.R. 379",
      "treatment": "followed",
      "relevance": "Explains sales in course of inter-State trade under cl.(a),(b) s.3 Central Sales Tax Act, 1956."
    }
  ],
  "statutes_cited": [
    {
      "name": "Madras General Sales Tax Act, 1939",
      "sections": [
        "s. 3",
        "s. 5(2)",
        "s. 8"
      ],
      "relevance": "Single point taxation on last dealer not exempt buying in State; respondents licensees."
    },
    {
      "name": "Madras General Sales Tax (Turnover and Assessment) Rules, 1939",
      "sections": [
        "Rule 4-A(iv)(b)"
      ],
      "relevance": "Tax levied on dealer who buys in State and is last dealer not exempt from taxation."
    },
    {
      "name": "Cotton Control Order, 1950",
      "sections": [],
      "relevance": "Non-resident buyers obtained transport permits."
    },
    {
      "name": "Central Sales Tax Act, 1956",
      "sections": [
        "s. 3(a), (b)"
      ],
      "relevance": "Definition of sales in course of inter-State trade."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court upheld the findings of the Tribunal and High Court that the sales were within the Madras area, not inter-State, and tax under s.5(2) read with Rule 4-A(iv)(b) payable by non-resident buyers as last dealers buying in State, not by respondents; State's appeals dismissed.",
    "relief_granted": "Respondents relieved from sales-tax liability on disputed sales.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"The language of the Rule is clear that the tax is to be levied from the dealer who buys it in the State and is the last dealer not exempt from taxation. The test laid down thus is as to who buys it in the State and not who is in the State.\"",
      "speaker": "court",
      "significance": "Core interpretation of Rule 4-A(iv)(b) rejecting situs of buyer as criterion."
    },
    {
      "text": "\"All these facts clearly go to show that the sales are completed at Bellary and the non-resident foreign buyers in whose favour the property in the goods had been transferred actually transported the cotton thus purchased.\"",
      "speaker": "lower_court",
      "significance": "Tribunal's finding on situs and completion of sale upheld."
    }
  ],
  "_case_id": "1966_120",
  "_label": 0,
  "_text_length": 12417,
  "_extracted_at": "2026-02-10T19:39:45.932372"
}