{
  "metadata": {
    "case_name": "Narandas Morardas Gaziwala & Lakshmi Chand Co. v. Murugesa Chettiar",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "Ramaswami, J."
    ],
    "case_number": "Civil Appeals Nos. 177 and 178 of 1964",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Narandas Morardas Gaziwala and Lakshmi Chand Co. were two firms of partnership carrying on business in lace and silver thread at Surat in the State of Bombay.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Krishna and Company at Kumbakonam acted as commission agents for the Surat firms for selling goods in Tanjore, Tiruchirapalli and Madurai districts from 1944 till 1951.",
      "type": "background",
      "date": "1944-1951",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Partners of Krishna Co. were Murugesa Chettiar and Gopal Chettiar (wife's sister's husband).",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "In 1951, Krishna Co. partnership dissolved by mutual agreement; Murugesa Chettiar took over all assets and liabilities; Gopal Chettiar retired.",
      "type": "procedural",
      "date": "1951",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Krishna Co. became indebted to Surat firm in 1951; on April 1, 1951, Murugesa Chettiar (plaintiff) executed promissory note for Rs. 7,500 in favour of Narandas Morardas Gaziwala.",
      "type": "material",
      "date": "1951-04-01",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Plaintiff case: On April 1, 1951, Surat firm constituted Murugesa Chettiar as sole agent for 5 years for three districts, commission Rs. 2/- per mark on all sales; Surat firm circumvented by direct sales; debt to be adjusted against commissions.",
      "type": "disputed",
      "date": "1951-04-01",
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "Plaintiff instituted O.S. No. 87 of 1954 in District Munsif's Court, Kancheepuram for rendition of accounts from April 1, 1951.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Surat firm instituted O.S. No. 21 of 1954 in Court of Subordinate Judge, Chingleput for Rs. 7,500 under promissory note.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "O.S. 87/1954 transferred to Subordinate Judge, Chingleput as O.S. 35/1955; both suits tried together by consent.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Subordinate Judge (Dec 12, 1956): Plaintiff sole agent for 5 years; preliminary decree for accounts; decree for promissory note amount adjusted against commissions.",
      "type": "procedural",
      "date": "1956-12-12",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Surat firm appealed: A.S. 45/1957 (O.S.21/54) to High Court; appeal from O.S.35/55 transferred to High Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Madras High Court (Sep 20, 1961) dismissed both appeals.",
      "type": "procedural",
      "date": "1961-09-20",
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "High Court found transactions within peculiar knowledge of Surat firm; prima facie evidence of direct sales (Exs. A-26, A-28); Surat firm did not reply to complaints.",
      "type": "admitted",
      "date": null,
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the plaintiff (agent) is entitled to sue the defendant-Surat firm (principal) for rendition of accounts.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the plaintiff is entitled to set up a parole agreement as a condition precedent to the enforceability of the promissory note, notwithstanding S.92 Evidence Act.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Agent cannot sue principal for accounts as no statutory right under Indian Contract Act; only principal can under S.213.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": "Section 213 Indian Contract Act"
    },
    {
      "id": "pa2",
      "text": "Plaintiff precluded from setting up parole agreement by S.92 Evidence Act; agreement relates to mode of discharge, not condition precedent.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": "Section 92 Evidence Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Entitled to accounts as special circumstances: accounts with principal; direct sales in contravention of sole agency.",
      "supporting_facts": [
        "f6",
        "f13"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Oral agreement was condition precedent to enforceability of promissory note for 5 years, adjustable against commissions.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": "Proviso 3 to S.92 Evidence Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "No statutory right for agent to sue principal for accounts, but equitable right in special circumstances where accounts complicated, within principal's knowledge, agent ignorant of dealings.",
      "addresses_issue": "i1",
      "key_observation": "Transactions peculiarly within knowledge of Surat firm; prima facie evidence of direct sales."
    },
    {
      "id": "cr2",
      "text": "Oral agreement constitutes condition precedent to attaching of obligation under promissory note, admissible under Proviso 3 S.92 Evidence Act; distinguishes from agreement altering terms or mode of discharge.",
      "addresses_issue": "i2",
      "key_observation": "Agreement suspends coming into force of obligation until after accounting period."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Agent entitled to sue principal for accounts in special circumstances where accounts in principal's possession, agent unaware of extent of dealings.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Parole agreement as condition precedent to enforceability of promissory note admissible under Proviso 3 S.92 Evidence Act.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Ramachandra Madhavadoss Co. v. Moovakat Moidunkutti Birankutti Bros. Firm, Cannanore",
      "citation": "A.I.R. 1938 Mad. 707",
      "treatment": "followed",
      "relevance": "Supports agent's equitable right to accounts in special circumstances."
    },
    {
      "case_name": "Ram Lal Kapur Sons v. Asian Commercial Assurance Co. Ltd.",
      "citation": "A.I.R. 1933 Lah. 483",
      "treatment": "followed",
      "relevance": "Supports agent's equitable right to accounts in special circumstances."
    },
    {
      "case_name": "Basant Kumar and others v. Roshanlal",
      "citation": "I.L.R. 1954 Nagpur 435",
      "treatment": "followed",
      "relevance": "Supports agent's equitable right to accounts in special circumstances."
    },
    {
      "case_name": "Rowland Ady and others v. Administrator-General of Burma",
      "citation": "A.I.R. 1958 P.C. 198",
      "treatment": "followed",
      "relevance": "Oral agreement suspending obligation under promissory note is condition precedent under Proviso 3 S.92 Evidence Act."
    },
    {
      "case_name": "Padwick v. Stanley",
      "citation": null,
      "treatment": "referred",
      "relevance": "Principal's right to equity accounts does not imply agent's reciprocal right."
    },
    {
      "case_name": "Shepard v. Brown",
      "citation": null,
      "treatment": "referred",
      "relevance": "Agent can seek accounts where evidence principally with principal."
    },
    {
      "case_name": "Smith v. Leveaux",
      "citation": null,
      "treatment": "distinguished",
      "relevance": "Agent's ignorance alone insufficient without complicated accounts."
    },
    {
      "case_name": "Blyth v. Whiffin",
      "citation": null,
      "treatment": "followed",
      "relevance": "Agent can maintain bill for accounts if complicated."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Contract Act",
      "sections": [
        "Section 213"
      ],
      "relevance": "Agent bound to render accounts to principal; no reciprocal statutory right for agent."
    },
    {
      "name": "Indian Evidence Act",
      "sections": [
        "Section 92",
        "Proviso 3"
      ],
      "relevance": "Proviso 3 allows proof of separate oral agreement constituting condition precedent to obligation under contract."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court dismissed the appeals by special leave, upholding Madras High Court judgment dated September 20, 1961, affirming preliminary decree for accounts and adjustment of promissory note amount against commissions.",
    "relief_granted": "Plaintiff entitled to accounts from Surat firm; promissory note obligation conditional on accounting.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "Though an agent has no statutory right for an account from his principal nevertheless there may be special circumstances rendering it equitable that the principal should account to the agent.",
      "speaker": "court",
      "significance": "Establishes equitable right of agent to accounts."
    },
    {
      "text": "The agreement was not related to the mode of discharge of the obligation under the promissory note but that it was a condition precedent to the enforceability of the promissory note.",
      "speaker": "court",
      "significance": "Clarifies applicability of Proviso 3 S.92 Evidence Act."
    }
  ],
  "_case_id": "1966_95",
  "_label": 0,
  "_text_length": 17882,
  "_extracted_at": "2026-02-10T19:39:32.266004"
}