{
  "metadata": {
    "case_name": "Widow and son of Maliram Agarwala v. Mohd. Soleman (predecessor-in-interest of respondents)",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "Hidayatullah J."
    ],
    "case_number": "Civil Appeal No. 893 of 1963",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Arjun Das had taken on lease the suit land from one Mohd. Soleman, predecessor-in-interest of the respondents.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Appellants are the widow and son of one Maliram Agarwala.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Decree for ejectment passed as far back as November 28, 1950 in a title suit filed against the appellants and was later confirmed by the High Court.",
      "type": "material",
      "date": "1950-11-28",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Present execution began on August 16, 1954 and was pending in the court of the Subordinate Judge, L.A.D., Gauhati.",
      "type": "procedural",
      "date": "1954-08-16",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Assam Non-Agricultural Urban Areas Tenancy Act, 1955 (Assam Act 12 of 1955) came into force from June 26, 1955.",
      "type": "background",
      "date": "1955-06-26",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Appellants claimed the benefit of s. 5 of the Act which grants protection from eviction to tenants, under certain circumstances.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "Execution Court on November 12, 1957 held that the protection of s. 5 was available not only in pending suits and appeals but also in pending execution cases, following Harsukh Saraogi Anr. v. Mashulal Khemani Anr. (AIR 1957 Assam 22) and Habiba Bibi v. Ram Ranjan Mullick (AIR 1937 Cal 207). Fixed the case for evidence.",
      "type": "procedural",
      "date": "1957-11-12",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Presiding Judge having changed, the point was reopened on June 6, 1959 by the successor Judge, who following Suresh Chandra Datta v. Ashutosh Dutta (AIR 1960 Assam 24) held that s. 5(1)(a) was not applicable to execution proceedings and the pending execution must proceed according to law.",
      "type": "procedural",
      "date": "1959-06-06",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "High Court of Assam dated August 14, 1959 rejecting summarily an appeal in an execution case.",
      "type": "procedural",
      "date": "1959-08-14",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Appeal by special leave to Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the provisions of s. 5(1)(a) of the Assam Non-Agricultural Urban Areas Tenancy Act, 1955 apply to pending execution proceedings in respect of decrees for ejectment granted before the coming into force of the Tenancy Act.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Two methods of approach: one to construe the words of the fifth section taken by themselves or in comparison with those employed in other Acts of the Assam Legislature; second to compare and contrast s. 5 of the Assam Act with enactments in rent control Acts of other States.",
      "supporting_facts": [
        "f6",
        "f7"
      ],
      "legal_basis": "s. 5 of Assam Non-Agricultural Urban Areas Tenancy Act, 1955"
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Section 5 consists of three sub-sections; viewing backwards: sub-s. (3) applies to all executions within its terms peremptorily; sub-s. (2) recognizes ejectment possible in execution of decree by competent civil court; sub-s. (1) speaks of right of landlord to eject tenant, not of ejectment decree, and does not include decrees already obtained in non-obstante clause.",
      "addresses_issue": "i1",
      "key_observation": "s. 5(1)(b) suggests operation on rights enforced by suit, not on rights already enforced by decree; s. 6 mentions suit for ejectment, not execution."
    },
    {
      "id": "cr2",
      "text": "s. 5(1)(a) constructed on similar lines to (1)(b), protects tenants from ejectment by landlord intending to operate on rights in suit, not execution proceedings.",
      "addresses_issue": "i1",
      "key_observation": "No distinction between cl. (a) and (b) re execution of prior decrees."
    },
    {
      "id": "cr3",
      "text": "Prior Assam Acts explicitly included execution proceedings: s.14 Sylhet Act 1947; s.6(1) Assam Urban Areas Rent Control Acts 1946 and 1949; deliberate departure in 1955 Act.",
      "addresses_issue": "i1",
      "key_observation": "Legislature knew how to include execution if intended; language embargoes right but not decrees already won."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "s. 5(1)(a) of the Act does not apply to execution cases in respect of decrees for ejectment granted before the coming into force of the Tenancy Act.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Harsukh Saraogi Anr. v. Mashulal Khemani Anr.",
      "citation": "A.I.R. 1957 Assam 22",
      "treatment": "followed",
      "relevance": "By first execution judge, holding s.5 applies to execution"
    },
    {
      "case_name": "Habiba Bibi and others v. Ram Ranjan Mullick and others",
      "citation": "A.I.R. 1937 Cal 207",
      "treatment": "followed",
      "relevance": "By first execution judge, holding s.5 applies to execution"
    },
    {
      "case_name": "Suresh Chandra Datta v. Ashutosh Dutta and others",
      "citation": "A.I.R. 1960 Assam 24",
      "treatment": "followed",
      "relevance": "By successor execution judge and approved by Supreme Court, holding s.5(1)(a) not applicable to execution proceedings"
    }
  ],
  "statutes_cited": [
    {
      "name": "Assam Non-Agricultural Urban Areas Tenancy Act, 1955 (Assam Act 12 of 1955)",
      "sections": [
        "Section 5",
        "Section 6"
      ],
      "relevance": "Core provision for protection from eviction; does not apply to prior execution decrees"
    },
    {
      "name": "Sylhet Non-Agricultural Urban Areas Tenancy Act, 1947 (Assam Act 10 of 1947)",
      "sections": [
        "Section 14"
      ],
      "relevance": "Explicitly applied to pending execution proceedings; repealed by 1955 Act"
    },
    {
      "name": "Assam Urban Areas Rent Control Act, 1949 (Assam Act 13 of 1949)",
      "sections": [
        "Section 6(1)"
      ],
      "relevance": "Bar against execution of decree if tenant pays rent; explicitly included execution"
    },
    {
      "name": "Assam Urban Areas Rent Control Act, 1946 (Assam Act 3 of 1946)",
      "sections": [
        "Section 6(1)"
      ],
      "relevance": "Similar to 1949 Act, explicitly included execution proceedings"
    },
    {
      "name": "Transfer of Property Act, 1882",
      "sections": [
        "Section 108"
      ],
      "relevance": "Mentioned in proviso to prior Rent Control Act"
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court dismissed the appeal by special leave, holding that the High Court of Assam was right in rejecting the appellants' appeal; s.5(1)(a) does not apply to pending execution proceedings for pre-Act decrees, and execution must proceed according to law.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"The only question in this case is whether the provisions of s. 5(1)(a) of the Tenancy Act apply to pending execution proceedings.\"",
      "speaker": "court",
      "significance": "Frames the sole issue"
    },
    {
      "text": "\"The decision under appeal was, therefore, right.\"",
      "speaker": "court",
      "significance": "Concludes in favor of respondents, dismissing appeal"
    },
    {
      "text": "\"These enactments, which are quite explicit, show that where the Assam Legislature wished it included execution proceedings within the protection. Being aware that if execution proceedings are to be included they need to be mentioned... the departure appears to be deliberate.\"",
      "speaker": "court",
      "significance": "Key reasoning on legislative intent"
    }
  ],
  "_case_id": "1966_23",
  "_label": 0,
  "_text_length": 14518,
  "_extracted_at": "2026-02-10T19:38:52.668937"
}