{
  "metadata": {
    "case_name": "Messrs. Ram Chand Sons Sugar Mills Private Limited v. Kanhaya Lal Bhargava",
    "case_year": 1966,
    "court": "Supreme Court of India",
    "judges": [
      "Subba Rao J."
    ],
    "case_number": "Civil Appeal No. 166 of 1966",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Kanhaya Lal Bhargava, the 1st respondent, filed a suit on April 27, 1962, in the Court of the Subordinate Judge, First Class, Delhi, against Messrs. Ram Chand Sons Sugar Mills Private Limited, the appellant, and one Ram Sarup for the recovery of a sum of Rs. 45,112.94.",
      "type": "background",
      "date": "1962-04-27",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Pending the suit, on October 27, 1964, the 1st respondent filed an application under O.XI, r. 21, of the Code, read with O.XXIX, r. 3, thereof, for striking off the defence or in the alternative for directing Jugal Kishore, a director of the Appellant-company, to appear in court on December 14, 1964.",
      "type": "procedural",
      "date": "1964-10-27",
      "source": "respondent"
    },
    {
      "id": "f3",
      "text": "On December 3, 1964, the court made an order directing the said Jugal Kishore to be present in court on December 14, 1964, to answer material questions relating to the suit.",
      "type": "procedural",
      "date": "1964-12-03",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The appellant took a number of adjournments to produce the said Jugal Kishore on the ground that the latter was ill.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "On February 3, 1965, the court gave the appellant a final opportunity to produce the said Jugal Kishore.",
      "type": "procedural",
      "date": "1965-02-03",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Even so, the appellant took two more adjournments to produce him, but did not do so on the ground that he was ill.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "Finally on February 25, 1965, the court issued a notice to the 1st defendant, appellant herein, to show cause why his defence should not be struck off.",
      "type": "procedural",
      "date": "1965-02-25",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "On March 16, 1965, after hearing the arguments the court held that Jugal Kishore had failed to comply with the orders of the court and was persistent in his default in spite of chances given to him and on that finding, it struck off the defence of the appellant.",
      "type": "procedural",
      "date": "1965-03-16",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "The Punjab High Court, on revision, held that Jugal Kishore did not appear in court in spite of orders to that effect and that the learned Subordinate Judge had jurisdiction to strike out the defence of the appellant. It further negatived the contention of the appellant that it was not in its power to compel Jugal Kishore to appear in court on the ground that he was the director of the company and was under its control.",
      "type": "procedural",
      "date": "1965-08-27",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the court has power under s. 151 CPC to strike out the defence of a company for non-appearance of its director summoned under O. XXIX r. 3 CPC.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether O. XXIX r. 3 CPC empowers the court to require the personal appearance of any director or only the director who signed and verified the pleading under O. XXIX r. 1.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether the company can be held liable for the default of its director in appearing in court, given that company and directors are separate legal personalities.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The Code of Civil Procedure provides express power for a court to strike out defence against a party under specified circumstances and, therefore, s. 151 thereof cannot be invoked to strike out the defence in other circumstances, for to do so will be to override the provisions of the Code.",
      "supporting_facts": [],
      "legal_basis": "s. 151 CPC"
    },
    {
      "id": "pa2",
      "text": "Order XXIX, r.3, of the Code does not empower the court to require the personal appearance of a director other than a director who signed and verified the pleading within the meaning of O.XXIX, r. 1 thereof.",
      "supporting_facts": [
        "f2",
        "f3"
      ],
      "legal_basis": "O. XXIX rr. 1, 3 CPC"
    },
    {
      "id": "pa3",
      "text": "O. XXIX r. 3 does not provide for any penalty in case the director required to appear in court failed to do so. By analogy from other provisions where defaults carry penalties, absence of such provision means no penalty intended.",
      "supporting_facts": [
        "f4",
        "f5",
        "f6"
      ],
      "legal_basis": "O. IX r.12, O.X r.4, O.XI r.21, O.XVI r.20, O.XVIII rr.2,3 CPC"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The court had ample jurisdiction to strike out the defence of a party if he was guilty of abuse of the process of the court.",
      "supporting_facts": [
        "f4",
        "f5",
        "f6",
        "f8"
      ],
      "legal_basis": "s. 151 CPC"
    },
    {
      "id": "ra2",
      "text": "Jugal Kishore, one of the permanent directors of the appellant-company had adopted a recalcitrant attitude in defying the orders of the court to be present for interrogation and, therefore, the Subordinate Judge rightly, after giving every opportunity for him to be present, struck off the appellants defence.",
      "supporting_facts": [
        "f3",
        "f4",
        "f5",
        "f6",
        "f7",
        "f8"
      ],
      "legal_basis": "O. XXIX r. 3 CPC"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The inherent power of a court under s. 151 CPC is in addition to and complementary to the powers expressly conferred under the Code. But that power will not be exercised if its exercise is inconsistent with, or comes into conflict with, any of the powers expressly or by necessary implication conferred by the other provisions of the Code.",
      "addresses_issue": "i1",
      "key_observation": "Limitations on s.151 from precedents: Padam Sen, Manohar Lal Chopra, Arjun Singh."
    },
    {
      "id": "cr2",
      "text": "Rules 1, 2 and 3 of O. XXIX use the words 'any director'. The adjective 'any' indicates that any one of the directors with the requisite qualifications can perform the functions laid down. Any director who may be able to answer material questions relating to the suit may be required to appear personally before the court.",
      "addresses_issue": "i2",
      "key_observation": "Director under r.3 need not be the same as under r.1."
    },
    {
      "id": "cr3",
      "text": "There is nothing in O.XXIX which expressly or by necessary implication precludes the exercise of inherent power under s.151. In case of default by director under O.XXIX r.3, court can make suitable consequential order under s.151 to prevent abuse of process.",
      "addresses_issue": "i1",
      "key_observation": "Inherent power applicable despite no specific penalty in O.XXIX r.3."
    },
    {
      "id": "cr4",
      "text": "Jugal Kishore defied orders on pretext of illness and abused process. But neither court found appellant responsible or instrumental for director not attending. Company and directors are different legal personalities. No finding of collusion or company preventing director. Cannot make company constructively liable.",
      "addresses_issue": "i3",
      "key_observation": "Striking off company's defence not justified without proof of company's complicity."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Court can exercise inherent power under s.151 CPC to make suitable consequential order for default under O.XXIX r.3 CPC to prevent abuse of process.",
      "resolves_issue": "i1",
      "in_favor_of": "partial"
    },
    {
      "id": "h2",
      "text": "O.XXIX r.3 applies to any director able to answer material questions, not limited to one who signed pleadings.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Company's defence cannot be struck off for director's default without finding that company was responsible or prevented director from appearing.",
      "resolves_issue": "i3",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Padam Sen v. The State of Uttar Pradesh",
      "citation": "1961 1 S.C.R 884",
      "treatment": "followed",
      "relevance": "Inherent powers under s.151 are complementary, not to conflict with express Code provisions."
    },
    {
      "case_name": "Manohar Lal Chopra v. Rai Bahadur Rao Raja Seth Hiralal",
      "citation": "1962 Supp. 1 S.C.R. 450",
      "treatment": "followed",
      "relevance": "Inherent powers not controlled by Code but not to conflict with legislative intentions."
    },
    {
      "case_name": "Arjun Singh v. Mohindra Kumar",
      "citation": "1964 5 S.C.R. 946",
      "treatment": "followed",
      "relevance": "Inherent power cannot override or cut across express provisions of the Code."
    }
  ],
  "statutes_cited": [
    {
      "name": "Code of Civil Procedure",
      "sections": [
        "s. 151",
        "O. XXIX r. 1",
        "O. XXIX r. 2",
        "O. XXIX r. 3",
        "O. XI r. 21",
        "O. IX r. 12",
        "O. X r. 4",
        "O. XVI r. 20",
        "O. XVIII r. 2",
        "O. XVIII r. 3"
      ],
      "relevance": "Governs inherent powers, discovery, appearance of company officers, penalties for defaults."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed. Orders of Subordinate Judge and High Court striking off the defence of the appellant set aside. Subordinate Judge directed to proceed with the suit in accordance with law.",
    "relief_granted": "Defence restored; suit to proceed.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The inherent power of a court is in addition to and complementary to the powers expressly conferred under the Code. But that power will not be exercised if its exercise is inconsistent with... any of the powers expressly or by necessary implication conferred by the other provisions of the Code.",
      "speaker": "court",
      "significance": "Defines scope of s.151 CPC."
    },
    {
      "text": "A company and the directors of the company are different legal personalities.",
      "speaker": "court",
      "significance": "Explains why company not liable for director's default without complicity."
    }
  ],
  "_case_id": "1966_252",
  "_label": 1,
  "_text_length": 15314,
  "_extracted_at": "2026-02-10T19:41:33.254700"
}