{
  "metadata": {
    "case_name": "State of Madhya Pradesh v. Kaluram",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "Shah J."
    ],
    "case_number": "Civil Appeal No. 359 of 1964",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "At an auction held on July 20, 1954 by the Divisional Forest Officer, Hoshangabad Division, for sale of felled trees in Coupe No. 66 Dhekna, Range Seoni, one Jagatram was declared the highest bidder and the trees were sold to him for Rs. 12,100.",
      "type": "material",
      "date": "1954-07-20",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The amount of the bid was payable in four instalments of Rs. 3,025 each: first immediately on acceptance of the bid, second on December 1, 1954, third on February 1, 1955, and fourth on May 1, 1955.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Jagatram executed a contract in favour of the Governor of Madhya Pradesh incorporating the terms and conditions of the sale.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Material terms of the contract: quantity of forest produce to be sold is what exists at execution or comes into existence thereafter in contract area; contractor to elect and remove during period from date of furnishing coupe boundary certificate to June 30, 1955; commence work within one month after certificate; remove by specified routes to specified depots.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Contract subject to Forest Contract Rules as amended.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Jagatram paid the first instalment on July 28, 1954, and subscribed his signature to the contract.",
      "type": "material",
      "date": "1954-07-28",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Nathuram and Kaluram stood sureties for Jagatram and executed a bond undertaking to discharge liability of contractor in case of default, recoverable as arrears of land revenue.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Jagatram removed almost the entire quantity of trees sold to him but did not pay the remaining three instalments.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "State of Madhya Pradesh took proceedings to recover from Kaluram the amount due by Jagatram as arrears of land revenue.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Kaluram commenced an action against the State for declaration that he was not liable to pay the arrears and for injunction restraining recovery proceedings.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Principal ground: forest authorities gave time to Jagatram and omitted to seize and sell trees promptly after second instalment due, impairing surety's remedy against Jagatram.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f12",
      "text": "Trial Court (Additional District Judge, Hoshangabad) held forest officers negligent in allowing removal, impairing surety's security, discharging surety for whole amount; decreed plaintiff's suit.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Madhya Pradesh High Court in First Appeal No. 123 of 1958 confirmed decree on September 29, 1961.",
      "type": "procedural",
      "date": "1961-09-29",
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "State appealed to Supreme Court by special leave.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the surety Kaluram stood discharged from liability because forest authorities allowed Jagatram to remove trees without payment of instalments, parting with or losing the security (charge on goods and right to prevent removal/sell).",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether property in the felled trees passed to Jagatram upon production of coupe boundary certificate, attracting statutory charge under s.83 Forest Act.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Mere inaction by forest authorities does not amount to parting with security.",
      "supporting_facts": [],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Property in goods had not passed to contractor till removal, so statutory charge under s.83 did not attach.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": "Indian Forest Act s.83; Forest Contract Rules"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Forest authorities negligent in giving time to Jagatram and omitting to seize/sell trees promptly after second instalment due, impairing surety's remedy.",
      "supporting_facts": [
        "f8",
        "f11"
      ],
      "legal_basis": "Indian Contract Act s.141"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Relevant Forest Contract Rules form part of contract; r.8 allows stopping removal if value exceeds paid instalments; r.29 allows termination on default, goods become govt property; r.33 allows assignment post-removal/check.",
      "addresses_issue": "i1",
      "key_observation": "State had contractual/statutory rights to stop removal, seize, sell goods despite property passing to contractor."
    },
    {
      "id": "cr2",
      "text": "Property passed to Jagatram on production of coupe boundary certificate (s.20 Sale of Goods Act); first charge under s.83 Forest Act attached; State could stop removal/sell.",
      "addresses_issue": "i2",
      "key_observation": "Restrictions in contract/rules do not prevent property passing."
    },
    {
      "id": "cr3",
      "text": "Surety entitled to benefit of every security (s.141 Contract Act); State parted with security by allowing removal without payment, discharging surety to extent of security value.",
      "addresses_issue": "i1",
      "key_observation": "Entire quantity removed (no accounts produced); security lost, surety discharged fully."
    },
    {
      "id": "cr4",
      "text": "Not mere inaction; authorities controlled goods via passes/checks/depots but permitted removal knowing instalments unpaid.",
      "addresses_issue": "i1",
      "key_observation": "Conduct caused loss of security (charge, right to prevent removal/sell)."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Surety discharged from liability as State parted with/lost security by permitting removal of goods without payment.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Property in felled trees passed to contractor on coupe boundary certificate; s.83 charge attached.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Wulff and Billing v. Jay",
      "citation": "L.R. 1872 7 Q.B. 756",
      "treatment": "followed",
      "relevance": "Surety discharged if creditor puts it out of power to hand over security to surety."
    },
    {
      "case_name": "Rees v. Barrington",
      "citation": "White Tudors C., 4th Edn. at p. 1002",
      "treatment": "followed",
      "relevance": "Surety entitled to securities; discharged if creditor loses/permits debtor possession or fails to make effectual."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Forest Act, 1927",
      "sections": [
        "s.82",
        "s.83"
      ],
      "relevance": "s.82: recover dues as land revenue arrears; s.83: first charge on produce, seize/sell if unpaid."
    },
    {
      "name": "Indian Contract Act, 1872",
      "sections": [
        "s.140",
        "s.141"
      ],
      "relevance": "Surety subrogated to creditor rights; discharged if creditor loses/part with security without consent."
    },
    {
      "name": "Sale of Goods Act",
      "sections": [
        "s.20"
      ],
      "relevance": "Property passes in deliverable state goods on contract agreement."
    },
    {
      "name": "Forest Contract Rules",
      "sections": [
        "r.2",
        "r.6",
        "r.8",
        "r.12",
        "r.13",
        "r.16",
        "r.29",
        "r.33"
      ],
      "relevance": "Deemed part of contract; govern removal, checks, termination on default, ownership post-removal."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court agreed with High Court and Trial Court that surety Kaluram discharged from liability as forest authorities parted with security by allowing removal of trees without payment of instalments.",
    "relief_granted": "Declaration that Kaluram not liable upheld; injunction against recovery from him upheld.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"A surety is entitled to the benefit of every security which the creditor has against the principal debtor... if the creditor loses, or, without consent of the surety, parts with such security, the surety is discharged to the extent of the value of the security.\"",
      "speaker": "court",
      "significance": "Direct application of s.141 Contract Act to discharge surety."
    },
    {
      "text": "\"We must in the circumstances hold that the entire quantity contracted to be sold to Jagatram had been removed, and the surety is, because the State has parted with the security which it held, discharged from liability.\"",
      "speaker": "court",
      "significance": "Core holding on full discharge due to loss of security."
    },
    {
      "text": "\"I take it to be established that the defendant became surety upon the faith of there being some real and substantial security pledged... He will, however, be discharged from his liability as surety if the creditors have put it out of their power to hand over to the surety the means of recouping himself.\"",
      "speaker": "court",
      "significance": "Quote from Wulff v. Jay explaining surety discharge principle."
    }
  ],
  "_case_id": "1966_169",
  "_label": 0,
  "_text_length": 20886,
  "_extracted_at": "2026-02-10T19:40:10.152433"
}