{
  "metadata": {
    "case_name": "Appellants (Landlords) v. Respondent No. 1 (Tenant)",
    "case_year": 1965,
    "court": "Supreme Court of India",
    "judges": [
      "Shelat, J."
    ],
    "case_number": "Civil Appeal No. 31 of 1965",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellants are the landlords and respondent No. 1 the tenant in respect of Survey Nos. 15/17/2, 1500/2 and 1500/4 situate in village Nangalwedha, District Sholapur. Under the tenancy the agreed rent was Rs. 95 per year.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Tenant made default in paying the rent. Appellants served him with a notice terminating the tenancy.",
      "type": "material",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "On March 12, 1957, appellants filed an application under section 29 of the Bombay Tenancy and Agricultural Lands Act LXVII of 1948 before the Mamlatdar for eviction and possession on the ground that the tenant had failed to pay rent on the due dates, that is, March 20th of each of the years 1951-52 to 1954-55 and therefore entitled to order of ejectment under section 25(2) of the Act. The Act applicable is before its amendment in 1956.",
      "type": "procedural",
      "date": "1957-03-12",
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "For the year 1951-52, landlords filed a suit for recovery of rent and tenant paid Rs. 142 after appeal against decree disposed on June 8, 1956. Rs. 142 comprised Rs. 95 for 1951-52 and Rs. 47/8/- being half the rent for 1952-53.",
      "type": "admitted",
      "date": "1956-06-08",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "For the year 1952-53, half of the rent due was paid in April 1956.",
      "type": "admitted",
      "date": "1956-04",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "For the year 1953-54, landlords filed an assistance suit and tenant paid the rent on May 5, 1955.",
      "type": "admitted",
      "date": "1955-05-05",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "For the year 1954-55, tenant paid and landlord received the rent on April 12, 1955.",
      "type": "admitted",
      "date": "1955-04-12",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Mamlatdar dismissed appellants' application on the ground that tenant having paid up the rent due and there being no arrears at the date of institution of the application, appellants not entitled to order of ejectment.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "In appeal before District Deputy Collector, held that though tenant failed to pay rent on due date, appellants having accepted all rents due before institution of application, defaults were not wilful and Deputy Collector had discretion not to order eviction.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Revenue Tribunal dismissed the appeal on the same ground.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Appellants filed Special Civil Application No. 65 of 1962 in Bombay High Court under Art. 227 challenging correctness of Tribunal's order. High Court dismissed on October 16, 1962 observing admitted position that landlords received all rent due, no arrears at date of application, no ground for interference.",
      "type": "procedural",
      "date": "1962-10-16",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Appellants obtained special leave from Supreme Court against High Court's order.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether under section 25(2) of the Bombay Tenancy and Agricultural Lands Act, 1948, landlord entitled to eviction once tenant made three defaults in payment of rent on due dates, even if all arrears paid and accepted by landlord before filing of application for ejectment.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "High Court in error in refusing to set aside Tribunal's order. Under s. 25(2) once tenant made three defaults, landlord entitled to terminate tenancy and order of eviction. No question of defaults being wilful or otherwise. Mere failure to pay on due dates sufficient, no room for equity relieving tenant against forfeiture.",
      "supporting_facts": [
        "f3",
        "f4",
        "f5",
        "f6",
        "f7"
      ],
      "legal_basis": "Section 25(2) Bombay Tenancy and Agricultural Lands Act, 1948; Raja Ram Mahadev Paranjipe Ors. v. Aba Maruti Mali Ors."
    },
    {
      "id": "pa2",
      "text": "Section 25(2) is mandatory and revenue authorities bound to order eviction even though tenant paid up rent and landlord accepted it before filing of application.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": "Section 25(2) Bombay Tenancy and Agricultural Lands Act, 1948"
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Question depends on construction of section 25. Sub-section (1) provides where tenancy terminated for non-payment, Mamlatdar calls upon tenant to pay arrears + costs within 15 days; if complies, orders tenancy not terminated. Sub-section (2) excludes application of sub-s.(1) if tenant failed for any three years to pay rent within period in s.14.",
      "addresses_issue": "i1",
      "key_observation": "Sub-s.(1) presupposes arrears at date of application which Mamlatdar can order paid, then tenancy not terminated. Sub-s.(2) for persistent default three years, no such power."
    },
    {
      "id": "cr2",
      "text": "Sub-s.(2) presupposes tenant in arrears at date of application, which Mamlatdar cannot order paid under sub-s.(1). If appellants' construction accepted, even if arrears paid and accepted before application, landlord could evict - astonishing result contrary to landlord-tenant principles.",
      "addresses_issue": "i1",
      "key_observation": "Legislature never intended such result."
    },
    {
      "id": "cr3",
      "text": "Section 30 provides Act does not limit tenant rights under usage, law, contract etc. Does not rule out payment and acceptance of arrears before suit waiving termination.",
      "addresses_issue": "i1",
      "key_observation": "Waiver possible."
    },
    {
      "id": "cr4",
      "text": "In Raja Ram case, held statutory right under s.25(2), no relief against forfeiture on equitable grounds or under TP Act s.114. But that case had arrears at filing; did not hold right to evict if no arrears and accepted prior.",
      "addresses_issue": "i1",
      "key_observation": "Raja Ram distinguished as arrears existed there."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "High Court's refusal to interfere with Tribunal's order justified as no arrears at date of application and rents accepted prior.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Raja Ram Mahadev Paranjipe Ors. v. Aba Maruti Mali Ors.",
      "citation": "1962 Supp. 1 S.C.R. 739",
      "treatment": "distinguished",
      "relevance": "Held statutory right to evict under s.25(2) after three defaults, no equitable relief; but case rested on arrears existing at filing of application, unlike present case."
    }
  ],
  "statutes_cited": [
    {
      "name": "Bombay Tenancy and Agricultural Lands Act, 1948 (LXVII of 1948)",
      "sections": [
        "Section 25(1)",
        "Section 25(2)",
        "Section 29",
        "Section 14",
        "Section 30",
        "Section 6(3)",
        "Section 27(1)",
        "Section 3"
      ],
      "relevance": "Governs eviction for non-payment of rent; s.25(1) allows relief if arrears paid; s.25(2) excludes relief for three defaults but presupposes arrears at application; s.30 preserves tenant rights including waiver."
    },
    {
      "name": "Transfer of Property Act",
      "sections": [
        "Section 114"
      ],
      "relevance": "Relief against forfeiture not available as inconsistent with the Act per s.3 of Tenancy Act."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 227"
      ],
      "relevance": "Basis for High Court special civil application."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court dismissed the appeal by special leave, upholding the High Court's refusal to interfere with the Revenue Tribunal's order dismissing eviction as all rents were paid and accepted before the application, no arrears subsisting.",
    "relief_granted": "None to appellants; tenant continues tenancy.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "Sub-section 2 therefore also pre-supposes (i) that the tenant has made defaults for more than two years and (ii) that the tenant was in arrears at the date of the application which arrears in this case the Mamlatdar cannot order the tenant to pay up.",
      "speaker": "court",
      "significance": "Core interpretation distinguishing s.25(1) and (2)"
    },
    {
      "text": "If this was not the correct construction of sub-section 2 and if the appellants construction were to be accepted it would lead to a very astonishing result, viz., that even where the tenant has paid up all the arrears and the landlord has accepted them, he would still have the right to evict the tenant.",
      "speaker": "court",
      "significance": "Rejects petitioner's absolute right to eviction post-payment"
    },
    {
      "text": "It will, however, be noticed that this Court did not hold that even where there are no arrears at the date of the application for ejectment and the landlord has prior thereto received and accepted the arrears which entitled him to terminate the tenancy, he would still have the right to obtain eviction against such a tenant.",
      "speaker": "court",
      "significance": "Distinguishes Raja Ram precedent"
    }
  ],
  "_case_id": "1967_79",
  "_label": 0,
  "_text_length": 10518,
  "_extracted_at": "2026-02-10T20:20:41.047884"
}