{
  "metadata": {
    "case_name": "Appellants v. Chimmapudi Subrahmanyam",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "Miter, J."
    ],
    "case_number": "Civil Appeal No. 611 of 1964",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "One Ramalingayya died in the year 1941 possessed of considerable properties including the lands which formed the subject matter of the civil revision petitions.",
      "type": "background",
      "date": "1941",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Before his death, Ramalingayya had adopted Chimmapudi Subrahmanyam, the respondent before this Court.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Subrahmanyam came into possession of the properties of his adoptive father after the latter's death.",
      "type": "background",
      "date": "1941",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Ramalingayya's widow, Kaveramma, raised a dispute about the factum and validity of the adoption and claimed the properties as the heir of her husband.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f5",
      "text": "Subrahmanyam filed a suit in the court of the District Munsif, Khammam for a declaration that he was the adopted son of Ramalingayya.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "Pending the disposal of the suit, Kaveramma claimed to have her name registered in the register maintained under the Hyderabad Land Revenue Act of 1317 F. by virtue of the provisions of s. 59 of that Act.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f7",
      "text": "The land revenue authorities registered Kaveramma as pattedar and dispossessed the adopted son of all the lands putting Kaveramma in possession thereof.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "The adopted son amended his plaint by including a prayer for possession.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "During the pendency of the suit, Kaveramma was prohibited by an order of injunction from dealing with the lands in any way.",
      "type": "procedural",
      "date": "1944",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "The suit of the adopted son was decreed by the trial court on March 24, 1951 both with regard to the declaration of the right of adoption and succession as also possession over the lands mentioned in the schedule to the plaint.",
      "type": "procedural",
      "date": "1951-03-24",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Some time in the year 1952, Kaveramma leased the lands which were the subject matter of the civil revision petitions to the appellants before this Court.",
      "type": "material",
      "date": "1952",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Kaveramma preferred an appeal from the decree passed against her and this was dismissed by the High Court in 1954.",
      "type": "procedural",
      "date": "1954",
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "The adopted son put the decree in execution and got delivery of possession through the court in August 1954.",
      "type": "procedural",
      "date": "1954-08",
      "source": "petitioner"
    },
    {
      "id": "f14",
      "text": "Very soon thereafter, in September 1954 the appellants surrendered possession of the lands to the adopted son and executed a deed in respect thereof.",
      "type": "material",
      "date": "1954-09",
      "source": "court"
    },
    {
      "id": "f15",
      "text": "About a year afterwards, on October 7, 1955, the appellants filed a petition for possession of the lands alleging that they had been in possession for the last six years in the capacity of tenants.",
      "type": "procedural",
      "date": "1955-10-07",
      "source": "petitioner"
    },
    {
      "id": "f16",
      "text": "Appellants alleged that the adopted son and his mother had dispossessed them from the suit lands and prayed for being put back into possession under S. 32 of the Hyderabad Tenancy and Agricultural Lands Act, 1950.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f17",
      "text": "The Tahsildar made an order in favour of the appellants in July 1958 which was upheld in appeal to the Collector in March 1959.",
      "type": "procedural",
      "date": "1958-07 / 1959-03",
      "source": "lower_court"
    },
    {
      "id": "f18",
      "text": "This led to the revision applications (C.R.P. No. 1128 of 1959 etc.) before the Andhra Pradesh High Court, which allowed the Civil Revision Petitions on September 10, 1962.",
      "type": "procedural",
      "date": "1962-09-10",
      "source": "lower_court"
    },
    {
      "id": "f19",
      "text": "Appeal by special leave to Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the appellants are entitled to possession under S. 32 of the Hyderabad Tenancy and Agricultural Lands Act, 1950 as deemed tenants under S. 5, having been lawfully cultivating the land inducted by the widow after the decree declaring the adopted son as owner.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The appellants were lawfully cultivating the land and should therefore be deemed to be tenants of such land under S. 5 of the Act.",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": "S. 5 Hyderabad Tenancy and Agricultural Lands Act, 1950; Dahya Lal v. Rasul Mohammed Abdul Hakim"
    },
    {
      "id": "pa2",
      "text": "The word 'lawfully' in S. 5 is to be taken in conjunction with 'cultivating' and the legislature intended to protect the actual tillers of the soil even if the person who put them in possession was found not to have any title to the land.",
      "supporting_facts": [
        "f11",
        "f15"
      ],
      "legal_basis": "S. 5 Hyderabad Tenancy and Agricultural Lands Act, 1950"
    },
    {
      "id": "pa3",
      "text": "Object of the Hyderabad Act of 1950 was to afford similar protection as given to tenants inducted by mortgagees under the Bombay Tenancy and Agricultural Lands Act, 1948.",
      "supporting_facts": [],
      "legal_basis": "Dahya Lal v. Rasul Mohammed Abdul Hakim; Bombay Tenancy and Agricultural Lands Act, 1948 S.4, S.14"
    },
    {
      "id": "pa4",
      "text": "Reliance on Calcutta High Court decisions under Bengal Tenancy Act where cultivators inducted by persons in possession were protected as non-occupancy ryots.",
      "supporting_facts": [],
      "legal_basis": "Mohima Chunder Saha v. Hazari Parmanik; Binad Lal Pakrashi v. Kalu Pramanik; Bengal Tenancy Act Ss.3,4,5,44"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The appellants before this Court never were the tenants of Ramalingayya. They were induced on the land by his widow after the decree of the suit for declaration of title and possession in favour of the adopted son.",
      "supporting_facts": [
        "f9",
        "f10",
        "f11"
      ],
      "legal_basis": "Hyderabad Tenancy and Agricultural Lands Act, 1950"
    },
    {
      "id": "ra2",
      "text": "After the passing of the decree, the possession of the widow could only be that of a trespasser and it was not open to her to create any right in the land in favour of anybody.",
      "supporting_facts": [
        "f10",
        "f11"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Appellants never were tenants of Ramalingayya; inducted by widow who was trespasser post-decree; her possession wrongful, could not create tenancy rights.",
      "addresses_issue": "i1",
      "key_observation": "After the passing of the decree, the possession of the widow could only be that of a trespasser and it was not open to her to create any right in the land in favour of anybody."
    },
    {
      "id": "cr2",
      "text": "Interpreting 'lawfully cultivating' under S.5: to deem tenants inducted by trespasser would encourage trespass and create rights where no title.",
      "addresses_issue": "i1",
      "key_observation": "This would indeed be a very strange provision of the law and would, if upheld, amount to encouraging trespass on the land by persons who had no shadow of title and creating rights in favour of others although they themselves had no title to the land."
    },
    {
      "id": "cr3",
      "text": "Asami shikmi requires lessee under instrument or oral agreement; appellants not so from true owner.",
      "addresses_issue": "i1",
      "key_observation": "A person who claims to be an asami shikmi had to be a lessee either holding under a document of lease or under an oral agreement."
    },
    {
      "id": "cr4",
      "text": "Dahya Lal distinguished: mortgagee in possession has authority to induct tenants in normal course of management; widow did not, as trespasser post-decree.",
      "addresses_issue": "i1",
      "key_observation": "Kaveramma did not induct the tenants on the land in the normal course of management of the property. She put them in possession when she had lost her right to be there."
    },
    {
      "id": "cr5",
      "text": "Calcutta cases under Bengal Tenancy Act distinguished: different scheme protecting ryots/non-occupancy ryots from ejectment except specific grounds; not applicable here.",
      "addresses_issue": "i1",
      "key_observation": "The scheme of the Bengal Tenancy Act was entirely different from the provisions of the Act we have to construe."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Appellants not deemed tenants under S.5 as not lawfully cultivating; widow as trespasser could not create tenancy rights; not entitled to possession under S.32.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Dahya Lal v. Rasul Mohammed Abdul Hakim",
      "citation": "1963 3 S.C.R. 1",
      "treatment": "distinguished",
      "relevance": "Tenants inducted by mortgagee in possession lawfully deemed tenants of mortgagor post-redemption; widow not analogous as trespasser without management authority."
    },
    {
      "case_name": "Mohima Chunder Saha v. Hazari Parmanik",
      "citation": "I.L.R. 17 Calcutta 45",
      "treatment": "distinguished",
      "relevance": "Under Bengal Tenancy Act, non-occupancy ryots protected from ejectment even if inducted by wrong person; different scheme from Hyderabad Act."
    },
    {
      "case_name": "Binad Lal Pakrashi v. Kalu Pramanik",
      "citation": "I.L.R. 2 Calcutta 708",
      "treatment": "distinguished",
      "relevance": "Under Bengal Tenancy Act, cultivators from persons in possession deemed ryots entitled to rent protection, not khas possession; different from Hyderabad Act."
    }
  ],
  "statutes_cited": [
    {
      "name": "Hyderabad Tenancy and Agricultural Lands Act, 1950",
      "sections": [
        "S. 32",
        "S. 2(v)",
        "S. 5"
      ],
      "relevance": "S.32 allows tenants to apply for possession; S.2(v) defines tenant including asami shikmi; S.5 deems lawfully cultivating persons as tenants subject to exceptions; appellants not lawfully cultivating as inducted by trespasser."
    },
    {
      "name": "Hyderabad Land Revenue Act, 1317 F.",
      "sections": [
        "S. 59",
        "S. 2(13)"
      ],
      "relevance": "S.59 allowed widow registration as pattedar pending suit; S.2(13) defines asami shikmi as lessee under instrument/oral agreement."
    },
    {
      "name": "Bombay Tenancy and Agricultural Lands Act, 1948",
      "sections": [
        "S. 2(18)",
        "S. 4",
        "S. 14"
      ],
      "relevance": "Referenced in Dahya Lal; similar deeming provision but for mortgagee-induced tenants."
    },
    {
      "name": "Bengal Tenancy Act",
      "sections": [
        "S. 3(3)",
        "S. 3(5)",
        "S. 4",
        "S. 5(2)",
        "S. 44"
      ],
      "relevance": "Defined ryots/non-occupancy ryots protecting cultivators from ejectment; distinguished as different scheme."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court dismissed the appeal by special leave, upholding the Andhra Pradesh High Court's order allowing the civil revision petitions and denying the appellants possession as tenants under the Hyderabad Tenancy and Agricultural Lands Act, 1950.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "After the passing of the decree, the possession of the widow could only be that of a trespasser and it was not open to her to create any right in the land in favour of anybody.",
      "speaker": "court",
      "significance": "Core reasoning denying validity of lease by trespasser."
    },
    {
      "text": "This would indeed be a very strange provision of the law and would, if upheld, amount to encouraging trespass on the land by persons who had no shadow of title.",
      "speaker": "court",
      "significance": "Rejects broad interpretation of 'lawfully cultivating' under S.5."
    },
    {
      "text": "A mortgagee in possession is excluded from the class of deemed tenants on ground of public policy... But a tenant of the mortgagee in possession is inducted on the land in the ordinary course of management.",
      "speaker": "court",
      "significance": "Distinguishes Dahya Lal case."
    }
  ],
  "_case_id": "1967_247",
  "_label": 0,
  "_text_length": 17845,
  "_extracted_at": "2026-02-10T20:23:27.716914"
}