{
  "metadata": {
    "case_name": "Appellant v. Respondent No. 1",
    "case_year": 1966,
    "court": "Supreme Court of India",
    "judges": [
      "Bhargava, J."
    ],
    "case_number": "Criminal Appeal No. 237 of 1966",
    "date_of_judgment": "1966-12-14"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The appellant was born on April 6, 1938, at Suryapet in Nalgonda District, Andhra Pradesh, and was educated and brought up there until the year 1951. His father died in 1947.",
      "type": "background",
      "date": "1938-04-06",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "After the partition of India and the enforcement of the Constitution, the appellant, in August 1951, left for Pakistan where he stayed until 1955.",
      "type": "background",
      "date": "1951-08",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "In 1955, he returned to India on a passport obtained from the Pakistan Government as a Pakistani citizen with a visa from the Indian Government. Even after the expiry of the visa, he continued to stay in India.",
      "type": "background",
      "date": "1955",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "In August, 1963, he was deported to Pakistan.",
      "type": "procedural",
      "date": "1963-08",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "He came again to India with a passport dated 4th December, 1963 issued by the Pakistan Government with a visa from the Indian High Commission dated 20th January, 1964. He arrived in India on 5th February, 1964.",
      "type": "background",
      "date": "1964-02-05",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The appellant filed a petition under Art. 226 of the Constitution challenging the order of deportation made by the Government of India. The petition was allowed by the High Court of Andhra Pradesh and the order of deportation was quashed on the ground that there had been no determination that the appellant had acquired Pakistani citizenship under s. 9 of the Citizenship Act by the Indian Government.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "A notice was issued to the appellant on 19th March, 1965 through the Government of Andhra Pradesh asking the appellant, within one month from the date of the service of the notice on him, to submit to the Government of Andhra Pradesh for onward transmission to consideration of the Central Government any representation that the appellant might wish to make.",
      "type": "procedural",
      "date": "1965-03-19",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "The appellant made two representations. The later of the two representations was sent by him in the month of May, 1965.",
      "type": "procedural",
      "date": "1965-05",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "The Government of India, on 18th August, 1965, issued an order holding that the appellant had voluntarily acquired the citizenship of Pakistan.",
      "type": "procedural",
      "date": "1965-08-18",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "The appellant challenged this order by another petition under Art. 226 of the Constitution before the High Court of Andhra Pradesh, and that petition was dismissed by the order dated October 7, 1966.",
      "type": "procedural",
      "date": "1966-10-07",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "In both representations, the appellant urged that he had not voluntarily acquired the citizenship of Pakistan, but he did not at any stage raise any plea that he had not voluntarily acquired the passports on the basis of which he came to India on the two occasions in 1955 and 1964.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "The appellant put forward a plea that when he went to Pakistan, he was a minor, but it was never urged that he had not gone to Pakistan voluntarily, or that he had left because he was compelled by the disturbed conditions in India, or that he was taken there by abduction or against his will.",
      "type": "disputed",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "After arrival in Pakistan, he stayed on for a period of four years.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "There was no plea that he was compelled to apply for the passport as a Pakistani citizen and did not, in fact, obtain it voluntarily. There is no mention that, when going to Pakistan, he tried to obtain any permit for a temporary visit nor was there any suggestion that before return, he tried to obtain a repatriation certificate.",
      "type": "admitted",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the Government of India gave the appellant an adequate opportunity of putting forward his case before giving its decision on 18th August, 1965 holding that the appellant had voluntarily acquired the citizenship of Pakistan, and whether it should have held an enquiry.",
      "framed_by": "appellant"
    },
    {
      "id": "i2",
      "text": "Whether the Government of India was competent under s. 9(2) of the Citizenship Act, 1955 to determine whether the appellant had acquired the citizenship of Pakistan.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The Government of India should have held an enquiry before arriving at this decision, as termination of Indian citizenship being the consequence of voluntary acquisition of foreign citizenship, the authority has to determine that such latter citizenship has been voluntarily acquired in a quasi-judicial enquiry with due notice and reasonable opportunity.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": "Mohd. Ayub Khan v. Commissioner of Police, Madras (1965) 2 S.C.R. 884"
    },
    {
      "id": "pa2",
      "text": "The appellant should have been given an opportunity to prove that he had not voluntarily obtained the passport from the Pakistan Government which was the basis of the decision.",
      "supporting_facts": [
        "f3",
        "f5",
        "f9"
      ],
      "legal_basis": "Paragraph 3 of Schedule III of the Citizenship Rules"
    },
    {
      "id": "pa3",
      "text": "In representations, urged that he had not voluntarily acquired the citizenship of Pakistan.",
      "supporting_facts": [
        "f8",
        "f11"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "It was not disputed that the Government of India was competent under s. 9(2) of the Citizenship Act, 1955 to determine whether the appellant had acquired the citizenship of Pakistan. Admittedly, the appellant had gone to Pakistan in August 1951 after the enforcement of the Constitution. The question whether he had migrated with the intention of voluntarily acquiring the citizenship of Pakistan and had actually acquired such citizenship could, therefore, be determined by the Government of India alone under s. 9(2) of the Citizenship Act.",
      "addresses_issue": "i2",
      "key_observation": "Government competent under s. 9(2)."
    },
    {
      "id": "cr2",
      "text": "The order dated 18th August, 1965 passed by the Government of India, shows that, before giving its decision, the Government considered the cause shown by the appellant and gave due regard to the principles of evidence contained in Schedule III of the Citizenship Rules, 1956 in accordance with Rule 30 thereof.",
      "addresses_issue": "i1",
      "key_observation": "Government considered representations and applied relevant rules."
    },
    {
      "id": "cr3",
      "text": "On the facts of the present case, there was no occasion for the Government of India to enter into any such enquiry. The appellant did not at any stage raise any plea that he had not voluntarily acquired the passports. No facts alleged like compulsion, abduction, temporary permit, or repatriation certificate. Provisions of paragraph 3 of Schedule III clearly applicable as appellant obtained passports representing himself to be a Pakistani citizen.",
      "addresses_issue": "i1",
      "key_observation": "No plea raised against voluntary obtaining of passports, so no further enquiry needed; conclusive presumption applies."
    },
    {
      "id": "cr4",
      "text": "Mohd. Ayub Khan distinguished because in this case no such plea was raised by the appellant.",
      "addresses_issue": "i1",
      "key_observation": "Facts differ from cited precedent."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The order dated 18th August, 1965 passed by the Government of India does not suffer from any infirmity.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Mohd. Ayub Khan v. Commissioner of Police, Madras and Another",
      "citation": "1965 2 S.C.R. 884",
      "treatment": "distinguished",
      "relevance": "Discussed requirements for quasi-judicial enquiry and opportunity when plea raised that passport not voluntarily obtained, but distinguished as no such plea here."
    }
  ],
  "statutes_cited": [
    {
      "name": "Citizenship Act, 1955",
      "sections": [
        "s. 9(2)"
      ],
      "relevance": "Government competent to determine if appellant voluntarily acquired Pakistani citizenship."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 226"
      ],
      "relevance": "Basis for petitions challenging deportation and citizenship order."
    },
    {
      "name": "Citizenship Rules, 1956",
      "sections": [
        "Rule 30",
        "Schedule III paragraph 3"
      ],
      "relevance": "Government considered principles of evidence; paragraph 3 raises conclusive presumption that obtaining foreign passport means voluntary acquisition of citizenship before that date."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal by special leave is dismissed. The order dated 18th August, 1965 by Government of India holding appellant voluntarily acquired Pakistani citizenship is upheld as valid, having considered representations and applied relevant rules without need for further enquiry.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"Determination of the question postulates an approach as in a quasi-judicial enquiry the citizen concerned must be given due notice... and reasonable opportunity must be afforded to the citizen to convince the authority that what is alleged against him is not true.\"",
      "speaker": "court",
      "significance": "Quotes precedent on enquiry requirements, later distinguished."
    },
    {
      "text": "\"We, however, find that, on the facts of the present case, there was no occasion for the Government of India to enter into any such enquiry.\"",
      "speaker": "court",
      "significance": "Core holding why no further enquiry needed."
    },
    {
      "text": "\"It cannot, therefore, be said that, in this case, the Government of India failed to hold any enquiry which it was required to do, and consequently, the order dated 18th August, 1965... does not suffer from any infirmity.\"",
      "speaker": "court",
      "significance": "Final validation of the government order."
    }
  ],
  "_case_id": "1967_112",
  "_label": 0,
  "_text_length": 8915,
  "_extracted_at": "2026-02-10T20:21:28.179569"
}