{
  "metadata": {
    "case_name": "State of Madras v. Zenith Lamps and Electricals Ltd. & Others",
    "case_year": 1967,
    "court": "Supreme Court of India",
    "judges": [
      "Wanchoo, C.J."
    ],
    "case_number": "Civil Appeal No. 150 of 1967 (and other connected appeals)",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "On August 19, 1964, at about 5.00 p.m., the officers of the Commercial Tax Department raided the premises of Zenith Lamps and Electricals Ltd.",
      "type": "material",
      "date": "1964-08-19",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "A suit-case was seized and forcibly removed by the officers who made the raid, in spite of the fact that they were informed that the box did not contain any papers or documents belonging to the company and its contents consisted merely of personal effects of one of the managing directors, namely, Shri Ramkishan Shrikishan Jhaver.",
      "type": "disputed",
      "date": "1964-08-19",
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "The raid and search were made by the authorities concerned on information that Shri Goenka, one of the Directors of the Company had removed a box containing secret accounts relating to it.",
      "type": "material",
      "date": "1964-08-19",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "In the other petitions which have resulted in the other appeals before this Court there was search and seizure by the officers of the department and their action is being attacked on the same grounds.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The High Court found with respect to one of the petitions that the search warrant issued for the search of the residential house by the Magistrate disclosed that the magistrate had not applied his mind at all to the necessity of the search of the residential house, for columns in the printed search warrant which should have been struck out were not so struck out. Further the gaps in the printed form which should have been filled in before the warrant was issued had not been filled in.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "The High Court further found that Section 41(4) was not complied with strictly before confiscation was ordered and no proper opportunity was given to the dealer to show that the goods seized and confiscated were not accounted for in his accounts.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "The High Court allowed all the petitions and directed that the documents, things and goods covered by the petitions should be returned to the petitioners along with photographs, negatives, translations and notes made by the Department from the accounts etc.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "The safeguards provided under Section 165 of the Code of Criminal Procedure do not appear to have been followed when the search was made.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether on a proper construction of Section 41 of the Madras General Sales Tax Act, No. 1 of 1959, the officers of the Department had authority to search the premises and seize either the account books or the goods found therein.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether Section 41(4) authorizing seizure and confiscation of goods was beyond the legislative competence of the State Legislature, for it could not be covered by item 54 of List II of the Seventh Schedule to the Constitution relating to taxes on the sale or purchase of goods.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether various provisions in Section 41 capable of being construed as authorizing search and seizure were unconstitutional in view of Article 19(1)(f) and (g) of the Constitution.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Section 41(2) did not allow search being made thereunder, as it only provided for inspection, and the search was a different thing altogether from inspection.",
      "supporting_facts": [],
      "legal_basis": "Section 41(2) of Madras General Sales Tax Act"
    },
    {
      "id": "pa2",
      "text": "The power of seizure and confiscation of goods contained in sub-section (4) could not be said ancillary and incidental to power to tax sale or purchase of goods and therefore this provision was beyond the legislative competence of the State legislature.",
      "supporting_facts": [],
      "legal_basis": "Item 54, List II, Seventh Schedule to the Constitution"
    },
    {
      "id": "pa3",
      "text": "Sub-section (2), (3) and (4) of section 41 were unconstitutional as they were unreasonable restrictions on the fundamental rights guaranteed under article 19(1)(f) and (g) of the Constitution.",
      "supporting_facts": [
        "f5",
        "f6"
      ],
      "legal_basis": "Article 19(1)(f) and (g)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Section 41 authorised search and seizure.",
      "supporting_facts": [],
      "legal_basis": "Section 41 of Madras General Sales Tax Act"
    },
    {
      "id": "ra2",
      "text": "The State legislature was competent to enact section 41(4) under item 54 of List II of the Seventh Schedule to the Constitution.",
      "supporting_facts": [],
      "legal_basis": "Item 54, List II, Seventh Schedule; power to confiscate ancillary to tax evasion prevention"
    },
    {
      "id": "ra3",
      "text": "The provisions in question did not offend article 19(1)(f) and (g) of the Constitution and were in any case protected by article 19(5) and (6).",
      "supporting_facts": [],
      "legal_basis": "Article 19(5) and (6)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Sub-section 2 provides that all accounts etc. of the dealer shall be open to inspection and dealers offices, shops, godowns, vessels or vehicles shall be open to inspection. Reading these provisions together, the empowered officer has the right to enter the offices etc., and to inspect them, and if on such inspection he finds accounts etc., he has also the power to inspect them. These two powers taken together mean that the empowered officer has the power to search the office etc., and inspect accounts etc., found therein.",
      "addresses_issue": "i1",
      "key_observation": "Power of search is implicit in sub-section 2 though the word 'search' is not used."
    },
    {
      "id": "cr2",
      "text": "The proviso to sub-section 2 refers to 'all searches under this sub-section' confirming that searches are contemplated. Proviso provides for search of residential accommodation only with warrant and searches to be in accordance with CrPC.",
      "addresses_issue": "i1",
      "key_observation": "Proviso supports construction that main part provides for searches."
    },
    {
      "id": "cr3",
      "text": "Sub-section 3 provides for seizure of accounts if reason to suspect evasion, for reasons recorded in writing. Complementary to search power in sub-section 2.",
      "addresses_issue": "i1",
      "key_observation": "Seizure presupposes search."
    },
    {
      "id": "cr4",
      "text": "Sub-section 4 power to seize and confiscate unaccounted goods. Clause (a) of second proviso repugnant to scheme of Act as it requires recovery of tax before taxable event (first sale). Clause (a) falls on ground of repugnancy. Not severable as proviso integral.",
      "addresses_issue": "i2",
      "key_observation": "Sub-section 4 falls due to repugnancy in second proviso clause (a)."
    },
    {
      "id": "cr5",
      "text": "Searches under sub-section 2 to be made as far as may be in accordance with CrPC, including safeguards in Section 165 (reasonable belief, record grounds, etc.). Officers not of low status. Restrictions reasonable for preventing tax evasion.",
      "addresses_issue": "i3",
      "key_observation": "Sub-sections 2 and 3 impose reasonable restrictions protected by Art 19(5) and (6)."
    },
    {
      "id": "cr6",
      "text": "Sub-section 3 has additional safeguards: reasons recorded before seizure, receipt, retention only as necessary, max 30 days without higher authority permission.",
      "addresses_issue": "i3",
      "key_observation": "Sufficient safeguards make it reasonable."
    },
    {
      "id": "cr7",
      "text": "In facts, search warrant defective (magistrate no application of mind), Section 165 safeguards not followed, sub-section 4 invalid, so seized items to be returned.",
      "addresses_issue": "i1",
      "key_observation": "High Court order stands despite disagreement on interpretation and constitutionality."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Section 41(2) implicitly authorizes search of business premises (offices, shops etc.) without warrant, subject to CrPC safeguards; residential only with warrant.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Section 41(3) authorizes seizure of accounts on recorded suspicion of evasion, complementary to search.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Section 41(4) ultra vires due to repugnancy in second proviso clause (a) requiring pre-sale tax recovery; not severable.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h4",
      "text": "Sections 41(2) and (3) impose reasonable restrictions on Art 19(1)(f) and (g), protected by Art 19(5) and (6), with CrPC safeguards.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Rhondda Urban District Council v. Taff Vale Railway Co.",
      "citation": "1909 AC 253",
      "treatment": "referred",
      "relevance": "Proviso may be substantive provision, not merely exception."
    },
    {
      "case_name": "Commissioner of Income-tax v. Nandlal Bhandari Sons",
      "citation": null,
      "treatment": "referred",
      "relevance": "Proviso may embody substantive provision; determined by substance not form."
    },
    {
      "case_name": "State of Rajasthan v. Leela Jain",
      "citation": null,
      "treatment": "referred",
      "relevance": "Proviso may be independent legislative provision providing alternative remedy."
    }
  ],
  "statutes_cited": [
    {
      "name": "Madras General Sales Tax Act, 1959",
      "sections": [
        "Section 3",
        "Section 4",
        "Section 41(1)",
        "Section 41(2)",
        "Section 41(3)",
        "Section 41(4)"
      ],
      "relevance": "Charging sections for sales tax; powers of inspection, search, seizure, confiscation to prevent evasion."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 19(1)(f)",
        "Article 19(1)(g)",
        "Article 19(5)",
        "Article 19(6)",
        "Seventh Schedule List II Item 54"
      ],
      "relevance": "Fundamental rights to property and trade; reasonable restrictions; legislative competence for sales tax."
    },
    {
      "name": "Code of Criminal Procedure, 1898",
      "sections": [
        "Section 165",
        "Chapter VII"
      ],
      "relevance": "Safeguards for searches apply mutatis mutandis to searches under Section 41(2)."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeals by the State fail and are dismissed. The High Court order allowing the writ petitions and directing return of seized documents, things, goods, photographs, negatives, translations and notes stands, as search warrant defective, CrPC safeguards not followed, and Section 41(4) invalid.",
    "relief_granted": "Documents, things and goods to be returned to petitioners along with photographs, negatives, translations and notes made by Department.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"Though therefore the word search has not been used in sub-s. 2 these two powers of entering the offices etc., for inspection and of inspecting every kind of account maintained by a dealer with respect to his business together amount to giving the officer concerned the powers to enter and search the offices etc.\"",
      "speaker": "court",
      "significance": "Core holding on implicit search power in Section 41(2)."
    },
    {
      "text": "\"We are therefore of opinion that Clause (a) of the second proviso being repugnant to the entire scheme of the Act... must fall, on the ground of repugnancy.\"",
      "speaker": "court",
      "significance": "Reason for striking down Section 41(4)."
    },
    {
      "text": "\"These safeguards, which in our opinion apply to searches under sub-section 2 also clearly show that the power to search under sub-section 2 is not arbitrary.\"",
      "speaker": "court",
      "significance": "Upholds constitutionality via CrPC safeguards."
    }
  ],
  "_case_id": "1967_309",
  "_label": 0,
  "_text_length": 46751,
  "_extracted_at": "2026-02-10T20:24:01.621996"
}