{
  "metadata": {
    "case_name": "State of Assam v. Gauhati Municipal Board",
    "case_year": 1966,
    "court": "Supreme Court of India",
    "judges": [
      "Wanchoo, J."
    ],
    "case_number": "Civil Appeal No. 1268 of 1966",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "After the municipal election, new members of the Gauhati Municipal Board began to function from July 7, 1962. The term of the members is four years and would normally have expired on July 6, 1966.",
      "type": "background",
      "date": "1962-07-07",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On June 9, 1964, the State Government issued notice to the Board under s. 298 of the Assam Municipal Act, No. XV of 1957, stating it was of the opinion that the Board was incompetent to perform or had persistently made default in performance of duties or abused its powers, tentative conclusion that Board should be superseded, listed eight charges, asked Board to show cause and give explanation.",
      "type": "procedural",
      "date": "1964-06-09",
      "source": "state"
    },
    {
      "id": "f3",
      "text": "The Board gave its explanation on August 10, 1964.",
      "type": "procedural",
      "date": "1964-08-10",
      "source": "respondent"
    },
    {
      "id": "f4",
      "text": "The explanation was considered by the State Government and on December 9, 1964, notification issued superseding the Board for one year with effect from December 14, 1964, stating reasons and finding six charges proved.",
      "type": "procedural",
      "date": "1964-12-09",
      "source": "state"
    },
    {
      "id": "f5",
      "text": "On December 24, 1964, the Board filed a writ petition in the Assam and Nagaland High Court in Civil Rule No. 306 of 1964 challenging the supersession on grounds including: violation of natural justice (no personal hearing or opportunity to produce evidence as quasi-judicial); charges found proved different from those in notice; State prejudged issue by tentative conclusion to supersede.",
      "type": "procedural",
      "date": "1964-12-24",
      "source": "respondent"
    },
    {
      "id": "f6",
      "text": "The State opposed the writ, contending proceedings administrative not quasi-judicial, or if quasi-judicial complied with s.298; charges same; no prejudgment.",
      "type": "procedural",
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "Assam and Nagaland High Court by judgment and order dated May 21, 1965 allowed the writ petition, quashed the supersession order of December 9, 1964, holding proceedings quasi-judicial with violation of natural justice, charges different, and prejudgment.",
      "type": "procedural",
      "date": "1965-05-21",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Appeal by special leave to Supreme Court. Respondent secured stay order and continued to function for full four years till July 6, 1966.",
      "type": "procedural",
      "date": "1966-07-06",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether proceedings under s. 298 of the Act are quasi-judicial and whether principles of natural justice violated by lack of personal hearing and opportunity to produce evidence.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether charges found proved in notification of December 9, 1964 were different from charges in notice of June 9, 1964.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether State Government prejudged the issue by stating tentative conclusion to supersede in the notice of June 9, 1964.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Proceedings under s. 298 are administrative not quasi-judicial; even if quasi-judicial, complied with procedure by giving notice, indicating charges, receiving and considering explanation; no violation of natural justice.",
      "supporting_facts": [
        "f2",
        "f3",
        "f4"
      ],
      "legal_basis": "s. 298 Assam Municipal Act"
    },
    {
      "id": "pa2",
      "text": "Charges found proved were the same as those levelled in notice (six out of eight, reordered).",
      "supporting_facts": [
        "f2",
        "f4"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Tentative indication of supersession in notice did not mean prejudgment; open to conviction after explanation.",
      "supporting_facts": [
        "f2",
        "f3",
        "f4"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Proceedings quasi-judicial; violated natural justice by denying personal hearing and opportunity to produce evidence.",
      "supporting_facts": [
        "f2",
        "f4"
      ],
      "legal_basis": "principles of natural justice"
    },
    {
      "id": "ra2",
      "text": "Charges found proved different from those in notice.",
      "supporting_facts": [
        "f2",
        "f4"
      ],
      "legal_basis": "s. 298 Assam Municipal Act"
    },
    {
      "id": "ra3",
      "text": "State prejudged by tentative conclusion to supersede in notice before considering explanation.",
      "supporting_facts": [
        "f2"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Assuming proceedings quasi-judicial, no violation of natural justice as s.298 procedure fully complied with (notice given, charges indicated, explanation received and considered); Board never demanded personal hearing or opportunity to produce materials; principles of natural justice do not require it absent demand.",
      "addresses_issue": "i1",
      "key_observation": "Where provision like s.298 fully complied with and no demand for personal hearing or production of materials, no violation of natural justice."
    },
    {
      "id": "cr2",
      "text": "Charges found proved substantially same as in notice (six charges matched, reordered; seventh and eighth mere inferences not needing explanation).",
      "addresses_issue": "i2",
      "key_observation": "No difference in substance between charged and proved."
    },
    {
      "id": "cr3",
      "text": "Tentative conclusion in notice does not mean prejudgment; State open to conviction; no analogy to Art.311 requiring two notices; no reason proceedings were farce.",
      "addresses_issue": "i3",
      "key_observation": "Tentative communication of intended action does not preclude change of mind after explanation."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "No violation of natural justice under s.298 where procedure followed and no demand for personal hearing.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Charges proved same as charged.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h3",
      "text": "No prejudgment by tentative conclusion in notice.",
      "resolves_issue": "i3",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Assam Municipal Act, No. XV of 1957",
      "sections": [
        "s. 298"
      ],
      "relevance": "Empowers State to dissolve/supersede Board after notice and consideration of explanation if incompetent/default/abuse of powers; procedure followed here."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 311"
      ],
      "relevance": "Analogy rejected; special procedure for public servants not applicable to s.298."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed, High Court order set aside, writ petition dismissed. No orders as to costs.",
    "relief_granted": "Supersession order upheld implicitly by quashing writ.",
    "costs": "No orders as to costs"
  },
  "key_quotes": [
    {
      "text": "where a provision like s. 298 is fully complied with as in this case and the Board does not ask for an opportunity for personal hearing or for production of materials in support of its explanation, principles of natural justice do not require that the State Government should ask the Board to appear for a personal hearing",
      "speaker": "court",
      "significance": "Core holding on natural justice under s.298"
    },
    {
      "text": "there was no difference in substance between what was charged and what was found proved.",
      "speaker": "court",
      "significance": "Rejects High Court's finding on charges"
    },
    {
      "text": "Such tentative conclusion communicated to the Board does not mean that the State Government is not open to conviction at all",
      "speaker": "court",
      "significance": "Rejects prejudgment argument"
    }
  ],
  "_case_id": "1967_184",
  "_label": 1,
  "_text_length": 14093,
  "_extracted_at": "2026-02-10T20:22:01.681100"
}