{
  "metadata": {
    "case_name": "State of Andhra Pradesh v. Respondents",
    "case_year": 1965,
    "court": "Supreme Court of India",
    "judges": [
      "Vaidialingam, J."
    ],
    "case_number": "Criminal Appeal No. 6 of 1965",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "On early morning of June 10, 1962, prohibition staff found a bullock cart driven by first respondent transporting fifty gallons of arrack in 13 tins.",
      "type": "material",
      "date": "1962-06-10",
      "source": "prosecution"
    },
    {
      "id": "f2",
      "text": "Prohibition Sub-Inspector (P.W.1) and petty officer (P.W.4) stated that when bullock cart came near them, there was smell of arrack; tins pierced with bayonet and gave strong smell of arrack.",
      "type": "material",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f3",
      "text": "P.Ws. 2 and 3 witnessed the occurrence, stated strong smell of arrack from cart, 12 tins pierced with bayonet ends and contents verified.",
      "type": "material",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f4",
      "text": "Respondents denied committing the offence.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f5",
      "text": "Trial court accepted prosecution evidence, found strong smell of arrack established transportation of arrack, convicted respondents under s.4(1)(a) of the Act, sentenced each to rigorous imprisonment for six months.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "Sessions Judge, Kurnool, confirmed conviction, held prohibition officer's experience in smelling arrack sufficient proof, no further testing needed.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "High Court in revision accepted respondents' plea of no proper proof that commodity was arrack, held prosecution should have got commodity examined by Chemical Examiner, set aside conviction on January 17, 1964.",
      "type": "procedural",
      "date": "1964-01-17",
      "source": "high_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether prosecution established that the commodity transported was liquor under s.3(9) of the Act based solely on smell by prohibition officers, without chemical analysis.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Prohibition Inspector and petty officer well aware of arrack; High Court not justified in interfering with subordinate courts; contents examined by piercing tins with bayonet, Sub-Inspector satisfied it was arrack.",
      "supporting_facts": [
        "f2",
        "f5",
        "f6"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Accused did not effectively challenge prosecution witnesses' statement that commodity was arrack.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "No proper proof tins contained arrack; mere smell from pierced tins insufficient; samples should have been sent to Chemical Examiner.",
      "supporting_facts": [
        "f4",
        "f7"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Prosecution must prove commodity is liquor under s.3(9) and accused transported it; mere general statement of strong smell of alcohol from pierced tins insufficient; conviction cannot be based solely on prohibition officers' smelling sense.",
      "addresses_issue": "i1",
      "key_observation": "Better proof by technical person from scientific point of view necessary to establish article is liquor."
    },
    {
      "id": "cr2",
      "text": "Accused's denial and lack of effective challenge does not absolve prosecution from proving ingredients of offence.",
      "addresses_issue": "i1",
      "key_observation": "High Court justified in holding prosecution failed to establish guilt under s.4(1)(a)."
    },
    {
      "id": "cr3",
      "text": "Distinguished Baidyanath Mishra v. State of Orissa as facts different; there opium's characteristic appearance and scent identifiable without analysis, and accused were licensed vendors who did not challenge.",
      "addresses_issue": "i1",
      "key_observation": "Observations in that case do not apply here."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Prosecution has not established that respondents guilty of offence under s.4(1)(a) of the Act; High Court justified in setting aside conviction.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Baidyanath Mishra v. State of Orissa",
      "citation": "Crl. Ap. No. 270/1964 decided on 17-4-1967",
      "treatment": "distinguished",
      "relevance": "Rejected contention that chemical analysis unnecessary for opium due to characteristic appearance and scent; facts different from instant case."
    }
  ],
  "statutes_cited": [
    {
      "name": "Andhra Pradesh (Andhra Area) Prohibition Act, 1937 (Act X of 1937)",
      "sections": [
        "s.3(8)",
        "s.3(9)",
        "s.4(1)(a)"
      ],
      "relevance": "Defines intoxicating drug, liquor (includes spirits, liquids containing alcohol); prohibits transport of liquor with punishment."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court upheld High Court's order setting aside conviction of respondents under s.4(1)(a) of the Act, holding prosecution failed to prove commodity was liquor without scientific analysis.",
    "relief_granted": "Conviction set aside",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"Merely trusting to the smelling sense of the Prohibition Officers, and basing a conviction, on an opinion expressed by those officers, under the circumstances, cannot justify the conviction of the respondents.\"",
      "speaker": "court",
      "significance": "Core reasoning why smell alone insufficient proof."
    },
    {
      "text": "\"In our opinion, better proof, by a technical person, who has considered the matter from a scientific point of view, is not only desirable, but even necessary, to establish that the article seized is one coming within the definition of liquor.\"",
      "speaker": "court",
      "significance": "Establishes requirement for scientific proof in such cases."
    }
  ],
  "_case_id": "1967_49",
  "_label": 0,
  "_text_length": 11075,
  "_extracted_at": "2026-02-10T20:20:34.698604"
}