{
  "metadata": {
    "case_name": "State of Maharashtra v. Purshottamdas Ranchhoddas",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "Hidayatullah, J."
    ],
    "case_number": "Criminal Appeal No. 234 of 1964",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Purshottamdas Ranchhoddas was a lessee from the Port Trust Bombay of an open plot of land. He established a factory called the Sunderdas Saw Mills.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "He closed down the factory on April 1, 1957.",
      "type": "material",
      "date": "1957-04-01",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "In July 1957, the ex-workers of the factory combined together to form five partnerships and by agreements of leave and licence, Purshottamdas Ranchhoddas gave in their use, the premises of the factory and the machinery installed there. He himself did not join any of the five partnerships. The licensees were to pay a fixed sum for the use of the premises and the machines.",
      "type": "material",
      "date": "1957-07",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Some of the workers who were not taken in as partners complained that the closure of the factory was a sham. No action was taken on this complaint and there is no finding in this case that the closure of the factory was unreal.",
      "type": "disputed",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "In the year 1959, a prosecution was started under S. 92 of the Factories Act on the charge that the original licensee of the factory had not given notice under s. 71 of the start of the factory and had not renewed the licence under r. 4 of the Bombay Factories Rules, 1950. This ended in an acquittal since Government had not declared these premises as a factory under s. 85 of the Act.",
      "type": "procedural",
      "date": "1959",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "On September 29, 1960, a notification was issued under s. 85. That notification specified the places where the five partnerships were working as factory.",
      "type": "material",
      "date": "1960-09-29",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "On November 10, 1959, five separate complaints were filed for failure to take out five licences. The charge was that Purshottamdas Ranchhoddas was the owner of the factory and hence an occupier and the workmen were working under an agreement with him.",
      "type": "procedural",
      "date": "1959-11-10",
      "source": "prosecution"
    },
    {
      "id": "f8",
      "text": "The owner defended himself by stating that he had no control over the five firms and he could not enforce the provisions of the Factories Act. This defence was not accepted. Purshottamdas Ranchhoddas was held to have become an occupier by reason of the notification and, therefore, to be compelled to take out a licence under r. 3-A of the Bombay Factories Rules. He was fined Rs. 201/- for the first offence and Rs. 25/- for the subsequent offences.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Purshottamdas Ranchhoddas appealed but died during the pendency of the appeal. As the sentence was one of fine the appeal was continued by his legal representative under s. 431 of the Code of Criminal Procedure. The Bombay High Court set aside the conviction and fine dated November 8, 1963.",
      "type": "procedural",
      "date": "1963-11-08",
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "The true construction of S. 85 of the Factories Act on which different views have been expressed by the High Court and the Court below.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Inasmuch as a notification had issued under s. 85(1)(ii), the owner of the premises (the present lessee of the premises namely Purshottamdas Ranchhoddas) became an occupier and thus liable for breach of the Factories Act and the Bombay Factories Rules since the premises were not licensed.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": "S. 85 Factories Act, 1948"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "He had no control over the five firms and he could not enforce the provisions of the Factories Act.",
      "supporting_facts": [
        "f3",
        "f8"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "The agreements show that the premises were given over to partnership firms in return for a periodic payment. The agreements show that the licensees of the premises bound themselves to carry on the manufacturing process on their own and Purshottamdas Ranchhoddas had no control over them.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Under s. 2(n) of the Act an occupier of a factory means the person who has the ultimate control over the affairs of the factory. If one goes by this definition, Purshottamdas Ranchhoddas was not an occupier if he had no the ultimate control over the affairs of the five partnership firms running the factory.",
      "addresses_issue": "i1",
      "key_observation": "Purshottamdas Ranchhoddas was not an occupier if he had no the ultimate control over the affairs of the five partnership firms."
    },
    {
      "id": "cr2",
      "text": "The condition precedent for the notification is that the persons working therein (a) work with permission of or (b) under agreement with the owner. The section does not contemplate a case where the owner hands over the factory on rent and the workers work without his permission and not under agreement with him.",
      "addresses_issue": "i1",
      "key_observation": "If there is no connection between the owner and the workmen in the sense that they work without his permission and without an agreement with him, there would be no question of the liability of the owner as an occupier."
    },
    {
      "id": "cr3",
      "text": "The High Court has considered the clauses and come to the conclusion that the partnerships were independent of the control of the owner and the workers cannot be said to be working with his permission or under agreement with him. They had formed themselves into partnerships, taken on leave and licence the factory premises and started their own business. In these circumstances, the conditions for the notification hardly existed.",
      "addresses_issue": "i1",
      "key_observation": "Conditions for notification under s.85(1)(ii) hardly existed."
    },
    {
      "id": "cr4",
      "text": "S. 93 makes special provision for the responsibility of the owner but a clause like 93(3)(ii) clearly shows that the owner is liable only when he has control. The machinery and plant has been so specifically entrusted to the custody or use of the various partnerships and the owner of the premises cannot be made liable.",
      "addresses_issue": "i1",
      "key_observation": "Owner not liable under s.93 as machinery entrusted to partnerships."
    },
    {
      "id": "cr5",
      "text": "The finding is not that the owner had indulged in a sham transaction. If the transactions are genuine and the five partnerships have taken over the factory to work independently, no question of the liability of the owner under s. 85(1)(ii) arises.",
      "addresses_issue": "i1",
      "key_observation": "Transactions genuine, no liability under s.85."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "S. 85(1)(ii) did not cover the present case. Purshottamdas Ranchhoddas could not be made liable for not taking out the licence.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Factories Act, 1948",
      "sections": [
        "S. 85",
        "S. 92",
        "S. 2(n)",
        "S. 93",
        "S. 71"
      ],
      "relevance": "Power to apply Act to certain premises; definition of occupier; responsibility of owner; prosecution for contravention; notice of start of factory"
    },
    {
      "name": "Bombay Factories Rules, 1950",
      "sections": [
        "r. 3-A",
        "r. 3",
        "r. 4"
      ],
      "relevance": "Licence required for use as factory; application for approval; renewal of licence"
    },
    {
      "name": "Code of Criminal Procedure",
      "sections": [
        "s. 431"
      ],
      "relevance": "Continuation of appeal by legal representative when sentence is fine"
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal by the State of Maharashtra fails and is dismissed. The Supreme Court upholds the Bombay High Court's decision setting aside the conviction and fine of Purshottamdas Ranchhoddas under s.92 of the Factories Act read with r.3-A of the Bombay Factories Rules.",
    "relief_granted": "Conviction and fine set aside (upholding High Court)",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The condition precedent for the notification is that the persons working therein (a) work with permission of or (b) under agreement with the owner.",
      "speaker": "court",
      "significance": "Defines scope of s.85(1)(ii)"
    },
    {
      "text": "If there is no connection between the owner and the workmen in the sense that they work without his permission and without an agreement with him, there would be no question of the liability of the owner as an occupier.",
      "speaker": "court",
      "significance": "Key reasoning why owner not liable"
    },
    {
      "text": "The High Court was right.",
      "speaker": "court",
      "significance": "Supreme Court agrees with High Court interpretation"
    }
  ],
  "_case_id": "1967_139",
  "_label": 0,
  "_text_length": 9851,
  "_extracted_at": "2026-02-10T20:21:17.939489"
}