{
  "metadata": {
    "case_name": "Indore Municipality Corporation v. Trustees of Charitable Trust",
    "case_year": 1965,
    "court": "Supreme Court of India",
    "judges": [
      "Shelat, J."
    ],
    "case_number": "Civil Appeal No. 141 of 1965",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Respondents as trustees of a charitable trust are owners of certain houses situate in Indore City.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Prior to January 26, 1954, Indore Municipality governed by Indore City Municipal Act, 4 of 1909, levied house tax at rate of 7% of gross annual letting value, duly paid by trustees.",
      "type": "admitted",
      "date": "1954-01-26",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Madhya Bharat Municipalities Act, 1954 came into force on January 26, 1954, repealed Indore City Municipal Act, 1909.",
      "type": "material",
      "date": "1954-01-26",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Indore Municipality purported to levy house tax at 7% of gross annual letting value for financial years 1953-54 and 1954-55.",
      "type": "disputed",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Respondents objected on ground that under 1954 Act, tax to be assessed on gross annual letting value less 10% statutory allowance in lieu of costs of repairs or any other account.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f6",
      "text": "Difference amounted to Rs. 1,461, trustees claimed refund as excess collected under pain of distress.",
      "type": "material",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f7",
      "text": "Municipality refused refund, respondents filed suit to recover excess as illegally recovered.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Trial Court decreed suit, appeals by Corporation to District Court and High Court dismissed.",
      "type": "procedural",
      "date": "1963-12-07",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Under rules of repealed Indore Act 1909, tax imposed at 7% gross annual letting value, assessment list prepared for 1952-53, used for subsequent years.",
      "type": "background",
      "date": "1952-53",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the house tax levied at 7% of gross annual letting value for 1953-54 and 1954-55 is valid under Madhya Bharat Municipalities Act 1954, or must deduct 10% allowance under sec. 73(2), considering saving provisions in sec. 2(c) and use of prior assessment list under sec. 79.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Rules and tax rate of 7% gross annual letting value under repealed Indore Act saved by sec. 2(c) of 1954 Act, deemed made under new Act.",
      "supporting_facts": [
        "f2",
        "f9"
      ],
      "legal_basis": "Madhya Bharat Municipalities Act 1954, sec. 2(c)"
    },
    {
      "id": "pa2",
      "text": "Under sec. 79(1), no need for new assessment list every year, can adopt 1952-53 list for 1953-54 and 1954-55, entries conclusive under sec. 76(6), respondents debarred from objecting.",
      "supporting_facts": [
        "f4",
        "f9"
      ],
      "legal_basis": "Madhya Bharat Municipalities Act 1954, secs. 76(6), 79(1)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Under 1954 Act, tax to be assessed on gross annual letting value less 10% statutory allowance per sec. 73(2).",
      "supporting_facts": [
        "f5",
        "f6"
      ],
      "legal_basis": "Madhya Bharat Municipalities Act 1954, sec. 73(2)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Saving in sec. 2(c) applies only if consistent with 1954 Act; tax on gross value inconsistent with sec. 73 requiring deduction of 10% from annual letting value.",
      "addresses_issue": "i1",
      "key_observation": "Tax levied under old Act on gross value inconsistent with sec. 73, not saved by sec. 2(c)."
    },
    {
      "id": "cr2",
      "text": "Even if prior assessment list adopted under sec. 79, must follow secs. 75-76 procedure annually, and tax basis must comply with sec. 73; list conclusive only if prepared per sec. 73.",
      "addresses_issue": "i1",
      "key_observation": "Adopted list becomes list for year subject to secs. 75,76; cannot impose on gross value."
    },
    {
      "id": "cr3",
      "text": "Sec. 79(2) requires provisions of secs. 75,76 apply every year as if new list completed; prevents static valuation depriving objection rights.",
      "addresses_issue": "i1",
      "key_observation": "'If' in sec. 79(2) is mistake, read as 'as if'."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Appellant Corporation not entitled to levy tax on gross annual letting value post-1954 Act; must deduct 10% per sec. 73(2); prior levy and list not saved to extent inconsistent.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Indore City Municipal Act, 1909",
      "sections": [
        "Sec. 21"
      ],
      "relevance": "Authorized tax up to 12.5% of gross annual letting value; repealed by 1954 Act."
    },
    {
      "name": "Madhya Bharat Municipalities Act, 1954",
      "sections": [
        "Sec. 2 (clauses a, c)",
        "Sec. 69",
        "Sec. 70",
        "Sec. 73 (1(d), 2)",
        "Sec. 75",
        "Sec. 76 (4,6)",
        "Sec. 79 (1,2)"
      ],
      "relevance": "Repeals prior Act with savings; authorizes taxes, requires assessment list with 10% deduction from annual letting value; procedure for lists, adoption with annual objection process."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal against High Court judgment decreeing suit for refund of excess house tax Rs. 1,461 fails; High Court right in holding excess illegally recovered; appeal dismissed with costs.",
    "relief_granted": "Refund of Rs. 1,461 excess tax to respondents.",
    "costs": "Costs of this appeal and next appeal No."
  },
  "key_quotes": [
    {
      "text": "\"The saving and the deeming provisions in s. 2(c) can only apply if the tax is assessed in the manner consistent with the provisions of s. 73, that is, if it is assessed on the net and not the gross annual letting value after deducting 10% statutory allowance.\"",
      "speaker": "court",
      "significance": "Core holding on inconsistency and application of saving clause."
    },
    {
      "text": "\"If the construction of sec. 2(c) as suggested by Counsel were to be accepted it would render sec. 73(2) nugatory.\"",
      "speaker": "court",
      "significance": "Rejects petitioner's interpretation as defeating sec. 73(2)."
    }
  ],
  "_case_id": "1967_164",
  "_label": 0,
  "_text_length": 16220,
  "_extracted_at": "2026-02-10T20:22:00.508280"
}