{
  "metadata": {
    "case_name": "Commissioner of Income Tax v. Raja of Bhor (Hindu Undivided Family)",
    "case_year": null,
    "court": "Supreme Court of India",
    "judges": [
      "Ramaswami, J."
    ],
    "case_number": null,
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The late Raja of Bhor held certain Government securities and up to the assessment year 1953-54, he was assessed in the status of individual in respect of his income.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The late Raja of Bhor died on October 9, 1954.",
      "type": "material",
      "date": "1954-10-09",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "His estate including the Government securities thereupon passed to his three sons who constituted a Hindu undivided family. The eldest of them succeeded to the title of Raja of Bhor.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "For the assessment years 1954-55 to 1958-59 the present Raja of Bhor filed returns as a Hindu undivided family consisting of himself and of his two brothers.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "He claimed exemption in respect of the interest income with regard to the Government securities on the ground that it was exempt under the notification issued under section 60 of the Income-tax Act, 1922.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f6",
      "text": "The Income-tax Officer rejected the claim of the assessee on the ground that the securities were the properties of the Hindu undivided family of whom the present ruler and his brothers are members and they cannot lay claim to these securities as their private properties as they belong to the Hindu undivided family.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "The assessee preferred an appeal to the Appellate Assistant Commissioner who took the view that the Hindu undivided family was holding securities on behalf of the Ruling Chief or Princes of Indian States, and as such the exemption contained in the notification was applicable. In this view of the matter he allowed the appeal of the assessee.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "The income-tax department took the matter in appeal to the Appellate Tribunal which affirmed the decision of the Appellate Assistant Commissioner and dismissed the appeal.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "At the instance of the income-tax department the Appellate Tribunal stated a case to the High Court on the following question of law: Whether, on the facts and circumstances of the case, the interest on securities assessable under section 8 of the Income-tax Act was exempt from tax in the assessee's hands in view of the Notification No. 878F dated March 21, 1922, issued under section 60 of the Income-tax Act?",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "By its judgment dated October 19, 1962, the High Court of Bombay answered the question in the affirmative and in favour of the assessee.",
      "type": "procedural",
      "date": "1962-10-19",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "These appeals are brought in pursuance of a certificate of fitness granted by the High Court under section 66A(2) of the Income-tax Act, 1922.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "The appellant had conceded before the Appellate Tribunal that the present Raja of Bhor was a Ruling Chief and his two brothers were princes within the meaning of the notification referred to above.",
      "type": "admitted",
      "date": null,
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the respondent, a Hindu undivided family, is entitled to exemption from taxation in respect of the interest income from Government securities held by it, under a notification of the Government of India dated March 21, 1922, issued under section 60 of the Income-tax Act, 1922.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether, on the facts and circumstances of the case, the interest on securities assessable under section 8 of the Income-tax Act was exempt from tax in the assessee's hands in view of the Notification No. 878F dated March 21, 1922, issued under section 60 of the Income-tax Act?",
      "framed_by": "lower_court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The Raja of Bhor and his two brothers were not Ruling Chiefs or Princes within the meaning of the notification of the Central Government dated March 21, 1922.",
      "supporting_facts": [],
      "legal_basis": "Notification dated March 21, 1922"
    },
    {
      "id": "pa2",
      "text": "The securities belonged to the Hindu undivided family which was a separate unit of assessment in contradistinction to its members. Since the securities belonged to the Hindu undivided family, the exemption contained in the notification dated March 21, 1922, will not apply.",
      "supporting_facts": [
        "f3",
        "f4",
        "f6"
      ],
      "legal_basis": "Income-tax Act, 1922"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The Hindu undivided family was holding securities on behalf of the Ruling Chief or Princes of Indian States, and as such the exemption contained in the notification was applicable.",
      "supporting_facts": [
        "f3",
        "f5"
      ],
      "legal_basis": "Notification dated March 21, 1922 under section 60 of Income-tax Act, 1922"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "It is not possible to entertain the argument that the Raja of Bhor and his two brothers were not Ruling Chiefs or Princes, because the appellant had conceded before the Appellate Tribunal that the present Raja of Bhor was a Ruling Chief and his two brothers were princes within the meaning of the notification. The concession made by the appellant is expressly recorded by the Appellate Tribunal and reference has also been made to it in the agreed statement of the case. The question of law regarding the interpretation of the notification does therefore not arise out of the order of the Appellate Tribunal since no such question was ever raised or argued before it.",
      "addresses_issue": "i1",
      "key_observation": "Concession binds the appellant."
    },
    {
      "id": "cr2",
      "text": "There is a fallacy in the argument that securities belonged to HUF as separate unit. For income-tax purposes HUF is distinct unit, but proprietary right must be answered with reference to Hindu law. The Raja of Bhor and his two brothers constituted a Mitakshara coparcenary. Essence is unity of ownership; ownership in whole body of coparceners. There is community of interest and unity of possession. No individual member has definite share till partition; interest is fluctuating. Theory of ownership by birth gives rise to doctrine of samudavika swatwa or aggregate ownership. Till partition all coparceners have rights over entirety. Thus, property held by assessee on behalf of present Raja and brothers.",
      "addresses_issue": "i1",
      "key_observation": "Under Mitakshara law, HUF property held on behalf of coparceners who qualify as Ruling Chiefs/Princes."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The assessee Hindu undivided family is entitled to exemption from income-tax on the income from the securities as they are held on behalf of the present Raja of Bhor and his two brothers who are Ruling Chief and Princes.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Katama Natchiar v. Rajah of Shivagunga",
      "citation": null,
      "treatment": "followed",
      "relevance": "Observes community of interest and unity of possession between coparceners; survivorship."
    },
    {
      "case_name": "Appovier v. Rama Subba Aiyan",
      "citation": null,
      "treatment": "followed",
      "relevance": "Lord Westbury: No individual coparcener can predicate definite share in joint property while undivided."
    }
  ],
  "statutes_cited": [
    {
      "name": "Income-tax Act, 1922",
      "sections": [
        "Section 60",
        "Section 8",
        "Section 48(4)",
        "Section 66(1)",
        "Section 66A(2)"
      ],
      "relevance": "Notification under s.60 exempts interest on securities held by Ruling Chiefs/Princes as private property; question whether applicable to HUF; reference under s.66."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court upheld the High Court's decision affirming the Tribunal and AAC, holding that the HUF is entitled to the exemption under the 1922 notification as the securities are held on behalf of the Ruling Chief and Princes constituting the coparcenary.",
    "relief_granted": "Exemption from tax on interest income from Government securities for assessment years 1954-55 to 1958-59",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"the essence of a coparcenary under the Mitakshara law is unity of ownership. The ownership of the coparcenary property is in the whole body of coparceners.\"",
      "speaker": "court",
      "significance": "Core reasoning on HUF property ownership under Hindu law justifying exemption."
    },
    {
      "text": "\"Till partition therefore all the coparceners have got rights extending over the entirety of the coparcenary property.\"",
      "speaker": "court",
      "significance": "Explains why securities held 'on behalf of' Ruling Princes, attracting notification exemption."
    }
  ],
  "_case_id": "1967_125",
  "_label": 0,
  "_text_length": 8058,
  "_extracted_at": "2026-02-10T20:21:21.791907"
}