{
  "metadata": {
    "case_name": "Assessee v. Commissioner of Income-tax",
    "case_year": 1967,
    "court": "Supreme Court of India",
    "judges": [
      "Bhargava, J."
    ],
    "case_number": "Civil Appeals Nos. 581 to 584 of 1966",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Principal activity of the assessee was investment of its capital in shares and stocks. It changed its investments by sale of its shares and stocks from time to time. Income primarily from dividends on shares and interest on investments. Activities covered by Clauses 1, 3 and 4 of Memorandum of Association.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Clause 2 of Memorandum of Association: to acquire, hold, sell and transfer shares, stocks, debentures etc. of companies in British India, UK, dependencies, foreign countries, or issued by governments etc.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Tribunal finding: purchases and sales of shares in question were in pursuit of Clause 2.",
      "type": "admitted",
      "date": null,
      "source": "tribunal"
    },
    {
      "id": "f4",
      "text": "No evidence placed by assessee on object behind acquisition of shares of McLeod Co. Ltd. and companies managed by it. Income-tax Officer did not ascertain object. Tribunal unable to find why assessee confined activities mostly to these shares.",
      "type": "disputed",
      "date": null,
      "source": "tribunal"
    },
    {
      "id": "f5",
      "text": "In account year relevant to assessment year, Kanoria group held 21,046 shares in McLeod Co. Ltd., including 6,977 held by assessee.",
      "type": "material",
      "date": null,
      "source": "tribunal"
    },
    {
      "id": "f6",
      "text": "C.L. Kanoria resigned as Director of McLeod Co. Ltd. on 17th March 1952. Central Government approval on 16th October 1952.",
      "type": "material",
      "date": "1952-03-17",
      "source": "tribunal"
    },
    {
      "id": "f7",
      "text": "Thereafter, Sri C.L. Bajoria joined Directorate of McLeod Co. Ltd.",
      "type": "material",
      "date": null,
      "source": "tribunal"
    },
    {
      "id": "f8",
      "text": "Assessee sold 6,900 shares to Sri C.L. Bajoria or his nominees on 27th May 1952, when C.L. Kanoria's resignation was sent but not yet approved by Government.",
      "type": "material",
      "date": "1952-05-27",
      "source": "tribunal"
    },
    {
      "id": "f9",
      "text": "Sri C.L. Bajoria acquired 12,440 shares including 6,900 from assessee. No material to prove his group obtained controlling interest.",
      "type": "material",
      "date": null,
      "source": "tribunal"
    },
    {
      "id": "f10",
      "text": "After resignation of C.L. Kanoria, L. Bajoria and Baijnath Jalan of M/s. Soorajmull Nagarmull became Directors of McLeod Co. Ltd.",
      "type": "material",
      "date": null,
      "source": "tribunal"
    },
    {
      "id": "f11",
      "text": "Shares of McLeod Co. Ltd. purchased by assessee in lots from year ended 31st March 1948 to 31st March 1952.",
      "type": "material",
      "date": null,
      "source": "income_tax_officer"
    },
    {
      "id": "f12",
      "text": "Purchase prices: Year ended 31.3.1948 average Rs. 267-13-0; 31.3.1949 Rs. 201-8-0; 31.3.1950 Rs. 182-10-0; 31.3.1952 Rs. 128-14-0. Largest block 4,757 shares in year ended 31.3.1950.",
      "type": "material",
      "date": null,
      "source": "income_tax_officer"
    },
    {
      "id": "f13",
      "text": "On 1st April 1952, assessee's total holding in McLeod: 6,977 shares at cost Rs. 4,29,587-4-0 out of total share holdings value Rs. 17,58,741-4-0.",
      "type": "material",
      "date": "1952-04-01",
      "source": "income_tax_officer"
    },
    {
      "id": "f14",
      "text": "Purchases made in rapidly falling market. Loans taken amounting to Rs. 8 lakhs at 3.5% to 5% interest. Dividend low, return after interest and super-tax less than 1%.",
      "type": "material",
      "date": null,
      "source": "income_tax_officer"
    },
    {
      "id": "f15",
      "text": "Assessee's explanation: shares held as investment, sold because control of McLeod went out of hands of assessee's Directors. Not proved by Tribunal.",
      "type": "disputed",
      "date": null,
      "source": "assessee"
    },
    {
      "id": "f16",
      "text": "Kanoria group held 21,046 out of 40,000 shares even on 27th May 1952.",
      "type": "material",
      "date": "1952-05-27",
      "source": "tribunal"
    },
    {
      "id": "f17",
      "text": "In year ended 31st March 1955, assessee purchased large number of McLeod shares between 23rd August 1954 and 29th September 1954, first at Rs. 150, later up to Rs. 250 in rising market. Control no longer with Kanoria group.",
      "type": "material",
      "date": null,
      "source": "tribunal"
    },
    {
      "id": "f18",
      "text": "Earlier years, Department accepted acquisitions and sales as investments.",
      "type": "background",
      "date": null,
      "source": "department"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether on the facts and circumstances of the case, the surplus derived by the assessee in the sale of its shares and securities in the relevant previous years was a revenue receipt and as such taxable under the Income Tax Act.",
      "framed_by": "tribunal"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Shares held as investment and sold because control of McLeod Co. Ltd. went out of hands of Directors of assessee.",
      "supporting_facts": [
        "f15"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Mere variation of investments by investment company does not make profits taxable unless it amounts to dealing in investments.",
      "supporting_facts": [],
      "legal_basis": "Bengal and Assam Investors Ltd. v. CIT; CIT v. Bai Shirinbai K. Kooka"
    },
    {
      "id": "pa3",
      "text": "Tribunal made no finding that shares were converted into stock-in-trade or that variation amounted to dealings.",
      "supporting_facts": [],
      "legal_basis": null
    },
    {
      "id": "pa4",
      "text": "Principal consideration is purpose of purchase: if investment, profit on sale is capital gain.",
      "supporting_facts": [],
      "legal_basis": "Ram Narain Sons Pvt. Ltd. v. CIT"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Surplus is revenue receipt taxable as arising from adventure in nature of trade.",
      "supporting_facts": [
        "f1",
        "f2",
        "f11",
        "f12",
        "f14"
      ],
      "legal_basis": "Income Tax Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Facts lead to conclusion that shares purchased and sold with motive of earning profit, not for investment to derive dividend income.",
      "addresses_issue": "i1",
      "key_observation": "MOA Clause 2 permits dealing in shares."
    },
    {
      "id": "cr2",
      "text": "Purchases in falling market at declining prices, loans at high interest, low dividend return (<1%) indicate not investment but for resale profit.",
      "addresses_issue": "i1",
      "key_observation": "Sold at considerable profit."
    },
    {
      "id": "cr3",
      "text": "Assessee's explanation of sale due to loss of control not proved; Kanoria group retained majority even after sale; resignation approval post-sale.",
      "addresses_issue": "i1",
      "key_observation": "No evidence Bajoria group gained control from purchase."
    },
    {
      "id": "cr4",
      "text": "Subsequent purchases in 1954-55 in rising market when control already lost shows purchases/sales for profit, not control or investment.",
      "addresses_issue": "i1",
      "key_observation": "Adventure in nature of trade."
    },
    {
      "id": "cr5",
      "text": "Facts show assessee dealt with these shares as stock-in-trade, though not shown in books.",
      "addresses_issue": "i1",
      "key_observation": "Distinguishes cited cases as purpose here was profit from outset."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Surplus from sale of shares is revenue receipt taxable under Income Tax Act as arising from adventure in nature of trade.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Bengal and Assam Investors Ltd. v. Commissioner of Income-tax, West Bengal",
      "citation": "59 I.T.R. 547",
      "treatment": "referred",
      "relevance": "Must deal in shares for dividends assessable under s.10; mere investment not business unless converted to stock-in-trade."
    },
    {
      "case_name": "Commissioner of Income Tax v. Bai Shirinbai K. Kooka",
      "citation": "46 I.T.R. 86",
      "treatment": "referred",
      "relevance": "Example of assessee carrying on business of dealing in stocks and shares."
    },
    {
      "case_name": "Ram Narain Sons Pvt. Ltd. v. Commissioner of Income-tax, Bombay",
      "citation": null,
      "treatment": "distinguished",
      "relevance": "Purpose of purchase key: if investment, sale profit is capital gain; but here initial purpose was resale profit."
    }
  ],
  "statutes_cited": [
    {
      "name": "Income Tax Act",
      "sections": [
        "Section 10"
      ],
      "relevance": "Surplus taxable as revenue receipt if from business/adventure in nature of trade."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Court answered the referred question in favour of the revenue, holding the surplus as taxable revenue receipt. Appeals by assessee dismissed implicitly by upholding Tribunal's view.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"the purchases and sales of the shares in question were in pursuit of this clause 2 in the Memorandum of Association.\"",
      "speaker": "tribunal",
      "significance": "Indicates dealing permitted by MOA objects."
    },
    {
      "text": "\"these shares were purchased and sold by the assessee with the motive of earning a profit by such purchases and sales and not with the object of investing its capital in these shares.\"",
      "speaker": "court",
      "significance": "Core finding rejecting investment claim."
    },
    {
      "text": "\"the transactions amounted to an adventure in the nature of trade.\"",
      "speaker": "court",
      "significance": "Determines taxability as revenue."
    }
  ],
  "_case_id": "1967_329",
  "_label": 0,
  "_text_length": 15618,
  "_extracted_at": "2026-02-10T20:24:45.149031"
}