{
  "metadata": {
    "case_name": "Appellant v. Respondent",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "Bachawat, J."
    ],
    "case_number": "Civil Appeal No. 866 of 1964",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The respondent instituted two suits against the appellant in the court of the First Civil Judge, Kanpur. Suit No. 25 of 1958 was for the recovery of moneys due on a mortgage for Rs. 50,000. Suit No. 22 of 1958 was to recover a sum of Rs. 8,000 due on a ruqqa.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On May 15, 1958, both the suits were decreed ex-parte.",
      "type": "procedural",
      "date": "1958-05-15",
      "source": "lower_court"
    },
    {
      "id": "f3",
      "text": "The appellant filed an application to set aside the ex-parte decree passed in Suit No. 22 of 1958. This application was numbered as miscellaneous case No. 104 of 1958.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "On August 16, 1958, the First Civil Judge, Kanpur, passed an order setting aside this ex-parte decree on certain conditions. The order sheet stated: 'Heard parties counsel, accept the applicants affidavit and hold that due to improper-service applicant was prevented from being present. Allowed on condition of payment of Rs. 150 as costs within a month and on condition that allotment shall continue.' 'Applicant is hereby informed of connected decree of 25 of 1958 as well.'",
      "type": "procedural",
      "date": "1958-08-16",
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "An appeal by the appellant from this order was dismissed on September 25, 1958.",
      "type": "procedural",
      "date": "1958-09-25",
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "On February 5, 1959, an advocate employed by the appellant to file a civil revision petition against the appellate order, obtained a certified copy of the order dated August 16, 1958.",
      "type": "procedural",
      "date": "1959-02-05",
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "On February 24, 1959, a civil revision petition was filed by the appellant against the appellate order.",
      "type": "procedural",
      "date": "1959-02-24",
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "On April 16, 1959, the appellant filed an application in the Court of the First Civil Judge, Kanpur, under O.9, r. 13, C.P.C., for the setting aside of the ex-parte decree passed in Suit No. 25 of 1958.",
      "type": "procedural",
      "date": "1959-04-16",
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "The Civil Judge dismissed the application. An appeal from that order filed by the appellant was dismissed by the Allahabad High Court on April 7, 1964 in F.A.F.O. No. 367 of 1959.",
      "type": "procedural",
      "date": "1964-04-07",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Both the courts held that the summons in Suit No. 25 of 1958 was duly served on the appellant but as more than 30 days had expired after the appellant had knowledge of the ex-parte decree, the application was barred by Limitation under art. 164 of the Indian Limitation Act, 1908.",
      "type": "disputed",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "The courts below concurrently found that the appellant was personally present in the court of the First Civil Judge on August 16, 1958 when the learned judge informed him that an ex-parte decree had been passed against him in Suit No. 25 of 1958. The appellant was informed that suits Nos. 22 and 25 of 1958 were connected suits.",
      "type": "admitted",
      "date": "1958-08-16",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "In his application for setting aside the ex-parte decree, the appellant stated that he got the information of the passing of the ex-parte decree in suit No. 25 of 1958 for the first time from the respondent on April 13, 1959. The respondent filed an affidavit stating that the appellant was directly informed of the passing of this ex-parte decree by the First Civil Judge on August 16, 1958. This statement was not denied by the appellant.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f13",
      "text": "The appellant knew that he had dealings with the respondent in respect of a ruqqa and a mortgage. He knew that the suit No. 22 of 1958 was filed on the ruqqa.",
      "type": "admitted",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Interpretation of art. 164 of the Indian Limitation Act 1908: what constitutes 'knowledge of the decree' for the purpose of the 30-day limitation period for setting aside an ex-parte decree under O.9 r.13 CPC, particularly when summons was not duly served.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The appellant had knowledge of the ex-parte decree in Suit No. 25 of 1958 for the first time from the respondent on April 13, 1959, so the application on April 16, 1959 was within limitation.",
      "supporting_facts": [
        "f12"
      ],
      "legal_basis": "Art. 164 Limitation Act 1908; O.9 r.13 CPC"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The appellant was directly informed of the passing of the ex-parte decree in Suit No. 25 of 1958 by the First Civil Judge on August 16, 1958.",
      "supporting_facts": [
        "f4",
        "f11"
      ],
      "legal_basis": "Art. 164 Limitation Act 1908"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Under O.9 r.13 CPC, ex-parte decree liable to be set aside if summons not duly served or defendant prevented by sufficient cause. If summons not duly served, entitled ex debito justitiae provided within limitation. Under art. 164, 30 days from date of decree or, when summons not duly served, when applicant had knowledge of the decree. Onus on defendant to show within time.",
      "addresses_issue": "i1",
      "key_observation": "The expression 'knowledge of the decree' in art. 164 means knowledge of the particular decree which is sought to be set aside."
    },
    {
      "id": "cr2",
      "text": "Agreed with precedents: knowledge means certain and clear perception of the particular decree; not vague information that some decree passed. Test of sufficiency is what it meant to the defendant in light of previous dealings. Not necessary to serve copy; sufficient if knowledge of material facts.",
      "addresses_issue": "i1",
      "key_observation": "From information on Aug 16, 1958, appellant had clear knowledge of decree in Suit 25/1958 given connected suits and his dealings."
    },
    {
      "id": "cr3",
      "text": "Appellant's statement of first knowledge on Apr 13, 1959 is conclusively false; informed on Aug 16, 1958 when personally present; time ran from then; application on Apr 16, 1959 barred.",
      "addresses_issue": "i1",
      "key_observation": "Appellant knew suits connected, dealings on ruqqa and mortgage."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Knowledge of the decree under art. 164 means knowledge of the particular decree sought to be set aside; vague information insufficient; starts running when defendant has clear perception of injury from material facts concerning the decree.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Appellant's application under O.9 r.13 to set aside ex-parte decree in Suit 25/1958 barred by limitation under art. 164 as knowledge obtained on Aug 16, 1958.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Pundlick Rowji v. Vasant rao Madhavrao",
      "citation": "11 B.L.R. 1296",
      "treatment": "followed",
      "relevance": "Knowledge of decree means knowledge not of a decree but of the particular decree sought to be set aside; certain and clear perception."
    },
    {
      "case_name": "Kumud Nath Roy Chowdhury v. Jotindra Nath Chowdhury",
      "citation": "I.L.R. 38 Cal. 394, 403",
      "treatment": "followed",
      "relevance": "Followed Pundlick Rowji on meaning of knowledge."
    },
    {
      "case_name": "Bapurao Sitaram Karmarkar v. Sadbu Bhiva Gholap",
      "citation": "I.L.R. 47 Bom. 485",
      "treatment": "followed",
      "relevance": "Evidence of vague information insufficient; must know particular decree in particular court for particular sum in favour of particular person."
    },
    {
      "case_name": "Batulan v. S. K. Dwivedi",
      "citation": "I.L.R. 33 Pat. 1025, 1050-8",
      "treatment": "followed",
      "relevance": "Followed Bapurao on meaning of knowledge."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Limitation Act, 1908",
      "sections": [
        "Article 164"
      ],
      "relevance": "Prescribes 30-day limitation for application to set aside ex-parte decree from date of decree or, if summons not duly served, from knowledge of decree."
    },
    {
      "name": "Code of Civil Procedure",
      "sections": [
        "Order 9 Rule 13"
      ],
      "relevance": "Application to set aside ex-parte decree if summons not duly served or sufficient cause for non-appearance."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal by special leave against the Allahabad High Court order dismissing the appeal from the Civil Judge's dismissal of the application to set aside ex-parte decree in Suit No. 25/1958 is dismissed, as the application was barred by limitation under art. 164.",
    "relief_granted": "None",
    "costs": "Dismissed with costs."
  },
  "key_quotes": [
    {
      "text": "\"the expression knowledge of the decree in art 164 means knowledge not of a decree but of the particular decree which is sought to be set aside, a certain and clear perception of the fact that the particular decree had been passed against him.\"",
      "speaker": "court",
      "significance": "Defines the core interpretation of 'knowledge' under art. 164."
    },
    {
      "text": "\"It is a question of fact in each case whether the information conveyed to the defendant is sufficient to impute to him knowledge of the decree within the meaning of art. 164. The test of the sufficiency is not what the information would mean to a stranger, but what it meant to the defendant in the light of his previous dealings with the plaintiff.\"",
      "speaker": "court",
      "significance": "Establishes test for sufficiency of knowledge."
    },
    {
      "text": "\"The appellant had thus on August 16, 1958 clear knowledge of the decree passed against him in suit No. 25 of 1958 which he now seeks to set aside. Time began to run against him from August 16, 1958 under art. 164.\"",
      "speaker": "court",
      "significance": "Applies holding to facts, finding application time-barred."
    }
  ],
  "_case_id": "1967_236",
  "_label": 0,
  "_text_length": 9010,
  "_extracted_at": "2026-02-10T20:23:19.632656"
}