{
  "metadata": {
    "case_name": "Members of First Branch v. Damamma/Nagaveniamma",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "Bachawat, J."
    ],
    "case_number": "Civil Appeal No. 910 of 1964",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "By a registered deed dated September 4, 1900, a group of 19 persons forming a joint family with community of property governed by the Aliyasanthana Law of inheritance, formed themselves into two branches and divided the family properties.",
      "type": "background",
      "date": "1900-09-04",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The second branch consisted of the descendants of Sarasamma and Brahmi and some descendants of Nemakka-in all 10 persons.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The first branch consisted of Nemakka and the rest of her descendants and her sister Sivadevi-in all 9 persons.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The joint family properties were formerly managed by its yajaman, one Manjappa. Upon his death, the parties to the deed dated September 4, 1900, apprehended disputes.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The object of the deed was to prevent such disputes, and consequential wastage of property and to preserve the dignity of the family.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The family properties were divided into two parts, and a portion was allotted to each branch.",
      "type": "material",
      "date": "1900-09-04",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "The deed provided that the properties allotted to the first branch would be enjoyed by its members and would be mutated in Nemakka's name, and Siddappa, a member of this branch, would manage the properties, pay the tirve and cesses, and conduct the maintenance of its members.",
      "type": "material",
      "date": "1900-09-04",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "The properties allotted to the second branch would be enjoyed by its members and would be mutated in the name of Nagu, a member of that branch, and Chandayia, another member of the branch, would manage the properties, pay the tirve and cesses, and conduct the maintenance of its members.",
      "type": "material",
      "date": "1900-09-04",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Parts of items 2 and 5 of the properties were allotted to the two branches, but the entire tirve, and cesses for the two items would be paid by the first branch, and the arrears of the tirve, if any, would form a charge on the properties allotted to the first branch.",
      "type": "material",
      "date": "1900-09-04",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "The deed provided that as regards the properties enjoyed as mentioned above by the members of the first branch, the members of the said branch and the descendants that shall be born to them in future should enjoy the same and as regards the properties enjoyed by the members of the second branch, the members of the said branch and the descendants that shall be born to them in future should enjoy the same and in this manner, they should enjoy the properties separately.",
      "type": "material",
      "date": "1900-09-04",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Further, after the lifetime of the member of the respective branches who obtains the kudathale of the properties allotted to the respective branches, the kudathale should be got entered successively in the name of the senior-most male or female member of the respective branches.",
      "type": "material",
      "date": "1900-09-04",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "The common debt of the family was apportioned between the two branches, and each branch would discharge its share of the debt and interest thereon as quickly as possible.",
      "type": "material",
      "date": "1900-09-04",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "If the manager of any branch allowed the interest to fall in arrears, the members of the branch would appoint another manager in his place.",
      "type": "material",
      "date": "1900-09-04",
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Each branch would have the power to execute documents creating a security over the properties allotted to it for payment of its share of the common debt.",
      "type": "material",
      "date": "1900-09-04",
      "source": "court"
    },
    {
      "id": "f15",
      "text": "No member of the family would have the right to incur other debts. The deed provided that If any debt is borrowed, the very person who borrows the debt should discharge it with his personal liability and further, the movable and immovable properties of this family or the members of the family should not become liable for such debt.",
      "type": "material",
      "date": "1900-09-04",
      "source": "court"
    },
    {
      "id": "f16",
      "text": "Another clause provided that These immovable properties or any portion thereof and the right of maintenance of any individual should not be alienated in any manner by way of mortgage, sale, gift, inulageni, artha mulageni and vaide geni. Contrary to this term, if alienation is made, such alienation should not be valid.",
      "type": "material",
      "date": "1900-09-04",
      "source": "court"
    },
    {
      "id": "f17",
      "text": "The deed also provided If there are no descendants at all completely in the first branch, the members belonging to the second branch shall be entitled to the entire movable and immovable properties of the said first branch and if there are no descendants at all completely in the second branch, the members of the first branch shall be entitled to the entire movable and immovable properties of the said second branch.",
      "type": "material",
      "date": "1900-09-04",
      "source": "court"
    },
    {
      "id": "f18",
      "text": "In 1953, Damamma was the sole surviving member of the second branch. She was a nissanthathi kavaru, 70 years old having no descendants.",
      "type": "material",
      "date": "1953",
      "source": "court"
    },
    {
      "id": "f19",
      "text": "In 1953, the members of the first branch instituted a suit against Damamma for partition of all the properties comprised in the deed dated September 4, 1900, alleging that the deed effected a division for convenience of enjoyment and maintenance only and was not an absolute or out-right partition.",
      "type": "procedural",
      "date": "1953",
      "source": "petitioner"
    },
    {
      "id": "f20",
      "text": "The defence of Damamma was that the deed effected an outright partition.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f21",
      "text": "The trial court accepted the plaintiffs' contention and passed a preliminary decree for partition.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f22",
      "text": "Damamma filed an appeal in the Mysore High Court. During the pendency of the appeal she died and one Nagaveniamma claiming under her will was substituted in her place as her legal representative.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f23",
      "text": "The High Court held that the deed dated September 4, 1900, effected an out-right partition. On this finding, the High Court allowed the appeal, set aside the decree passed by the trial court and dismissed the suit.",
      "type": "procedural",
      "date": "1961-02-28",
      "source": "lower_court"
    },
    {
      "id": "f24",
      "text": "From this decree the present appeal has been filed under a certificate granted by the High Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f25",
      "text": "In a compromise dated August 10, 1909 in O.S. No. 10 of 1909 to which the members of the second branch were parties, Damamma solemnly admitted and declared that the deed was not a partition deed, but was a family arrangement for the convenient enjoyment of the properties by the members of the family so that the properties may be increased and not wasted.",
      "type": "admitted",
      "date": "1909-08-10",
      "source": "court"
    },
    {
      "id": "f26",
      "text": "The trial court found that though Damamma, a member of the kutumba, was a major on September 4, 1900, she did not execute the deed. The deed described her as a minor under the guardianship of Padmaraja.",
      "type": "material",
      "date": "1900-09-04",
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "whether the deed dated September 4, 1900, effected a disruption of the joint family or whether it made a division for convenience of enjoyment and maintenance only.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "whether the deed should be deemed to have effected a partition of the joint family properties under section 366 of the Madras Aliyasantana Act, 1949.",
      "framed_by": "respondent"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The deed effected a division for convenience of enjoyment and maintenance only and was not an absolute or out-right partition.",
      "supporting_facts": [
        "f19"
      ],
      "legal_basis": "Aliyasanthana Law of inheritance"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The deed effected an outright partition.",
      "supporting_facts": [
        "f20"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "The deed should be deemed to have effected a partition of the joint family properties under section 366 of the Madras Aliyasantana Act, 1949.",
      "supporting_facts": [
        "f6",
        "f10"
      ],
      "legal_basis": "Section 366, Madras Aliyasantana Act, 1949"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "In 1900, when this deed was executed, one or more members of a joint family governed by the Aliyasanthana law of inheritance had no right to claim a partition of the joint family properties, but by a family arrangement entered into with the consent of all its members, the properties could be divided and separately enjoyed. In such families, an arrangement for separate possession and enjoyment without actual disruption of the family was common. An arrangement for separate enjoyment did not effect a disruption of the family, unless it completely extinguished the community of interest in the family properties.",
      "addresses_issue": "i1",
      "key_observation": "The character of the deed dated September 4, 1900 must be judged in this background."
    },
    {
      "id": "cr2",
      "text": "The respondent relies on several features of the deed as indicative of an out-right partition: properties divided into two shares; each branch to enjoy its share in perpetuity; separate mutations and pattas; assessments paid separately; separate manager; share of common debt paid separately. All these features coupled with other circumstances may indicate a complete disruption of the family.",
      "addresses_issue": "i1",
      "key_observation": "See Sulaiman v. Biyathumma."
    },
    {
      "id": "cr3",
      "text": "There are other features of the deed which indicate that it did not effect an out-right partition: object to prevent disputes and wastage and preserve dignity; deed did not declare complete disruption; kutumba split into artificial branches not natural kavarus; restraints on incurring debts binding on family properties and on alienating properties; restrictions to preserve family properties intact for benefit of both branches.",
      "addresses_issue": "i1",
      "key_observation": "The restrictions on alienation rather indicate that the parties did not intend to effect an out-right partition."
    },
    {
      "id": "cr4",
      "text": "On the nissanthathi, its properties would pass to the members of the other branch. This clause indicates that on one branch becoming extinct, the properties allotted to it would pass by survivorship of the other branch. Had there been an out-right partition, the sole surviving kavaru would be entitled to dispose of her separate property by a will under the Malabar Wills Act 1898.",
      "addresses_issue": "i1",
      "key_observation": "The absence of such a right indicates that the deed did not effect a complete disruption of the joint family."
    },
    {
      "id": "cr5",
      "text": "On a consideration of the deed as a whole in all its parts, we are constrained to hold that the deed on its true construction did not effect an out-right partition of the joint family.",
      "addresses_issue": "i1",
      "key_observation": "In a compromise dated August 10, 1909, Damamma admitted the deed was not a partition but a family arrangement for convenient enjoyment."
    },
    {
      "id": "cr6",
      "text": "The contention that the deed satisfies the conditions of S. 366 was not taken in the written statement, no issue raised. Materials do not show it satisfies all conditions: Damamma did not execute though major; not clear whole properties distributed; distribution not among all kavarus but artificial groups.",
      "addresses_issue": "i2",
      "key_observation": "S. 366 cannot apply to the deed under which the kutumba was split up into two artificial groups."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The deed dated September 4, 1900, on its true construction, did not effect an out-right partition of the joint family.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "The deed cannot be deemed to be a deed of partition under S. 366 of the Madras Aliyasantana Act, 1949.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Sulaiman v. Biyathumma",
      "citation": "32 M.L.J. 137 P.C.",
      "treatment": "referred",
      "relevance": "Features like separate shares, mutations etc. may indicate complete disruption."
    },
    {
      "case_name": "Kaveri v. Ganga Ratna",
      "citation": "1956 I.M.L.J. 98",
      "treatment": "followed",
      "relevance": "Four conditions necessary for application of Sec. 366."
    }
  ],
  "statutes_cited": [
    {
      "name": "Madras Aliyasantana Act, 1949",
      "sections": [
        "Section 366",
        "Section 3(b)"
      ],
      "relevance": "Deed does not satisfy conditions to be deemed a partition; applies to distribution among natural kavarus, not artificial groups."
    },
    {
      "name": "Transfer of Property Act",
      "sections": [
        "Section 10"
      ],
      "relevance": "Restrictions on alienation not void if not outright partition."
    },
    {
      "name": "Malabar Wills Act",
      "sections": [
        "1898"
      ],
      "relevance": "Sole surviving kavaru entitled to will separate property if outright partition."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "The appeal is allowed without costs, the judgment and decree passed by the High Court is set aside, and the decree of the trial court is restored.",
    "relief_granted": "Preliminary decree for partition by trial court restored.",
    "costs": "without costs"
  },
  "key_quotes": [
    {
      "text": "The sole question arising in this appeal is whether the deed dated September 4, 1900, effected a disruption of the joint family or whether it made a division for convenience of enjoyment and maintenance only.",
      "speaker": "court",
      "significance": "Frames the central legal issue."
    },
    {
      "text": "On a consideration of the deed as a whole in all its parts, we are constrained hold that the deed on its true construction did not effect an out-right partition of the joint family.",
      "speaker": "court",
      "significance": "Core holding on the nature of the deed."
    },
    {
      "text": "Damamma solemnly admitted and declared that the deed was not a partition deed, but was a family arrangement for the convenient enjoyment of the properties by the members of the family so that the properties may be increased and not wasted.",
      "speaker": "court",
      "significance": "Admission by respondent's predecessor supporting petitioner's case."
    }
  ],
  "_case_id": "1967_144",
  "_label": 1,
  "_text_length": 13417,
  "_extracted_at": "2026-02-10T20:22:10.014138"
}