{
  "metadata": {
    "case_name": "Excise and Taxation Officer v. Respondent Firm",
    "case_year": 1965,
    "court": "Supreme Court of India",
    "judges": [
      "Shelat, J."
    ],
    "case_number": "Civil Appeal No. 1080 of 1965",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The respondent is a partnership firm registered under the Punjab General Sales Tax Act, 1948 and was carrying on business in vegetable ghee, sugar and other commodities.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The assessment year in question commenced from April 1, 1955 and ended on March 31, 1956.",
      "type": "background",
      "date": "1955-04-01 to 1956-03-31",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The dealer furnished four quarterly returns: for April to June, 1954 on October 1, 1954; July to September, 1954 on December 16, 1954; October to December, 1954 on March 12, 1955; and January to March, 1955 on June 16, 1956.",
      "type": "procedural",
      "date": "1954-10-01, 1954-12-16, 1955-03-12, 1956-06-16",
      "source": "respondent"
    },
    {
      "id": "f4",
      "text": "The returns were not filed within 30 days after expiry of each quarter as required by the Rules, but no objection was taken by the Assessing Authority.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The firm deposited three sums at the time of filing the returns aggregating to Rs. 10,649-4-0 and subsequently paid a further sum of Rs. 14,477 on the basis of those returns.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Not satisfied with the returns, the Assessing Authority issued a notice under S. 11(2) in form S.T. XIV, served on the dealer on January 11, 1957, before three years expired from the respective dates for filing the returns (first return due July 30, 1954; last due April 30, 1955).",
      "type": "procedural",
      "date": "1957-01-11",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "On July 5, 1960, the Assessing Authority examined Tara Chand, a partner in the firm, but did not finalise the assessment order that day as further enquiries were needed.",
      "type": "procedural",
      "date": "1960-07-05",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "The Assessing Authority passed the assessment order on August 11, 1960, disbelieved the accounts produced by Tara Chand, added sales of Rs. 4,00,000 to the gross turnover, assessed on turnover of Rs. 16,92,148-1-0 to tax of Rs. 33,127-1-6, and after crediting deposits, balance of Rs. 8,000 and odd payable.",
      "type": "material",
      "date": "1960-08-11",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "The firm filed a writ petition in the Punjab High Court challenging the assessment order as without jurisdiction since made after three years from dates returns had to be furnished.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f10",
      "text": "The department contended before High Court that the order was under S. 11(3) with no limitation, or proceedings commenced with notice of January 11, 1957 within time.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f11",
      "text": "High Court held the order was an assessment on best judgment basis under S. 11(4) and made after three years after close of assessment year, without jurisdiction, following Mis. Rameshwar Lal Sarup Chand v. The Excise and Taxation Officer.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Appeal to Supreme Court by certificate granted by Punjab High Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Where the sales tax authority is not satisfied with the returns filed by a registered dealer and issues a notice under s. 11(2) of the Punjab General Sales Tax Act, 1948 before the expiry of three years from the termination of the period for furnishing returns but finalises the assessment order after three years from the aforesaid date, whether such an assessment order can be said to be time barred and, therefore, without jurisdiction.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The order was made under S. 11(3) which provided no limitation.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": "Section 11(3) of Punjab General Sales Tax Act, 1948"
    },
    {
      "id": "pa2",
      "text": "Assuming the order was passed under S. 11(4) or S. 11(5), proceedings commenced on issuance of notice dated January 11, 1957 which was within time, so no question of time bar.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": "Sections 11(2), 11(4), 11(5)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The assessment order was made after three years from the dates when the returns had to be furnished, so without jurisdiction.",
      "supporting_facts": [
        "f3",
        "f8"
      ],
      "legal_basis": "Sections 11(4), 11(5) of Punjab General Sales Tax Act, 1948"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Explained provisions of Section 11: cases where authority satisfied with returns (11(1)); not satisfied, issues notice under 11(2), then assesses after hearing evidence under 11(3); best judgment if fails to comply with 11(2) notice within 3 years (11(4)); no returns within 3 years (11(5)); no registration (11(6)).",
      "addresses_issue": "i1",
      "key_observation": "Sub-sections 4,5,6 lay down conditions precedent for best judgment assessment; none existed here as dealer complied with notice."
    },
    {
      "id": "cr2",
      "text": "Mere mention of 'best judgment' does not make it so; question whether under 11(3),4 or 5 immaterial.",
      "addresses_issue": "i1",
      "key_observation": "Proceedings under 11(3) following 11(2) notice not time-barred if notice within time."
    },
    {
      "id": "cr3",
      "text": "In Madan Lal Arora, notices after 3 years futile for best judgment under 11(4); no proceedings commenced within time.",
      "addresses_issue": "i1",
      "key_observation": "Distinguished as here notice within time."
    },
    {
      "id": "cr4",
      "text": "In Ghanshyam Das, assessment proceedings commence when return filed or notice under 11(2) issued; if within time, final order later valid even after limitation.",
      "addresses_issue": "i1",
      "key_observation": "Directly applicable: notice Jan 11,1957 within time; proceedings pending till final assessment."
    },
    {
      "id": "cr5",
      "text": "Returns filed (though late, accepted); notice under 11(2) on footing returns filed but not satisfied; dealer appeared and produced accounts.",
      "addresses_issue": "i1",
      "key_observation": "Proceedings commenced with returns or notice, both within time."
    },
    {
      "id": "cr6",
      "text": "High Court decisions in Rameshwar Lal and Jagat Ram not applicable as did not consider Ghanshyam Das point on pending proceedings.",
      "addresses_issue": "i1",
      "key_observation": "Overruled High Court."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Assessment proceedings in case of registered dealer commence when returns filed or notice under s.11(2) issued; if initiated within prescribed time, final assessment order passed thereafter not time-barred.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Mis. Rameshwar Lal Sarup Chand v. The Excise and Taxation Officer",
      "citation": "1963 P.L.R. 768",
      "treatment": "distinguished",
      "relevance": "High Court followed it to hold assessment under s.11(4) time-barred; SC held not applicable as proceedings commenced within time per Ghanshyam Das."
    },
    {
      "case_name": "Madan Lal Arora v. Excise and Taxation Officer, Amritsar",
      "citation": "1962 1 S.C.R. 823",
      "treatment": "followed",
      "relevance": "Held notices after 3 years futile for best judgment under s.11(4); distinguished as here notice within time."
    },
    {
      "case_name": "Ghanshyam Das v. Regional Assistant Commissioner of Sales Tax, Nagpur",
      "citation": "1964 4 S.C.R. 436",
      "treatment": "followed",
      "relevance": "Assessment proceedings commence with return or s.11(2) notice; pending till final order; valid if initiated within time."
    },
    {
      "case_name": "Jagat Ram Om Parkash v. Excise and Taxation Officer, Assessing Authority, Amritsar",
      "citation": null,
      "treatment": "distinguished",
      "relevance": "High Court decision; did not consider issue of proceedings pending after timely notice."
    }
  ],
  "statutes_cited": [
    {
      "name": "Punjab General Sales Tax Act, 1948",
      "sections": [
        "Section 10",
        "Section 11(1)",
        "Section 11(2)",
        "Section 11(3)",
        "Section 11(4)",
        "Section 11(5)",
        "Section 11(6)"
      ],
      "relevance": "Governs assessment procedures, notices, time limits for best judgment assessments; s.11(2) notice initiates proceedings not time-barred under s.11(3)."
    },
    {
      "name": "Punjab General Sales Tax Rules, 1949",
      "sections": [
        "Rule 20",
        "Rule 25",
        "Rule 32",
        "Rule 33",
        "Rule 40"
      ],
      "relevance": "Prescribes quarterly returns within 30 days, payment with returns, assessment orders in writing with reasons, notice in form ST XIV for s.11 assessment."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Supreme Court held the assessment order not time-barred as proceedings commenced with s.11(2) notice issued within limitation period; reversed High Court decision.",
    "relief_granted": "Appeal allowed; assessment order upheld.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "assessment proceedings commence in the case of a registered dealer either when he furnishes a return or when a notice is issued to him under s.11(2) of the present Act, and that if such proceedings are taken within the prescribed time though the assessment is finalised subsequently even after the expiry of the prescribed period, no question of limitation would arise.",
      "speaker": "court",
      "significance": "Core holding on when limitation starts and proceedings are valid."
    },
    {
      "text": "the mere fact that the Assessing Authority mentioned that he made the order on the best judgement basis cannot be conclusive, for, by merely calling it as the best judgment assessment, the order does not become one.",
      "speaker": "court",
      "significance": "Clarifies label does not determine provision applied."
    }
  ],
  "_case_id": "1967_333",
  "_label": 1,
  "_text_length": 21037,
  "_extracted_at": "2026-02-10T20:24:46.069327"
}