{
  "metadata": {
    "case_name": "Appellant Company v. Union of India",
    "case_year": 1966,
    "court": "Supreme Court of India",
    "judges": [
      "Hidayatullah, J."
    ],
    "case_number": "Civil Appeal No. 30 of 1966",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The appellant is a public limited company which carries on the business of manufacturing and selling wholesale, paper and boards at Brajrajnagar in the State of Orissa.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The appellant company holds a licence under the Central Excise Act in Form L-4 prescribed by the Central Excise Rules, 1944. The Factory is traversed by railway lines, because the appellant company enjoys the benefit of a private siding.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "In 1960, the appellant Company constructed a new railway siding outside the original factory premises where bamboos and other raw materials were stored and constructed a platform for loading and unloading. This extension has not been included in the factory or its premises or precincts for purposes of the Excise Rules, because to reach the new siding, a public road has to be traversed which is not enclosed and from which public cannot be excluded.",
      "type": "background",
      "date": "1960",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "After this new siding was constructed, the appellant company requested the Excise authorities to amend the licence to include the new railway siding but this was refused.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "On February 27, 1961, the appellant company loaded 20 wagons of paper after effecting clearance of these goods by payment of the excise duty under r. 52 of the Excise Rules.",
      "type": "material",
      "date": "1961-02-27",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "On February 28, 1961, the appellant company loaded 13 more wagons and cleared them. These wagons were sealed by the railway administration and railway receipts were issued to the appellant company. The company also obtained gate pass.",
      "type": "material",
      "date": "1961-02-28",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "The wagons then passed into the control of the railway administration, but as pilot engine was not available, the wagons were shunted into the new siding. The exit from the new siding is only through the factory premises because the railway track comes to a dead-end on the other side.",
      "type": "material",
      "date": "1961-02-28",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "The Deputy Superintendent of Central Excise wrote to the appellant company on March 1, 1961 that the wagons loaded on February 27 and 28, 1961 were found inside the factory premises till 9-45 A.M. on March 1, 1961 and the goods were therefore liable to be assessed at the higher rates of excise duty current from March 1, 1961.",
      "type": "disputed",
      "date": "1961-03-01",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "The appellant company contended before the Deputy Superintendent that the wagons were duly sealed after the completion of loading in his presence, were taken out of the factory premises and were not in the factory when the new rates came into force.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f10",
      "text": "The Deputy Superintendent demanded payment of Rs. 45,475.83, from the appellant company as differential excise duty. The amount was paid under protest and without prejudice to the rights of appeal and representation.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "The Assistant Collector, Central Excise, Cuttack rejected the claim for refund and confirmed the collection of differential duty.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "The appeal to the Collector of Central Excise, Calcutta and Orissa was dismissed on March 12, 1962.",
      "type": "procedural",
      "date": "1962-03-12",
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "The application for revision against the order of the Collector before the Government of India (Central Excise Revision Application No. 463 of 1963) was rejected on June 7/8, 1963. No reason was given in the order communicated to the appellant company.",
      "type": "procedural",
      "date": "1963-06-07",
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "The duty of excise on paper and boards was increased by s 13 of the Finance Act, 1961 (Act XIV of 1961) read with item 17 of the Schedule. Under the Provisional Collection of Central Taxes Act (XVI of 1931) this duty became payable from the 1st day of March, 1961.",
      "type": "background",
      "date": "1961-03-01",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the goods cleared by payment of duty under r.9A first part are assessable at the rate in force on the date of payment of duty, or at the enhanced rate from March 1, 1961.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the goods were removed from the factory premises before midnight of February 28, 1961, so as not to be liable for enhanced duty even under the second part of r.9A.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Under r. 9A, first part, these goods were cleared by payment of excise duty and could not be reassessed to the enhanced duty.",
      "supporting_facts": [
        "f5",
        "f6",
        "f9"
      ],
      "legal_basis": "Rule 9A, first part, Central Excise Rules, 1944"
    },
    {
      "id": "pa2",
      "text": "Alternatively, the goods having been cleared or removed from the factory premises before the midnight of February 28, 1961, could not be made liable for the enhanced duty which came into force from March 1, 1961.",
      "supporting_facts": [
        "f6",
        "f7",
        "f9"
      ],
      "legal_basis": "Rule 9A, second part, Central Excise Rules, 1944"
    },
    {
      "id": "pa3",
      "text": "The first part of r.9A applies where duty is paid and goods cleared; critical time is payment of duty. Second part applies to removal without prior payment.",
      "supporting_facts": [
        "f5",
        "f6"
      ],
      "legal_basis": "Rule 9A, Central Excise Rules, 1944"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The wagons loaded on February 27 and 28, 1961 were found inside the factory premises till 9-45 A.M. on March 1, 1961 and the goods were therefore liable to be assessed at the higher rates.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "The main rule in first part of r.9A; second part is exception. Distinction based on clearance for unmanufactured vs. actual removal for manufactured goods.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": "Rule 9A, Central Excise Rules, 1944; Chapters IV and V of Rules"
    },
    {
      "id": "ra3",
      "text": "The new siding must be treated as still in the factory.",
      "supporting_facts": [
        "f7",
        "f8"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Rule 9A cannot be read on the basis of classification between unmanufactured and manufactured goods as suggested by Solicitor General. Distinction in two parts: if payment before removal, time is payment; if removal first, time is removal.",
      "addresses_issue": "i1",
      "key_observation": "In this case, payment of duty was synchronous with clearance; gate pass issued."
    },
    {
      "id": "cr2",
      "text": "Excise authorities refused to include new siding in factory premises. Wagons sealed after payment, shunted out on gate pass; per Board ruling 1957 and rules, goods free of enhanced duty.",
      "addresses_issue": "i2",
      "key_observation": "New siding not part of factory; goods removed before new rates."
    },
    {
      "id": "cr3",
      "text": "Scheme of Act and Rules: Duty payable on removal from factory; r.9 prohibits removal without payment; exceptions allow storage/warehousing without payment.",
      "addresses_issue": "i1",
      "key_observation": "For manufactured goods, payment and clearance synchronous here."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Goods cleared on payment of duty under r.9A first part attract rate in force on date of payment; here, old rate applies as payment synchronous with clearance and wagons removed from factory proper.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "New siding not part of factory as per Excise authorities; wagons shunted out after sealing and gate pass not liable to enhanced duty.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Board of Revenue ruling of 1957",
      "citation": null,
      "treatment": "followed",
      "relevance": "Effect of sealing wagons by Railway after loading and issuance of railway receipts; such goods not considered lying in factory premises."
    }
  ],
  "statutes_cited": [
    {
      "name": "Central Excise and Salt Act, 1944",
      "sections": [
        "Section 3",
        "Section 4"
      ],
      "relevance": "Levy of duty on excisable goods produced/manufactured; value at time of removal from factory."
    },
    {
      "name": "Central Excise Rules, 1944",
      "sections": [
        "Rule 9",
        "Rule 9A",
        "Rule 25",
        "Rule 47",
        "Rule 49",
        "Rule 51A",
        "Rule 52",
        "Rule 52A",
        "Rule 140"
      ],
      "relevance": "Time/manner of payment; alteration of duty rate; clearance procedures; prohibition on removal without payment; storage without payment."
    },
    {
      "name": "Finance Act, 1961",
      "sections": [
        "Section 13"
      ],
      "relevance": "Increased duty on paper and boards effective March 1, 1961 read with item 17 of Schedule."
    },
    {
      "name": "Provisional Collection of Taxes Act, 1931",
      "sections": [],
      "relevance": "Duty became payable from March 1, 1961."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; recovery of differential duty erroneous; duty collected must be refunded.",
    "relief_granted": "Refund of Rs. 45,475.83 differential excise duty paid under protest.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"The rate of duty and the tariff valuation (if any) applicable to goods cleared on payment of duty shall be the rate and valuation (if any) in force on the date on which duty is paid, or if the goods are cleared from a factory or a warehouse, on the date of the actual removal of such goods from such factory or warehouse.\"",
      "speaker": "court",
      "significance": "Relevant portion of Rule 9A central to dispute."
    },
    {
      "text": "if the goods were put in the wagons after payment of duty, and the wagons were sealed and shunted out of the factory proper on a gate pass, not only under the ruling of the Board but also on the application of the Rules as explained here these goods became free of the enhanced duty.",
      "speaker": "court",
      "significance": "Crux of court's reasoning favoring appellant."
    }
  ],
  "_case_id": "1967_300",
  "_label": 1,
  "_text_length": 20804,
  "_extracted_at": "2026-02-10T20:24:01.046701"
}