{
  "metadata": {
    "case_name": "Defendants 1, 2, 4, 6, 7 & Widow of Defendant 5 v. Shri Thakur Taraknathji",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "Bachawat, J."
    ],
    "case_number": "Civil Appeals Nos. 988 and 989 of 1964",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Harbans Narain Singh was the proprietor of villages Seha and Dhobaha and other villages.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Harbans Narain created encumbrances including mortgage dated February 10, 1886 in favour of Basanti Bibi, two mortgages dated September 9, 1907 and February 5, 1910 in favour of Harprasad Das, and mortgage dated August 2, 1911 in favour of defendant No. 1 Ramanandan Lal.",
      "type": "material",
      "date": "1886-02-10",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On June 23, 1915, Harbans Narain sold the villages to Mahabir Missir subject to the above mortgages.",
      "type": "material",
      "date": "1915-06-23",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Mahabir Missir redeemed the mortgages in favour of Basanti Bibi and Harprasad Das and became subrogated to their rights.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Ramanandan Lal instituted a suit to enforce his mortgage, obtained a final decree for sale, put the decree into execution, purchased villages Seha and Dhobaha at execution sale and obtained possession in 1919 and 1920.",
      "type": "material",
      "date": "1919-1920",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "In 1924, Mahabir instituted suit No. 17 of 1924 to enforce his mortgage lien praying for ratable contribution of his dues in respect of villages Seha and Dhobaha from Ramanandan Lal and obtained a final decree on August 22, 1931.",
      "type": "procedural",
      "date": "1931-08-22",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Mahabir died leaving his son Kashinath as his legal representative.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Kashinath put the decree in suit No. 17 of 1924 into execution. On July 13, 1934, Ramanandan Lal paid the decreetal dues in respect of village Seha.",
      "type": "procedural",
      "date": "1934-07-13",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "On November 4, 1935, village Dhobaha was sold in execution of the decree in suit No. 17 of 1924 and was purchased by Kashinath.",
      "type": "material",
      "date": "1935-11-04",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "In June 1934, Ramanandan Lal through his constituted attorney Munshi Sheobaran Lal granted five leases in respect of the suit lands in the village to defendants 2 to 7. At the time, Ramanandan Lal was the mortgagor in possession over which Kashinath had a mortgage lien.",
      "type": "disputed",
      "date": "1934-06",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Kashinath obtained a money decree against Ramatahal Pandey, husband of defendant No. 3, and in execution attached the suit lands.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Defendants 2 to 7 filed claim petitions objecting to the attachment under O.21 r.58 CPC. The claim petitions were allowed and lands released by orders dated November 20, 1942 and February 26, 1944. Executing court found leases genuine. Kashinath did not file suit under O.21 r.63 CPC.",
      "type": "procedural",
      "date": "1942-11-20",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "On June 11, 1946, Kashinath instituted suit against Ramanandan Lal and lessees for recovery of possession of suit lands and mesne profits alleging leases were collusive and not binding on him.",
      "type": "procedural",
      "date": "1946-06-11",
      "source": "court"
    },
    {
      "id": "f14",
      "text": "In other proceedings, it was declared that Mahabir was a benamidar for Shri Thakur Taraknathji and the deity was real owner. Kashinath lost interest. By order dated August 25, 1952, deity added as co-plaintiff.",
      "type": "material",
      "date": "1952-08-25",
      "source": "court"
    },
    {
      "id": "f15",
      "text": "Subordinate Judge Arrah held leases genuine, granted in due course of management, binding on plaintiffs, dismissed suit.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f16",
      "text": "Patna High Court allowed deity's appeal, decreed suit, held leases sham, in contravention of s.65A TPA, not binding. Rejected contention that O.21 r.58 orders precluded challenge.",
      "type": "procedural",
      "date": "1961-02-16",
      "source": "court"
    },
    {
      "id": "f17",
      "text": "Defendants Nos. 2,6,7 and widow of No.5 filed C.A. No.988/1964; defendants 1 and 4 filed C.A. No.989/1964 under HC certificates.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f18",
      "text": "All leases to defendants 2-7 claimed as permanent with rent fixed in perpetuity. Four by registered pattas. Mortgagor received nazrana/premium on four. Created after property advertised for sale in execution of mortgage decree. High Court found created in bad faith to cause loss to mortgagee.",
      "type": "disputed",
      "date": "1934-06",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the leases granted by Ramanandan Lal in June 1934 were binding on Kashinath as mortgagee.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether orders in claim proceedings under O.21 r.58 CPC precluded Kashinath/deity from challenging the leases (res judicata due to no suit under r.63).",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Orders in O.21 r.58 claim proceedings against Kashinath, and failure to file suit under r.63, operated as res judicata precluding challenge to leases.",
      "supporting_facts": [
        "f12"
      ],
      "legal_basis": "O.21 rr.58-63 CPC"
    },
    {
      "id": "pa2",
      "text": "Leases might not bind Kashinath as mortgagee, but after he purchased property, he ceased to be mortgagee and could not assert leases not binding.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Leases were sham transactions made in contravention of s.65A TPA and not binding.",
      "supporting_facts": [
        "f10",
        "f18"
      ],
      "legal_basis": "s.65A Transfer of Property Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Rejected res judicata contention: O.21 r.58 orders precluded Kashinath from claiming right to attach/sell lands in execution of money decree vs Ramatahal Pandey, but not from claiming right to sell in execution of mortgage decree vs Ramanandan Lal. Order not res judicata per se, only conclusive via r.63 on liability to attachment/sale in that execution.",
      "addresses_issue": "i2",
      "key_observation": "The bar of r.63 extends no further than question of liability to attachment/sale in execution of particular decree."
    },
    {
      "id": "cr2",
      "text": "Distinguished cited cases: In Subbier and Sarju Prasad, orders conclusive only on liability in that particular execution.",
      "addresses_issue": "i2",
      "key_observation": "Adverse orders conclusive only for money decree execution, not mortgage decree."
    },
    {
      "id": "cr3",
      "text": "s.65A TPA (from 1930) not applicable as mortgages pre-1930; validity per pre-65A law: mortgagor in possession may lease in ordinary course of management (year-to-year for agri lands), not permanent leases with fixed perpetuity rent, esp after advertisement for sale, with nazrana, in bad faith.",
      "addresses_issue": "i1",
      "key_observation": "Leases not in ordinary course of management as agent/bailiff of mortgagee."
    },
    {
      "id": "cr4",
      "text": "Auction-purchaser in mortgage decree sale buys mortgagor and mortgagee interest; if lease not binding on mortgagee, not on purchaser. Lessees lost redemption right by allowing sale.",
      "addresses_issue": "i1",
      "key_observation": "Lessee under non-binding lease cannot resist auction-purchaser's possession claim post-sale."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Orders under O.21 r.58 do not operate as res judicata beyond conclusiveness under r.63 on liability to attachment/sale in the specific execution.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Leases by mortgagor in possession not in ordinary course of management (permanent, fixed rent perpetuity, nazrana, post-sale notice, bad faith) not binding on mortgagee or auction-purchaser.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Kandai Narasimhachariar v. Raghava Padayachi",
      "citation": "I.L.R. 1946 Mad. 79",
      "treatment": "followed",
      "relevance": "Order in claim proceeding not conclusive for all purposes."
    },
    {
      "case_name": "Subbier v. Moideen Pitchai",
      "citation": "A.I.R. 1923 Mad. 562",
      "treatment": "distinguished",
      "relevance": "Order conclusive only on attachment/sale of specific debt in that execution."
    },
    {
      "case_name": "Sarju Prasad Missir v. Maksudan Choudhuri",
      "citation": "A.I.R. 1922 P.C. 341",
      "treatment": "distinguished",
      "relevance": "Order under old s.278 conclusive only on sale in that specific execution."
    },
    {
      "case_name": "Madan Mohan Singh v. Raj Kishori Kumari",
      "citation": "21 C.W.N. 88, 92",
      "treatment": "followed",
      "relevance": "Mortgagor may grant lease conformable to usage in ordinary course, not unusual terms."
    },
    {
      "case_name": "Raja Kamakshya Narayan Singh Bahadur v. Chohan Ram",
      "citation": "1953 S.C.R. 118",
      "treatment": "followed",
      "relevance": "Power to lease determined by ordinary course of management as bailiff/agent."
    },
    {
      "case_name": "Gobinda Chandra Saha v. Sasadhar Mandal",
      "citation": "A.I.R. 1947 Cal. 73",
      "treatment": "followed",
      "relevance": "Permanent lease with fixed perpetuity rent not ordinary course."
    },
    {
      "case_name": "Rust v. Goodale",
      "citation": "1957 1 Ch 33",
      "treatment": "referred",
      "relevance": "Mortgagee's right to treat mortgagor's tenant as trespasser passes to assignee/purchaser."
    }
  ],
  "statutes_cited": [
    {
      "name": "Code of Civil Procedure, 1908",
      "sections": [
        "Order 21 r.58",
        "Order 21 r.60",
        "Order 21 r.61",
        "Order 21 r.62",
        "Order 21 r.63",
        "Order 34 r.1"
      ],
      "relevance": "Claim proceedings summary; orders conclusive only per r.63 on attachment/sale liability in specific execution; lessee joinder if pre-suit."
    },
    {
      "name": "Transfer of Property Act, 1882",
      "sections": [
        "s.52",
        "s.65A"
      ],
      "relevance": "s.65A restricts leases binding on mortgagee (post-1930, not applicable here); s.52 binds lessee to litigation result during pendency."
    },
    {
      "name": "Transfer of Property Amendment Act, 1929",
      "sections": [
        "s.30",
        "s.63"
      ],
      "relevance": "Inserted s.65A effective 1930; s.63 saves pre-1930 mortgages."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court dismissed the appeals with costs, upholding Patna High Court decree granting possession of suit lands and mesne profits to the deity (plaintiff), holding leases not binding.",
    "relief_granted": "Decree for possession of suit lands and mesne profits to plaintiffs (deity).",
    "costs": "Appeals dismissed with costs."
  },
  "key_quotes": [
    {
      "text": "\"The order in the summary proceeding under r.58 does not operate as res judicata. It is because of rule 63 that the order becomes conclusive.\"",
      "speaker": "court",
      "significance": "Clarifies limited effect of claim orders."
    },
    {
      "text": "\"A permanent lease with rent fixed in perpetuity... is as good as the sale of the property itself. This is not sanctioned by the ordinary course of management.\"",
      "speaker": "court",
      "significance": "Defines invalid leases by mortgagor."
    },
    {
      "text": "\"An auction-purchaser at a sale held in execution of a mortgage decree buys not only the interest of the mortgagor but also the interest of the mortgagee.\"",
      "speaker": "court",
      "significance": "Explains purchaser's full rights."
    }
  ],
  "_case_id": "1967_24",
  "_label": 0,
  "_text_length": 18337,
  "_extracted_at": "2026-02-10T20:20:05.725044"
}