{
  "metadata": {
    "case_name": "S. Govinda Menon v. Union of India & State of Kerala",
    "case_year": 1966,
    "court": "Supreme Court of India",
    "judges": [
      "Ramaswami, J."
    ],
    "case_number": "Civil Appeal No. 1366 of 1966",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant Sri S. Govinda Menon is a member of the Indian Administrative Service, serving as First Member of the Board of Revenue, Kerala State and Commissioner of Hindu Religious and Charitable Endowments.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On basis of petitions containing allegations of misconduct against appellant in discharge of duties as Commissioner, Kerala Government instituted preliminary enquiries and started disciplinary proceedings, placing him under suspension under rule 7 of All India Services Discipline and Appeal Rules, 1955.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Copy of charges with statement of allegations served on appellant; he filed written statement of defence; Government found explanation unacceptable and appointed Sri T. N. S. Raghavan, retired ICS officer, as Enquiry Officer under rule 5 of the Rules.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Appellant filed Original Petition No.1 of 1964 in Kerala High Court praying for writ of certiorari to quash proceedings and writ of mandamus to allow him to function as First Member of Board of Revenue.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Enquiry Officer Sri T. N. S. Raghavan proceeded with inquiry despite writ petition and submitted report to Union Government finding appellant guilty of charges 1 to 4 and 9.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Union of India issued Show Cause Notice Ex. P-9 to appellant after considering enquiry report.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Appellant filed application to amend writ petition to seek writ of prohibition restraining Union of India from proceeding further on Show Cause Notice and quashing it; amendment allowed by High Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Appellant employed as Commissioner H.R.C.E. Administration Department from 1-2-1957 to 19-10-1962.",
      "type": "background",
      "date": "1957-02-01 to 1962-10-19",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Appellant sanctioned 30 leases of private forest lands of 5 Devaswoms (Pulpally Devaswom, Kallaikulangara Emoor Bhagavathi Temple, Nadivilla Vallathu Devaswom, Kottiyor Devaswom, Mundayanparamba Devaswom etc.); periods: 17 leases 36 years, one 96 years, rest 99 years; total area over 50,000 acres.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Charges 1 to 4 relate to conduct in sanctioning leases in utter disregard of Madras Hindu Religious and Charitable Endowments Act, 1951 and rules; appellant initiated proposals himself, sanctioned them, fixed premium/rental/timber value arbitrarily, put lessees in possession, influenced Collector of Kozhikode via Personal Assistant; sanctioned to relations, neighbours, friends contrary to Rule 3 All India Services Conduct Rules 1954.",
      "type": "disputed",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Charge 9: On 29-10-1962, appellant refused to attend conference convened by Chief Secretary with Members of Board of Revenue and Inspector General of Police to discuss national emergency matters, guilty of gross dereliction of duty and discourtesy.",
      "type": "disputed",
      "date": "1962-10-29",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Kerala High Court judgment dated January 5, 1966 in O.P. No.1 of 1964 dismissed writ petition; Mathew J. held jurisdiction exists; S. Velu Pillai J. held no jurisdiction for some charges; Govinda Menon J. agreed with Mathew J.",
      "type": "procedural",
      "date": "1966-01-05",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Suspension order dated March 8, 1963 under Rule 7; definite charges framed June 6, 1963.",
      "type": "procedural",
      "date": "1963-03-08",
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Earlier writ O.P. No. 485 of 1963 challenging suspension dismissed by Vaidialingam J., appeal dismissed by Division Bench.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether disciplinary proceedings can be initiated against IAS officer functioning as Commissioner under Madras Hindu Religious and Charitable Endowments Act, 1951 for acts/omissions in that capacity, as Commissioner is corporation sole not subject to Government control, and acts are quasi-judicial.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether writ of prohibition lies to restrain disciplinary proceedings for lack of jurisdiction.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether valid institution of disciplinary proceedings under Rule 4(1)(b) without formal order, and validity of suspension under Rule 7 before framing definite charges.",
      "framed_by": "petitioner"
    },
    {
      "id": "i4",
      "text": "Whether Commissioner can initiate lease proposals himself and sanction without public auction under the Act and rules.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Proceedings without jurisdiction as no disciplinary action for acts as Commissioner under 1951 Act; orders quasi-judicial, final unless set aside under Act; cannot be subject of disciplinary charges.",
      "supporting_facts": [
        "f1",
        "f9",
        "f10"
      ],
      "legal_basis": "Sections 20, 29(4), 99 Madras Act; corporation sole under s.80"
    },
    {
      "id": "pa2",
      "text": "Commissioner is corporation sole with separate personality, not servant of Government; no master-servant relation for disciplinary proceedings under Rule 4 AIS Rules.",
      "supporting_facts": [
        "f1"
      ],
      "legal_basis": "s.80,81 Madras Act; Rule 4 AIS Discipline Rules"
    },
    {
      "id": "pa3",
      "text": "No formal order instituting proceedings under Rule 4(1)(b); suspension invalid under Rule 7 before definite charges framed under Rule 5(2).",
      "supporting_facts": [
        "f13"
      ],
      "legal_basis": "Rules 4(1)(b),5(2),7 AIS Discipline Rules"
    },
    {
      "id": "pa4",
      "text": "No prohibition in Act for Commissioner to initiate lease proposals; auction rule under s.100(2)(m) not applicable to s.29 long-term leases.",
      "supporting_facts": [
        "f9",
        "f10"
      ],
      "legal_basis": "ss.20,29 Madras Act; rules under s.100(2)(m)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Disciplinary jurisdiction exists as acts/omissions reflect on integrity/devotion to duty as IAS officer, even if as Commissioner; no limitation in Rule 4 to master-servant acts.",
      "supporting_facts": [
        "f1",
        "f2",
        "f10"
      ],
      "legal_basis": "Rule 4 AIS Discipline Rules; Rule 3 AIS Conduct Rules"
    },
    {
      "id": "ra2",
      "text": "Commissioner not separate legal personality; corporation sole merely for property transmission; disciplinary proceedings valid for misconduct/recklessness even in quasi-judicial functions.",
      "supporting_facts": [
        "f9",
        "f10"
      ],
      "legal_basis": "ss.80,81 Madras Act"
    },
    {
      "id": "ra3",
      "text": "Proceedings validly instituted by Ex.P-1 order; res judicata from prior writ dismissal; suspension valid under Rule 7 considering nature of accusations.",
      "supporting_facts": [
        "f13",
        "f14"
      ],
      "legal_basis": "Rule 7 AIS Discipline Rules"
    },
    {
      "id": "ra4",
      "text": "All leases require public auction under Rule 1 s.100(2)(m); Commissioner cannot initiate/sanction without auction or trustee proposal.",
      "supporting_facts": [
        "f9",
        "f10"
      ],
      "legal_basis": "s.29, rules under ss.29,100(2)(m) Madras Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Rule 4(1) imposes no limitation on nature of act/omission; proceedings possible if reflects on integrity/good faith/devotion to duty as Service member, even without master-servant relation.",
      "addresses_issue": "i1",
      "key_observation": "Test is reasonable connection with service or reflection on reputation for integrity/devotion to duty."
    },
    {
      "id": "cr2",
      "text": "Corporation sole under s.80 not separate legal personality like aggregate; merely for property vesting/transmission; does not exempt from discipline.",
      "addresses_issue": "i1",
      "key_observation": "Juristic distinction; not psychological person."
    },
    {
      "id": "cr3",
      "text": "Even assuming quasi-judicial function in sanctioning leases, disciplinary proceedings lie for misconduct/recklessness/abuse of power; challenges conduct, not legality of order (which can go to appeal/revision).",
      "addresses_issue": "i1",
      "key_observation": "Government not precluded from discipline if gross recklessness or failure to act honestly."
    },
    {
      "id": "cr4",
      "text": "Rule 1 under s.100(2)(m) applies to all leases including s.29 long-term; no authority for Commissioner to sanction without auction; trustee initiates, Commissioner sanctions proposals.",
      "addresses_issue": "i4",
      "key_observation": "s.20 general superintendence does not allow initiating specific proposals; would lead to judging own proposals."
    },
    {
      "id": "cr5",
      "text": "Ex.P-1 order initiates proceedings under Rule 4(1); no formal order needed; 'charges' in Rule 7 wider than definite charges in Rule 5(2), means accusations.",
      "addresses_issue": "i3",
      "key_observation": "Suspension valid pre-framing definite charges."
    },
    {
      "id": "cr6",
      "text": "Writ of prohibition supervisory for lack/excess of jurisdiction or natural justice violation, not errors of law/merits; no want of jurisdiction here.",
      "addresses_issue": "i2",
      "key_observation": "Distinction between want of jurisdiction and manner of exercise."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Disciplinary proceedings under AIS Rules valid against IAS officer as Commissioner for acts reflecting on integrity, even quasi-judicial or without direct administrative control.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "No case for writ of prohibition; High Court correctly dismissed petition.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Proceedings validly instituted; suspension compliant with Rule 7.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    },
    {
      "id": "h4",
      "text": "Commissioner cannot initiate lease proposals or sanction without public auction.",
      "resolves_issue": "i4",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "The King v. North",
      "citation": "1927 1 K.B. 411",
      "treatment": "followed",
      "relevance": "Writ of prohibition for violation of natural justice as absence of jurisdiction."
    },
    {
      "case_name": "Regina v. Comptroller-General of Patents and Designs",
      "citation": "1953 2 W.L.R. 760,765",
      "treatment": "followed",
      "relevance": "Prohibition not for error of law unless outside jurisdiction."
    },
    {
      "case_name": "Parisienne Basket Shoes Proprietary Ltd. v. Whyte",
      "citation": "59 C.L.R. 369",
      "treatment": "followed",
      "relevance": "Prohibition not for error of law unless outside jurisdiction."
    },
    {
      "case_name": "Pearce v. Foster",
      "citation": "17 Q.B.D. 536, 542",
      "treatment": "followed",
      "relevance": "Misconduct justifying dismissal if prejudicial to master's reputation, even outside business."
    },
    {
      "case_name": "S. Govinda Menon v. State of Kerala",
      "citation": "1963 K.L.T. 1162",
      "treatment": "referred",
      "relevance": "Prior dismissal of suspension challenge; res judicata argued."
    }
  ],
  "statutes_cited": [
    {
      "name": "Madras Hindu Religious and Charitable Endowments Act, 1951",
      "sections": [
        "Section 20",
        "Section 29",
        "Section 80",
        "Section 81",
        "Section 99"
      ],
      "relevance": "Powers of Commissioner for superintendence, sanction of leases (publication, objections, appeal, revision); corporation sole for fund vesting."
    },
    {
      "name": "All India Services (Discipline and Appeal) Rules, 1955",
      "sections": [
        "Rule 4",
        "Rule 5",
        "Rule 7"
      ],
      "relevance": "Authority to institute proceedings, framing charges, suspension during proceedings."
    },
    {
      "name": "All India Services (Conduct) Rules, 1954",
      "sections": [
        "Rule 3"
      ],
      "relevance": "Maintain absolute integrity; no favour to relations/friends."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court dismissed the appeal by certificate against Kerala High Court judgment dated January 5, 1966 dismissing writ petition; held disciplinary proceedings valid, no jurisdiction defect, no ground for writ of prohibition.",
    "relief_granted": "None",
    "costs": "No order as to costs."
  },
  "key_quotes": [
    {
      "text": "The test is whether the act or omission has some reasonable connection with the nature and condition of his service or whether the act or omission has cast any reflection upon the reputation of the member of the Service for integrity or devotion to duty as a public servant.",
      "speaker": "court",
      "significance": "Defines scope of disciplinary jurisdiction beyond strict master-servant acts."
    },
    {
      "text": "If a servant conducts himself in a way inconsistent with the faithful discharge of his duty in the service, it is misconduct which justifies immediate dismissal. That misconduct... need not be misconduct in the carrying on of the service or the business.",
      "speaker": "court",
      "significance": "From Pearce v. Foster; supports discipline for reputation-affecting acts."
    },
    {
      "text": "We are accordingly of the opinion that the appellant has been unable to make good his argument on this aspect of the case.",
      "speaker": "court",
      "significance": "Rejects quasi-judicial finality bar to discipline."
    }
  ],
  "_case_id": "1967_271",
  "_label": 0,
  "_text_length": 42038,
  "_extracted_at": "2026-02-10T20:23:28.058857"
}