{
  "metadata": {
    "case_name": "State of Mysore v. Respondent (Owner of Motor Car MYU-1089)",
    "case_year": 1965,
    "court": "Supreme Court of India",
    "judges": [
      "Shelat, J."
    ],
    "case_number": "Criminal Appeal No. 10 of 1965",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The respondent, the owner of a motor car bearing No. MYU-1089, carried 8 passengers in his said car on Nanjangud-Mysore Road on April 5, 1963 and collected Rs. 5 from each of them.",
      "type": "material",
      "date": "1963-04-05",
      "source": "prosecution"
    },
    {
      "id": "f2",
      "text": "He was charge-sheeted under section 42(1) read with section 123 of the Motor Vehicles Act for having used the said car as a transport vehicle without the permit required under section 42(1).",
      "type": "procedural",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f3",
      "text": "The trial Magistrate did not go into the merits though the prosecution led evidence and acquitted him relying on the decision of the High Court of Mysore in Jayaram v. The State of Mysore.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f4",
      "text": "The State took the matter in appeal to the High Court urging that the said decision required reconsideration. The High Court dismissed the appeal.",
      "type": "procedural",
      "date": "1964-07-10",
      "source": "state"
    },
    {
      "id": "f5",
      "text": "In B.S. Usman Saheb v. The State of Mysore, the owner of a motor car carried cement bags and other goods without a permit. Trial Magistrate convicted, High Court set aside holding mere use for goods does not convert to goods vehicle.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "In Jayaram v. The State of Mysore, accused used motor vehicle registered as motor car for carrying passengers for reward. High Court held it was not a transport vehicle.",
      "type": "background",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "The true meaning of section 42(1) of the Motor Vehicles Act 1939: whether an owner of a motor car registered as such who uses it for carrying passengers for hire or reward without a permit contravenes section 42(1).",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Though a motor vehicle is registered as a motor car, if it is used for carrying passengers for hire or reward, it must be said to have been used as a transport vehicle, and if so used without a permit, there would be a breach of section 42(1).",
      "supporting_facts": [
        "f1",
        "f2"
      ],
      "legal_basis": "Section 42(1), definitions in Section 2(16), 2(25), 2(33) of Motor Vehicles Act"
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Section 42(1) cannot mean it applies only to vehicles registered as transport vehicles, as that would allow use of non-transport vehicles for passengers for hire without permit, leading to anomalous result contrary to legislative intent for control of transport vehicles.",
      "addresses_issue": "i1",
      "key_observation": "The sub-section must be construed to effectuate the object: if a motor vehicle is used as a transport vehicle, permit is required."
    },
    {
      "id": "cr2",
      "text": "A transport vehicle means a public service vehicle, which means any motor vehicle used or adapted to be used for carriage of passengers for hire or reward. Thus, use for carrying passengers for hire determines it is a transport vehicle.",
      "addresses_issue": "i1",
      "key_observation": "Even if occasionally used, when so used it is a public service vehicle requiring permit."
    },
    {
      "id": "cr3",
      "text": "Mysore High Court view in Jayaram and Usman Saheb is incorrect; Madras High Court view is correct and in consonance with purpose of controlling vehicles for passenger safety.",
      "addresses_issue": "i1",
      "key_observation": "Construction defeating safety object cannot be accepted."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "If a person owns a motor vehicle and uses it or permits its use as a transport vehicle (e.g., carrying passengers for hire or reward), he must take out the requisite permit; absence thereof infringes section 42(1) read with section 123.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Jayaram v. The State of Mysore",
      "citation": "1962 Mys L.J. 392",
      "treatment": "overruled",
      "relevance": "Held motor car used for passengers not transport vehicle; SC holds incorrect"
    },
    {
      "case_name": "B.S. Usman Saheb v. The State of Mysore",
      "citation": "1959 Mys. L.J. 388",
      "treatment": "overruled",
      "relevance": "Held motor car used for goods not goods vehicle; similar to Jayaram, incorrect"
    },
    {
      "case_name": "Payne v. Allcock",
      "citation": "1932 2 K.B. 413",
      "treatment": "followed",
      "relevance": "Use of private car for goods conveyance brought it under higher duty class based on purpose of use"
    },
    {
      "case_name": "Public Prosecutor v. Captain R. Rajagopalan",
      "citation": "A.I.R. 1938 Mad. 233",
      "treatment": "followed",
      "relevance": "Even one use of private vehicle for hire makes it 'let for hire' requiring licence"
    },
    {
      "case_name": "Re. Manager, Indian Express",
      "citation": "A.I.R. 1945 Mad. 440",
      "treatment": "followed",
      "relevance": "Motor car used twice for goods became goods vehicle requiring permit under s.42(1)"
    }
  ],
  "statutes_cited": [
    {
      "name": "Motor Vehicles Act, 1939",
      "sections": [
        "42(1)",
        "123",
        "2(18)",
        "2(16)",
        "2(25)",
        "2(33)",
        "3"
      ],
      "relevance": "Section 42(1) controls use of transport vehicles requiring permit; definitions determine transport vehicle by use for passengers for hire"
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "The appeal is allowed. The order of acquittal passed by the trial Magistrate and confirmed by the High Court is set aside and the Magistrate is directed to proceed with the case on merits in accordance with law and in the light of the observations made in this judgment.",
    "relief_granted": "Acquittal set aside; case remanded to trial Magistrate for trial on merits",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "What the sub-section emphasises is the use of a motor vehicle as a transport vehicle and the necessity of a Permit which is required for purposes of exercising control over vehicles used as transport vehicles.",
      "speaker": "court",
      "significance": "Core holding on interpretation of s.42(1)"
    },
    {
      "text": "It is the use of the motor vehicle for carrying passengers for hire or reward which determines the category of the motor vehicle whether it is adapted for that purpose or not.",
      "speaker": "court",
      "significance": "Defines when a vehicle becomes transport vehicle"
    },
    {
      "text": "The view taken by the Mysore High Court with respect is not correct and the view taken by the High Court of Madras is not only correct but is in consonance with the purpose and object of s.42(1).",
      "speaker": "court",
      "significance": "Rejects Mysore HC precedents, approves Madras HC"
    }
  ],
  "_case_id": "1967_115",
  "_label": 1,
  "_text_length": 13484,
  "_extracted_at": "2026-02-10T20:21:27.561956"
}