{
  "metadata": {
    "case_name": "State of Madras v. Respondent (Beedi Manufacturer) & Connected Appeals",
    "case_year": 1966,
    "court": "Supreme Court of India",
    "judges": [
      "Ramaswami, J."
    ],
    "case_number": "Civil Appeals Nos. 495, 539, 540, 684, 694, 717 and 857 of 1966",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Respondent was a Beedi manufacturer in Gudiyattam, Madras State, assessed to sales tax on taxable turnover of Rs. 1,73,502/11/10 for assessment year 1955-56 by Deputy Commercial Tax Officer by order dated February 15, 1957.",
      "type": "procedural",
      "date": "1957-02-15",
      "source": "lower_court"
    },
    {
      "id": "f2",
      "text": "Respondent appealed to Appellate Assistant Commissioner of Commercial Taxes, Salem, disputing inclusion of Rs. 1,11,299/- as second purchases or purchases outside State of Madras.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f3",
      "text": "Pending appeal, Madras General Sales Tax Act, 1959 repealed 1939 Act; appeal disposed under 1959 Act.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Appellate Assistant Commissioner by order dated July 2, 1960 held excise duty not part of purchase turnover but enhanced assessment by Rs. 1,15,406/14/9 as inter-State purchases from April 1, 1955 to September 5, 1955.",
      "type": "procedural",
      "date": "1960-07-02",
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "Respondent appealed to Sales Tax Appellate Tribunal; appellant filed petitions for enhancement by Rs. 3,66,213/12/- representing sales of manufactured beedies to non-resident buyers during May 12, 1955 to September 5, 1955, goods within State at time of contract of sale.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "Appellant contended sales taxable by virtue of Explanation 2 to s. 2(h) of Madras General Sales Tax Act, 1939 due to Sales Tax Laws Validation Act, 1956 lifting ban on inter-State sales tax.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "Sales Tax Appellate Tribunal by order dated July 13, 1962 allowed enhancement petition, rejected respondent's contention of agency sales through Commission Agents, remanded case on second purchases or outside purchases of raw tobacco.",
      "type": "procedural",
      "date": "1962-07-13",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Respondent filed petition in Madras High Court under s. 38 of Madras General Sales Tax Act, 1959.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f9",
      "text": "Madras High Court by order dated September 23, 1963 held: (1) inclusion of inter-State purchases Rs. 1,15,406/14/9 bad as Appellate Assistant Commissioner had no jurisdiction; (2) turnover Rs. 3,66,213/12/- not taxable as beedies delivered outside State for consumption, constituting explanation sales under Art. 286(1) Constitution pre-Sixth Amendment, Madras had no jurisdiction.",
      "type": "procedural",
      "date": "1963-09-23",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Other appeals (539,540,717,684,694,857/1966) involve similar issues on taxability of explanation sales under Art. 286(1)(a) post-Validation Act where goods delivered outside Madras for consumption.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "High Court in connected appeals relied on affidavits from respondents regarding mode of sales (e.g., wool to Bangalore merchants), no objection by appellant to affidavits.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "In CA 717/1966, High Court found transactions from 1955-56, large number (4000+), small values, invoices show delivery outside Madras for consumption, no remand needed.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether Madras State had jurisdiction to levy sales tax on alleged explanation sales by respondent during April 1, 1955 to September 5, 1955 by virtue of Explanation 2 to s. 2(h) Madras General Sales Tax Act, 1939, post Sales Tax Laws Validation Act, 1956.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether High Court could entertain and rely on affidavits filed by respondent under revisional powers s.38 Madras General Sales Tax Act, 1959.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether ban under Art. 286(1)(a) Constitution is independent of Art. 286(2) and not lifted by Validation Act.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Validation Act lifted ban on taxation of inter-State sales; transactions assessable under Madras General Sales Tax Act, 1939 on its own terms, particularly Explanation 2 to s.2(h), as goods in State at contract time.",
      "supporting_facts": [
        "f5",
        "f6"
      ],
      "legal_basis": "Explanation 2 to s.2(h) Madras General Sales Tax Act, 1939; Sales Tax Laws Validation Act, 1956; Messrs Ashok Leyland Ltd. v. State of Madras"
    },
    {
      "id": "pa2",
      "text": "High Court had no power to take additional evidence via affidavits under s.38; should have remitted to Tribunal.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": "s.38 Madras General Sales Tax Act, 1959"
    },
    {
      "id": "pa3",
      "text": "In connected appeals, High Court erred in assuming delivery outside State without remand; should call for affidavits or fresh findings.",
      "supporting_facts": [
        "f11",
        "f12"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Sales were explanation sales under Art.286(1)(a) Constitution; beedies delivered outside State for consumption; Madras no jurisdiction.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": "Art. 286(1)(a) Constitution (pre-Sixth Amendment)"
    },
    {
      "id": "ra2",
      "text": "Transactions in 1955, accounts not retained beyond 5 years; no need for remand.",
      "supporting_facts": [
        "f12"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Validation Act lifted ban under Art.286(2) retrospectively for 1951-1955 but not ban under Art.286(1)(a); restrictions cumulative; explanation sales deemed inside State of actual delivery for consumption, outside all others.",
      "addresses_issue": "i1",
      "key_observation": "Even post-Validation Act, State cannot tax inter-State sales outside territorial limits per Art.286(1)(a) Explanation."
    },
    {
      "id": "cr2",
      "text": "Ashok Leyland distinguished as not explanation sales; operative parts of Art.286 deal with different topics, Explanation to cl.(1)(a) not extendable to cl.(2).",
      "addresses_issue": "i1",
      "key_observation": "Bengal Immunity holds cl.(1)(a) Explanation cannot limit cl.(2)."
    },
    {
      "id": "cr3",
      "text": "High Court affidavits: No objection raised by appellant; transactions old, no worthwhile remand.",
      "addresses_issue": "i2",
      "key_observation": "Waiver of objection; practical considerations."
    },
    {
      "id": "cr4",
      "text": "In connected appeals, same reasoning applies; High Court findings on facts supported by material.",
      "addresses_issue": "i3",
      "key_observation": "Ban under Art.286(1)(a) independent, not removed by Validation Act."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Madras State had no jurisdiction to tax sales where goods delivered outside State for consumption during April 1, 1955 to September 5, 1955, even under Explanation 2 s.2(h) 1939 Act post-Validation Act.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "High Court did not act illegally in relying on affidavits as no objection raised.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Ban under Art.286(1)(a) independent of Art.286(2); Validation Act lifts only latter.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Bengal Immunity Co. Ltd. v. State of Bihar",
      "citation": "1955 2 S.C.R. 603",
      "treatment": "followed",
      "relevance": "Art.286 parts deal with different topics; Explanation cl.(1)(a) not extendable to cl.(2); no State tax on inter-State sales till Parliament provides."
    },
    {
      "case_name": "Messrs Ashok Leyland Ltd. v. State of Madras",
      "citation": "1962 1 S.C.R. 607",
      "treatment": "distinguished",
      "relevance": "Not applicable as not explanation sales; deliveries inside State."
    },
    {
      "case_name": "State of Bombay v. United Motors (India) Ltd.",
      "citation": "1953 S.C.R. 1069",
      "treatment": "followed",
      "relevance": "Explanation deems sale in State of actual delivery for consumption; replaces territorial nexus test."
    },
    {
      "case_name": "Shree Bajrang Jute Mills Ltd. v. State of Andhra Pradesh",
      "citation": "1964 6 S.C.R. 691",
      "treatment": "followed",
      "relevance": "Sales with delivery outside State for consumption not taxable by despatching State."
    },
    {
      "case_name": "Singareni Collieries Co. Ltd. v. State of Andhra Pradesh",
      "citation": "1966 2 S.C.R. 190",
      "treatment": "followed",
      "relevance": "Sales of coal delivered outside State not taxable; Explanation locates sale at delivery-cum-consumption State."
    }
  ],
  "statutes_cited": [
    {
      "name": "Madras General Sales Tax Act, 1939",
      "sections": [
        "s. 2(h) Explanation 2",
        "s. 3"
      ],
      "relevance": "Defines 'sale' deeming it in State if goods there at contract or produced later; charging section for tax on turnover."
    },
    {
      "name": "Madras General Sales Tax Act, 1959",
      "sections": [
        "s. 38"
      ],
      "relevance": "High Court revisional jurisdiction; power to hear on questions of law, remit, take evidence."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 286(1)(a), (1)(b), (2), (3)"
      ],
      "relevance": "Bans on State sales tax: outside sales, import/export, inter-State trade, essential goods; Explanation deems inside sale at delivery for consumption State."
    },
    {
      "name": "Sales Tax Laws Validation Act, 1956",
      "sections": [
        "s. 2"
      ],
      "relevance": "Validates State taxes on inter-State sales 1951-1955 retrospectively, lifting Art.286(2) ban."
    },
    {
      "name": "Government of India Act, 1935",
      "sections": null,
      "relevance": "Permitted Provincial sales tax with territorial nexus."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "All appeals dismissed; Supreme Court held Madras State lacked jurisdiction to tax explanation sales under Art.286(1)(a) where goods delivered outside State for consumption, even post-Validation Act lifting only Art.286(2) ban. High Court correct on affidavits and findings.",
    "relief_granted": "None to petitioner; upheld High Court orders excluding disputed turnovers.",
    "costs": "No order as to costs in most appeals; in CA 717/1966, respondent entitled to costs as ordered on July 29, 1965."
  },
  "key_quotes": [
    {
      "text": "\"The Validation Act merely lifted the ban under Art. 286(2) of the Constitution on the States power to legislate but the ban imposed by Art. 286(1)(a) of the Constitution was still effective.\"",
      "speaker": "court",
      "significance": "Core holding distinguishing bans under Art.286 clauses."
    },
    {
      "text": "\"A sale or purchase shall be deemed to have taken place in the State in which the goods have actually been delivered as a direct result of such sale or purchase for the purpose of consumption in that State.\"",
      "speaker": "court",
      "significance": "Quotes Art.286(1)(a) Explanation defining situs of explanation sales."
    },
    {
      "text": "\"The operative provisions of the several parts of Art. 286... are intended to deal with different topics and one cannot be projected or read into another.\"",
      "speaker": "court",
      "significance": "From Bengal Immunity; justifies independent application of clauses."
    }
  ],
  "_case_id": "1967_326",
  "_label": 0,
  "_text_length": 32235,
  "_extracted_at": "2026-02-10T20:24:45.065387"
}