{
  "metadata": {
    "case_name": "Income-tax Officer, Agra v. Radha Krishan",
    "case_year": 1966,
    "court": "Supreme Court of India",
    "judges": [
      "Shah, J."
    ],
    "case_number": "Civil Appeal No. 1413 of 1966",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "A business of manufacture and sale of tents was commenced in 1940 in the name and style of Messrs Jawahar Tent Factory, Agra, in partnership with four partners: Jawahar Lal (representing his Hindu undivided family, share 8 annas in a rupee), Shiam Lal, Radha Raman and Radha Krishan (each share 2 annas 8 pies).",
      "type": "background",
      "date": "1940",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The firm was registered under s. 26A of the Indian Income-tax Act, 1922, and tax was assessed on the income of the firm in accordance with s. 23(5)(a) of the Act.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The partnership was dissolved on October 23, 1946, according to the Income-tax Officer.",
      "type": "material",
      "date": "1946-10-23",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "This appeal relates to the tax liability of Jawahar Lal in respect of the income from the firm for the assessment years 1944-45, 1945-46, 1946-47 and 1947-48.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Share of income of Jawahar Lal from the firm and tax liability satisfied by him: 1944-45: Rs. 47,717 income, Rs. 8,623-56 tax; 1945-46: Rs. 53,864 income, Rs. 39,416-23 tax; 1946-47: Rs. 35,167 income, Rs. 16,92-59 tax; 1947-48: Rs. 19,466 income, Rs. 15,163-87 tax; Total tax satisfied: Rs. 79,296-25.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The Hindu undivided family of Jawahar Lal had considerable other income. In accordance with s. 25(3) of the Indian Income-tax Act, the share of Jawahar Lal from the partnership was added to the other income of the family, and the family was assessed to tax on the total income. The tax liability attributable to the share was computed by applying the average rate of tax on the total income of the family to the share from the firm.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "The Income-tax Officer served Radha Krishan with demand notices for the tax remaining unpaid by Jawahar Lal on October 3, 1962.",
      "type": "procedural",
      "date": "1962-10-03",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Radha Krishan moved the High Court of Judicature at Allahabad for a writ of certiorari quashing the notices of demand and for an order directing the Income-tax Officer to withdraw the notices.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Manchanda, J. allowed the petition filed by Radha Krishan.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "The order passed by Manchanda, J. was confirmed in appeal by a Division Bench of the Allahabad High Court in Special Appeal No. 205 of 1963 on July 31, 1963.",
      "type": "procedural",
      "date": "1963-07-31",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Appeal to Supreme Court by special leave by the Income-tax Officer, Agra.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the tax attributable to the share in the income of a registered firm of a partner (Jawahar Lal) who has paid tax on his total income including that share, can be recovered from his erstwhile partner (Radha Krishan) under the provisions of the Indian Income-tax Act, 1922.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Even though by s. 23(5)(a) provision was made for assessment to tax of the total income of each member of a registered firm by adding to his separate income the share of the profits of the firm, it is the firm which is assessed to tax, and if the tax attributable to the share in the income of the firm of a partner cannot be recovered from him, it may be recovered from his other partners.",
      "supporting_facts": [
        "f2",
        "f4",
        "f5"
      ],
      "legal_basis": "s. 23(5)(a); liability of partners joint and several"
    },
    {
      "id": "pa2",
      "text": "The liability to pay Income-tax is statutory but the liability of the partners of a firm in respect of all its obligations including the liability to pay tax is joint and several.",
      "supporting_facts": [],
      "legal_basis": "s. 44 of the Income-tax Act"
    },
    {
      "id": "pa3",
      "text": "This Court had accepted the view that the liability of the partners of a firm to pay tax attributable to the share of each partner in the income of the firm is joint and several.",
      "supporting_facts": [],
      "legal_basis": "CIT Bombay v. Amritlal Bhogilal (34 ITR 130); CIT Madras v. S.V. Angidi Chettiar (44 ITR 739); Shivram Poddar v. ITO (51 ITR 823)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The notices of demand issued to Radha Krishan for tax unpaid by Jawahar Lal are invalid as there is no joint and several liability for tax assessed individually against each partner of a registered firm.",
      "supporting_facts": [
        "f2",
        "f6",
        "f7"
      ],
      "legal_basis": "s. 23(5)(a)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The machinery for assessment to tax the income of a firm: firm is unit of assessment; for registered firm under s. 26A, share of each partner added to his other income and taxed individually; no levy against the firm itself.",
      "addresses_issue": "i1",
      "key_observation": "Tax is collected from partners individually for registered firms."
    },
    {
      "id": "cr2",
      "text": "Liability to pay Income-tax is statutory, not contractual; no joint and several liability unless provided by statute.",
      "addresses_issue": "i1",
      "key_observation": "Contractual joint liability does not extend to tax."
    },
    {
      "id": "cr3",
      "text": "S. 44 applies to prevent evasion on discontinuance/dissolution, making partners jointly and severally liable for tax on firm's income assessed as a unit; does not apply to individual assessments under s. 23(5)(a) of registered firms.",
      "addresses_issue": "i1",
      "key_observation": "S. 44 inconsistent with scheme of taxing registered firm partners individually."
    },
    {
      "id": "cr4",
      "text": "Precedents cited by petitioner do not support joint liability for individual partner assessments under s. 23(5)(a); observations in those cases relate to different contexts.",
      "addresses_issue": "i1",
      "key_observation": "No support in cited cases for recovering one partner's tax from another."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "For payment of tax assessed against a partner of a registered firm individually under s. 23(5)(a), another partner is not liable jointly and severally.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Commissioner of Income-tax, Madras v. S. V. Angidi Chettiar",
      "citation": "44 I.T.R. 739",
      "treatment": "followed",
      "relevance": "S. 44 applies to both registered and unregistered firms; power to impose penalty post-dissolution; but no support for joint liability in individual assessments under s. 23(5)(a)"
    },
    {
      "case_name": "Commissioner of Income-tax, Bombay v. Amritlal Bhogilal & Co.",
      "citation": "34 I.T.R. 130",
      "treatment": "distinguished",
      "relevance": "Scheme of assessment of registered firms; no implication of joint liability for partners' individual shares"
    },
    {
      "case_name": "Shivram Poddar v. Income-tax Officer, Central Circle II, Calcutta",
      "citation": "51 I.T.R. 823",
      "treatment": "distinguished",
      "relevance": "Firm liable post-discontinuance under Ch. IV; s. 44 joint liability when assessed as firm, not for individual partner assessments"
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act, 1922",
      "sections": [
        "s. 23(5)",
        "s. 26A",
        "s. 25(3)",
        "s. 44",
        "s. 28"
      ],
      "relevance": "Governs assessment of registered firms (individual partner taxation under s.23(5)(a)); computation of tax on HUF (s.25(3)); joint liability on discontinuance (s.44, not applicable here)"
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court dismissed the appeal by special leave filed by the Income-tax Officer, upholding the Allahabad High Court's order quashing the demand notices issued to Radha Krishan for tax attributable to Jawahar Lal's share in the registered firm.",
    "relief_granted": "Writ of certiorari quashing demand notices confirmed; ITO directed to withdraw notices (as per High Court).",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The entire scheme of taxing the income of a registered firm in the hands of individual partners is inconsistent with any assumption that for payment of tax assessed against a partner, other partners are liable.",
      "speaker": "court",
      "significance": "Core holding rejecting joint liability for individual assessments"
    },
    {
      "text": "Section 44 contemplates cases of joint and several assessment of income of the business of a firm which is discontinued. When such an assessment is made, each member of the firm may be liable to pay jointly and severally tax payable by the firm.",
      "speaker": "court",
      "significance": "Distinguishes s.44 from s.23(5)(a) assessments"
    }
  ],
  "_case_id": "1967_279",
  "_label": 0,
  "_text_length": 14087,
  "_extracted_at": "2026-02-10T20:23:54.389267"
}