{
  "metadata": {
    "case_name": "Appellants v. State",
    "case_year": 1965,
    "court": "Supreme Court of India",
    "judges": [
      "Hegde, J."
    ],
    "case_number": "Criminal Appeal No. 50 of 1965",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Acquitted third accused was the owner of the jeep bearing registration No. BYF 5448. Accused No. 2 is his father. They are residents of Malshiras.",
      "type": "background",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f2",
      "text": "On October 27, 1962, the appellants along with PW Rambhau Bhombe and one other, went in the jeep first to Phaltan (about 33 miles from Malshiras), from there to Rajale (about seven miles from Phaltan), returned to Phaltan, then to Malegaon, stayed for the night at Malegaon.",
      "type": "material",
      "date": "1962-10-27",
      "source": "prosecution"
    },
    {
      "id": "f3",
      "text": "Next day (October 28, 1962), they returned to Phaltan and finally to Malshiras. During all this time, appellant No. 1 was driving the jeep.",
      "type": "material",
      "date": "1962-10-28",
      "source": "prosecution"
    },
    {
      "id": "f4",
      "text": "On the way from Phaltan to Malshiras, about a mile and a half from Phaltan, the jeep struck one Bapu Babaji Bhiwarkar, as a result of which he sustained serious injuries.",
      "type": "material",
      "date": "1962-10-28",
      "source": "prosecution"
    },
    {
      "id": "f5",
      "text": "The appellants put the injured person in the jeep and brought back the jeep to Phaltan where they approached PW Dr. Karwa for medical aid, but Dr. Karwa refused to treat the injured as it was a medico-legal case and asked them to go to Government Dispensary.",
      "type": "material",
      "date": "1962-10-28",
      "source": "prosecution"
    },
    {
      "id": "f6",
      "text": "The appellants instead of going to the Government Dispensary, drove straight to Malshiras. On the way the injured died.",
      "type": "material",
      "date": "1962-10-28",
      "source": "prosecution"
    },
    {
      "id": "f7",
      "text": "At Malshiras the appellants cremated his dead body.",
      "type": "material",
      "date": "1962-10-28",
      "source": "prosecution"
    },
    {
      "id": "f8",
      "text": "At the time of the incident, the first appellant had only a learners licence and no person having a valid licence for driving was by his side.",
      "type": "admitted",
      "date": "1962-10-28",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Courts below accepted the above facts.",
      "type": "admitted",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "In the trial court there were nine accused. All except accused Nos. 1 and 2 (appellants) were acquitted.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "PW Shankar Burmule gave evidence that he had seen accused No. 1 driving for about six months to a year.",
      "type": "disputed",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f12",
      "text": "Trial court convicted appellant No. 1 under s. 304A IPC, s. 3 read with s. 112 of the Motor Vehicles Act and under s. 89 of the same Act. Convicted second appellant under s. 201 IPC, s. 5 as well as under s. 89 of the Motor Vehicles Act.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Convictions affirmed by Sessions Judge of Satara in appeal and by Bombay High Court in Criminal Revision Application No. 917 of 1964 dated February 15, 1965.",
      "type": "procedural",
      "date": "1965-02-15",
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether on the facts found by the courts below, the appellants were properly held to be guilty of all or any of the offences for which they have been convicted.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether appellant No. 1 was rightly convicted under s. 304A IPC.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether driving a jeep on a public road by a person who does not know driving and is consequently unable to control the vehicle (holding only a learner's licence without a trainer) is a rash and negligent act as contemplated by Section 304A IPC.",
      "framed_by": "court"
    },
    {
      "id": "i4",
      "text": "Whether the rash or negligent act of appellant No. 1 was the proximate cause of the death of the deceased.",
      "framed_by": "court"
    },
    {
      "id": "i5",
      "text": "Whether appellant No. 2 could be convicted under s. 201 IPC, s. 5 or s. 89 of the Motor Vehicles Act.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Accused No. 1 had considerable driving experience as per PW Shankar Burmule who saw him driving for six months to a year; he drove the jeep to various places on October 27, 1962 without accident.",
      "supporting_facts": [
        "f2",
        "f3",
        "f11"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "No evidence to show how the accident took place or that accused No. 1 was responsible; no witnesses to establish rash and negligent driving.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": "s. 304A IPC requires proximate cause"
    },
    {
      "id": "pa3",
      "text": "Learner's licence does not presume lack of driving knowledge; no presumption that holder does not know driving.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Accused No. 1 held only a learner's licence, implying he does not know driving and is incapable of controlling the vehicle; no trainer by his side, violating Rule 16 of Bombay Motor Vehicles Rules.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": "s. 304A IPC"
    },
    {
      "id": "ra2",
      "text": "Driving without valid licence or trainer is rash and negligent per se, disregarding public safety.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": "s. 304A IPC"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Conviction of appellant No. 2 under s. 5 and s. 89 MV Act cannot stand as he was not the owner of the jeep nor in charge of it.",
      "addresses_issue": "i5",
      "key_observation": "No proof that second appellant was owner or in charge."
    },
    {
      "id": "cr2",
      "text": "Conviction of appellant No. 2 under s. 201 IPC depends on validity of appellant No. 1's conviction under s. 304A IPC; s. 201 requires proof of commission of an offence, not mere suspicion.",
      "addresses_issue": "i2",
      "key_observation": "Proof of offence essential for s. 201 (citing Palvinder Kaur)."
    },
    {
      "id": "cr3",
      "text": "No evidence on record to find out circumstances of accident; no witnesses to establish rash/negligent driving; no evidence how accident took place.",
      "addresses_issue": "i2",
      "key_observation": "High Court itself noted no witnesses or evidence of responsibility."
    },
    {
      "id": "cr4",
      "text": "Even if holding only learner's licence implies lack of proficiency, that alone insufficient for s. 304A; prosecution must prove the rash/negligent act was proximate cause of death; direct nexus required.",
      "addresses_issue": "i4",
      "key_observation": "s. 304A requires death caused by rash/negligent act as proximate cause."
    },
    {
      "id": "cr5",
      "text": "Prosecution evidence shows appellant No. 1 drove jeep to various places on Oct 27 without accident; PW Shankar Burmule's evidence of prior driving experience accepted; no presumption of incompetence from learner's licence.",
      "addresses_issue": "i3",
      "key_observation": "Evidence shows proficiency; prior safe driving proves knowledge."
    },
    {
      "id": "cr6",
      "text": "Possibility accident caused by fault of deceased cannot be ruled out; proficiency does not conclude issue but absence does not prove guilt without causation.",
      "addresses_issue": "i4",
      "key_observation": "Proximate cause unknown."
    },
    {
      "id": "cr7",
      "text": "Ratio of Kurban Hussein case applies: death must be direct/proximate result of rash/negligent act (distinguishing Juggankhan).",
      "addresses_issue": "i2",
      "key_observation": "Mere negligence insufficient without causation."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "On facts found, appellant No. 1 not guilty under s. 304A IPC as no proof of proximate cause linking rash/negligent act to death.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Appellant No. 2 not guilty under s. 201 IPC as no proof of offence under s. 304A by appellant No. 1.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h3",
      "text": "Appellant No. 2 not guilty under s. 5 and s. 89 MV Act as not owner or in charge of vehicle.",
      "resolves_issue": "i5",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Palvinder Kaur v. State of Punjab",
      "citation": "1953 S.C.R. 94",
      "treatment": "followed",
      "relevance": "Proof of commission of offence essential for s. 201 IPC."
    },
    {
      "case_name": "Emperor v. Omkar Rampratap",
      "citation": "4 B.L.R. 679",
      "treatment": "followed",
      "relevance": "Death must be direct result of rash/negligent act as proximate cause under s. 304A IPC."
    },
    {
      "case_name": "Kurban Hussein Mohammedali Rangwalla v. State of Maharashtra",
      "citation": "1965 2 S.C.R. 622",
      "treatment": "followed",
      "relevance": "Death must be proximate result of rash/negligent act under s. 304A IPC; governs facts of present case."
    },
    {
      "case_name": "Juggankhan v. State of Madhya Pradesh",
      "citation": null,
      "treatment": "distinguished",
      "relevance": "Rash/negligent act proven as cause of death, unlike present case."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "304A",
        "201"
      ],
      "relevance": "s. 304A for causing death by rash/negligent act requiring proximate cause; s. 201 for causing disappearance of evidence of offence."
    },
    {
      "name": "Motor Vehicles Act",
      "sections": [
        "3",
        "5",
        "89",
        "112"
      ],
      "relevance": "Convictions under s.3 r/w 112, s.5, s.89; s.89 conviction of A2 unsustainable as not owner/in charge."
    },
    {
      "name": "Bombay Motor Vehicles Rules",
      "sections": [
        "16"
      ],
      "relevance": "Requirements for learner's licence, need for trainer."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeals allowed; appellant No. 1 acquitted of charges under s. 304A IPC and MV Act provisions (unchallenged); appellant No. 2 acquitted of all charges under s. 201 IPC, s. 5 and s. 89 MV Act.",
    "relief_granted": "Acquittal of both appellants on all charges.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"To impose criminal liability under S. 304A, Indian Penal Code, it is necessary that the death should have been the direct result of a rash and negligent act of the accused, and that act must be the proximate and efficient cause without the intervention of anothers negligence.\"",
      "speaker": "court",
      "significance": "Defines scope of s. 304A IPC from Emperor v. Omkar Rampratap."
    },
    {
      "text": "\"The requirements of this section are that the death of any person must have been caused by the accused by doing any rash or negligent act... There must be direct nexus between the death of a person and the rash or negligent act of the accused.\"",
      "speaker": "court",
      "significance": "Explains causation needed for s. 304A conviction."
    },
    {
      "text": "\"There are no witnesses whose evidence can establish rash and negligent driving on the part of accused No. 1... there is absolutely no evidence to show that the accused was responsible for the accident.\"",
      "speaker": "court",
      "significance": "High Court observation adopted, leading to acquittal."
    }
  ],
  "_case_id": "1967_315",
  "_label": 1,
  "_text_length": 15415,
  "_extracted_at": "2026-02-10T20:24:00.719571"
}