{
  "metadata": {
    "case_name": "State of Andhra Pradesh v. Respondents (Crescent Recreation Club)",
    "case_year": 1965,
    "court": "Supreme Court of India",
    "judges": [
      "Hidayatullah, J."
    ],
    "case_number": "Criminal Appeal No. 40 of 1965",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "On May 4, 1963, police headed by Circle Inspector Krishnaswami raided premises of Crescent Recreation Club in Secunderabad on credible information that it was being used as a common gambling house.",
      "type": "material",
      "date": "1963-05-04",
      "source": "prosecution"
    },
    {
      "id": "f2",
      "text": "During raid, respondents 1-5 found playing card game Rummy for stakes, with counters on table, money, and playing cards with players.",
      "type": "material",
      "date": "1963-05-04",
      "source": "prosecution"
    },
    {
      "id": "f3",
      "text": "Respondent No. 6, Treasurer of Club, present holding stake money (kitty) of Rs. 74.62 np; further Rs. 218/- recovered from table of 6th respondent; 66 counters on table and more money with persons indulging in game.",
      "type": "material",
      "date": "1963-05-04",
      "source": "prosecution"
    },
    {
      "id": "f4",
      "text": "Respondent No. 7, Secretary of Club, in charge of management; joined as accused though not present at raid.",
      "type": "background",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f5",
      "text": "On police appearance, players stopped play; arrests made promptly of persons present round table with cards, counters, money.",
      "type": "material",
      "date": "1963-05-04",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "5th City Magistrate, Secunderabad convicted all seven respondents under ss. 4 and 5 of Hyderabad Gambling Act 2 of 1305F; sentenced to various fines with imprisonment in default.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Respondents filed application for revision before Sessions Judge, Secunderabad, who made reference to Andhra Pradesh High Court under s. 438 CrPC recommending quashing conviction and setting aside sentences.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "Andhra Pradesh High Court accepted reference, set aside conviction by judgment dated August 4, 1964 in Criminal Revision Case No. 479 of 1964.",
      "type": "procedural",
      "date": "1964-08-04",
      "source": "high_court"
    },
    {
      "id": "f9",
      "text": "Club charged 5 points per game (alleged, deposed by Sub-Inspector but no account book entry); extra charge Rs. 3/- for playing cards supplied by club; sitting fee Re. 1/- per person (account books show 50 paise per person in card room); late fee if game continued beyond certain time; non-members also played and required to pay.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f10",
      "text": "Account books of club produced; no entry showing 5 points per game levy.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "One witness stated chess also played, but no definite evidence of other amenities besides card games.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether premises of Crescent Recreation Club were being used as a common gambling house under s. 3 of Hyderabad Gambling Act 2 of 1305F.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether respondents present at time of raid could be said to be gambling therein under ss. 4 and 5.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether game of Rummy is a game of mere skill exempt under s. 14 of the Act.",
      "framed_by": "sessions_judge"
    },
    {
      "id": "i4",
      "text": "Whether presumption under s. 7 arises and was repelled.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Club premises used as common gambling house per s. 3 definition as profit/gain made from charges: 5 points per game, Rs. 3/- for cards, Re. 1/- sitting fee, late fee, charges on non-members.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": "Hyderabad Gambling Act s. 3; In re Somasundaram Chettiar AIR 1948 Mad 264"
    },
    {
      "id": "pa2",
      "text": "Presumption under s. 7 not repelled but confirmed by club charges; Secretary (R7) and Treasurer (R6) liable under s. 4 as in care/management.",
      "supporting_facts": [
        "f1",
        "f2",
        "f3",
        "f4"
      ],
      "legal_basis": "Hyderabad Gambling Act ss. 4, 6, 7"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Game of Rummy is game of mere skill, Act does not apply per s. 14; citing Madras and Andhra High Court cases.",
      "supporting_facts": [
        "f2"
      ],
      "legal_basis": "Hyderabad Gambling Act s. 14"
    },
    {
      "id": "ra2",
      "text": "Club not making profit/gain but charging service fees; definition of common gambling house not attracted.",
      "supporting_facts": [
        "f9",
        "f10"
      ],
      "legal_basis": "Hyderabad Gambling Act s. 3"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "No proof club making profit/gain: no account entry for 5 points/game; card charge, sitting fee (50 paise), late fee normal for members' clubs to cover expenses/amenities; judicial notice of such practices.",
      "addresses_issue": "i1",
      "key_observation": "Charges do not render club a common gambling house."
    },
    {
      "id": "cr2",
      "text": "Presumption under s. 7 repelled by prosecution evidence itself; no other amenities proved lacking to conjecture.",
      "addresses_issue": "i4",
      "key_observation": "Evidence shows normal club operations."
    },
    {
      "id": "cr3",
      "text": "Rummy not game of pure chance but preponderantly skill (memorising cards, holding/discarding); element of chance like in bridge, inherent in card games.",
      "addresses_issue": "i3",
      "key_observation": "s. 14 protection available as mainly skill."
    },
    {
      "id": "cr4",
      "text": "Circle Inspector's raid authorised under s. 6; but elements of offence missing.",
      "addresses_issue": "i2",
      "key_observation": "High Court right in accepting reference."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Club not a common gambling house under s. 3; no profit/gain proved from gambling.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Rummy is mainly and preponderantly a game of skill.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Presumption under s. 7 repelled; conviction under ss. 4 and 5 not sustainable.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "In re Somasundaram Chettiar",
      "citation": "AIR 1948 Mad 264",
      "treatment": "distinguished",
      "relevance": "Petitioner relied on for profit/gain in club context, but court found facts differ as no illegal charges proved."
    },
    {
      "case_name": "Madras High Court cases and one Andhra High Court case",
      "citation": null,
      "treatment": "followed",
      "relevance": "Rummy held as game of skill."
    }
  ],
  "statutes_cited": [
    {
      "name": "Hyderabad Gambling Act 2 of 1305F",
      "sections": [
        "s. 3",
        "s. 4",
        "s. 5",
        "s. 6",
        "s. 7",
        "s. 14"
      ],
      "relevance": "Defines common gambling house; penalties for using/managing; search/arrest powers; presumption from instruments found; exemption for games of skill."
    },
    {
      "name": "Public Gambling Act, 1867",
      "sections": [
        "s. 3",
        "s. 5"
      ],
      "relevance": "Outline followed by Hyderabad Act; definition and provisions compared."
    },
    {
      "name": "Code of Criminal Procedure",
      "sections": [
        "s. 438"
      ],
      "relevance": "Sessions Judge reference to High Court."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court dismissed State's appeal by special leave, upheld Andhra Pradesh High Court's acceptance of Sessions Judge reference, quashing conviction and sentences under ss. 4 and 5 of Hyderabad Gambling Act.",
    "relief_granted": "Conviction and sentences set aside.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "Rummy, on the other hand, requires certain amount of skill because the fall of the cards has to be memorised and the building up of Rummy requires considerable skill in holding and discarding cards.",
      "speaker": "court",
      "significance": "Holds Rummy as preponderantly skill, attracting s.14 exemption."
    },
    {
      "text": "It is mainly and preponderantly a game of skill. The chance in Rummy is of the same character as the chance in a deal at a game of bridge.",
      "speaker": "court",
      "significance": "Distinguishes from pure chance games, key to acquittal."
    },
    {
      "text": "The points made by Mr. Ram Reddy do not prove this club to be a common gambling house. The presumption under s. 7, even if it arises in this case, is successfully repelled by the evidence.",
      "speaker": "court",
      "significance": "Rejects State's case on definition and presumption."
    }
  ],
  "_case_id": "1967_91",
  "_label": 0,
  "_text_length": 16162,
  "_extracted_at": "2026-02-10T20:20:39.590570"
}