{
  "metadata": {
    "case_name": "Boddu Ramarao & Anr. v. Boddu Satyavathi & Ors.",
    "case_year": 1965,
    "court": "Supreme Court of India",
    "judges": [
      "Mitter, J."
    ],
    "case_number": "Civil Appeal No. 245 of 1965",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Testatrix Boddu Adilakshmi was childless and brought up defendants 4 and 5, Boddu Ramarao and Kosuru Lakshmamma, from their infancy.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "At the date of the will executed on June 28, 1913, defendant 5 had been with testatrix for 15 years and defendant 4 for 10 years, and both were minors.",
      "type": "background",
      "date": "1913-06-28",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Testatrix executed a will bequeathing all her properties, movable and immovable, to defendants 4 and 5: entire property to pass to both minors after her lifetime; Banda Ramaswamy Garu to act as guardian until majority; after majority, entire property in possession of both; both to enjoy for lifetime without powers of gift, transfer, sale; after their death, children born to them to enjoy with powers of gift, transfer, sale.",
      "type": "material",
      "date": "1913-06-28",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Testatrix died within a few days after execution of the will.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Defendants 4 and 5 divided the properties by registered partition deed dated December 27, 1929: Schedule A properties to 4th defendant, Schedule B to 5th defendant.",
      "type": "procedural",
      "date": "1929-12-27",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "4th defendant married 1st defendant Boddu Satyavathi, daughter of 5th defendant.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "2nd defendant is daughter born to 4th defendant and 1st defendant.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Some years later, 4th defendant married Boddu Manikyam.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Plaintiffs 1 to 4 are issues of marriage between 4th defendant and Boddu Manikyam.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "5th defendant and 1st defendant mortgaged B Schedule properties to 3rd defendant, who brought suit and obtained decree.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Plaintiffs filed suit in 1955 (O.S. No. 112 of 1955) for declaration that after death of defendants 4 and 5, 1st defendant and children of 4th defendant (or such alive) entitled to share properties equally; alienations by defendants 4 and 5 or assignees not binding on ultimate reversioners beyond lifetime; mortgage decree not binding on plaintiffs or reversioners.",
      "type": "procedural",
      "date": "1955",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Trial court (Subordinate Judge at Eluru) held defendants 4 and 5 holders of life estate, succeeded as tenants in common.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Andhra Pradesh High Court in Appeal No. 563 of 1959 dated October 31, 1962 confirmed trial court decree: life estate to defendants 4 and 5, vested remainder to their children per stirpes not per capita; conduct of partition fortifies conclusion.",
      "type": "procedural",
      "date": "1962-10-31",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether under the terms of the will of Boddu Adilakshmi, defendants 4 and 5 took her properties as joint tenants or tenants in common.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the children of defendants 4 and 5 take the properties per capita or per stirpes.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Defendants 4 and 5 took properties as joint tenants, indicated by will clause that entire property in possession of both, both enjoy throughout lifetime, after death children enjoy.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Children of defendants 4 and 5 alive at time of their death would take properties per capita.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Defendants 4 and 5 took life estate as tenants in common with vested remainder to their children who take per stirpes.",
      "supporting_facts": [
        "f3",
        "f5",
        "f13"
      ],
      "legal_basis": "Will construction; partition deed"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Testatrix intended to preserve properties for benefit of foster children's children, giving life interest without alienation to foster children; reasonable to give each foster child half income for life, children succeed to parents' shares per stirpes.",
      "addresses_issue": "i1",
      "key_observation": "Testatrix treated foster children like own, heirs to take share alike per stirpes."
    },
    {
      "id": "cr2",
      "text": "Joint tenancy unknown to Hindu law except coparcenary; not to import English rule into Hindu will construction.",
      "addresses_issue": "i1",
      "key_observation": "No express survivorship; partition shows tenants in common."
    },
    {
      "id": "cr3",
      "text": "Children take per stirpes as substituted for respective parents; gift to parents for life then to their children means at respective deaths.",
      "addresses_issue": "i2",
      "key_observation": "Stirpital distribution where children take on death of respective parents."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Defendants 4 and 5 took life estate as tenants in common, not joint tenants.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Children of defendants 4 and 5 take vested remainder per stirpes, not per capita.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Jogeswar Narain Deo v. Ram Chand Dutt",
      "citation": "23 I.A. 37 at 44",
      "treatment": "followed",
      "relevance": "Principle of joint tenancy unknown to Hindu law except coparcenary; not import English rule into Hindu will."
    },
    {
      "case_name": "Babu Rani v. Rajendra Baksh Singh",
      "citation": "60 I.A. 95 at 10",
      "treatment": "followed",
      "relevance": "Reiterated principle against joint tenancy in Hindu wills."
    },
    {
      "case_name": "Re Hutchinsons Trusts",
      "citation": "21 Ch. D. 11",
      "treatment": "referred",
      "relevance": "Words 'after decease' mean respective deaths; stirpital distribution."
    },
    {
      "case_name": "In re Errington, Gibbs v. Lassam",
      "citation": "1927 1 Ch.",
      "treatment": "followed",
      "relevance": "Gift to A and B for lives then to their issue at their deaths means share of each to issue of each on respective death."
    }
  ],
  "statutes_cited": [],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal by special leave dismissed; High Court judgment affirmed holding defendants 4 and 5 have life estate as tenants in common with vested remainder to their children per stirpes.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"The principle of joint tenancy appears to be unknown to Hindu law, except in the case of coparcenary between the members of an undivided family.\"",
      "speaker": "court",
      "significance": "Core legal principle rejecting joint tenancy under Hindu law."
    },
    {
      "text": "\"my entire property should hereafter my lifetime pass to both these minors, Lakshmamma and Ramarao... both of them should enjoy throughout their lifetime the said property without powers of gift transfer and sale and that after their death the children that may be born to them should enjoy the same with powers of gift, transfer and sale.\"",
      "speaker": "court",
      "significance": "Relevant portion of will defining estates."
    },
    {
      "text": "\"Where a testator gives the income of his estate to two people, A. and B., for their lives and follows that gift by a direction that at their death, or at their deaths... the property is to go to their issue... construes it as a gift, to take effect on the death of each, of the share... to the issue of the deceased.\"",
      "speaker": "court",
      "significance": "Rule for per stirpes construction."
    }
  ],
  "_case_id": "1967_98",
  "_label": 0,
  "_text_length": 9999,
  "_extracted_at": "2026-02-10T20:20:55.524179"
}