{
  "metadata": {
    "case_name": "Sindhu Resettlement Corporation Ltd. v. R. S. Ambwaney & Ors.",
    "case_year": 1966,
    "court": "Supreme Court of India",
    "judges": [
      "Bhargava, J."
    ],
    "case_number": "Civil Appeal No. 656 of 1966",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "R. S. Ambwaney, respondent No. 3, was employed by the Sindhu Resettlement Corporation Ltd., the appellant, as an Accounts Clerk at Gandhidham on 13th December, 1950 in the pay-scale of Rs. 150-10-250 on a salary of Rs. 200 plus 20 per cent as site allowance.",
      "type": "background",
      "date": "1950-12-13",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "This site allowance was discontinued in March, 1952.",
      "type": "background",
      "date": "1952-03",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "In the year 1953, the Government of India decided to develop Kandla as a port and a subsidiary company was formed by the appellant under the name of Makenzies Heinrich Bulzer India Ltd., later known as Sindhu Hotchief India Ltd.",
      "type": "background",
      "date": "1953",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Respondent No. 3 was told orally by the officers of the appellant on 2nd September, 1953 that he was to work in the subsidiary company.",
      "type": "material",
      "date": "1953-09-02",
      "source": "respondent"
    },
    {
      "id": "f5",
      "text": "Respondent No. 3 was appointed in Sindhu Hotchief by its order dated 5th September, 1953 on a salary of Rs. 240 p.m. as an Accounts Clerk on the conditions of service laid down in that order, including probation for three months, extendable up to three months, confirmation depending on efficiency.",
      "type": "material",
      "date": "1953-09-05",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Father of respondent No. 3 died and he was granted leave by the appellant for the period from 2nd September to 17th September, 1953.",
      "type": "background",
      "date": "1953-09-02 to 1953-09-17",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "With effect from 18th September 1953, his services were placed at the disposal of Sindhu Hotchief and an order to that effect was issued in writing on behalf of the appellant on 24th September, 1953.",
      "type": "material",
      "date": "1953-09-18",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Respondent No. 3 worked with Sindhu Hotchief up to 20th February, 1958 when his services were terminated after payment of retrenchment compensation and all other dues payable to him.",
      "type": "material",
      "date": "1958-02-20",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "On 21st February, 1958, respondent No. 3 went to the office of the appellant, reported himself for duty and requested posting orders.",
      "type": "procedural",
      "date": "1958-02-21",
      "source": "respondent"
    },
    {
      "id": "f10",
      "text": "The appellant informed respondent No. 3 of its inability to re-employ him on the ground that the post which he had been occupying in 1953 had been permanently filled up.",
      "type": "material",
      "date": "1958-02-21",
      "source": "petitioner"
    },
    {
      "id": "f11",
      "text": "Respondent No. 3 demanded retrenchment compensation from the appellant, which was refused.",
      "type": "disputed",
      "date": "1958-02-21",
      "source": "respondent"
    },
    {
      "id": "f12",
      "text": "His case was taken up by Mazdoor Mahajan Sangh, Gandhidham, Kutch, respondent No.2. The Secretary wrote a letter to the management asking for payment of retrenchment compensation.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f13",
      "text": "Respondent No. 3 in his letter dated 7th March, 1958 demanded retrenchment compensation and one month's salary in lieu of notice if not reinstated.",
      "type": "material",
      "date": "1958-03-07",
      "source": "respondent"
    },
    {
      "id": "f14",
      "text": "Letter dated 10th July 1959 by General Secretary of respondent No. 2 demanding retrenchment dues from appellant under section 25F.",
      "type": "material",
      "date": "1959-07-10",
      "source": "respondent"
    },
    {
      "id": "f15",
      "text": "Conciliation proceedings, then Government of Gujarat by notification dated 15th November, 1960 referred the dispute to Industrial Tribunal: reinstatement and back wages from 21st Feb 1958.",
      "type": "procedural",
      "date": "1960-11-15",
      "source": "court"
    },
    {
      "id": "f16",
      "text": "Industrial Tribunal award dated 10th August, 1961 directing reinstatement and back wages.",
      "type": "procedural",
      "date": "1961-08-10",
      "source": "lower_court"
    },
    {
      "id": "f17",
      "text": "Appellant challenged award in Gujarat High Court under Articles 226 and 227, petition dismissed by judgment dated June 29/30, 1964.",
      "type": "procedural",
      "date": "1964-06-29/30",
      "source": "court"
    },
    {
      "id": "f18",
      "text": "Appeal by special leave to Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether respondent No. 3, having been given permanent appointment in Sindhu Hotchief and having obtained retrenchment compensation from that Company, could claim that he was still holding a post in the appellant Corporation and claim reinstatement.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether the dispute raised by respondent No. 3 and respondent No. 2 was confined to compensation for retrenchment and did not relate to validity of retrenchment or reinstatement, so Government had no jurisdiction to refer.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether, since validity of retrenchment by appellant was not challenged, Tribunal erred in directing reinstatement instead of compensation.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Respondent No. 3 having been given permanent appointment in Sindhu Hotchief and obtained retrenchment compensation, could not claim he still held post in appellant and claim reinstatement.",
      "supporting_facts": [
        "f5",
        "f8"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Dispute raised was confined to compensation for retrenchment, not validity or reinstatement, so no jurisdiction for reference.",
      "supporting_facts": [
        "f11",
        "f12",
        "f13",
        "f14"
      ],
      "legal_basis": "Industrial Disputes Act, 1947"
    },
    {
      "id": "pa3",
      "text": "No challenge to validity of retrenchment, so Tribunal should award compensation, not reinstatement.",
      "supporting_facts": [
        "f10"
      ],
      "legal_basis": null
    },
    {
      "id": "pa4",
      "text": "In High Court, contended Tribunal had no jurisdiction as demand for reinstatement not under item 3 Second Schedule, no discharge/dismissal.",
      "supporting_facts": [
        "f17"
      ],
      "legal_basis": "Industrial Disputes Act, 1947, Second Schedule item 3"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Respondent No. 3 was permanent employee of appellant, went to Sindhu Hotchief on deputation/transfer, continued to hold lien on post in appellant.",
      "supporting_facts": [
        "f1",
        "f3",
        "f7"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "No retrenchment compensation paid by appellant when services ended, so lien continued.",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": null
    },
    {
      "id": "ra3",
      "text": "Cited Nokes v. Doncaster Amalgamated Collieries Ltd. that contractual right to personal service cannot be transferred without consent.",
      "supporting_facts": [],
      "legal_basis": "Nokes v. Doncaster Amalgamated Collieries Ltd., 1940 A.C. 1014"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Presumption from order dated 24th Sep 1953 that respondent continued as employee rebutted by appointment order 5th Sep 1953 in Sindhu Hotchief on probation, served 4.5 years, must have been confirmed, cannot be simultaneous employee.",
      "addresses_issue": "i1",
      "key_observation": "Once confirmed in Sindhu Hotchief, ceased to be employee of appellant."
    },
    {
      "id": "cr2",
      "text": "Documents filed without challenge on proof; order of 5th Sep addressed to him, no denial of receipt; strict proof not required in Tribunal.",
      "addresses_issue": "i1",
      "key_observation": "High Court erred in ignoring order for lack of evidence of service."
    },
    {
      "id": "cr3",
      "text": "Accepted retrenchment compensation from Sindhu Hotchief; if lien continued, compensation would go to appellant, not him directly.",
      "addresses_issue": "i1",
      "key_observation": "Acceptance shows he knew he was permanent in Sindhu Hotchief."
    },
    {
      "id": "cr4",
      "text": "Went willingly, no compulsion; terms didn't allow transfer; voluntary acceptance of permanent appointment terminated services with appellant, no retrenchment entitling to compensation from appellant.",
      "addresses_issue": "i1",
      "key_observation": "No retrenchment by appellant."
    },
    {
      "id": "cr5",
      "text": "Nokes case distinguished as respondent joined willingly with consent.",
      "addresses_issue": "i1",
      "key_observation": "Not a non-consensual transfer."
    },
    {
      "id": "cr6",
      "text": "No demand for reinstatement raised with management; letters only for compensation (7 Mar 1958, 10 Jul 1959); so no industrial dispute on reinstatement existed.",
      "addresses_issue": "i2",
      "key_observation": "Reference incompetent; Government erred basing on irrelevant material."
    },
    {
      "id": "cr7",
      "text": "Jurisdiction point raised in High Court; dispute was only on compensation.",
      "addresses_issue": "i2",
      "key_observation": "Mere demand to Government without employer dispute not industrial dispute."
    },
    {
      "id": "cr8",
      "text": "Third ground does not arise as no dismissal/discharge/retrenchment by appellant; willingly joined Sindhu Hotchief for better pay.",
      "addresses_issue": "i3",
      "key_observation": "Services terminated by voluntary move."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Services of respondent No. 3 under appellant terminated upon confirmation in Sindhu Hotchief; no lien continued; no claim for reinstatement.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "No industrial dispute on reinstatement raised; reference by Government incompetent.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h3",
      "text": "No retrenchment/dismissal by appellant; third issue does not arise.",
      "resolves_issue": "i3",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Nokes v. Doncaster Amalgamated Collieries Ltd.",
      "citation": "1940 A.C. 1014",
      "treatment": "distinguished",
      "relevance": "Principle that personal service contract cannot be transferred without consent; distinguished as respondent joined willingly."
    }
  ],
  "statutes_cited": [
    {
      "name": "Industrial Disputes Act, 1947",
      "sections": [
        "Section 25F",
        "Section 12(4)",
        "Second Schedule item 3"
      ],
      "relevance": "Retrenchment compensation; conciliation report for reference; scope of disputes for adjudication; jurisdiction for reinstatement demand."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 226",
        "Article 227"
      ],
      "relevance": "High Court petition challenging Tribunal award."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; Tribunal award and High Court order set aside as services terminated upon voluntary permanent appointment in subsidiary, no lien; no industrial dispute on reinstatement raised, reference incompetent.",
    "relief_granted": "Appeal succeeds; no reinstatement or back wages.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"Once he was confirmed in Sindhu Hotchief, he could obviously not continue to be an employee of the appellant-corporation simultaneously.\"",
      "speaker": "court",
      "significance": "Core reasoning on termination of lien."
    },
    {
      "text": "\"Since no such dispute about reinstatement was raised by either of the respondents before the management of the appellant, it is clear that the State Government was not competent to refer a question of reinstatement.\"",
      "speaker": "court",
      "significance": "Basis for holding reference without jurisdiction."
    },
    {
      "text": "\"An industrial dispute, as defined, must be a dispute between employers and employers, employers and workmen, and workmen and workmen.\"",
      "speaker": "court",
      "significance": "Defines scope of industrial dispute."
    }
  ],
  "_case_id": "1967_72",
  "_label": 1,
  "_text_length": 24359,
  "_extracted_at": "2026-02-10T20:20:47.657406"
}