{
  "metadata": {
    "case_name": "Commissioner of Income-tax v. Moon Mills Ltd.",
    "case_year": null,
    "court": "Supreme Court of India",
    "judges": [
      "Sikri, J."
    ],
    "case_number": null,
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Income-tax Appellate Tribunal, Calcutta Bench A, referred question under section 66(1) of the Indian Income-tax Act, 1922, to the High Court at Calcutta.",
      "type": "procedural",
      "date": null,
      "source": "tribunal"
    },
    {
      "id": "f2",
      "text": "Relevant assessment year 1951-52 and corresponding accounting year is the calendar year 1950.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Moon Mills Ltd., Bombay (assessee), carried on manufacture and sale of cotton yarn and cotton piece-goods in Bombay.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On June 6, 1948, a devastating fire broke out in the premises of the mills destroying the building and partially destroying and damaging the machinery and plant.",
      "type": "material",
      "date": "1948-06-06",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Amount of compensation settled between insurers and assessee at Rs. 62,41,177 in 1948, but received by assessee in 1950.",
      "type": "material",
      "date": "1950",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Manufacturing operations ceased after the fire, though other trading activities continued on restricted scale throughout 1948, 1949 and 1950.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Fixed assets destroyed by fire were not used for business in 1950 when compensation received, but used in 1948 before destruction.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Income-tax Officer held Rs. 22,35,181 as profit assessable under fourth proviso to section 10(2)(vii) for 1951-52 and included in total income.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Before Appellate Assistant Commissioner, assessee argued fourth proviso not applicable as assets not used for business in accounting year; AAC rejected but reduced amount to Rs. 19,81,899.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f10",
      "text": "Appellate Tribunal sustained AAC order but on different considerations.",
      "type": "procedural",
      "date": null,
      "source": "tribunal"
    },
    {
      "id": "f11",
      "text": "High Court answered the question in the negative and in favour of the assessee.",
      "type": "procedural",
      "date": null,
      "source": "high_court"
    },
    {
      "id": "f12",
      "text": "Commissioner of Income-tax obtained special leave; appeal before Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether, on the facts and in the circumstances of the case, the sum of Rs. 19,81,899 received by the assessee in 1950, being the surplus of the compensation money over the written down value of the assets destroyed by fire in the year 1948, is taxable under the 4th proviso to section 10(2)(vii) as the income of the assessee for the year 1950?",
      "framed_by": "tribunal"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The High Court erred in answering the question in favour of the assessee.",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": "Fourth proviso to section 10(2)(vii)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Point concluded in favour relying on three recent decisions of this Court.",
      "supporting_facts": [],
      "legal_basis": "Recent decisions of Supreme Court"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Fourth proviso to be interpreted strictly like second proviso; essential conditions: (1) during previous year moneys received, business carried on by assessee for part or whole; (2) machinery used in business in that previous year. Neither condition satisfied here.",
      "addresses_issue": "i1",
      "key_observation": "Fixed assets not used in 1950; business manufacturing ceased, only restricted trading."
    },
    {
      "id": "cr2",
      "text": "Key expressions in fourth proviso similar to second: 'such building, machinery or plant'; applies whether during continuance or after cessation of business; deemed profits of previous year moneys received.",
      "addresses_issue": "i1",
      "key_observation": "No difference between sale proceeds (second proviso) and insurance/compensation (fourth proviso)."
    },
    {
      "id": "cr3",
      "text": "Follows interpretation in CIT v. Express Newspapers Ltd.: conditions for charge - business carried on during previous year, asset used in business, sold when business carried on not for winding up.",
      "addresses_issue": "i1",
      "key_observation": "Applies analogously to fourth proviso."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Sum of Rs. 19,81,899 not taxable under fourth proviso to section 10(2)(vii) for 1950 as conditions not satisfied: assets not used in business in 1950 and manufacturing not carried on.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Commissioner of Income-tax v. Express Newspapers Ltd.",
      "citation": null,
      "treatment": "followed",
      "relevance": "Interpretation of second proviso to section 10(2)(vii): conditions for taxing sale proceeds."
    },
    {
      "case_name": "Commissioner of Income-tax v. Ajax Products Ltd.",
      "citation": null,
      "treatment": "followed",
      "relevance": "Further interpretation of second proviso; strict construction; natural meaning of words."
    },
    {
      "case_name": "Liquidators of Pursa Ltd. v. Commissioner of Income-tax",
      "citation": null,
      "treatment": "referred",
      "relevance": "Considered in context of second proviso."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act, 1922",
      "sections": [
        "66(1)",
        "10(1)",
        "10(2)(vii)"
      ],
      "relevance": "Reference of question; computation of business profits; fourth proviso deems excess compensation as profits if conditions met."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court upholds High Court's answer in negative; sum not taxable under fourth proviso to section 10(2)(vii) as assets not used in business in year of receipt and relevant business not carried on.",
    "relief_granted": "In favour of assessee; no tax on Rs. 19,81,899 for 1950.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "It seems to us that before the excess of insurance money received over the difference between the written down value and scrap value is brought to charge it is essential that 1) during the previous year in which moneys are received the business shall have been carried on by the assessee for the part or whole of it and 2) the machinery shall have been used in the business in that previous year.",
      "speaker": "court",
      "significance": "Core reasoning applying conditions to fourth proviso."
    },
    {
      "text": "It follows from the above reasoning that the answer returned by the High Court is correct.",
      "speaker": "court",
      "significance": "Final holding upholding High Court."
    }
  ],
  "_case_id": "1967_127",
  "_label": 0,
  "_text_length": 7832,
  "_extracted_at": "2026-02-10T20:21:20.429793"
}