{
  "metadata": {
    "case_name": "Auction Purchaser (Appellant) v. Trustees of Shri Tricumraiji and Others (Respondents)",
    "case_year": 1965,
    "court": "Supreme Court of India",
    "judges": [
      "Shah, J."
    ],
    "case_number": "Civil Appeal No. 500 of 1965",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Respondents 1 to 4 and respondent No. 6 are the trustees of a public trust, styled Shri Tricumraiji.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "In March 1950 the trustees mortgaged a house belonging to the trust to one Saheba to secure repayment of Rs. 5,000.",
      "type": "material",
      "date": "1950-03",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "An action instituted by the mortgagee against the trustees to enforce the mortgage was compromised, and it was decreed that the trustees do pay Rs. 3,910 due under the mortgage by monthly instalments of Rs. 100 each and in default of three instalments the entire amount remaining unpaid shall become due and recoverable from the mortgaged property.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The trustees did not pay the instalments due under the decree.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "In an application for execution by the mortgagee the mortgaged property was put up for sale and the bid of the appellant was accepted for Rs. 5,000 by the executing Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The trustees thereafter applied under O. 21 r. 89 of the Code of Civil Procedure for setting aside the sale and deposited Rs. 250 being 5% of the purchase-money for payment to the appellant and Rs. 63 for payment to the mortgagee, claiming that in consideration of the latter amount the mortgagee had agreed to give to them six months for payment of the mortgage amount, and had agreed, in the meantime to abandon the application for execution.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "The Subordinate Judge passed an order disposing of the execution application and directed that Rs. 250 out of the amount deposited by the trustees be paid over to the appellant.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "In appeal against that order by the appellant, the District Court reversed the order holding that since the trustees had failed to comply with the requirements of r. 89 of O. 21 Code of Civil Procedure, the executing Court had no jurisdiction to set aside the sale.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "The High Court of Gujarat in exercise of powers under s.115 of the Code of Civil Procedure set aside the order of the District Court.",
      "type": "procedural",
      "date": "1963-02-05",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Raju, J. held that sale of the mortgaged property which belonged to a public trust without the sanction of the Charity Commissioner being prohibited by s. 36 of the Bombay Public Trusts Act, was invalid, and on that view remanded the case to the District Court for decision on all the points correctly arising out of the matter.",
      "type": "procedural",
      "date": "1963-02-05",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Against that order, this appeal has been preferred with special leave.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "The mortgaged property belongs to a public trust within the meaning of the Bombay Public Trusts Act.",
      "type": "admitted",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the expression 'sale' in s. 36(a) of the Bombay Public Trusts Act includes a sale of the property of a public trust in execution of a decree of a civil Court for recovery of a debt due by the trust, such that previous sanction of the Charity Commissioner is required.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether s. 56B of the Bombay Public Trusts Act requires notice to the Charity Commissioner in a suit or proceeding to enforce a mortgage by sale of property belonging to a public trust.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether the trustees complied with the requirements of O. 21 r. 89 CPC, particularly the deposit for payment to the decree-holder, given the mortgagee's agreement to abandon execution and wait six months.",
      "framed_by": "court"
    },
    {
      "id": "i4",
      "text": "Whether a Single Judge of a High Court is bound by precedents of coordinate or superior courts, including Full Bench decisions.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The question of absence of sanction of Charity Commissioner was not raised before the District Court and that Court cannot be said to have acted illegally or with material irregularity in not deciding the question.",
      "supporting_facts": [
        "f8",
        "f9"
      ],
      "legal_basis": "Pinjare Karimbhai v. Shukla Hariprasad; Haridas v. Rataney"
    },
    {
      "id": "pa2",
      "text": "Trustees failed to comply with O.21 r.89 CPC as they did not deposit the full amount specified in the proclamation of sale for the decree-holder.",
      "supporting_facts": [
        "f6",
        "f7",
        "f8"
      ],
      "legal_basis": "O.21 r.89 CPC"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Sale of the mortgaged property belonging to a public trust without the sanction of the Charity Commissioner is prohibited by s.36 of the Bombay Public Trusts Act and is invalid.",
      "supporting_facts": [
        "f2",
        "f5",
        "f10"
      ],
      "legal_basis": "Bombay Public Trusts Act s.36"
    },
    {
      "id": "ra2",
      "text": "S.56B of the Bombay Public Trusts Act made it obligatory to issue notice to the Charity Commissioner before enforcing the mortgage by sale.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": "Bombay Public Trusts Act s.56B"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The expression 'sale' in s.36(a) of Bombay Public Trusts Act refers to voluntary transactions by trustees, not court sales in execution of a decree.",
      "addresses_issue": "i1",
      "key_observation": "Section 36 imposes restrictions on powers of trustees; does not confer overriding authority on Charity Commissioner over civil court executions."
    },
    {
      "id": "cr2",
      "text": "A suit to enforce a mortgage or proceeding in execution against public trust property does not involve a question affecting public religious or charitable purpose under s.56B.",
      "addresses_issue": "i2",
      "key_observation": "No notice to Charity Commissioner required."
    },
    {
      "id": "cr3",
      "text": "Trustees deposited Rs.250 (5% to purchaser) but only Rs.63 to decree-holder, which did not satisfy the claim; abandonment of execution does not equate to payment or extinguish the claim.",
      "addresses_issue": "i3",
      "key_observation": "Second condition of O.21 r.89 not fulfilled; provision requires simultaneous satisfaction of decree."
    },
    {
      "id": "cr4",
      "text": "District Court was right; executing court had no jurisdiction to set aside sale.",
      "addresses_issue": "i3",
      "key_observation": "Requirements of O.21 r.89 strictly mandatory."
    },
    {
      "id": "cr5",
      "text": "Single Judge bound by precedents of coordinate, Division Bench, Full Bench, and Supreme Court; ignoring them subverts judicial administration.",
      "addresses_issue": "i4",
      "key_observation": "Precedents ensure uniformity and certainty in law."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "S.36 Bombay Public Trusts Act does not apply to court sales in execution of decrees.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "S.56B does not require notice to Charity Commissioner in mortgage enforcement proceedings.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h3",
      "text": "O.21 r.89 CPC not complied with; sale cannot be set aside.",
      "resolves_issue": "i3",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h4",
      "text": "Judges must follow binding precedents; Full Bench decisions have legal force.",
      "resolves_issue": "i4",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Subbayya v. Venkata Subba Reddi",
      "citation": "A.I.R.1935 Mad. 1050",
      "treatment": "referred",
      "relevance": "Held that satisfying decree-holder's claim outside court deposit complies with O.21 r.89(b)"
    },
    {
      "case_name": "Muthuvenkatapathy Reddy v. Kuppu Reddi",
      "citation": "A.I.R.1940 Mad. 427",
      "treatment": "referred",
      "relevance": "Similar to above on O.21 r.89 compliance"
    },
    {
      "case_name": "Laxmansing Baliramsing v. Laxminarayan Deosthan",
      "citation": "I.L.R.1947 Nag. 802",
      "treatment": "referred",
      "relevance": "Similar to above"
    },
    {
      "case_name": "Rabindra Nath v. Harendra Kumar",
      "citation": "A.I.R.1956 Cal. 462",
      "treatment": "referred",
      "relevance": "Similar to above"
    },
    {
      "case_name": "M. H. Shivaji Rao v. Niranjanaiah",
      "citation": "A.I.R.1962 Mys. 36",
      "treatment": "referred",
      "relevance": "Similar to above"
    },
    {
      "case_name": "Jaisri Sahu v. Rajdewan Dubey",
      "citation": "1962 2 S.C.R. 558",
      "treatment": "followed",
      "relevance": "On binding nature of precedents for uniformity and certainty"
    },
    {
      "case_name": "Pinjare Karimbhai v. Shukla Hariprasad",
      "citation": "3 Guj. L.R. 529",
      "treatment": "referred",
      "relevance": "On not raising new points in revision"
    },
    {
      "case_name": "Haridas v. Rataney",
      "citation": "23 Bom. L.R. 802",
      "treatment": "referred",
      "relevance": "Similar"
    },
    {
      "case_name": "State of Gujarat v. Gordhandas",
      "citation": "3 Guj. L.R. 269",
      "treatment": "followed",
      "relevance": "Bombay HC precedents binding on Gujarat HC post-reorganization"
    },
    {
      "case_name": "Lala Shri Bhagwan v. Shri Ram Chand",
      "treatment": "referred",
      "relevance": "Judicial propriety requires referring to larger bench if differing from prior decisions"
    }
  ],
  "statutes_cited": [
    {
      "name": "Bombay Public Trusts Act",
      "sections": [
        "36",
        "56B"
      ],
      "relevance": "S.36 restricts voluntary alienations by trustees, not court sales; s.56B notice not required in mortgage enforcement"
    },
    {
      "name": "Code of Civil Procedure",
      "sections": [
        "O. XXI r. 89",
        "s. 115"
      ],
      "relevance": "Requirements for setting aside execution sale strictly applied; revision jurisdiction"
    },
    {
      "name": "Indian Evidence Act",
      "sections": [
        "165"
      ],
      "relevance": "Mentioned in context of Raju J's view on precedents"
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "The Supreme Court allowed the appeal, set aside the Gujarat High Court order, and restored the District Court order holding that the requirements of O.21 r.89 CPC were not complied with and the sale could not be set aside. The court disapproved of the High Court's interpretation of ss.36 and 56B Bombay Public Trusts Act and its views on precedents.",
    "relief_granted": "Appeal allowed; High Court order reversed; District Court order restored",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "Obviously the transactions of mortgage, exchange or gift or lease of any immovable property in cls. (a) & (b) contemplated to be made by the trustees are voluntary transactions, and in the absence of any clear provision in the Act, the expression sale in cl. (a) would only mean transfer of property by the trustees for a price.",
      "speaker": "court",
      "significance": "Core reasoning on scope of s.36 Bombay Public Trusts Act"
    },
    {
      "text": "The section imposes a fetter upon the power of the trustees it is not intended thereby to confer upon the Charity Commissioner an overriding authority upon actions of the Civil Court in execution of decrees.",
      "speaker": "court",
      "significance": "Clarifies no interference with court execution sales"
    },
    {
      "text": "Precedents which enunciate rules of law form the foundation of administration of justice under our system.",
      "speaker": "court",
      "significance": "Emphasizes binding nature of precedents"
    }
  ],
  "_case_id": "1967_68",
  "_label": 1,
  "_text_length": 17409,
  "_extracted_at": "2026-02-10T20:20:49.281738"
}