{
  "metadata": {
    "case_name": "Owners of lands v. State of Gujarat",
    "case_year": 1967,
    "court": "Supreme Court of India",
    "judges": [
      "Hidayatullah, J."
    ],
    "case_number": "Civil Appeals Nos. 883, 915 to 967 and 1042 to 1044 of 1967",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "On March 10, 1965, the Government of Gujarat notified under s. 4 of the Land Acquisition Act that certain lands were needed for a public purpose, namely, the construction of the capital of the State at Gandhinagar and that Government was satisfied that they were arable lands. Government further directed under s. 17(4) of the Act that as the acquisition of the said lands was urgently necessary the provisions of s. 5A of the Act shall not apply in respect of the lands.",
      "type": "material",
      "date": "1965-03-10",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Notification followed by another on July 31, 1965 under s. 6 of the Land Acquisition Act and it contained a direction under s. 17(1) of the Act, enabling the Collector, on the expiration of 15 days from the publication of the notice under s. 9(1) of the Act, to take possession of all arable lands specified in the earlier notification.",
      "type": "material",
      "date": "1965-07-31",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Both notifications were signed by L.P. Raval, Under Secretary to Government and were shown to be by order and in the name of the Governor of Gujarat.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Numerous petitions were filed in the High Court of Gujarat under Art. 226 of the Constitution by the owners of the lands affected by the notifications to challenge the validity of the acquisition. One such petition was Special Civil Application No. 1003 of 1965 and it was typical of all the others.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The facts in all the petitions were the same, save the details of the lands, and as the contentions were also the same, the High Court pronounced a common judgment applicable to all, on December 2/5, 1966 and dismissed them. The High Court granted a certificate under Art. 133(1)(c) of the Constitution.",
      "type": "procedural",
      "date": "1966-12-02",
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "Civil Appeal No. 883 of 1967 arises from the Special Civil Application No. 1003/65 and the other appeals are in the other petitions.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Affidavits filed by petitioners averred that Government had not made up its mind regarding acquired lands, that the satisfaction was mala fide and colourable and that the gap of time between the two notifications itself showed that there was no urgency. The affidavits also raised the issue that the lands were not arable lands.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "Government filed multiple counter-affidavits: by L.P. Raval (Oct 1, 1965) stating lands were arable and urgency opinion formed; Executive Engineer (Oct 8, 1965) on master plan involving 12 villages including Pethapur, lands for main roads and sectors, delay due to survey; Nimbalkar (Nov 8, 1965) that Jayaraman, Deputy Secretary was subjectively satisfied; Raval again (Aug 1966) on details of urgency and consideration by him and Jayaraman; Minister-in-Charge on instructions to Secretaries Dudam and Gill to handle urgent acquisitions without personal notice, delegating to Deputy/Under Secretaries; affidavits by Dudani and Gill confirming instructions.",
      "type": "admitted",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f9",
      "text": "Petitioners filed rejoinder affidavits questioning formation of opinion, authority of officers, no personal satisfaction stated for s.17(4), denial of Minister's delegation power.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f10",
      "text": "Lands involved in construction of main roads and laying out of sectors as per master plan ready.",
      "type": "background",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f11",
      "text": "Delay between notifications due to survey work.",
      "type": "background",
      "date": null,
      "source": "respondent"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether L.P. Raval, Under Secretary, was duly authorised to sign the notifications under s.6 of the Land Acquisition Act.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether there was formation of the necessary opinion by the Government as regards urgency or that the lands were arable, as required by ss.17(1) and 17(4).",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Meaning of 'arable land' under s.17 - whether it denotes land capable of cultivation or village but not land already under the plough.",
      "framed_by": "petitioner"
    },
    {
      "id": "i4",
      "text": "Constitutionality of sub-ss.(1) and (4) of s.17 of the Land Acquisition Act under Arts.14 and 19(1)(f) of the Constitution.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "P. Raval, Under Secretary, who signed the notifications under s.6 was not duly authorised to do so under the Act and the notifications were therefore invalid and of no effect.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": "s.6 Land Acquisition Act"
    },
    {
      "id": "pa2",
      "text": "There was no formation of opinion by the Government as regards urgency or that the lands were arable, and on both points the Act requires Government to reach a decision, which fact has not been established if not disproved.",
      "supporting_facts": [
        "f7",
        "f9"
      ],
      "legal_basis": "ss.17(1), 17(4) Land Acquisition Act"
    },
    {
      "id": "pa3",
      "text": "By arable land is meant land capable of cultivation or tillage but not land already under the plough.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "s.17 Land Acquisition Act; dictionaries; Sadruddin Sideman v. H. Patwardhan (Bombay HC)"
    },
    {
      "id": "pa4",
      "text": "Procedure followed by Minister offended Rules of Business; oral instructions invalid without standing orders; no competence for sub-delegation to Deputy/Under Secretaries.",
      "supporting_facts": [
        "f8",
        "f9"
      ],
      "legal_basis": "Rules of Business (Rules 4,7,10,13,15); Instructions under Rule 15; Emperor v. Shibnath Banerji"
    },
    {
      "id": "pa5",
      "text": "Sub-ss.(1) and (4) of s.17 assailed under Arts.14 and 19(1)(f).",
      "supporting_facts": [],
      "legal_basis": "Arts.14, 19(1)(f) Constitution"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Raval competent to sign as Under Secretary under Rules of Business; authenticated in name of Governor.",
      "supporting_facts": [
        "f3",
        "f8"
      ],
      "legal_basis": "s.6 Land Acquisition Act; Rules of Business Rule 13,15; Art.166 Constitution"
    },
    {
      "id": "ra2",
      "text": "Opinion on urgency and arable nature formed by authorized officers (Raval, Jayaraman, per instructions from Minister to Secretaries Dudam/Gill).",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": "ss.4,6,17 Land Acquisition Act; Rules of Business; Art.166(2) Constitution; presumption of regularity"
    },
    {
      "id": "ra3",
      "text": "Arable land includes land actually under cultivation; supported by context of s.17(3), historical provisions, other HCs (AP, All, Pat).",
      "supporting_facts": [
        "f10"
      ],
      "legal_basis": "s.17 Land Acquisition Act; Guntur Ramalakhsmana v. Govt of AP; Baldeo Singh v. State of UP; Lakshmi Devi v. State of Bihar"
    },
    {
      "id": "ra4",
      "text": "Minister could arrange via oral instructions for Secretaries to handle such matters without standing orders; Rule 7(b) covers division of work.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": "Rules of Business Rules 7,10,13; Instructions paras 3,4,5"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Raval authorised under Rules of Business Rule 13 which equates Secretaries, Additional, Joint, Deputy, Under, Assistant Secretaries for authentication; no special authorisation needed under Act.",
      "addresses_issue": "i1",
      "key_observation": "Word 'Secretary' not defined to exclude subordinates; business regulated by Rules under Art.166."
    },
    {
      "id": "cr2",
      "text": "Formation of opinion: Executive action in name of Governor, authenticated per rules; presumption of regularity; affidavits show chain from Minister's instructions to Secretaries/Deputy/Under Secretaries who satisfied themselves.",
      "addresses_issue": "i2",
      "key_observation": "Determination by authorised Secretaries becomes Government's determination; no need for Minister's personal involvement per Rules/Instructions."
    },
    {
      "id": "cr3",
      "text": "Arable land means capable of being ploughed or fit for tillage, including actually cultivated land; distinguished Bombay HC view based on etymology, land types contrast (waste vs arable), s.17(3) crops provision, historical Acts.",
      "addresses_issue": "i3",
      "key_observation": "Crops 'if any' indicates fallow or cultivated arable land; not limited to uncultivated."
    },
    {
      "id": "cr4",
      "text": "Sub-ss.(1),(4) s.17 constitutional; High Court adequately answered objections.",
      "addresses_issue": "i4",
      "key_observation": "Shorter procedure valid for urgency."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Notifications valid; Raval authorised; opinion properly formed; lands arable.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Government opinion on urgency and arable nature validly formed by competent officers under Rules of Business.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "'Arable land' under s.17 includes land actually under cultivation.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    },
    {
      "id": "h4",
      "text": "Sub-ss.(1) and (4) of s.17 not violative of Arts.14, 19(1)(f).",
      "resolves_issue": "i4",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Emperor v. Shibnath Banerji",
      "citation": "L.R. 72 I.A. 241",
      "treatment": "distinguished",
      "relevance": "Distinguished as different circumstances; no substitution of police recommendation for Governor's; here Secretaries properly authorised."
    },
    {
      "case_name": "Sadruddin Sideman v. H. Patwardhan",
      "citation": "A.I.R. 1965 Bom. 224",
      "treatment": "distinguished",
      "relevance": "Rejected view that arable excludes cultivated land."
    },
    {
      "case_name": "Guntur Ramalakhsmana and Others v. Government of Andhra Pradesh",
      "citation": "A.I.R. 1967 A.P. 280",
      "treatment": "followed",
      "relevance": "Supports broader meaning of arable land."
    },
    {
      "case_name": "Baldeo Singh and others v. State of Uttar Pradesh",
      "citation": "A.I.R. 1965 All. 433",
      "treatment": "followed",
      "relevance": "Arable includes land under cultivation per s.17(3)."
    },
    {
      "case_name": "Smt. Lakshmi Devi others v. The State of Bihar",
      "citation": "A.I.R. 1965 Pat. 400",
      "treatment": "followed",
      "relevance": "Arable includes untilled land per Halsbury."
    },
    {
      "case_name": "Shayamaghana Ray v. State",
      "citation": "A.I.R. 1952 Orissa 230",
      "treatment": "distinguished",
      "relevance": "Rules 15 supplemented by instructions allowing arrangements."
    },
    {
      "case_name": "Palmer v. McCormick",
      "citation": "1890 25 Ir.Rep.110",
      "treatment": "distinguished",
      "relevance": "Context of waste; arable means capable/fit, not excluding cultivated."
    },
    {
      "case_name": "Simmons v. Norton",
      "citation": "1831 7 Bing 640 (131 E.R. 249)",
      "treatment": "distinguished",
      "relevance": "Ploughing meadow is waste; contrast pasture vs arable."
    }
  ],
  "statutes_cited": [
    {
      "name": "Land Acquisition Act",
      "sections": [
        "s.4",
        "s.5A",
        "s.6",
        "s.9(1)",
        "s.17(1)",
        "s.17(4)",
        "s.17(3)"
      ],
      "relevance": "Notifications under s.4 and s.6 invoking urgency under s.17(1),(4) to bypass s.5A; shorter procedure validated; arable land interpretation."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art.14",
        "Art.19(1)(f)",
        "Art.226",
        "Art.133(1)(c)",
        "Art.166"
      ],
      "relevance": "Petitions under Art.226; certificate under Art.133; business rules under Art.166; challenge under Arts.14,19(1)(f) rejected."
    },
    {
      "name": "Rules of Business",
      "sections": [
        "Rule 4",
        "Rule 7",
        "Rule 10",
        "Rule 13",
        "Rule 15"
      ],
      "relevance": "Authorisation of Under Secretary; delegation to Secretaries for opinion formation."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeals challenging the validity of land acquisition notifications for Gandhinagar capital project under urgency provisions of s.17 Land Acquisition Act were dismissed, upholding the Gujarat High Court judgment. Notifications validly issued and signed; opinion on urgency and arable land properly formed; sub-ss.(1),(4) constitutional.",
    "relief_granted": "None",
    "costs": "No order as to costs"
  },
  "key_quotes": [
    {
      "text": "\"Thus Raval was competent to sign the declaration as a Secretary.\"",
      "speaker": "court",
      "significance": "Upholds authority under Rules of Business."
    },
    {
      "text": "\"In our judgment, therefore, the conclusion of the Bombay High Court was erroneous and the judgment under appeal is right on this point.\"",
      "speaker": "court",
      "significance": "Rejects narrow definition of arable land."
    },
    {
      "text": "\"In the result the appeals fail and are dismissed.\"",
      "speaker": "court",
      "significance": "Final disposition."
    }
  ],
  "_case_id": "1967_292",
  "_label": 0,
  "_text_length": 46103,
  "_extracted_at": "2026-02-10T20:24:01.586098"
}