{
  "metadata": {
    "case_name": "Appellant v. Respondent No. 1",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "Wanchoo, J."
    ],
    "case_number": "Civil Appeals Nos. 952 and 953 of 1964",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The appellant borrowed some money on a promissory note from the respondents predecessors.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The suit was filed by the respondents on the basis of the promissory note and a decree for Rs. 2,71,000/- and odd was passed against the appellant.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The decree provided for 20 instalments payable half-yearly. The first instalment was payable in November 1938 and thereafter each instalment was payable on or before July 31 and December 31 each year.",
      "type": "material",
      "date": "1938-11-01",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The decree also provided for one or more instalments for pendente lite and future interest beyond the twentieth instalment.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "There was a default clause providing that in case there were three defaults in the payment of instalments, the whole decree could be executed.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The decree created a charge on 18 villages belonging to the appellant under s. 3 of the U.P. Agriculturists Relief Act, No. XXVII of 1934.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "The appellant paid the first 17 instalments in time.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "He paid the eighteenth instalment on July 31, 1948 but this was late as by then the 20th instalment had also fallen due.",
      "type": "material",
      "date": "1948-07-31",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "As the 19th and 20th instalments as well as pendente lite and future interest had not been paid the decree was put in execution by the respondents on April 26, 1951 for recovery of Rs. 49,000/- and odd by the sale of a kothi and an Ahata belonging to the appellant.",
      "type": "procedural",
      "date": "1951-04-26",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "The decree-holder respondent also prayed that in case the whole amount was not realised from the sale of the above property, zamindari property on which a charge had been created might be put to sale.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "The appellant raised objections under s. 47 of the Code of Civil Procedure against the execution.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "The appellant filed an application under ss. 4 and 8 of the U.P. Zamindars Debt Reduction Act, No. XV of 1953.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "The first court held that s. 4 of the Act did not apply. In consequence it held that the amount for which execution had been taken out was not liable to reduction. It therefore dismissed both the application under s. 4 as well as the objection under s. 47 of the Code of Civil Procedure.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "The appellant went in appeal against the dismissal of his objection under s. 47 of the Code of Civil Procedure. He also filed a civil revision against the dismissal of his application under s. 4 of the Act.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f15",
      "text": "The two matters were heard together by the Allahabad High Court, which held that s. 4 did not apply and therefore the amount could not be reduced. Judgment dated July 24, 1961.",
      "type": "procedural",
      "date": "1961-07-24",
      "source": "high_court"
    },
    {
      "id": "f16",
      "text": "The High Court having refused to grant leave to the appellant, he secured special leave from this Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f17",
      "text": "The Act was passed in 1953 to give relief to zamindars whose lands had been acquired by the State under the U.P. Zamindari Abolition and Land Reforms Act, No. 1 of 1951.",
      "type": "background",
      "date": "1953",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether s. 4 of the U.P. Zamindars Debt Reduction Act, No. XV of 1953 applies to the present case, specifically the meaning of the words 'a decree relating to a secured debt'.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "S. 4 applies undoubtedly to a case where the debt was a secured debt at the time the suit was filed. But in an application under s. 4, the court may also take into account the fact that though the debt may not have been a secured debt on the date the suit was filed in which the decree was passed, the decree having created a charge the debt becomes secured and the decree relates to a secured debt, the relevant date in such a case being the date on which the application under s. 4 has been made.",
      "supporting_facts": [
        "f2",
        "f6"
      ],
      "legal_basis": "Section 4, U.P. Zamindars Debt Reduction Act, 1953"
    },
    {
      "id": "pa2",
      "text": "The words 'a decree relating to secured debt' means a decree which has secured a debt whether the debt was secured before the suit was filed or not.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": "Section 4, U.P. Zamindars Debt Reduction Act, 1953"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "S. 4 does not apply as the decree does not relate to a secured debt.",
      "supporting_facts": [
        "f1",
        "f2"
      ],
      "legal_basis": "Section 4, U.P. Zamindars Debt Reduction Act, 1953"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The comparable words in S. 3 are 'a suit relating to a secured debt' which clearly mean a suit which is based on a debt which was secured before the suit was filed. On the same reasoning when s. 4 speaks of a decree relating to a secured debt it means a decree passed in a suit which was based on a secured debt as on the date of the suit.",
      "addresses_issue": "i1",
      "key_observation": "The legislature could not have intended by using these words in s. 4 that the fact that the decree created a charge should result in converting what was an unsecured debt into a secured debt for the purpose of s. 4."
    },
    {
      "id": "cr2",
      "text": "Whether the debt was secured or otherwise is a matter which has to be tested both for s. 4 as well as for s. 3 on the date the suit is filed. If on that date the debt was secured, the suit would be relating to a secured debt and so would be the decree. But if on the date of the suit the debt was not secured it cannot be said that the decree related to a secured debt simply because the decree created a charge.",
      "addresses_issue": "i1",
      "key_observation": "The High Court was right in the view it took that this case was not covered by s. 4 of the Act."
    },
    {
      "id": "cr3",
      "text": "A secured debt is a debt secured by a mortgage and includes a debt secured by a charge under s. 100 of the Transfer of Property Act. The mortgage or the charge must be there on the date of the suit.",
      "addresses_issue": "i1",
      "key_observation": "The date therefore on which the court has to see whether the debt in the suit before it is a secured debt or not is the date on which the suit is filed."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "A decree relating to a secured debt must mean a decree in respect of a debt which was secured when the suit in which the decree was passed was filed. The mere fact that the decree created a charge under the U.P. Agriculturists Relief Act is no reason for holding that the decree relates to a secured debt.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "U.P. Zamindars Debt Reduction Act, No. XV of 1953",
      "sections": [
        "Section 2",
        "Section 3",
        "Section 4",
        "Section 8"
      ],
      "relevance": "Defines secured debt, provides for reduction of debt at time of passing decree (s.3) or after passing of decree (s.4) in suits/decrees relating to secured debt; court held s.4 does not apply as debt not secured on date of suit"
    },
    {
      "name": "U.P. Agriculturists Relief Act, No. XXVII of 1934",
      "sections": [
        "Section 3"
      ],
      "relevance": "Decree created charge on 18 villages under this section"
    },
    {
      "name": "Code of Civil Procedure, 1908",
      "sections": [
        "Section 47"
      ],
      "relevance": "Objections raised under this section against execution"
    },
    {
      "name": "Transfer of Property Act, 1882",
      "sections": [
        "Section 100"
      ],
      "relevance": "Defines charge; included in definition of secured debt/mortgage"
    },
    {
      "name": "U.P. Zamindari Abolition and Land Reforms Act, No. 1 of 1951",
      "sections": [],
      "relevance": "Act under which zamindars' lands acquired; purpose of U.P. Zamindars Debt Reduction Act"
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeals fail as s.4 of the U.P. Zamindars Debt Reduction Act does not apply to the decree, which relates to an unsecured debt on the date of suit despite the charge created by the decree.",
    "relief_granted": null,
    "costs": "Dismissed with costs—one hearing fee"
  },
  "key_quotes": [
    {
      "text": "\"a decree relating to a secured debt it means a decree passed in a suit which was based on a secured debt as on the date of the suit.\"",
      "speaker": "court",
      "significance": "Core interpretation rejecting appellant's argument"
    },
    {
      "text": "\"The mere fact that the decree created a charge for certain reasons, as in this case, under the U.P. Agriculturists Relief Act, is no reason for holding that the decree relates to a secured debt.\"",
      "speaker": "court",
      "significance": "Distinguishes charge created by decree from pre-existing security"
    }
  ],
  "_case_id": "1967_241",
  "_label": 0,
  "_text_length": 11772,
  "_extracted_at": "2026-02-10T20:23:19.251891"
}