{
  "metadata": {
    "case_name": "Commissioner of Income-tax v. Jwalaprasad Agarwala",
    "case_year": null,
    "court": "Supreme Court of India",
    "judges": [
      "Sikri, J."
    ],
    "case_number": null,
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The respondent, Jwalaprasad Agarwala (assessee), was a partner in Messrs. Onkarmal Jwalaprasad. He divided the balance of his capital account as partner in the books of that firm in four equal parts and made a gift of a sum of Rs. 74,721 to each of his four minor sons in July, 1953.",
      "type": "background",
      "date": "1953-07",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "During the accounting year relevant to assessment year 1959-60, three of his sons had attained majority and the fourth son, Parmeshwar Agarwala, was still a minor.",
      "type": "background",
      "date": "1959-60",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Parmeshwar Agarwala has been admitted to the benefits of the partnership in the three firms: 1. Jwalaprasad Mulchand, Dhubri, Assam (Dhubri firm), 2. Jwalaprasad Mulchand Galla Dept. Dhubri Assam (Galla firm), and 3. Jwalaprasad Mulchand, Calcutta (Calcutta firm).",
      "type": "material",
      "date": "1959-60",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The sum of Rs. 74,721 gifted to the minor was invested in the Dhubri firm.",
      "type": "material",
      "date": "1959-60",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Apparently the partnership deed did not make it a condition precedent that the partners should contribute any capital although it was provided that the partners could lend money to the firm and would be entitled to interest at 4 1/2%.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "These three firms made a profit during the relevant year and the minor's share came to Rs. 22,476.",
      "type": "material",
      "date": "1959-60",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "The Income-tax Officer included this sum in the income of the assessee for the assessment year 1959-60.",
      "type": "procedural",
      "date": "1959-60",
      "source": "prosecution"
    },
    {
      "id": "f8",
      "text": "The assessee appealed to the Appellate Assistant Commissioner and contended 1. that only the interest on the original gift money and not the entire credit balance of Parmeshwar Agarwala with the firms should have been included in the assessee's assessment under section 16(3)(a)(iv); and 2. that the amount of Rs. 22,476 should have been treated as earned income on which special surcharge could not be levied.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f9",
      "text": "The Appellate Assistant Commissioner rejected the first contention on the ground that since the accumulation of share of profits and interest accrued to the assessee's son in view of his investment of capital received as gifts from the assessee, it will be reasonable to hold it as an asset transferred by the assessee to the son indirectly. He accepted the second contention.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "The assessee appealed to the Income-tax Appellate Tribunal. The Tribunal noticed that some time during the previous year for 1957-58 assessment year a sum of Rs. 11,000 out of the personal account of Parmeshwar Agarwala, as appearing in the books of the Dhubri firm had been transferred to the Calcutta firm, and that no capital seems to have been invested in the name of the minor in the Galla firm.",
      "type": "material",
      "date": "1957-58",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "The Tribunal rejected the contention of the assessee with reasoning: past records indicate objection never raised before; in 1953-54 assessee claimed earned income allowance for minor's share; minor admitted to Dhubri firm because of initial capital Rs. 74,721 introduced by father; other two firms allied concerns with intimate financial connection; share incomes directly attributable to original capital gift.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "The Tribunal excluded the interest on the other accretions to the capital account of the minor from the assessment of the assessee.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Two questions referred to High Court under section 66(2) of IT Act 1922 by Tribunal.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "High Court answered questions in favour of assessee.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f15",
      "text": "Commissioner obtained special leave from Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether, under the facts and circumstances of the case, the share income of the minor son from the three firms is liable to be included in the assessment of the father under section 16(3)(a)(iv)?",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether in view of the fact that there was no contribution of any sum in the Galla and Calcutta firms by the minor son out of the gift money from the father, the share income from those two firms is liable to be included in the assessment of the father under section 16(3)(a)(iv)?",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Share income from all three firms includible as arising from assets transferred by father; past records show no prior objection and assessee claimed earned income relief; minor admitted due to initial capital Rs.74,721; firms allied with financial connection; Rs.11,000 transferred to Calcutta presumed from gifted assets.",
      "supporting_facts": [
        "f1",
        "f3",
        "f4",
        "f6",
        "f10",
        "f11"
      ],
      "legal_basis": "Section 16(3)(a)(iv) of Indian Income-tax Act, 1922"
    },
    {
      "id": "pa2",
      "text": "Share of profit arose indirectly from the gift.",
      "supporting_facts": [
        "f1",
        "f4"
      ],
      "legal_basis": "Section 16(3)(a)(iv) of Indian Income-tax Act, 1922"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Only interest on original gift money includible, not entire credit balance or share income.",
      "supporting_facts": [
        "f4",
        "f5",
        "f6"
      ],
      "legal_basis": "Section 16(3)(a)(iv) of Indian Income-tax Act, 1922"
    },
    {
      "id": "ra2",
      "text": "No contribution to Galla and Calcutta firms from gift money; no evidence minor admitted only due to father's capital; past acceptance irrelevant; point raised before AAC.",
      "supporting_facts": [
        "f3",
        "f4",
        "f5",
        "f10"
      ],
      "legal_basis": "Section 16(3)(a)(iv) of Indian Income-tax Act, 1922"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Agree with High Court on Galla and Calcutta firms: merely allied concerns and financial connection insufficient; no evidence profits directly or indirectly from Rs.74,721 in Dhubri; Rs.11,000 transfer not proven from original capital.",
      "addresses_issue": "i2",
      "key_observation": "Reasons by Tribunal not competent to find profits from two firms attributable to investment in Dhubri firm."
    },
    {
      "id": "cr2",
      "text": "On Dhubri firm: past records irrelevant; no evidence minor admitted only because of initial capital Rs.74,721 (it was deposit, admitted to benefits); department could have led evidence before AAC/Tribunal.",
      "addresses_issue": "i1",
      "key_observation": "No evidence justifies finding that share arose out of transferred assets."
    },
    {
      "id": "cr3",
      "text": "High Court considered indirect arising from all aspects; no force in contention otherwise.",
      "addresses_issue": "i1",
      "key_observation": "High Court observations correct."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Share income from Galla and Calcutta firms not includible under s.16(3)(a)(iv).",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Share income from Dhubri firm not includible under s.16(3)(a)(iv) absent evidence of arising from transferred assets.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act, 1922",
      "sections": [
        "66(2)",
        "16(3)(a)(iv)"
      ],
      "relevance": "Reference of questions; inclusion of minor's income in father's assessment if arising from transferred assets."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court agrees with High Court, answering both questions in favour of assessee; share income of minor from three firms not liable to inclusion in father's assessment under s.16(3)(a)(iv).",
    "relief_granted": "Questions answered against Revenue",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"the minor had been admitted as a partner in the Dhubri firm only because of the introduction of the initial capital of Rs. 74,721 in his name by his father.\"",
      "speaker": "lower_court",
      "significance": "Tribunal's key reasoning rejected by SC as lacking evidence."
    },
    {
      "text": "\"there is no evidence on record to justify a finding that the minor had been admitted as a partner in the firm... only because of the introduction of the initial capital of Rs. 74,721\"",
      "speaker": "court",
      "significance": "SC upholds HC finding no evidence for inclusion."
    },
    {
      "text": "\"these reasons are not competent to come to a finding that the profits from these two firms were directly attributable to the investment of Rs. 74,721 in the Dhubri firm.\"",
      "speaker": "court",
      "significance": "Rejection of allied firms argument for Galla/Calcutta."
    }
  ],
  "_case_id": "1967_126",
  "_label": 0,
  "_text_length": 9459,
  "_extracted_at": "2026-02-10T20:21:25.530028"
}