{
  "metadata": {
    "case_name": "Sitaram v. Radhabai",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "Shah, J."
    ],
    "case_number": "Civil Appeal No. 961 of 1964",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "On April 15, 1942, Radhabai (plaintiff) entrusted gold, pearl and diamond jewellery of the value of Rs. 32,379/6/- to Lachhmi Narain for safe custody.",
      "type": "material",
      "date": "1942-04-15",
      "source": "plaintiff"
    },
    {
      "id": "f2",
      "text": "Lachhmi Narain, father of Sitaram (appellant), was the brother of Radhabai (plaintiff).",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Lachhmi Narain died in July 1943.",
      "type": "background",
      "date": "1943-07",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "After death of Lachhmi Narain, plaintiff called upon appellant Sitaram to return the jewellery; appellant replied that it had been returned by Lachhmi Narain during his lifetime on April 23, 1942.",
      "type": "disputed",
      "date": null,
      "source": "petitioner | respondent"
    },
    {
      "id": "f5",
      "text": "Plaintiff instituted suit in Court of First Civil Judge, Kanpur against Sitaram, his son Ghanshyam (minor) and other family members for delivery of jewellery or payment of value.",
      "type": "procedural",
      "date": null,
      "source": "plaintiff"
    },
    {
      "id": "f6",
      "text": "Trial Court dismissed the suit, upholding appellant's case that jewellery was returned on April 23, 1942, relying on receipt Ext. A-4 (held genuine by Trial Court).",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Allahabad High Court in First Appeal No. 162 of 1947 reversed Trial Court decree on July 18, 1961, directing restoration of jewellery within one month or payment of Rs. 32,379/6/- with costs by appellant and Ghanshyam out of Lachhmi Narain's estate.",
      "type": "procedural",
      "date": "1961-07-18",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Ghanshyam, minor at material times, died unmarried during pendency of High Court appeal; his name struck off.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Appellant received telegram from Lachhmi Narain on April 20, 1942; plaintiff and her son-in-law Radha Kishen proceeded to Kanpur and remained till April 23, 1942.",
      "type": "disputed",
      "date": "1942-04-20",
      "source": "petitioner"
    },
    {
      "id": "f10",
      "text": "Steel box in which jewellery taken from Jhansi to Kanpur was with plaintiff even at trial.",
      "type": "admitted",
      "date": null,
      "source": "plaintiff"
    },
    {
      "id": "f11",
      "text": "Plaintiff sent some jewellery to daughter Shyamabai via letter Ext. A-2 (undated, admitted by plaintiff); list includes some items similar to those entrusted to Lachhmi Narain.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f12",
      "text": "Plaintiff did not make demand for jewellery during lifetime of Lachhmi Narain or for two years thereafter.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f13",
      "text": "Plaintiff proceeded to Kanpur on telegram about broken padlock of her house at Rail Bazar, Kanpur; returned to Jhansi by evening train on April 23, 1942, leaving empty steel box (jewellery handed in baskets).",
      "type": "material",
      "date": "1942-04-23",
      "source": "plaintiff"
    },
    {
      "id": "f14",
      "text": "Testimony of Dr. Mohan Lal (treated plaintiff on April 22-23, 1942 at Jhansi) and dispensary record held unreliable by Trial Court.",
      "type": "disputed",
      "date": "1942-04-22",
      "source": "lower_court"
    },
    {
      "id": "f15",
      "text": "Radha Charan (who carried jewellery to Shyamabai) not examined; testimony of Banwari Lal (Shyamabai's husband) against appellant's case.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f16",
      "text": "Oral demands made after Lachhmi Narain's death (see lawyer's notice Ext. 24).",
      "type": "material",
      "date": null,
      "source": "plaintiff"
    },
    {
      "id": "f17",
      "text": "Ram Sewak (plaintiff's son) died November 1941, leaving widow Gomtibai; disputes arose, referred to arbitration.",
      "type": "background",
      "date": "1941-11",
      "source": "plaint"
    },
    {
      "id": "f18",
      "text": "During arbitration pendency, on advice of Lachhmi Narain (defendant Nos. 1 to 7), plaintiff deposited jewellery with him for safety due to dispute with Gomtibai and political movement; got writing from Shyania Charan and Priya Charan.",
      "type": "background",
      "date": "1942-04-15",
      "source": "plaint"
    },
    {
      "id": "f19",
      "text": "Gomtibai did not claim the ornaments; not considered in arbitration award.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f20",
      "text": "Receipt Ext. A-4 held not genuine by Trial Court and High Court.",
      "type": "admitted",
      "date": "1942-04-23",
      "source": "court"
    },
    {
      "id": "f21",
      "text": "Lachhmi Narain and appellant members of joint Hindu family governed by Mitakshara law.",
      "type": "background",
      "date": null,
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the jewellery was returned to the plaintiff by Lachhmi Narain on April 23, 1942.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the suit is maintainable given the entrustment was to defraud Gomtibai, invoking in pari delicto potior est conditio defendentis.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether appellant liable out of joint family estate for debt arising from misappropriation, as avyavaharika or illegal.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Jewellery returned on April 23, 1942, proved by circumstances: presence in Kanpur till 23rd per telegram April 20; steel box with plaintiff; Ext. A-2 to daughter with similar items; no demand during lifetime or 2 years after.",
      "supporting_facts": [
        "f9",
        "f10",
        "f11",
        "f12"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Suit not maintainable as entrustment to defraud Gomtibai (per plaint paras 5-6); parties in pari delicto potior est conditio defendentis.",
      "supporting_facts": [
        "f17",
        "f18"
      ],
      "legal_basis": "in pari delicto potior est conditio defendentis"
    },
    {
      "id": "pa3",
      "text": "No liability on joint family property for avyavaharika/illegal debt from misappropriation.",
      "supporting_facts": [
        "f21"
      ],
      "legal_basis": "Toshanpal Singh Ors. v. District Judge of Agra Ors.; Hindu law (Mitakshara)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Jewellery entrusted April 15, 1942, not returned; went to Kanpur for broken padlock, returned same evening with empty box; receipt not genuine.",
      "supporting_facts": [
        "f1",
        "f13",
        "f20"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Gomtibai knew of entrustment; no illegal purpose pleaded; not in pari delicto; fiduciary duty of Lachhmi Narain.",
      "supporting_facts": [
        "f18",
        "f19"
      ],
      "legal_basis": "Ansons Principles of the English Law of Contracts"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Receipt Ext. A-4 not genuine (agrees with High Court); circumstances do not prove return: presence in Kanpur on 23rd does not infer receipt; empty box explained; Ext. A-2 similarity common, not proved sent after return; no demand not significant due to confidence; oral demands post-death.",
      "addresses_issue": "i1",
      "key_observation": "Circumstances taken individually or collectively do not make out the case of the appellant."
    },
    {
      "id": "cr2",
      "text": "No proper pleading or issue on fraud; Trial Judge determined non-arising issue; not in pari delicto: Gomtibai knew per plaint; exceptions apply (illegal purpose not carried out against Gomtibai, fiduciary duty, no reliance on illegality); plaintiff persuaded by Lachhmi Narain under fiduciary duty.",
      "addresses_issue": "i2",
      "key_observation": "Where parties not in pari delicto, less guilty party may recover; fiduciary cannot retain on illegality plea."
    },
    {
      "id": "cr3",
      "text": "Debt not proved avyavaharika/illegal; no evidence of misappropriation by Lachhmi Narain; Toshanpal Singh distinguished as that involved criminal breach of trust.",
      "addresses_issue": "i3",
      "key_observation": "Sons liable for father's debts unless avyavaharika/illegal; burden on appellant not discharged."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Jewellery not returned; appellant fails to prove return.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Suit maintainable; in pari delicto does not apply due to lack of plea, knowledge of Gomtibai, fiduciary duty.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Joint family estate liable; debt not avyavaharika/illegal.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Toshanpal Singh Ors. v. District Judge of Agra Ors.",
      "citation": "L.R. 61 I.A. 350",
      "treatment": "distinguished",
      "relevance": "Does not support contention that joint family not liable for misappropriation debt, as no proof of criminal breach of trust here."
    }
  ],
  "statutes_cited": [
    {
      "name": "Hindu Law (Mitakshara)",
      "sections": [],
      "relevance": "Sons liable for father's debts unless avyavaharika/illegal."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court agrees with High Court, rejects all contentions of appellant, upholds decree for restoration of jewellery within one month or payment of Rs. 32,379/6/- with costs out of Lachhmi Narain's estate in hands of appellant.",
    "relief_granted": "Restoration of jewellery or payment of value with costs.",
    "costs": "With costs as per High Court decree."
  },
  "key_quotes": [
    {
      "text": "\"The circumstances taken either individually or collectively do not make out the case of the appellant.\"",
      "speaker": "court",
      "significance": "Rejects proof of return of jewellery."
    },
    {
      "text": "\"It was the plaintiffs case that it was at the persuation of Lachhmi Narain that the jewellery was entrusted to him. Again on the plaintiffs case Lachhmi Narain was under a fiduciary duty to the plaintiff.\"",
      "speaker": "court",
      "significance": "Explains why in pari delicto does not bar recovery."
    },
    {
      "text": "\"There is no evidence to prove that the debt was avyavaharika or illegal.\"",
      "speaker": "court",
      "significance": "Rejects joint family non-liability argument."
    }
  ],
  "_case_id": "1967_221",
  "_label": 0,
  "_text_length": 14211,
  "_extracted_at": "2026-02-10T20:23:19.764373"
}