{
  "metadata": {
    "case_name": "Madras Gymkhana Club Employees' Union v. Management of the Gymkhana Club, Madras",
    "case_year": 1966,
    "court": "Supreme Court of India",
    "judges": [
      "Hidayatullah, J."
    ],
    "case_number": "Civil Appeal No. 572 of 1966",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The Industrial Tribunal, Madras by its award dated September 2, 1964 held that the management of the Gymkhana Club, Madras is not liable to pay bonus to its workmen for the year 1962 as the Club is not an industry.",
      "type": "procedural",
      "date": "1964-09-02",
      "source": "lower_court"
    },
    {
      "id": "f2",
      "text": "The Madras Gymkhana Club Employees' Union appeals to this Court by special leave.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "The Madras Gymkhana Club is a members' club and not a proprietary club.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On December 31, 1962 its membership was about 1200 with 800 active members.",
      "type": "background",
      "date": "1962-12-31",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The object of the club is to provide a venue for sports and games and facilities for recreation and entertainment.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "For sports, it maintains a golf course, tennis courts, rugby and football grounds and has made arrangement for billiards, pingpong and other indoor games.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "As part of recreation, it arranges dance, dinner and other parties and runs a catering department, which provides food and refreshments not only generally but also for dinners and parties on special occasions.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "The club employs six officers (a Secretary, a Superintendent and four Accountants and Cashiers), twenty clerks and a large number of peons, stewards, butlers, gate-attendants, etc.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Its catering department has a separate managerial, clerical and other staff. Altogether there are 194 employees.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "The affairs of the club are managed by a Committee, elected annually. Two of the members of the Committee work as Hon. Secretary and Hon. Treasurer respectively.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "The membership of the club is varied: resident members, non-resident members, temporary members, garrison members, independent lady members, etc.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Resident members pay an entrance fee of Rs. 300 and Rs. 20 per month as subscription. Garrison members and independent lady members do not pay any entrance fee and their subscription is Rs. 10 per month.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Guests, both local and from outside, are admitted subject to certain restrictions as to the number of days on which they can be invited to the club.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "The club runs tournaments for the benefit of members and for exhibition to non-members.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f15",
      "text": "The income and expenditure of the club are of the order of four and a quarter lakh rupees, its movable and immovable properties are worth several lakh rupees and its wage bill is between one and two lakh rupees.",
      "type": "background",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the respondent club can be said to be an industry for the application of the Industrial Disputes Act, 1947.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The decision of the Tribunal is not correct and that the club must be treated as an industry for the application of the Act.",
      "supporting_facts": [
        "f3",
        "f4",
        "f5",
        "f6",
        "f7",
        "f8",
        "f9"
      ],
      "legal_basis": "Industrial Disputes Act, 1947 s. 2(j)"
    },
    {
      "id": "pa2",
      "text": "The club is organised as an industry is organised on a vast scale with multifarious activities; facilities of accommodation, catering, sale of alcoholic and non-alcoholic beverages, games etc. are provided; the club runs parties at which guests are freely entertained; the club has established reciprocal arrangements with other clubs for its members.",
      "supporting_facts": [
        "f5",
        "f6",
        "f7",
        "f13",
        "f14"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Reliance on decisions of Calcutta High Court relating to Bengal Club Ltd. and Royal Calcutta Golf Club, observing that even a non-proprietary members club is an industry.",
      "supporting_facts": [],
      "legal_basis": "Bengal Club Ltd. (A.I.R. 1956 Cal. 545); Royal Calcutta Golf Club (A.I.R. Cal. 550)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The club is not an industry.",
      "supporting_facts": [
        "f3",
        "f10",
        "f11",
        "f12",
        "f13"
      ],
      "legal_basis": "Industrial Disputes Act, 1947 s. 2(j)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Definitions in Industrial Disputes Act: industry means any business, trade, undertaking, manufacture or calling of employers and includes any calling, service, employment, handicraft, or industrial occupation or avocation of workmen.",
      "addresses_issue": "i1",
      "key_observation": "The definition is in two parts: first part denotes by reference to employers' occupation; second part extends connotation from employees' angle."
    },
    {
      "id": "cr2",
      "text": "Reviewed earlier Supreme Court decisions: D.N. Banerjee (municipality is industry), Baroda Borough, Nagpur Corporation, Hospital Mazdoor Sabha (hospital is industry), Ahmedabad Textile Research, Solicitors firm (not industry), Harinagar Cane Farm, University of Delhi (not industry).",
      "addresses_issue": "i1",
      "key_observation": "Activity must be systematic, analogous to trade or business, produce material goods or services; profit motive not essential; learned professions excluded."
    },
    {
      "id": "cr3",
      "text": "Cardinal test: whether there is an industry according to denotation in first part (business, trade, undertaking, manufacture, calling of employers). Second part includes employees' activities if first part satisfied.",
      "addresses_issue": "i1",
      "key_observation": "No need for direct nexus or partnership in every case; focus on employer's occupation."
    },
    {
      "id": "cr4",
      "text": "Club does not follow trade or business, not manufacture, not calling of members or committee. Organized like business but services for members' pleasure and consumption only.",
      "addresses_issue": "i1",
      "key_observation": "Club exists for its members; a members' self-serving institution; guests only on invitation; no right for outsiders."
    },
    {
      "id": "cr5",
      "text": "Club identified with its members; no existence apart from members. None of petitioner's considerations sufficient to make it an industry.",
      "addresses_issue": "i1",
      "key_observation": "Material services to community must be as part of trade/business/undertaking analogous thereto; missing in members' club."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "A members' club like the Madras Gymkhana Club is not an industry within the meaning of s. 2(j) of the Industrial Disputes Act, 1947.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "D.N. Banerjee v. P.R. Mukherjee",
      "citation": "1953 SCR 302",
      "treatment": "followed",
      "relevance": "Municipality is an industry; undertaking analogous to trade/business even without profit."
    },
    {
      "case_name": "Baroda Borough Municipality v. Workmen",
      "citation": "1957 1 LLJ 8",
      "treatment": "followed",
      "relevance": "Municipal undertaking analogous to trade/business is industry."
    },
    {
      "case_name": "Corporation of City of Nagpur v. Employees",
      "citation": "1960 2 SCR 942",
      "treatment": "distinguished",
      "relevance": "Municipal functions analogous to trade/business; test of regal vs municipal functions unfortunate and contradicted earlier cases."
    },
    {
      "case_name": "State of Bombay v. Hospital Mazdoor Sabha",
      "citation": "1960 2 SCR 866",
      "treatment": "followed",
      "relevance": "Government hospital is industry; activity for material services to community with employees."
    },
    {
      "case_name": "Ahmedabad Textile Industry Research Association v. State of Bombay",
      "citation": "1961 2 SCR 480",
      "treatment": "followed",
      "relevance": "Research association providing material services organized like trade is industry."
    },
    {
      "case_name": "National Union of Commercial Employees v. M.R. Meher",
      "citation": "1962 Supp. 3 SCR 157",
      "treatment": "followed",
      "relevance": "Solicitors' firm not industry; learned professions excluded due to personal qualification."
    },
    {
      "case_name": "Harinagar Cane Farm v. State of Bihar",
      "citation": "1964 2 SCR 458",
      "treatment": "followed",
      "relevance": "Agriculture not always industry; refrain from broad propositions."
    },
    {
      "case_name": "University of Delhi v. Ramnath",
      "citation": "1964 2 SCR 703",
      "treatment": "followed",
      "relevance": "Educational institutions not industry."
    },
    {
      "case_name": "Bengal Club Ltd.",
      "citation": "A.I.R. 1956 Cal. 545",
      "treatment": "distinguished",
      "relevance": "Proprietary club for profit is industry; obiter on members' club not applicable."
    },
    {
      "case_name": "Royal Calcutta Golf Club",
      "citation": "A.I.R. Cal. 550",
      "treatment": "distinguished",
      "relevance": "Similar to Bengal Club; proprietary club."
    }
  ],
  "statutes_cited": [
    {
      "name": "Industrial Disputes Act, 1947",
      "sections": [
        "s. 2(j)",
        "s. 2(k)",
        "s. 2(g)",
        "s. 2(s)"
      ],
      "relevance": "Definition of industry, industrial dispute, employer, workman applied to determine if club is industry and dispute covered."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court upheld the Tribunal's award holding that the Madras Gymkhana Club is not an industry under s. 2(j) of the Industrial Disputes Act, 1947, and thus not liable to pay bonus to its employees for 1962. The appeal by special leave is dismissed.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The club exists for its members... a members' self-serving institution. No doubt occasionally strangers also take benefit from its services but they can only do so on invitation of members.",
      "speaker": "court",
      "significance": "Core reason why club not an industry: services restricted to members for pleasure."
    },
    {
      "text": "Industry is the nexus between employers and employees and it is this nexus which brings two distinct bodies together to produce a result.",
      "speaker": "court",
      "significance": "Defines essence of industry emphasizing cooperation for material goods/services."
    },
    {
      "id": "kq3",
      "text": "The cardinal test is thus to find out whether there is an industry according to the denotation of the word in the first part.",
      "speaker": "court",
      "significance": "Prioritizes first part of s. 2(j) definition over employee angle."
    }
  ],
  "_case_id": "1967_218",
  "_label": 0,
  "_text_length": 44498,
  "_extracted_at": "2026-02-10T20:23:21.458567"
}