{
  "metadata": {
    "case_name": "Commissioner of Income-tax v. Assessee",
    "case_year": 1966,
    "court": "Supreme Court of India",
    "judges": [
      "Shah, J."
    ],
    "case_number": "Civil Appeal No. 784 of 1966",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The respondent (assessee) carries on the business of manufacture and sale of cotton yarn.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "In the previous year relevant to the assessment year 1956-57, the assessee spent Rs. 93,215/- for introduction of Casablanca conversion system in its spinning plant.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Introduction of Casablanca conversion system involved replacement of certain roller stands and fluted rollers fitted with rubber aprons to the spinning machinery, removal of ringframes from certain existing parts, introduction of ballbearing jockey-pulleys for converting the original band-drivers to tape-drivers and other additions and alterations in the drafting mechanism.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Income-tax Officer disallowed the claim of Rs. 93,215/- as not admissible as development rebate since the introduction did not involve installation of new machinery.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "Appellate Assistant Commissioner agreed with the Income-tax Officer.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "Appellate Tribunal inspected the spinning factory of the assessee, studied the working of the machinery with Casablanca conversion system, considered literature published by manufacturers and notification by Ministry of Commerce defining import policy.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Tribunal held that as a result of stress and strain of production over a long period there was need for change in the plant and assessee replaced old parts by introducing Casablanca conversion system; expenditure not admissible as development rebate but admissible as allowance under s. 10(2)(v) of Indian Income-tax Act.",
      "type": "admitted",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Tribunal referred two questions to Madras High Court: (1) Whether Tribunal had jurisdiction to decide if Rs. 93,215/- constituted allowable expenditure under s. 10(2)(v); (2) Whether Rs. 93,215/- or any portion allowable as current repairs under s. 10(2)(v).",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "High Court accepted Tribunal's finding that no new machinery or plant installed but introduction amounted to fitting of improved versions of certain minor parts and expenditure of revenue nature; held Tribunal had jurisdiction to permit assessee to raise new contention.",
      "type": "procedural",
      "date": "1964-03-12",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Tribunal had evidence that by introducing Casablanca conversion system assessee made current repairs to machinery and plant; certain moving parts had to be periodically replaced due to wear and tear, old type not available, so introduced Casablanca system as modified version of older parts.",
      "type": "disputed",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Counsel for Commissioner did not challenge findings on allowability as current repairs.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Commissioner appealed to Supreme Court with special leave.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether on the facts and in the circumstances of the case the Tribunal had jurisdiction to decide whether the sum of Rs. 93,215/- constituted an allowable item of expenditure under s. 10(2)(v) of the Act?",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether on the facts and in the circumstances of the case, the sum of Rs. 93,215/- or any portion thereof is allowable as an expenditure incurred for current repairs under s. 10(2)(v) of the Act?",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Tribunal lacked jurisdiction to allow a plea inconsistent with the plea raised before the departmental authorities (i.e., claim under s.10(2)(v) not raised before ITO/AAC).",
      "supporting_facts": [
        "f4",
        "f5"
      ],
      "legal_basis": "Indian Income-tax Act, 1922"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Expenditure allowable as development rebate under s.10(2)(vi-b) as installation of new machinery; alternatively, allowable under s.10(2)(v) as current repairs.",
      "supporting_facts": [
        "f2",
        "f3",
        "f6",
        "f7"
      ],
      "legal_basis": "s.10(2)(vi-b) and s.10(2)(v) of Indian Income-tax Act, 1922"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Accepted Tribunal's findings that introduction of Casablanca conversion system did not involve new machinery but current repairs due to wear and tear, replacement of old parts with modified versions; counsel for Commissioner did not challenge these findings.",
      "addresses_issue": "i2",
      "key_observation": "Expenditure of revenue nature, allowable under s.10(2)(v)."
    },
    {
      "id": "cr2",
      "text": "Under s.33(4) of Indian Income-tax Act, 1922, Appellate Tribunal competent to pass such orders as it thinks fit; no restriction to questions raised before departmental authorities; all questions of law or fact relating to assessment may be raised; duty to grant relief if justified on another ground.",
      "addresses_issue": "i1",
      "key_observation": "Subject-matter of appeal was right to claim allowance for Rs.93,215/- whether under one head or another of s.10(2); Tribunal investigated true nature and held allowable under s.10(2)(v)."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "High Court right in answering first question in affirmative: Tribunal had jurisdiction.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "High Court right in answering second question in affirmative: Rs.93,215/- allowable as current repairs under s.10(2)(v).",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act, 1922",
      "sections": [
        "s. 10(2)(v)",
        "s. 10(2)(vi-b)",
        "s. 33(4)"
      ],
      "relevance": "s.10(2)(v) for current repairs allowance; s.10(2)(vi-b) for development rebate (rejected); s.33(4) for Tribunal's appellate powers and jurisdiction to consider alternative grounds."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court upheld the Madras High Court's answers to both questions referred by the Tribunal in the affirmative, confirming the Tribunal's jurisdiction and allowability of Rs.93,215/- as current repairs under s.10(2)(v).",
    "relief_granted": "Expenditure of Rs.93,215/- allowed as deduction in assessment.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "Under sub-s. (4) of s. 33 of the Indian Income-tax Act, 1922, the Appellate Tribunal is competent to pass such orders on the appeal as it thinks fit.",
      "speaker": "court",
      "significance": "Establishes Tribunal's wide jurisdiction."
    },
    {
      "text": "There is nothing in the Income-tax Act which restricts the Tribunal to the determination of questions raised before the departmental authorities.",
      "speaker": "court",
      "significance": "Confirms Tribunal can raise new grounds relating to assessment."
    },
    {
      "text": "The right of the assessee to relief is not restricted to the plea raised by him.",
      "speaker": "court",
      "significance": "Duty to grant relief on justified alternative grounds."
    }
  ],
  "_case_id": "1967_203",
  "_label": 0,
  "_text_length": 6892,
  "_extracted_at": "2026-02-10T20:22:05.127494"
}