{
  "metadata": {
    "case_name": "Mysore State Road Transport Corporation v. Respondent",
    "case_year": 1967,
    "court": "Supreme Court of India",
    "judges": [
      "Bachawat, J"
    ],
    "case_number": "Civil Appeal No. 1299 of 1967",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The respondent was a class III employee in the statistical department of the Mysore State Road Transport Corporation.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "In October 1961, the respondent was temporarily promoted to act as statistical superintendent at Hassan.",
      "type": "background",
      "date": "1961-10",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On July 21, 1964, the General Manager of the Corporation issued a notice inviting applications for appointments to class II junior posts of (a) assistant divisional statisticians and (b) labour welfare officers on a pay of Rs. 220 per month in the pay scale of Rs. 220-15-400-EB-20-500 plus the usual dearness and other allowances admissible under the Rules.",
      "type": "material",
      "date": "1964-07-21",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On August 11, 1964, the respondent filed a writ petition in the High Court at Mysore claiming that the Corporation had no power to issue the notice and praying for an order quashing it.",
      "type": "procedural",
      "date": "1964-08-11",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The High Court allowed the petition and quashed the notice by judgment and order dated November 16, 1966.",
      "type": "procedural",
      "date": "1966-11-16",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The Corporation filed this appeal by special leave.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Admittedly, no regulations were framed by the Corporation under s. 45(2)(c) prescribing the conditions of appointment and service and the scales of pay of its officers and servants.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "In the affidavit filed on behalf of the Corporation, it was stated that the Corporation was taking necessary steps for the framing of the regulations.",
      "type": "admitted",
      "date": null,
      "source": "corporation"
    },
    {
      "id": "f9",
      "text": "The High Court followed its earlier decision in Karnakar Mangesha Desai v. State of Mysore and others.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "There is nothing on the record to show that the respondent has any vested right of promotion to the post.",
      "type": "disputed",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Civil Miscellaneous Petition No. 3032 of 1967 filed by the respondent asking for liberty to adduce additional evidence and to raise new contentions is dismissed.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "In the order dated August 17, 1967 granting special leave to the appellant, the Court directed that the appellant must pay the costs of the respondent in any event.",
      "type": "procedural",
      "date": "1967-08-17",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the Corporation had the power to appoint officers and servants and to lay down their conditions of service in the absence of regulations framed under s. 45(2)(c) of the Road Transport Corporations Act, 1950.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the General Manager had power to issue the notice dated July 21, 1964 in the absence of any resolution by the Corporation under s.12(c) expressly authorising him to issue it.",
      "framed_by": "respondent"
    },
    {
      "id": "i3",
      "text": "Whether the respondent had the right to be promoted to a class II junior post.",
      "framed_by": "respondent"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The Corporation had the power under s.14(2) to appoint such officers and servants as it considers necessary for the efficient performance of its functions, and under s.19(1)(c) to provide suitable conditions of service, even in absence of regulations under s.45(2)(c).",
      "supporting_facts": [
        "f7",
        "f8"
      ],
      "legal_basis": "Sections 14(2), 19(1)(c), 34, 45(2)(c) of Road Transport Corporations Act, 1950"
    },
    {
      "id": "pa2",
      "text": "The General Manager, in exercise of his general powers of management, had the power to issue the notice inviting applications.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": "General powers of General Manager"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Until regulations were framed by the Corporation under s.45(2)(c) with previous sanction of State Government, the Corporation could not appoint officers and servants and lay down their conditions of service.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "Sections 14(3)(b), 45(2)(c) of Road Transport Corporations Act, 1950; Karnakar Mangesha Desai v. State of Mysore"
    },
    {
      "id": "ra2",
      "text": "The General Manager had no power to issue the notice dated July 21, 1964 in the absence of any resolution by the Corporation under s.12(c) expressly authorising him.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": "Section 12(c)"
    },
    {
      "id": "ra3",
      "text": "The respondent had the right to be promoted to a class II junior post.",
      "supporting_facts": [
        "f2"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The power to appoint officers and servants depends on construction of the statute; s.14(2) expressly confers power to appoint necessary officers and servants; s.19(1)(c) empowers provision of conditions of service.",
      "addresses_issue": "i1",
      "key_observation": "The conjoint effect of ss.14(3)(b), 34 and 45(2)(c) is that appointments must conform to directions under s.34 or regulations under s.45(2)(c), but until such are framed or given, the Corporation may appoint on terms it thinks fit."
    },
    {
      "id": "cr2",
      "text": "There is a necessary time-lag between formation of Corporation and framing of regulations; legislature did not intend Corporation to lack power to appoint during intervening period.",
      "addresses_issue": "i1",
      "key_observation": "In absence of clear words, difficult to impute intention that Corporation has no power without regulations."
    },
    {
      "id": "cr3",
      "text": "General Manager had power to issue notice inviting applications in exercise of general powers of management; no appointment made pursuant to notice.",
      "addresses_issue": "i2",
      "key_observation": "No allegation that any appointment was made."
    },
    {
      "id": "cr4",
      "text": "Nothing on record to show respondent has vested right of promotion.",
      "addresses_issue": "i3",
      "key_observation": "No merit in contention."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The Corporation has power to appoint officers and servants and fix conditions of service until regulations under s.45(2)(c) or directions under s.34 are issued.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "General Manager had power to issue the notice.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h3",
      "text": "Respondent has no vested right to promotion.",
      "resolves_issue": "i3",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Karnakar Mangesha Desai v. State of Mysore and others",
      "citation": "(1966) 1 Mysore Law Journal 72",
      "treatment": "distinguished",
      "relevance": "High Court followed this to hold no power without regulations; Supreme Court disagreed."
    },
    {
      "case_name": "Dundee Harbour Trustees v. D. J. Nicol",
      "citation": "1915 A.C. 550",
      "treatment": "followed",
      "relevance": "Power of statutory corporation depends on express grant or implication from language; question of construction."
    }
  ],
  "statutes_cited": [
    {
      "name": "Road Transport Corporations Act, 1950 (Act No. 64 of 1950)",
      "sections": [
        "14(1)",
        "14(2)",
        "14(3)(b)",
        "19(1)(a)",
        "19(1)(b)",
        "19(1)(c)",
        "34(1)",
        "34(2)(c)",
        "45(1)",
        "45(2)(c)",
        "12(c)"
      ],
      "relevance": "Governs powers of Corporation to appoint officers/servants, conditions of service, regulations, and State Government directions."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "The appeal is allowed, the order of the High Court is set aside and the writ petition is dismissed. Civil Miscellaneous Petition No. 3032 of 1967 dismissed.",
    "relief_granted": "High Court order quashed; writ petition dismissed",
    "costs": "The appellant shall pay the costs of the appeal to the respondent pursuant to the order dated August 17, 1967."
  },
  "key_quotes": [
    {
      "text": "\"The answer to the question whether a corporation created by a statute has a particular power depends exclusively on whether that power has been expressly given to it by the statute regulating it, or can be implied from the language used. The question is simply one of construction of language, and not of presumption.\"",
      "speaker": "court",
      "significance": "Principle applied to interpret Corporation's powers under the Act."
    },
    {
      "text": "We think that the judgment of the High Court is erroneous and should be set aside.",
      "speaker": "court",
      "significance": "Direct holding reversing High Court."
    }
  ],
  "_case_id": "1967_83",
  "_label": 1,
  "_text_length": 8714,
  "_extracted_at": "2026-02-10T20:20:41.868866"
}