{
  "metadata": {
    "case_name": "Appellants in Criminal Appeal Nos. 218 and 238 of 1966 v. Respondents",
    "case_year": 1966,
    "court": "Supreme Court of India",
    "judges": [
      "Vaidialingam, J."
    ],
    "case_number": "Criminal Appeal No. 218 of 1966 and Criminal Appeal No. 238 of 1966",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Respondent Dinesh Mishra lodged first information report on June 3, 1965, at Rajoun Police Station, stating he saw thatched house of Uma Kant Misra burning and petitioners running away from the scene.",
      "type": "material",
      "date": "1965-06-03",
      "source": "respondent"
    },
    {
      "id": "f2",
      "text": "Police investigated and submitted final report under S.173 CrPC on July 13, 1965, stating offence complained of was false.",
      "type": "procedural",
      "date": "1965-07-13",
      "source": "police"
    },
    {
      "id": "f3",
      "text": "Respondent filed protest petition challenging correctness of police final report.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f4",
      "text": "Sub-Divisional Magistrate perused police diary, heard counsel for respondent and public prosecutor, and on October 27, 1965, directed police to submit charge-sheet against petitioners.",
      "type": "procedural",
      "date": "1965-10-27",
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "Petitioners challenged Magistrate's order before Sessions Judge, Bhagalpur, and Patna High Court; both upheld the order following previous Patna HC decision.",
      "type": "procedural",
      "date": "1966-08-05",
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "Second respondent lodged written report on February 24, 1964, at Malsalami police station that daughter Hiramani missing from February 21, 1964, and appellants kidnapped her; case registered under S.366 IPC.",
      "type": "material",
      "date": "1964-02-24",
      "source": "respondent"
    },
    {
      "id": "f7",
      "text": "Police after investigation submitted final report that girl recovered, stated she eloped of her own accord, and case might be treated as closed.",
      "type": "procedural",
      "date": null,
      "source": "police"
    },
    {
      "id": "f8",
      "text": "Second respondent filed protest petition challenging police statements and complaint under S.498 IPC.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f9",
      "text": "Magistrate perused case diary, heard lawyer for appellants, second respondent, and public prosecutor, and directed investigating officer to submit charge-sheet under S.366 IPC.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Magistrate's order confirmed by Sessions Judge and Patna High Court on September 13, 1966.",
      "type": "procedural",
      "date": "1966-09-13",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Supreme Court appeals by special leave against Patna High Court orders.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether a Magistrate can direct the police to submit a charge-sheet when the police, after investigation into a cognizable offence, had submitted a final report under S.173 CrPC.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "When final report submitted by police under S.173(1) stating no case made out, Magistrate has no jurisdiction to direct police to file charge-sheet; may direct further investigation or treat protest petition as complaint and take cognizance.",
      "supporting_facts": [
        "f2",
        "f4",
        "f7",
        "f9"
      ],
      "legal_basis": "Scheme of Chapter XIV CrPC; State of Gujarat v. Shah Lakhamshi (1966 Guj 283)"
    },
    {
      "id": "pa2",
      "text": "Formation of opinion as to whether case to place accused on trial is that of investigating officers; Magistrate cannot compel police to form particular opinion.",
      "supporting_facts": [
        "f2",
        "f7"
      ],
      "legal_basis": "Chapter XIV CrPC"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Magistrate has jurisdiction in proper cases when disagrees with final report to direct police to submit charge-sheet; otherwise courts powerless if police discretion misused.",
      "supporting_facts": [
        "f2",
        "f4",
        "f7",
        "f9"
      ],
      "legal_basis": "Dissenting views in A.K. Roy v. State of W.B. (AIR 1962 Cal 135 FB); State v. Murlidhar Govardhan (AIR 1960 Bom 240); Ram Nandan v. State (AIR 1966 Pat 438)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Chapter XIV CrPC confers large powers on police for investigation of cognizable offences; manner and method left to police; Magistrate has no power to interfere.",
      "addresses_issue": "i1",
      "key_observation": "Police form opinion on whether sufficient evidence to forward accused (S.169 or 170); report under S.173 follows that opinion."
    },
    {
      "id": "cr2",
      "text": "Magistrate on receiving S.173 report exercises judicial discretion under S.190(1) to take cognizance or not; not bound by police opinion.",
      "addresses_issue": "i1",
      "key_observation": "If disagrees with final report, can direct further investigation under S.156(3), or take cognizance under S.190(1)(c), or accept and close."
    },
    {
      "id": "cr3",
      "text": "No express or implied power for Magistrate to direct charge-sheet; would compel police to change opinion, encroaching on police function.",
      "addresses_issue": "i1",
      "key_observation": "Functions of judiciary and police complementary, not overlapping; police statutory right to investigate without judicial interference."
    },
    {
      "id": "cr4",
      "text": "Protest petitions not treated as complaints by Magistrates, as no procedure under CrPC for cognizance on complaint followed.",
      "addresses_issue": "i1",
      "key_observation": "Liberty given to Magistrates to treat protests as complaints and proceed."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Magistrate has no power, expressly or impliedly, under CrPC to direct police to submit charge-sheet when they have submitted final report under S.173 that no case made out.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Magistrate may direct further investigation under S.156(3) if investigation incomplete, take cognizance under S.190(1)(c), or treat protest as complaint.",
      "resolves_issue": "i1",
      "in_favor_of": "partial"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "King Emperor v. Khwaja Nazir Ahmed",
      "citation": "L.R. 71 I.A. 203",
      "treatment": "followed",
      "relevance": "Judiciary should not interfere with police investigation; functions complementary."
    },
    {
      "case_name": "H.N. Rishbud and Inder Singh v. State of Delhi",
      "citation": "1955 SCR 1150",
      "treatment": "followed",
      "relevance": "Investigation includes formation of opinion by police whether case to place accused on trial."
    },
    {
      "case_name": "State of West Bengal v. S.N. Basak",
      "citation": "AIR 1963 SC 447",
      "treatment": "followed",
      "relevance": "Approved observations from Nazir Ahmed case."
    },
    {
      "case_name": "State of Gujarat v. Shah Lakhamshi",
      "citation": "AIR 1966 Guj 283",
      "treatment": "followed",
      "relevance": "Magistrate no power to direct charge-sheet."
    },
    {
      "case_name": "A.K. Roy v. State of W.B.",
      "citation": "AIR 1962 Cal 135 FB",
      "treatment": "distinguished",
      "relevance": "Dissenting views noted but not accepted."
    },
    {
      "case_name": "State v. Murlidhar Govardhan",
      "citation": "AIR 1960 Bom 240",
      "treatment": "distinguished",
      "relevance": "Held Magistrate has power; not accepted."
    },
    {
      "case_name": "Ram Nandan v. State",
      "citation": "AIR 1966 Pat 438",
      "treatment": "overruled",
      "relevance": "Patna HC view that Magistrate has jurisdiction overruled."
    }
  ],
  "statutes_cited": [
    {
      "name": "Code of Criminal Procedure, 1898",
      "sections": [
        "154",
        "155",
        "156",
        "157",
        "158",
        "159",
        "160",
        "161",
        "162",
        "163",
        "165",
        "166",
        "167",
        "168",
        "169",
        "170",
        "172",
        "173",
        "190",
        "491"
      ],
      "relevance": "Chapter XIV governs police investigation powers and final report; Magistrate jurisdiction to take cognizance under S.190; no power to compel charge-sheet."
    },
    {
      "name": "Indian Penal Code",
      "sections": [
        "366",
        "498"
      ],
      "relevance": "Offences alleged in second case."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeals allowed; orders of Magistrate directing police to file charge-sheets set aside as without jurisdiction; liberty to Magistrates to treat protest petitions as complaints and proceed according to law.",
    "relief_granted": "Orders quashed; liberty to proceed on protests as complaints.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"the judiciary should not interfere with the police in matters which are within their province and into which the law imposes on them the duty of inquiry.\"",
      "speaker": "court",
      "significance": "From Nazir Ahmed case, emphasizing separation of police and judicial functions."
    },
    {
      "text": "\"the formation of the opinion as to whether or not there is a case to place the accused on trial, has been left to the officer incharge of a police station.\"",
      "speaker": "court",
      "significance": "Core holding on police discretion in investigation."
    },
    {
      "text": "\"There is no power, expressly or impliedly conferred, under the Code, on a Magistrate to call upon the police to submit a charge-sheet.\"",
      "speaker": "court",
      "significance": "Direct resolution of the main issue."
    }
  ],
  "_case_id": "1967_29",
  "_label": 1,
  "_text_length": 31731,
  "_extracted_at": "2026-02-10T20:20:09.011791"
}