{
  "metadata": {
    "case_name": "State of Mysore v. Timber Dealer (Respondent)",
    "case_year": 1965,
    "court": "Supreme Court of India",
    "judges": [
      "Shah, J."
    ],
    "case_number": "Civil Appeal No. 1010 of 1965",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "By S. 37 of the Mysore Forest Act 11 of 1900 the State Government is authorized to make rules to regulate the transit of forest produce.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "In exercise of powers under S. 37, State Government framed rules; r. 2 dated October 13, 1952 provided no person shall import, export or move forest produce within Scheduled areas without permit prescribed in r. 3.",
      "type": "background",
      "date": "1952-10-13",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On April 15, 1959, State of Mysore issued notification adding first proviso to r. 2: no permit shall authorise transport of forest produce between sunset and sunrise in areas specified in Schedule A.",
      "type": "material",
      "date": "1959-04-15",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On September 14, 1960, State Government introduced second proviso to r. 2: permission may be granted to timber merchants to transport timber up to 10 P.M. on requisition, subject to cash deposit of Rs. 1,000 as security for compliance with timber transit rules.",
      "type": "material",
      "date": "1960-09-14",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Respondent, a dealer in timber, filed writ petition under Art. 226 in Mysore High Court to quash the two provisos to r. 2, inter alia on grounds that they were beyond rule-making authority under S. 37 and imposed unauthorized restrictions on freedom of trade, commerce and intercourse.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Mysore High Court by judgment and order dated July 11, 1963 held provisos beyond powers under S. 37 as they stopped transport altogether (prohibitory not regulatory), not saved by Art. 305, violative of Art. 301, and struck them down.",
      "type": "procedural",
      "date": "1963-07-11",
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "State of Mysore granted special leave to appeal to Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Affidavit by State claimed restrictions reasonable and in public interest to prevent unauthorized felling, smuggling; night checking requires more staff, equipment; smugglers prefer nights.",
      "type": "background",
      "date": null,
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the two provisos to r. 2 are within the rule-making authority conferred by S. 37 of Mysore Forest Act (power to regulate transit vs. power to prohibit/restrict)",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the provisos are regulatory or prohibitory/restrictive of the right to transport forest produce",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether the provisos violate Art. 301 and are saved by Art. 305 or exempted under Art. 304",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Provisos to r. 2 are regulatory and not prohibitory; every prohibition is not a restriction; substance matters, not form; compared to cls. (b), (j), (l) of S. 37(2) which are regulatory prohibitions.",
      "supporting_facts": [
        "f2",
        "f3",
        "f4"
      ],
      "legal_basis": "S. 37 Mysore Forest Act; cls. (b), (j), (l) of S. 37(2)"
    },
    {
      "id": "pa2",
      "text": "Restrictions imposed by provisos are reasonable and in public interest to prevent smuggling and unauthorized felling.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Two provisos beyond rule-making authority under S. 37; impose unauthorized restrictions on freedom of trade, commerce and intercourse.",
      "supporting_facts": [
        "f3",
        "f4"
      ],
      "legal_basis": "S. 37 Mysore Forest Act; Art. 301 Constitution"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "S. 37(1) vests control and power to make rules to regulate transit of forest produce; S. 37(2)(b) allows prohibition without pass, which is regulatory; but provisos impose absolute prohibition 10 PM to sunrise, qualified sunset to 10 PM with deposit - these are restrictive/prohibitory, not regulatory.",
      "addresses_issue": "i1",
      "key_observation": "Power is to regulate (permit subject to conditions to promote orderly transport), not to prohibit/restrict."
    },
    {
      "id": "cr2",
      "text": "Restrictions obstruct freedom, regulations promote it; cited Automobile Transport case distinguishing regulations (lighting, speed etc.) from restrictions.",
      "addresses_issue": "i2",
      "key_observation": "Provisos are prima facie prohibitory as they totally prohibit movement during certain hours."
    },
    {
      "id": "cr3",
      "text": "No power under any clause of S. 37(2) to impose time-based restrictions on transport; public interest grounds irrelevant to interpreting power as regulatory only.",
      "addresses_issue": "i1",
      "key_observation": "Even good grounds do not transform restrictive rules into regulatory."
    },
    {
      "id": "cr4",
      "text": "Provisos restrictive of trade/commerce under Art. 301; not regulatory so hit by Art. 301; not saved by Art. 305 as rules made post-Constitution, not 'existing law'; S. 37 is existing law but post-Constitution rules exercising it are not.",
      "addresses_issue": "i3",
      "key_observation": "Cited Kalvani Stores: post-Constitution notifications not existing law."
    },
    {
      "id": "cr5",
      "text": "Art. 304 inapplicable: not law by Legislature, no evidence of public interest enquiry for reasonable restrictions.",
      "addresses_issue": "i3",
      "key_observation": "Rules by executive under delegated power, not legislative."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Two provisos to r. 2 are not regulatory but restrictive/prohibitory, beyond power under S. 37 to regulate transit.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Provisos violate Art. 301 as restrictions on trade/commerce/intercourse; not saved by Art. 305 (post-Constitution rules not existing law); Art. 304 inapplicable.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Automobile Transport Rajasthan Ltd. v. State of Rajasthan",
      "citation": "1963 1 S.C.R. 491",
      "treatment": "followed",
      "relevance": "Distinction between regulations (promote freedom) and restrictions (obstruct); regulatory measures not hit by Art. 301."
    },
    {
      "case_name": "Kalvani Stores v. State of Orissa",
      "citation": "A.I.R. 1966 S.C. 1686",
      "treatment": "followed",
      "relevance": "Post-Constitution notifications under pre-Constitution Act not 'existing law' under Art. 305; must comply with Arts. 302-304."
    },
    {
      "case_name": "Kasi Prasad v. State of Orissa",
      "citation": null,
      "treatment": "distinguished",
      "relevance": "Orissa HC held post-Constitution forest rules existing law saved by Art. 305 - incorrect."
    }
  ],
  "statutes_cited": [
    {
      "name": "Mysore Forest Act 11 of 1900",
      "sections": [
        "Section 37",
        "Section 77"
      ],
      "relevance": "Confers power to regulate transit of forest produce; rules under it must be regulatory, not prohibitory; s.77: rules have force of law but not part of Act."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 226",
        "Article 301",
        "Article 304",
        "Article 305",
        "Article 366(10)"
      ],
      "relevance": "Art. 301 guarantees free trade/commerce; provisos violate as restrictions; not saved by 305 (not existing law); 304 inapplicable to executive rules without public interest evidence."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court dismissed the appeal, upholding Mysore High Court judgment striking down the two provisos to r. 2 as ultra vires S. 37 and violative of Art. 301.",
    "relief_granted": "Provisos to r. 2 quashed (as per High Court order upheld)",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"Restrictions obstruct the freedom, whereas regulations promote it. Police regulations... really facilitate the freedom of movement rather than retard it.\"",
      "speaker": "court",
      "significance": "Defines distinction between regulation and restriction under Art. 301"
    },
    {
      "text": "The power conferred upon the State Government is merely to regulate the transit of forest produce and not to restrict it.",
      "speaker": "court",
      "significance": "Core holding on scope of S. 37"
    },
    {
      "text": "Prima facie, a rule which totally prohibits the movement of forest produce during the period between sun-set and sun-rise is prohibitory or restrictive of the right to transport forest produce.",
      "speaker": "court",
      "significance": "Classifies provisos as prohibitory"
    }
  ],
  "_case_id": "1967_1",
  "_label": 0,
  "_text_length": 14475,
  "_extracted_at": "2026-02-10T20:20:02.317041"
}