{
  "metadata": {
    "case_name": "Collector of Varanasi v. Respondents",
    "case_year": 1965,
    "court": "Supreme Court of India",
    "judges": [
      "Hegde, J."
    ],
    "case_number": "Civil Appeal No. 1040 of 1965",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "For the purpose of constructing the Babatpur aerodrome near Varanasi, the Government acquired in the year 1946 about 500 acres of land.",
      "type": "background",
      "date": "1946",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Compensation in respect of most of the lands acquired was settled by agreement. But in respect of the lands with which we are concerned in this appeal, 48.01 acres in extent, no settlement was arrived at.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The question of compensation in respect of those lands was referred to the arbitration of Shri S. B. Malik, District Judge, Varanasi, under cl. b of sub-s. 1 of s. 19 of the Defence of India Act, 1939.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "In view of s. 19(1)(e), the claimants were entitled to get as compensation the market value of those lands as on the date of acquisition.",
      "type": "legal",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Before the arbitrator as well as the High Court, the parties were agreed that on the material on the record, the market value in question had to be fixed either on the basis of the sale deeds produced by the claimants or by capitalising the annual profits accruing from those lands.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The arbitrator rejected the sale deeds produced before him. He adopted the method of capitalising the annual profits. On the question of annual profits also he rejected the evidence adduced on behalf of the claimants. He determined the same on the basis of the revenue records for Fasli 1355 read with the evidence of the Naib Tehsildar, Jawal Prasad.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "The arbitrator fixed the compensation at Rs. 26,454-12-0.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Aggrieved by the decision of the arbitrator, the claimants went up in appeal to the High Court of Allahabad under s. 19(1)(f).",
      "type": "procedural",
      "date": "1960",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "The High Court differed from the arbitrator as to the value to be attached to the sale deeds produced. It opined that the sale deeds produced were reliable and that they evidenced genuine transactions. The High Court fixed the compensation payable on the basis of Exh. A-42 dated 3-4-1951.",
      "type": "procedural",
      "date": "1963-11-11",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "The High Court enhanced the compensation to Rs. 90,446-3-0.",
      "type": "material",
      "date": "1963-11-11",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "The Collector of Varanasi filed this appeal after obtaining special leave from this Court under Art. 136.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "The arbitrator has found that after the close of the second world war, the price of landed property had gone up steeply.",
      "type": "background",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Under the deed Exh. A-42, the land sold was .26 acres in extent.",
      "type": "disputed",
      "date": "1951-04-03",
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Exh. 35 relates to the sale of land measuring .28 acres on 10-6-1947. The vendee under that deed is one of the claimants. There is no evidence as to the nature of the land sold under that deed.",
      "type": "disputed",
      "date": "1947-06-10",
      "source": "court"
    },
    {
      "id": "f15",
      "text": "The acquisitions in question were made in fasli 1354.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f16",
      "text": "Village papers of 1354 fasli were not produced by the appellant. On the other hand, the village papers of 1355 fasli were produced.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether special leave could be granted by this Court under Art. 136 against the judgment of the High Court under s. 19(1)(f) of the Defence of India Act, 1939, as the High Court was argued to be a persona designata and not a court or tribunal.",
      "framed_by": "respondent"
    },
    {
      "id": "i2",
      "text": "Whether the High Court erred in law in awarding compensation on the basis of Exh. A-42.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The High Court erred in law in awarding compensation on the basis of Exh. 42. The sale evidenced by that deed was effected in the year 1951, nearly five years after the acquisitions. The sale in question cannot be considered as a contemporaneous transaction. After the close of the second world war, the price of landed property had gone up steeply. The price fetched by such a tiny bit of land (.26 acres) is of no assistance.",
      "supporting_facts": [
        "f12",
        "f13"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Exh. 35 relates to a small plot (.28 acres), vendee is claimant, no evidence on nature of land.",
      "supporting_facts": [
        "f14"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "None of the sale deeds produced can afford any assistance as they do not evidence sales of lands similar to the acquired lands, at about the time of the acquisition.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": null
    },
    {
      "id": "pa4",
      "text": "The High Court did not address itself to the oral evidence for finding out the annual profits. Village papers of 1354 fasli not produced.",
      "supporting_facts": [
        "f6",
        "f15",
        "f16"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "No special leave could have been granted by this Court under Art. 136 as the judgment appealed against was neither that of a court nor of a tribunal. The High Court while acting under s. 19(1)(f) was a persona designata and not a court or a tribunal.",
      "supporting_facts": [],
      "legal_basis": "Defence of India Act, 1939 s.19(1)(b), (f); Hanskumar Kishanchand v. Union of India"
    },
    {
      "id": "ra2",
      "text": "Determine the compensation on the basis of sale deed Exh. 35 which relates to a sale that took place on 10-6-1947 which can be considered as a contemporaneous sale.",
      "supporting_facts": [
        "f14"
      ],
      "legal_basis": null
    },
    {
      "id": "ra3",
      "text": "In view of r. 2, O.13 of the Rules of this Court, this Court could not have granted special leave as the appellant had not applied for necessary certificate under Art. 133.",
      "supporting_facts": [],
      "legal_basis": "Art. 133 Constitution; Management of the Hindustan Commercial Bank Ltd. v. Bhagwan Dass"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The High Court while acting under s. 19(1)(f) functions as a court and not as a designated person. The appeal to the High Court is regulated by the practice and procedure of that court. Prima facie it appears incongruous to hold that the High Court is not a court.",
      "addresses_issue": "i1",
      "key_observation": "When a statute directs that an appeal shall lie to a court already established, then that appeal must be regulated by the practice and procedure of that court."
    },
    {
      "id": "cr2",
      "text": "Distinguished Hanskumar Kishanchand v. Union of India: That case held the decision is not a judgment/decree/final order under CPC for Art.133/109, but did not address Art.136. The observation that High Court is not a court under s.19(1)(f) is incorrect.",
      "addresses_issue": "i1",
      "key_observation": "The decisions relied on merely lay down that the decision given by the High Court in an appeal against an award is neither a decree, judgment or final order. None lays down that the High Court did not function as a court."
    },
    {
      "id": "cr3",
      "text": "Art.133 not attracted as per Hanskumar, so no need for certificate under O.13 r.2.",
      "addresses_issue": "i1",
      "key_observation": "Provisions of Art. 133 are not attracted."
    },
    {
      "id": "cr4",
      "text": "High Court was not right in determining compensation on basis of Exh.42. This Court should not scan evidence afresh; remit to High Court for fresh disposal.",
      "addresses_issue": "i2",
      "key_observation": "The sale in question cannot be considered as a contemporaneous transaction."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The decision rendered by the High Court under s. 19(1)(f) is a determination within Art.136; special leave maintainable. High Court functions as a court under that provision.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "High Court erred in relying solely on Exh.A-42 for compensation valuation.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Engineering Mazdoor Sabha v. Hind Cycles Ltd.",
      "citation": "1963 Supp. 1 S.C.R. 625",
      "treatment": "followed",
      "relevance": "High Court decision is a determination under Art.136"
    },
    {
      "case_name": "Hanskumar Kishanchand v. Union of India",
      "citation": "1959 S.C.R. 1177",
      "treatment": "distinguished",
      "relevance": "Held decision under s.19(1)(f) not judgment/decree for CPC appeal, but does not preclude Art.136; observation on High Court not court overruled"
    },
    {
      "case_name": "National Telephone Co. Ltd. v. Postmaster-General",
      "citation": "1913 A.C. 546",
      "treatment": "followed",
      "relevance": "Appeal to established court imports its procedure and right of appeal"
    },
    {
      "case_name": "National Sewing Thread Co. Ltd. v. James Chadwick and Bros. Ltd.",
      "citation": "1953 S.C.R. 1028",
      "treatment": "followed",
      "relevance": "Accepted National Telephone principle"
    },
    {
      "case_name": "Associated Cement Companies Ltd. v. P. N. Sharma",
      "citation": "1965 2 S.C.R. 366",
      "treatment": "referred",
      "relevance": "Definition of court as part of hierarchy invested with judicial powers"
    },
    {
      "case_name": "Secretary of State for India v. Chelikani Rama Rao",
      "citation": "43 I.A. 192",
      "treatment": "followed",
      "relevance": "High Court functions as court in appeals against awards"
    },
    {
      "case_name": "Management of Hindustan Commercial Bank Ltd. v. Bhagwan Dass",
      "citation": "1965 2 S.C.R. 265",
      "treatment": "distinguished",
      "relevance": "Art.133 certificate not required here"
    },
    {
      "case_name": "Rangoon Botatoung Co. v. Collector, Rangoon",
      "citation": "39 I.A. 197",
      "treatment": "distinguished",
      "relevance": "Decision in arbitration not judgment under CPC"
    }
  ],
  "statutes_cited": [
    {
      "name": "Defence of India Act, 1939",
      "sections": [
        "s. 19(1)(b)",
        "s. 19(1)(e)",
        "s. 19(1)(f)"
      ],
      "relevance": "Arbitration for land compensation; market value on acquisition date; appeal to High Court"
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 136",
        "Art. 133"
      ],
      "relevance": "Special leave to appeal; certificate for High Court appeals"
    },
    {
      "name": "Code of Civil Procedure",
      "sections": [
        "ss. 109",
        "ss. 110"
      ],
      "relevance": "Certificate for appeal to Federal Court (historical)"
    }
  ],
  "outcome": {
    "disposition": "partially_accepted",
    "summary": "Appeal allowed, High Court decision set aside, case remitted back to High Court for fresh disposal according to law, permitting parties to adduce additional evidence on compensation, particularly contemporaneous sale deeds and revenue records of Fasli 1354.",
    "relief_granted": "Remand to High Court for redetermination of compensation",
    "costs": "Costs of this appeal shall be costs in the cause"
  },
  "key_quotes": [
    {
      "text": "\"When a question is stated to be referred to an established Court without more, it, in my opinion, imports that the ordinary incidents of the procedure of that Court are to attach, and also that any general right of appeal from its decision likewise attaches.\"",
      "speaker": "court",
      "significance": "Establishes High Court procedure applies in s.19(1)(f) appeals, enabling Art.136"
    },
    {
      "text": "The High Court of a State is at the apex of the States judicial system. It is a court of record. It is difficult to think of a High Court as anything other than a court.",
      "speaker": "court",
      "significance": "Rejects view of High Court as persona designata under s.19(1)(f)"
    }
  ],
  "_case_id": "1967_347",
  "_label": 1,
  "_text_length": 21686,
  "_extracted_at": "2026-02-10T20:24:47.132956"
}