{
  "metadata": {
    "case_name": "Commissioner of Income-tax v. The Respondent Company",
    "case_year": 1966,
    "court": "Supreme Court of India",
    "judges": [
      "Shah, J."
    ],
    "case_number": "Civil Appeal No. 2162 of 1966",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "By an agreement dated October 29, 1928 Ciba India Ltd. (principals) appointed Tejaji Farasram Kharawalla selling agent for the District of Ahmedabad in respect of certain kinds of dyes and dyestuffs, and agreed to pay him commission at the rate of 12-1/2% on sales by him of dyes and dyestuffs of the principals. The commission was to include all charges in connection with the upkeep of offices and godown, turnover rebates and contingency expenses etc.",
      "type": "background",
      "date": "1928-10-29",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The terms relating to commission were modified by agreement dated August 20, 1935 and out of the commission agreed to be paid, 7.5% was to be treated as the selling commission and 5% was to be treated as compensation in lieu of the contingency expenses which the selling agent had to meet, such as commission to Dyeing Masters, agents etc.",
      "type": "material",
      "date": "1935-08-20",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The rights of the selling agent were assigned with the consent of the principals to the respondent Company with effect from October 27, 1947.",
      "type": "background",
      "date": "1947-10-27",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "In assessing the income of the Company for the assessment year 1949-50, the Income-tax Officer included in the taxable income Rs. 58,025/- being the difference between Rs. 1,90,538/- received by the Company as 5% commission and Rs. 1,32,512/- spent by the Company for meeting the charges which the selling agent was to meet.",
      "type": "material",
      "date": "1949-50",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The Income-tax Appellate Tribunal upheld the contention of the Company that in the computation of the income of the Company, the 5% commission was wholly exempt by virtue of S. 4(3)(vi) of the Income-tax Act, 1922.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "The Commissioner moved the Tribunal to draw up a statement of the case and to refer the question: Whether on the facts of the case, a portion viz. 5% of the selling agency commission of 12-1/2% received by the assessee company from Messrs. Ciba Ltd. in the course of carrying on the selling agency business is exempt from tax under s. 4(3)(vi) of the Act?",
      "type": "procedural",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f7",
      "text": "The Tribunal only referred the question: Whether the assessee company held an office or employment of profit within the meaning of s. 4(3)(vi) of the Indian Income-tax Act?",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "The High Court answered the referred question in the affirmative, observing that it had been conclusively determined by their earlier decision in Tejaji Farasram Kharawalla v. Commissioner of Income-tax, Bombay Mofussil (1948) 16 I.T.R. 260.",
      "type": "procedural",
      "date": "1963-09-06",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "The Commissioner appealed to the Supreme Court against the High Court's order answering affirmatively and dismissing the notice of motion.",
      "type": "procedural",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f10",
      "text": "The Supreme Court set aside the High Court's order dismissing the application, remanded the case directing the Tribunal to state a case on the question raised by the Commissioner, without expressing opinion on the referred question.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "The case was heard by the High Court of Gujarat (after transfer due to reorganisation of Bombay). The High Court held that the 5% commission represented a special allowance to meet expenditure such as commission to Dyeing Masters, agents etc., and was exempt from tax, and that the Company held an office or employment of profit.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "The Commissioner appealed again to the Supreme Court against the answers recorded by the Gujarat High Court.",
      "type": "procedural",
      "date": null,
      "source": "prosecution"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether a portion viz. 5% of the selling agency commission of 12-1/2% received by the assessee company from Messrs. Ciba Ltd. in the course of carrying on the selling agency business is exempt from tax under s. 4(3)(vi) of the Income-tax Act, 1922?",
      "framed_by": "prosecution"
    },
    {
      "id": "i2",
      "text": "Whether the assessee company held an office or employment of profit within the meaning of s. 4(3)(vi) of the Indian Income-tax Act, 1922?",
      "framed_by": "lower_court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The 5% commission is not wholly exempt; the surplus after meeting expenses (Rs. 58,025) is taxable income.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": "S. 4(3)(vi) of the Income-tax Act, 1922"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The 5% commission was wholly exempt by virtue of S. 4(3)(vi) of the Income-tax Act, 1922.",
      "supporting_facts": [
        "f2",
        "f4",
        "f5"
      ],
      "legal_basis": "S. 4(3)(vi) of the Income-tax Act, 1922; Tejaji Farasram Kharawalla v. C.I.T."
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Section 4(3)(vi) exempts any special allowance specifically granted to meet expenses wholly and necessarily incurred in the performance of the duties of an office or employment of profit. The allowance must be for expenses incurred or to be incurred wholly and necessarily in performance of duties.",
      "addresses_issue": "i1",
      "key_observation": "The purpose for which the allowance is granted is not alone determinative; any surplus remaining after meeting expenses does not bear the character of allowance but becomes additional remuneration taxable."
    },
    {
      "id": "cr2",
      "text": "Disagrees with Bombay High Court in Tejaji Farasram Kharawalla's case that once grant is for particular purpose, full exemption regardless of expenditure; key words require expenses wholly and necessarily incurred.",
      "addresses_issue": "i1",
      "key_observation": "Exemption operates only in respect of allowance to meet expenses actually incurred or to be incurred."
    },
    {
      "id": "cr3",
      "text": "Disagrees with Allahabad High Court in Sharma & Co. case; unexpended surplus is taxable; for periods longer than accounting year, allocate and tax difference between amount for year and actually expended.",
      "addresses_issue": "i1",
      "key_observation": "Income-tax Officer to determine amount for year of account."
    },
    {
      "id": "cr4",
      "text": "The selling agent holds an employment of profit under the agreement; no argument to contrary advanced.",
      "addresses_issue": "i2",
      "key_observation": "Unnecessary to consider if office."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "That portion of 5 per cent of the selling agency commission received by the assessee company is exempt under s. 4(3)(vi) of the Income-tax Act, 1922, which is wholly and necessarily incurred in the year of account in the performance of the duties of the company as selling agent.",
      "resolves_issue": "i1",
      "in_favor_of": "partial"
    },
    {
      "id": "h2",
      "text": "The assessee company holds an employment of profit within the meaning of s. 4(3)(vi).",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Tejaji Farasram Kharawalla v. Commissioner of Income-tax, Bombay Mofussil",
      "citation": "(1948) 16 I.T.R. 260",
      "treatment": "distinguished",
      "relevance": "Earlier decision holding full grant exempt regardless of actual expenditure; Supreme Court disagrees, holds surplus taxable."
    },
    {
      "case_name": "Commissioner of Income-tax, U. P. v. Sharma & Co.",
      "citation": "57 I.T.R. 470",
      "treatment": "distinguished",
      "relevance": "Allahabad HC upheld exemption on unexpended balance; Supreme Court disagrees, holds surplus taxable with allocation for accounting year."
    }
  ],
  "statutes_cited": [
    {
      "name": "Income-tax Act, 1922",
      "sections": [
        "Section 4(3)(vi)"
      ],
      "relevance": "Exempts special allowance granted to meet expenses wholly and necessarily incurred in performance of duties of office or employment of profit; only to extent actually incurred, surplus taxable."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "The appeal is allowed; the answer recorded by the High Court to the supplementary question is discharged, and the Supreme Court records that the 5% commission is exempt only to the extent wholly and necessarily incurred in the year of account.",
    "relief_granted": "Partial exemption for 5% commission to extent of expenses incurred in year of account",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "An allowance though made to a person holding an office or employment of profit intended for appropriation towards expenditure incurred or to be incurred in the discharge of the duties, does not constitute any real income of the grantee. It is in truth expenditure incurred by the employer through the agency of the grantee.",
      "speaker": "court",
      "significance": "Explains nature of exempt allowance as employer's expenditure via agent."
    },
    {
      "text": "any surplus remaining in the hands of the grantee after meeting the expenses does not bear the character of the allowance for meeting expenses but for performing the duties of the office or employment.",
      "speaker": "court",
      "significance": "Core holding that surplus is taxable as additional remuneration."
    },
    {
      "text": "The observations made by Chagla, C.J., at p. 267 that what is emphasized in this sub-clause S. 4(3)(vi) is the purpose of the grant... do not, in our judgment, give due effect to the key words to meet expenses wholly and necessarily incurred...",
      "speaker": "court",
      "significance": "Distinguishes Tejaji case on interpretation of exemption provision."
    }
  ],
  "_case_id": "1967_207",
  "_label": 1,
  "_text_length": 12910,
  "_extracted_at": "2026-02-10T20:22:11.204438"
}