{
  "metadata": {
    "case_name": "Commissioner of Income Tax v. M/s Alps Theatre",
    "case_year": 1966,
    "court": "Supreme Court of India",
    "judges": [
      "Sikri, J."
    ],
    "case_number": "Civil Appeal No. 26 of 1966",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The respondent, M/s Alps Theatre, hereinafter referred to as the assessee, carries on business as exhibitor of films.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The Income Tax Officer initiated proceedings under s. 34(1)(b) of the Indian Income Tax Act, 1922, on the ground that in the original assessment depreciation was allowed on the entire cost of Rs. 85,091/-, shown as cost of the building which included Rs. 12,000/- as cost of land.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The Income Tax Officer, by his order dated February 22, 1959, recomputed the depreciation, excluding cost of land.",
      "type": "procedural",
      "date": "1959-02-22",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The assessee appealed to the Appellate Assistant Commissioner, who upheld the order of the Income Tax Officer.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The assessee then appealed to the Appellate Tribunal which accepted the appeal.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Appellate Tribunal observed: 'You cannot conceive of a building without the land beneath it. It is not possible to conceive of a building without a bottom. What Section 10(2)(vi) of the Act says is that depreciation will be allowed on the building. The word building itself connotes the land upon which something has been constructed... The true meaning of the word building means the land upon which some construction has been made. The two must necessarily go together.'",
      "type": "admitted",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "At the instance of the Commissioner of Income Tax, the Appellate Tribunal, Delhi Bench C, referred the following question: 'Whether the cost of land is entitled to depreciation under the schedule to the Income-tax Act alongwith the cost of the building standing thereon?'",
      "type": "procedural",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f8",
      "text": "The High Court answered the question referred to it against the Department.",
      "type": "procedural",
      "date": "1964-10-28",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Mahajan, J., observed that in Section 10(2)(vi) of the Income Tax Act, a building is placed at par with machinery and furniture and is treated as a unit, and therefore for the purposes of depreciation a building cannot be split up into building material and land. He further observed that if the Legislature wanted to exclude land from the building for purposes of depreciation it could have said so. Moreover, depreciation is allowed on the capital. The capital here is a unit building. If later on it is sold and it fetches more than its written down value the surplus is liable to tax see in this connection Section 10(2)(vii) proviso. The crux of the matter is that the building is treated as a unit for purposes of depreciation or repair, and there is no warrant in the Act which would permit us to split the unit for the purposes of section 10.",
      "type": "reasoning",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Dua, J., in a concurring judgment, felt that the question was not free from difficulty, but he answered the question in favour of the assessee on the ground that much could be said for both points of view and the view in support of the assessee's submission had found favour with the Tribunal which had not been shown to be clearly erroneous.",
      "type": "reasoning",
      "date": null,
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the cost of land is entitled to depreciation under the schedule to the Income-tax Act alongwith the cost of the building standing thereon? This depends upon the true interpretation of S. 10(2)(vi), and in particular whether the word 'building' occurring in it includes land.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Building in S.10(2)(vi) does not include land, as evident from context of other sub-clauses (iv, v), depreciation definition (land does not depreciate), Income Tax Rules Schedule rates based on structure quality, and purpose of true income computation.",
      "supporting_facts": [
        "f2",
        "f3"
      ],
      "legal_basis": "Indian Income Tax Act, 1922 S.10(2)(iv), (v), (vi); Rule 8 of Indian Income Tax Rules, 1922"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Building cannot be conceived without land beneath it; word 'building' connotes land upon which construction is made; they must go together; building treated as unit at par with machinery/furniture, cannot be split; Legislature would have excluded land if intended; depreciation on capital unit.",
      "supporting_facts": [
        "f5",
        "f6",
        "f9"
      ],
      "legal_basis": "Indian Income Tax Act, 1922 S.10(2)(vi), S.10(2)(vii) proviso"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The word 'building' must have the same meaning in all sub-clauses of S.10(2). In sub-cls. (iv) and (v), 'building' clearly means structures and does not include site (no insurance/destruction/repairs for site). Depreciation means decrease in value through wear, etc.; land cannot depreciate.",
      "addresses_issue": "i1",
      "key_observation": "'Such buildings' refers back to buildings in prior clauses excluding site."
    },
    {
      "id": "cr2",
      "text": "Rule 8 Schedule prescribes depreciation rates for buildings based on class of structure (first class 2.5%, etc.), temporary erections as revenue; no rate for land, and illogical for land under inferior building to depreciate faster.",
      "addresses_issue": "i1",
      "key_observation": "Rates fixed on nature of structure, not land."
    },
    {
      "id": "cr3",
      "text": "Object of S.10 is true assessable income; depreciation allowable per accountancy and Act to reflect real income; land does not depreciate, allowing it would distort true income.",
      "addresses_issue": "i1",
      "key_observation": "Allowing land depreciation gives wrong picture of true income."
    },
    {
      "id": "cr4",
      "text": "High Court relied on Corporation of the City of Victoria v. Bishop of Vancouver Island, but distinguishable as it construed different statute on tax exemption for worship buildings including land.",
      "addresses_issue": "i1",
      "key_observation": "No assistance for meaning of 'buildings' in S.10(2)(vi)."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The word 'building' in S.10(2)(vi) does not include the land on which it stands; cost of land not entitled to depreciation.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Corporation of the City of Victoria v. Bishop of Vancouver Island",
      "citation": "[1912] 1 2 A.C. 384",
      "treatment": "distinguished",
      "relevance": "High Court relied on it but Supreme Court held distinguishable; construed different statute on municipal tax exemption including land under worship building."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income Tax Act, 1922",
      "sections": [
        "S. 34(1)(b)",
        "S. 10(2)(vi)",
        "S. 10(2)(iv)",
        "S. 10(2)(v)",
        "S. 10(2)(vii) proviso"
      ],
      "relevance": "Governs computation of profits after allowances including depreciation on buildings (excluding land); initiation of proceedings; capital asset sale surplus."
    },
    {
      "name": "Indian Income Tax Rules, 1922",
      "sections": [
        "Rule 8 Schedule"
      ],
      "relevance": "Prescribes depreciation rates for classes of buildings based on construction quality, supporting that 'building' means structure not including land."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "The Supreme Court allowed the appeal, answering the referred question in the negative: cost of land is not entitled to depreciation along with cost of building. High Court and Tribunal views reversed.",
    "relief_granted": "Depreciation recomputation excluding land cost upheld for Revenue.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "'You cannot conceive of a building without the land beneath it. It is not possible to conceive of a building without a bottom.'",
      "speaker": "lower_court",
      "significance": "Tribunal's reasoning favoring assessee, rejected by Supreme Court."
    },
    {
      "text": "Depreciation means 'a decrease in value of property through wear, deterioration, or obsolescence' - Webster's New World Dictionary. In that sense land cannot depreciate.",
      "speaker": "court",
      "significance": "Core reasoning why land excluded from depreciation."
    },
    {
      "text": "The whole object of s. 10 is to arrive at the assessable income of a business after allowing necessary expenditure and deductions... But land does not depreciate, and if depreciation was allowed it would give a wrong picture of the true income.",
      "speaker": "court",
      "significance": "Explains purpose of depreciation allowance."
    }
  ],
  "_case_id": "1967_334",
  "_label": 1,
  "_text_length": 8254,
  "_extracted_at": "2026-02-10T20:24:43.572435"
}