{
  "metadata": {
    "case_name": "Divisional Forest Officer, Sarahan Forest Division & Chief Conservator of Forests v. Smt. Besroo & Smt. Rupi",
    "case_year": 1965,
    "court": "Supreme Court of India",
    "judges": [
      "Sikri, J."
    ],
    "case_number": "Civil Appeal No. 128 of 1965",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Land measuring 27 bighas and 16 biswas comprised in khasra Nos. 452/1,453, 453/1, 40, 100 and 440 and situated in village Kadiali, Tehsil Theog, District Mahasu, belonged to Government and was under the tenancy of Moti Ram.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Moti Ram filed an application under s. 11 of the Himachal Pradesh Abolition of Big Landed Estates and Land Reforms Act, 1953 and was granted proprietary rights in the land by the Compensation Officer by order dated August 30, 1957. Provisional compensation was assessed at Rs. 62.56 nP.",
      "type": "material",
      "date": "1957-08-30",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Compensation Officer held that as the applicant is a cultivating tenant over the aforesaid land he is entitled to acquire right, title and interest of the said land-owner on payment of Rs. 62.56 as compensation which should be deposited.",
      "type": "material",
      "date": "1957-08-30",
      "source": "lower_court"
    },
    {
      "id": "f4",
      "text": "On September 9, 1957, a certificate of ownership was granted to Moti Ram on his depositing Rs. 62.56.",
      "type": "material",
      "date": "1957-09-09",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Moti Ram died and the land was mutated in favour of his wife Smt. Besroo and his daughter Smt. Rupi (respondents).",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Respondents applied for permission to sell the trees on their land, and the Divisional Forest Officer by order dated July 18, 1958, permitted them to sell the trees from their land on certain conditions.",
      "type": "material",
      "date": "1958-07-18",
      "source": "respondent"
    },
    {
      "id": "f7",
      "text": "On November 15, 1958, the respondents deposited Rs. 1267.13 nP as government fee, but the Divisional Forest Officer failed to give clear orders for felling the trees and taking out the converted timber from the said land.",
      "type": "material",
      "date": "1958-11-15",
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "The Chief Conservator of Forests, by letter dated July 12, 1961, informed the respondents that the matter was being inquired from the Conservator of Forests, Simla Circle.",
      "type": "procedural",
      "date": "1961-07-12",
      "source": "appellant"
    },
    {
      "id": "f9",
      "text": "Respondents filed a petition under Art. 226 of the Constitution before the Judicial Commissioner.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f10",
      "text": "Judgment and decree dated December 12, 1963 of the Judicial Commissioners Court, Himachal Pradesh, in Civil Writ Petition No. 19 of 1963, allowing the petition and issuing writ of mandamus directing appellants to issue permission for felling trees and transit pass.",
      "type": "procedural",
      "date": "1963-12-12",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Trees standing on the land transferred to Moti Ram under s. 11 of the Act are worth about Rs. 76,000.",
      "type": "disputed",
      "date": null,
      "source": "appellant"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether under s. 11 of the Himachal Pradesh Abolition of Big Landed Estates and Land Reforms Act, 1953, trees vest in the tenant as part of the right, title and interest of the land-owner in the land.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the Compensation Officer was competent to grant proprietary rights in the trees to Moti Ram.",
      "framed_by": "appellant"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Respondents had no interest in the trees standing on their land as the trees were not land as defined in s. 2(5) of the Act, and the Compensation Officer was not competent to grant, and did not grant proprietary rights in the trees to deceased Moti Ram.",
      "supporting_facts": [
        "f1",
        "f2",
        "f11"
      ],
      "legal_basis": "Himachal Pradesh Abolition of Big Landed Estates and Land Reforms Act, 1953 s.2(5), s.11"
    },
    {
      "id": "pa2",
      "text": "Trees are really forest trees and it was never the intention of the legislature to vest forest trees in the tenants acquiring land under s. 11 of the Act.",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": "Himachal Pradesh Abolition of Big Landed Estates and Land Reforms Act, 1953 s.11; s.84"
    },
    {
      "id": "pa3",
      "text": "Cases interpreting similar definition in Punjab Alienation of Land Act support that trees are not land.",
      "supporting_facts": [],
      "legal_basis": "Punjab Alienation of Land Act XIII of 1900 s.2(3)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Appellants were estopped from contending that respondents had no interest in the trees as permission was granted to sell trees, agreement entered with third party, and Rs.1267.13 deposited acting to their detriment.",
      "supporting_facts": [
        "f6",
        "f7"
      ],
      "legal_basis": "Vijay Kumari Thakur v. H. P. Administration AIR 1961 H. P. 32"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The expression 'right, title and interest of the land-owner in the land' under s.11 is wide enough to include trees standing on the land. Under s.8 of the Transfer of Property Act, transfer of land includes trees unless different intention expressed.",
      "addresses_issue": "i1",
      "key_observation": "Trees included within the expression right, title and interest of the land-owner in the land of the tenancy."
    },
    {
      "id": "cr2",
      "text": "Punjab and Lahore cases distinguishable as they dealt with whether trees could be sold under Punjab Alienation of Land Act without infringing prohibitions on sale of land by agriculturists to non-agriculturists.",
      "addresses_issue": "i1",
      "key_observation": "Trees capable of being transferred apart from land."
    },
    {
      "id": "cr3",
      "text": "No such contention raised in written statement that portion was natural forest; would lead to confusion if trees did not vest, interminable disputes over rights to cut trees.",
      "addresses_issue": "i1",
      "key_observation": "Under s.11(6) tenant becomes owner, right title interest of landowner determines; comprehensive."
    },
    {
      "id": "cr4",
      "text": "S.84 expressly vests trees in State upon vesting under s.83, but s.11 drafted simply; even cultivable land mentioned in s.84 would not vest if appellant's contention correct.",
      "addresses_issue": "i1",
      "key_observation": "Uphold Judicial Commissioner although for different reasons."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Under s.11 of the Act, trees vest in the tenant as part of right, title and interest of the land-owner in the land.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Vijay Kumari Thakur v. H. P. Administration",
      "citation": "AIR 1961 H. P. 32",
      "treatment": "followed",
      "relevance": "Judicial Commissioner followed for estoppel"
    },
    {
      "case_name": "Achhru Mal v. Maula Bakhsh",
      "citation": "1924 5 Lah. 385",
      "treatment": "distinguished",
      "relevance": "Dealt with sale of trees under Punjab Alienation of Land Act not infringing as sale of land"
    },
    {
      "case_name": "Nasib Singh v. Amin Chand",
      "citation": "AIR 1942 Lah. 152",
      "treatment": "distinguished",
      "relevance": "Suit for possession of trees not under Punjab Tenancy Act; trees transferable apart from land"
    },
    {
      "case_name": "Kaju Mal v. Salig Ram",
      "citation": "1919 Punj. Rec. 237",
      "treatment": "referred",
      "relevance": "Might differ if proved natural forest"
    }
  ],
  "statutes_cited": [
    {
      "name": "Himachal Pradesh Abolition of Big Landed Estates and Land Reforms Act, 1953",
      "sections": [
        "s.2(5)",
        "s.11",
        "s.15",
        "s.83",
        "s.84"
      ],
      "relevance": "Definition of land excludes trees from vesting? Trees vest under s.11 as part of land-owner's interest; s.84 vests trees in State upon notification under s.83"
    },
    {
      "name": "Transfer of Property Act",
      "sections": [
        "s.8"
      ],
      "relevance": "Transfer of land includes trees standing on it unless different intention"
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art.226"
      ],
      "relevance": "Writ petition filed under"
    },
    {
      "name": "Punjab Alienation of Land Act, 1900",
      "sections": [
        "s.2(3)"
      ],
      "relevance": "Similar definition of land interpreted in precedents"
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal against judgment of Judicial Commissioner allowing writ petition and issuing mandamus dismissed with costs; upheld that respondents entitled to proprietary rights in trees.",
    "relief_granted": "Writ of mandamus upheld directing appellants to issue permission for felling trees and transit pass",
    "costs": "Dismissed with costs"
  },
  "key_quotes": [
    {
      "text": "\"It seems to us that this expression right, title and interest of the land-owner in the land is wide enough to include trees standing on the land.\"",
      "speaker": "court",
      "significance": "Core holding on interpretation of s.11"
    },
    {
      "text": "\"It is clear that under s. 8 of the Transfer of Property Act, unless a different intention is expressed or implied, transfer of land would include trees standing on it.\"",
      "speaker": "court",
      "significance": "Analogy used for construing s.11"
    },
    {
      "text": "\"For the aforesaid reasons we must uphold the judgment of the Judicial Commissioner, although for different reasons.\"",
      "speaker": "court",
      "significance": "Supreme Court affirms lower court on different grounds"
    }
  ],
  "_case_id": "1967_86",
  "_label": 0,
  "_text_length": 10030,
  "_extracted_at": "2026-02-10T20:20:46.276253"
}