{
  "metadata": {
    "case_name": "Appellant-company v. State of Uttar Pradesh and Union of India",
    "case_year": 1966,
    "court": "Supreme Court of India",
    "judges": [
      "Shelat, J."
    ],
    "case_number": "Civil Appeal No. 1668 of 1966",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant-company filed suit No. 16 of 1963 against State of Uttar Pradesh and Union of India praying for permanent injunction restraining State, its servants and agents from realising sugarcane cess and purchase tax amounting to Rs. 33 lakhs and odd.",
      "type": "material",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f2",
      "text": "Taxes charged under U.P. Sugarcane Regulation of Supply and Purchase Act, 1953; Sugarcane Cess Act, 1956 read with U.P. Sugarcane Cess Validation Act, 1961; and U.P. Sugarcane Purchase Tax Act, IX of 1961.",
      "type": "material",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "Appellant-company alleged the Acts invalid and void for diverse reasons and thus State not entitled to levy, collect or recover the cess or purchase tax.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "Appellant-company paid court-fees on plaint under cl. b of sub-s. (iv-B) of S. 7 on footing that relief was injunction.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "Chief Inspector of Stamps objected, contending court-fees payable under sub-s. (iv)(a) or sub-s. (iv-A) of S. 7: as declaratory decree with consequential injunction or involving cancellation/adjudging void instrument securing money/property.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f6",
      "text": "Trial Judge rejected objections, held court-fees adequate as cl. b of sub-s. (iv-B) of S. 7 applied.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Chief Inspector filed revision before Allahabad High Court in Civil Revision No. 1095 of 1965.",
      "type": "procedural",
      "date": "1965-11-02",
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "High Court rejected contention that S. 7(iv)(a) applied but held sub-s. (iv-A) of S. 7 applied as Acts were instruments securing money; suit in substance involved adjudging Acts void though relief was injunction.",
      "type": "procedural",
      "date": "1965-11-02",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Appeal by special leave to Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether an Act passed by the Central or State Legislature can be said to be an 'instrument' and, if so, an instrument securing money or other property having such value within sub-s. (iv-A) of S. 7 Court-fees Act.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether plaint in substance is for declaratory decree with consequential injunction under sub-s. (iv)(a) of S. 7, even if form is injunction.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Acts are not instruments within sub-s. (iv-A) of S. 7; court-fees under cl. b sub-s. (iv-B) adequate as suit for injunction.",
      "supporting_facts": [
        "f4",
        "f6"
      ],
      "legal_basis": "Court-fees Act, S. 7(iv-A), (iv-B)(b)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Even if Acts not instruments, plaint in substance for declaratory decree with injunction as consequential relief, so sub-s. (iv)(a) applies; not merely cl. b sub-s. (iv-B).",
      "supporting_facts": [
        "f3",
        "f5",
        "f8"
      ],
      "legal_basis": "Court-fees Act, S. 7(iv)(a); Ramanbhai Ashabhai Patel v. Dabhi Ajitkumar Fulsinji"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Court-fees Act does not define 'instrument'; ordinary meaning is formal legal writing/document; statute is edict of legislature, not instrument unless specific context includes it.",
      "addresses_issue": "i1",
      "key_observation": "Acts of Legislature not instruments securing money under sub-s. (iv-A) S. 7."
    },
    {
      "id": "cr2",
      "text": "Distinguished statutory instruments (subordinate legislation) from statutes; cited dictionaries, Maxwell, precedents confirming statutes ordinarily not instruments.",
      "addresses_issue": "i1",
      "key_observation": "No need to decide if Acts secure money as not instruments."
    },
    {
      "id": "cr3",
      "text": "Plaint seeks injunction on footing Acts void, no prayer for declaration; mere consideration of validity in injunction suits does not make it declaratory under (iv)(a), else (iv-B)(b) superfluous.",
      "addresses_issue": "i2",
      "key_observation": "Substance is injunction, not declaration."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Acts not instruments under sub-s. (iv-A) S. 7; sub-s. (iv)(a) also not applicable; court-fees payable under cl. b sub-s. (iv-B) S. 7.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Suit for injunction, not declaratory decree with consequential relief.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Mohan Chowdhary v. The Chief Commissioner Tripura",
      "citation": "1964 3 SCR 442",
      "treatment": "followed",
      "relevance": "Approved meaning of 'instrument' as formal legal writing; President's Order under Art. 359 as instrument under General Clauses Act s.8(1), but distinguished statutes."
    },
    {
      "case_name": "Emperor v. Rayangouda Lingangouda Patil",
      "citation": "AIR 1944 Bom 259",
      "treatment": "followed",
      "relevance": "Instrument means formal legal writing but does not include Acts of Parliament unless statutorily defined."
    },
    {
      "case_name": "Ramanbhai Ashabhai Patel v. Dabhi Ajitkumar Fulsinji",
      "citation": "1965 1 SCR 712",
      "treatment": "referred",
      "relevance": "Supreme Court can decide all points on special leave even if not urged below."
    }
  ],
  "statutes_cited": [
    {
      "name": "Court-fees Act, 1870",
      "sections": [
        "S. 7(iv-A)",
        "S. 7(iv)(a)",
        "S. 7(iv-B)(b)"
      ],
      "relevance": "Determined applicable provision for court-fees on suit for injunction challenging validity of taxing Acts."
    },
    {
      "name": "U.P. Sugarcane Regulation of Supply and Purchase Act, 1953",
      "sections": [],
      "relevance": "One of Acts alleged void; subject of cess/purchase tax."
    },
    {
      "name": "U.P. Sugarcane Cess Act, 1956",
      "sections": [],
      "relevance": "Read with Validation Act; subject of challenged cess."
    },
    {
      "name": "U.P. Sugarcane Cess Validation Act, 1961",
      "sections": [],
      "relevance": "Validates cess under Cess Act."
    },
    {
      "name": "U.P. Sugarcane Purchase Tax Act, 1961",
      "sections": [],
      "relevance": "Subject of challenged purchase tax."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 359(1)"
      ],
      "relevance": "Cited in Mohan Chowdhary re President's Order as instrument."
    },
    {
      "name": "General Clauses Act, 1897",
      "sections": [
        "S. 8(1)"
      ],
      "relevance": "Meaning of 'instrument' includes formal writings but distinguished statutes."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; High Court order set aside; trial court order restored holding court-fees adequate under cl. b sub-s. (iv-B) S. 7.",
    "relief_granted": "Restoration of trial court's order on court-fees.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"The question which falls for determination is whether an Act passed by the Central or the State Legislature can be said to be an instrument and, if so, an instrument securing money or other property having such value.\"",
      "speaker": "court",
      "significance": "Frames core legal issue."
    },
    {
      "text": "\"That does not mean that a statute like the U.P. Court-fees Act which is an edict of the legislature is an instrument.\"",
      "speaker": "court",
      "key_observation": "Distinguishes statutes from instruments."
    },
    {
      "text": "\"It would not therefore be correct to say that the Acts alleged in the plaint to be void are instruments within the meaning of sub-s. (iv-A) of s. 7.\"",
      "speaker": "court",
      "significance": "Key holding on main issue."
    }
  ],
  "_case_id": "1967_142",
  "_label": 1,
  "_text_length": 11748,
  "_extracted_at": "2026-02-10T20:21:25.994162"
}