{
  "metadata": {
    "case_name": "Members of Rajasthan Judicial Service v. State of Rajasthan & Ors.",
    "case_year": 1966,
    "court": "Supreme Court of India",
    "judges": [
      "Shelat, J."
    ],
    "case_number": "Civil Appeal No. 93 of 1966",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "On May 9, 1955, the Rajpramukh of the then Part B State of Rajasthan, in exercise of the powers conferred by the proviso to Art. 309 of the Constitution, promulgated the Rajasthan Higher Judicial Service Rules, 1955.",
      "type": "background",
      "date": "1955-05-09",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "High Court of Rajasthan published a notice dated November 20, 1963, inviting applications for direct recruitment to four posts of Civil and Additional Sessions Judge.",
      "type": "procedural",
      "date": "1963-11-20",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Selection Committee, consisting of the Chief Justice, the Administrative Judge and another Judge nominated by the Chief Justice, scrutinized applications, conducted interviews, and selected four candidates for direct recruitment.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Selection Committee selected eligible candidates from amongst members of the Rajasthan Judicial Service for fourteen posts by promotion and prepared a list.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "High Court submitted the two lists prepared by the Selection Committee to the Governor for appointments.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Appellants, members of the Rajasthan Judicial Service, filed a writ petition in the High Court of Rajasthan (D. B. Writ Petition No. 803 of 1964) challenging the validity of the selections, lists, and appointments on the ground that they were in contravention of Art. 233.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "Rajasthan High Court dismissed the writ petition by judgment and order dated November 27, 1964, holding the Rules valid and proceedings valid.",
      "type": "procedural",
      "date": "1964-11-27",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Appeal to Supreme Court by certificate.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Rajasthan Government's letter dated December 8, 1962, under Rule 10, Governor fixed number of appointments as 18, 14 by promotion and 4 by direct recruitment, for period up to ending 1962.",
      "type": "procedural",
      "date": "1962-12-08",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Out of 18 posts determined by Governor, 9 vacancies were unfilled and included; on November 9, 1960, 9 Judicial Officers were confirmed in 9 posts, leaving 9 posts.",
      "type": "procedural",
      "date": "1960-11-09",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Notification dated June 2, 1950, Rajasthan Government appointed Civil Judges by virtue of their office to be Additional Sessions Judges with effect from July 1, 1950.",
      "type": "background",
      "date": "1950-06-02",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Respondents 6 and 7 were appointed as Civil Judges with additional powers of Additional Sessions Judge.",
      "type": "material",
      "date": null,
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "whether the Rajasthan Higher Judicial Service Rules, 1955 are ultra vires Art. 233 and, therefore, the selections made by the Selection Committee appointed thereunder and appointments made on the basis of such selections are invalid",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "if so, whether the appointments are validated by the Constitution (Twentieth Amendment) Act, 1966 which introduces Art. 233A in the Constitution",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "whether appointment to the post of a Civil and Additional Sessions Judge can be said to be one of a District Judge within Art. 236(a) for application of Art. 233A",
      "framed_by": "court"
    },
    {
      "id": "i4",
      "text": "whether appointments infringed Rules 10 and 24 of the Rajasthan Higher Judicial Service Rules by including unfilled vacancies in determination of number of appointments",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Rajasthan Higher Judicial Service Rules, 1955 invalid as they contravene Art. 233 by providing selection by Committee of three Judges instead of consultation with the High Court as a whole; High Court only transmitting authority.",
      "supporting_facts": [
        "f1",
        "f3",
        "f4",
        "f5"
      ],
      "legal_basis": "Art. 233; Chandra Mohan v. State of Uttar Pradesh"
    },
    {
      "id": "pa2",
      "text": "Appointments not validated by Art. 233A as Civil and Additional Sessions Judge not included in definition of District Judge under Art. 236(a); appointments as Civil Judges under Rajasthan Judicial Service Rules.",
      "supporting_facts": [
        "f12"
      ],
      "legal_basis": "Art. 233A, 236(a); Rajasthan Civil Courts Ordinance s.6,13; Rajasthan Judicial Service Rules"
    },
    {
      "id": "pa3",
      "text": "Governor's determination of 18 appointments under Rule 10 invalid as included past unfilled vacancies; prospective only; violated quota in Rule 24.",
      "supporting_facts": [
        "f9",
        "f10"
      ],
      "legal_basis": "Rajasthan Higher Judicial Service Rules 10, 24"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Solicitor-General conceded that Rajasthan Rules not distinguishable from U.P. Higher Judicial Service Rules held invalid in Chandra Mohan case.",
      "supporting_facts": [],
      "legal_basis": "Chandra Mohan v. State of Uttar Pradesh"
    },
    {
      "id": "ra2",
      "text": "Appointment as Civil and Additional Sessions Judge is appointment as Additional Sessions Judge under CrPC s.9, included in Art. 236(a) definition of District Judge; validated by Art. 233A.",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": "Art. 233A, 236(a); CrPC ss.6,7,9,36-39"
    },
    {
      "id": "ra3",
      "text": "Unfilled vacancies can be included in next recruitment under Rule 10; no violation.",
      "supporting_facts": [
        "f10"
      ],
      "legal_basis": "Rajasthan Higher Judicial Service Rules 6(3),10,24"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Rules invalid as selection by Committee of three Judges, not consultation with High Court as whole; High Court only transmits lists; inconsistent with Art. 233 mandate.",
      "addresses_issue": "i1",
      "key_observation": "Committee is not the High Court; consultation must be with High Court, not other authority."
    },
    {
      "id": "cr2",
      "text": "Followed Chandra Mohan v. State of UP; U.P. Rules similar/identical, held to contravene Art. 233; consultation empty formality.",
      "addresses_issue": "i1",
      "key_observation": "Constitutional mandate of Art. 233 conditioned on consultation with High Court."
    },
    {
      "id": "cr3",
      "text": "Civil and Additional Sessions Judge appointment is as Additional Sessions Judge under CrPC s.9; included in Art. 236(a) as District Judge; not clubbed with Civil Judge post under Art. 234.",
      "addresses_issue": "i2",
      "key_observation": "Appointment under CrPC s.9, not vesting additional powers on Civil Judge."
    },
    {
      "id": "cr4",
      "text": "Art. 233A validates appointments otherwise invalid for non-compliance with Art. 233; applies here.",
      "addresses_issue": "i2",
      "key_observation": "Appointments deemed not illegal/void by Art. 233A."
    },
    {
      "id": "cr5",
      "text": "Governor can include unfilled vacancies in Rule 10 determination; no violation of Rules 10,24; High Court adjusted to 9 posts, 2 direct.",
      "addresses_issue": "i4",
      "key_observation": "Unfilled posts remain vacancies for next recruitment; Rule 6(3) allows."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Rajasthan Higher Judicial Service Rules, 1955 ultra vires Art. 233; selections and proceedings invalid.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Appointments validated by Art. 233A as to posts of District Judge (including Additional Sessions Judge).",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "No infringement of Rules 10 and 24.",
      "resolves_issue": "i4",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Chandra Mohan v. State of Uttar Pradesh",
      "citation": "1967 1 S.C.R. 77",
      "treatment": "followed",
      "relevance": "U.P. Higher Judicial Service Rules similar to Rajasthan Rules; held ultra vires Art. 233; consultation must be with High Court, not committee."
    }
  ],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 233",
        "Art. 233A",
        "Art. 234",
        "Art. 236",
        "Art. 309",
        "Art. 124",
        "Art. 217",
        "Art. 222"
      ],
      "relevance": "Art. 233 mandates consultation with High Court for District Judge appointments; Rules contravene; 233A validates pre-amendment invalid appointments; 236 defines District Judge including Additional Sessions Judge."
    },
    {
      "name": "Rajasthan Higher Judicial Service Rules, 1955",
      "sections": [
        "Rule 1(2)",
        "Rule 6",
        "Rule 7",
        "Rule 10",
        "Rule 13",
        "Rule 17",
        "Rule 21",
        "Rule 22",
        "Rule 23",
        "Rule 24"
      ],
      "relevance": "Govern recruitment, selection by Committee, quotas; held invalid for lacking High Court consultation."
    },
    {
      "name": "Code of Criminal Procedure",
      "sections": [
        "s.6",
        "s.7",
        "s.9",
        "s.36",
        "s.37",
        "s.39"
      ],
      "relevance": "Appointment of Additional Sessions Judges under s.9; distinguishes from vesting powers on Magistrates."
    },
    {
      "name": "Rajasthan Civil Courts Ordinance, 1950",
      "sections": [
        "s.6",
        "s.13",
        "s.19"
      ],
      "relevance": "Categories of Civil Courts; Civil Judges distinct."
    },
    {
      "name": "Rajasthan Judicial Service Rules, 1955",
      "sections": [
        "Rule 4",
        "Rule 6"
      ],
      "relevance": "Govern lower judicial service; argued but held inapplicable."
    },
    {
      "name": "Bengal, Agra and Assam Civil Courts Act, 1887",
      "sections": [
        "s.3"
      ],
      "relevance": "Similar civil court hierarchy."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal dismissed; Rules held ultra vires Art. 233 but appointments validated by Art. 233A; contention on Rule 10,24 rejected; question of seniority of Respondents 6 and 7 left open.",
    "relief_granted": "None",
    "costs": "No order as to costs."
  },
  "key_quotes": [
    {
      "text": "This appeal, by certificate, raises two questions 1 whether the Rajasthan Higher Judicial Service Rules. 1955 are ultra vires Art. 233 and, therefore, the selections made by the Selection Committee appointed thereunder and appointments made on the basis of such selections are invalid, and 2 if so, whether the appointments are validated by the Constitution Twentieth Amendment Act, 1966 which introduces Art. 233A in the Constitution.",
      "speaker": "court",
      "significance": "Frames the core issues."
    },
    {
      "text": "The Constitutional mandate of Art. 233 is clear. The exercise of the power of appointment by the Governor is conditioned by his consultation with the High Court...",
      "speaker": "court",
      "significance": "Explains object and necessity of consultation with High Court from Chandra Mohan."
    },
    {
      "text": "The learned Solicitor-General who appeared for the State frankly conceded that it was not possible for him to distinguish these Rules from the U.P. Higher Judicial Service Rules and, therefore, the decision in Chandra Mohan's case would apply to the present Rules.",
      "speaker": "court",
      "significance": "Concession leading to holding Rules invalid."
    },
    {
      "text": "The appeal is, therefore, dismissed.",
      "speaker": "court",
      "significance": "Final disposition."
    }
  ],
  "_case_id": "1967_21",
  "_label": 0,
  "_text_length": 31565,
  "_extracted_at": "2026-02-10T20:20:08.259384"
}