{
  "metadata": {
    "case_name": "Heirs and legal representatives of Pritam Singh v. Sri Ram and Ram Prasad",
    "case_year": 1965,
    "court": "Supreme Court of India",
    "judges": [
      "Shah, J."
    ],
    "case_number": "Civil Appeal No. 34 of 1965",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "A piece of agricultural land bearing Survey Nos. 723/2, 724, 725 and 726 of Naugawan, tahsil Fatehabad, District Agra, originally belonged to two brothers Tota Ram and Lajja Ram.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Tota Ram and Lajja Ram were declared to be bhumidhars in respect of that land and a Sanad was issued in their favour under s. 7 of the U.P. Act 10 of 1949.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On October 20, 1951, Tota Ram and Lajja Ram sold their interest in the land to two brothers Sri Ram and Ram Prasad who will hereinafter be called the plaintiffs.",
      "type": "material",
      "date": "1951-10-20",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Disputes arose thereafter about the possession of the land between one Pritam Singh and the plaintiffs, and proceedings under s. 145 of the Code of Criminal Procedure were started before the Sub-Divisional Magistrate at the instance of Pritam Singh.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The Sub-Divisional Magistrate attached the land and called upon the parties to agitate the dispute as to their respective rights therein in a civil suit.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "The plaintiffs commenced an action in the Court of the Munsif, Fatehabad, against Pritam Singh and Tota Ram for a declaration of their rights as bhumidhars in possession of the land in suit and for an order expunging the name of Pritam Singh from the revenue records.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f7",
      "text": "Pritam Singh resisted the suit contending, inter alia, that the land was abandoned by Tota Ram and Lajja Ram and that since it was under his cultivation continuously since Fasli year 1356 (the year commencing from July 1, 1948 and ending on June 30, 1949) he had acquired the rights of an adhivasi in the land and he was not liable to be evicted from the same.",
      "type": "disputed",
      "date": "1948-07-01 to 1949-06-30",
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "The Munsif referred the following issue arising out of the pleadings to the Assistant Collector, Agra, for decision: Whether the defendant No. 1 (Pritam Singh) has acquired adhivasi rights, if so, its effect?",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "The Assistant Collector held that the revenue records did not show that Pritam Singh was in possession at any time in or before the end of 1359 Fasli and that the entries in the khasra relied upon by Pritam Singh had been fabricated to support his case.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Consistently with the finding of the Assistant Collector, the Munsif passed judgment in favour of the plaintiffs.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "In appeal to the District Court, Agra, that judgment was reversed. The Appellate Judge held that the revenue entries were genuine entries posted by the Patwari in discharge of his duty and that Pritam Singh was in possession in the year 1356 Fasli and also in 1359 Fasli and he had acquired the rights of an adhivasi.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "The plaintiffs then carried the dispute to the High Court of Allahabad. The High Court reversed the decree passed by the First Appellate Court and restored the decree of the Munsif.",
      "type": "procedural",
      "date": "1962-11-06",
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "With special leave, the heirs and legal representatives of Pritam Singh have appealed to this Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "In the certified extract of the khasra for 1356 Fasli (Ext. A1) tendered in evidence by Pritam Singh, in the column Name and caste of cultivator the entry is Tota Ram and others and in the column for remarks the entry is Pritam Singh s/o Pyarelal of Sankuri.",
      "type": "disputed",
      "date": "1948-07-01 to 1949-06-30",
      "source": "petitioner"
    },
    {
      "id": "f15",
      "text": "In the khasra Barahsala (consolidated khasra for 1347 to 1358 Fasli) Tota Ram and Lajja Ram are shown as persons cultivating the land and there is no record of the name of any sub-tenant on the land.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f16",
      "text": "Before the Assistant Collector two certified extracts of the khasra for 1356 Fasli in respect of the land in dispute were produced. In the certified extract Ext. A1 tendered by Pritam Singh his name was shown in the remarks column. In the certified extract tendered by the plaintiffs there was no such entry.",
      "type": "material",
      "date": "1948-07-01 to 1949-06-30",
      "source": "court"
    },
    {
      "id": "f17",
      "text": "Pritam Singh is recorded in the khasra of 1359 Fasli in the column for shikmi (sub-tenant) as without settlement of rent, and Tota Ram and Lajja Ram are entered as cultivators.",
      "type": "material",
      "date": "1949-07-01 to 1950-06-30",
      "source": "court"
    },
    {
      "id": "f18",
      "text": "In the khatauni for 1359 Fasli Pritam Singh is shown as cultivator for one year, without settlement of rent.",
      "type": "material",
      "date": "1949-07-01 to 1950-06-30",
      "source": "court"
    },
    {
      "id": "f19",
      "text": "There are similar entries in the khasra and khatauni for 1361 Fasli, and in 1362 Fasli the names of the plaintiffs are entered in the column of cultivator, and the name of Pritam Singh is shown in the column for shikmi.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f20",
      "text": "The land was at the date of the suit under attachment by the order of the Magistrate, Ist Class, Agra, in proceedings under s. 145 of the Code of Criminal Procedure, started by Pritam Singh, and the Magistrate had directed the parties to establish their possession or right to possession in a competent Civil Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f21",
      "text": "Pursuant to the order of the First Appellate Court Pritam Singh obtained possession from the Criminal Court and thereafter the plaintiffs amended the plaint with the leave of the High Court and a decree for possession was claimed.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f22",
      "text": "Banwari Lal, Naib Registrar examined on behalf of the plaintiffs had clearly stated that Pritam Singh was not in possession of the land prior to 1359 Fasli and that Tota Ram who was examined as a witness stated that Pritam Singh was not in possession of the land and he had not given the land to Pritam Singh on lease, and that he did not receive rent from Pritam Singh.",
      "type": "material",
      "date": null,
      "source": "respondent"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether Pritam Singh was recorded as an occupant in the khasra or khatauni of 1356 Fasli so as to acquire rights of an adhivasi under s. 20(b) of the U.P. Zamindari Abolition and Land Reforms Act 1 of 1951.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether Pritam Singh was in cultivatory possession of the land during 1359 Fasli so as to acquire rights of an adhivasi under s. 3 of the U.P. Land Reforms Supplementary Act 31 of 1952.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether the High Court had jurisdiction to grant a decree for possession to the plaintiffs.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Pritam Singh was in possession in the year 1356 Fasli and also in 1359 Fasli as per genuine revenue entries posted by the Patwari, and he had acquired the rights of an adhivasi.",
      "supporting_facts": [
        "f7",
        "f11",
        "f14",
        "f17"
      ],
      "legal_basis": "s. 20(b) of U.P. Zamindari Abolition and Land Reforms Act 1 of 1951; s. 3 of U.P. Land Reforms Supplementary Act 31 of 1952"
    },
    {
      "id": "pa2",
      "text": "The finding recorded by the First Appellate Court that Pritam Singh was in cultivatory possession in 1359 Fasli was binding upon the High Court in Second Appeal.",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "A suit for possession, even against a trespasser, could lie only in the Revenue Court and not in the Civil Court, and the High Court by allowing amendment of the plaint could not assume jurisdiction.",
      "supporting_facts": [
        "f6",
        "f21"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Revenue records did not show Pritam Singh in possession at any time in or before the end of 1359 Fasli and entries in khasra relied upon by Pritam Singh were fabricated.",
      "supporting_facts": [
        "f9",
        "f15",
        "f16",
        "f22"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Pritam Singh had no right to the land and was not in cultivatory possession.",
      "supporting_facts": [
        "f22"
      ],
      "legal_basis": "Explanation to s. 3 of U.P. Act 31 of 1952"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The entries on which reliance was placed by Pritam Singh do not support his case that he was recorded as an occupant in the khasra or khatauni of 1356 Fasli. His name was only in the remarks column, not as occupant or in red ink as Kabiz or sajhi per Land Records Manual para 87. Entries appear surreptitiously made, as khasra Barahsala shows Tota Ram and Lajja Ram cultivating till 1358 Fasli.",
      "addresses_issue": "i1",
      "key_observation": "Entry in remarks column does not qualify as recording as occupant under s. 20(b)."
    },
    {
      "id": "cr2",
      "text": "Under s. 3 of U.P. Act 31 of 1952, Pritam Singh must establish actual cultivatory possession during 1359 Fasli, which requires lawful right, not trespass. Revenue entries show him as shikmi without rent settlement, no contract or oral evidence of possession. Wrongful occupation is not cultivatory possession.",
      "addresses_issue": "i2",
      "key_observation": "Trespasser cannot claim rights against bhumidhar; followed Ram Krishna v. Bhagwan Baksh, disagreed with Nanhoo Mal v. Muloo."
    },
    {
      "id": "cr3",
      "text": "First Appellate Court's findings on possession ignored key evidence like differing khasra extracts, witness testimonies, and were based on misreading entries; not binding in second appeal.",
      "addresses_issue": "i2",
      "key_observation": "High Court could re-appraise evidence."
    },
    {
      "id": "cr4",
      "text": "High Court had jurisdiction to allow amendment for possession decree as original suit for declaration and injunction was proper under s.145 CrPC attachment; after Pritam obtained possession pendente lite, decree for possession avoids multiplicity of proceedings.",
      "addresses_issue": "i3",
      "key_observation": "Civil Court jurisdiction not displaced."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Pritam Singh could not claim adhivasi rights under s. 20(b) U.P. Act 1 of 1951 as not recorded as occupant in khasra/khatauni 1356 Fasli.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Pritam Singh not in cultivatory possession in 1359 Fasli under s. 3 U.P. Act 31 of 1952 as possession unlawful trespass.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "High Court justified in granting possession decree to plaintiffs.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Amba Prasad v. Abdul Noor Khan and Others",
      "citation": "1964 7 S.C.R. 800",
      "treatment": "followed",
      "relevance": "s. 20 of U.P. Act 1 of 1951 does not require proof of actual possession; accepts record in khasra/khatauni 1356 Fasli (cases of fraud apart)."
    },
    {
      "case_name": "Ram Krishna v. Bhagwan Baksh Singh",
      "citation": "1961 A.L.J. 301",
      "treatment": "followed",
      "relevance": "Person inducting himself by force not in cultivatory possession under s. 3 U.P. Act 31 of 1952."
    },
    {
      "case_name": "Nanhoo Mal v. Muloo and others",
      "citation": "I.L.R. 1963 All. 751",
      "treatment": "doubted",
      "relevance": "Wrong; occupation by wrongdoer without right is not cultivatory possession under s. 3 U.P. Act 31 of 1952."
    }
  ],
  "statutes_cited": [
    {
      "name": "U.P. Act 10 of 1949",
      "sections": [
        "s. 7"
      ],
      "relevance": "Sanad issued declaring Tota Ram and Lajja Ram as bhumidhars."
    },
    {
      "name": "Code of Criminal Procedure",
      "sections": [
        "s. 145"
      ],
      "relevance": "Proceedings initiated by Pritam Singh; land attached, parties directed to civil court."
    },
    {
      "name": "U.P. Zamindari Abolition and Land Reforms Act 1 of 1951",
      "sections": [
        "s. 20(b)",
        "s. 16",
        "s. 18 to 21",
        "s. 10(2)"
      ],
      "relevance": "Conferred adhivasi rights on persons recorded as occupants in 1356 Fasli khasra/khatauni; not applicable to Pritam Singh."
    },
    {
      "name": "U.P. Land Revenue Act, 1901",
      "sections": [
        "s. 28",
        "s. 33"
      ],
      "relevance": "Khasra/khatauni prepared thereunder relevant for s.20(b)."
    },
    {
      "name": "United Provinces Tenancy Amendment Act, 1947",
      "sections": [
        "s. 27(1)(c)"
      ],
      "relevance": "Mentioned in s.20 but not applicable."
    },
    {
      "name": "U.P. Land Reforms Supplementary Act 31 of 1952",
      "sections": [
        "s. 3"
      ],
      "relevance": "Granted adhivasi/asami rights to persons in cultivatory possession 1359 Fasli not covered under ss.18-21 of Act 1/1951; requires lawful possession, not trespass."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal is dismissed. The decree of the Allahabad High Court restoring the Munsif's decree in favour of the plaintiffs for declaration of title as bhumidhars, expunging Pritam Singh's name from records, and granting possession is affirmed.",
    "relief_granted": "Declaration of plaintiffs' rights as bhumidhars in possession; order expunging Pritam Singh from revenue records; decree for possession.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"cases of fraud apart, the entry in the record alone is relevant. But the entries on which reliance was placed by Pritam Singh do not support his case that he was recorded as an occupant\"",
      "speaker": "court",
      "significance": "Rejects claim under s.20(b) based on improper entry."
    },
    {
      "text": "\"A trespasser who has no right to be in possession by merely entering upon the land forcibly or surreptitiously cannot be said to be a person in cultivatory possession within the meaning of s. 3 of U.P. Act 31 of 1952.\"",
      "speaker": "court",
      "significance": "Defines cultivatory possession; rejects s.3 claim."
    },
    {
      "text": "\"we are unable to hold that it was intended by the Act to put a premium upon forcible occupation of land by lawless citizens.\"",
      "speaker": "court",
      "significance": "Policy against rewarding trespass."
    }
  ],
  "_case_id": "1967_71",
  "_label": 0,
  "_text_length": 20264,
  "_extracted_at": "2026-02-10T20:20:51.964527"
}