{
  "metadata": {
    "case_name": "Union of India v. Respondent",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "Shelat, J."
    ],
    "case_number": "Civil Appeal No. 957 of 1964",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Himachal Pradesh State legislature passed the Himachal Pradesh Abolition of Big Landed Estates and Land Reforms Act 1953 on June 17, 1953, brought into force with effect from January 26, 1955.",
      "type": "background",
      "date": "1953-06-17",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Validity of the Act successfully impugned in Shri Vinod Kumar v. State of Himachal Pradesh.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Parliament passed Validating Act, 56 of 1958, challenge rejected in Jadab Singh v. Himachal Pradesh Administration, Act remains valid.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On June 4, 1959, respondent made application under s.11 of the Act for acquiring proprietary rights in lands, claiming to be cultivating tenant of Union of India, produced Jamabandhi, paying Rs.35/5/- rent and Rs.23/8/- land revenue etc., willing to pay compensation.",
      "type": "material",
      "date": "1959-06-04",
      "source": "respondent"
    },
    {
      "id": "f5",
      "text": "On November 26, 1959, Forest Department on behalf of Union filed objections: application incompetent, lands part of protected forest, no landlord-tenant relationship, Union paramount owner, trees on lands, respondent mere lessee, revenue entries incorrect, no jurisdiction.",
      "type": "disputed",
      "date": "1959-11-26",
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "Compensation Officer held area not forest, no trees, respondent occupancy tenant per Jamabandhi, entitled to proprietary rights on paying Rs.76.40 np.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Forest Department appealed to District Judge, Mahasu, on ground Compensation Officer did not follow procedure, no reasonable opportunity; did not dispute respondent held lands as tenant of Government.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "On July 26, 1960, District Judge allowed appeal, remanded to Compensation Officer to raise proper issues and decide according to law.",
      "type": "procedural",
      "date": "1960-07-26",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Compensation Officer raised issues: trees on lands? lands part of forest? respondent tenant? impediment to proprietary rights? Held respondent tenant, no impediment, allowed application.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Union's appeal to District Judge failed; District Judge held respondent tenant of Union, Act applies to lands and Union.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Union filed Second Appeal to Judicial Commissioner: Act does not bind Union/State Govt, s.11 application cannot lie against Union for its lands.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f12",
      "text": "Judicial Commissioner, following Director of Rationing v. Corporation of Calcutta, held Act applies to Govt land by necessary implication via ss.11,15,27,54; dismissed appeal.",
      "type": "procedural",
      "date": "1963-01-12",
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Union filed appeal to Supreme Court after certificate under Art.133(1)(c); Court appointed amicus curiae Mr. D. Prem.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Lands assessed to land revenue per Jamabandhi.",
      "type": "admitted",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the Act binds the Union of India or State Government",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether respondent's application under s.11 could lie against the Union in respect of lands owned by it",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Scheme and object of Act shows legislature did not intend it to apply to Government or lands owned by Government.",
      "supporting_facts": [
        "f13"
      ],
      "legal_basis": "Provisions of the Act"
    },
    {
      "id": "pa2",
      "text": "Sections 11-27 provide three methods of transfer which suggest Act not intended for lands owned by Union/State.",
      "supporting_facts": [
        "f1",
        "f3"
      ],
      "legal_basis": "ss.11,15,27 of the Act"
    },
    {
      "id": "pa3",
      "text": "Sections 48 and 54 relevant to show exemption by implication.",
      "supporting_facts": [],
      "legal_basis": "ss.48,54 of the Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Respondent was tenant of Union per Jamabandhi, entitled to proprietary rights under s.11.",
      "supporting_facts": [
        "f4",
        "f14"
      ],
      "legal_basis": "s.11 of the Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Rule from Director of Rationing overruled per Supdt. Legal Remembrancer; now statutes apply to State unless expressly or by necessary implication exempted; no such exemption here.",
      "addresses_issue": "i1",
      "key_observation": "Normal construction: enactment applies to citizens and State unless excepted."
    },
    {
      "id": "cr2",
      "text": "Definitions under Act and Punjab Land Revenue Act include govt lands as estate, Union as landowner; respondent occupancy tenant.",
      "addresses_issue": "i2",
      "key_observation": "Land assessed to revenue is estate, Union landowner."
    },
    {
      "id": "cr3",
      "text": "Scheme ss.11-27 applies without distinction between State and citizens; object to abolish landlordism benefits all tenants including those of State.",
      "addresses_issue": "i1",
      "key_observation": "No discrimination; anomaly if State lands exempt."
    },
    {
      "id": "cr4",
      "text": "Judicial Commissioner's conclusion correct.",
      "addresses_issue": "i1",
      "key_observation": "Act binds Government by necessary implication."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "A statute applies to the State as much as to a citizen unless it expressly or by necessary implication exempts the State.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "The Act binds the Union; s.11 application competent against Union for its lands.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Shri Vinod Kumar v. State of Himachal Pradesh",
      "citation": "1959 Supp. 1 S.C.R. 160",
      "treatment": "referred",
      "relevance": "Impugned validity of the Act successfully"
    },
    {
      "case_name": "Jadab Singh v. Himachal Pradesh Administration",
      "citation": "1960 3 S.C.R. 755",
      "treatment": "followed",
      "relevance": "Rejected challenge to Validating Act"
    },
    {
      "case_name": "Director of Rationing v. Corporation of Calcutta",
      "citation": "1961 1 S.C.R. 158",
      "treatment": "distinguished",
      "relevance": "Majority held State not bound unless express/implied; followed by Judicial Commissioner but overruled"
    },
    {
      "case_name": "Province of Bombay v. Municipal Corp. of Bombay",
      "citation": "73 I.A. 271",
      "treatment": "referred",
      "relevance": "Pre-Constitution law on State immunity"
    },
    {
      "case_name": "Supdt. Legal Remembrancer, West Bengal v. State of West Bengal",
      "citation": "1967 2 S.C.R. 170",
      "treatment": "followed",
      "relevance": "Overruled Director of Rationing majority; State bound unless exempted"
    }
  ],
  "statutes_cited": [
    {
      "name": "Himachal Pradesh Abolition of Big Landed Estates and Land Reforms Act 1953",
      "sections": [
        "s.2(3)",
        "s.2(5)",
        "s.2(6)",
        "s.2(13)",
        "s.2(17)",
        "s.2(19)",
        "s.3",
        "s.4",
        "s.8",
        "s.9",
        "s.10",
        "s.11",
        "s.12",
        "s.13",
        "s.14",
        "s.15",
        "s.16",
        "s.17",
        "s.18",
        "s.27",
        "s.48",
        "s.54",
        "Sch.I",
        "Sch.II"
      ],
      "relevance": "Applies to acquire proprietary rights of landowners including Union; binds State; tenant entitled to apply under s.11"
    },
    {
      "name": "Validating Act 56 of 1958",
      "sections": [],
      "relevance": "Validated the Act after invalidation"
    },
    {
      "name": "Punjab Land Revenue Act 1887",
      "sections": [
        "s.3(1)",
        "s.3(2)",
        "s.3(?) for holding"
      ],
      "relevance": "Definitions of estate, landowner, holding; lands are estate, Union landowner"
    },
    {
      "name": "Punjab Tenancy Act 1887",
      "sections": [],
      "relevance": "Right of occupancy carried forward"
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art.133(1)(c)"
      ],
      "relevance": "Certificate for appeal"
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court dismissed the Union's appeal, holding that the Himachal Pradesh Abolition of Big Landed Estates and Land Reforms Act 1953 binds the Union of India and the respondent's application under s.11 was competent, affirming the orders of the lower courts granting proprietary rights to the respondent on payment of compensation.",
    "relief_granted": "Proprietary rights to respondent on payment of compensation",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "the normal construction, that an enactment applies to citizen as well as to the state unless it expressly or by necessary implication excepted the State from its operation",
      "speaker": "court",
      "significance": "Overrules old immunity rule; key holding on statutes binding State"
    },
    {
      "text": "the presumption would be that a law of which the avowed object is to free the tenant of landlordism and to ensure to him security of tenure would bind all landlords irrespective of whether such a landlord is an ordinary individual or the Union.",
      "speaker": "court",
      "significance": "Rejects exemption by implication given Act's object"
    }
  ],
  "_case_id": "1967_158",
  "_label": 0,
  "_text_length": 21542,
  "_extracted_at": "2026-02-10T20:22:11.872515"
}