{
  "metadata": {
    "case_name": "Commissioner of Income-tax v. Keshavji Morarji",
    "case_year": null,
    "court": "Supreme Court of India",
    "judges": [
      "Shah, J."
    ],
    "case_number": null,
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Keshavji, a resident of Bombay, has a son Jaysinh and three daughters Indumati, Kusum and Dipika, of whom Dipika was a minor in the relevant years.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Jaysinh has two infant children, Bipin and Kamla.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On June 14, 1952, Keshavji transferred a sum of Rs. 5 lakhs to his son Jaysinh.",
      "type": "material",
      "date": "1952-06-14",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On February 22, 1954, by a deed, Keshavji settled a sum of Rs. 4,41,000 in favour of his minor grand-children Bipin and Kamla.",
      "type": "material",
      "date": "1954-02-22",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "On the same day, February 22, 1954, Jaysinh by another deed settled a sum of Rs. 1,54,000 upon his three sisters Indumati, Kusum and Dipika.",
      "type": "material",
      "date": "1954-02-22",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "From the description in the two deeds of settlement, both settlors were residing in the same house.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "No explanation was given why Keshavji and Jaysinh executed the two deeds of settlement simultaneously.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "In assessment proceedings for 1955-56 and 1956-57, Income-tax Officer held that Keshavji indirectly transferred assets to his minor daughter Dipika and Jaysinh to his minor children under section 16(3)(a)(iv), directing assessment of Dipika's share in Keshavji's hands and Jaysinh's trust income in Jaysinh's hands.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Appellate Assistant Commissioner upheld ITO's view on nature of transactions but held only income related to minors' interest includible.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Income-tax Appellate Tribunal confirmed AAC's order, observing gifts mutually prompted, each providing consideration for the other, constituting indirect transfers.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "High Court answered second question in negative, declined first, holding simultaneous deeds do not justify inference of indirect transfers, citing C.M. Kothari (Madras).",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether, on the facts of the case, the provisions of section 16(3)(a)(iv) are applicable to the two trusts created by Keshavji Morarji and Jaysinh Keshavji both on February 22, 1954?",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether, on the facts and in the circumstances of the case, the creation of a trust by Keshavji in favour of his minor grand-children concurrently with the creation of a trust by Jaysinh in favour of Keshavji's daughters constitute indirect transfers of assets by Keshavji and Jaysinh to their respective children for the purpose of section 16(3)(a)(iv) of the Act?",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "High Court upset findings of fact by Tribunal and answered second question negatively relying on Madras High Court in C.M. Kothari v. CIT, which has been reversed by this Court.",
      "supporting_facts": [
        "f10",
        "f11"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Several circumstances beyond simultaneity: father-son relation, settlements to grand-children and sisters (one minor), same house, no explanation for simultaneity.",
      "supporting_facts": [
        "f1",
        "f2",
        "f4",
        "f5",
        "f6",
        "f7"
      ],
      "legal_basis": "Section 16(3)(a)(iv)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Simultaneous execution of deeds does not justify inference of indirect transfers; cross-gifts neither establish consideration nor mutuality.",
      "supporting_facts": [
        "f4",
        "f5"
      ],
      "legal_basis": "C.M. Kothari v. CIT (Madras High Court)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Tribunal's observations cryptic, did not refer to all material evidence; High Court inaccurate in stating only simultaneity relied on.",
      "addresses_issue": "i2",
      "key_observation": "Several other circumstances present: relation, beneficiaries, residence, no explanation."
    },
    {
      "id": "cr2",
      "text": "In CIT v. C.M. Kothari (SC), under s.16(3)(a)(iii), transfers interconnected and part of same transaction as device to evade section fall within it; no need for technical consideration; same considerations for s.16(3)(a)(iv).",
      "addresses_issue": "i2",
      "key_observation": "Circuitous method to evade tax implications catches indirect transfers."
    },
    {
      "id": "cr3",
      "text": "Tribunal and High Court did not examine evidence in light of true test from CIT v. C.M. Kothari.",
      "addresses_issue": "i2",
      "key_observation": "Material is whether transfers part of same transaction to evade section, not unreality or independent cross-transactions."
    },
    {
      "id": "cr4",
      "text": "Observations in L.G. Balakrishnan v. CIT do not correctly interpret s.16(3)(a)(iii) and (iv).",
      "addresses_issue": "i2",
      "key_observation": "Test is evasion intent via interconnected transfers."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "If transfers are inter-connected and parts of the same transaction adopted as device to evade section 16(3)(a)(iv), case falls within section.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "C.M. Kothari v. Commissioner of Income-tax",
      "citation": null,
      "treatment": "followed (reversal by SC)",
      "relevance": "High Court relied on Madras HC decision which was reversed; SC test for indirect transfers via chain/interconnected transactions."
    },
    {
      "case_name": "Commissioner of Income-tax v. C.M. Kothari",
      "citation": null,
      "treatment": "followed",
      "relevance": "Laid down test for s.16(3)(a)(iii): interconnected transfers as device to evade; applicable to s.16(3)(a)(iv)."
    },
    {
      "case_name": "L.G. Balakrishnan v. Commissioner of Income-tax",
      "citation": null,
      "treatment": "doubted",
      "relevance": "Madras HC observations on cross-transactions do not correctly interpret s.16(3)(a)(iii) and (iv)."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act, 1922",
      "sections": [
        "16(3)(a)(iv)",
        "66",
        "66(4)"
      ],
      "relevance": "Provisions on indirect transfers to minors; reference jurisdiction for statement of case."
    }
  ],
  "outcome": {
    "disposition": "remanded",
    "summary": "Appeal allowed; case remanded to High Court to call for Tribunal's statement of case under s.66(4) in light of tests in CIT v. C.M. Kothari, and dispose of reference accordingly.",
    "relief_granted": "Remand directions",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"The gifts by the father and son on February 22, 1954, have been mutually prompted so that it is impossible to escape the conclusion that each of the so-called gifts had provided the consideration for the other.\"",
      "speaker": "court",
      "significance": "Tribunal's finding on mutual prompting of transactions."
    },
    {
      "text": "\"If the two transfers are inter-connected and are parts of the same transaction in such a way that it can be said that the circuitous method has been adopted as a device to evade implications of this section, the case will fall within the section.\"",
      "speaker": "court",
      "significance": "Key test from CIT v. C.M. Kothari applied to s.16(3)(a)(iv)."
    }
  ],
  "_case_id": "1967_124",
  "_label": 1,
  "_text_length": 9064,
  "_extracted_at": "2026-02-10T20:21:18.700135"
}