{
  "metadata": {
    "case_name": "East India Industries Limited v. Commissioner of Income-tax",
    "case_year": 1966,
    "court": "Supreme Court of India",
    "judges": [
      "Ramaswami, J."
    ],
    "case_number": "Civil Appeal No. 1399 of 1966",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The assessee, the East India Industries Limited, paid a donation of Rs. 7,500 to a trust called the Agastyar Trust and claimed exemption from tax under S. 15-B of the Income-tax Act, 1922.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The trust had been created by the partners of a business firm, K. Rajagopal and Company, carrying on business in Waste paper. Under the terms of the partnership it was setting apart 80 per cent of the profits for charitable and religious purposes.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On July 1, 1944, a trust deed was executed by Venkatarama Chetti.",
      "type": "background",
      "date": "1944-07-01",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The claim of the assessee to exemption from tax was rejected by the Income Tax Officer on the ground that the trust did not fulfil the conditions laid down under S. 15-B of the Act.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The Appellate Assistant Commissioner took the same view.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The Income-tax Appellate Tribunal observed that in relation to the previous assessment year, it had held that the Agastyar Trust was a public trust and that any donation made to that trust was an allowable deduction under s. 15-B.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "At the instance of the Commissioner of Income-tax the Tribunal referred the following question of law for the determination of the High Court under s. 66(1) of the Act: Whether on the facts and in the circumstances of the case the assessee is entitled to claim deduction under Section 15-B in respect of the donation paid to the Agastyar Trust?",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "The Madras High Court answered the question against the assessee by judgment dated October 25, 1961 in T.C. No. 62 of 1958 (Reference No. 37 of 1958).",
      "type": "procedural",
      "date": "1961-10-25",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Paragraph 2 of the trust deed dated July 1, 1944 sets out the objects of the Agastyar Trust, including: (a) to establish, conduct and maintain residential schools, colleges, workshops etc.; (b) pecuniary grants to students; (c) hospitals, clinics etc.; (d) to manufacture, buy, sell and distribute pharmaceutical, medicinal, chemical preparations etc.; (e) choultries, rest-houses, aid to poor; (f) research in Nadis; (g) promote study of religion; (h) print, publish literature, conduct worship; (j) other incidental things.",
      "type": "material",
      "date": "1944-07-01",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Clause 5(i) of the trust deed states that the trustee shall have power to apply the whole or any part of the trust property or fund whether capital or income in or towards payment of the expenses of the trust or for or towards all or any of the purposes of the trust provided any property or money held in special trust shall be applied only for that purpose and not otherwise. There is no special trust.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "The last clause of para 2 of the trust deed states that the objects shall be independent of each other, notwithstanding that any of the objects shall be void for any reason whatsoever, the trust shall be valid and operative with respect to the other objects. Trustees have discretion to apply property to all or any objects.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "For the assessment year 1955-56, the Tribunal in its order dated July 27, 1957 held that the Agastyar Trust was a public trust and donation allowable under Section 15-B.",
      "type": "procedural",
      "date": "1957-07-27",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether on the facts and in the circumstances of the case the assessee is entitled to claim deduction under Section 15-B in respect of the donation paid to the Agastyar Trust?",
      "framed_by": "tribunal"
    },
    {
      "id": "i2",
      "text": "Whether the property from which the income of the Agastyar trust is derived is held under trust or other legal obligation wholly for religious or charitable purposes within the meaning of S. 4(3)(i) of the Act.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether the High Court had jurisdiction to examine whether the Agastyar trust was held for a wholly religious or charitable purpose under s. 4(3)(i) of the Act.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Item 4 (manufacture, buy, sell pharmaceutical etc.) must not be read isolated but having regard to preceding object (hospitals), it must be deemed for purpose of running hospitals and dispensaries.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Cl. 2(c) is dominant object and cl. 2(d) is subsidiary.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "High Court had no jurisdiction to go into whether trust wholly religious or charitable under s. 4(3)(i); scope confined to whether income from business exempt under s. 4(3)(i)(b).",
      "supporting_facts": [
        "f6",
        "f7",
        "f12"
      ],
      "legal_basis": "S. 66(1) of the Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The trust did not fulfil the conditions laid down under S. 15-B of the Act.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": "S. 15-B, S. 4(3)(i)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Item No. 4 of objects (manufacture, buy, sell pharmaceutical etc.) is not for charitable or religious purposes. Trustees can utilise entire income for this object to exclusion of others, as no special trust and cl. 5(i) allows application to any purpose.",
      "addresses_issue": "i1",
      "key_observation": "Trust property not held wholly for religious or charitable purposes under S. 4(3)(i)."
    },
    {
      "id": "cr2",
      "text": "No connection between item 2(c) (hospitals) and 2(d); objects independent per last clause of para 2; trustees have absolute power of selection between charitable and non-charitable objects.",
      "addresses_issue": "i1",
      "key_observation": "Cannot apply S. 15-B exemption."
    },
    {
      "id": "cr3",
      "text": "High Court within jurisdiction; question whether trust income exempt under S. 4(3)(i) was before Tribunal, as AAC dealt with it and Tribunal referred relying on prior order.",
      "addresses_issue": "i3",
      "key_observation": "Even if not raised explicitly, if Tribunal deals with it, arises from order."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Agastyar trust does not fulfil conditions of s. 4(3)(i) due to non-charitable object (para 2(d)) and trustees' discretion to apply income wholly thereto; no exemption under s. 15-B.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "High Court rightly answered question against assessee and within jurisdiction.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Mohammad Ibrahim Riza v. Commissioner of Income-tax, Nagpur",
      "citation": "57 I.A. 260",
      "treatment": "followed",
      "relevance": "If several objects some charitable some not, and trustees have unfettered discretion, whole trust fails and no part exempt."
    },
    {
      "case_name": "Oxford Group v. Inland Revenue Commissioners",
      "citation": "1949 2 All. E.R. 537",
      "treatment": "followed",
      "relevance": "Objects extending beyond religious to secular non-charitable activities prevent exemption; wide powers not ancillary."
    },
    {
      "case_name": "Keren Kayemeth Le Jisroel, Ltd. v. Inland Revenue Comrs.",
      "citation": "17 T.C. 27",
      "treatment": "followed",
      "relevance": "Memorandum must be confined to charitable purposes; extensive powers allow non-charitable application."
    },
    {
      "case_name": "Commissioner of Income-tax, Bombay v. Scindia Steam Navigation Co. Ltd.",
      "citation": null,
      "treatment": "followed",
      "relevance": "High Court jurisdiction under S.66(1): if Tribunal deals with question, it arises from order even if not raised."
    }
  ],
  "statutes_cited": [
    {
      "name": "Income-tax Act, 1922",
      "sections": [
        "S. 15-B",
        "S. 4(3)(i)",
        "S. 66(1)"
      ],
      "relevance": "S.15-B allows deduction for donations to institutions whose income exempt under S.4(3)(i); reference under S.66(1)."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court dismissed the appeal by special leave, holding that the High Court rightly answered the referred question against the assessee, as the Agastyar Trust does not qualify for exemption under S.15-B due to presence of non-charitable object and trustees' discretion.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "if item 4 is not charitable, then the conditions envisaged by S. 4(3)(i) of the Act are not fulfilled and the exemption conferred by s.15-B of the Act cannot be applied.",
      "speaker": "court",
      "significance": "Core reasoning on non-charitable object disqualifying trust."
    },
    {
      "text": "the trustees have been expressly granted the discretion to apply the income of the trust wholly to a non-charitable object to the exclusion of charitable objects.",
      "addresses_issue": "i1",
      "key_observation": "Absolute discretion prevents 'wholly' charitable holding."
    },
    {
      "text": "The instrument... must be confined to those purposes so that any application by the company of its funds to non-charitable purposes would be ultra vires.",
      "speaker": "court",
      "significance": "Quote from Keren Kayemeth explaining requirement for exemption."
    }
  ],
  "_case_id": "1967_129",
  "_label": 0,
  "_text_length": 19532,
  "_extracted_at": "2026-02-10T20:21:22.395453"
}