{
  "metadata": {
    "case_name": "Commissioner of Income-tax v. Assessees",
    "case_year": null,
    "court": "Supreme Court of India",
    "judges": [
      "Shah, J."
    ],
    "case_number": null,
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The respondents (assessees) were carrying on the business of plying motor buses and lorries on diverse routes in the State of Madras and in the former Travancore State.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "In proceedings for assessment to income-tax for the years 1946-47 and 1947-48 and for excess profits tax for the accounting periods August 17, 1944, to August 16, 1945, and August 17, 1945 to March 31, 1946, the assessing officer rejected the books of account maintained by the assessees and made several additions to the profits disclosed by them.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The orders of the assessing officer were confirmed by the Appellate Assistant Commissioner.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The Appellate Tribunal dismissed the appeals against those orders observing that the final computation of the profits made by the Income-tax Officer gave an average rate very much less than Rs. 4,000 per vehicle, and that the final assessments at rates less than the rates uniformly followed in other bus and lorry cases could not be said to be excessive or unreasonable.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The Tribunal declined to deal with the contentions raised in the appeal about the individual items since in their view those contentions had a direct bearing on the final quantum and the assessees had failed to discharge the primary onus on them to show that the overall quantum is excessive.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The Tribunal submitted a statement of the case under section 66(2) of the Indian Income-tax Act to the High Court of Madras and referred the question whether the Tribunal was justified in estimating the income of the assessees and refusing to consider the contentions put forward by them.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "The High Court held that the Tribunal was bound to determine whether the purchase price of charcoal and the estimate of gross receipts by the Appellate Assistant Commissioner were excessive, and that the Tribunal should, instead of determining whether the gross amount of the estimated income was excessive, have determined the contention raised by the assessees individually.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Counsel for the assessees urged before the High Court that when specific additions were made in the total profits on the grounds of suppressed income and inflated expenditure the Appellate Assistant Commissioner could not add other items under the head Unexplained cash credits.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f9",
      "text": "The High Court declined to pronounce their opinion on that contention, and observed that it would be open to the Tribunal to consider that contention in deciding what should be the assessee in the relevant years.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "The High Court answered the question referred in favour of the assessees and observed that the appeals will have to be disposed of afresh and in accordance with the law by the Tribunal.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "At the hearing before the Tribunal pursuant to the order of the High Court, counsel for the assessees abandoned the contentions relating to the amount adjusted in the computation of profits under the heads of operating expenses and additions for low collections and urged that cash credit of Rs. 19,796 for the assessment year 1946-47 and Rs. 32,700 for the assessment year 1947-48 should be deleted.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f12",
      "text": "The members of the Tribunal held that they had examined the ledger accounts of the assessee and that the credits remaining outstanding till the end of the previous year relating to the assessment year 1947-48 and the explanation furnished by the assessees was unconvincing and that the cash credits deserved to be treated as the income of the assessees in the respective years in which they had been brought into the books of the business in fictitious names.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "The Tribunal observed, since in each of the two years under appeal additions to the book profits had been accepted in excess of the amounts of cash credits additions of these credits had become redundant and amend the assessments and adjust the tax liability.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "The Commissioner of Income-tax thereafter applied to the Tribunal to state a case on the following two questions for the year 1946-47: Whether on the facts and in the circumstances of the case, the Tribunal was right in law in deleting the addition to the extent of Rs. 19,796 in the assessment? Whether the Tribunal is right in law in making out a new case, for the assessee inconsistent with the assessees own plea and interfering with the assessment?",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f15",
      "text": "In respect of the year 1947-48 the Commissioner applied for a reference on two similar questions, the amount of addition challenged by the first question being Rs. 32,700.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f16",
      "text": "The Tribunal rejected the applications observing that the finding of the Tribunal was given on the directions of the High Court, and it was finding on a question of fact and gave rise to no questions of law.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f17",
      "text": "Petitions under section 66(2) of the Income-tax Act by the Commissioner to the High Court of Madras were also dismissed.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f18",
      "text": "The Commissioner has appealed to this Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether on the facts and in the circumstances of the case, the Tribunal was right in law in deleting the addition to the extent of Rs. 19,796 in the assessment for 1946-47?",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether the Tribunal is right in law in making out a new case, for the assessee inconsistent with the assessees own plea and interfering with the assessment?",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Similar questions for 1947-48 with addition of Rs. 32,700.",
      "framed_by": "petitioner"
    },
    {
      "id": "i4",
      "text": "Whether the Tribunal was justified in estimating the income of the assessees and refusing to consider the contentions put forward by them.",
      "framed_by": "lower_court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The Tribunal was not right in deleting the cash credit additions as they deserved to be treated as income.",
      "supporting_facts": [
        "f12",
        "f13"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "The Tribunal made out a new case inconsistent with the assessee's own plea by holding cash credits represented withheld business income.",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "The findings give rise to questions of law warranting reference under section 66(2).",
      "supporting_facts": [
        "f14",
        "f15"
      ],
      "legal_basis": "Section 66(2) of the Indian Income-tax Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Cash credit of Rs. 19,796 for 1946-47 and Rs. 32,700 for 1947-48 should be deleted.",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "When specific additions were made for suppressed income and inflated expenditure, could not add other items under unexplained cash credits.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "In hearing an appeal the Tribunal may give leave to the assessee to urge grounds not set forth in the memorandum of appeal, and in deciding the appeal the Tribunal is not restricted to the grounds set forth in the memorandum of appeal or taken by leave of the Tribunal.",
      "addresses_issue": "i2",
      "key_observation": "The Tribunal was competent to allow the assessees to raise the contention relating to the cash credits."
    },
    {
      "id": "cr2",
      "text": "It cannot be said that in accepting the contention of the assessees that the cash credits represented income from the business withheld from the books, the Tribunal made out a new case inconsistent with the assessees own plea.",
      "addresses_issue": "i2",
      "key_observation": "Tribunal did not make out a new case."
    },
    {
      "id": "cr3",
      "text": "In any event the Tribunal is not precluded from adjusting the tax liability of the assessee in the light of its findings merely because the findings are inconsistent with the case pleaded by the assessee.",
      "addresses_issue": "i2",
      "key_observation": "Tribunal can adjust tax liability based on findings."
    },
    {
      "id": "cr4",
      "text": "The first question raised in the application for reference is a question of fact. There is no direct evidence of any connection between the cash credit entries and the income withheld from the books of account by the assessees. But if the Tribunal inferred that there was a connection between the profits withheld from the books and the cash credit entries, it cannot be said that the conclusion is based upon speculation.",
      "addresses_issue": "i1",
      "key_observation": "Inference of connection is a question of fact, not referable under section 66."
    },
    {
      "id": "cr5",
      "text": "The second question may apparently be a question of law, but the Tribunal should not be called upon to submit a statement of case on a question which has become academic.",
      "addresses_issue": "i2",
      "key_observation": "Second question is academic."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The Tribunal was competent to consider the cash credits contention even if not originally raised.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "The Tribunal did not make out a new case inconsistent with assessee's plea.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "The question of deleting cash credit additions is a question of fact not referable under section 66.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h4",
      "text": "The second question is academic.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act",
      "sections": [
        "66(2)"
      ],
      "relevance": "Reference to High Court; Tribunal's power to state case; petitions dismissed"
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeals by the Commissioner are dismissed as the questions sought to be referred are either questions of fact or academic, and the Tribunal acted within its competence.",
    "relief_granted": "None to petitioner; status quo on Tribunal's order upheld",
    "costs": "Dismissed with costs"
  },
  "key_quotes": [
    {
      "text": "The first question raised in the application for reference is a question of fact... it cannot be said that the conclusion is based upon speculation.",
      "speaker": "court",
      "significance": "Holds deletion of cash credits as factual finding not referable"
    },
    {
      "text": "The appeals therefore fail and are dismissed with costs.",
      "speaker": "court",
      "significance": "Final disposition of the appeals"
    }
  ],
  "_case_id": "1967_307",
  "_label": 0,
  "_text_length": 6814,
  "_extracted_at": "2026-02-10T20:24:00.050359"
}