{
  "metadata": {
    "case_name": "Appellant (Tenant) v. Respondent (Landlord)",
    "case_year": 1966,
    "court": "Supreme Court of India",
    "judges": [
      "Wanchoo, J"
    ],
    "case_number": "Civil Appeal No. 1938 of 1966",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The respondent filed a suit against the appellant for eviction from a shop which the appellant had taken on monthly rent from the respondent.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The suit was filed after permission had been obtained under the U.P. Temporary Control of Rent and Eviction Act, No. III of 1947, from the court of the Munsif in Jhansi.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Appellant contested the suit, raising that permission to sue was granted at a time when there was a stay order, so the Magistrate granting permission had no jurisdiction and permission was a nullity; suit cannot continue without valid permission.",
      "type": "disputed",
      "date": null,
      "source": "appellant"
    },
    {
      "id": "f4",
      "text": "The Munsif dismissed the suit.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "Respondent appealed; appeal court upheld Munsif's order, viewing permission granted after stay as nullity.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "Respondent filed second appeal to Allahabad High Court; only point considered was whether permission was nullity.",
      "type": "procedural",
      "date": "1966-04-20",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Stay order passed by District Magistrate on September 29, 1961, on appellant's transfer application of permission proceedings from Sri Nigam, Magistrate 1st Class.",
      "type": "procedural",
      "date": "1961-09-29",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Stay order not communicated to Magistrate by District Magistrate's office; appellant did not inform Magistrate.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Magistrate granted permission on October 4, 1961, without knowledge of stay order.",
      "type": "procedural",
      "date": "1961-10-04",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Allahabad High Court held stay order could not take away Magistrate's jurisdiction from moment passed; since no knowledge on Oct 4, permission with jurisdiction; suit maintainable; allowed appeal, granted decree for ejectment and rent to respondent.",
      "type": "procedural",
      "date": "1966-04-20",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Appellant obtained special leave from Supreme Court due to conflict of opinion between High Courts.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Later, District Magistrate dismissed the transfer petition.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Appellant never informed Magistrate of stay or applied to set aside permission.",
      "type": "background",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the permission granted by the Magistrate on October 4, 1961, after a stay order on September 29, 1961, but without knowledge of the stay order, is a nullity, depriving the Magistrate of jurisdiction.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Permission granted after stay order was passed is a nullity as Magistrate lost jurisdiction from moment stay passed; knowledge immaterial.",
      "supporting_facts": [
        "f3",
        "f7",
        "f9"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Permission valid as Magistrate had no knowledge of stay order; stay does not automatically deprive jurisdiction without communication.",
      "supporting_facts": [
        "f8",
        "f9"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Stay order is prohibitory, addressed to court/authority; does not take away jurisdiction until comes to its knowledge; Magistrate had no knowledge, so permission valid.",
      "addresses_issue": "i1",
      "key_observation": "Stay order prohibits but jurisdiction continues until knowledge; differs from quashing order."
    },
    {
      "id": "cr2",
      "text": "Executing court can use S. 151 CPC to set aside interim proceedings done in ignorance if justice requires, but appellant never applied.",
      "addresses_issue": "i1",
      "key_observation": "Interim proceedings not nullity absent such application."
    },
    {
      "id": "cr3",
      "text": "Applies more strongly to transfer proceedings; superior authority cannot deprive inferior's jurisdiction without apprising it.",
      "addresses_issue": "i1",
      "key_observation": "Stay never brought to Magistrate's notice; transfer petition dismissed later."
    },
    {
      "id": "cr4",
      "text": "View in Bessesswari Chowdhurany case correct; dissents from Hukum Chand Boid.",
      "addresses_issue": "i1",
      "key_observation": "Knowledge essential for prohibitory order to take effect."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "A stay order is a prohibitory order; does not deprive court/authority of jurisdiction until it comes to knowledge; proceedings in ignorance not nullity.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Executing court retains jurisdiction under CPC; can set aside ignorant proceedings under S. 151 if asked timely for justice.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Permission not nullity; suit maintainable; appellant cannot challenge in suit.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Bessesswari Chowdhurany v. Horro Sunder Mozmadar and others",
      "citation": "1896-97 1 C.W.N. 226",
      "treatment": "followed",
      "relevance": "Stay order prohibitory, takes effect on communication to court; sale before communication not void."
    },
    {
      "case_name": "Hukum Chand Boid v. Kamalanand Singh",
      "citation": "I.L.R. 1906 XXXIII Cal 227",
      "treatment": "distinguished",
      "relevance": "Stay takes effect from passing, knowledge immaterial; dissented from."
    },
    {
      "case_name": "Liakat Mian v. Padampat Singhania",
      "citation": "A.I.R. 1951 Pat. 130",
      "treatment": "distinguished",
      "relevance": "Follows Hukum Chand; stay effective from passing."
    },
    {
      "case_name": "Din Dayal Lakhi Ram v. Union of India",
      "citation": "A.I.R. 1954 Punj. 46",
      "treatment": "distinguished",
      "relevance": "Follows Hukum Chand."
    },
    {
      "case_name": "Kasaribada Venkatachalpati Rao v. Maddipatla Kameshwaramma",
      "citation": "I.L.R. 1918 XLI Mad. 151",
      "treatment": "followed",
      "relevance": "Follows Bessesswari."
    },
    {
      "case_name": "Cheeramparambilalikutty v. Thalavanaparambilalikutty",
      "citation": "I.L.R. 196 Ker. 528",
      "treatment": "followed",
      "relevance": "Follows Bessesswari."
    },
    {
      "case_name": "L. Parsotam Saran v. B. Barhma Nand",
      "citation": "A.I.R. 1927 All. 401",
      "treatment": "distinguished",
      "relevance": "Intermediate view: protects third parties if no knowledge, but follows Hukum Chand otherwise."
    }
  ],
  "statutes_cited": [
    {
      "name": "U.P. Temporary Control of Rent and Eviction Act, No. III of 1947",
      "sections": [],
      "relevance": "Permission required to file eviction suit."
    },
    {
      "name": "Code of Civil Procedure",
      "sections": [
        "Order XLI Rule 5",
        "Section 151"
      ],
      "relevance": "O. XLI R. 5: Appeal does not stay execution unless ordered; S. 151: Inherent power to set aside proceedings in ignorance of stay for justice."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court dismissed the appeal, upholding Allahabad High Court; permission valid as Magistrate had no knowledge of stay; suit maintainable; decree for ejectment and rent in favour of respondent stands.",
    "relief_granted": "Decree for ejectment and rent confirmed for respondent.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "An order of stay in an execution matter is in our opinion in the nature of a prohibitory order and is addressed to the court that is carrying out execution.",
      "speaker": "court",
      "significance": "Core holding on nature of stay order."
    },
    {
      "text": "Till the order comes to the knowledge of the court its jurisdiction to carry on execution is not affected by a stay order.",
      "speaker": "court",
      "significance": "Explains when jurisdiction is impacted."
    },
    {
      "text": "The only effect of the stay order is to prohibit the executing court from proceeding further and that can only take effect when the executing court has knowledge of the order.",
      "speaker": "court",
      "significance": "Distinguishes from quashing orders."
    }
  ],
  "_case_id": "1967_237",
  "_label": 0,
  "_text_length": 18694,
  "_extracted_at": "2026-02-10T20:23:21.015369"
}