{
  "metadata": {
    "case_name": "Commissioner of Income-tax v. Respondents",
    "case_year": null,
    "court": "Supreme Court of India",
    "judges": [
      "Shah, J."
    ],
    "case_number": null,
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "In June, 1950 the respondents purchased an omnibus for Rs. 14,500 to ply it as a stage carriage.",
      "type": "background",
      "date": "1950-06",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On March 5, 1958 they sold the omnibus together with the right to ply it for Rs. 23,000.",
      "type": "material",
      "date": "1958-03-05",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Before the date of the sale the price paid by the respondents was recouped out of the depreciation allowed in proceedings for assessment of income-tax and the written down value of the omnibus in the record of the income-tax office was nil.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "In proceedings for assessment to income-tax for the assessment year 1959-60, the Income-tax Officer brought to tax Rs. 14,500 as deemed profit under section 10(2)(vii) of the Income-tax Act, 1922, and the balance of Rs. 8,500 as income arising from carrying on trade.",
      "type": "procedural",
      "date": null,
      "source": "income_tax_officer"
    },
    {
      "id": "f5",
      "text": "In appeal to the Appellate Assistant Commissioner the order of the Income-tax Officer was substantially confirmed. The Appellate Assistant Commissioner however held that the excess over the original price of the omnibus represented not the trading profits but capital gains in respect of that omnibus.",
      "type": "procedural",
      "date": null,
      "source": "appellate_assistant_commissioner"
    },
    {
      "id": "f6",
      "text": "The Appellate Tribunal held that the price received by respondents for the sale of the omnibus was Rs. 6,000 and that amount was chargeable to income-tax under section 10(2)(vii). The Tribunal further held that the difference between the amount of Rs. 23,000 which was received by the respondents as consideration for the sale and the original price of Rs. 14,500 represented capital gain chargeable to income-tax under section 12B of the Indian Income-tax Act.",
      "type": "procedural",
      "date": null,
      "source": "tribunal"
    },
    {
      "id": "f7",
      "text": "The Tribunal recorded a finding that the right to ply the omnibus was not property.",
      "type": "disputed",
      "date": null,
      "source": "tribunal"
    },
    {
      "id": "f8",
      "text": "The Tribunal then referred the following question at the instance of the Commissioner to the High Court of Andhra Pradesh: Whether on the facts and in the circumstances of the case, the excess of Rs. 17,000 over the deemed profits of Rs. 6,000 held to be taxable under section 10(2)(vii) should wholly be treated as a capital gain liable to tax under section 12B of the Act?",
      "type": "procedural",
      "date": null,
      "source": "tribunal"
    },
    {
      "id": "f9",
      "text": "The High Court held that the amount received as price for sale in excess over the original value of the omnibus could be treated as capital gain and could be taxed but not the balance.",
      "type": "procedural",
      "date": null,
      "source": "high_court"
    },
    {
      "id": "f10",
      "text": "Against the order of the High Court, the Commissioner has appealed to this court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "The Income-tax Officer was apparently of the view that the respondent sold the omnibus for Rs. 23,000 and with that view the Appellate Assistant Commissioner agreed. But according to the Tribunal it was composite sale of the omnibus and of the right to ply the omnibus under the permit held by the omnibus was only Rs. 6,000 and the respondents had received consideration for parting with the right to ply the omnibus under the permit granted to them.",
      "type": "disputed",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "The Tribunal also held that the amount of Rs. 8,500 which represented the difference between the consideration for sale of the rights and the original value of the omnibus was capital gain chargeable to tax under section 12B.",
      "type": "procedural",
      "date": null,
      "source": "tribunal"
    },
    {
      "id": "f13",
      "text": "In the application submitted by the Commissioner praying that questions arising out of the order of the Tribunal be referred under section 66(1) of the Income-tax Act to the High Court one of the questions submitted was: If the answer to question No. 2 is in the affirmative, whether such route value does not constitute an asset or property of the assessee for the purpose of computing capital gains? But the Tribunal did not submit a statement of case on that question to the High Court and the Commissioner did not apply to the High Court for calling for a statement of the case on that question.",
      "type": "procedural",
      "date": null,
      "source": "commissioner"
    },
    {
      "id": "f14",
      "text": "The respondents accepted liability to pay tax on the capital gain amounting to Rs. 8,500 being the difference between the price received by the sale of the rights and the original price of the omnibus.",
      "type": "admitted",
      "date": null,
      "source": "respondents"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether on the facts and in the circumstances of the case, the excess of Rs. 17,000 over the deemed profits of Rs. 6,000 held to be taxable under section 10(2)(vii) should wholly be treated as a capital gain liable to tax under section 12B of the Act?",
      "framed_by": "tribunal"
    },
    {
      "id": "i2",
      "text": "Whether the right to ply an omnibus under a permit is a capital asset within the meaning of section 2(4A) of the Income-tax Act.",
      "framed_by": "commissioner"
    },
    {
      "id": "i3",
      "text": "Whether such route value does not constitute an asset or property of the assessee for the purpose of computing capital gains?",
      "framed_by": "commissioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The right to ply the omnibus under the permit granted to the assessee was a capital asset within the meaning of section 2(4A) of the Income-tax Act, and the profit realized by sale of that capital asset was chargeable to tax under section 12B.",
      "supporting_facts": [
        "f2",
        "f11"
      ],
      "legal_basis": "Section 2(4A), Section 12B of Income-tax Act, 1922"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Accepted liability to pay tax on the capital gain amounting to Rs. 8,500.",
      "supporting_facts": [
        "f14"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The High Court proceeded to deal with the reference on the only question which was referred by the Tribunal. The High Court apparently thought that even though the respondents purported to transfer the right to the omnibus and the right to ply could be regarded as capital gain earned by the respondents by the sale of the omnibus and taxable under section 12B. If however, on the finding recorded by the Tribunal the price received by the respondent for sale of the omnibus was Rs. 6,000 the excess over that amount can obviously not be attributable to the sale of the omnibus.",
      "addresses_issue": "i1",
      "key_observation": "Excess over Rs. 6,000 not attributable to sale of omnibus."
    },
    {
      "id": "cr2",
      "text": "We do not propose in this case to express any opinion on the question whether the right to ply an omnibus under a permit is a capital asset within the meaning of section 2(4A) of the Act. The Tribunal recorded a finding that the right to ply the omnibus was not property if it is not property it cannot be a capital asset.",
      "addresses_issue": "i2",
      "key_observation": "Tribunal finding that right to ply is not property; cannot opine as not referred."
    },
    {
      "id": "cr3",
      "text": "The question raised by the Tribunal and referred to the High Court did not comprehend an enquiry into the question whether a right to ply a stage carriage under a permit granted by a transport authority exercising power under the Motor Vehicles Act, 1939, is Property. In this appeal we cannot record our opinion on a question which was not referred by the Tribunal. Our jurisdiction sitting in appeal over the judgment of the High Court is also advisory we can only record our opinion on questions which are referred - not on questions which could have been but have not been referred.",
      "addresses_issue": "i3",
      "key_observation": "Jurisdiction limited to referred questions."
    },
    {
      "id": "cr4",
      "text": "The Tribunal has found that the price for which the omnibus was sold was Rs. 6,000 and that amount having been brought to tax under section 10(2)(vii) of the Income-tax Act on the footing that the written down value of the omnibus was at the date of the sale nil no question of charging to tax any capital gain earned by sale of the omnibus falls to be determined.",
      "addresses_issue": "i1",
      "key_observation": "No capital gain on omnibus as WDV nil and Rs.6,000 already taxed."
    },
    {
      "id": "cr5",
      "text": "Even though we are of the opinion that no part of the amount of Rs. 17,000 was taxable, the respondents cannot obtain any benefit of that opinion contrary to the finding of the Tribunal and confirmed by the High Court.",
      "addresses_issue": "i1",
      "key_observation": "Respondents bound by Tribunal's finding on Rs.8,500."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "No opinion expressed on whether right to ply omnibus under permit is capital asset, as question not referred.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "No capital gain on sale of omnibus as price Rs.6,000 already taxed u/s 10(2)(vii) and WDV nil.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Income-tax Act, 1922",
      "sections": [
        "10(2)(vii)",
        "12B",
        "2(4A)",
        "66(1)",
        "66(2)"
      ],
      "relevance": "Deemed profit on sale of asset, capital gains tax, definition of capital asset, reference to High Court."
    },
    {
      "name": "Motor Vehicles Act, 1939",
      "sections": [],
      "relevance": "Permit granted by transport authority for plying stage carriage."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal by the Commissioner against the High Court order is dismissed. No opinion on whether permit right is capital asset as not referred. Tribunal finding on omnibus sale price Rs.6,000 upheld, already taxed; respondents bound by acceptance of tax on Rs.8,500 capital gain.",
    "relief_granted": "None; appeal dismissed.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The Tribunal recorded a finding in their order that the right to ply the omnibus was not property if it is not property it cannot be a capital asset.",
      "speaker": "court",
      "significance": "Basis for not treating permit right as capital asset."
    },
    {
      "text": "In this appeal we cannot record our opinion on a question which was not referred by the Tribunal.",
      "speaker": "court",
      "significance": "Limits Supreme Court's jurisdiction to referred questions only."
    },
    {
      "text": "The appeal fails and is dismissed.",
      "speaker": "court",
      "significance": "Final disposition of the case."
    }
  ],
  "_case_id": "1967_294",
  "_label": 0,
  "_text_length": 7294,
  "_extracted_at": "2026-02-10T20:23:53.910181"
}