{
  "metadata": {
    "case_name": "State (through Public Prosecutor) v. Surjit Singh & Anr.",
    "case_year": 1966,
    "court": "Supreme Court of India",
    "judges": [
      "Vaidialingam, J."
    ],
    "case_number": "Criminal Appeal No. 97 of 1966",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Harnek Singh lodged a complaint at the Police Station, Phul, on October 15, 1964, at about 10.40 p.m., that while coming out of a picture house, along with Surjit Singh, first respondent herein, his foot accidentally struck against a third party, Avtar Singh, who was also coming out of the picture house, along with Raj Pal, the second respondent.",
      "type": "background",
      "date": "1964-10-15",
      "source": "complainant"
    },
    {
      "id": "f2",
      "text": "According to the complaint, Avtar Singh and the second respondent picked up a quarrel with Harnek Singh but they were pacified and separated by the Manager of the cinema, who intervened.",
      "type": "disputed",
      "date": "1964-10-15",
      "source": "complainant"
    },
    {
      "id": "f3",
      "text": "It is also alleged that when later, Harnek Singh and the first respondent were near the Civil Hospital, Phul, the second respondent fired a shot at Harnek Singh.",
      "type": "disputed",
      "date": "1964-10-15",
      "source": "complainant"
    },
    {
      "id": "f4",
      "text": "The Police investigated this complaint and took the view that the second respondent had not participated in the occurrence and that he had been falsely implicated on account of enmity.",
      "type": "material",
      "date": null,
      "source": "police"
    },
    {
      "id": "f5",
      "text": "Before the police actually filed a complaint before the Magistrate against Avtar Singh alone, the first respondent instituted a complaint before the Magistrate under ss.307, 504 and 323 read with S.34, I.P.C., against both Avtar Singh and the second respondent.",
      "type": "procedural",
      "date": null,
      "source": "first_respondent"
    },
    {
      "id": "f6",
      "text": "The Magistrate, after holding a preliminary enquiry, issued summons to both the accused.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "On January 8, 1965, the Prosecuting Deputy Superintendent of Police, Bhatinda, Shri Harbans Singh, filed an application, in his capacity as Public Prosecutor, before the trial Magistrate, under s. 494 of the Code, for permission to withdraw from the prosecution of the case and for discharging the second respondent.",
      "type": "procedural",
      "date": "1965-01-08",
      "source": "public_prosecutor"
    },
    {
      "id": "f8",
      "text": "According to that officer, the second respondent was innocent and had been falsely involved, in the case, by the complainant and that this fact had come to his knowledge during the investigation.",
      "type": "material",
      "date": null,
      "source": "public_prosecutor"
    },
    {
      "id": "f9",
      "text": "The said application was opposed by the first respondent on two grounds: 1) that Shri Harbans Singh did not exercise the powers of a Public Prosecutor and therefore he had no locus standi to file the application and 2) that the application was not bona fide.",
      "type": "procedural",
      "date": null,
      "source": "first_respondent"
    },
    {
      "id": "f10",
      "text": "The second respondent prayed that permission should not be granted for withdrawal.",
      "type": "procedural",
      "date": null,
      "source": "second_respondent"
    },
    {
      "id": "f11",
      "text": "The trial Magistrate, by his order dated February 8, 1965, overruled the objections raised by the first respondent and held that the Prosecuting Deputy Superintendent of Police was the Public Prosecutor for the entire district of Bhatinda, within whose jurisdiction the Magistrate's Court at Phul was situated, and that the application was bona fide. In consequence, the Magistrate gave permission for the withdrawal of the case, as against the second respondent.",
      "type": "procedural",
      "date": "1965-02-08",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "This order was challenged by the first respondent, in revision before the learned Sessions Judge, Barnala.",
      "type": "procedural",
      "date": null,
      "source": "first_respondent"
    },
    {
      "id": "f13",
      "text": "The learned Sessions Judge held that the Officer who filed the application under s. 494 had been appointed as Public Prosecutor for the Magistrates Court at Phul by the Government, that the Public Prosecutor could intervene in a criminal case instituted on a private complaint and could be considered to be one who had taken charge of the case when he made an application to withdraw from the prosecution. Both objections were overruled.",
      "type": "procedural",
      "date": null,
      "source": "sessions_court"
    },
    {
      "id": "f14",
      "text": "The Sessions Judge also held that the Magistrate had exercised his jurisdiction judicially in giving permission to withdraw.",
      "type": "procedural",
      "date": null,
      "source": "sessions_court"
    },
    {
      "id": "f15",
      "text": "The order of the trial Magistrate was confirmed by the Sessions Judge.",
      "type": "procedural",
      "date": null,
      "source": "sessions_court"
    },
    {
      "id": "f16",
      "text": "The first respondent went up in revision to the Punjab High Court challenging the two orders.",
      "type": "procedural",
      "date": null,
      "source": "first_respondent"
    },
    {
      "id": "f17",
      "text": "A Division Bench of the Punjab High Court, consisting of Falshaw, C.J., and Khanna J., by their order dated December 20, 1965, accepted the contentions of the first respondent and held that a Public Prosecutor cannot withdraw, under s. 494 of the Code, from the prosecution of a case pending before a Magistrate, instituted upon a private complaint, despite the complainant's objection to the withdrawal. Directed the complaint filed by the first respondent against both accused to be proceeded with.",
      "type": "procedural",
      "date": "1965-12-20",
      "source": "high_court"
    },
    {
      "id": "f18",
      "text": "In the High Court, the first respondent accepted that Shri Harbans Singh had been vested with powers of a Public Prosecutor.",
      "type": "admitted",
      "date": null,
      "source": "first_respondent"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether a Public Prosecutor can file an application under s. 494 CrPC for permission to withdraw from the prosecution of a case instituted on a private complaint and being prosecuted by the private complainant.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Section 494 is unambiguous and gives an unqualified right to any Public Prosecutor to file an application to withdraw from the prosecution. All offences affect the public and all prosecutions are conducted by the State through the Public Prosecutor.",
      "supporting_facts": [],
      "legal_basis": "s. 494 CrPC"
    },
    {
      "id": "pa2",
      "text": "Even assuming the Public Prosecutor must be in charge of the case, the Public Prosecutor here satisfies that as he is appointed for the Magistrates Court at Phul and by filing the application took charge.",
      "supporting_facts": [
        "f7",
        "f18"
      ],
      "legal_basis": "s. 492(1), s. 494 CrPC"
    },
    {
      "id": "pa3",
      "text": "A Public Prosecutor appointed generally under s.492(1) is in charge of every prosecution before that court. Duty cast on Public Prosecutor as officer of court to inform if no case against accused.",
      "supporting_facts": [],
      "legal_basis": "s. 492(1) CrPC"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Public Prosecutor has no locus standi to file under s.494 in a private complaint case as he was nowhere in the picture and not in charge of the prosecution being conducted by the private complainant.",
      "supporting_facts": [
        "f5",
        "f7"
      ],
      "legal_basis": "s. 494 CrPC; s. 493 CrPC"
    },
    {
      "id": "ra2",
      "text": "s.494 must be read with s.493; only Public Prosecutor in charge of the particular case can withdraw. Allowing any PP would lead to anomalous results.",
      "supporting_facts": [],
      "legal_basis": "ss. 492, 493, 494 CrPC"
    },
    {
      "id": "ra3",
      "text": "Expression 'withdraw from the prosecution' implies PP already in charge.",
      "supporting_facts": [],
      "legal_basis": "s. 494 CrPC"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Public Prosecutors appointed under ss.492(1) or (2). s.493 deals with PP in charge of particular case. s.494 contemplates PP already in charge of the case to withdraw.",
      "addresses_issue": "i1",
      "key_observation": "s.494 refers only to PP in charge of the particular case."
    },
    {
      "id": "cr2",
      "text": "Interpreting s.494 to allow any PP leads to anomalies, e.g., one PP withdrawing case conducted by another.",
      "addresses_issue": "i1",
      "key_observation": "Only PP conducting the prosecution can file under s.494."
    },
    {
      "id": "cr3",
      "text": "In this case, prosecution conducted by first respondent (private complainant); PP not in charge when filed application.",
      "addresses_issue": "i1",
      "key_observation": "High Court view correct."
    },
    {
      "id": "cr4",
      "text": "Reviewed precedents: Distinguished cases where PP was in charge; agreed with Bombay HC in Ratansha that PP must be in charge.",
      "addresses_issue": "i1",
      "key_observation": "PP must be already in charge."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The Public Prosecutor who can file an application under s. 494 CrPC must be the one already in charge of and conducting the prosecution in that particular case.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "State of Bihar v. Ram Naresh Pandey",
      "citation": "1957 S.C.R. 279",
      "treatment": "referred",
      "relevance": "PP as officer of court bound to assist with fair view; question here not considered."
    },
    {
      "case_name": "Queen Empress v. Murarji Gokuldas",
      "citation": "I.L.R. 1889 13 Bom. 389",
      "treatment": "distinguished",
      "relevance": "General observations that all prosecutions by Crown; not applicable here."
    },
    {
      "case_name": "State v. Atmaram M. Ghosale",
      "citation": "I.L.R. 1923 2 Pat. 708",
      "treatment": "distinguished",
      "relevance": "Prosecutions deemed by State; does not advance appellant's case."
    },
    {
      "case_name": "Gulli Bhagat v. Narain Singh",
      "citation": "I.L.R. 1965 Bom. 103",
      "treatment": "distinguished",
      "relevance": "PP was conducting prosecution; private party no right to challenge withdrawal."
    },
    {
      "case_name": "Amar Narain v. State of Rajasthan",
      "citation": "A.I.R. 1952 Raj. 42",
      "treatment": "distinguished",
      "relevance": "Prosecution by State and conducted by PP; private party no revision right."
    },
    {
      "case_name": "Sher Singh v. Jitendranath",
      "citation": "A.I.R. 1931 Cal. 607",
      "treatment": "doubted",
      "relevance": "PP entering only for withdrawal; court not inclined to accept."
    },
    {
      "case_name": "Pratap Chand v. Bihari Lal",
      "citation": "A.I.R. 1955 J K 12",
      "treatment": "distinguished",
      "relevance": "PP had taken charge earlier; restricted to facts."
    },
    {
      "case_name": "Ratansha Kavasji v. Behramsha Pardiuala",
      "citation": "I.L.R. 1945 Bom. 141",
      "treatment": "followed",
      "relevance": "PP can withdraw only if already in charge of prosecution."
    }
  ],
  "statutes_cited": [
    {
      "name": "Code of Criminal Procedure, 1898",
      "sections": [
        "s. 494",
        "s. 492",
        "s. 493",
        "s. 495",
        "s. 203"
      ],
      "relevance": "Governs appointment of PP, conduct of prosecution, withdrawal by PP in charge of case."
    },
    {
      "name": "Indian Penal Code",
      "sections": [
        "s. 307",
        "s. 504",
        "s. 323",
        "s. 34"
      ],
      "relevance": "Sections under which private complaint filed."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court dismissed the appeal, upholding the Punjab High Court's order that the Public Prosecutor was not entitled to file an application under s.494 CrPC in a private complaint case where he was not in charge of the prosecution, and directed the complaint against both accused to proceed.",
    "relief_granted": "Complaint to be proceeded with against both accused.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"the Public Prosecutor, who files the application for withdrawal under that section, must be Public Prosecutor, who is already in charge of that particular case, in which the application is filed.\"",
      "speaker": "court",
      "significance": "Core holding on interpretation of s.494 CrPC."
    },
    {
      "text": "\"unless the Public Prosecutor is already in charge of the prosecution, he cannot withdraw from it\"",
      "speaker": "court",
      "significance": "Agrees with Bombay HC; clarifies requirement for PP to be in charge."
    },
    {
      "text": "The appeal therefore fails and is dismissed.",
      "speaker": "court",
      "significance": "Final disposition of the appeal."
    }
  ],
  "_case_id": "1967_231",
  "_label": 0,
  "_text_length": 36524,
  "_extracted_at": "2026-02-10T20:23:25.553392"
}