{
  "metadata": {
    "case_name": "Appellant v. Respondent",
    "case_year": 1965,
    "court": "Supreme Court of India",
    "judges": [
      "Ramaswami, J."
    ],
    "case_number": "Civil Appeal No. 395 of 1965",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "By its letter dated September 14, 1960, the appellant made an offer for sale to the respondent of 500 Bales 1,50,000 bags B Twills on the terms and conditions mentioned in the said letter.",
      "type": "background",
      "date": "1960-09-14",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The offer was accepted by the Director-General, Supplies Disposals on behalf of the respondent by his letter No. CAL DL-1/5750-L II Modi/158 dated September 16, 1960.",
      "type": "background",
      "date": "1960-09-16",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The appellant deposited with the Reserve Bank of India the sum of Rs. 20,182-50 P. towards security deposit on September 22, 1960 as required by the acceptance letter.",
      "type": "procedural",
      "date": "1960-09-22",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The date of delivery fixed under the contract was November 30, 1960.",
      "type": "material",
      "date": "1960-11-30",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The respondent sent the appellant despatch instructions dated November 21, 1960, through the Director of Supplies Disposals.",
      "type": "procedural",
      "date": "1960-11-21",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "On November 30, 1960 the appellant intimated to the respondent that the contract was void and illegal and requested that the security deposit should be refunded. The case of the appellant was that the contract was in violation of the provisions of the Forward Contracts Regulation Act, 1952 (Act 74 of 1952).",
      "type": "disputed",
      "date": "1960-11-30",
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "By his letter dated December 1, 1960 the Director of Supplies wrote on behalf of the respondent that the contract was legal and binding and as the appellant had failed to deliver the goods as provided in the agreement the respondent would purchase the goods at the risk of the appellant.",
      "type": "material",
      "date": "1960-12-01",
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "The respondent incurred extra expenditure amounting to about Rs. 76,410 and after giving credit to the appellant for the amount of Security Deposit, a sum of Rs. 56,000 still remained due to be paid by the appellant to the respondent.",
      "type": "material",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f9",
      "text": "As the appellant failed to pay, the respondent took recourse to the arbitration cl. 21 of the contract and appointed an Arbitrator to determine the dispute between the parties regarding the agreement.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f10",
      "text": "Before the Arbitrator could give his award, the appellant filed an application before the High Court under S. 33 of the Arbitration Act praying for a declaration that the arbitration clause was illegal and void and for an injunction restraining the respondent from prosecuting the arbitration proceedings.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f11",
      "text": "By its judgment dated September 18, 1963 the Calcutta High Court in Matter No. 97 of 1963 dismissed the application of the appellant holding that the contract was a non-transferable specific delivery contract and was not hit by the provisions of the Act.",
      "type": "procedural",
      "date": "1963-09-18",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "A notification was issued by the Central Government on March 29, 1958 under section 15(1) of the Forward Contracts Regulation Act, 1952 declaring that section to apply to Jute goods (Hessian cloth made of jute or bags made of such Hessian cloth and sacking cloth made of jute or bags made of such Sacking cloth) in the City of Calcutta and specified areas.",
      "type": "background",
      "date": "1958-03-29",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "The contract cannot be sublet or assigned by the seller under condition 10 read with para 3(b) of the Conditions of Contract contained in Form D.G.S. & D. 68 governing contracts placed by the Central Purchase Organisation of the Government of India, 1959 edition.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "The jute bags were intended for packing foodgrains which were arriving in bulk at an Indian port. The last paragraph of the letter of acceptance dated September 16, 1960 states that the gunnies are very urgently required at the destination for packing imported foodgrains which are arriving in bulk.",
      "type": "material",
      "date": "1960-09-16",
      "source": "court"
    },
    {
      "id": "f15",
      "text": "Shipment of the total quantity ordered shall be made in the vessels nominated by the purchaser.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f16",
      "text": "The stores shall be inspected prior to shipment by the A.T.I.G.S., East India, Hastings, Calcutta, or his representative.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f17",
      "text": "Goods which are not accepted in inspection should not be shipped.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f18",
      "text": "The name of the consignee is given in the contract as Asst. Director Storage, Ministry of Food Agriculture, Transit Shed No. 4, Visakhapatnam Port, Visakhapatnam.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f19",
      "text": "Payment is to be made according to the procedure specified in the contract and the contract was debitable to the Pay Accounts Officer, Ministry of Food Agriculture, Bombay or New Delhi under Head of Account 87-Capital Outlay on the Schemes of Govt. Trading-Schemes for purchases of Foodgrains.",
      "type": "material",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the contract in question is a transferable or non-transferable specific delivery contract within the meaning of the Forward Contracts (Regulation) Act, 1952.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The contract was a forward contract within the meaning of the Act and was prohibited by the Government notification and therefore no right or liability accrued to the parties on the basis of the contract. The contract was not a non-transferable specific delivery contract as defined in s. 2(f) of the Act and as such it was illegal and void and the arbitration clause contained therein was of no effect.",
      "supporting_facts": [
        "f6",
        "f12"
      ],
      "legal_basis": "Forward Contracts (Regulation) Act, 1952, s. 2(f)"
    },
    {
      "id": "pa2",
      "text": "There was no specific clause in the contract which prohibited the transfer of the rights and liabilities or which prohibited transfer of the bill of lading. The absence of such a specific clause is conclusive as to the intention of the parties.",
      "supporting_facts": [],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The contract was legal and binding.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The question as to whether the contract was a transferable or non-transferable specific delivery contract depends on a reasonable construction of the contract. The absence of a specific clause prohibiting transfer is not conclusive. Terms can be implied from the document as a whole and surrounding circumstances.",
      "addresses_issue": "i1",
      "key_observation": "In construing such a contract it is legitimate to take into account the surrounding circumstances for ascertaining the intention of the parties."
    },
    {
      "id": "cr2",
      "text": "Condition 10 read with para 3(b) prohibits subletting or assignment by seller without permission. Buyer side shows specific purpose for foodgrains, urgency, specific inspection, consignee, payment procedure, indicating non-transferability was contemplated.",
      "addresses_issue": "i1",
      "key_observation": "It was not contemplated by the parties that the rights under the contract should be transferred either by the buyers or by the sellers."
    },
    {
      "id": "cr3",
      "text": "The contract is a non-transferable specific delivery contract within the meaning of s. 2(f) of the Act and not hit by the notification dated March 29, 1958 issued under s. 15(1). Section 18(1) exempts non-transferable specific delivery contracts.",
      "addresses_issue": "i1",
      "key_observation": "All forward contracts except those which are non-transferable specific delivery contracts, can be declared illegal by a notification issued under the Act."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "On a proper construction of the terms of the contract and having regard to the surrounding circumstances there was an implied agreement between the parties that the rights and liabilities under the contract were not to be transferred and the Bill of Lading relating to the contract was also not to be transferred.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "The contract in question was a non-transferable specific delivery contract within the meaning of s. 2(f) of the Act and the contract was not hit by the notification dated March 29, 1958 issued by the Central Government under s. 15(1) of the Act.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Khardah Company Ltd. v. Raymon & Co. India Private Ltd.",
      "citation": "1963 3 S.C.R. 183",
      "treatment": "followed",
      "relevance": "The absence of a specific clause prohibiting transfer is not conclusive one way or the other on the question whether there was an agreement between the parties that the contract was to be non-transferable. What has to be seen is whether it could be held on a reasonable interpretation of the contract."
    }
  ],
  "statutes_cited": [
    {
      "name": "Forward Contracts (Regulation) Act, 1952 (Act 74 of 1952)",
      "sections": [
        "s. 2(a)",
        "s. 2(c)",
        "s. 2(m)",
        "s. 2(f)",
        "s. 2(n)",
        "s. 15(1)",
        "s. 17(1)",
        "s. 18(1)"
      ],
      "relevance": "Defines ready delivery contract, forward contract, specific delivery contract, non-transferable specific delivery contract, transferable specific delivery contract. Prohibits certain forward contracts by notification except non-transferable specific delivery contracts."
    },
    {
      "name": "Arbitration Act",
      "sections": [
        "S. 33"
      ],
      "relevance": "Application filed under S. 33 for declaration that arbitration clause illegal and for injunction."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court held that the decision of the Calcutta High Court dated September 18, 1963 is correct and dismissed the appeal with costs.",
    "relief_granted": null,
    "costs": "with costs"
  },
  "key_quotes": [
    {
      "text": "The question as to whether the contract was a transferable or non-transferable specific delivery contract is a question which ultimately depends on a reasonable construction of the contract.",
      "speaker": "court",
      "significance": "Central to determining the applicability of the Act's prohibitions."
    },
    {
      "text": "If upon a reading of the document as a whole, it can fairly be deduced from the words actually used therein that the parties had agreed on a particular term, there is nothing in law which prevents them from setting up that term.",
      "speaker": "court",
      "significance": "Explains basis for implying non-transferability."
    },
    {
      "text": "We hold that on a proper construction of the terms of the contract and having regard to the surrounding circumstances there was an implied agreement between the parties that the rights and liabilities under the contract were not to be transferred.",
      "speaker": "court",
      "significance": "Key holding on contract interpretation."
    }
  ],
  "_case_id": "1967_103",
  "_label": 0,
  "_text_length": 15226,
  "_extracted_at": "2026-02-10T20:21:24.551089"
}