{
  "metadata": {
    "case_name": "Appellant (Defendant No. 4) v. Respondents Nos. 1 and 2",
    "case_year": 1965,
    "court": "Supreme Court of India",
    "judges": [
      "Wanchoo, J."
    ],
    "case_number": "Civil Appeal No. 695 of 1965",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Suit brought by respondents Nos. 1 and 2 against appellant (defendant No. 4) and defendants Nos. 1 to 3 in Court of Judge Small Causes at Ahmedabad under s. 28 of Bombay Rents, Hotel and Lodging House Rates Control Act, 1947.",
      "type": "procedural",
      "date": "1957-03-01",
      "source": "respondents"
    },
    {
      "id": "f2",
      "text": "Defendants Nos. 1 to 3 were tenants-in-chief of the premises; present appellant (defendant No. 4) was their sub-tenant.",
      "type": "background",
      "date": null,
      "source": "respondents"
    },
    {
      "id": "f3",
      "text": "Respondents gave notice to tenants-in-chief terminating tenancy and asking to vacate after November 30, 1956.",
      "type": "material",
      "date": null,
      "source": "respondents"
    },
    {
      "id": "f4",
      "text": "Suit based on two grounds: (i) rent not paid for six months; (ii) unlawful sub-letting by tenants-in-chief to appellant.",
      "type": "material",
      "date": null,
      "source": "respondents"
    },
    {
      "id": "f5",
      "text": "Defendant No. 1 defended that premises taken by firm consisting of three defendants, but he no longer partner and had nothing to do with premises; suit not maintainable against him.",
      "type": "disputed",
      "date": null,
      "source": "defendant No. 1"
    },
    {
      "id": "f6",
      "text": "Defendants Nos. 2 and 3 contended rent of Rs. 26 excessive, prayed for standard rent fixation; defendant No. 1 no longer partner, replaced by defendant No. 4 (appellant) as partner; no sub-letting; rent due deposited on first hearing date, no arrears.",
      "type": "disputed",
      "date": null,
      "source": "defendants Nos. 2 and 3"
    },
    {
      "id": "f7",
      "text": "Appellant denied being sub-tenant; entire interest of defendants Nos. 1 to 3 in business and premises transferred to him, making him tenant of respondents, not sub-tenant; arrears paid into court.",
      "type": "disputed",
      "date": null,
      "source": "appellant"
    },
    {
      "id": "f8",
      "text": "Trial court framed four issues: (1) whether defendants Nos. 1-3 in arrears (held no); (2) standard rent (held Rs. 26 per mensem); (3) whether sub-let to appellant; (4) assignment to appellant.",
      "type": "procedural",
      "date": null,
      "source": "trial court"
    },
    {
      "id": "f9",
      "text": "Trial court held defendants Nos. 1-3 sub-let to appellant, rejected partnership/assignment; but due to 1959 amendment, no eviction; dismissed suit for eviction against all; ordered tenants-in-chief pay rent from Sept 1, 1956 at Rs. 26 pm; deposited rent to be taken by respondents, deficiency recoverable from tenants-in-chief; suit dismissed in toto against appellant.",
      "type": "admitted",
      "date": null,
      "source": "trial court"
    },
    {
      "id": "f10",
      "text": "Respondents appealed against dismissal of eviction; tenants-in-chief and appellant parties.",
      "type": "procedural",
      "date": null,
      "source": "respondents"
    },
    {
      "id": "f11",
      "text": "Appellate court questions: (1) arrears from tenants-in-chief; (2) entitlement to possession from appellant as not sub-tenant or not protected u/s 15(2) as amended 1959. Held no arrears; appellant denied sub-tenancy so not sub-tenant, failed to prove assignment so trespasser; benefit of s.15(2) only for sub-tenants; eject appellant within 6 months; set aside trial decree.",
      "type": "admitted",
      "date": "1964-06-17",
      "source": "appellate court"
    },
    {
      "id": "f12",
      "text": "Appellate court judgment does not show order for ejectment of tenants-in-chief.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Appellant filed revision u/s 115 CPC in Gujarat High Court; tenants-in-chief took no action.",
      "type": "procedural",
      "date": "1964-06-17",
      "source": "appellant"
    },
    {
      "id": "f14",
      "text": "High Court held appellate court wrong to set aside sub-tenant finding without examination; sub-letting finding unchallenged, appellant protected u/s 15(2); but arrears due from tenants-in-chief despite concurrent findings, liable to ejectment, sub-tenant goes with them; rejected s.14 protection; upheld appellate order.",
      "type": "admitted",
      "date": "1964-06-18",
      "source": "high court"
    },
    {
      "id": "f15",
      "text": "High Court refused leave to appeal; special leave obtained from Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "appellant"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether appellate court had jurisdiction under s.28 of the Act to order ejectment of appellant as trespasser.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether High Court had jurisdiction u/s 115 CPC to reverse concurrent finding on no arrears.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether s.14 deems sub-tenant as tenant-in-chief upon termination of tenancy by notice.",
      "framed_by": "respondent"
    },
    {
      "id": "i4",
      "text": "Whether landlord can evict sub-tenant without evicting tenant-in-chief.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "High Court had no jurisdiction u/s 115 CPC to set aside concurrent finding that no arrears due.",
      "supporting_facts": [
        "f8",
        "f9",
        "f11",
        "f14"
      ],
      "legal_basis": "Vora Abbas Bhai Alimahomed v. Haji Gulamnabi"
    },
    {
      "id": "pa2",
      "text": "Appellate court lacked jurisdiction to evict appellant as trespasser in suit u/s 28 Act.",
      "supporting_facts": [
        "f11",
        "f12"
      ],
      "legal_basis": "s. 28 Bombay Rents Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "No question of jurisdiction involved in revision before High Court, so High Court could not interfere with appellate court decision.",
      "supporting_facts": [
        "f13",
        "f14"
      ],
      "legal_basis": "Vora Abbas Bhai Alimahomed v. Haji Gulamnabi"
    },
    {
      "id": "ra2",
      "text": "On notice determining tenancy of tenants-in-chief on Nov 30, 1956, appellant became tenant-in-chief u/s 14 Act.",
      "supporting_facts": [
        "f3",
        "f11"
      ],
      "legal_basis": "s. 14 Bombay Rents Act; Anand Nivas Pvt. Ltd. v. Anandji Kalyanji Pedhi"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Not necessary to decide High Court jurisdiction u/s 115 as appellate court lacked jurisdiction to evict appellant as trespasser u/s 28; s.28 only for tenants/sub-tenants on grounds in ss.12/13; trespasser requires regular civil suit.",
      "addresses_issue": "i1",
      "key_observation": "Appellate court held appellant trespasser but decreed eviction without jurisdiction under Act."
    },
    {
      "id": "cr2",
      "text": "Landlord cannot sue/evict sub-tenant alone; must sue tenant-in-chief; no eviction order against tenants-in-chief by appellate court.",
      "addresses_issue": "i4",
      "key_observation": "Appellate court did not order ejectment of tenants-in-chief."
    },
    {
      "id": "cr3",
      "text": "s.14 applies only when tenant's interest completely ends (evicted under ss.12/13), not merely on notice; tenants-in-chief not evicted.",
      "addresses_issue": "i3",
      "key_observation": "\"The interest of a tenant ... comes to an end completely only when he is no longer a contractual tenant but also when he has lost the right to remain in possession which s.12 has given to him and is no longer even a statutory tenant.\""
    },
    {
      "id": "cr4",
      "text": "Concurrent finding of no arrears by trial and appellate courts; High Court should not interfere.",
      "addresses_issue": "i2",
      "key_observation": "No decree even by High Court against tenants-in-chief."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Appellate court lacked jurisdiction to order ejectment of trespasser or sub-tenant without evicting tenant-in-chief in suit u/s 28.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "s.14 does not deem sub-tenant tenant-in-chief merely upon notice determining contractual tenancy; requires complete determination including eviction.",
      "resolves_issue": "i3",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h3",
      "text": "Concurrent finding of no arrears not to be disturbed.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Vora Abbas Bhai Alimahomed v. Haji Gulamnabi",
      "citation": "(1964) 5 S.C.R. 157",
      "treatment": "referred",
      "relevance": "On jurisdiction u/s 115 CPC to interfere with findings."
    },
    {
      "case_name": "Anand Nivas Pvt. Ltd. v. Anandji Kalyanji Pedhi",
      "citation": "(1964) 4 S.C.R. 892",
      "treatment": "followed",
      "relevance": "s.14 protects sub-tenants of contractual tenants; does not apply on mere notice."
    }
  ],
  "statutes_cited": [
    {
      "name": "Bombay Rents, Hotel and Lodging House Rates Control Act, 1947",
      "sections": [
        "s. 12",
        "s. 13",
        "s. 14",
        "s. 15(2)",
        "s. 28"
      ],
      "relevance": "Governs eviction grounds, sub-tenant protection, jurisdiction of Small Causes Court; 1959 amendment relevant."
    },
    {
      "name": "Code of Civil Procedure, 1908",
      "sections": [
        "s. 115"
      ],
      "relevance": "High Court revisional jurisdiction."
    },
    {
      "name": "Transfer of Property Act, 1882",
      "sections": [
        "s. 111(h)"
      ],
      "relevance": "Determination of tenancy by notice, contrasted with Act's context."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; judgments of High Court and appellate court set aside as without jurisdiction; trial court judgment restored.",
    "relief_granted": "Restoration of trial court's dismissal of eviction suit against appellant.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "when the appellate court held that the present appellant was a trespasser, there was no jurisdiction under the Act to pass a decree for ejectment against a trespasser.",
      "speaker": "court",
      "significance": "Core holding on lack of jurisdiction u/s 28."
    },
    {
      "text": "s. 14 would come into play in favour of the sub-tenant only after the tenancy of the contractual tenant has been determined by notice and the contractual tenant has been ordered to be ejected under s. 28 on any of the grounds in s. 12 or s. 13.",
      "speaker": "court",
      "significance": "Interpretation of s.14 triggering condition."
    }
  ],
  "_case_id": "1967_301",
  "_label": 1,
  "_text_length": 18749,
  "_extracted_at": "2026-02-10T20:24:04.652543"
}