{
  "metadata": {
    "case_name": "Commissioner of Income-tax v. The Assessee",
    "case_year": null,
    "court": "Supreme Court of India",
    "judges": [
      "Shah, J."
    ],
    "case_number": null,
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Income-tax Appellate Tribunal, Calcutta Bench, drew up a statement of case under section 66(2) of the Indian Income-tax Act and submitted the question to the High Court of Judicature at Calcutta.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The question referred: Whether, under the facts and circumstances, and on the materials available, the Appellate Tribunal was justified in holding that the gain of Rs. 49,400 made by the sale of 200 shares of Radha Films Limited was a venture in the nature of trade and whether the said amount of gain was of a capital nature or an income from business taxable under the Indian Income-tax Act.",
      "type": "material",
      "date": null,
      "source": "tribunal"
    },
    {
      "id": "f3",
      "text": "High Court on 15th December, 1959, found the statement of case insufficient to determine the question, referred the case back to the Tribunal to arrive at findings on six matters indicated in their order, with liberty to take additional evidence adduced by the parties.",
      "type": "procedural",
      "date": "1959-12-15",
      "source": "high_court"
    },
    {
      "id": "f4",
      "text": "Tribunal submitted a supplementary statement of case on 25th October, 1960.",
      "type": "procedural",
      "date": "1960-10-25",
      "source": "tribunal"
    },
    {
      "id": "f5",
      "text": "High Court by judgment dated June 21, 1963, answered the question that the gain was of a capital nature and not income from business taxable under the Indian Income-tax Act.",
      "type": "procedural",
      "date": "1963-06-21",
      "source": "high_court"
    },
    {
      "id": "f6",
      "text": "High Court declined to grant a certificate under section 66A of the Indian Income-tax Act, 1922.",
      "type": "procedural",
      "date": null,
      "source": "high_court"
    },
    {
      "id": "f7",
      "text": "Commissioner of Income-tax obtained special leave and appealed to the Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "supreme_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the High Court was justified in directing the Tribunal to record additional evidence in the supplementary statement of case under section 66(4) of the Indian Income-tax Act, 1922.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The judgment under appeal was vitiated because the High Court authorised the Tribunal to record additional evidence on the matters set out in their order.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": "Section 66(4) of the Indian Income-tax Act, 1922; Keshav Mills Co. Ltd. v. Commissioner of Income-tax"
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The order of the High Court is inconsistent with the decisions of this Court, particularly Keshav Mills Co. Ltd. v. Commissioner of Income-tax, which holds that under section 66(4), the High Court can require the Tribunal to include in the supplementary statement only material and evidence already on the record, not direct collection of additional evidence.",
      "addresses_issue": "i1",
      "key_observation": "It is impossible to ascertain what part of the supplementary statement was based on additional evidence."
    },
    {
      "id": "cr2",
      "text": "Since the High Court considered facts from the supplementary statement in recording their opinion, the answer must be discharged.",
      "addresses_issue": "i1",
      "key_observation": "High Court must refer back to Tribunal for supplementary statement on materials on record only, excluding additional evidence."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "High Court has no jurisdiction under section 66(4) to direct the Appellate Tribunal to collect additional material and make it part of the supplementary statement; supplementary statement must be founded only on evidence already on the record.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Keshav Mills Co. Ltd. v. Commissioner of Income-tax",
      "citation": null,
      "treatment": "followed",
      "relevance": "High Court cannot direct Tribunal to collect additional evidence for supplementary statement under section 66(4); only existing record."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act, 1922",
      "sections": [
        "66(2)",
        "66(4)",
        "66(1)",
        "66A"
      ],
      "relevance": "Governs reference to High Court, supplementary statements, and certificates for appeal."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; High Court's answer discharged and case remanded to High Court with directions to refer back to Tribunal for supplementary statement on matters in order dated December 15, 1959, based only on materials on record, excluding the supplementary statement dated October 25, 1960; High Court to then hear and dispose of the reference.",
    "relief_granted": "Remand to High Court for fresh consideration without additional evidence",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"In calling for a supplementary statement of the case under section 66(4) of the Indian Income-tax Act, 1922, the High Court can require the Tribunal to include in such supplementary statement only such material and evidence as may already be on the record but which has not been included in the statement of the case made initially under section 66(1) or section 66(2).\"",
      "speaker": "court",
      "significance": "Core holding from Keshav Mills precedent applied to this case"
    },
    {
      "text": "\"It has no jurisdiction to direct the Appellate Tribunal to collect additional material and make it a part of the supplementary statement.\"",
      "speaker": "court",
      "significance": "Directly addresses the procedural error by High Court"
    }
  ],
  "_case_id": "1967_276",
  "_label": 1,
  "_text_length": 4115,
  "_extracted_at": "2026-02-10T20:23:50.853928"
}