{
  "metadata": {
    "case_name": "Commissioner of Income Tax v. M/s A. Raman & Company",
    "case_year": 1966,
    "court": "Supreme Court of India",
    "judges": [
      "Shah, J."
    ],
    "case_number": "Civil Appeal No. 768 of 1966",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Assessees M/s A. Raman Company are dealers in mill stores and sell to other dealers including M/s A. M. Shah Co. and M/s R. Ambalal Co., owned by Hindu undivided families managed by the partners of the assessees.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "For assessment years 1959-60, 1960-61 and 1961-62, assessees originally assessed by Income-tax Officer, Circle-1, Ward-A, Ahmedabad; partners and HUFs assessed by other ITOs.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Cases of assessees, partners, and HUFs transferred to Income-tax Officer, Group Circle-J, Ahmedabad.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "ITO by letter dated March 20, 1964 informed assessees that from perusal of assessment records, partners contrived to divert profits to HUFs to evade tax, called for objections to reopening assessments for 1959-60, 1960-61, 1961-62.",
      "type": "material",
      "date": "1964-03-20",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Assessees contended ITO had no jurisdiction to reopen as they and HUFs submitted complete returns supported by books, quantity details, and all material facts.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "ITO issued three separate notices under s. 147 of Income-tax Act, 1961 to show cause why assessments should not be reopened.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Gujarat High Court in Special Civil Application No. 332 of 1964 quashed notices and restrained ITO from proceedings, judgment dated December 18, 1964.",
      "type": "procedural",
      "date": "1964-12-18",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Special leave granted by Supreme Court; Commissioner appealed.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "ITO's affidavit stated that in discussions, learnt assessees sold to HUFs in earlier years, HUFs earned substantial profits on resale over assessees' margin, concluded creation of HUF business was subterfuge to divert profits.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether Income-tax Officer had jurisdiction under s. 147(b) of Income-tax Act, 1961 to reopen assessments, specifically whether he had 'reason to believe' income escaped assessment 'in consequence of information in his possession'.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Assessees submitted complete returns with books, details, and material facts; ITO had no jurisdiction to reopen.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Reliance on cl. (b) of s. 147; ITO convinced from records partners diverted profits to HUFs; information from records post-transfer gives reason to believe income escaped.",
      "supporting_facts": [
        "f4",
        "f9"
      ],
      "legal_basis": "s. 147(b) Income-tax Act, 1961"
    },
    {
      "id": "ra2",
      "text": "If by device income normally for assessee divided, ITO can tax entire income to assessee.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Under s. 147(b), 'reason to believe' income escaped in consequence of information is condition precedent; information means knowledge from external source concerning facts or law.",
      "addresses_issue": "i1",
      "key_observation": "Information furnishes starting point; not necessary previous assessment vitiated by error."
    },
    {
      "id": "cr2",
      "text": "High Court can quash notice if condition precedent absent, but cannot re-appraise whether ITO should proceed; only if prima facie no reason to believe.",
      "addresses_issue": "i1",
      "key_observation": "HC cannot investigate correctness of inferences from information."
    },
    {
      "id": "cr3",
      "text": "Information could have been available earlier but obtained later still valid; irrelevant if could be gathered from prior disclosures.",
      "addresses_issue": "i1",
      "key_observation": "Justification arises if post-assessment information gives reason to believe escape."
    },
    {
      "id": "cr4",
      "text": "ITO's averments do not establish reason to believe: no case of benami or sham; law does not tax unearned potential profit; device to divert pre-accrual ok if legal.",
      "addresses_issue": "i1",
      "key_observation": "No obligation to maximize profit; income not earned by assessee not taxable as his."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "ITO had no reason to believe income chargeable to tax escaped assessment; notices without jurisdiction.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Calcutta Discount Co. Ltd. v. Income-tax Officer, Companies District I, Calcutta",
      "citation": null,
      "treatment": "followed",
      "relevance": "High Court power to prohibit reassessment if no jurisdiction; conditions for writ of prohibition."
    }
  ],
  "statutes_cited": [
    {
      "name": "Income-tax Act, 1961",
      "sections": [
        "s. 147(b)",
        "s. 148-153"
      ],
      "relevance": "Jurisdiction to reopen assessments if reason to believe income escaped in consequence of information."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 226"
      ],
      "relevance": "High Court power to quash notices and issue writs if no jurisdiction."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal dismissed; High Court order quashing notices under s. 147 confirmed as ITO lacked reason to believe income escaped assessment.",
    "relief_granted": "High Court order upheld restraining ITO from proceedings.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "'the Income-tax Officer has in consequence of information in his possession reason to believe that income chargeable to tax has escaped assessment'",
      "speaker": "court",
      "significance": "Defines condition precedent for jurisdiction under s. 147(b)."
    },
    {
      "text": "'Information in the context in which it occurs must... mean instruction or knowledge derived from an external source concerning facts or particulars, or as to law'",
      "speaker": "court",
      "significance": "Clarifies meaning of 'information' for reopening."
    },
    {
      "text": "'the law does not oblige a trader to make the maximum profit that he can out of his trading transactions. Income which accrues to a trader is taxable... income which he could have, but has not earned, is not made taxable'",
      "speaker": "court",
      "significance": "Rejects taxing unearned profits; upholds legitimacy of pre-accrual diversion devices."
    }
  ],
  "_case_id": "1967_52",
  "_label": 0,
  "_text_length": 13896,
  "_extracted_at": "2026-02-10T20:20:36.374960"
}