{
  "metadata": {
    "case_name": "B. Seth Champa Lal Ram Swarup v. Commissioner of Income Tax",
    "case_year": 1942,
    "court": "Supreme Court of India",
    "judges": [
      "Sikri J."
    ],
    "case_number": null,
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Assessment year 1942-43, relevant accounting year Samvat 1997-98 corresponding to October 1941.",
      "type": "procedural",
      "date": "1941-10",
      "source": "tribunal"
    },
    {
      "id": "f2",
      "text": "Appellant is B. Seth Champa Lal Ram Swarup, a joint Hindu family headed by Karta Moti Lal.",
      "type": "background",
      "date": null,
      "source": "tribunal"
    },
    {
      "id": "f3",
      "text": "Sum of Rs. 3,25,000 due to assessee from Shanti Lal, proprietor of M/s. Amolakchand Mewaram; Shanti Lal is younger brother of Moti Lal and adopted by a cousin of Moti Lal.",
      "type": "material",
      "date": null,
      "source": "tribunal"
    },
    {
      "id": "f4",
      "text": "M/s. Amolakchand Mewaram had current account with assessee for years with large cash payments, credits for sales of cotton and goods by assessee on their behalf, debits for speculation losses and differences paid by assessee.",
      "type": "background",
      "date": null,
      "source": "tribunal"
    },
    {
      "id": "f5",
      "text": "In Samvat 1987-88 (ending November 1931), advances to M/s. Amolakchand Mewaram rose to Rs. 11 lakhs.",
      "type": "material",
      "date": "1931-11",
      "source": "tribunal"
    },
    {
      "id": "f6",
      "text": "In Samvat 1987-88, assessee took mortgage of immovable property of M/s. Amolakchand Mewaram for Rs. 3 lakhs, credited to current account, debited to new 'Amolakchand Mewaram Mortgage account'.",
      "type": "material",
      "date": "1931",
      "source": "tribunal"
    },
    {
      "id": "f7",
      "text": "Next year, assessee took over interest of M/s. Amolakchand Mewaram in managing agency of Edward Mills Limited and shares for Rs. 4,50,000, credited to current account.",
      "type": "material",
      "date": "1932",
      "source": "tribunal"
    },
    {
      "id": "f8",
      "text": "On November 3, 1932, assessee obtained pro-note from M/s. Amolakchand Mewaram for Rs. 3,25,000, credited to current account, debited to new 'Amolakchand Mewaram pro-note account'. After adjustments, current account debit balance Rs. 25,626.",
      "type": "material",
      "date": "1932-11-03",
      "source": "tribunal"
    },
    {
      "id": "f9",
      "text": "Thereafter, only petty transactions; at commencement of Samvat 1994-95, current account debit Rs. 9,017.",
      "type": "material",
      "date": null,
      "source": "tribunal"
    },
    {
      "id": "f10",
      "text": "Assessee purchased Amolakchand Mewaram's card of East India Cotton Association for Rs. 20,000, resulting in credit balance of Rs. 11,253 in favour of M/s. Amolakchand Mewaram.",
      "type": "material",
      "date": "Samvat 1994-95",
      "source": "tribunal"
    },
    {
      "id": "f11",
      "text": "Thereafter, one debit entry of Rs. 980 in Samvat 1996-97; in relevant year, balance Rs. 10,273 credit to Amolakchand Mewaram.",
      "type": "material",
      "date": "Samvat 1996-97",
      "source": "tribunal"
    },
    {
      "id": "f12",
      "text": "Mortgage and pro-note accounts carried forward yearly, no interest charged on them.",
      "type": "material",
      "date": null,
      "source": "tribunal"
    },
    {
      "id": "f13",
      "text": "Interest charged on current account up to Samvat 1988-89 (1931-32) only.",
      "type": "material",
      "date": "1931-32",
      "source": "tribunal"
    },
    {
      "id": "f14",
      "text": "Assessee adjudged insolvent by Bombay High Court in July 1938; scheme of composition sanctioned, adjudication annulled on April 15, 1941.",
      "type": "background",
      "date": "1938-07",
      "source": "tribunal"
    },
    {
      "id": "f15",
      "text": "Rs. 16,005 due from Mansukh Lal Panthu Lal; decree obtained by assessee from Bombay High Court in 1932, executable for 12 years, but no effort made to execute.",
      "type": "material",
      "date": "1932",
      "source": "tribunal"
    },
    {
      "id": "f16",
      "text": "Appellate Tribunal held money not advanced in course of money-lending business; Rs. 3,25,000 became bad long ago; Rs. 16,005 not advanced in money-lending business and bad prior to year.",
      "type": "procedural",
      "date": null,
      "source": "tribunal"
    },
    {
      "id": "f17",
      "text": "High Court answered all three questions against assessee, in favour of department.",
      "type": "procedural",
      "date": null,
      "source": "high_court"
    },
    {
      "id": "f18",
      "text": "Assessee obtained special leave, appeal before Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether there was any material before the Tribunal for the finding that neither of the two amounts of Rs. 3,25,000 and Rs. 16,005 was a bad debt arising during the course of the money-lending business of the assessee?",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "If the answer is in the affirmative, what was the true nature of the transactions and whether in view of the true nature of the transactions, the debts could still be claimed as bad debts in working out the assessable income of the assessee?",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether there was any material on which the Tribunal could arrive at the finding that the debts had become bad prior to the year of account in question?",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "There was no sufficient material before the Tribunal for the findings arrived at.",
      "supporting_facts": [
        "f16"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "In order to succeed in claiming a debt as bad, assessee must establish debt good at commencement of relevant year and became bad during year; pro-note from 1932, no interest charged, no legal steps; evidence vague, no hope of recovery.",
      "supporting_facts": [
        "f8",
        "f12",
        "f13"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Not necessary to deal with questions 1 and 2 because if answer to question 3 against assessee, appeal fails.",
      "addresses_issue": "i3",
      "key_observation": "Question limited to whether material existed for Tribunal's finding."
    },
    {
      "id": "cr2",
      "text": "Not open to assessee to argue Tribunal should not have come to findings; concerned only if material on which Tribunal could arrive at findings that debts bad prior to year.",
      "addresses_issue": "i3",
      "key_observation": "There was material: for Rs. 3,25,000 - family relation, major assets taken over by 1932 including pro-note, no interest, no recovery steps; for Rs. 16,005 - decree 1932, no execution steps."
    },
    {
      "id": "cr3",
      "text": "From perusal of Tribunal findings and High Court reasoning, clear there was material for Tribunal conclusion.",
      "addresses_issue": "i3",
      "key_observation": "Material includes Shantilal brother of Motilal, pro-note when major assets taken, last asset card taken Samvat 1994-95, no interest, no legal steps."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "There was material on which Tribunal could arrive at finding that debts became bad prior to year of account.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Income-tax Act, 1922",
      "sections": [
        "Section 66(2)"
      ],
      "relevance": "Questions referred under this section by High Court to Tribunal."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court upheld High Court and Tribunal findings that there was material to conclude debts of Rs. 3,25,000 and Rs. 16,005 became bad prior to relevant accounting year; no need to decide other questions; appeal dismissed.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "In order to succeed in claiming that a debt as become bad it is incumbent upon the assessee to establish that the debt was good immediately at the commencement of the relevant year of account and that it had become bad during the year of account.",
      "speaker": "high_court",
      "significance": "Sets standard for bad debt claim, applied to reject assessee's claim."
    },
    {
      "text": "What we are concerned with is whether there is any material on which the Tribunal could arrive at the findings that the debts had become bad prior to the year of account in question.",
      "speaker": "court",
      "significance": "Limits scope of appeal to existence of material, not correctness of finding."
    }
  ],
  "_case_id": "1967_190",
  "_label": 0,
  "_text_length": 8449,
  "_extracted_at": "2026-02-10T20:22:01.007780"
}