{
  "metadata": {
    "case_name": "Assessees v. Commissioner of Income-tax",
    "case_year": 1966,
    "court": "Supreme Court of India",
    "judges": [
      "Shah, J."
    ],
    "case_number": "Civil Appeals Nos. 1425 and 1426 of 1966",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "By order dated January 30, 1944, the Collector of Madras, exercising power under r. 75A of the Defence of India Rules, 1939, requisitioned a property known as Lutterals Gardens belonging to the assessees.",
      "type": "procedural",
      "date": "1944-01-30",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The property continued to remain under requisition till it vested in the Government of Madras absolutely in consequence of an order made on May 24, 1949 by the Collector of Madras under s. 5 of the Requisitioned Land Continuance of Powers Act, 1947, declaring the intention of the Government of Madras to acquire that property.",
      "type": "procedural",
      "date": "1949-05-24",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The assessees declined the offer made by the Collector to pay Rs. 2,40,000/- as compensation for acquisition of the property and interest at the rate of 6% thereon from the date of notification for acquisition.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "The dispute relating to compensation payable to the assessees was referred to the Chief Judge of the Court of Small Causes, Madras.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "By order of the High Court of Madras in appeal from the order of the Chief Judge it was adjudged that the assessees be paid Rs. 5,00,000/- as compensation for the property. The High Court also awarded interest at the rate of 6% on the amount of compensation from the date of notification for acquisition.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "During the two previous years corresponding to the assessment years 1955-56 and 1956-57 the assessees received, pursuant to the order of the High Court, a total sum of Rs. 6,28,716/-.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "In proceedings for assessment of tax for the assessment years 1955-56 and 1956-57, the Income-tax Officer apportioned the amount of Rs. 1,28,716/- on the basis of actual receipts in the two previous years and assessed the amounts so apportioned to income-tax.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "The Appellate Assistant Commissioner held that the apportioned amounts were of the nature of revenue and not capital receipts, but in his view the income received was liable to be calculated on accrual basis year after year from the date of the notification for acquisition, and on that account the assessments of the previous years from 1950-51 to 1954-55 should be reopened and the interest which accrued in those years should be assessed.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "The Commissioner of Income-tax and the assessees appealed to the Appellate Tribunal against the order of the Appellate Assistant Commissioner.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "The assessees submitted that Rs. 1,28,716/- received as interest being part of compensation were not assessable to tax.",
      "type": "admitted",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f11",
      "text": "The Commissioner claimed that the Income-tax Officer was justified in assessing the amounts in the years in which they were received.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f12",
      "text": "The Income-tax Appellate Tribunal accepted the contention of the assessees that the receipts were not assessable to tax because they were of the nature of capital receipts.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "At the instance of the Commissioner, the Tribunal referred two questions to the High Court of Madras.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "The High Court answered the first question in the affirmative and declined to answer the second question because it did not arise out of the order of the Tribunal.",
      "type": "material",
      "date": "1962-10-29",
      "source": "lower_court"
    },
    {
      "id": "f15",
      "text": "The assessees have appealed to this Court by special leave.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the sum of Rs. 1,28,716/- is assessable as income under any of the provisions of the Act?",
      "framed_by": "tribunal"
    },
    {
      "id": "i2",
      "text": "If the answer is in the affirmative, the assessment years in which the amount falls to be assessed by suitable apportionment.",
      "framed_by": "tribunal"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Rs. 1,28,716/- received as interest being part of compensation were not assessable to tax as they were of the nature of capital receipts.",
      "supporting_facts": [
        "f10"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "There is no provision in the Requisitioned Land Continuance of Powers Act, 1947 and the Defence of India Act, 1939, and the rules framed thereunder for payment of interest on the amount of compensation. The owner is paid not the market value of the property, but compensation determined in accordance with a highly artificial scheme, and the interest paid bears the same quality as compensation for deprivation of property and is on that account a capital receipt not exigible to tax.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": "Requisitioned Land Continuance of Powers Act, 1947; Defence of India Act, 1939 s.19; Commissioners of Inland Revenue v. Ballantine; Simpson v. Executors of Bonner Maurice"
    },
    {
      "id": "pa3",
      "text": "The application of ss. 28 and 34 of the Land Acquisition Act in proceedings for arbitration under the Requisitioned Land Continuance of Powers Act, 1947, was expressly excluded by s. 19(1)(g) of the Defence of India Act.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": "Defence of India Act, 1939 s.19(1)(g)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The Income-tax Officer was justified in assessing the amounts in the years in which they were received.",
      "supporting_facts": [
        "f7",
        "f11"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Section 5 of the Requisitioned Land Continuance of Powers Act, 1947 authorises the Government to acquire the land by publishing a notice. Section 6 provides that compensation payable shall be determined in accordance with s.19 of the Defence of India Act, 1939. Section 19 sets out principles for determining compensation, and the arbitrator must have regard to s.23(1) of the Land Acquisition Act, 1894. Neither s.19(1) of the Defence of India Act nor the Rules provide for interest on compensation.",
      "addresses_issue": "i1",
      "key_observation": "Interest was offered by Collector and awarded by High Court."
    },
    {
      "id": "cr2",
      "text": "In Dr. Shamlal Narula v. Commissioner of Income-tax, statutory interest under s.34 of Land Acquisition Act on compensation is revenue receipt liable to tax as it is for delayed payment.",
      "addresses_issue": "i1",
      "key_observation": "Interest represents profit from use of money or loss from not having it."
    },
    {
      "id": "cr3",
      "text": "Principle of Shamlal Narula applies if obligation to pay interest arises because claimant kept out of money, whether statutory or contractual.",
      "addresses_issue": "i1",
      "key_observation": "Need to determine if obligation arose out of statute or award."
    },
    {
      "id": "cr4",
      "text": "In Satinder Singh v. Amrao Singh, interest awarded on compensation under similar scheme; held implied agreement to pay interest when possession taken, and ss.28,34 of LA Act apply despite no express provision.",
      "addresses_issue": "i1",
      "key_observation": "Claim for interest based on general rule that deprivation of possession entitles to interest in lieu."
    },
    {
      "id": "cr5",
      "text": "Schemes of Requisitioned Land Continuance of Powers Act, 1947 and East Punjab Act similar; s.19(1)(g) of Defence of India Act does not exclude substantive law on interest payment.",
      "addresses_issue": "i1",
      "key_observation": "Provisions on interest not part of arbitration law."
    },
    {
      "id": "cr6",
      "text": "Ballantine and Simpson distinguished: liability to pay interest there arose under award/tribunal order as part of damages/compensation; here interest obligation from implied agreement/statute akin to LA Act.",
      "addresses_issue": "i1",
      "key_observation": "Interest here for being kept out of money, taxable."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The sum of Rs. 1,28,716/- being interest on compensation is assessable as income under the Income-tax Act as a revenue receipt.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Dr. Shamlal Narula v. Commissioner of Income-tax, Punjab, Jammu and Kashmir, Himachal Pradesh and Patiala",
      "citation": "53 I.T.R. 151",
      "treatment": "followed",
      "relevance": "Interest on delayed compensation under Land Acquisition Act s.34 is revenue receipt taxable as income."
    },
    {
      "case_name": "Commissioners of Inland Revenue v. Ballantine",
      "citation": "8 T.C. 595",
      "treatment": "distinguished",
      "relevance": "Interest element in arbitration award for damages is part of compensation, not taxable interest."
    },
    {
      "case_name": "Simpson, H.M. Inspector of Taxes v. Executors of Bonner Maurice as Executor of Edward Kay",
      "citation": "14 T.C. 580",
      "treatment": "distinguished",
      "relevance": "Compensation computed as interest under peace treaty is capital, not income."
    },
    {
      "case_name": "Satinder Singh Ors. v. Amrao Singh and Ors.",
      "citation": "1961 3 S.C.R. 676",
      "treatment": "followed",
      "relevance": "Implied agreement to pay interest on compensation from dispossession; ss.28,34 LA Act apply."
    }
  ],
  "statutes_cited": [
    {
      "name": "Requisitioned Land Continuance of Powers Act, 1947",
      "sections": [
        "Section 5",
        "Section 6"
      ],
      "relevance": "Authorises acquisition; compensation per Defence of India Act s.19."
    },
    {
      "name": "Defence of India Act, 1939",
      "sections": [
        "Section 19"
      ],
      "relevance": "Principles for compensation; arbitrator regards LA Act s.23(1); no provision for interest."
    },
    {
      "name": "Land Acquisition Act, 1894",
      "sections": [
        "Section 23(1)",
        "Section 28",
        "Section 34"
      ],
      "relevance": "Applied for compensation determination and interest on delayed payment."
    },
    {
      "name": "Defence of India Rules, 1939",
      "sections": [
        "Rule 75A"
      ],
      "relevance": "Power to requisition property."
    },
    {
      "name": "Defence of India Payment of Compensation and Arbitration Rules, 1943",
      "sections": [],
      "relevance": "Directs payment of compensation as soon as practicable; no interest provision."
    },
    {
      "name": "East Punjab Acquisition and Requisition of Immovable Property (Temporary Powers) Act, 1948",
      "sections": [
        "Section 5"
      ],
      "relevance": "Similar scheme; arbitrator applies LA Act s.23(1); interest implied."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeals by the assessees against the High Court's affirmative answer to the first question are dismissed, holding the interest of Rs. 1,28,716/- assessable as income.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"interest, whether it is statutory or contractual, represents the profit the creditor might have made if he had the use of the money or the loss he suffered because he had not that use.\"",
      "speaker": "court",
      "significance": "From Shamlal Narula, crux of why interest is revenue receipt."
    },
    {
      "text": "\"Stated broadly the act of taking possession of immovable property generally implied an agreement to pay interest on the value of the property.\"",
      "speaker": "court",
      "significance": "From Satinder Singh, basis for implied obligation to pay interest."
    },
    {
      "text": "\"the interest calculation is used in modum aestimationis only. The interest is such merely in name, for it truly constitutes that part of the compensation decerned for which is attributable to the fact that the claimant has been kept out of his due.\"",
      "speaker": "court",
      "significance": "From Ballantine, why distinguished: interest here not mere estimation in damages."
    }
  ],
  "_case_id": "1967_195",
  "_label": 0,
  "_text_length": 18271,
  "_extracted_at": "2026-02-10T20:22:12.451852"
}