{
  "metadata": {
    "case_name": "Swastik Oil Mills Ltd. v. Deputy Commissioner of Sales Tax",
    "case_year": 1967,
    "court": "Supreme Court of India",
    "judges": [
      "Bhargava, J."
    ],
    "case_number": "Civil Appeal No. 637 of 1967",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Swastik Oil Mills Ltd., appellant, carries on business of manufacturing vegetable oils, soaps and other products and selling them in India as well as exporting them outside India. Registered as a dealer under Bombay Sales Tax Acts: 1946 (Act 5), 1953 (Act 3), 1959 (Act 51).",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Appellant assessed to sales tax on turnover for periods 1st April 1948 to 31st March 1950, and 1st April 1950 to 31st March 1951 based on returns submitted by it.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "In returns, appellant claimed exemption from tax for turnover representing despatches/transfers of goods from Head Office Bombay to Depots/Branches in other States in India, and for sales in course of inter-State trade after 26th January 1950.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "Sales Tax Officer rejected both claims in assessment order dated 2nd January 1954.",
      "type": "procedural",
      "date": "1954-01-02",
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "Appellant appealed to Assistant Collector of Sales Tax. Appellate order dated 29th October 1956 accepted claim re despatches to Depots/Branches in other States, reduced tax by Rs. 19,240-15-6 for first period and Rs. 97,208/- for second period, directed refund. Disallowed inter-State sales claim.",
      "type": "procedural",
      "date": "1956-10-29",
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "Revisions filed by appellant against rejection of inter-State sales claim were pending.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "On 7th January 1963, Deputy Commissioner of Sales Tax, Bombay City Division, issued notice in Form XXIV under section 31 of Bombay Sales Tax Act 1953, proposing to revise suo motu appellate orders re allowance of deduction for goods despatched to Branches outside Maharashtra, as overlooked proviso (b) to sub-clause (ii) of Rule 1 under sub-section (3) of section 6 of Bombay Sales Tax Act 1946 as amended by Act 48 of 1949.",
      "type": "procedural",
      "date": "1963-01-07",
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "Appellant appeared before Deputy Commissioner, raised objections, requested proceedings be dropped. Request not accepted.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "Appellant filed petition under Article 226 in Bombay High Court challenging notice dated 7th January 1963, praying quashing and restraint on action. Petition dismissed by judgment and order dated January 27, 1966 in Misc. Application No. 112 of 1963.",
      "type": "procedural",
      "date": "1966-01-27",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Appeal to Supreme Court on certificate granted by High Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether Deputy Commissioner, in exercise of revisional powers under Bombay Sales Tax Acts, can only proceed on material already on record and is not entitled to act on conjecture or institute enquiry to include additional material.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether notice issued on 7th January 1963 under Act of 1953 was valid given repeal by Act of 1959, and whether time-barred under s.57 of 1959 Act (5 years from order date).",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether proceedings under Act of 1946 barred by limitation of reasonable time, as no express limitation in s.22 of 1946 Act or s.31 of 1953 Act.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Deputy Commissioner can only proceed on material already on record, not on conjecture or institute enquiry for additional material. Cited State of Andhra Pradesh v. T. G. Lakshmaiah Setty & Sons.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "Revisional jurisdiction limited to record"
    },
    {
      "id": "pa2",
      "text": "Notice issued in 1963 under repealed 1953 Act; revision only possible under 1959 Act s.57 within 5 years (or 2 years at time), but order of 29/10/1956 was over 6 years old, time-barred.",
      "supporting_facts": [
        "f5",
        "f7"
      ],
      "legal_basis": "Bombay Sales Tax Act 1959 s.57"
    },
    {
      "id": "pa3",
      "text": "If under 1946 Act, proceedings barred by implied reasonable time limitation. Cited State of Orissa v. Debaki Debi; Commissioner of Income-tax v. Narsee Nagjee Co.; Manordas Kalidas v. V.V. Tatke.",
      "supporting_facts": [
        "f5",
        "f7"
      ],
      "legal_basis": "Implied limitation in s.22 Bombay Sales Tax Act 1946"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Revisional notice discloses reasons (overlooked proviso), not mere conjecture.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Revisional authority entitled to examine correctness, legality, propriety; can hold enquiry, admit additional material if necessary, once powers invoked on sufficient ground. Distinguished Andhra case; followed State of Kerala v. M. Cheria Abdulla & Co. Limitations: not trench on other powers.",
      "addresses_issue": "i1",
      "key_observation": "Notice discloses reasons, not conjecture; future enquiry within limits."
    },
    {
      "id": "cr2",
      "text": "Proceedings under 1946 Act continued by s.77 Bombay ST Act 1959 and s.7 Bombay General Clauses Act; repeal does not affect proceedings. Should be under s.22 of 1946 Act, not s.31 of 1953, but provisions similar, mention immaterial.",
      "addresses_issue": "i2",
      "key_observation": "Repeal does not bar revision of 1946 Act orders."
    },
    {
      "id": "cr3",
      "text": "No express or implied limitation period for suo motu revision under s.22(1946)/s.31(1953). Distinguished cases on assessment/reassessment limitations. Not encroaching on s.11A (escaped turnover), as turnover was assessed by STO, set aside in appeal.",
      "addresses_issue": "i3",
      "key_observation": "Only limitations per Cheria Abdulla case; proceedings competent."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Revisional authority can hold enquiry/add material; proceedings not affected by repeals; no time bar; proceedings competent.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Repeal of prior Acts does not affect ongoing proceedings under those Acts per savings clauses.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "No limitation for suo motu revision unless encroaching other powers; here not applicable.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "State of Andhra Pradesh v. T. G. Lakshmaiah Setty & Sons",
      "citation": "12 S.T.C. 663",
      "treatment": "distinguished",
      "relevance": "Held conjecture not basis for revision; Court rejects this limitation."
    },
    {
      "case_name": "State of Kerala v. M. Cheria Abdulla & Co.",
      "citation": "1965 1 S.C.R. 601",
      "treatment": "followed",
      "relevance": "Revisional authority can hold enquiry beyond record, subject to limits."
    },
    {
      "case_name": "State of Orissa v. Debaki Debi",
      "citation": "15 S.T.C. 153",
      "treatment": "distinguished",
      "relevance": "General limitation proviso inapplicable here."
    },
    {
      "case_name": "Commissioner of Income-tax v. Narsee Nagjee Co.",
      "citation": "31 I.T.R. 164",
      "treatment": "distinguished",
      "relevance": "Reassessment limitation not applicable to revision."
    },
    {
      "case_name": "Manordas Kalidas v. V. V. Tatke",
      "citation": "11 S.T.C. 87",
      "treatment": "distinguished",
      "relevance": "Revision for escaped turnover should use s.11A; decision correct but reasoning flawed."
    },
    {
      "case_name": "Maharaj Kumar Kamal Singh v. Commissioner of Income-tax",
      "citation": "35 I.T.R. 1",
      "treatment": "distinguished",
      "relevance": "Reassessment possible where escape under assessing officer's order."
    }
  ],
  "statutes_cited": [
    {
      "name": "Bombay Sales Tax Act, 1946",
      "sections": [
        "s.6(3) Rule 1(ii)(b) as amended by Act 48/1949",
        "s.11",
        "s.11A",
        "s.22"
      ],
      "relevance": "Governs assessment, appeal, revision; overlooked proviso basis for revision."
    },
    {
      "name": "Bombay Sales Tax Act, 1953",
      "sections": [
        "s.31"
      ],
      "relevance": "Revisional powers; notice issued under, but proceedings under 1946 Act."
    },
    {
      "name": "Bombay Sales Tax Act, 1959",
      "sections": [
        "s.57",
        "s.76",
        "s.77"
      ],
      "relevance": "Repeal and savings; continues prior Acts for past liabilities."
    },
    {
      "name": "Bombay General Clauses Act, 1904",
      "sections": [
        "s.7"
      ],
      "relevance": "Repeal does not affect accrued rights/liabilities or proceedings."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 226"
      ],
      "relevance": "Basis for writ petition."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court dismissed the appeal, holding that the revisional proceedings initiated by the Deputy Commissioner under the Bombay Sales Tax Act 1946 are competent and not barred by limitation or jurisdictional defects. High Court order upheld; no writ issued.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"Whenever a power is conferred on an authority to revise an order, the authority is entitled to examine the correctness, legality and propriety of the order and to pass such suitable orders as the authority may think fit... admit additional material.\"",
      "speaker": "court",
      "significance": "Defines scope of revisional powers including enquiry."
    },
    {
      "text": "\"The repeal of the Act of 1953 by the Act of 1959 did not affect the rights and liabilities of the assessee to tax under the Act of 1953 or the Act of 1946.\"",
      "speaker": "court",
      "significance": "Clarifies continuity of proceedings post-repeal."
    },
    {
      "text": "\"Section 22 of the Act of 1946 and s.31 of the Act of 1953 do not lay down any limitation for exercise of the power of revision... suo motu.\"",
      "speaker": "court",
      "significance": "Rejects implied time bar for revision."
    }
  ],
  "_case_id": "1967_291",
  "_label": 0,
  "_text_length": 27306,
  "_extracted_at": "2026-02-10T20:23:54.772986"
}