{
  "metadata": {
    "case_name": "Firestone Tyre & Rubber Co. (P) Ltd. v. Their Workmen",
    "case_year": 1966,
    "court": "Supreme Court of India",
    "judges": [
      "Hidayatullah, J."
    ],
    "case_number": "Civil Appeal No. 515 of 1966",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Subramaniam was employed as a van driver by Firestone Tyre & Rubber Co. (P) Ltd. since 1953. One of his duties was transportation for delivery of company products.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On May 28, 1963, Subramaniam set out to deliver tyres covered by six invoices to diverse addresses. Invoices Nos. 13815 and 13816 concerned eight tyres (4 per invoice) of specification 8.25 x 20 Tran. H.D.Nyl. 12-PR.",
      "type": "material",
      "date": "1963-05-28",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Subramaniam took delivery of the tyres, signed the six invoices, locked the tyres in his van with a key which he claims never left his possession, and set out with M.V. Das (packer/scooter driver) by his side in the driver's cabin, soon after lunch break.",
      "type": "material",
      "date": "1963-05-28",
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "At about 3.15 p.m. on May 28, 1963, Subramaniam telephoned the company office that two tyres from the two invoices were short. He was asked to return at once.",
      "type": "material",
      "date": "1963-05-28",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "On return, tyres with him were unloaded and counted: short by two. Immediate check of stock held: no excess. Subramaniam maintained tyres were shortloaded or lost/stolen on the way.",
      "type": "material",
      "date": "1963-05-28",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "After investigation, charge-sheet served on Subramaniam for misconduct: Theft, fraud or dishonesty in connection with employer's business or property, with full details, time and place of enquiry, right to defend through workman, produce evidence, cross-examine witnesses. Suspended pending enquiry.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "Enquiry held by Mr. R.M. Coyajee, Industrial Relations Officer. Four witnesses for Company, two for Subramaniam examined. Company filed 20 documents, Subramaniam 2. Coyajee found charge proved, submitted minutes.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Manager, Southern Division informed Subramaniam of conviction of guilt, tentatively decided to dismiss, asked to show cause. Subramaniam showed cause, but dismissed.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "Tyre & Rubber Company's Employees Union raised dispute. Referred by Government of Andhra Pradesh on February 7, 1964: 'Whether the dismissal of Shri K. Subramaniam, van Driver by the employers of Firestone Tyre & Rubber Co. (P) Ltd., Hyderabad is justified? If not, to what relief is he entitled?'",
      "type": "procedural",
      "date": "1964-02-07",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Labour Court (Presiding Officer, Hyderabad) award dated November 23, 1964: Set aside dismissal after finding enquiry opposed to natural justice and conclusion perverse. Ordered reinstatement without back wages.",
      "type": "procedural",
      "date": "1964-11-23",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Subramaniam's letter dated May 30, 1963: Reiterated supplied shorter number of tyres than in invoices.",
      "type": "admitted",
      "date": "1963-05-30",
      "source": "petitioner"
    },
    {
      "id": "f12",
      "text": "In enquiry, Subramaniam stated he would state his case fully.",
      "type": "admitted",
      "date": null,
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the domestic enquiry was conducted properly in accordance with principles of natural justice.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the conclusion of the domestic enquiry that the charge of misconduct was proved was perverse.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether the Labour Court was justified in setting aside the dismissal and ordering reinstatement without back wages.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "None of the Tribunal's grounds for holding enquiry invalid has validity: No compulsion to take explanation before charge-sheet; statements of preliminary enquiry not part of record or basis of conclusion; minutes not needed as workman present; evidence of Das properly considered.",
      "supporting_facts": [
        "f6",
        "f7",
        "f10"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Examining delinquent first permissible where accusation based on record or admitted facts, or to narrow issues; no prejudice caused; procedure fairer here.",
      "supporting_facts": [
        "f7",
        "f11",
        "f12"
      ],
      "legal_basis": "Tata Oil Mills Co. Ltd. v. Its Workmen; Sur Enamel Stamping Works Ltd. v. Their Workmen; Meenglas Tea Estate v. Its Workmen; Associated Cement Companies v. Their Workmen; Central Bank of India Ltd. v. Karunamoy Banerjee (followed/distinguished)"
    },
    {
      "id": "pa3",
      "text": "Management entitled to rely on loaders' evidence supported by Subramaniam's repeated admissions of checking tyres at loading; Tribunal exceeded by re-appreciating evidence.",
      "supporting_facts": [
        "f3",
        "f5",
        "f7"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Enquiry opposed to principles of natural justice and conclusion perverse: Held immediately after investigation without workman's explanation; workman examined/cross-examined before evidence against him; no copies of preliminary statements or enquiry minutes supplied; Das's evidence not properly considered.",
      "supporting_facts": [
        "f6",
        "f7",
        "f10"
      ],
      "legal_basis": "Tata Oil Mills Co. Ltd. v. Its Workmen; Sur Enamel Stamping Works Ltd. v. Their Workmen; Meenglas Tea Estate v. Its Workmen; Associated Cement Companies v. Their Workmen"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "No principle compels explanation before charge-sheet if prima facie fault after preliminary enquiry; done here without disadvantage to workman.",
      "addresses_issue": "i1",
      "key_observation": "Calling explanation beforehand could fish for defence."
    },
    {
      "id": "cr2",
      "text": "Preliminary statements not in enquiry record or basis of conclusion; minutes unnecessary as workman present and could inspect; equated wrongly to Art. 311 enquiries.",
      "addresses_issue": "i1",
      "key_observation": "Every opportunity afforded: informed of charge, cross-examined witnesses, led evidence, show cause on findings."
    },
    {
      "id": "cr3",
      "text": "Examining delinquent first not invariable rule; permissible on record/admitted facts or to narrow issues without prejudice; facts here different from cited cases; no objection or disadvantage.",
      "addresses_issue": "i1",
      "key_observation": "Procedure fairer here; ordinarily evidence first, but clear case allows reverse."
    },
    {
      "id": "cr4",
      "text": "Das supported shortloading claim; management entitled to disbelieve Subramaniam/Das and accept loaders' evidence plus Subramaniam's admissions of checking.",
      "addresses_issue": "i2",
      "key_observation": "Tribunal cannot re-appreciate evidence if enquiry proper."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Domestic enquiry was properly conducted in accordance with principles of natural justice.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Tribunal erred in holding enquiry conclusion perverse and in re-appreciating evidence; limited to checking enquiry propriety.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h3",
      "text": "Examining delinquent before management witnesses permissible in clear cases without prejudice.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Tata Oil Mills Co. Ltd. v. Its Workmen",
      "citation": "1963 2 L.L.J. 78",
      "treatment": "distinguished",
      "relevance": "Lay down rule that evidence against delinquent must be led before questioning him; not invariable, inapplicable here."
    },
    {
      "case_name": "Sur Enamel Stamping Works Ltd. v. Their Workmen",
      "citation": "1963 2 L.L.J. 367",
      "treatment": "distinguished",
      "relevance": "Lay down rule that evidence against delinquent must be led before questioning him; not invariable, inapplicable here."
    },
    {
      "case_name": "Meenglas Tea Estate v. Its Workmen",
      "citation": "1963 2 L.L.J. 392",
      "treatment": "distinguished",
      "relevance": "Lay down rule that evidence against delinquent must be led before questioning him; not invariable, inapplicable here."
    },
    {
      "case_name": "Associated Cement Companies v. Their Workmen",
      "citation": "1963 2 L.L.J. 396",
      "treatment": "distinguished",
      "relevance": "Lay down rule that evidence against delinquent must be led before questioning him; not invariable, inapplicable here."
    },
    {
      "case_name": "Central Bank of India Ltd. v. Karunamoy Banerjee",
      "citation": "1968 1 S.C.R. 251",
      "treatment": "followed",
      "relevance": "Enquiry proper where clerk questioned first on admitted fault before formal evidence."
    }
  ],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Article 311"
      ],
      "relevance": "Tribunal wrongly equated domestic enquiry to Art. 311 enquiries; not applicable."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; Labour Court award set aside; dismissal of Subramaniam upheld as justified. No order as to costs. Company stated wages paid pendente lite will not be recovered.",
    "relief_granted": "Dismissal stands; no reinstatement or back wages.",
    "costs": "No order as to costs"
  },
  "key_quotes": [
    {
      "text": "\"It cannot be an invariable rule in all cases. The situation is different where the accusation is based on a matter of record or the facts are admitted.\"",
      "speaker": "court",
      "significance": "Clarifies exception to rule on order of evidence in domestic enquiries."
    },
    {
      "text": "\"All that the Tribunal could do was to see that the enquiry was properly conducted.\"",
      "speaker": "court",
      "significance": "Limits Tribunal's role; no re-appreciation of evidence."
    },
    {
      "text": "\"The Management refused to believe Subramaniam even though he was supported by Das. This the Management was entirely within its right in doing.\"",
      "speaker": "court",
      "significance": "Affirms management's prerogative to accept/reject evidence."
    }
  ],
  "_case_id": "1967_151",
  "_label": 1,
  "_text_length": 14696,
  "_extracted_at": "2026-02-10T20:22:06.361152"
}