{
  "metadata": {
    "case_name": "Roshan Lal Tandon v. Union of India",
    "case_year": 1966,
    "court": "Supreme Court of India",
    "judges": [
      "Ramaswami, J."
    ],
    "case_number": "Writ Petition No. 154 of 1966",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Originally two scales for Train Examiners: Rs. 100-185 (D Grade) and Rs. 150-225 (C Grade). Revised to Rs. 180-240 (D Grade) and Rs. 205-280 (C Grade).",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Railway Board letter No. PC-60/PS5/TP-8 dated February 18, 1961: 50% vacancies in Entry Grade (Rs. 180-240) from Apprentice Train Examiners after 4 years apprenticeship, 50% by promotion from skilled artisans. 20% of annual Apprentice Train Examiners from skilled artisans not more than 35 years old.",
      "type": "material",
      "date": "1961-02-18",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Railway Board letter No. E(S)1-57-TRS/41 dated January 25, 1958: Promotion to Grade C (Rs. 150-225, later Rs. 205-280) on seniority-cum-suitability without distinction between direct entrants and those from skilled artisans.",
      "type": "material",
      "date": "1958-01-25",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Divisional Personnel Officer, New Delhi prepared seniority list for Train Examiners Grade D as on December 31, 1964.",
      "type": "procedural",
      "date": "1964-12-31",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Railway Board notification No. E(NG)65 PMI-26 dated October 27, 1965: From April 1, 1966, Entry Grade (Rs. 180-240) filled exclusively by promotion from artisan staff. Grade C (Rs. 205-280): 80% from Apprentice TXRs after training (5 years general, 3 for diploma holders/artisans), 20% from Grade D TXRs by selection.",
      "type": "material",
      "date": "1965-10-27",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Protection for existing Apprentice TXRs: Those absorbed in Grade D up to March 31, 1966 to be accommodated in 80% Grade C vacancies without selection. Remaining upgraded vacancies in Grade C filled by selection from Grade D TXRs.",
      "type": "material",
      "date": "1966-04-01",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Petitioner Roshan Lal Tandon entered service on March 6, 1954 as skilled fitter, selected for Train Examiner Grade D training on June 5, 1958, confirmed on October 25, 1959.",
      "type": "background",
      "date": "1954-03-06",
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "Petitioner claims one class in Grade D (apprentices and direct recruits from artisans), promotion to C on seniority-cum-suitability irrespective of source.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "Respondents: Reorganization for better technically trained personnel due to complicated designs, modern rolling stock, dieselisation, electrification. Prior promotion seniority-cum-suitability, now 80% direct from apprentices to C, 20% from D by merit selection.",
      "type": "admitted",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f10",
      "text": "Writ Petition No. 154 of 1966 under Art. 32 for mandamus to enforce Railway Board directives granting protection to existing Apprentice Train Examiners and procedure for upgraded vacancies.",
      "type": "procedural",
      "date": "1966",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Writ Petition No. 203 of 1966 has material facts parallel to No. 154.",
      "type": "background",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the Railway Board notification dated October 27, 1965 violates Articles 14 and 16 of the Constitution by discriminating against petitioner (from artisan promotees) in promotion to Grade C Train Examiners in favour of existing Apprentice Train Examiners.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether there is a contractual right to promotion on seniority-cum-suitability that cannot be altered.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Portion of notification giving favourable treatment to direct recruits (Apprentice TXRs) over those from skilled artisans in Grade D for promotion to Grade C is arbitrary, discriminatory, violates Arts. 14 and 16. Once integrated in Grade D, no differentiation for promotion.",
      "supporting_facts": [
        "f2",
        "f3",
        "f7",
        "f8"
      ],
      "legal_basis": "Articles 14 and 16"
    },
    {
      "id": "pa2",
      "text": "Condition of service at entry to Grade D was promotion to C on seniority-cum-suitability (per 1958 letter), contractual right cannot be altered to disadvantage.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": "Contractual rights in service"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "No violation of Arts. 14 and 16. Reorganization to fill Grade C with technically trained personnel due to complex designs, modern stock, higher speeds. 80% direct from apprentices after longer training, 20% from Grade D by merit selection.",
      "supporting_facts": [
        "f5",
        "f6",
        "f9"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Existing apprentices upgraded for parity with future direct recruits to C Grade.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "At time of appointment to Grade D, one class formed by direct recruits and promotees from artisans, integrated, cannot discriminate for promotion to Grade C. Discriminatory to accommodate existing apprentices en bloc in 80% without selection, while 20% for others by selection/merit.",
      "addresses_issue": "i1",
      "key_observation": "Once direct recruits and promotees absorbed in one cadre, they form one class, cannot be discriminated for higher grade."
    },
    {
      "id": "cr2",
      "text": "Falls within principle of Mervyn Collector case: When one source of recruitment to higher grade, cannot apply quota/rotation favouring one sub-group.",
      "addresses_issue": "i1",
      "key_observation": "Grade C promotion from single source (Grade D TXRs), no reservation between sub-categories."
    },
    {
      "id": "cr3",
      "text": "No vested contractual right; government servant has status governed by rules alterable unilaterally. Origin contractual but becomes statutory.",
      "addresses_issue": "i2",
      "key_observation": "Relationship of status, not pure contract; terms governed by statute/rules."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Impugned portion of notification dated October 27, 1965 violates Articles 14 and 16; mandamus to not implement the discriminatory part regarding accommodation of existing apprentices without selection and filling remaining by selection from Grade D.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "No contractual right preventing alteration of service conditions.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Mervyn Collector",
      "citation": "1966 3 S.C.R. 600",
      "treatment": "followed",
      "relevance": "Principle that when one source of recruitment to higher grade, cannot discriminate/apply rotation/quota between sub-categories from lower grade."
    }
  ],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Article 32",
        "Article 14",
        "Article 16",
        "Article 310",
        "Article 311"
      ],
      "relevance": "Art. 32 for writ; Arts. 14,16 violated by discrimination; Arts. 310,311 on government servant status."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Writ petition allowed; mandamus issued directing respondents not to give effect to the impugned discriminatory portion of the October 27, 1965 notification regarding promotion to Grade C Train Examiners. No order as to costs.",
    "relief_granted": "Writ of mandamus quashing specific part of notification.",
    "costs": "No order as to costs"
  },
  "key_quotes": [
    {
      "text": "Once the direct recruits and promotees are absorbed in one cadre, they form one class and they cannot be discriminated for the purpose of further promotion to the higher grade C.",
      "speaker": "court",
      "significance": "Core holding on equality after integration in cadre."
    },
    {
      "text": "The present method by which the respondent puts a direct recruit from the grade of Appraiser, though he is promoted later, above a promotee who is promoted to the grade of Principal Appraiser on an earlier date clearly denies equality of opportunity.",
      "speaker": "court",
      "significance": "Quote from Mervyn Collector explaining analogous discrimination."
    }
  ],
  "_case_id": "1967_325",
  "_label": 1,
  "_text_length": 27766,
  "_extracted_at": "2026-02-10T20:24:40.541891"
}