{
  "metadata": {
    "case_name": "Commissioner of Income-tax v. Anusuya Devi (Estate of Amritlal Ojha)",
    "case_year": 1966,
    "court": "Supreme Court of India",
    "judges": [
      "Shah, J."
    ],
    "case_number": "Civil Appeal No. 2457 of 1966",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Amritlal died on October 18, 1944.",
      "type": "background",
      "date": "1944-10-18",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "For assessment year 1945-46, estate of Amritlal assessed to tax on total income of Rs. 22,160 from salary and other sources.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "In January 1946, Anusuya Devi, widow of Amritlal, encashed high denomination notes of value Rs. 5,84,000.",
      "type": "material",
      "date": "1946-01",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Declaration under High Denomination Bank Notes Demonetisation Ordinance, 1946: Sum of Rs. 5,84,000 in notes made over/directed to be made over by deceased husband Amritlal Ojha at Rajkot in April 1944 for benefit of declarant and her 8 minor sons.",
      "type": "material",
      "date": "1946-01",
      "source": "respondent"
    },
    {
      "id": "f5",
      "text": "Reasons in declaration: Held in trust for minors, as price deposit or securities; for greater safety held in cash.",
      "type": "material",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f6",
      "text": "In reassessment for 1945-46, attorney for Anusuya Devi stated Amritlal gave gifts over last 30 years to wife and set apart money for wife and children; fund accumulated in cupboard found after death.",
      "type": "material",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f7",
      "text": "Income-tax Officer disbelieved explanation, brought Rs. 5,84,000 to tax as income of Amritlal for 1944-45 from undisclosed source.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Appellate Assistant Commissioner agreed with ITO.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Before Tribunal, Anusuya Devi filed affidavit: From time to time during married life, Amritlal made presents of cash on birthdays, anniversaries etc., total Rs. 5,84,600, as provision for her and children, stridhan property in her possession.",
      "type": "material",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f10",
      "text": "Tribunal admitted Anusuya's affidavit but rejected affidavit of son Gunvantray as introducing new facts not disclosed before authorities.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Tribunal disbelieved case due to discrepancies in statements, improbability of gifts over 20-30 years all in thousand rupee notes; upheld tax as undisclosed income 1944-45.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "In s.66(1) application to Tribunal, Anusuya asserted declaration details: Rs.4,94,000 deposited with Bank of India Bombay in Aug/Sep 1945, transferred to Calcutta, cheque by major son Bhupatray Ojha for Rs.4,94,000, received 494 pieces of Rs.1000 notes made over to her.",
      "type": "material",
      "date": "1945-08 to 1945-09",
      "source": "respondent"
    },
    {
      "id": "f13",
      "text": "Tribunal rejected s.66(1) application on 11 questions.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Calcutta High Court directed Tribunal to state case on question: Whether Tribunal erred in law by basing decision on part of evidence ignoring statement re withdrawal of Rs.4,94,000 by 494 pieces of Rs.1000 notes from bank.",
      "type": "procedural",
      "date": "1963-09-13",
      "source": "lower_court"
    },
    {
      "id": "f15",
      "text": "Tribunal in compliance noted statement in s.66(1) petition materially different from ITO order, not considered at appeal hearing, original declaration not produced.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f16",
      "text": "High Court answered question in affirmative, held Tribunal ignored part of declaration re 494 notes from bank, doubted statements attributed to Anusuya, opportunity to clear discrepancies should have been given; set aside Tribunal order.",
      "type": "procedural",
      "date": "1963-09-13",
      "source": "lower_court"
    },
    {
      "id": "f17",
      "text": "Entire record before ITO and AAC missing, not traced.",
      "type": "background",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the question referred by High Court direction arose out of the Tribunal's order.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether High Court can answer a question not arising out of Tribunal order even if directed to refer it.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether Tribunal ignored relevant evidence regarding source of 494 notes.",
      "framed_by": "lower_court"
    },
    {
      "id": "i4",
      "text": "Whether Rs. 5,84,000 was income of Amritlal for 1944-45.",
      "framed_by": "respondent"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Statement re 494 notes from bank cheque first made in s.66(1) petition, not before ITO, AAC or Tribunal; Tribunal not apprised, no opportunity to test.",
      "supporting_facts": [
        "f7",
        "f9",
        "f11",
        "f12"
      ],
      "legal_basis": "Income Tax Act s.66(1), s.66(2)"
    },
    {
      "id": "pa2",
      "text": "High Court cannot direct reference on question not put to Tribunal; cannot answer question not arising out of order.",
      "supporting_facts": [
        "f13",
        "f14",
        "f15"
      ],
      "legal_basis": "CIT v. Scindia Steam Navigation Co. Ltd. (42 I.T.R. 589)"
    },
    {
      "id": "pa3",
      "text": "No plea before Tribunal re statements not made by Anusuya or lack of opportunity to clear discrepancies; cannot raise natural justice violation first in High Court.",
      "supporting_facts": [
        "f16"
      ],
      "legal_basis": null
    },
    {
      "id": "pa4",
      "text": "Cannot reframe question or call supplementary statement to introduce new evidence or reopen fact enquiry.",
      "supporting_facts": [
        "f12"
      ],
      "legal_basis": "Keshav Mills Ltd. v. CIT (56 I.T.R. 365); Narain Swadeshi Weaving Mills v. CEPT (26 I.T.R. 765)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Tribunal ignored part of declaration re 494 notes received from bank via son's cheque.",
      "supporting_facts": [
        "f12"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Statements attributed by AAC not made by her; opportunity to clear discrepancies denied.",
      "supporting_facts": [
        "f6",
        "f9"
      ],
      "legal_basis": null
    },
    {
      "id": "ra3",
      "text": "Request to reframe referred question and order supplementary statement.",
      "supporting_facts": [
        "f12"
      ],
      "legal_basis": null
    },
    {
      "id": "ra4",
      "text": "Direct SC to require reference on whether material to hold Rs.5,84,000 income of 1944-45; cannot assume all earned after April 1, 1944.",
      "supporting_facts": [
        "f4",
        "f11"
      ],
      "legal_basis": "s.66(1)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Statement re 494 notes first in s.66(1) petition, not before lower authorities or Tribunal; Tribunal decided on evidence before it.",
      "addresses_issue": "i3",
      "key_observation": "No fault with Tribunal observations on improbability of all high denomination notes."
    },
    {
      "id": "cr2",
      "text": "High Court bound only by questions arising out of Tribunal order; can decline academic/irrelevant questions even if referred.",
      "addresses_issue": "i1",
      "key_observation": "HC cannot answer question not arising out of order merely because it directed reference."
    },
    {
      "id": "cr3",
      "text": "Power to reframe/clarify question limited; cannot reopen fact enquiry or admit new evidence via supplementary statement.",
      "addresses_issue": "i2",
      "key_observation": "Supplementary only on existing record material."
    },
    {
      "id": "cr4",
      "text": "Question whether Rs.5,84,000 income of 1944-45 not referred; new questions cannot be raised; rejection of reference final.",
      "addresses_issue": "i4",
      "key_observation": "No power to direct fresh reference without appeal."
    },
    {
      "id": "cr5",
      "text": "Disturbing that assessment records missing due to gross negligence.",
      "addresses_issue": null,
      "key_observation": "Startling revelation."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "High Court order cannot be sustained; question did not arise out of Tribunal order.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "High Court not bound to answer question not arising out of Tribunal order even if directed to refer it.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h3",
      "text": "Answer to referred question in negative.",
      "resolves_issue": "i3",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Chainrup Sampatram v. Commissioner of Income-tax, West Bengal",
      "citation": "20 I.T.R. 484",
      "treatment": "referred",
      "relevance": "HC not open to hold contrary to Tribunal's decision on whether question arises out of order when directing reference."
    },
    {
      "case_name": "Commissioner of Income-tax v. Scindia Steam Navigation Co. Ltd.",
      "citation": "42 I.T.R. 589",
      "treatment": "followed",
      "relevance": "HC cannot direct Tribunal to state case on question not invited/asked if Tribunal not asked to consider if it arises."
    },
    {
      "case_name": "Keshav Mills Ltd. v. Commissioner of Income-tax, Bombay North, Ahmedabad",
      "citation": "56 I.T.R. 365",
      "treatment": "followed",
      "relevance": "Supplementary statement only on existing record if insufficient."
    },
    {
      "case_name": "Narain Swadeshi Weaving Mills v. Commissioner of Excess Profits Tax",
      "citation": "26 I.T.R. 765",
      "treatment": "distinguished",
      "relevance": "Does not lay general proposition for reframing to admit new evidence; merely reframed to bring out real issue."
    }
  ],
  "statutes_cited": [
    {
      "name": "Income-tax Act",
      "sections": [
        "s.66(1)",
        "s.66(2)"
      ],
      "relevance": "Reference procedure; Tribunal states case only on questions arising out of order; HC directs if refuses wrongly."
    },
    {
      "name": "High Denomination Bank Notes (Demonetisation) Ordinance, 1946",
      "sections": [
        "s.6"
      ],
      "relevance": "Declaration required for encashing notes."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; High Court order dated September 13, 1963 set aside; answer to referred question in negative.",
    "relief_granted": "Restoration of Tribunal order taxing Rs. 5,84,000 as undisclosed income.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"The High Court may only answer a question referred to it by the Tribunal the High Court is however not bound to answer a question merely because it is raised and referred.\"",
      "speaker": "court",
      "significance": "Core holding on HC powers in tax references."
    },
    {
      "text": "\"This case discloses a very disturbing state of affairs prevailing in the Income-tax Department. It is a startling revelation that the entire record of an assessee's case both before the Income-tax Officer and the Appellate Assistant Commissioner was found missing.\"",
      "speaker": "court",
      "significance": "Criticism of departmental negligence."
    }
  ],
  "_case_id": "1967_165",
  "_label": 1,
  "_text_length": 19171,
  "_extracted_at": "2026-02-10T20:22:13.509596"
}