{
  "metadata": {
    "case_name": "Sales Tax Officer, Aurangabad v. Central Bank of India",
    "case_year": 1965,
    "court": "Supreme Court of India",
    "judges": [
      "Ramaswami, J."
    ],
    "case_number": "Civil Appeal No. 1128 of 1965",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Respondent No. 2, the firm of Chandmal Manmal was indebted to the 1st respondent, Central Bank of India, Aurangabad branch.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On March 11, 1955 the first respondent filed a suit being Civil Suit No. 28/1 of 1955 against the second respondent for recovering a sum of Rs. 14,541/- and odd in the Court of Subordinate Judge at Aurangabad.",
      "type": "procedural",
      "date": "1955-03-11",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On the application of the first respondent an order for interim injunction was passed in respect of certain properties belonging to the second respondent. The Court had ordered the second respondent to furnish security for the amount of the decree which may be passed against the firm in the suit.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On April 28, 1955 Jogilal Mulchand, one of the partners of the second respondent furnished security by creating a charge on his immovable property, which was a house at Aurangabad. After the security bond was furnished, the attachment was released.",
      "type": "procedural",
      "date": "1955-04-28",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The security bond furnished by Jogilal Mulchand read as follows: 'I, the Defendant No. 2 therefore stand as a surety and declare that if the Honble Court decides the suit against the Defendants, he will abide by every order passed by the Court and if he fails to do so, then I. defendant No. 2 stand as surety to the extent of Rs. 20,000/- ... I create a charge on my one pucca two storied house ... If I fail to pay the amount of the security, the Court will then be entitled to recover the amount of the security from the property hereby charged'.",
      "type": "material",
      "date": "1955-04-28",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "On April 30, 1955 the Subordinate Judge granted a decree against the 2nd respondent for a sum of Rs. 14,541/- and odd.",
      "type": "procedural",
      "date": "1955-04-30",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "The 1st respondent filed an application for execution of the decree under s. 145 of the Civil Procedure Code.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "In the execution of the decree the house which was charged under the security bond was sold and one Girdhardas purchased it in auction sale which was confirmed by the Court on August 14, 1958 and the sale proceeds thereof were deposited by the said Girdhardas in the executing Court.",
      "type": "procedural",
      "date": "1958-08-14",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "A sum of Rs. 9,672/- and odd was due to the Government from the second respondent on account of arrears of sales-tax for the years 1950-51 to 1955-56.",
      "type": "background",
      "date": "1950-1956",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "On August 17, 1958 the Sales Tax Officer, Aurangabad Circle wrote a letter to the District Judge, Aurangabad pointing out that a sum of Rs. 9,672/- and odd was due to the Government from the second respondent on account of arrears of sales-tax.",
      "type": "procedural",
      "date": "1958-08-17",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "On September 23, 1958 the District Judge sent a letter to the Subordinate Judge asking him not to pay the sale proceeds of the house to the decree holder i.e., the first respondent.",
      "type": "procedural",
      "date": "1958-09-23",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "On November 20, 1958, the Collector of Aurangabad made an order distraining the amount of Rs. 9,672/- out of the sale proceeds under s. 119 of the Hyderabad Land Revenue Act. The order stated: 'Sanction is therefore accorded under Section 119 of Hyderabad Land Revenue Act to attach the amount of Rs. 9,672-1-0 out of the sale proceeds ... The amount should be remitted to the Sales Tax Officer, Aurangabad.'",
      "type": "procedural",
      "date": "1958-11-20",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "The 1st respondent made an application to the trial court challenging the validity of the order of the Collector.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "The Subordinate Judge held that the Civil Court had no jurisdiction to set aside, revise or modify the order of the Collector and it could be done only by the Superior Revenue Authorities.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f15",
      "text": "From the order of the Subordinate Judge the 1st respondent preferred an appeal being First Appeal No. 341 of 1959 in the Bombay High Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f16",
      "text": "The appeal was heard by Naik, J. who by his judgment dated June 22, 1960 held that in view of the provisions contained in ss. 104 and 149 of the Hyderabad Land Revenue Act the Government was entitled to priority for the arrears of sales-tax due from the second respondent over the claim of the 1st respondent. The learned Judge accordingly dismissed the First Appeal.",
      "type": "procedural",
      "date": "1960-06-22",
      "source": "lower_court"
    },
    {
      "id": "f17",
      "text": "From the judgment of Naik, J. the 1st respondent took the matter in appeal under the Letters Patent. A Division Bench consisting of Patel and K. K. Desai, JJ. allowed the appeal by their judgment dated December 17, 1962 holding that S. 119 of the Hyderabad Land Revenue Act applied only to property which was in the custody and possession of the judgment-debtor and not in the custody or possession of a Court. It was observed that the provisions of the Hyderabad Land Revenue Act contained in ss. 104, 116, 117 and 144 made it abundantly clear that the priority applied only in respect of land revenue and not in respect of other taxes. It was further held that the 1st respondent as a decree-holder had a prior charge as the quality of his debt was not the same as that of the debt due to the Government and therefore in respect of the sales-tax, the State had no priority.",
      "type": "procedural",
      "date": "1962-12-17",
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the order of distraint dated November 20, 1958 made by the Collector of Aurangabad under s. 119 of the Hyderabad Land Revenue Act is legally valid, particularly whether s. 119 applies to property in the custody of a Court.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the debt due to the Government in respect of arrears of sales-tax has priority over the dues of the decree-holder (1st respondent) under ss. 104 and 144 of the Hyderabad Land Revenue Act.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether the appellants are entitled to claim priority towards payment of sales-tax according to the Common Law doctrine of Priority of Crown debts.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The order of distraint by the Collector under s. 119 Hyderabad Land Revenue Act is valid and applies to movable property even in custody of Court.",
      "supporting_facts": [
        "f12"
      ],
      "legal_basis": "s. 119 Hyderabad Land Revenue Act; s. 13(2) Hyderabad General Sales Tax Act"
    },
    {
      "id": "pa2",
      "text": "Sales-tax arrears treated as arrears of land revenue under s.13(2) Hyderabad General Sales Tax Act, hence entitled to priority under ss.104, 116, 119, 144 Hyderabad Land Revenue Act over decree-holder's claim.",
      "supporting_facts": [
        "f9",
        "f12"
      ],
      "legal_basis": "ss. 104, 116, 119, 144 Hyderabad Land Revenue Act; s.13(2) Hyderabad General Sales Tax Act"
    },
    {
      "id": "pa3",
      "text": "Priority for sales-tax arrears under Common Law doctrine of Crown debts, recognized in India.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": "Common Law doctrine of priority of Crown debts; Art. 372 Constitution"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "S. 119 Hyderabad Land Revenue Act applies only to property in custody and possession of judgment-debtor, not Court.",
      "supporting_facts": [
        "f8",
        "f12"
      ],
      "legal_basis": "ss. 104, 116, 117, 144 Hyderabad Land Revenue Act"
    },
    {
      "id": "ra2",
      "text": "Priority under s.104 applies only to land revenue, not sales-tax; decree-holder has prior charge.",
      "supporting_facts": [
        "f4",
        "f5",
        "f6"
      ],
      "legal_basis": "s.104 Hyderabad Land Revenue Act"
    },
    {
      "id": "ra3",
      "text": "Builders Supply Corporation v. Union of India affected by Superintendent Remembrancer v. Corporation of Calcutta; no Common Law priority.",
      "supporting_facts": [],
      "legal_basis": "Art. 372 Constitution"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The construction put by the High Court on s.119 is not correct; language is general, no restriction to property not in Court custody; procedure followed by Collector justified.",
      "addresses_issue": "i1",
      "key_observation": "S.119 empowers Tahsildar to distrain defaulter's movable property without restriction."
    },
    {
      "id": "cr2",
      "text": "S.104 priority applies only to land revenue, not other taxes like sales-tax; only recovery procedure under Land Revenue Act applies to sales-tax, not substantive priority.",
      "addresses_issue": "i2",
      "key_observation": "Language of s.104 specifies 'land revenue'; s.144 lists taxes but priority limited."
    },
    {
      "id": "cr3",
      "text": "Common Law Crown priority not applicable as no proof of judicial recognition in Hyderabad State prior to 1950.",
      "addresses_issue": "i3",
      "key_observation": "Doctrine requires prior judicial recognition in the territory; none shown for Hyderabad."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "S.119 Hyderabad Land Revenue Act applies to distraint of defaulter's movable property even in Court custody.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Sales-tax arrears have no priority over decree-holder's charged claim under Hyderabad Land Revenue Act.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Common Law doctrine of Crown debts priority not applicable in Hyderabad State.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Secretary of State in Council for India v. Bombay Landing Shipping Co. Limited",
      "citation": "1868-69 5 Bom. H.C.R. 23",
      "treatment": "followed",
      "relevance": "Crown judgment debt entitled to precedence in Bombay."
    },
    {
      "case_name": "Bank of India v. John Bowman",
      "citation": "A.I.R. 1955 Bom. 305",
      "treatment": "followed",
      "relevance": "Crown priority where debts of equal degree."
    },
    {
      "case_name": "Manickam Chettiar v. Income-tax Officer, Madura",
      "citation": "1938 6 I.T.R. 180",
      "treatment": "followed",
      "relevance": "Income-tax debt priority over private debts."
    },
    {
      "case_name": "Kaka Mohamed Ghouse Sahib Co. v. United Commercial Syndicate",
      "citation": "49 I.T.R. 824",
      "treatment": "followed",
      "relevance": "Similar view on Crown priority."
    },
    {
      "case_name": "Builders Supply Corporation v. Union of India",
      "citation": "56 I.T.R. 91",
      "treatment": "followed",
      "relevance": "English Common Law Crown priority recognized in British India for tax dues."
    },
    {
      "case_name": "Superintendent Remembrancer of Legal Affairs, West Bengal v. Corporation of Calcutta",
      "citation": "1967 2 S.C.R. 170",
      "treatment": "distinguished",
      "relevance": "Does not affect Builders Supply; concerns rule of construction, not prerogative."
    },
    {
      "case_name": "Snowden Marshall v. People of the State of New York",
      "citation": "1920 65 Law.Ed. 315",
      "treatment": "referred",
      "relevance": "State prerogative priority over unsecured creditors."
    }
  ],
  "statutes_cited": [
    {
      "name": "Hyderabad General Sales Tax Act (Hyd. Act No. XIV of 1950)",
      "sections": [
        "Section 13(2)"
      ],
      "relevance": "Sales-tax recoverable as arrears of land revenue."
    },
    {
      "name": "Hyderabad Land Revenue Act (Hyd. Act VIII of 1317 F)",
      "sections": [
        "Sections 104",
        "116",
        "117",
        "119",
        "120",
        "122",
        "124",
        "125",
        "144"
      ],
      "relevance": "Priority for land revenue (s.104); recovery procedures including distraint (ss.116,119); s.144 lists recoverable sums."
    },
    {
      "name": "Code of Civil Procedure",
      "sections": [
        "Section 145"
      ],
      "relevance": "Execution of decree."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 372"
      ],
      "relevance": "Continuance of pre-Constitution laws including Common Law doctrines if recognized."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court dismissed the appeal affirming the Bombay High Court's judgment dated December 17, 1962, holding that while the Collector's distraint order was valid, sales-tax arrears had no statutory priority over the decree-holder's prior charge and Common Law Crown priority not applicable in Hyderabad State.",
    "relief_granted": "Decree-holder (Central Bank) entitled to sale proceeds over sales-tax claim.",
    "costs": "Dismissed with costs."
  },
  "key_quotes": [
    {
      "text": "\"The language of the section is general and there is no reason why any restriction should be put on the power of distraint conferred upon the Tahsildar with regard to the defaulters movable property.\"",
      "speaker": "court",
      "significance": "Rejects High Court's narrow interpretation of s.119."
    },
    {
      "text": "\"But the language of s. 104 makes it clear that the priority specified in that section applies only in respect of land revenue and not in respect of other taxes.\"",
      "speaker": "court",
      "significance": "Denies statutory priority to sales-tax."
    },
    {
      "text": "\"We are, however, unable to apply the English Common Law doctrine of priority of Crown debts in this case, because there is no proof that the doctrine was given judicial recognition in the territory of Hyderabad State prior to January 26, 1950.\"",
      "speaker": "court",
      "significance": "Rejects Common Law priority for lack of local recognition."
    }
  ],
  "_case_id": "1967_360",
  "_label": 0,
  "_text_length": 17634,
  "_extracted_at": "2026-02-10T20:24:50.001941"
}