{
  "metadata": {
    "case_name": "Dealer in Firewood and Charcoal v. Commissioner of Sales Tax",
    "case_year": 1966,
    "court": "Supreme Court of India",
    "judges": [
      "Shelat, J."
    ],
    "case_number": "Civil Appeal No. 2011 of 1966",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The appellant has been carrying on business as a dealer in firewood and charcoal.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "For the period from March 29, 1962 to April 29, 1962, the appellant was assessed to sales tax under s. 18(6) of the Madhya Pradesh General Sales Tax Act, 1958 as he did not have any registration certificate in respect of this period.",
      "type": "procedural",
      "date": "1962-03-29",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The Additional Sales Tax Officer, Ujjain, held that charcoal was not covered by Entry I of Part III of Sch. II to the Act, but fell under the residuary Entry I of Part VI of that Schedule and consequently was liable to be assessed at the rate of 4% of the price of charcoal.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f4",
      "text": "The Additional Appellate Assistant Commissioner, Indore, held the same as the Additional Sales Tax Officer.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "In a further appeal before the Board of Revenue, the Board, relying on the dictionary meaning of the word 'coal' as given in Blackies Concise Dictionary, held that charcoal would be included in the term 'coal', and therefore Entry I in Part III of Schedule II would apply and the tax chargeable would be at 2%.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "At the instance of the Commissioner of Sales Tax, the Board referred the following question to the High Court: Whether charcoal is covered under Entry I of Part III of Sch. II to the M.P. General Sales Tax Act, 1958, and is taxable at the rate of 2% or will be taxable at the rate of 4% under Entry I of Part VI of Sch. II to the M.P. General Sales Tax Act, 1958?",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "The High Court held that while construing entries in a statute like the Sales Tax Acts, the court should prefer the popular meaning of the terms used in such entries and not their dictionary meanings and that so construed charcoal would be included in the word 'coal'. Consequently, it answered the question in favour of the respondent.",
      "type": "procedural",
      "date": "1966-02-23",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "According to the High Court, charcoal would be covered by Entry I of Part III of Sch. II and was taxable at 2%.",
      "type": "procedural",
      "date": "1966-02-23",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Appeal by special leave to the Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Entry I of Part III of Sch. II: 'Coal, including coke in all its forms' 2 per cent.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Entry I of Part VI of Sch. II: 'All other goods not included in Schedule I or any other part of this Schedule' 4 per cent.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Entry 8 of Part III of Schedule II: 'Firewood' 2 percent.",
      "type": "material",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether charcoal is covered under Entry I of Part III of Sch. II to the M.P. General Sales Tax Act, 1958, and is taxable at the rate of 2% or will be taxable at the rate of 4% under Entry I of Part VI of Sch. II to the M.P. General Sales Tax Act, 1958?",
      "framed_by": "lower_court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Charcoal is one of the species of coal, and therefore would be covered by Entry I of Part III.",
      "supporting_facts": [
        "f10"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Coal and charcoal are different products, one being a mineral product and the other prepared from wood and other articles by human agency, and therefore the term coal would not cover charcoal.",
      "supporting_facts": [],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "While construing such entries, the dictionary meaning should not be preferred to the popular meaning or the meaning in the commercial sense.",
      "supporting_facts": [],
      "legal_basis": null
    },
    {
      "id": "ra3",
      "text": "The Legislative policy in reference to the term coal shows that it is not used by the Legislature in India so as to include charcoal.",
      "supporting_facts": [
        "f12"
      ],
      "legal_basis": "Colliery Control Order, 1945 s.5 and other statutory provisions"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "While interpreting items in statutes like the Sales Tax Acts, resort should be had not to the scientific or the technical meaning of such terms but to their popular meaning or the meaning attached to them by those dealing in them, that is to say, to their commercial sense.",
      "addresses_issue": "i1",
      "key_observation": "Both a merchant dealing in coal and a consumer wanting to purchase it would regard coal not in its geological sense but in the sense as ordinarily understood and would include charcoal in the term coal."
    },
    {
      "id": "cr2",
      "text": "Viewed from that angle both a merchant dealing in coal and a consumer purchasing it as fuel would give to that word the meaning which includes charcoal.",
      "addresses_issue": "i1",
      "key_observation": "A sales tax statute is being one levying a tax on goods must in the absence of a technical term or a term of science or art, be presumed to have used an ordinary term as coal according to the meaning ascribed to it in common parlance."
    },
    {
      "id": "cr3",
      "text": "Having taxed coal and firewood at 2%, it does not appear to be possible that the Legislature deliberately left out charcoal from the connotation of the word coal and left it to be charged at 4% under the residuary Entry.",
      "addresses_issue": "i1",
      "key_observation": "The object of the Legislature clearly was to tax coal and firewood as articles used as fuel and did not make a separate entry in regard to charcoal as it must be aware that coal is understood in ordinary and commercial sense would include charcoal."
    },
    {
      "id": "cr4",
      "text": "In construing a word in an Act no motion is necessary in adopting a meaning ascribed to that word in other statutes.",
      "addresses_issue": "i1",
      "key_observation": "It would not be possible to discard the meaning of the word coal in this statute as understood in its commercial or popular sense and to adopt its connotation from other statutes passed for different purposes or in context of different objects."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Charcoal would be covered by Entry I of Part III of Sch. II and taxable at the rate of 2 only.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Ramavatar Budhaiprasad etc. v. Assistant Sales Tax Officer, Akola",
      "citation": "1962 1 S.C.R. 279",
      "treatment": "followed",
      "relevance": "Word 'vegetable' must be interpreted not in a technical sense but in its popular sense as understood in common language."
    },
    {
      "case_name": "His Majesty the King v. Planters Nut and Chocolate Company Limited",
      "citation": "1951 C.L.R. 122",
      "treatment": "followed",
      "relevance": "Words in Excise Tax Act to be construed as understood in common language and in matters of commerce, not botanists conception."
    },
    {
      "case_name": "Attorney-General v. Winstanley",
      "citation": "1831 2 D Cl. 302",
      "treatment": "referred",
      "relevance": "Rule that ordinary words construed according to popular sense."
    },
    {
      "case_name": "Grenfell v. Inland Revenue Commissioner",
      "citation": "1876 I Ex-D. 242",
      "treatment": "referred",
      "relevance": "Statute construed in its popular sense, meaning that sense which people conversant with the subject-matter would attribute to it."
    },
    {
      "case_name": "Holt Co. Collyer",
      "citation": "1881 16 Ch. D. 718",
      "treatment": "distinguished",
      "relevance": "Technical or scientific words construed according to technical meaning, but not applicable here."
    },
    {
      "case_name": "K. V. Varkey v. Agricultural Income Tax and Rural Sales Tax Officer, Peelmedu and others",
      "citation": "1954 S.S.T.C. 384",
      "treatment": "distinguished",
      "relevance": "Turned on specific definition in statute including green tea leaves under 'tea' as plant product."
    },
    {
      "case_name": "Macbeth Chislett",
      "citation": "1910 A.C. 220",
      "treatment": "followed",
      "relevance": "No need to limit a word to unnatural sense from other statutes not incorporated."
    }
  ],
  "statutes_cited": [
    {
      "name": "Madhya Pradesh General Sales Tax Act, 1958",
      "sections": [
        "s. 18(6)",
        "Sch. II Part III Entry I",
        "Sch. II Part III Entry 8",
        "Sch. II Part VI Entry I"
      ],
      "relevance": "Governs assessment of sales tax on charcoal; determines rate as 2% under Entry I Part III 'Coal, including coke in all its forms' rather than 4% residuary."
    },
    {
      "name": "Central Sales Tax Act, 1956",
      "sections": [
        "s. 14",
        "s. 15"
      ],
      "relevance": "Declares coal including coke in all forms as goods of special importance; limits State tax to 2%."
    },
    {
      "name": "Colliery Control Order, 1945",
      "sections": [
        "s. 5"
      ],
      "relevance": "Uses 'coal' in technical sense as mineral product from collieries; not applicable to construe term in sales tax statute."
    },
    {
      "name": "C.P. and Berar Sales Tax Act, 1947",
      "sections": [
        "s. 6"
      ],
      "relevance": "Example of interpreting 'vegetables' in popular sense."
    },
    {
      "name": "Travancore General Sales Tax Act, XVIII of 1124",
      "sections": [
        "s. 3"
      ],
      "relevance": "Definition of turnover included tea as plant product."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Court agreed with the High Court and held that the word 'coal' in Entry I of Part III of Schedule II to the Madhya Pradesh General Sales Tax Act, 1958 must be construed in its popular and commercial sense which includes charcoal, and therefore charcoal is taxable at 2% and not at 4% under the residuary entry.",
    "relief_granted": "Charcoal taxable at 2%",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "while interpreting items in statutes like the Sales Tax Acts, resort should be had not to the scientific or the technical meaning of such terms but to their popular meaning or the meaning attached to them by those dealing in them, that is to say, to their commercial sense.",
      "speaker": "court",
      "significance": "Core principle applied to interpret 'coal' to include charcoal."
    },
    {
      "text": "both a merchant dealing in coal and a consumer wanting to purchase it would regard coal not in its geological sense but in the sense as ordinarily understood and would include charcoal in the term coal.",
      "speaker": "court",
      "significance": "Explains popular/commercial understanding favoring inclusion."
    },
    {
      "text": "The object of the Legislature clearly was to tax coal and firewood as articles used as fuel and did not make a separate entry in regard to charcoal as it must be aware that coal is understood in ordinary and commercial sense would include charcoal.",
      "speaker": "court",
      "significance": "Rejects legislative intent argument for exclusion."
    }
  ],
  "_case_id": "1967_181",
  "_label": 0,
  "_text_length": 15055,
  "_extracted_at": "2026-02-10T20:22:54.955543"
}