{
  "metadata": {
    "case_name": "Appellants (Lessees of Prakash Talkies) v. Commissioner of Income-tax",
    "case_year": null,
    "court": "Supreme Court of India",
    "judges": [
      "Shah, J."
    ],
    "case_number": null,
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellants were lessees of Prakash Talkies cinema theatre at Ahmedabad and carried on business exhibiting cinematograph films there.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "After expiry of lease, landlord filed ejectment action in civil court against appellants and obtained decree for possession and mesne profits.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Civil judge at Ahmedabad determined appellants' liability for mesne profits at Rs. 2,57,963 under Order XX, rule 12, CPC.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "In appeal, mesne profits claim settled by consent and reduced to Rs. 1,90,220.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "For assessment year 1955-56 (previous year calendar year 1954), appellants claimed Rs. 92,240 out of mesne profits as permissible allowance in computation of business income.",
      "type": "material",
      "date": "1954",
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "Income-tax Officer disallowed claim holding business of Prakash Talkies not carried on by appellants during previous year relevant to 1955-56.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Appellate Assistant Commissioner confirmed ITO order, holding mesne profits not legal charge on business but ex gratia or capital payment.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Income-tax Appellate Tribunal held no proof of integrated cinematograph business; Prakash Talkies run independently with separate books; source dried up in 1952.",
      "type": "procedural",
      "date": "1952",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Tribunal referred question to High Court of Gujarat: Whether Rs. 92,240 allowable as deduction for AY 1955-56?",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "High Court answered question in negative.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Appellants appealed to Supreme Court with special leave.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Appellants carried on business of exhibiting films in multiple theatres in Ahmedabad and Bombay.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Books of account for different theatres maintained separately but results incorporated at head office in Ahmedabad.",
      "type": "admitted",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f14",
      "text": "Appellate Assistant Commissioner allowed litigation expenses related to Prakash Talkies dispute as deductible.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether, on the facts and circumstances of the case, the amount of Rs. 92,240 was allowable as a deduction in determining the business income of the assessee for the assessment year 1955-56?",
      "framed_by": "tribunal"
    },
    {
      "id": "i2",
      "text": "Whether the business of Prakash Talkies constituted part of the same integrated business as other cinema theatres run by appellants, or was it independent and closed prior to the relevant year?",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Mesne profits payable under decree for possession of business premises properly chargeable to profits under section 10(1) of Income-tax Act in computing taxable income.",
      "supporting_facts": [
        "f2",
        "f3",
        "f4",
        "f5"
      ],
      "legal_basis": "Section 10(1) Income-tax Act, 1922"
    },
    {
      "id": "pa2",
      "text": "Burden of proving business carried on in calendar year 1954 lay upon appellants.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Diverse ventures in Ahmedabad and elsewhere were parts of the same business; admissibility of allowance does not depend on Prakash Talkies being carried on in 1954.",
      "supporting_facts": [
        "f1",
        "f12"
      ],
      "legal_basis": null
    },
    {
      "id": "pa4",
      "text": "Appellants carried on only one business of exhibiting cinematograph films; Prakash Talkies was a part thereof, not independent.",
      "supporting_facts": [
        "f1",
        "f12",
        "f13"
      ],
      "legal_basis": null
    },
    {
      "id": "pa5",
      "text": "Where assessee carries on business ventures of same character at different places, they must be held parts of single business as matter of law.",
      "supporting_facts": [
        "f12"
      ],
      "legal_basis": null
    },
    {
      "id": "pa6",
      "text": "Question whether different ventures form same or different businesses is mixed question of law and fact.",
      "supporting_facts": [],
      "legal_basis": "Setabganj Sugar Mills Ltd. v. Commissioner of Income-tax"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Business of Prakash Talkies independent of other businesses; closed in 1952, so outgoing not permissible allowance against income of other businesses in 1954.",
      "supporting_facts": [
        "f1",
        "f8"
      ],
      "legal_basis": "Section 10(1) Income-tax Act, 1922"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "For income taxable under section 10(1), assessee must carry on business in relevant year; if discontinued before accounting year, no tax on income from it and no debit of its expenditure against other income.",
      "addresses_issue": "i1",
      "key_observation": "Outgoings chargeable only against income of business carried on in previous year."
    },
    {
      "id": "cr2",
      "text": "If assessee carries several distinct independent businesses and one closes before previous year, no allowance under s10(1) for its outgoing against other businesses' income.",
      "addresses_issue": "i1",
      "key_observation": "Only question is whether business for which allowance claimed was carried on in 1954."
    },
    {
      "id": "cr3",
      "text": "Whether different ventures form parts of same business depends on facts: interconnection, interlacing, interdependence, unity embracing ventures.",
      "addresses_issue": "i2",
      "key_observation": "No broad proposition that same character ventures at different places constitute single business."
    },
    {
      "id": "cr4",
      "text": "Tribunal findings: theatres run independently with separate books; opening/closure of one does not affect others; Prakash dried up in 1952.",
      "addresses_issue": "i2",
      "key_observation": "Proper test of integrated business not met."
    },
    {
      "id": "cr5",
      "text": "Separate books but head office incorporation insufficient; no evidence of unity of control, management, inter-relation, same staff, etc.",
      "addresses_issue": "i2",
      "key_observation": "Appellants failed to establish Prakash as part of general business."
    },
    {
      "id": "cr6",
      "text": "Allowance of litigation expenses by AAC does not imply Prakash part of larger business; no express finding or departmental acquiescence.",
      "addresses_issue": "i2",
      "key_observation": "On Tribunal facts, appellants' case not made out."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Rs. 92,240 not allowable as deduction for AY 1955-56 as Prakash Talkies business independent and closed before relevant year.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Different business ventures constitute single business only if interconnection, interlacing, interdependence, unity shown on facts.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Setabganj Sugar Mills Ltd. v. Commissioner of Income-tax",
      "citation": null,
      "treatment": "followed",
      "relevance": "Principles for determining if ventures constitute same business: interconnection, interlacing, interdependence, unity."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act, 1922",
      "sections": [
        "Section 10(1)"
      ],
      "relevance": "Tax on profits of business carried on in relevant year; no deduction for expenses of discontinued business against other income."
    },
    {
      "name": "Code of Civil Procedure",
      "sections": [
        "Order XX, rule 12"
      ],
      "relevance": "Proceedings for determination of mesne profits."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court upheld High Court and Tribunal; disallowed deduction of Rs. 92,240 as mesne profits related to independent closed business of Prakash Talkies not carried on in relevant year.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "Whether different ventures carried on by an assessee form parts of the same business must depend on the facts and circumstances of each case.",
      "speaker": "court",
      "significance": "Rejects broad proposition for single business based on same character."
    },
    {
      "text": "In determining whether different ventures may be said to constitute the same business it has to be seen whether there was any interconnection, any interlacing, any interdependence, any unity embracing the ventures.",
      "speaker": "court",
      "significance": "Key test from Setabganj case applied."
    },
    {
      "text": "The Tribunal proceeded to found its conclusion substantially upon two principal facts. They observed that the cinema theatres... were run independently of one other with separate identifiable books.",
      "speaker": "court",
      "significance": "Basis for upholding Tribunal's finding of independent businesses."
    }
  ],
  "_case_id": "1967_238",
  "_label": 0,
  "_text_length": 10901,
  "_extracted_at": "2026-02-10T20:23:22.670704"
}