{
  "metadata": {
    "case_name": "Commissioner of Income-tax v. Respondent Company",
    "case_year": 1949,
    "court": "Supreme Court of India",
    "judges": [
      "Shah, J."
    ],
    "case_number": null,
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "By an agreement dated October 29, 1928, Ciba India Ltd. appointed Tejaji Farasram Kharawalla selling agent for the District of Ahmedabad in respect of certain kinds of dyes and dye-stuffs, and agreed to pay him commission at the rate of 12 1/2% on sales by him.",
      "type": "background",
      "date": "1928-10-29",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The terms relating to commission were modified by agreement dated August 20, 1935, and out of the commission agreed to be paid, 7 1/2% was to be treated as the selling commission and 5% was to be treated as compensation in lieu of the contingency expenses which the selling agent had to meet, such as commission to dyeing-masters, agents, etc.",
      "type": "background",
      "date": "1935-08-20",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The rights of the selling agent were assigned with the consent of the principals to the respondent company with effect from October 27, 1947.",
      "type": "background",
      "date": "1947-10-27",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "In assessing the income of the company for the assessment year 1949-50, the Income-tax Officer included in the taxable income Rs. 58,025, being the difference between Rs. 1,90,538 received by the company as 5% commission and Rs. 1,32,512 spent by the company for meeting the charges which the selling agent was to meet.",
      "type": "material",
      "date": "1949",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The Income-tax Appellate Tribunal upheld the contention of the company that in the computation of the income of the company, the 5% commission was wholly exempt by virtue of section 4(3)(vi) of the Income-tax Act, 1922.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "The Commissioner moved the Tribunal to refer the question: Whether, on the facts of the case, a portion, viz., 5% of the selling agency commission of 12 1/2% received by the assessee-company from Messrs. Ciba Ltd. in the course of carrying on the selling agency business, is exempt from tax under section 4(3)(vi) of the Act?",
      "type": "procedural",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f7",
      "text": "The Tribunal referred only: Whether the assessee-company held an office or employment of profit within the meaning of section 4(3)(vi) of the Indian Income-tax Act?",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "The High Court of Judicature at Bombay answered the referred question in the affirmative, relying on Tejaji Farasram Kharawalla v. Commissioner of Income-tax (1948) 16 I.T.R. 260.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "The Commissioner's application to the High Court for calling upon the Tribunal to submit a statement on the original question was rejected.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "The Commissioner appealed to the Supreme Court, which set aside the High Court's order dismissing the application, remanded the case directing the Tribunal to state a case on the original question, without opining on the referred question.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "The case was transferred to the High Court of Gujarat due to reorganization of the State of Bombay.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "The High Court of Gujarat held that the 5% commission represented a special allowance to meet expenditure such as commission to dyeing-masters, agents, etc., and was exempt from tax, and that the company held an office or employment of profit.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether, on the facts of the case, a portion, viz., 5% of the selling agency commission of 12 1/2% received by the assessee-company from Messrs. Ciba Ltd. in the course of carrying on the selling agency business, is exempt from tax under section 4(3)(vi) of the Income-tax Act, 1922?",
      "framed_by": "commissioner"
    },
    {
      "id": "i2",
      "text": "Whether the assessee-company held an office or employment of profit within the meaning of section 4(3)(vi) of the Indian Income-tax Act?",
      "framed_by": "tribunal"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The 5% commission is not wholly exempt; only the portion actually and necessarily expended qualifies for exemption under section 4(3)(vi), and surplus is taxable as income.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": "Section 4(3)(vi) of the Income-tax Act, 1922"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The 5% commission was wholly exempt by virtue of section 4(3)(vi) as it was a special allowance to meet expenses.",
      "supporting_facts": [
        "f2",
        "f4",
        "f5"
      ],
      "legal_basis": "Section 4(3)(vi) of the Income-tax Act, 1922; Tejaji Farasram Kharawalla v. CIT"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "To qualify for exemption under section 4(3)(vi), the allowance must be granted to meet expenses incurred or to be incurred wholly and necessarily in the performance of the duties of an office or employment of profit. The purpose for which the allowance is granted is determinative, but any surplus remaining after meeting expenses does not qualify and is taxable.",
      "addresses_issue": "i1",
      "key_observation": "An allowance intended for appropriation towards expenditure incurred or to be incurred does not constitute real income, but surplus acquires character of additional remuneration."
    },
    {
      "id": "cr2",
      "text": "Disagrees with Bombay High Court in Tejaji Farasram Kharawalla's case that once purpose is established, no need to prove actual expenditure; key words 'to meet expenses wholly and necessarily incurred' require actual incurrence.",
      "addresses_issue": "i1",
      "key_observation": "Exemption operates only in respect of allowance specifically granted to meet expenses wholly and necessarily incurred."
    },
    {
      "id": "cr3",
      "text": "Rejects Allahabad High Court's view in CIT v. Sharma & Co. that purpose alone suffices without actual expenditure proof; unexpended surplus is taxable.",
      "addresses_issue": "i1",
      "key_observation": "For allowances covering periods beyond accounting year, allocate and tax difference between amount for the year and actual expenditure."
    },
    {
      "id": "cr4",
      "text": "The selling agent holds an employment of profit under the agreement.",
      "addresses_issue": "i2",
      "key_observation": "No argument to the contrary advanced."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "That portion of 5% of the selling agency commission received by the assessee company is exempt under section 4(3)(vi) of the Income-tax Act, 1922, which is wholly and necessarily incurred in the year of account in the performance of the duties of the company as selling agent.",
      "resolves_issue": "i1",
      "in_favor_of": "partial"
    },
    {
      "id": "h2",
      "text": "The assessee-company held an employment of profit within section 4(3)(vi).",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Tejaji Farasram Kharawalla v. Commissioner of Income-tax",
      "citation": "(1948) 16 I.T.R. 260",
      "treatment": "distinguished",
      "relevance": "High Court held grant for particular purpose exempt regardless of actual expenditure; Supreme Court disagrees, emphasizing actual incurrence of expenses."
    },
    {
      "case_name": "Commissioner of Income-tax v. Sharma & Co.",
      "citation": null,
      "treatment": "distinguished",
      "relevance": "Allahabad High Court upheld exemption for unexpended balance if purpose covered; Supreme Court rejects, holding surplus taxable."
    }
  ],
  "statutes_cited": [
    {
      "name": "Income-tax Act, 1922",
      "sections": [
        "4(3)(vi)"
      ],
      "relevance": "Exempts special allowances granted to meet expenses wholly and necessarily incurred in performance of duties of office or employment of profit; only portion actually incurred exempt, surplus taxable."
    }
  ],
  "outcome": {
    "disposition": "partially_accepted",
    "summary": "Appeal allowed; High Court's answer to supplementary question discharged; held that only portion of 5% commission wholly and necessarily incurred in the year of account is exempt under section 4(3)(vi).",
    "relief_granted": "Partial exemption for actually incurred expenses.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The intention of the framers of the Act was to grant exemption in respect of amounts received by the assessee, not for his own benefit, but for the specific purpose of meeting the expenses wholly and necessarily incurred or to be incurred in the performance of his duties as an agent.",
      "speaker": "court",
      "significance": "Explains scope of exemption under section 4(3)(vi)."
    },
    {
      "text": "Any surplus remaining in the hands of the grantee after meeting the expenses does not bear the character of the allowance for meeting expenses but for performing the duties of the office or employment.",
      "speaker": "court",
      "significance": "Determines taxability of unspent balance."
    }
  ],
  "_case_id": "1967_277",
  "_label": 1,
  "_text_length": 12613,
  "_extracted_at": "2026-02-10T20:23:55.653513"
}