{
  "metadata": {
    "case_name": "State of Uttar Pradesh v. Madan Mohan Nagar",
    "case_year": 1965,
    "court": "Supreme Court of India",
    "judges": [
      "Sikri, J."
    ],
    "case_number": "Civil Appeal No. 997 of 1965",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Respondent Shri Madan Mohan Nagar filed a Writ Petition in the High Court of Judicature at Allahabad for quashing the order of compulsory retirement dated July 28, 1960.",
      "type": "procedural",
      "date": "1960-07-28",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Order of compulsory retirement: 'I am directed to say that the Governor has been pleased to order in the public interest under Article 465A and Note 1 thereof of the Civil Service Regulations, the compulsory retirement with effect from September 1, 1960 of Sri Madan Mohan Nagar, Director State Museum Lucknow who completed 52 years of age on July 1, 1960, and 28 years and .3 months of qualifying service on 31-5-1960 as he has outlived his utility.'",
      "type": "material",
      "date": "1960-07-28",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Learned Single Judge quashed the order on the ground that Rule 465 of the Civil Service Regulations as amended by the U.P. Government violates the guarantee of equality of opportunity under Article 16(1) of the Constitution, and the order was passed in violation of principles of natural justice.",
      "type": "procedural",
      "date": "1963-07-25",
      "source": "lower_court"
    },
    {
      "id": "f4",
      "text": "Division Bench of Allahabad High Court upheld the Single Judge's order on the ground that the compulsory retirement order violated Article 311 of the Constitution and was ultra vires.",
      "type": "procedural",
      "date": "1963-07-25",
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "Respondent first appointed in 1931 on one year's probation to the post of Custodian, Sarnath Museum, Banaras, under the Archaeological Department of the Government of India.",
      "type": "background",
      "date": "1931",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "In 1939, respondent posted to Mathura Museum as Curator, appointed substantively from January 5, 1941.",
      "type": "background",
      "date": "1939-01-01",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Respondent appointed on recommendation of Provincial Public Service Commission as Curator of State Museum, Lucknow, on scale Rs. 250-850; post upgraded to Director, State Museum, Lucknow, in U.P. Educational Service, Senior Scale.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Respondent continued as Director until compulsorily retired by order dated July 28, 1960.",
      "type": "background",
      "date": "1960-07-28",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "No enquiry as contemplated by Art. 311(2) was held.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Article 465A of Civil Service Regulations (as amended by U.P. Government): 'Government retains the right to retire any Government servant after he has completed 25 years qualifying service without giving any reasons, and no claim to special compensation on this account shall be entertained. This right shall only be exercised by Government in the Administrative Department when it is in the public interest to dispense with the services of Government servant who has outlived his usefulness.'",
      "type": "background",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the impugned order of compulsory retirement stating that the respondent 'has outlived his utility' amounts to dismissal or removal, casting a stigma, and thus requires compliance with Article 311(2) of the Constitution.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the order of compulsory retirement violates principles of natural justice or Article 16(1).",
      "framed_by": "lower_court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The fact that the order states the reason 'outlived his utility' does not make it dismissal or removal, as it is implied in every compulsory retirement; cites Shyam Lal v. State of Uttar Pradesh.",
      "supporting_facts": [
        "f2",
        "f10"
      ],
      "legal_basis": "Shyam Lal v. State of Uttar Pradesh (1955 1 SCR 26); Article 465A CSR"
    },
    {
      "id": "pa2",
      "text": "Compulsory retirement has no stigma or implication of misbehaviour or incapacity.",
      "supporting_facts": [
        "f10"
      ],
      "legal_basis": "Note 1 to Article 465A CSR; T.G. Shivacharana Singh v. State of Mysore; Abdul Ahad v. Inspector General of Police, U.P."
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Order invalid due to violation of Article 311.",
      "supporting_facts": [
        "f2",
        "f9"
      ],
      "legal_basis": "Article 311 Constitution"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The order expressly states respondent 'has outlived his utility', which casts a stigma and implies incapacity, distinguishing it from mere compulsory retirement; applies test from Jagdish Mitter v. Union of India: does the order cast aspersion or attach stigma?",
      "addresses_issue": "i1",
      "key_observation": "The order clearly attaches a stigma; any person reading it would consider something wrong with his capacity to work."
    },
    {
      "id": "cr2",
      "text": "Distinguishes Shyam Lal as no express stigma there; in present case, express statement worsens position compared to implied.",
      "addresses_issue": "i1",
      "key_observation": "Compulsory retirement implying unfitness does not require Art 311(2) enquiry, but stigma-laden order does."
    },
    {
      "id": "cr3",
      "text": "Test for compulsory retirement: does it cast aspersion or stigma? Here, affirmative, so amounts to dismissal.",
      "addresses_issue": "i1",
      "key_observation": "Same test as in Jagdish Mitter applies to compulsory retirement."
    },
    {
      "id": "cr4",
      "text": "No need to resolve conflict between Parshotam Lal Dhingra and Shyam Lal, as order on face casts stigma.",
      "addresses_issue": "i1",
      "key_observation": "Cases like Doshi, Balakotiah, Dalip Singh had no stigma in orders."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Order of compulsory retirement stating servant 'outlived his utility' casts stigma and amounts to dismissal requiring Article 311(2) compliance; invalid without enquiry.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Shyam Lal v. State of Uttar Pradesh",
      "citation": "1955 1 SCR 26",
      "treatment": "distinguished",
      "relevance": "Compulsory retirement implies unfitness but no express stigma; directions in Note 1 to Art 465A make no imputation condition."
    },
    {
      "case_name": "Jagdish Mitter v. Union of India",
      "citation": "AIR 1964 SC 449",
      "treatment": "followed",
      "relevance": "Test: if order casts stigma, it is dismissal not mere discharge; applied to compulsory retirement."
    },
    {
      "case_name": "T.G. Shivacharana Singh v. State of Mysore",
      "citation": "AIR 1965 SC 280",
      "treatment": "distinguished",
      "relevance": "No stigma in order; under different rule not requiring 'outlived utility' finding."
    },
    {
      "case_name": "Ram Prashad v. State of Punjab",
      "citation": "AIR 1966 SC 1607",
      "treatment": "referred",
      "relevance": "Cited extract from Moti Ram Deka; no argument on stigma."
    },
    {
      "case_name": "Moti Ram Deka v. N.E. Frontier Railway",
      "citation": "1964 5 SCR 683",
      "treatment": "referred",
      "relevance": "Reviewed compulsory retirement cases; question on termination of permanent servants."
    },
    {
      "case_name": "Parshotam Lal Dhingra v. Union of India",
      "citation": "1958 SCR 828",
      "treatment": "referred",
      "relevance": "Principle preferred by Subba Rao J. over Shyam Lal for permanent servants."
    },
    {
      "case_name": "State of Bombay v. Saubhagchand M. Doshi",
      "citation": "1958 SCR 571",
      "treatment": "distinguished",
      "relevance": "Rule 165A valid; no stigma in order challenged."
    },
    {
      "case_name": "Balakotiah v. Union of India",
      "citation": "1958 SCR 1052",
      "treatment": "distinguished",
      "relevance": "No stigma in termination order under security rules."
    },
    {
      "case_name": "Dalip Singh v. State of Punjab",
      "citation": "1961 1 SCR 88",
      "treatment": "distinguished",
      "relevance": "Order for 'administrative reasons' no stigma; tests from Shyam Lal applied."
    },
    {
      "case_name": "Abdul Ahad v. Inspector General of Police, U.P.",
      "citation": "AIR 1965 All 142",
      "treatment": "doubted",
      "relevance": "Full Bench held express 'outlived utility' not punitive; overruled Division Bench but disagreed by SC."
    }
  ],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Article 16(1)",
        "Article 311(2)",
        "Article 311"
      ],
      "relevance": "Violation by Single Judge (Art 16); by Division Bench (Art 311); requires enquiry for punitive termination."
    },
    {
      "name": "Civil Service Regulations (U.P. amended)",
      "sections": [
        "Article 465A",
        "Note 1 to Article 465A",
        "Rule 465"
      ],
      "relevance": "Basis for compulsory retirement in public interest if outlived usefulness; order under this held stigmatic."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court dismissed the State's appeal, upholding High Court's quashing of the compulsory retirement order as it cast a stigma amounting to dismissal without Article 311(2) enquiry.",
    "relief_granted": "Order of compulsory retirement quashed",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "'as he has outlived his utility.' The order clearly attaches a stigma to him and any person who reads the order would immediately consider that there is something wrong with him or his capacity to work.",
      "speaker": "court",
      "significance": "Defines why order is stigmatic and punitive."
    },
    {
      "text": "The test in such cases must be does the order cast aspersion or attach stigma to the officer when it purports to discharge him? If the answer to this question is in the affirmative, then notwithstanding the form of the order, the termination of service must be held, in substance, to amount to dismissal.",
      "speaker": "court",
      "significance": "Applies Jagdish Mitter test to compulsory retirement."
    },
    {
      "text": "We are unable to agree that the position does not become worse because what is implied is expressed.",
      "speaker": "court",
      "significance": "Rejects argument that express stigma same as implied."
    }
  ],
  "_case_id": "1967_269",
  "_label": 0,
  "_text_length": 13819,
  "_extracted_at": "2026-02-10T20:23:20.560053"
}