{
  "metadata": {
    "case_name": "Shersingh, Baljor and Vijaipal v. State",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "Hidayatullah, J."
    ],
    "case_number": "Criminal Appeal No. 191 of 1964",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The three appellants Shersingh, Baljor and Vijaipal are brothers and sons of Narayansingh. Tarif and Shanker are brothers of Narayansingh.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The deceased Harpal was the brother of Naharsingh PW 1 and Amichand PW 5. The house of Amichand and his brothers is in front of that of the appellants, in Mauza Amanullahpur, Police Station Jani, District Meerut.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Petty quarrel earlier: Shersingh took his cart through Harpal's field and there was a wordy quarrel. Next Shersingh stopped a cart in which Harpal was carrying sugarcane and Harpal kicked Shersingh and beat him with fist blows. Nahar Singh PW 1 and Khazan PW 7 separated them.",
      "type": "background",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f4",
      "text": "On the morning of November 26, 1961 at about 7 a.m. Harpal left his gher to answer a call of nature. Near the gate of his house the appellants and the two accused since acquitted fell upon him.",
      "type": "material",
      "date": "1961-11-26",
      "source": "prosecution"
    },
    {
      "id": "f5",
      "text": "Sher Singh and Vijaipal had spears and Shanker and Baljor had lathis. They beat Harpal with their weapons. Tarif, who also had a stick, took no part in the beating but exhorted the others to kill Harpal.",
      "type": "material",
      "date": "1961-11-26",
      "source": "prosecution"
    },
    {
      "id": "f6",
      "text": "Harpal was pierced in the chest and abdomen with spears and struck with sticks. On his shout for help his brothers Naharsingh and Amichand, who were working in the back portion of their house came running and three or four witnesses Bhupal PW 2, Tara PW 3, Katara PW 4 and one Atarsingh who was not examined came from different sides.",
      "type": "material",
      "date": "1961-11-26",
      "source": "prosecution"
    },
    {
      "id": "f7",
      "text": "The assailants then fled. Harpal who had fallen down was lifted, placed on a cot and covered with a quilt. He was however dead.",
      "type": "material",
      "date": "1961-11-26",
      "source": "prosecution"
    },
    {
      "id": "f8",
      "text": "Autopsy disclosed two penetrating wounds in his chest each of which had torn through his heart, a penetrating wound transfixing the stomach and some contusions.",
      "type": "material",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f9",
      "text": "Originally five persons were tried for this offence. All of them were acquitted by the Sessions Judge, Meerut.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "On appeal by Government, the acquittal of the other two Shanker and Tarif was maintained but the three appellants Shersingh, Baljor and Vijaipal were convicted under s. 302/34 of the Indian Penal Code and sentenced to rigorous imprisonment for life.",
      "type": "procedural",
      "date": "1964-05-20",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "The learned Sessions Judge in a long judgment exhaustively discussed the evidence but lost himself in the details of family relationship and other irrelevant matters sedulously brought out in a desultory cross-examination. He found it difficult to accept any part of the testimony of the eye-witnesses.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Medical evidence: Harpal had three penetrating injuries on his chest and abdomen. One, was a stab wound chest cavity deep and the direction was medially downwards. The second was a stab wound 3 1/2 below the left nipple in the 7th intercostal space near stomach. The wound was partially medial and upward and chest deep. The third was a stab wound on the mid part of the epigastric region in the midline and it was up to the back from the front and abdominal deep. There was 8 oz. of clotted blood in the pleura, 3 oz. of clotted blood in the peritoneum and 1 lb. semi-clotted blood in the pericardium. The large intestines contained faecal matter and the bladder was empty.",
      "type": "material",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f13",
      "text": "No blood was found at the spot, or in the tidri where the cot was spread or on the clothes.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f14",
      "text": "The Sub-Inspector Chauhal PW 10 said that the place of the attack was sandy and blood had probably been trampled upon. The body contained 1 lb. and 11 ounces of blood in its various parts and this showed considerable internal bleeding. Harpal had worn a kurta, a dhoti and a khes.",
      "type": "material",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f15",
      "text": "The report was made almost at once and the names of the assailants and eye-witnesses were mentioned in it.",
      "type": "material",
      "date": "1961-11-26",
      "source": "prosecution"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the eye-witness testimony is reliable and credible, or unsatisfactory due to contradictions with medical evidence, location of attack, and interest/hostility of witnesses.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Powers of the High Court in appeal from acquittal, and whether this is a fit case for reversal of acquittal by Supreme Court.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Testimony of the eye-witnesses was unsatisfactory.",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Medical evidence contradicted the oral testimony: description of injuries shows Harpal must be lying down and not standing when first and second blows given because one stab downwards and one upwards.",
      "supporting_facts": [
        "f12"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Evidence showed attack must have taken place elsewhere: no blood at spot, tidri or clothes.",
      "supporting_facts": [
        "f13"
      ],
      "legal_basis": null
    },
    {
      "id": "pa4",
      "text": "Eye-witnesses interested in victim and hostile to accused.",
      "supporting_facts": [
        "f2",
        "f3"
      ],
      "legal_basis": null
    },
    {
      "id": "pa5",
      "text": "Not a fit case for reversal of acquittal, regard being had to observations in Sanwat Singh v. State of Rajasthan since acquittal reinforces presumption of innocence.",
      "supporting_facts": [
        "f9",
        "f10"
      ],
      "legal_basis": "Sanwat Singh Others v. State of Rajasthan [1961] 3 S.C.R. 120"
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Powers of High Court in appeal from acquittal: can consider evidence and weigh probabilities, accept evidence rejected by Sessions Judge and reject accepted unless demeanour observation; must pay due attention to grounds of acquittal, bearing in mind presumption of innocence stronger after acquittal.",
      "addresses_issue": "i2",
      "key_observation": "High Court reassessed evidence and considered grounds for rejection by Sessions Judge."
    },
    {
      "id": "cr2",
      "text": "Direction of injuries not conclusive against standing position: depends on heights, lie of land, moves to avoid blows. Nothing inherently improbable.",
      "addresses_issue": "i1",
      "key_observation": "No contradiction with eye-witnesses."
    },
    {
      "id": "cr3",
      "text": "No blood at spot explained: sandy ground trampled, internal bleeding considerable (1 lb 11 oz), clothes (kurta, dhoti, khes) absorbed external bleeding; one witness said clothes drenched.",
      "addresses_issue": "i1",
      "key_observation": "No adverse inference."
    },
    {
      "id": "cr4",
      "text": "Eye-witness evidence consistent: incident at doorstep makes presence of brothers probable, daylight no mistake, prompt FIR with names, bladder empty and intestines full support version.",
      "addresses_issue": "i1",
      "key_observation": "Evidence of eye-witnesses consistent, convincing and credible."
    },
    {
      "id": "cr5",
      "text": "Sessions Judge lost sight of main issue of credibility in examining interrelations; such relationships common in villages, petty quarrels not conclusive unless significant; direct evidence matters more.",
      "addresses_issue": "i1",
      "key_observation": "Accept findings of High Court supported by evidence of sufficient probative force."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "High Court can reverse acquittal if grounds properly considered and presumption kept in view.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Eye-witness testimony reliable; no material contradictions; conviction proper.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Sanwat Singh Others v. State of Rajasthan",
      "citation": "[1961] 3 S.C.R. 120",
      "treatment": "referred",
      "relevance": "Observations on reversal of acquittal reinforcing presumption of innocence"
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "302/34"
      ],
      "relevance": "Appellants convicted for murder"
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court dismissed the appeal by special leave, upheld the Allahabad High Court's reversal of acquittal and conviction of the three appellants under s. 302/34 IPC to rigorous imprisonment for life, finding eye-witness evidence consistent, convincing and credible, and rejecting arguments on medical contradictions and witness interest.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The High Court can consider the evidence and weigh the probabilities. It can accept evidence rejected by the Sessions Judge and reject evidence accepted by him, unless the Sessions Judge relied upon his observation of the demeanour of a particular witness.",
      "speaker": "court",
      "significance": "Defines powers of High Court in appeal from acquittal"
    },
    {
      "text": "To decide a case on the basis of such circumstances [family relations, petty quarrels], unless they are of great or significant magnitude, is to place reliance on collateral circumstances at the expense of direct evidence of guilt which really matters.",
      "speaker": "court",
      "significance": "Prioritizes direct eye-witness evidence over peripheral relationships"
    },
    {
      "text": "We have had the evidence of the eye-witnesses read to us and after careful consideration we are satisfied that it is consistent, convincing and credible.",
      "speaker": "court",
      "significance": "Court's acceptance of prosecution evidence"
    }
  ],
  "_case_id": "1967_13",
  "_label": 0,
  "_text_length": 9804,
  "_extracted_at": "2026-02-10T20:20:00.204533"
}