{
  "metadata": {
    "case_name": "Auction-purchaser (Appellant) v. Respondents (Judgment-debtors)",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "Wanchoo, C.J."
    ],
    "case_number": "Civil Appeals No. 1005 of 1964",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Respondents were members of a Co-operative Housing Society and created a mortgage on their property in favour of the society.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Amount due under mortgage not paid; matter referred to Registrar, Co-operative Societies, who ordered on May 1, 1957, payment of Rs. 9,000 and odd plus interest at 12% p.a. from August 1, 1953 till satisfaction, or sale of property; society could proceed for balance if not realised.",
      "type": "material",
      "date": "1957-05-01",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Amount not paid; application to civil court for recovery under Registrar's order (amounting to a decree); property brought to sale.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Sale held on April 7, 1958; appellant highest bidder; sale concluded in his favour.",
      "type": "procedural",
      "date": "1958-04-07",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Application under O. XXI r. 90 CPC made on May 3, 1958; sale not confirmed till disposal.",
      "type": "procedural",
      "date": "1958-05-03",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Proceedings under O. XXI r. 90 continued up to October 7, 1958; on that day, one respondent gave evidence; before society's evidence, respondents requested one month's time to deposit decretal amount plus auction-purchaser's commission, offered to withdraw r.90 app.; society and auction-purchaser consented; court granted time till November 21, 1958; r.90 app. dismissed as withdrawn without costs.",
      "type": "procedural",
      "date": "1958-10-07",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "On November 20, 1958, respondents applied for one day's extension as November 21 was holiday; no order passed, no deposit made.",
      "type": "procedural",
      "date": "1958-11-20",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "November 21, 1958 holiday.",
      "type": "procedural",
      "date": "1958-11-21",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "On November 22, 1958, no amount deposited; counsel for respondents prayed for fortnight's extension; opposed by society and appellant; executing court refused extension as time granted by consent, confirmed sale under O. XXI r.92.",
      "type": "procedural",
      "date": "1958-11-22",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Appeal to District Judge allowed; held court has power under S.148 CPC or otherwise to postpone confirmation; executing court erred; remitted for deciding extension on merits.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Second appeal to Bombay High Court (Nagpur Bench); Single Judge held O.XXXIV r.5 not apply, O.XXI r.92 governs, S.148 not invocable; allowed appeal, restored executing court's order.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Letters Patent Appeal; Division Bench held O.XXXIV r.5 applies; even if not, mortgagor's rights end only on confirmation; if refusal of extension wrong, confirmation falls; allowed appeal, restored District Judge's order, set aside confirmation; directed payment of deposit to decree-holder and auction-purchaser; further time if additional amount due. Deposit made in 1959.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "High Court refused leave; special leave granted by Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the executing court was right in holding it could not extend time granted by consent of parties on October 7, 1958, and confirming the sale under O. XXI r.92.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether O. XXXIV r.5 CPC applies to execution of Registrar's order treated as mortgage decree for sale, and empowers court to extend time for deposit before confirmation.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Executing court rightly refused extension as time till Nov 21 granted by consent; no power under S.148 or otherwise to extend without consent post-r.90 dismissal; sale must be confirmed under O.XXI r.92.",
      "supporting_facts": [
        "f6",
        "f9"
      ],
      "legal_basis": "O. XXI r.92 CPC"
    },
    {
      "id": "pa2",
      "text": "Time on Oct 7 was by consent, evidenced by withdrawal of r.90 app. and order-sheet; six weeks granted but still consent order.",
      "supporting_facts": [
        "f6",
        "f9"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Court always has power under S.148 CPC or otherwise to extend time/postpone confirmation of sale of immovable property; executing court erred in refusing extension.",
      "supporting_facts": [
        "f9",
        "f10"
      ],
      "legal_basis": "S.148 CPC"
    },
    {
      "id": "ra2",
      "text": "O.XXXIV r.5 applies; mortgagor's right to redeem subsists till confirmation of sale; court must grant adjournment if right exists; wrongful refusal vitiates confirmation.",
      "supporting_facts": [
        "f12"
      ],
      "legal_basis": "O. XXXIV r.5 CPC"
    },
    {
      "id": "ra3",
      "text": "Time on Oct 7 not strictly by consent as requested one month but given six weeks.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Assuming O.XXXIV r.5 applies, it permits deposit before confirmation but gives no power to extend time or postpone confirmation; O.XXI r.92 mandates confirmation if no r.89/90/91 app. or disallowed.",
      "addresses_issue": "i2",
      "key_observation": "No power in O.XXXIV r.5 like in r.4 to extend time post-final decree."
    },
    {
      "id": "cr2",
      "text": "District Judge wrong; court cannot indefinitely postpone confirmation to accommodate judgment-debtor against O.XXI r.92.",
      "addresses_issue": "i1",
      "key_observation": "O.XXI r.92 makes confirmation mandatory when conditions met."
    },
    {
      "id": "cr3",
      "text": "Mortgagor's right to redeem under O.XXXIV r.5 till confirmation, but no right to seek postponement; harmonious reading with O.XXI r.92 requires confirmation unless deposited before.",
      "addresses_issue": "i1",
      "key_observation": "Letters Patent Bench erred; rights end on confirmation, no automatic power to adjourn."
    },
    {
      "id": "cr4",
      "text": "On Oct 7, consent postponed confirmation till Nov 21; r.90 dismissed; post that, bound to confirm unless deposit made; no deposit by Nov 22 before confirmation; S.148 inapplicable to consent time.",
      "addresses_issue": "i1",
      "key_observation": "Executing court correct in refusing unilateral extension."
    },
    {
      "id": "cr5",
      "text": "Time grant on Oct 7 by oral compromise/consent, clear from withdrawal and order-sheet; same judge noted consent on Nov 22.",
      "addresses_issue": "i1",
      "key_observation": "Consent order, not unilateral."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Executing court has no power to extend time for deposit granted by consent of parties without further consent; must confirm sale under O.XXI r.92 if conditions met and no deposit made before confirmation, even under O.XXXIV r.5.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "O.XXXIV r.5 permits deposit before confirmation in mortgage sale execution but confers no power on court to grant time or postpone confirmation.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Janak Rai v. Gurdial Singh",
      "citation": "1967 2 S.C.R. 77",
      "treatment": "followed",
      "relevance": "Once conditions of O.XXI r.92(1) complied with, executing court must confirm sale."
    }
  ],
  "statutes_cited": [
    {
      "name": "Code of Civil Procedure, 1908",
      "sections": [
        "O. XXI r. 89",
        "O. XXI r. 90",
        "O. XXI r. 91",
        "O. XXI r. 92",
        "O. XXXIV r. 4",
        "O. XXXIV r. 5",
        "S. 148"
      ],
      "relevance": "Govern confirmation of execution sales, deposit in mortgage decrees, and inherent power to extend time; r.92 mandatory, r.5 permits deposit but no extension power."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Supreme Court allowed the appeal, set aside Letters Patent Bench and District Judge orders, restored executing court's order of November 22, 1958 confirming sale in favour of appellant; respondents to pay appellant's costs throughout; respondents can take back their deposit.",
    "relief_granted": "Sale confirmed in favour of appellant on November 22, 1958; costs to appellant.",
    "costs": "Respondents to pay costs of appellant throughout."
  },
  "key_quotes": [
    {
      "text": "\"It is not open to the court to go on fixing date after date and postponing confirmation of sale merely to accommodate a judgment-debtor.\"",
      "speaker": "court",
      "significance": "Clarifies limits on court's power under O.XXI r.92."
    },
    {
      "text": "\"O. XXXIV r. 5 only permits the judgment-debtor to deposit the amount due under the decree... But there is no power in O. XXXIV r. 5 to grant extension of time and postpone confirmation of sale therefor.\"",
      "speaker": "court",
      "significance": "Defines scope of O.XXXIV r.5; no extension power."
    },
    {
      "text": "\"Section 148 of the Code of Civil Procedure would not apply in these circumstances, and the executing court was right in holding that it could not extend time.\"",
      "speaker": "court",
      "significance": "Rejects S.148 applicability to consent-based time grants."
    }
  ],
  "_case_id": "1967_246",
  "_label": 1,
  "_text_length": 19462,
  "_extracted_at": "2026-02-10T20:23:22.699882"
}