{
  "metadata": {
    "case_name": "Guduthur Thimmappa Brothers v. Excess Profits Tax Officer",
    "case_year": 1966,
    "court": "Supreme Court of India",
    "judges": [
      "Ramaswami, J."
    ],
    "case_number": "Civil Appeal No. 185 of 1966",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellants constituted themselves into a partnership called Guduthur Thimmappa Brothers in 1934, carrying on business in Bellary town. Partners were G. Thimmappa, G. Ekambarappa, and G. Padmanabhan, each representing their respective joint families. All partners were residents of Bellary town.",
      "type": "background",
      "date": "1934",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The firm was dissolved on October 16, 1944.",
      "type": "background",
      "date": "1944-10-16",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "G. Thimmappa, one of the partners, died on April 13, 1955.",
      "type": "background",
      "date": "1955-04-13",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Bellary district was part of old Madras State (Part A State) until merger with Mysore State (Part B State) on October 1, 1953. Mysore continued as Part B State until November 1, 1956.",
      "type": "background",
      "date": "1953-10-01",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Excess Profits Tax Act, 1940 originally extended to territory of former British India. After Constitution, s.1(2) adapted to extend to whole of India except Part B States by Adaptation of Laws Order, 1950.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "After States Reorganisation Act, 1956, s.1(2) of the Act adapted by President's Adaptation of Laws (No.) Order, 1956 dated December 31, 1956, extending to whole of India except territories which immediately before November 1, 1956 were comprised in Part B States. Result: Act repealed in Bellary district with effect from November 1, 1956.",
      "type": "background",
      "date": "1956-11-01",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "For chargeable accounting period from October 30, 1943 to April 30, 1944, Excess Profits Tax Officer took steps to assess escaped profits of the firm, issuing notices to G. Padmanabhan, G. Ekambarappa, G.M. Prabhu and G. Lakshmidevamma as representatives.",
      "type": "procedural",
      "date": "1943-10-30",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Respondent issued notice dated January 16, 1960 under s.15 of Excess Profits Tax Act, 1940 calling upon appellants to submit return of standard profits and profits actually made during chargeable accounting period from October 30, 1943 to October 30, 1944 on ground of under-assessment.",
      "type": "procedural",
      "date": "1960-01-16",
      "source": "respondent"
    },
    {
      "id": "f9",
      "text": "Appellants filed Writ Petition No. 109 of 1960 in Mysore High Court praying for quashing of the notice.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f10",
      "text": "Mysore High Court dismissed writ petition by judgment dated March 20, 1962.",
      "type": "procedural",
      "date": "1962-03-20",
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the appellants continued to be liable to be proceeded against under s.15 of the Excess Profits Tax Act, 1940 for profits which had escaped taxation after the Act stood repealed in Bellary district by Adaptation of Laws Order, 1956, particularly in light of s.6 of the General Clauses Act.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "From November 1, 1956 the Act must be deemed to have been repealed so far as Bellary district is concerned and therefore respondent was not competent to take proceedings under s.15 for escaped income.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": "Adaptation of Laws Order, 1956; s.1(2) Excess Profits Tax Act"
    },
    {
      "id": "pa2",
      "text": "Adaptation of Laws Order, 1956 only modified s.1(2) of the Act and did not repeal the Act as such; effect was provisions no longer applicable to Bellary district; s.6 General Clauses Act not applicable as not a repeal.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": "s.6 General Clauses Act"
    },
    {
      "id": "pa3",
      "text": "Even if s.6 General Clauses Act applicable, no liability incurred or accrued as no assessment of escaped profits before November 1, 1956.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": "s.6(c) General Clauses Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Though Act stood repealed by inclusion of Bellary in Mysore State, liability to pay tax on escaped profits continued by virtue of s.6 General Clauses Act.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": "s.6 General Clauses Act"
    },
    {
      "id": "ra2",
      "text": "Liability to tax arose immediately at the end of the chargeable accounting period, not merely at time of quantification by assessment.",
      "supporting_facts": [
        "f7",
        "f8"
      ],
      "legal_basis": null
    },
    {
      "id": "ra3",
      "text": "Alternatively, on combined operation of s.53 Andhra Pradesh Act 30 of 1953 and s.119 States Reorganisation Act 37 of 1956, all provisions of Excess Profits Tax Act remained in operation in Bellary despite Adaptation Order.",
      "supporting_facts": [
        "f5",
        "f6"
      ],
      "legal_basis": "s.53 Andhra Pradesh Act 1953; s.119, s.120 States Reorganisation Act 1956"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Adaptation of Laws Order, 1956 resulted in repeal of the Act so far as Bellary district concerned; s.6 General Clauses Act applies even to partial repeal.",
      "addresses_issue": "i1",
      "key_observation": "Repeal means revocation or abrogation; s.3(19) General Clauses Act includes any provision in any Act."
    },
    {
      "id": "cr2",
      "text": "Liability to tax arose immediately at end of chargeable accounting period, not at assessment; thus preserved under s.6(c) General Clauses Act despite repeal.",
      "addresses_issue": "i1",
      "key_observation": "Liability accrues by virtue of charging section at close of previous year, quantification postponed."
    },
    {
      "id": "cr3",
      "text": "No need to decide alternative argument on ss.53 AP Act and 119 SRA as main ground sufficient to dismiss appeal.",
      "addresses_issue": "i1",
      "key_observation": "Appeal dismissed on primary ground."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Notice under s.15 Excess Profits Tax Act valid; appellants liable to be proceeded against for escaped profits; s.6 General Clauses Act saves accrued liability post-repeal.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Wallace Brothers and Co. Ltd. v. Commissioner of Income-tax",
      "citation": "16 I.T.R. 240 (P.C.)",
      "treatment": "followed",
      "relevance": "Liability to tax arises by virtue of charging section at close of previous year, not later."
    },
    {
      "case_name": "Chatturam Horilram Ltd. v. C.I.T.",
      "citation": "27 I.T.R. 769",
      "treatment": "followed",
      "relevance": "Income chargeable to tax independently of Finance Act; escaped assessment proceedings valid post-retrospective extension."
    },
    {
      "case_name": "Kalwa Devadattam v. Union of India",
      "citation": "49 I.T.R. 165; AIR 1966 SC 1415",
      "treatment": "followed",
      "relevance": "Income-tax liability arises on accrual of income, not later than close of year of account."
    },
    {
      "case_name": "State of Kerala v. N. Sami Iyer",
      "citation": null,
      "treatment": "followed",
      "relevance": "Reiterated principle that tax liability accrues at end of accounting period."
    }
  ],
  "statutes_cited": [
    {
      "name": "Excess Profits Tax Act, 1940",
      "sections": [
        "s.15",
        "s.1(2)"
      ],
      "relevance": "Notice issued under s.15 for escaped profits; s.1(2) adapted leading to repeal in Bellary."
    },
    {
      "name": "General Clauses Act",
      "sections": [
        "s.6",
        "s.3(19)"
      ],
      "relevance": "s.6 saves accrued liabilities post-repeal; s.3(19) defines enactment including provisions of Act."
    },
    {
      "name": "States Reorganisation Act, 1956 (Act 37 of 1956)",
      "sections": [
        "s.119",
        "s.120"
      ],
      "relevance": "Preserves territorial operation of laws; allows adaptations (noted but not decided)."
    },
    {
      "name": "Andhra Pradesh Act (Act 30 of 1953)",
      "sections": [
        "s.53"
      ],
      "relevance": "Continues operation of laws in territories post-appointed day (alternative argument, not decided)."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court dismissed the appeal by special leave, upholding the Mysore High Court's dismissal of the writ petition. Held that the notice under s.15 of the Excess Profits Tax Act, 1940 was valid as tax liability on escaped profits accrued at the end of the chargeable accounting period and continued under s.6 of the General Clauses Act despite repeal of the Act in Bellary district.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "the liability to tax arises by virtue of the charging section alone, and it arises not later than the close of the previous year, though quantification of the amount payable is postponed.",
      "speaker": "court",
      "significance": "Defines when tax liability accrues, key to applying s.6 General Clauses Act."
    },
    {
      "text": "Repeal of an Act means revocation or abrogation of the Act and, in our opinion, s. 6 of the General Clauses Act applies even in the case of a partial repeal or repeal of part of an Act.",
      "speaker": "court",
      "significance": "Rejects argument that adaptation was mere modification, not repeal."
    },
    {
      "text": "Under the Indian Income-tax Act liability to pay income-tax arises on the accrual of the income, and not from the computation made by the taxing authorities in the course of assessment proceedings.",
      "speaker": "court",
      "significance": "Confirms liability timing from precedent."
    }
  ],
  "_case_id": "1967_250",
  "_label": 0,
  "_text_length": 12895,
  "_extracted_at": "2026-02-10T20:23:18.103438"
}