{
  "metadata": {
    "case_name": "Appellant v. Respondents",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "Wanchoo, J."
    ],
    "case_number": "Civil Appeal No. 990 of 1964",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "On May 20, 1955, an agreement was entered into between the appellant and the respondents referring certain differences between them to the arbitration of three persons.",
      "type": "background",
      "date": "1955-05-20",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On January 19, 1956, an award was made, signed by two out of the three arbitrators as the third arbitrator had refused to sign the award.",
      "type": "material",
      "date": "1956-01-19",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The award was filed in court on September 7, 1957 and the respondents prayed for a decree in accordance with the award.",
      "type": "procedural",
      "date": "1957-09-07",
      "source": "respondent"
    },
    {
      "id": "f4",
      "text": "Notice of filing of the award was issued to the appellant and was served upon him on September 30, 1957.",
      "type": "procedural",
      "date": "1957-09-30",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "On November 3, 1957, the appellant filed an objection in the nature of a written statement attacking the validity of the award on various grounds, containing 43 paragraphs but no prayer for relief.",
      "type": "procedural",
      "date": "1957-11-03",
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "The respondents contended that the objection was in the nature of an application to set aside the award under s. 30 of the Arbitration Act and was barred by limitation under Art. 158 of the Indian Limitation Act as filed more than 30 days after notice.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f7",
      "text": "The trial court held the objection not maintainable, as remedy was to apply under s. 33, and since not done within time, passed a decree in terms of the award.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "The appellant appealed to the Allahabad High Court in First Appeal from Order No. 30 of 1960.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "The High Court held that award could not be set aside on grounds under s. 30 except by application under s. 33 within 30 days, dismissed the appeal on April 15, 1963, but granted certificate to appeal to Supreme Court.",
      "type": "procedural",
      "date": "1963-04-15",
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the appellant could maintain his objection to set aside the award on grounds under s. 30 of the Arbitration Act when filed more than 30 days after service of notice without a formal application under s. 33.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the court can set aside the award suo motu on grounds under s. 30 even if objection filed beyond limitation period.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The objection should be treated as an application under s. 33 even if filed late, or court can set aside award suo motu under s. 17 on grounds in objection.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": "Sections 17, 30, 33 of Arbitration Act; Hastimal Dalichand Bora v. Hiralal Motichand Mutha (AIR 1954 Bom 243); Saha Co. v. Ishar Singh Kripal Singh (AIR 1956 Cal 321); Mohan Das Kessumal"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The objection was in nature of application to set aside under s. 30, filed beyond 30 days after notice, hence barred by Art. 158 Limitation Act; cannot be treated as s. 33 application.",
      "supporting_facts": [
        "f4",
        "f5"
      ],
      "legal_basis": "Sections 30, 33 Arbitration Act; Art. 158 Limitation Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The Arbitration Act 1940 is a self-contained code; scheme requires application to set aside award on grounds in s. 30 within 30 days of notice under Art. 158 Limitation Act; objection filed beyond time cannot be treated as such application.",
      "addresses_issue": "i1",
      "key_observation": "No application under s. 30 grounds within limitation, so court cannot set aside award."
    },
    {
      "id": "cr2",
      "text": "Even if court has suo motu power under s. 17, it cannot be exercised on s. 30 grounds via late objection, as that would negate limitation; cited cases distinguish patent illegality not under s. 30.",
      "addresses_issue": "i2",
      "key_observation": "Suo motu power limited to grounds outside s. 30."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Objection raising s. 30 grounds filed beyond 30 days cannot be entertained or treated as application to set aside award; court must pronounce judgment per award under s. 17.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Court cannot set aside award suo motu on s. 30 grounds based on late objection.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Hastimal Dalichand Bora v. Hiralal Motichand Mutha",
      "citation": "A.I.R. 1954 Bom. 243",
      "treatment": "distinguished",
      "relevance": "Court can act suo motu on patent defects not falling under s. 30, no limitation issue."
    },
    {
      "case_name": "Saha Co. v. Ishar Singh Kripal Singh",
      "citation": "A.I.R. 1956 Cal. 321",
      "treatment": "distinguished",
      "relevance": "Majority against appellant; minority allows challenges outside s. 30 beyond limitation, but not applicable here."
    },
    {
      "case_name": "Mohan Das Kessumal",
      "citation": null,
      "treatment": "referred",
      "relevance": "Objection beyond time on unauthorised filing not upheld."
    }
  ],
  "statutes_cited": [
    {
      "name": "Arbitration Act, No. 10 of 1940",
      "sections": [
        "s. 30",
        "s. 33",
        "s. 17",
        "s. 32",
        "s. 14",
        "s. 15",
        "s. 16"
      ],
      "relevance": "Governs procedure for challenging and enforcing awards; requires timely application to set aside on specified grounds."
    },
    {
      "name": "Indian Limitation Act, No. 9 of 1908",
      "sections": [
        "Art. 158"
      ],
      "relevance": "Prescribes 30 days limitation for application to set aside award from service of notice."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court dismissed the appeal, upholding the High Court and trial court's decree in terms of the arbitration award, as no timely application under s. 33 was made to set aside on s. 30 grounds.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"It is clear therefore from the scheme of the Act that if a party wants an award to be set aside on any of the grounds mentioned in S. 30 it must apply within 30 days of the date of service of notice of filing of the award.\"",
      "speaker": "court",
      "significance": "Core holding on mandatory timely application under Arbitration Act."
    },
    {
      "text": "\"any objection even in the nature of a written-statement which falls under s. 30 cannot be considered by the court unless such an objection is made within the period of limitation namely, 30 days\"",
      "speaker": "court",
      "significance": "Clarifies treatment of objections as applications if within time."
    }
  ],
  "_case_id": "1967_344",
  "_label": 0,
  "_text_length": 14261,
  "_extracted_at": "2026-02-10T20:24:40.764326"
}