{
  "metadata": {
    "case_name": "Appellant Company v. Respondent Director",
    "case_year": 1967,
    "court": "Supreme Court of India",
    "judges": [
      "Shah, J."
    ],
    "case_number": "Civil Appeal No. 1082 of 1967",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant is a private limited company engaged in the manufacture of electric conduit pipes.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Respondent is a director of the appellant company.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Respondent presented a petition in the High Court of Delhi under ss. 433 and 439 of the Companies Act, 1956, for compulsory winding up of the company, claiming it just and equitable under s. 443(f) because one of the three factories closed, accounts not shown to respondent, no meetings held, no balance-sheet prepared, and letter of resignation purportedly signed by respondent forged.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f4",
      "text": "On July 18, 1966, Capoor, J. directed notice of the petition be issued to the appellant company; unclear if to show cause why not admitted or if petition admitted and notice under r.96 issued.",
      "type": "procedural",
      "date": "1966-07-18",
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "Appellant company filed reply controverting the allegations and an application that the winding up petition be taken off the file, dismissed, and not advertised in the meantime.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "H.R. Khanna, J. held appropriate remedy under ss.397 and 398 for mismanagement and oppression of minority by Anandi Lal group; petition instituted to unfairly prejudice shareholders as respondent set up rival factory in son's name; directed petition not be advertised and be dismissed.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "In appeal against H.R. Khanna J.'s order, Delhi High Court held under Companies Court Rules 1959, once petition admitted, court bound to advertise forthwith.",
      "type": "procedural",
      "date": "1967-03-07",
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the High Court can direct advertisement of a winding up petition even before considering an application by the company to restrain advertisement to prevent abuse of process of court, under Rule 96 of Companies Court Rules 1959.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether a single judge can dismiss a winding up petition without advertisement if it is not bona fide and for ulterior motives.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Petition for winding up not bona fide, instituted with ulterior motive to unfairly prejudice shareholders as respondent set up rival factory; appropriate remedy under ss.397/398; petition should not be advertised and dismissed.",
      "supporting_facts": [
        "f3",
        "f6"
      ],
      "legal_basis": "ss.397, 398 Companies Act 1956; inherent powers"
    },
    {
      "id": "pa2",
      "text": "Under r.96, court may issue notice to show cause before admission and advertisement; even after admission, can restrain advertisement to prevent abuse.",
      "supporting_facts": [
        "f4",
        "f5"
      ],
      "legal_basis": "Rule 96, Companies Court Rules 1959; r.24 exception for winding up"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Once petition admitted, court bound to advertise forthwith under Companies Court Rules.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "Companies Court Rules 1959"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Under r.96, upon filing, posted for admission, fixing hearing date, directions on advertisement; judge may direct notice to company before advertisement directions.",
      "addresses_issue": "i1",
      "key_observation": "Court has options: notice to show cause why not admit; admit and notice before advertise; or admit, fix hearing, order advertise."
    },
    {
      "id": "cr2",
      "text": "Petition cannot be heard without advertisement per r.24, but admission does not mandate immediate advertisement; company can oppose admission as abuse, or post-admission apply to not advertise.",
      "addresses_issue": "i1",
      "key_observation": "Inherent power to prevent abuse, r.9 affirms inherent powers for ends of justice."
    },
    {
      "id": "cr3",
      "text": "H.R. Khanna J. satisfied petition not bona fide, respondent acting with ulterior motive.",
      "addresses_issue": "i2",
      "key_observation": "High Court erred by not considering this view, disposed only on procedure."
    },
    {
      "id": "cr4",
      "text": "Mandatory advertisement post-admission would enable harassment/blackmail, damaging company business.",
      "addresses_issue": "i1",
      "key_observation": "View that must advertise immediately contrary to r.96."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Court may restrain advertisement of winding up petition if not bona fide or to prevent abuse of process, even post-admission, using inherent powers.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "High Court erred in holding mandatory advertisement upon admission without considering merits of abuse.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "In re. A. Company",
      "citation": "1894 2 Ch. D. 349",
      "treatment": "followed",
      "relevance": "Court will restrain advertisement if petition not in good faith but for pressure on company."
    },
    {
      "case_name": "Lord Krishna Sugar Mills Ltd. v. Smt. Abnash Kaur",
      "citation": "A.I.R. 1961 Punjab 505",
      "treatment": "followed",
      "relevance": "Court has power to suspend advertisement pending application to revoke admission."
    }
  ],
  "statutes_cited": [
    {
      "name": "Companies Act, 1956",
      "sections": [
        "433",
        "439",
        "443(f)",
        "397",
        "398"
      ],
      "relevance": "Basis for winding up petition on just and equitable grounds; alternative remedy for oppression/mismanagement."
    },
    {
      "name": "Companies (Court) Rules, 1959",
      "sections": [
        "96",
        "24",
        "9"
      ],
      "relevance": "Procedure for admission, notice, advertisement of winding up petitions; inherent powers preserved."
    }
  ],
  "outcome": {
    "disposition": "partially_accepted",
    "summary": "Appeal allowed; High Court's order set aside; case remanded to High Court to dispose of the appeal according to law, considering the view of H.R. Khanna J. on abuse of process.",
    "relief_granted": "Remand to High Court for merits consideration; no advertisement directed pending that.",
    "costs": "No order as to costs in this Court."
  },
  "key_quotes": [
    {
      "text": "\"Such a view, if accepted, would make the Court an instrument, in possible cases, of harassment and even of blackmail, for once a petition is advertised, the business of the Company is bound to suffer serious loss and injury.\"",
      "speaker": "court",
      "significance": "Explains risk of mandatory advertisement enabling abuse."
    },
    {
      "text": "\"Nothing in these Rules shall be deemed to limit or otherwise affect the inherent powers of the Court to give such direction or pass such orders as may necessary for the ends of justice to prevent abuse of the process of the Court.\"",
      "speaker": "court",
      "significance": "Affirms inherent power under r.9 to restrain advertisement."
    }
  ],
  "_case_id": "1967_73",
  "_label": 1,
  "_text_length": 8046,
  "_extracted_at": "2026-02-10T20:20:37.400800"
}