{
  "metadata": {
    "case_name": "Sant Ram Sharma v. State of Rajasthan",
    "case_year": 1966,
    "court": "Supreme Court of India",
    "judges": [
      "Ramaswami, J."
    ],
    "case_number": "Writ Petition No. 182 of 1966",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Petitioner Sri Sant Ram Sharma appointed to Indian Police Service on June 10, 1952.",
      "type": "background",
      "date": "1952-06-10",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Sri Hanuman Sharma, Sri Sultan Singh and Sri Ganesh Singh appointed to Indian Police Service in 1951 and officiating as Deputy Inspector General of Police since April 22, 1952 (Hanuman and Sultan) and May 17, 1952 (Ganesh).",
      "type": "background",
      "date": "1951",
      "source": "respondent"
    },
    {
      "id": "f3",
      "text": "Indian Police Service (Regulation of Seniority) Rules, 1954 came into force on September 8, 1954. Gradation List prepared by State of Rajasthan in August 1955: petitioner 5th, Hanuman Sharma 7th, Sultan Singh 14th, Ganesh Singh 17th.",
      "type": "procedural",
      "date": "1954-09-08",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Year of allotment under Rule 3: petitioner 1942, Hanuman Sharma 1943, Sultan Singh 1945.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "In April 1955, State of Rajasthan decided to confirm Hanuman Sharma, Sultan Singh and Ganesh Singh as Deputy Inspector General of Police, superseding petitioner.",
      "type": "material",
      "date": "1955-04",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Petitioner confirmed in Senior Scale of IPS on June 10, 1954; other three officers confirmed on March 24, 1953.",
      "type": "procedural",
      "date": "1953-03-24",
      "source": "respondent"
    },
    {
      "id": "f7",
      "text": "In June 1959, Hanuman Sharma promoted as Special Inspector-General of Police; post encadred and confirmed on June 2, 1961.",
      "type": "procedural",
      "date": "1959-06",
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "On March 22, 1966, Hanuman Sharma promoted as Inspector General of Police, Rajasthan, superseding petitioner (notification annexure G).",
      "type": "material",
      "date": "1966-03-22",
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "On April 28, 1966, Sultan Singh promoted as Additional Inspector General of Police, superseding petitioner (notification annexure H).",
      "type": "material",
      "date": "1966-04-28",
      "source": "petitioner"
    },
    {
      "id": "f10",
      "text": "Posts of Inspector General, Additional IG and DIG are selection posts carrying pay above time-scale.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "State considered comparative merit of petitioner and others in 1955 for DIG confirmation and in 1966 for IG/Addl IG promotions.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f12",
      "text": "Petitioner's rejoinder dated July 17, 1967 vaguely suggests his case not considered.",
      "type": "procedural",
      "date": "1967-07-17",
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the petitioner was entitled, as of right, to be promoted as Deputy Inspector General of Police in 1955 or as Inspector General of Police in 1966 merely on the ground that his name stood first in the Gradation List prepared under Rule 6 of the Indian Police Service (Regulation of Seniority) Rules, 1954.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether promotions to selection grade posts can be governed by administrative instructions in absence of specific statutory rules, and whether that violates Articles 14 and 16.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether the petitioner's case was considered for promotions, and if not, whether that violates Articles 14 and 16.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Petitioner entitled as matter of right to appointment as DIG in 1955 and IG in 1966 as senior-most in Gradation List; orders violate Rule 6 of 1954 Seniority Rules.",
      "supporting_facts": [
        "f3",
        "f4",
        "f5",
        "f8",
        "f9"
      ],
      "legal_basis": "Indian Police Service (Regulation of Seniority) Rules, 1954 Rule 6"
    },
    {
      "id": "pa2",
      "text": "Claim not considered in 1955 or 1966, violating fundamental rights under Articles 14 and 16.",
      "supporting_facts": [
        "f5",
        "f8",
        "f9",
        "f12"
      ],
      "legal_basis": "Articles 14, 16"
    },
    {
      "id": "pa3",
      "text": "Gradation List must be followed strictly; State cannot disregard seniority for selection posts.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": "Indian Police Service (Regulation of Seniority) Rules, 1954 Rules 4,5,5A,6,7"
    },
    {
      "id": "pa4",
      "text": "Absence of statutory rules means no administrative instructions can restrict; merit introduces nepotism violating Articles 14,16.",
      "supporting_facts": [],
      "legal_basis": "Articles 14, 16, 309"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Posts of IG, Addl IG, DIG are selection posts based on merit and past experience, not merely Gradation List rank.",
      "supporting_facts": [
        "f2",
        "f6",
        "f10",
        "f11"
      ],
      "legal_basis": "Indian Police Service (Pay) Rules, 1954 Rules 3,8 Schedule III"
    },
    {
      "id": "ra2",
      "text": "Officers had earlier appointments, officiation and confirmation; merit considered objectively via record-sheets.",
      "supporting_facts": [
        "f2",
        "f6",
        "f11"
      ],
      "legal_basis": "Administrative instructions dated July 31/Aug 3 1954, June 1 1955, Oct 5 1956"
    },
    {
      "id": "ra3",
      "text": "Petitioner's case was considered in 1955 and 1966; no right to selection posts; promotion on merit, seniority only if equal.",
      "supporting_facts": [
        "f5",
        "f8",
        "f9",
        "f11"
      ],
      "legal_basis": null
    },
    {
      "id": "ra4",
      "text": "No violation of Seniority Rules or Articles 14,16 as all eligible considered.",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": "Articles 14, 16"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Posts of IG, Addl IG, DIG are selection posts outside time-scales per Pay Rules 3,8 Sch III; not bound by Gradation List alone.",
      "addresses_issue": "i1",
      "key_observation": "Promotion to selection posts primarily on merit, seniority only if merits equal."
    },
    {
      "id": "cr2",
      "text": "P.C. Wadhwa distinguished as it concerned time-scale posts, not selection posts.",
      "addresses_issue": "i1",
      "key_observation": "No right to posts above time-scale based on seniority."
    },
    {
      "id": "cr3",
      "text": "Government can issue administrative instructions to supplement silent rules without violating Art 309; cited B.N. Nagarajan and T. Cajee.",
      "addresses_issue": "i2",
      "key_observation": "Executive power under Art 162 allows filling gaps till rules framed."
    },
    {
      "id": "cr4",
      "text": "Petitioner's case was considered (per counter-affidavit paras 23,25,40,44); no specific allegation otherwise; no violation of Arts 14,16.",
      "addresses_issue": "i3",
      "key_observation": "Objective merit evaluation via records ensures equality."
    },
    {
      "id": "cr5",
      "text": "Merit-based promotion balances public interest; seniority alone inefficient; long practice in IPS valid.",
      "addresses_issue": "i2",
      "key_observation": "Merit system does not violate Arts 14,16."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "No right to promotion to selection posts merely on Gradation List seniority; based primarily on merit.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Administrative instructions valid to govern selection post promotions where rules silent.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Petitioner's case considered; no violation of Articles 14 or 16.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "P. C. Wadhwa v. Union of India",
      "citation": "(1964) 4 S.C.R. 598",
      "treatment": "distinguished",
      "relevance": "Concerned right to senior time-scale posts, not selection posts above time-scale."
    },
    {
      "case_name": "B. N. Nagarajan v. State of Mysore",
      "citation": "(1966) 3 S.C.R. 682",
      "treatment": "followed",
      "relevance": "State executive power under Art 162 to act without rules under Art 309 proviso."
    },
    {
      "case_name": "T. Cajee v. U. Jormanik Siem",
      "citation": null,
      "treatment": "followed",
      "relevance": "Administrative power to appoint/remove exists without prior law; legislative lists do not preclude executive action."
    }
  ],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Article 32",
        "Article 14",
        "Article 16",
        "Article 309",
        "Article 162"
      ],
      "relevance": "Writ jurisdiction; equality and equal opportunity in public employment; executive power to supplement rules."
    },
    {
      "name": "All India Services Act, 1951",
      "sections": [
        "Section 3(1)"
      ],
      "relevance": "Central Government power to make rules for All-India Services."
    },
    {
      "name": "Indian Police Service (Regulation of Seniority) Rules, 1954",
      "sections": [
        "Rule 2(a)",
        "Rule 2(d)",
        "Rule 2(g)",
        "Rule 3",
        "Rule 4",
        "Rule 5",
        "Rule 5-A",
        "Rule 6",
        "Rule 7"
      ],
      "relevance": "Year of allotment, seniority, gradation list preparation; does not govern selection post promotions."
    },
    {
      "name": "Indian Police Service (Pay) Rules, 1954",
      "sections": [
        "Rule 2(a)",
        "Rule 3",
        "Rule 8",
        "Schedule III Part B"
      ],
      "relevance": "Time-scales vs selection grade posts above time-scale (IG, Addl IG, DIG)."
    },
    {
      "name": "Indian Police Service (Cadre) Rules, 1954",
      "sections": [
        "Rule 3"
      ],
      "relevance": "Definition of cadre."
    },
    {
      "name": "Indian Police Service (Fixation of Cadre Strength) Regulations, 1955",
      "sections": [
        "Item 1 of each Schedule"
      ],
      "relevance": "Definition of senior post."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The writ petition under Article 32 challenging supersession in promotions to selection posts of DIG, IG and Addl IG is dismissed. Petitioner has no right to such posts based solely on Gradation List seniority; promotions validly based on merit after consideration of his case.",
    "relief_granted": "None",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The circumstance that these posts are classed as Selection Grade Posts itself suggests that promotion to these posts is not automatic being made only on the basis of ranking in the Gradation List but the question of merit enters in promotion to selection posts.",
      "speaker": "court",
      "significance": "Core holding on selection posts."
    },
    {
      "text": "It is a well-established rule that promotion to selection grades or selection posts is to be based primarily on merit and not on seniority alone.",
      "speaker": "court",
      "significance": "Principle applied to dismiss petition."
    },
    {
      "text": "The principal object of a promotion system is to secure the best possible incumbents for the higher positions, while maintaining the morale of the whole Organisation.",
      "speaker": "court",
      "relevance": "Justification for merit over pure seniority."
    }
  ],
  "_case_id": "1967_148",
  "_label": 0,
  "_text_length": 31673,
  "_extracted_at": "2026-02-10T20:22:13.463607"
}