{
  "metadata": {
    "case_name": "Union of India v. First Respondent (Landowner)",
    "case_year": 1966,
    "court": "Supreme Court of India",
    "judges": [
      "Mitter, J."
    ],
    "case_number": "Civil Appeal No. 1564 of 1966",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "On May 2, 1942 a plot of land bearing S. No. NA-29-A of Juhu, Bombay, was requisitioned for the purposes of the Union of India under r. 75-A of the Defence of India Rules for military purposes. It is common case that this plot of land was acquired for the construction of a road leading to a military aerodrome at Juhu during the last war.",
      "type": "material",
      "date": "1942-05-02",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The land originally belonged to the husband of the first respondent who claims to have succeeded to it by virtue of a will.",
      "type": "background",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f3",
      "text": "The owner of the plot was receiving compensation for the requisition until December 29, 1952 when a notification was issued under s. 7(1) of the Requisitioning and Acquisition of Immovable Property Act, 1952. The notification was to the effect that the land was being acquired by the Government of India, Ministry of Works, Housing and Supply, that it would vest in the Government from the date of the notification and there was a declaration of vesting in the notification itself.",
      "type": "material",
      "date": "1952-12-29",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "As a result of the notification, the owner of the land became entitled to claim compensation.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The second respondent, the Collector of Bombay, offered compensation at the rate of Rs. 11 per sq. yard on February 20, 1961.",
      "type": "procedural",
      "date": "1961-02-20",
      "source": "respondent"
    },
    {
      "id": "f6",
      "text": "The petitioner, the first respondent herein, claimed at the rate of Rs. 100 per sq. yard plus the usual 15 solatium for compulsory acquisition.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "In the absence of an agreement between the parties, the Chief Judge, Court of Small Causes, Bombay, was appointed as arbitrator under s. 8 of the Act.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "The arbitrator gave notice to the petitioner to put in her claim and also to the Government of India to put in its statement of valuation. The petitioner claimed compensation at the rate of Rs. 75 per sq. yard plus 15 solatium for compulsory acquisition while the offer of the State was only Rs. 11 per sq. yard without any solatium.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "Before the arbitrator could make much headway in the matter, the first respondent preferred a petition in the High Court of Bombay on September 18, 1962 wherein the main prayers were (1) a declaration that the provisions of s. 8(3) of the Act were unconstitutional as infringing Arts. 31(2), 19(1)(f) and 14 of the Constitution of India, and (2) the issue of an appropriate writ directing the arbitrator to forbear from awarding compensation on the principles laid down in s. 8(3) of the Act and commanding him to award just and proper compensation in accordance with law.",
      "type": "procedural",
      "date": "1962-09-18",
      "source": "petitioner"
    },
    {
      "id": "f10",
      "text": "The Union of India filed an affidavit in opposition affirmed by an Executive Engineer of the Bombay Aviation Division wherein many and diverse objections were raised to the petition.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f11",
      "text": "Before the High Court, counsel for the petitioner confined the challenge to the validity of s. 8(3) of the Act to cl. b only.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "The High Court negatived the contentions put forward on behalf of the Union of India and allowed the petition holding that cl. b including the words whichever is less of sub-s. (3) of s. 8 of the Act was ultra vires Art. 31 of the Constitution and as such void. The court gave a direction that the assessment of compensation would have to be made subject to this declaration dated August 7, 1964.",
      "type": "procedural",
      "date": "1964-08-07",
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "This is an appeal by a certificate under Art. 133(1)(c) of the Constitution granted by the High Court of Bombay.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "The Collector assessed the compensation on July 2, 1962.",
      "type": "procedural",
      "date": "1962-07-02",
      "source": "court"
    },
    {
      "id": "f15",
      "text": "The arbitrator was appointed on 21st June, 1961.",
      "type": "procedural",
      "date": "1961-06-21",
      "source": "lower_court"
    },
    {
      "id": "f16",
      "text": "The notification under s. 7 was given on April 2, 1953.",
      "type": "material",
      "date": "1953-04-02",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether cl. b of sub-s. (3) of s. 8 of the Requisitioning and Acquisition of Immovable Property Act, 1952 including the words 'whichever is less' is ultra vires Art. 31(2) of the Constitution.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether the petitioner was entitled to no relief because of the delay in presentation of the petition to the High Court.",
      "framed_by": "respondent"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The provisions of s. 8(3) of the Act were unconstitutional as infringing Arts. 31(2), 19(1)(f) and 14 of the Constitution of India. Confined challenge to cl. b of s. 8(3).",
      "supporting_facts": [
        "f9",
        "f11"
      ],
      "legal_basis": "Articles 31(2), 19(1)(f), 14 of the Constitution"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "S. 8(3) of the Act did not infringe any of the Articles of the Constitution mentioned in the petition.",
      "supporting_facts": [],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "The petitioner was entitled to no relief because of the delay in presentation of the petition to the High Court.",
      "supporting_facts": [
        "f9",
        "f14"
      ],
      "legal_basis": "Article 226 delay"
    },
    {
      "id": "ra3",
      "text": "Cl. b of s. 8(3) should be construed with reference to s. 8(1)(e); the first portion of sub-s. (1) cl. e is mandatory while the succeeding portion is merely directory; 'shall have regard to' sub-ss. (2) and (3) only indicates that the arbitrator was to keep the said provisions in mind but not bound strictly thereby.",
      "supporting_facts": [],
      "legal_basis": "S. 8(1)(e), (2), (3) of the Act"
    },
    {
      "id": "ra4",
      "text": "The impugned clause stood by itself and satisfied Art. 31(2) and the tests formulated in Bela Banerjee's case.",
      "supporting_facts": [],
      "legal_basis": "Art. 31(2); State of West Bengal v. Mrs. Bela Banerjee"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Cl. b of s. 8(3) must be held to be arbitrary. It has no relation to the value of the land at the date of the notice under s. 7 which may be many years after the date of requisition. The words of sub-s. 3 are mandatory and compel the arbitrator to accept only the smaller figure arrived at after assessment on the two modes of valuation.",
      "addresses_issue": "i1",
      "key_observation": "The measure of a just equivalent is indicated in sub-s. 3 alone. This sub-section leaves no choice to the arbitrator as to which of the two modes of assessing the compensation he is to accept."
    },
    {
      "id": "cr2",
      "text": "In the present case, the original requisition was made in 1942... The notice under s. 7 was given on April 2, 1953. No grounds were shown and no circumstances were brought to our notice which necessitated the fixing of the date of requisition as the one for ascertaining the real value of the property.",
      "addresses_issue": "i1",
      "key_observation": "The property might have continued in requisition for years and it is impossible to say that the date of requisition has or can have any connection with the date of acquisition under s. 7."
    },
    {
      "id": "cr3",
      "text": "In assessing the just equivalent of the value of the property at twice the price which the requisitioned property would have fetched... the arbitrator would be acting arbitrarily inasmuch as he would be proceeding on a formula for which there is no rational basis.",
      "addresses_issue": "i1",
      "key_observation": "It is common knowledge that all over India there has been a spiralling of land prices after the conclusion of the last world war."
    },
    {
      "id": "cr4",
      "text": "The expression 'have regard to' in sub-cl. e of sub-s. (1) of s. 8 therefore does not give the arbitrator any freedom of considering the two modes laid down in sub-s. (3) and accepting the one which he thought fair.",
      "addresses_issue": "i1",
      "key_observation": "The first point about the opening portion of cl. e being mandatory and the latter portion being directory cannot therefore be accepted."
    },
    {
      "id": "cr5",
      "text": "The High Court should have refused relief on the ground of delay... although the original acquisition was made on 4th April 1953, so far as compensation was concerned, the arbitrator was appointed on 21st June, 1961... the Collector assessed the compensation on July 2 1962 and the petitioner approached the Court on September 18, 1962.",
      "addresses_issue": "i2",
      "key_observation": "In the case of an infringement of a fundamental right under the Constitution, mere delay would hardly affect the maintainability of the petition."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Cl. b including the words 'whichever is less' of sub-s. (3) of s. 8 of the Act was ultra vires Art. 31(2) of the Constitution and as such void.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "No delay disentitling relief; High Court correctly condoned any assumed delay.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "State of West Bengal v. Mrs. Bela Banerjee",
      "citation": "1954 S.C.R. 558",
      "treatment": "followed",
      "relevance": "Compensation under Art. 31(2) means just equivalent; principles must ensure full indemnification; fixing anterior date arbitrary if no relation to acquisition value."
    },
    {
      "case_name": "State of Madras v. D. Namasivaya Mudaliar",
      "citation": "1964 6 S.C.R. 936",
      "treatment": "followed",
      "relevance": "Fixation of compensation on anterior date arbitrary and inconsistent with Art. 31(2); State must justify."
    },
    {
      "case_name": "Vajravelu Mudaliar v. Special Deputy Collector",
      "citation": "1965 1 S.C.R. 614",
      "treatment": "followed",
      "relevance": "Under Art. 31(2) before 1955 Amendment, entitled to just equivalent of land deprived."
    },
    {
      "case_name": "N. B. Jeejeebhoy v. Assistant Collector",
      "citation": "1965 1 S.C.R. 636",
      "treatment": "followed",
      "relevance": "Summarizes principles from Bela Banerjee: compensation means just equivalent; fixation of anterior date arbitrary without relevant circumstances."
    },
    {
      "case_name": "Ryots of Garabandho v. Zemindar of Parlakimedi",
      "citation": "70 I.A. 129",
      "treatment": "referred",
      "relevance": "Interpretation of 'have regard to' depends on context."
    },
    {
      "case_name": "West Ramnad Electric Distribution Co. v. State of Madras",
      "citation": "1963 2 S.C.R. 747",
      "treatment": "distinguished",
      "relevance": "Where choice of valuation methods given, may satisfy just equivalent; unlike here where no choice and arbitrary cap."
    }
  ],
  "statutes_cited": [
    {
      "name": "Requisitioning and Acquisition of Immovable Property Act, 1952 (Act 30 of 1952)",
      "sections": [
        "s. 3",
        "s. 7",
        "s. 8",
        "s. 24"
      ],
      "relevance": "Governs requisition, acquisition, and compensation determination; cl. b s.8(3) held ultra vires as not providing just equivalent."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 14",
        "Art. 19(1)(f)",
        "Art. 31(2)",
        "Art. 133(1)(c)",
        "Art. 226"
      ],
      "relevance": "Art. 31(2) requires just equivalent compensation; cl. b violates it; no delay bars under Art. 226 for fundamental rights."
    },
    {
      "name": "Defence of India Rules",
      "sections": [
        "r. 75-A"
      ],
      "relevance": "Initial requisition in 1942."
    },
    {
      "name": "Land Acquisition Act, 1894",
      "sections": [
        "s. 4(1)",
        "s. 16"
      ],
      "relevance": "Referred for comparison on market value date."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court dismissed the appeal, upholding the Bombay High Court's declaration that clause (b) of sub-section (3) of Section 8 of the Requisitioning and Acquisition of Immovable Property Act, 1952, including the words 'whichever is less', is ultra vires Article 31(2) of the Constitution and void. The assessment of compensation is to be made subject to this declaration, rejecting arguments on construction, standalone validity, and delay.",
    "relief_granted": "Direction that assessment of compensation be made without regard to invalid cl. b s.8(3); High Court discretion on delay upheld.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"While it is true that the legislature is given the discretionary power of laying down the principles which should govern the determination of the amount to be given to the owner for the property appropriated, such principles must ensure that what is determined as payable must be compensation, that is, a just equivalent of what the owner has been deprived of.\"",
      "speaker": "court",
      "significance": "Defines 'compensation' under Art. 31(2) from Bela Banerjee case."
    },
    {
      "text": "The words of sub-s. 3 are mandatory and compel the arbitrator to accept only the smaller figure arrived at after assessment on the two modes of valuation.",
      "speaker": "court",
      "significance": "Rejects directory interpretation of 'have regard to'; cl. b arbitrary."
    },
    {
      "text": "In assessing the just equivalent of the value of the property at twice the price which the requisitioned property would have fetched in the open market if it had been sold on the date of requisition, the arbitrator would be acting arbitrarily inasmuch as he would be proceeding on a formula for which there is no rational basis.",
      "speaker": "court",
      "significance": "Core holding on why cl. b violates just equivalent principle."
    }
  ],
  "_case_id": "1967_157",
  "_label": 0,
  "_text_length": 30532,
  "_extracted_at": "2026-02-10T20:22:21.672212"
}