{
  "metadata": {
    "case_name": "Ghatge Patil Transports Employees' Union v. Ghatge Patil Transports Private Ltd.",
    "case_year": 1966,
    "court": "Supreme Court of India",
    "judges": [
      "Hidayatullah, J."
    ],
    "case_number": "Civil Appeal No. 437 of 1966",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant Trade Union established on January 1, 1962 by employees of Ghatge Patil Transports Private Ltd.",
      "type": "background",
      "date": "1962-01-01",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Company engaged in transport of goods by road, owns 70 trucks operating from Kolhapur to Bombay, Poona, Bangalore, Goa, Madras.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Previously, company employed 70 drivers and 70 cleaners for truck operations.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On January 8, 1963, company advertised trucks for sale or to be given on contract system in local newspaper.",
      "type": "material",
      "date": "1963-01-08",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "54 drivers resigned service and applied for contracts between January 9 and 31, 1963.",
      "type": "material",
      "date": "1963-01-09 to 1963-01-31",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Company entered agreements with former drivers (operators): each got one truck, pay Re. 1 per mile; company supplies fuel, oil, tyres; operators canvass goods but priority to company goods; bring gross receipts, company deducts Re. 1/mile; operators liable for damage.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Motor Transport Workers Act, 1961 passed on May 20, 1961; applies to undertakings carrying goods by road for hire/reward; requires registration, welfare (canteens, rest rooms, uniforms, medical), hours of work (48/week, 8/day, rest intervals, spreadover 12 hrs, weekly rest), no child employment, wages, leave, overtime, penalties.",
      "type": "background",
      "date": "1961-05-20",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Company admitted inability to implement MTW Act due to long journeys making hours/rest enforcement impossible; adopted contract system to avoid Act's application as operators independent contractors.",
      "type": "admitted",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f9",
      "text": "On January 14, 1963, Union served notice demanding abolition of contract system.",
      "type": "material",
      "date": "1963-01-14",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Dispute referred to Industrial Tribunal Maharashtra under s.10(1)(d) Industrial Disputes Act: 'The contract system for the running of vehicles which has been newly introduced, must be abolished immediately. Such ex-employees of the Company who have been given this work on contract basis should be reinstated with back wages.' Reference IT No. 40 of 1963.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Tribunal award dated March 31, 1964: Drivers voluntarily resigned, no coercion; agreements fair; operators free agents; no unfair labour practice; rejected demand.",
      "type": "procedural",
      "date": "1964-03-31",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Even union office-bearers resigned to become operators; many contracts after reference.",
      "type": "material",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f13",
      "text": "No drivers appeared to complain; no objection from Motor Vehicles Act authorities.",
      "type": "material",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the newly introduced contract system for running vehicles amounts to unfair labour practice and exploitation, requiring its abolition and reinstatement of ex-employees with back wages.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether operators under the contract system are 'Motor Transport workers' employed in the undertaking within the Motor Transport Workers Act, 1961.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Resignation of drivers and contract system amounts to unfair labour practice and exploitation; nullifies benefits of Motor Transport Workers Act; operators continue to be workmen notwithstanding pose as independent contractors.",
      "supporting_facts": [
        "f5",
        "f6",
        "f8"
      ],
      "legal_basis": "Motor Transport Workers Act, 1961"
    },
    {
      "id": "pa2",
      "text": "Analogy to contract labour cases where declared unfair labour practice.",
      "supporting_facts": [],
      "legal_basis": "Precedents of this Court on contract labour"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Operators are independent contractors, not employed in Motor Transport Undertaking; voluntarily resigned, even union office-bearers; free agents; no illegality or exploitation.",
      "supporting_facts": [
        "f5",
        "f11",
        "f12"
      ],
      "legal_basis": "Motor Transport Workers Act, 1961 (definition of 'employed'); Motor Vehicles Act s.59"
    },
    {
      "id": "ra2",
      "text": "Hiring trucks not prohibited; regulatory provisions hard to enforce on long journeys; no bar in law.",
      "supporting_facts": [
        "f8",
        "f13"
      ],
      "legal_basis": "Motor Transport Workers Act, 1961"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Drivers voluntarily resigned and entered agreements, considering them more favourable; no coercion or exploitation; Tribunal findings approved.",
      "addresses_issue": "i1",
      "key_observation": "Operators not 'employed' in sense of kept in service; independent hirers paying fixed hire, not Motor Transport workers."
    },
    {
      "id": "cr2",
      "text": "No legal bar to contract system; company can arrange business to avoid regulatory law/penalties if not breaking law; no offence to Motor Vehicles Act.",
      "addresses_issue": "i1",
      "key_observation": "Not analogous to contract labour cases where middleman exploits; drivers chose freely."
    },
    {
      "id": "cr3",
      "text": "Company prepared to apply MTW Act to its proper employees.",
      "addresses_issue": "i2",
      "key_observation": "Parliament not mandated trucks run only by paid employees."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Contract system not unfair labour practice; operators not Motor Transport workers under the Act.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Company entitled to let trucks to independent operators without violating law.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Cases of this Court on contract labour",
      "citation": null,
      "treatment": "distinguished",
      "relevance": "Distinguished as not involving middleman exploitation or denial of bargaining advantages."
    }
  ],
  "statutes_cited": [
    {
      "name": "Industrial Disputes Act, 1947",
      "sections": [
        "s. 10(1)(d)"
      ],
      "relevance": "Basis for government reference to Tribunal."
    },
    {
      "name": "Motor Transport Workers Act, 1961",
      "sections": [
        "s. 37",
        "Ch. IV (Welfare and Health)",
        "Ch. V (Hours of work)",
        "Ch. VI",
        "Ch. VII",
        "Ch. VIII",
        "Ch. IX"
      ],
      "relevance": "Regulatory and beneficial provisions for workers; company avoided application by making operators independent; s.37 overrides inconsistent contracts but not to take away better benefits."
    },
    {
      "name": "Motor Vehicles Act",
      "sections": [
        "s. 59"
      ],
      "relevance": "Contemplates transfer of permits; no need for permission for hire-out."
    },
    {
      "name": "Payment of Wages Act",
      "sections": [],
      "relevance": "Definition of 'wages' applied in MTW Act."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal by special leave dismissed; no interference with Tribunal award; contract system lawful, no unfair labour practice or exploitation found.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"A person must be considered free to so arrange his business that he avoids a regulatory law and its penal consequences which he has, without the arrangement, no proper means of obeying.\"",
      "speaker": "court",
      "significance": "Core holding on right to restructure business to comply with law."
    },
    {
      "text": "\"The operators, therefore, are not Motor Transport workers within the definition.\"",
      "speaker": "court",
      "significance": "Key interpretation excluding independent contractors from Act."
    }
  ],
  "_case_id": "1967_60",
  "_label": 0,
  "_text_length": 16417,
  "_extracted_at": "2026-02-10T20:20:37.219106"
}