{
  "metadata": {
    "case_name": "Appellant v. Respondent No. 1",
    "case_year": 1966,
    "court": "Supreme Court of India",
    "judges": [
      "Vaidialingam, J."
    ],
    "case_number": "Civil Appeal No. 691 of 1966 / Civil Miscellaneous Petition No. 2631 of 1967",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Plaintiff (respondent) instituted suit under s. 209 of U.P. Zamindari Abolition and Land Reforms Act, 1950 against appellant (defendant) for recovery of possession of land in village Pureon, Pargana Bayalsi, District Jaunpur, claiming to be bhumidar and appellant as trespasser without tenancy rights.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Trial Court and Appellate Court held plaintiff as bhumidar, appellant as trespasser without tenancy rights (neither sirdar nor asami), decreed suit for plaintiff.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f3",
      "text": "Allahabad High Court in Second Appeal No. 1602 of 1963 agreed with lower courts and dismissed second appeal on April 20, 1965.",
      "type": "procedural",
      "date": "1965-04-20",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Supreme Court granted special leave to appeal on June 15, 1965.",
      "type": "procedural",
      "date": "1965-06-15",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "State of Uttar Pradesh published notification dated October 22, 1965 under s. 4 of U.P. Consolidation of Holdings Act, 1953 bringing disputed plots in village Pureon under consolidation operations.",
      "type": "procedural",
      "date": "1965-10-22",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Section 5 of U.P. Consolidation of Holdings Act, 1953 amended by U.P. Act XXI of 1966, introducing abatement of suits/proceedings on order after notice and hearing.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Appellant filed Civil Miscellaneous Petition No. 2631 of 1967 praying for order that Civil Appeal No. 691 of 1966 has abated under amended s. 5.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether Civil Appeal No. 691 of 1966 abates under amended s. 5(2) of U.P. Consolidation of Holdings Act, 1953, particularly whether suit for possession from trespasser is covered by 'every suit and proceeding in respect of declaration of rights or interest in any land'.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether amended s. 5 of U.P. Consolidation of Holdings Act, 1953 is ultra vires as it affects jurisdiction of Supreme Court.",
      "framed_by": "respondent"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Scheme of U.P. Consolidation of Holdings Act shows questions of bhumidari and tenancy rights fall under exclusive jurisdiction of consolidation authorities; amended s. 5 declares pending proceedings abated, unlike original s. 5 which stayed them.",
      "supporting_facts": [
        "f1",
        "f5",
        "f6"
      ],
      "legal_basis": "U.P. Consolidation of Holdings Act, 1953 (ss. 3, 4, 5, 8, 9, 11, 48, 49)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Suits for recovery of possession from trespassers do not come within purview of amended s. 5 as it omits specific reference to 'suits for possession of land' present in original s. 5.",
      "supporting_facts": [
        "f1",
        "f6"
      ],
      "legal_basis": "U.P. Consolidation of Holdings Act, 1953 (s. 5 as amended)"
    },
    {
      "id": "ra2",
      "text": "Amended s. 5 ultra vires as State legislation takes away jurisdiction of Supreme Court to deal with appeal.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": "Constitution of India, Seventh Schedule"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Expression 'every suit and proceeding in respect of declaration of rights or interest in any land' in amended s. 5(2)(a) comprehensive enough to cover suits for possession, as court must adjudicate rights/interests before granting possession.",
      "addresses_issue": "i1",
      "key_observation": "Suit covered by amended s. 5; disputes of this nature within jurisdiction of consolidation authorities under Act."
    },
    {
      "id": "cr2",
      "text": "State Legislature made provision within its jurisdiction declaring suit abated; Supreme Court takes notice of subsequent event (amendment) and holds proceedings abated; no impingement on Supreme Court jurisdiction.",
      "addresses_issue": "i2",
      "key_observation": "No legislation affecting Supreme Court jurisdiction."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Suit and proceedings including Civil Appeal No. 691 of 1966 stand abated under amended s. 5 of U.P. Consolidation of Holdings Act, 1953 without prejudice to rights to agitate before consolidation authorities.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Amended s. 5 not ultra vires.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "U.P. Consolidation of Holdings Act, 1953 (U.P. Act 5 of 1954)",
      "sections": [
        "Section 3",
        "Section 4",
        "Section 5",
        "Section 8",
        "Section 8A",
        "Section 9",
        "Section 11",
        "Section 11A",
        "Section 24",
        "Section 28",
        "Section 40",
        "Section 48",
        "Section 49",
        "Section 52"
      ],
      "relevance": "Brings area under consolidation operations; stays/abates suits/proceedings re rights/interests in land; exclusive jurisdiction of consolidation authorities; abatement without prejudice to rights before such authorities."
    },
    {
      "name": "U.P. Zamindari Abolition and Land Reforms Act, 1950 (U.P. Act 1 of 1950)",
      "sections": [
        "Section 209"
      ],
      "relevance": "Basis for suit for possession by bhumidar against trespasser."
    },
    {
      "name": "U.P. Act XXI of 1966",
      "sections": [],
      "relevance": "Amends s. 5 of U.P. Consolidation of Holdings Act, 1953 to provide for abatement of proceedings."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Civil Miscellaneous Petition No. 2631 of 1967 allowed; Civil Appeal No. 691 of 1966 declared abated under amended s. 5 of U.P. Consolidation of Holdings Act, 1953; parties to agitate rights before consolidation authorities.",
    "relief_granted": "Declaration of abatement of appeal",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"the expression every suit and proceeding in respect of declaration of rights or interest in any land are comprehensive enough to take in suits for possession of land\"",
      "speaker": "court",
      "significance": "Holds suits for possession covered by amended s. 5 despite change in phraseology."
    },
    {
      "text": "\"the abatement of the proceedings... shall be without prejudice to the rights of persons affected, to agitate the right or interest in dispute... before the appropriate consolidation authorities\"",
      "speaker": "court",
      "significance": "Clarifies effect of abatement under Act."
    }
  ],
  "_case_id": "1967_163",
  "_label": 1,
  "_text_length": 17397,
  "_extracted_at": "2026-02-10T20:22:00.909117"
}