{
  "metadata": {
    "case_name": "Collector of Customs, Central Excise, Cochin v. Ms. A. S. Bava",
    "case_year": 1966,
    "court": "Supreme Court of India",
    "judges": [
      "Sikri, J."
    ],
    "case_number": "Civil Appeals Nos. 2007 and 2008 of 1966",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Ms. A. S. Bava is a firm of dealers in Tobacco.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "By two orders of adjudication dated March 31, 1963, the Assistant Collector of Customs demanded the payment of duty under Rule 40 of the Central Excise and Salt Rules, 1944.",
      "type": "material",
      "date": "1963-03-31",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The petitioner filed appeals against these orders on or about July 4, 1963, to the Collector of Customs Central Excise.",
      "type": "procedural",
      "date": "1963-07-04",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The petitioner made a representation on October 3, 1963, requesting that it may not be required to deposit the duty demanded pending appeal.",
      "type": "procedural",
      "date": "1963-10-03",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The Collector, by letter dated January 9, 1964, rejected the representation and requested the petitioner to deposit the duty within 15 days of the receipt of the letter.",
      "type": "procedural",
      "date": "1964-01-09",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "On the petitioner failing to deposit the amount, the appeals were dismissed on February 4, 1964.",
      "type": "procedural",
      "date": "1964-02-04",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Notification No. 68/63 dated May 4, 1963, issued under s. 12 of the Excise and Salt Act, 1944, declaring that s. 129 of the Customs Act, 1962, shall be applicable in regard to like matters in respect of the duties imposed by s. 3 of the Excise Act.",
      "type": "material",
      "date": "1963-05-04",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "The petitioner filed two petitions under art. 226 of the Constitution in the Kerala High Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "The High Court of Kerala by judgment dated September 28, 1965 allowed the petitions, quashed the two orders dated February 4, 1964, and directed the Collector to hear the appeals.",
      "type": "procedural",
      "date": "1965-09-28",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Appellants obtained special leave to appeal to the Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the petitions under art. 226 were not maintainable as the petitioner did not avail of the remedy of revision provided by s. 36 of the Excise Act.",
      "framed_by": "appellants"
    },
    {
      "id": "i2",
      "text": "Whether the petitioner having availed of the remedy under s. 129 of the Customs Act was debarred from challenging the impugned notification dated May 4, 1963.",
      "framed_by": "appellants"
    },
    {
      "id": "i3",
      "text": "Whether the impugned notification applying s. 129 of the Customs Act was valid under s. 12 of the Excise Act.",
      "framed_by": "appellants"
    },
    {
      "id": "i4",
      "text": "Whether s. 129 of the Customs Act relates to procedure relating to appeals within s. 12 of the Excise Act, given that appeals are under s. 35 of the Excise Act which provides an unfettered right to appeal.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The notification dated May 4, 1963 was in excess of the powers conferred under s. 12 of the Excise Act.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "Section 12 of the Central Excise and Salt Act, 1944"
    },
    {
      "id": "ra2",
      "text": "The Collector had no jurisdiction to demand deposit of duty pending appeals.",
      "supporting_facts": [
        "f5",
        "f6"
      ],
      "legal_basis": "Article 226 of the Constitution"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The point that petitions under art. 226 were not maintainable due to availability of revision under s. 36 Excise Act has no force: not raised in High Court, existence of revision does not bar art. 226 jurisdiction, and issue involved lack of jurisdiction due to invalid notification.",
      "addresses_issue": "i1",
      "key_observation": "Petitions raised a question of jurisdiction."
    },
    {
      "id": "cr2",
      "text": "The point that petitioner was debarred from challenging notification after availing s. 129 has no force: if not applied for dispensation, maintainability would be questioned; petitions raised question of jurisdiction.",
      "addresses_issue": "i2",
      "key_observation": "Petitions raised a question of jurisdiction."
    },
    {
      "id": "cr3",
      "text": "S. 12 Excise Act allows Central Government to apply provisions of Sea Customs Act (replaced by Customs Act 1962) relating to levy, exemption, drawback with modifications to like matters under s. 3 Excise Act.",
      "addresses_issue": "i3",
      "key_observation": "Notification applies s. 129 Customs Act."
    },
    {
      "id": "cr4",
      "text": "S. 129 Customs Act requires deposit of duty/penalty pending appeal, dispensing only if hardship; this debars hearing unless deposited, unlike unfettered appeal right under s. 35 Excise Act.",
      "addresses_issue": "i4",
      "key_observation": "S. 129 is not procedure relating to appeals."
    },
    {
      "id": "cr5",
      "text": "Following Hoosein Kasam Dada case, requirement to deposit affects substantive right of appeal, whittles down the unfettered right under s. 35 Excise Act, cannot be regarded as mere procedure under s. 12 Excise Act.",
      "addresses_issue": "i4",
      "key_observation": "Provision impairs substantive right of appeal."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Provisions of s. 129 Customs Act cannot be applied to Excise appeals under s. 12 Excise Act as they do not relate to procedure but whittle down substantive right of appeal under s. 35 Excise Act.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Art. 226 petitions maintainable despite revision remedy under s. 36 Excise Act, especially on jurisdictional grounds.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "No estoppel or debarment from challenging notification after seeking dispensation under s. 129.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Hoosein Kasam Dada (India) Ltd. v. The State of Madhya Pradesh",
      "citation": "1953 9874 S.T.C 114",
      "treatment": "followed",
      "relevance": "Similar provision requiring deposit for appeal held to affect substantive right of appeal, not mere procedure."
    }
  ],
  "statutes_cited": [
    {
      "name": "Central Excise and Salt Act, 1944",
      "sections": [
        "Section 3",
        "Section 12",
        "Section 35",
        "Section 36",
        "Rule 40"
      ],
      "relevance": "Governs duties, application of Customs provisions, unfettered appeal right, revision; notification under s.12 held invalid for applying s.129 Customs."
    },
    {
      "name": "Customs Act, 1962",
      "sections": [
        "Section 129"
      ],
      "relevance": "Requires deposit pending appeal; held not applicable to Excise via s.12 Excise Act as affects substantive right."
    },
    {
      "name": "Sea Customs Act, 1878",
      "sections": [],
      "relevance": "Provisions applicable under s.12 Excise Act with modifications; replaced by Customs Act 1962."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 226"
      ],
      "relevance": "High Court jurisdiction to entertain petitions; not barred by alternative remedies."
    },
    {
      "name": "Central Provinces and Berar Sales Tax Act, 1947",
      "sections": [
        "Section 22"
      ],
      "relevance": "Cited in precedent; similar deposit requirement held substantive."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeals by special leave against the Kerala High Court judgment are dismissed. The High Court order quashing the dismissal of appeals for non-deposit and directing the Collector to hear the appeals is upheld.",
    "relief_granted": "High Court direction to hear appeals upheld",
    "costs": "Dismissed with costs"
  },
  "key_quotes": [
    {
      "text": "There can be no doubt that the new requirement touches the substantive right of appeal vested in the appellant. Nor can it be overlooked that such a requirement is calculated to interfere with or fetter, if not to impair or imperil, the substantive right.",
      "speaker": "court",
      "significance": "Quoting R. Das J. from Hoosein Kasam to hold s.129 affects substantive appeal right."
    },
    {
      "text": "A provision which is calculated to deprive the appellant of the unfettered right of appeal cannot be regarded as a mere alteration in procedure.",
      "speaker": "court",
      "significance": "Explains why s.129 not mere procedure under s.12 Excise Act."
    },
    {
      "text": "Section 35 of the Excise Act gave a right of appeal, but S. 129 of the Customs Act whittles down the substantive right of appeal and accordingly it cannot be regarded as procedure relating to appeals within s. 12 of the Excise Act.",
      "speaker": "court",
      "significance": "Core holding invalidating the notification."
    }
  ],
  "_case_id": "1967_284",
  "_label": 0,
  "_text_length": 9236,
  "_extracted_at": "2026-02-10T20:23:55.919051"
}