{
  "metadata": {
    "case_name": "National Iron & Steel Co. Ltd. & Ors. v. NISCO Karmachari Sangha, Belur & Anr.",
    "case_year": 1965,
    "court": "Supreme Court of India",
    "judges": [
      "Mitter, J."
    ],
    "case_number": "Civil Appeal No. 497 of 1965",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellants are four public limited companies: National Iron and Steel Co. Ltd. (steel rolling and casting), Britannia Building Iron Co. Ltd. (steel fabrication), National Screw and Wire Products Ltd. (manufacture of wires and nails), Tatanagar Foundry Co. Ltd. (manufacturing cast-iron sleepers for railways), all carrying on business in same premises at Belur, Howrah.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Respondents are two unions: NISCO Karmachari Sangha, Belur and Howrah and Belur Iron and Steel Workers Union, Howrah.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Government of West Bengal made reference under s. 10 of Industrial Disputes Act, 1947 dated August 25, 1959, of industrial dispute between the four companies and their workmen represented by the two unions regarding nine issues in schedule (Issue No. 9 abandoned).",
      "type": "procedural",
      "date": "1959-08-25",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Issues referred: 1. Gratuity; 2. Sickness benefit; 3. Leave Rules; 4. Abolition of contract labour; 5. Whether termination of service of Shri Bhadreswar Ghose justified; 6. Whether durwans and Watch Ward staff entitled to weekly rest; 7. Whether retirement of Shri Gopal Das and Shri Ramjatin Pandit at age 55 justified; 8. Whether retrenchment of masons Shri Sushil, Shri Sarojit, Shri Sukdeo, Shri Khalil justified (only Sushil pressed).",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "All four companies concerned with all issues; National Iron and Steel primarily with most; Britannia with 7 and 8; National Screw with 4,5,7,8; Tatanagar with 5,7,8; all interested in first three.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Third Industrial Tribunal, West Bengal awarded on September 14, 1963 in Case No. VIII-151 of 1959 against the companies.",
      "type": "procedural",
      "date": "1963-09-14",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Functional integrality: common General Manager (E.C. Watson), common Labour Officer (Tarini Prosad Jha), common Time Office (Bireshwar Banerjee), common cash office, shipping department, canteen; common Standing Orders; consecutive check numbers (Ex.14, March 19,1957); list of masons (Ex.F, Nov 16,1958).",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Retrenchment of Sushil: notice dated November 15, 1958 terminating service from November 17, 1958 with one month's wages in lieu, to collect dues from November 20, 1958.",
      "type": "disputed",
      "date": "1958-11-15",
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "National Iron and Steel Co. Ltd. balance sheets 1953-1960 showed profits except 1960, substantial reserves; 77 retirements in 11 years (7 per year); gratuity liability Rs.7,500 per year.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Tatanagar Foundry Co. Ltd. employed contract labour for producing sleepers; others did not; railways give contracts to multiple concerns.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Validity of single order of reference under s.10 Industrial Disputes Act for disputes involving four separate companies with varying interests.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether Tribunal could frame gratuity scheme binding all four companies based only on National Iron and Steel Co. Ltd.'s financials.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Justification of Tribunal holding retrenchment of Sushil illegal for non-compliance with s.25F Industrial Disputes Act.",
      "framed_by": "petitioner"
    },
    {
      "id": "i4",
      "text": "Whether Tribunal erred in directing abolition of contract labour by Tatanagar Foundry Co. Ltd., placing it at disadvantage vis-a-vis competitors.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Single reference invalid as companies separate entities, not all concerned in all issues; should have been four separate references; cites ss.18(1),18(3),33 Industrial Disputes Act; Workmen of Dimakuchi Tea Estate.",
      "supporting_facts": [
        "f1",
        "f5"
      ],
      "legal_basis": "Industrial Disputes Act ss.10,18(1),18(3),33; Workmen of Dimakuchi Tea Estate v. Management (1958 SCR 1156)"
    },
    {
      "id": "pa2",
      "text": "Gratuity award bad as Tribunal considered only National Iron and Steel's accounts, not others'; should have compelled production; cites principles from Burhanpur Tapti Mills on financial capacity.",
      "supporting_facts": [
        "f1",
        "f9"
      ],
      "legal_basis": "Burhanpur Tapti Mills Ltd. v. B.T. Mills Mazdoor Sangh (1965 I LLJ 453)"
    },
    {
      "id": "pa3",
      "text": "Retrenchment of Sushil justified unless mala fide; s.25F complied as wages in lieu paid, collectible later; last come first go not violated as Joy Kishen retained for special job.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": "Industrial Disputes Act s.25F"
    },
    {
      "id": "pa4",
      "text": "Abolition of contract labour discriminatory; increases costs for Tatanagar vs competitors; should implead other concerns.",
      "supporting_facts": [
        "f1",
        "f10"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Sufficient functional integrality (common management, facilities, interests in uniform conditions to avoid unrest); single reference proper; no prejudice; cites Wenger and Co. v. Workmen.",
      "addresses_issue": "i1",
      "key_observation": "Community of interest in industrial disputes justifies one reference."
    },
    {
      "id": "cr2",
      "text": "Gratuity scheme reasonable based on National Iron and Steel's finances (profits, reserves, low annual liability); others content to follow, failed to produce documents; no hardship shown.",
      "addresses_issue": "i2",
      "key_observation": "Tribunal's appraisal of capacity correct per Burhanpur principles."
    },
    {
      "id": "cr3",
      "text": "s.25F not complied: wages in lieu must be paid at termination time, not later; last come first go violated (junior Joy Kishen retained, plea not in written statement); cites Bombay Union of Journalists.",
      "addresses_issue": "i3",
      "key_observation": "Non-compliance with s.25F renders retrenchment illegal."
    },
    {
      "id": "cr4",
      "text": "Tribunal's direction to abolish contract labour (except loading/unloading) after appraisal upheld; no argument on fundamental error.",
      "addresses_issue": "i4",
      "key_observation": "Direction not shown wrong."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Single reference valid due to functional integrality and community of interest.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Gratuity scheme binding on all companies reasonable on materials.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Retrenchment of Sushil illegal for s.25F non-compliance and violation of last come first go.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    },
    {
      "id": "h4",
      "text": "Abolition of contract labour direction upheld.",
      "resolves_issue": "i4",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Workmen of Dimakuchi Tea Estate v. Management of Dimakuchi Tea Estate",
      "citation": "1958 S.C.R. 1156",
      "treatment": "referred",
      "relevance": "Dispute must allow employer to give relief; distinguished as functional integrality present."
    },
    {
      "case_name": "Wenger and Co. v. Their Workmen",
      "citation": "1963 II L.L.J. 403",
      "treatment": "followed",
      "relevance": "Uniform conditions desirable for peace in allied establishments in same locality."
    },
    {
      "case_name": "Burhanpur Tapti Mills Ltd. v. B.T. Mills Mazdoor Sangh",
      "citation": "1965 I L.L.J. 453",
      "treatment": "followed",
      "relevance": "Principles for gratuity scheme: financial position, profit capacity; Tribunal applied correctly."
    },
    {
      "case_name": "Bombay Union of Journalists v. State of Bombay",
      "citation": "1964 6 S.C.R. 22",
      "treatment": "followed",
      "relevance": "s.25F requires payment of wages in lieu at time of termination."
    }
  ],
  "statutes_cited": [
    {
      "name": "Industrial Disputes Act, 1947",
      "sections": [
        "s.10",
        "s.18(1)",
        "s.18(3)",
        "s.33",
        "s.25F"
      ],
      "relevance": "Reference power (s.10); settlements binding (s.18); pending disputes (s.33); retrenchment procedure (s.25F)"
    },
    {
      "name": "Indian Companies Act",
      "sections": [],
      "relevance": "Companies separately registered"
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court found no substance in any of the four points raised by appellants and upheld the Tribunal's award in toto on validity of reference, gratuity scheme, retrenchment of Sushil, and abolition of contract labour.",
    "relief_granted": "Tribunal award upheld granting gratuity, other benefits, reinstatement etc. as per issues.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"there was sufficient functional integrality between the four concerns which would justify one order of reference.\"",
      "speaker": "court",
      "significance": "Basis for upholding single reference."
    },
    {
      "text": "\"s.25F had not been complied with under which it was incumbent on the employer to pay the workman, the wages for the period of the notice in lieu of the notice.\"",
      "speaker": "court",
      "significance": "Reason for invalidating retrenchment."
    },
    {
      "text": "\"the scheme of gratuity as framed is quite a reasonable one on the facts and figures presented.\"",
      "speaker": "court",
      "significance": "Upholding gratuity for all companies."
    }
  ],
  "_case_id": "1967_177",
  "_label": 0,
  "_text_length": 22371,
  "_extracted_at": "2026-02-10T20:22:08.079334"
}