{
  "metadata": {
    "case_name": "Criminal Appeal No. 23 of 1965",
    "case_year": 1965,
    "court": "Supreme Court of India",
    "judges": [
      "Hidayatullah, J."
    ],
    "case_number": "Criminal Appeal No. 23 of 1965",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant tried on three charges: under s. 302 IPC for intentionally causing death of Kuldip Singh with firearm on December 18, 1961 in village Gajra Chatar; attempt to murder Sarju Singh by shooting; unlawful possession of revolver under Arms Act.",
      "type": "material",
      "date": "1961-12-18",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Ill-feeling between appellant (a lawyer) and Kuldip Singh due to appellant conducting cases for his sister in prolonged litigation over land possession started by Kuldip Singh's party; all cases ended in favour of appellant's sister.",
      "type": "background",
      "date": null,
      "source": "admitted"
    },
    {
      "id": "f3",
      "text": "Occurrence took place during inquiry under s. 107 CrPC; notice issued to Kuldip Singh's party to show cause and furnish interim bail.",
      "type": "background",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f4",
      "text": "Prosecution story: Kuldip Singh, Sarju Singh (injured), and Musafir Singh (PW 12) proceeding towards village Nawadah via Tilaiya Railway Station; started early morning, took 1.5 hours to reach Gajra Chatar; near garden, saw two persons under tree, recognised appellant and unknown other; persons shadowed them; one fired at Kuldip's back; Sarju turned to catch appellant who fired at Sarju's leg behind knee; assailants ran away.",
      "type": "disputed",
      "date": "1961-12-18",
      "source": "prosecution"
    },
    {
      "id": "f5",
      "text": "FIR made by Kuldip Singh naming appellant; Kuldip lost consciousness; two dying declarations by Kuldip naming appellant as assailant with revolver.",
      "type": "material",
      "date": "1961-12-18",
      "source": "prosecution"
    },
    {
      "id": "f6",
      "text": "Sessions Judge (1st Additional Sessions Judge, Gaya) acquitted appellant: medical evidence and ballistic expert (PW 17) showed assault with shotgun, not revolver; doubted Sarju shot from behind while grappling; doubted identification and weapon sighting due to enmity; other circumstances showed concoction; attack from ambush, named appellant due to enmity.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Patna High Court in Criminal Revision No. 597 of 1963 (private party) by single Judge on July 17, 1964 set aside acquittal, directed retrial: reappraised evidence minutely, questioned Sessions Judge findings, interpreted evidence differently, discounted revolver vs shotgun distinction, found circumstances acceptable, gave benefit of doubt to prosecution; noted Sessions Judge error on defence witnesses but no other legal/procedural defect.",
      "type": "procedural",
      "date": "1964-07-17",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Supreme Court appeal by special leave against High Court order.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the High Court in exercising its revisional powers under s. 439 CrPC acted in accordance with principles settled by Supreme Court for interference with acquittal by way of revision filed by a private party.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Sessions Judge found prosecution evidence unsatisfactory: weapon shotgun not revolver per medical/ballistic; doubt on shooting Sarju from behind while grappling; doubted identification due to enmity; circumstances showed concoction and ambush.",
      "addresses_issue": "i1",
      "key_observation": "Sessions Judge acted within rights in acquitting on proper appraisal."
    },
    {
      "id": "cr2",
      "text": "High Court reweighed evidence as in appeal, questioned every Sessions finding, gave own interpretations, discounted weapon distinction, accepted prosecution circumstances, gave benefit of doubt to prosecution; only noted Sessions error on defence witnesses (not cross-examining police statements).",
      "addresses_issue": "i1",
      "key_observation": "High Court treated revision as appeal against acquittal, no distinction between appellate/revisional powers."
    },
    {
      "id": "cr3",
      "text": "Principles for High Court revision against acquittal (private party): only if manifest illegality or gross miscarriage of justice (D. Stephens); not for wrong view of law or misapprehension of evidence; not if perverse or lacking perspective (Logendranath Jha); only glaring procedural defects like no jurisdiction, shutting out evidence, etc. (K. Chinnaswamy Reddy); no exhaustive list but analogous defects.",
      "addresses_issue": "i1",
      "key_observation": "No such defect here; High Court breached rules by reweighing evidence when Government did not appeal."
    },
    {
      "id": "cr4",
      "text": "Case doubtful; Sessions judgment preferable given enmity and litigation; possible appellant hired assassins but Sessions rightly rejected prosecution on evidence.",
      "addresses_issue": "i1",
      "key_observation": "High Court erred in setting aside acquittal indirectly via retrial."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "High Court cannot interfere with acquittal in private revision unless manifest illegality or gross miscarriage of justice; limited to glaring procedural defects; cannot reweigh evidence as in appeal.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "D. Stephens v. Nosibolla",
      "citation": "1951 S.C.R. 284",
      "treatment": "followed",
      "relevance": "High Court can set aside acquittal in revision only for manifest illegality or gross miscarriage of justice; not for wrong view of law or misapprehension of evidence."
    },
    {
      "case_name": "Logendranath Jha and others v. Shri Polailal Biswas",
      "citation": "1951 S.C.R. 676",
      "treatment": "followed",
      "relevance": "High Court in revision can set aside acquittal for error on point of law; not for no/misappraisal of evidence, perversity, or lack of perspective; retrial loads dice against accused."
    },
    {
      "case_name": "K. Chinnaswamy Reddy v. State of Andhra Pradesh",
      "citation": "1963 3 S.C.R. 412",
      "treatment": "followed",
      "relevance": "Interference in revision with acquittal only for glaring procedural defects e.g. no jurisdiction, shutting out admissible evidence, considering inadmissible, overlooking evidence."
    }
  ],
  "statutes_cited": [
    {
      "name": "Code of Criminal Procedure",
      "sections": [
        "s. 439",
        "s. 107"
      ],
      "relevance": "Revisional powers under s.439 limited for acquittals; s.107 inquiry context."
    },
    {
      "name": "Indian Penal Code",
      "sections": [
        "s. 302"
      ],
      "relevance": "Charge of murder."
    },
    {
      "name": "Arms Act",
      "sections": [],
      "relevance": "Unlawful possession of revolver."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Supreme Court allowed the appeal, set aside the Patna High Court judgment and order dated July 17, 1964, restored the acquittal ordered by the 1st Additional Sessions Judge, Gaya.",
    "relief_granted": "Acquittal restored",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The only question in this appeal is whether the High Court in exercising its revisional powers under s. 439 of the Code of Criminal Procedure acted in accordance with the principles settled by this Court for interference with acquittal by way of revision filed by a private party.",
      "speaker": "court",
      "significance": "Frames the core legal issue."
    },
    {
      "text": "In our opinion the learned Judge was clearly in error in proceeding as he did in a revision filed by a private party, against the acquittal reached in the Court of Session.",
      "speaker": "court",
      "significance": "Key holding on High Court's error."
    },
    {
      "text": "This we do not conceive to be his duty in dealing in revision with an acquittal when Government has not chosen to file an appeal against it.",
      "speaker": "court",
      "significance": "Distinguishes revision limits when no state appeal."
    }
  ],
  "_case_id": "1967_89",
  "_label": 1,
  "_text_length": 10283,
  "_extracted_at": "2026-02-10T20:20:44.196569"
}