{
  "metadata": {
    "case_name": "Konchada Ramamurti Subudhi (deceased) through LRs v. Gopinath Naik",
    "case_year": 1965,
    "court": "Supreme Court of India",
    "judges": [
      "Sikri, J."
    ],
    "case_number": "Civil Appeal No. 372 of 1965",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "One Konchada Ramamurti Subudhi, deceased, represented by his legal representatives and appellants (Decree Holder), and Bhagirathi Naiko, represented by Gopinath Naik, Judgment Debtor, filed a compromise petition under O. XXIII, r. 3 of the Code of Civil Procedure in the Court of Subordinate Judge, Berhampur, in T.A. No. 13 of 1955.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "In terms of the compromise petition, a decree was passed.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The Decree Holder filed an application for execution of the decree.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The Judgment Debtor filed M.J.C. No. 220/60 under s. 47, C.P.C., in the Court of Munsif, Berhampur, objecting to the execution of the decree.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The Munsif, Berhampur, dismissed the Judgment Debtor's application.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "The District Judge, Ganjam-Boudh, Berhampur, affirmed the Munsif's order.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "The Orissa High Court in Miscellaneous Appeal No. 59 of 1961 allowed the appeal, set aside the District Judge's judgment dated September 23, 1963.",
      "type": "procedural",
      "date": "1963-09-23",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Terms of compromise: Defendant-respondent to vacate suit house on or before 1-7-1960 (five years); failing which plaintiff entitled to execute decree and recover possession.",
      "type": "material",
      "date": "1960-07-01",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Arrears of rent up to 30-6-55 paid Rs. 1,125.",
      "type": "admitted",
      "date": "1955-06-30",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Future rent from 1-7-55 at Rs. 50 per month by end of each month until delivery; Rs. 300 paid as deposit for six months rent adjusted towards last six months ending 1-7-1960.",
      "type": "material",
      "date": "1955-07-01",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "If defendant fails to pay rent for any three consecutive months, plaintiff at liberty to adjust advance, evict without waiting till 1-7-1960 by executing decree, and realise accrued amount.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "House fell to share of minor son Konchada Koteswarrao, for whom plaintiff is guardian.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Each party to bear own costs in both courts.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Facts in this case are not in dispute.",
      "type": "admitted",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the compromise decree created a lease or a licence. If a lease, the Judgment Debtor entitled to protection under Orissa House-Rent Control Act (Orissa Act XXXI of 1958).",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Intention of decree holder was only to give accommodation to judgment debtor, not to create a fresh tenancy, as he had filed suit to eject the judgment debtor.",
      "supporting_facts": [
        "f1",
        "f8"
      ],
      "legal_basis": "Ramjibhai Virpal Shah v. G. M. Bhagat (AIR 1954 Bom. 370)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Compromise decree created a lease, not a licence.",
      "supporting_facts": [
        "f8",
        "f9",
        "f10"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Word 'rent' used; Rs. 300 paid as deposit for six months rent; long period of five years granted.",
      "supporting_facts": [
        "f10"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Decisive consideration is intention of parties, ascertained from all relevant provisions. Exclusive possession not conclusive evidence of lease; if coupled with interest in property, it is lease.",
      "addresses_issue": "i1",
      "key_observation": "Cited M. N. Clubwala v. Fida Hussain Saheb and Associated Hotels of India Ltd. v. R. N. Kapur."
    },
    {
      "id": "cr2",
      "text": "Substance preferred to form; real test intention; if creates interest in property, lease; if permits use while possession with owner, licence; exclusive possession prima facie tenancy but can be negatived.",
      "addresses_issue": "i1",
      "key_observation": "Summarised propositions from Associated Hotels."
    },
    {
      "id": "cr3",
      "text": "Decree holder brought suit for ejectment; difficult to impute intention to create fresh tenancy.",
      "addresses_issue": "i1",
      "key_observation": "Suit shows intention to eject."
    },
    {
      "id": "cr4",
      "text": "Word 'rent' not conclusive; in wider sense includes payment by licensee.",
      "addresses_issue": "i1",
      "key_observation": "Cited State of Punjab v. British India Corporation Ltd."
    },
    {
      "id": "cr5",
      "text": "Rs. 300 was security, adjusted only against last six months rent.",
      "addresses_issue": "i1",
      "key_observation": "Not indicative of tenancy."
    },
    {
      "id": "cr6",
      "text": "Clause enabling execution if fails to pay for three consecutive months shows no intention of landlord-tenant relationship.",
      "addresses_issue": "i1",
      "key_observation": "Cited Sumatibai Waman Kirlikar v. B. Shirgaonkar."
    },
    {
      "id": "cr7",
      "text": "Length of five years does not militate against licence, as compromise in appeal after loss in trial court.",
      "addresses_issue": "i1",
      "key_observation": "Circumstances explain period."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The compromise deed did not create a lease; therefore, Judgment Debtor not a tenant within S. 2(5) of Orissa House-Rent Control Act.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Ramjibhai Virpal Shah v. G. M. Bhagat",
      "citation": "AIR 1954 Bom. 370",
      "treatment": "followed",
      "relevance": "Elaborately considered interpretation of compromise decrees and distinction between lease and licence."
    },
    {
      "case_name": "M. N. Clubwala v. Fida Hussain Saheb",
      "citation": "1964 6 S.C.R 642-652, 653",
      "treatment": "followed",
      "relevance": "Intention of parties decisive; exclusive possession not conclusive."
    },
    {
      "case_name": "Associated Hotels of India Ltd. v. R. N. Kapur",
      "citation": "1960 1 S.C.R. 368-384",
      "treatment": "followed",
      "relevance": "Propositions on distinguishing lease from licence."
    },
    {
      "case_name": "Issac v. Hotel De Paris",
      "citation": "1960 1 All E.R. 348-352",
      "treatment": "referred",
      "relevance": "Exclusive possession not always tenancy; payment of rent not decisive."
    },
    {
      "case_name": "State of Punjab v. British India Corporation Ltd.",
      "citation": "1964 2 S.C.R. 114-123",
      "treatment": "followed",
      "relevance": "Meaning of 'rent' in wider and narrower sense."
    },
    {
      "case_name": "Sumatibai Waman Kirlikar v. B. Shirgaonkar",
      "citation": "AIR 1949 Bom. 42-44",
      "treatment": "followed",
      "relevance": "Default clause in compromise shows no tenancy."
    }
  ],
  "statutes_cited": [
    {
      "name": "Code of Civil Procedure",
      "sections": [
        "O. XXIII r. 3",
        "s. 47"
      ],
      "relevance": "Compromise petition and objection to execution."
    },
    {
      "name": "Orissa House-Rent Control Act (Orissa Act XXXI of 1958)",
      "sections": [
        "S. 2(5)"
      ],
      "relevance": "Defines 'tenant'; protection against ejectment if lease."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; judgment of Orissa High Court set aside; judgment of District Judge restored. Judgment Debtor not entitled to protection under the Act as no lease created.",
    "relief_granted": "Execution of decree permitted; appellants entitled to possession.",
    "costs": "Appellants to have costs incurred in Supreme Court."
  },
  "key_quotes": [
    {
      "text": "Whether an agreement creates between the parties the relationship of landlord and tenant or merely that of licensor and licensee the decisive consideration is the intention of the parties.",
      "speaker": "court",
      "significance": "Core principle from M. N. Clubwala case."
    },
    {
      "text": "The following propositions may, therefore, be taken as well-established: 1. To ascertain whether a document creates a licence or lease, the substance of the document must be preferred to the form...",
      "speaker": "court",
      "significance": "Summary of tests from Associated Hotels."
    },
    {
      "text": "This, it seems to us, shows that the intention of the parties was not to enter into the relationship, of a landlord and tenant.",
      "speaker": "court",
      "significance": "Key reasoning on default clause."
    }
  ],
  "_case_id": "1967_102",
  "_label": 1,
  "_text_length": 10980,
  "_extracted_at": "2026-02-10T20:21:22.977435"
}