{
  "metadata": {
    "case_name": "Appellant Company v. Respondent",
    "case_year": 1966,
    "court": "Supreme Court of India",
    "judges": [
      "Ramaswami, J."
    ],
    "case_number": "Civil Appeals Nos. 557 and 558 of 1966",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The appellant is a private limited company having its mines, factory and Head Office at Bhilwara in Rajasthan which was at the relevant periods in a Part B State.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The appellant carried on mining business at Bhilwara and was engaged in the cutting, processing, sorting and packing of mica which was exported by it to Kodarma and Giridih which were situated in Part A and Part C States and sold there to purchasers.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The mica was sent almost entirely by railway from Bhilwara to Kodarma and Giridih.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The appellant followed the mercantile method of accounting and the assessment years in question are 1950-51 and 1951-52, the corresponding previous years being the years from November 2, 1948 to October 21, 1949, and October 22, 1949 to November 5, 1950 respectively.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The total sale proceeds of the appellant during the two assessment years amounted to Rs. 19,77,544/-.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The appellant tendered bills to the local branch of the Bank of Rajasthan to the extent of Rs. 15,64,475/- and received payment of that amount at Bhilwara.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "By orders dated March 24, 1955 and May 31, 1954 the Income-tax Officer held that the sales took place in Part A and Part C States and the entire profits from those sales accrued and were received by the appellant in Part A and Part C States and therefore no rebate was admissible under the Part B States Taxation Concessions Order, 1950.",
      "type": "procedural",
      "date": "1954-05-31",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "The Income-tax Officer rejected the claim of the appellant that in regard to some of the sales bills were discounted by the Rajasthan Bank and payment to that extent should be treated as having been received at Bhilwara in the Part B State, holding that the letter for discounting was forged and even assuming discounting, responsibility did not cease till bank realised payment from purchaser.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "On appeal, the Appellate Assistant Commissioner by order dated September 20, 1957 held that the Income-tax Officer was justified in holding that the appellant was not entitled to any rebate under the Part B States Taxation Concessions Order, 1950.",
      "type": "procedural",
      "date": "1957-09-20",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "On further appeal, the Appellate Tribunal by order dated August 18, 1958 held that the appellant received the sale proceeds in regard to the goods consigned to the purchasers in Part A and Part C States and not in Part B State and therefore the appellant was not entitled to the rebate claimed by it.",
      "type": "procedural",
      "date": "1958-08-18",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "The Appellate Tribunal stated a case under s. 66(1) of the Act and referred the question: Whether on the facts and in the circumstances of the case, the assessee was entitled to any rebate under the Part B States Taxation Concessions Order in respect of income from the mining business for the assessment years 1950-51 and 1951-52?",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "By judgment dated April 29, 1964, the Rajasthan High Court answered the question in the negative and against the appellant.",
      "type": "procedural",
      "date": "1964-04-29",
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Representatives of the buyers from Kodarma and Giridih used to visit Bhilwara, inspect the various qualities of mica which the appellant had for sale and entered into written contracts for purchase.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "The contracts show that the buyers purchased specified qualities of mica, Bhilwara godown delivery on the condition that the consignments would be sent to Kodarma or Giridih as the case may be and the railway receipts would be sent through bank; 25 per cent of the price would be sent by way of an advance within a week's time; packing expenses payable by buyers; after consignments left godown at Bhilwara, they would be entirely at the buyers' risk.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f15",
      "text": "The appellant consigned the goods to self and the railway receipts along with the bills of exchange were presented by the appellant to the Rajasthan Bank, Bhilwara for collection after endorsing the railway receipts in favour of the Bank.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f16",
      "text": "The Rajasthan Bank endorsed the railway receipts in favour of its branches in Part A and Part C States and the goods were delivered to the buyers only when they paid the price to the Bank and obtained the railway receipt.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f17",
      "text": "The letter dated July 8, 1948 alleged to have been written by the appellant for discounting was held by the Appellate Tribunal to be a faked document and no instructions were given to the Rajasthan Bank for discounting the appellant's bills.",
      "type": "disputed",
      "date": "1948-07-08",
      "source": "lower_court"
    },
    {
      "id": "f18",
      "text": "Even assuming bank gave credit of part of the amount of some bills to the appellant, the conditions in the discount form provided that the bank is sending the goods at the risk of the consignor and in case of dishonour, responsibility of consignor.",
      "type": "material",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether on the facts and in the circumstances of the case, the assessee was entitled to any rebate under the Part B States Taxation Concessions Order in respect of income from the mining business for the assessment years 1950-51 and 1951-52?",
      "framed_by": "lower_court"
    },
    {
      "id": "i2",
      "text": "Where did the income or the right to receive the payment under the contracts of sale accrue or arise?",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether the property in the goods passed to the purchasers at Bhilwara or at Kodarma or Giridih?",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The appellant claimed that it was entitled to the benefit of rebate in regard to profits from these sales under the Part B States Taxation Concessions Order, 1950 and that s. 4(1)(a) of the Income-tax Act 1922 was not applicable to its transactions.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": "Part B States Taxation Concessions Order, 1950; Income-tax Act 1922 s.4(1)(a)"
    },
    {
      "id": "pa2",
      "text": "In regard to some of the sales bills were discounted by the Rajasthan Bank and payment to that extent should be treated as having been received at Bhilwara in the Part B State.",
      "supporting_facts": [
        "f6",
        "f17"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "After the railway receipts had been endorsed in favour of the bank and the appellant got the consideration by discount of the railway receipts the title in the goods had passed from the appellant to the Bank of Rajasthan which became thereafter the agent of the purchaser.",
      "supporting_facts": [
        "f15",
        "f16"
      ],
      "legal_basis": null
    },
    {
      "id": "pa4",
      "text": "Mica was extracted, processed, sorted, packed and despatched at Bhilwara in Part B State and there was accrual of a part of the income at Bhilwara and the appellant was entitled to claim apportionment of the profits accrued.",
      "supporting_facts": [
        "f1",
        "f2"
      ],
      "legal_basis": "C.I.T., Bombay v. Ahmedbhai Umarbhai & Co.; The Anglo-French Textile Co. Ltd. v. C.I.T., Madras"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The sales took place in Part A and Part C States and the entire profits from those sales accrued and were received by the appellant in Part A and Part C States and therefore no rebate was admissible.",
      "supporting_facts": [
        "f2",
        "f5"
      ],
      "legal_basis": "Part B States Taxation Concessions Order, 1950"
    },
    {
      "id": "ra2",
      "text": "The letter for discounting was forged; even assuming tendering of bills for discounting, responsibility of the appellant under the conditions stipulated by the Bank did not cease till the Bank realised payment from the purchaser and hence there was no discounting of the bills which were merely handed to the Bank for collection.",
      "supporting_facts": [
        "f17",
        "f18"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The words 'accrue' and 'arise' indicate a right to receive and do not mean actual receipt; income accrues when assessee acquires a right to receive the income.",
      "addresses_issue": "i2",
      "key_observation": "Accrual happens without actual receipt if right to receive is acquired."
    },
    {
      "id": "cr2",
      "text": "Profits accrue at the place where the sales are effected, i.e., where the property in the goods passed to the purchasers.",
      "addresses_issue": "i3",
      "key_observation": "Place of accrual depends on facts; for buying/selling, generally where contract made or sales effected."
    },
    {
      "id": "cr3",
      "text": "Under Sale of Goods Act s.23 and s.25, property does not pass until conditions fulfilled; here, appellant reserved right of disposal by consigning to self, endorsing RR to bank for collection, goods delivered only on payment.",
      "addresses_issue": "i3",
      "key_observation": "Seller prima facie reserves right of disposal if goods deliverable to order of seller and bill of lading sent with bill of exchange."
    },
    {
      "id": "cr4",
      "text": "Even if bank discounted bills, bank's conditions showed appellant's responsibility continued till payment from purchaser; no sale to bank, bank had security over goods.",
      "addresses_issue": "i1",
      "key_observation": "Negotiating hundi with banker does not transfer ownership of goods."
    },
    {
      "id": "cr5",
      "text": "No apportionment as entire income from sales accrued in Part A/C states; cases cited by appellant relate to composite manufacturing/selling business, not applicable here.",
      "addresses_issue": "i1",
      "key_observation": "Profits from mining business sales accrue where title passes, not at extraction/processing."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The assessee was not entitled to any rebate under the Part B States Taxation Concessions Order in respect of income from the mining business for the assessment years 1950-51 and 1951-52 as profits accrued in Part A and Part C States.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Income accrued where property in goods passed to purchasers at Kodarma and Giridih.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Colquhoun v. Brooks",
      "citation": "1888 21 Q.B.D. 52",
      "treatment": "followed",
      "relevance": "Words 'arising or accruing' descriptive of a right to receive profits."
    },
    {
      "case_name": "E. D. Sassoon Company Ltd. v. C.I.T. Bombay City",
      "citation": null,
      "treatment": "followed",
      "relevance": "Income accrues when assessee acquires right to receive."
    },
    {
      "case_name": "C.I.T. Bombay Presidency Aden v. Chunilal B. Mehta",
      "citation": "6 I.T.R. 521",
      "treatment": "followed",
      "relevance": "No general test for place of accrual; depends on facts like place of contract or execution."
    },
    {
      "case_name": "Mirabita v. Imperial Ottoman Bank",
      "citation": "1878 3 Ex. 164",
      "treatment": "followed",
      "relevance": "Reservation of right of disposal prevents property passing until payment."
    },
    {
      "case_name": "Prinz Adalbert",
      "citation": "1917 A.C. 586",
      "treatment": "followed",
      "relevance": "Discounting draft with bill of lading; ownership transfers on acceptance/payment."
    },
    {
      "case_name": "C.I.T., Bombay v. Ahmedbhai Umarbhai & Co.",
      "citation": null,
      "treatment": "distinguished",
      "relevance": "Apportionment in composite manufacturing/selling business."
    },
    {
      "case_name": "The Anglo-French Textile Co. Ltd. v. C.I.T., Madras",
      "citation": null,
      "treatment": "distinguished",
      "relevance": "Apportionment between manufacturing and trading profits."
    }
  ],
  "statutes_cited": [
    {
      "name": "Income-tax Act 1922",
      "sections": [
        "Section 4(1)(a)",
        "Section 66(1)"
      ],
      "relevance": "Total income includes income received or deemed received in taxable territories; reference to High Court."
    },
    {
      "name": "Part B States Taxation Concessions Order, 1950",
      "sections": [
        "Paragraph 4(I)(iii)"
      ],
      "relevance": "Rebate for income accruing/arising in Part B State and not received/deemed received outside Part B States."
    },
    {
      "name": "Indian Sale of Goods Act 1930",
      "sections": [
        "Section 23",
        "Section 25"
      ],
      "relevance": "Property passes on unconditional appropriation; seller may reserve right of disposal."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court upheld the Rajasthan High Court's judgment answering the referred question in the negative, holding that the appellant was not entitled to rebate as income accrued in Part A and Part C States where property in goods passed upon payment to the bank.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"the words arising or accruing are general words descriptive of a right to receive profits.\"",
      "speaker": "court",
      "significance": "Defines accrual of income under tax law."
    },
    {
      "text": "\"Profits accrue as a general rule at the place where the contract of sale is made or where sales are effected.\"",
      "speaker": "court",
      "significance": "Determines place of accrual for sales."
    },
    {
      "text": "\"the income may accrue to an assessee without actual receipt of the same. If the assessee acquires a right to receive the income, the income can be said to accrue to him.\"",
      "speaker": "court",
      "significance": "Clarifies mercantile system accrual."
    }
  ],
  "_case_id": "1967_143",
  "_label": 0,
  "_text_length": 20686,
  "_extracted_at": "2026-02-10T20:21:37.940697"
}