{
  "metadata": {
    "case_name": "Lonand Grampanchayat v. Respondent No. 1",
    "case_year": 1966,
    "court": "Supreme Court of India",
    "judges": [
      "Bachawat, J."
    ],
    "case_number": "Civil Appeal No. 87 of 1966",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "On March 19, 1963 respondent No. 1 on behalf of 36 employees of the Lonand Grampanchayat applied to the Authority appointed under s. 20(1) of the Minimum Wages Act, 1948 for a direction upon the Grampanchayat to pay to the employees overtime wages and damages.",
      "type": "procedural",
      "date": "1963-03-19",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "A number of employees claimed overtime wages from October 23, 1960 for a period of two years two months, and nine days. One employee claimed wages for a period of seven years and nine months, one claimed wages for six years and ten months and another claimed wages for three years.",
      "type": "disputed",
      "date": "1960-10-23",
      "source": "respondent"
    },
    {
      "id": "f3",
      "text": "By an order dated September 18, 1963 the Authority held that the application should be entertained in respect of the claims for the period subsequent to January 1, 1961 as the employees had sufficient cause for not making the application within the prescribed period of six months.",
      "type": "procedural",
      "date": "1963-09-18",
      "source": "lower_court"
    },
    {
      "id": "f4",
      "text": "A petition challenging this order under Art. 227 of the Constitution was summarily dismissed by the Bombay High Court by judgment and order dated November 20, 1963.",
      "type": "procedural",
      "date": "1963-11-20",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Appeal by special leave filed before Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "On January 2, 1961 the employees wrote to the Inspector, Minimum Wages, government labour office, Sangli, complaining of overtime work and asking for directions on the appellant to comply with the provisions of the Minimum Wages Act. A reminder was sent to him on January 11, 1961.",
      "type": "background",
      "date": "1961-01-02",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "On January 18, 1961 the Inspector wrote that the matter was being followed up.",
      "type": "background",
      "date": "1961-01-18",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "On April 22, 1961 the Inspector visited Lonand and directed the appellant to comply with the provisions of the Minimum Wages Act and the rules made thereunder. On April 26, 1961 the Inspector communicated this direction to the employees.",
      "type": "background",
      "date": "1961-04-22",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "On January 1, 1962 the employees lodged a complaint of overtime work with the Commissioner, Poona Division, and asked for a direction for payment of the arrears of overtime wages.",
      "type": "background",
      "date": "1962-01-01",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "On January 3, 1962 the Commissioner wrote to the employees that the matter was receiving attention and their application had been sent to the Collector of Satara for disposal.",
      "type": "background",
      "date": "1962-01-03",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Later in August September 1962 and early 1963 the Block Development Officer came to Lonand and made inquiries.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "The Authority found that since January 2, 1961 the employees were making complaints to the government authorities regarding non-payment of overtime wages.",
      "type": "admitted",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "The Authority declined to condone the delay in respect of claims for the period prior to January 1, 1961.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "The employees relied upon the assurances of the inspectors and their superiors that proper steps would be taken for the remedy of their grievances and relying upon those assurances, they refrained from taking steps under s.20(2) of the Minimum Wages Act.",
      "type": "material",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the Authority properly exercised its discretion under the second proviso to s.20(2) of the Minimum Wages Act, 1948 to condone the delay in presenting the application for overtime wages.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Scope of interference by the High Court under Art. 227 of the Constitution and by the Supreme Court under Art. 136 with the Authority's exercise of discretion.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The Authority has a discretion to condone the delay in presenting the application provided sufficient cause for the entire delay is shown to its satisfaction. This discretion like other judicial discretion must be exercised with vigilance and circumspection according to justice, common sense, and sound judgment.",
      "addresses_issue": "i1",
      "key_observation": "Discretion to be exercised judicially."
    },
    {
      "id": "cr2",
      "text": "The words 'sufficient cause' in the second proviso to s.20(2) should receive a similar liberal construction as under s.5 of the Indian Limitation Act, so as to advance substantial justice when no negligence, no inaction, no want of bona fides is imputable to the applicant.",
      "addresses_issue": "i1",
      "key_observation": "Liberal construction for sufficient cause."
    },
    {
      "id": "cr3",
      "text": "The High Court under Art. 227 will not review the discretion of the Authority judicially exercised, but it may interfere if the exercise of the discretion is capricious or perverse or ultra vires. No appeal lies from an order of the Authority under s.20.",
      "addresses_issue": "i2",
      "key_observation": "Limited superintendence under Art. 227."
    },
    {
      "id": "cr4",
      "text": "Having regard to all the circumstances of the case, the employees were not guilty of inaction or negligence and the entire delay in presenting the application was due to their honest though mistaken belief that the relief of overtime wages would be granted to them through the intervention of the inspectors and their superior officers.",
      "addresses_issue": "i1",
      "key_observation": "Sufficient cause established from January 1, 1961."
    },
    {
      "id": "cr5",
      "text": "It is not shown that in condoning the delay the Authority acted arbitrarily or capriciously or in excess of its jurisdiction or that it committed any error apparent on the face of the record. The Court cannot interfere merely because it might take a different view of the facts and exercise the discretion differently.",
      "addresses_issue": "i1",
      "key_observation": "No ground for interference."
    },
    {
      "id": "cr6",
      "text": "The High Court refused to interfere under Art. 227. This is not a fit case for interference by us under Art. 136.",
      "addresses_issue": "i2",
      "key_observation": "No grave miscarriage of justice."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The Authority properly condoned delay for claims subsequent to January 1, 1961 under second proviso to s.20(2) of Minimum Wages Act.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "High Court under Art. 227 and Supreme Court under Art. 136 will not interfere with judicial exercise of discretion by Authority unless capricious, perverse, or ultra vires.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Keighley's case",
      "citation": "10 Cokes Rep. 139, 140; 77 E.R. 1134, 1136",
      "treatment": "referred",
      "relevance": "Discretion is to know through law what is just."
    },
    {
      "case_name": "Krishna v. Chathappan",
      "citation": "I.L.R. 13 Mad. 269",
      "treatment": "followed",
      "relevance": "Explains exercise of discretion under s.5 Limitation Act with liberal construction of sufficient cause."
    },
    {
      "case_name": "Dinabandhu Sahu v. Jadumoni Mangaraj",
      "citation": "1955 1 S.C.R. 140, 146",
      "treatment": "followed",
      "relevance": "Approved liberal construction of sufficient cause."
    },
    {
      "case_name": "Ramlal, Motilal and Chhotetal v. Rewa Coalfields Ltd.",
      "citation": "1962 2 S.C.R. 762, 767",
      "treatment": "followed",
      "relevance": "Approved liberal construction of sufficient cause."
    },
    {
      "case_name": "Nagendra Nath Bora v. The Commissioner of Hills Division and Appeals, Assam",
      "citation": "1958 S.C.R. 1240, 1272",
      "treatment": "followed",
      "relevance": "Limits of Art. 227 power to ensure tribunal functions within authority."
    },
    {
      "case_name": "Sitaram Ramcharan v. M. N. Nagarshana",
      "citation": "1960 1 S.C.R. 875, 884",
      "treatment": "followed",
      "relevance": "Finding under similar proviso to Payment of Wages Act s.15(2) not challengeable under Art. 227."
    }
  ],
  "statutes_cited": [
    {
      "name": "Minimum Wages Act, 1948",
      "sections": [
        "s. 20(1)",
        "s. 20(2)",
        "s. 19"
      ],
      "relevance": "Application under s.20(2) for minimum wages/amounts; provisos limit to 6 months but allow condonation for sufficient cause; inspectors' powers under s.19."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 227",
        "Art. 226",
        "Art. 136"
      ],
      "relevance": "High Court's superintendence over tribunals; limited to jurisdiction, not review of discretion."
    },
    {
      "name": "Indian Limitation Act",
      "sections": [
        "s. 5"
      ],
      "relevance": "Similar wording to second proviso s.20(2) Minimum Wages Act; liberal construction of sufficient cause."
    },
    {
      "name": "Payment of Wages Act, 1936",
      "sections": [
        "s. 15(2)"
      ],
      "relevance": "Similar second proviso; finding not challengeable under Art. 227."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal by special leave against the Bombay High Court's dismissal of petition under Art. 227 challenging the Authority's order condoning delay for claims post January 1, 1961 is dismissed. No interference warranted as Authority's discretion properly exercised and no grave miscarriage of justice.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The Authority has a discretion to condone the delay in presenting the application provided sufficient cause for the entire delay is shown to its satisfaction. This discretion like other judicial discretion must be exercised with vigilance and circumspection according to justice, common sense, and sound judgment.",
      "speaker": "court",
      "significance": "Defines standard for exercising condonation discretion."
    },
    {
      "text": "The words sufficient cause in the second proviso to s.20(2) should receive a similar liberal construction... so as to advance substantial justice when no negligence, no inaction, no want of bona fides is imputable to the appellant.",
      "speaker": "court",
      "significance": "Establishes liberal interpretation for sufficient cause."
    },
    {
      "text": "The High Court will not review the discretion of the Authority judicially exercised, but it may interfere if the exercise of the discretion is capricious or perverse or ultra vires.",
      "speaker": "court",
      "significance": "Limits scope of Art. 227 interference."
    }
  ],
  "_case_id": "1967_345",
  "_label": 0,
  "_text_length": 7702,
  "_extracted_at": "2026-02-10T20:24:47.478633"
}