{
  "metadata": {
    "case_name": "State (Appellants) v. Respondents (Land Owners)",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "Shelat, J."
    ],
    "case_number": "Civil Appeal No. 1012 of 1964",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "In 1959 there were floods in the area which affected the residents living in the gaothan of Kasarkhed.",
      "type": "background",
      "date": "1959",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "In 1961 there were floods more serious than in 1959 affecting as many as 470 persons whose houses were either washed away or seriously damaged.",
      "type": "material",
      "date": "1961",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "There was an urgent necessity of rehabilitating those sufferers at some other place where they could build their houses and complete them before the arrival of the next monsoon.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The first appellant under powers conferred by section 15 of the Bombay Land Requisition Act passed order dated November 20, 1961 under section 5(1) requisitioning lands set out in the Schedule for public purpose viz., for a new gaothan at Kasarkhed for the victims of floods, the old village site having been rendered unsuitable by floods.",
      "type": "procedural",
      "date": "1961-11-20",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Respondents are the owners of the land in question situate in the village Kasarkhed, District Akola.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "It is not in dispute that land was needed for settling a new gaothan where the victims of the flood could be resettled.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "At a later stage the State Government initiated proceedings under the Land Acquisition Act 1 of 1894 in respect of those very lands and issued a notification under section 4 thereof.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "On December 14, 1961 the respondents filed a Special Civil Application No. 373 of 1961 in the Bombay High Court, Nagpur Bench challenging the validity of the said order on grounds inter alia that it was passed without giving them an opportunity of being heard, that it contravened Art. 19(1)(f) and (g) of the Constitution, that the competent authority had no power to invoke the Land Requisition Act inasmuch as the purpose was of a permanent character viz., construction of houses and settling a new village site, that the proceedings amounted to acquisition of lands, that invoking the Requisition Act was not in bona fide exercise of power, that though there were more suitable lands the lands of the respondents were deliberately selected as a result of influence exercised by the President of Balapur Municipal Committee, and that there were buildings and a factory situate on the said lands so procedure under section 5(2) should have been followed.",
      "type": "procedural",
      "date": "1961-12-14",
      "source": "respondent"
    },
    {
      "id": "f9",
      "text": "In the return filed by the appellants these allegations were traversed and it was submitted that the order was valid and competent under section 5(1) of the Act.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f10",
      "text": "The High Court by judgment and order dated August 28, 1962 allowed the petition and quashed the order holding that the purpose was permanent viz., establishing a new village site, the Act was temporary extended until 1963, power to requisition only for temporary purpose, otherwise abuse of the Act.",
      "type": "procedural",
      "date": "1962-08-28",
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the Bombay Land Requisition Act, section 5(1) authorises an order of requisitioning even if the purpose for which it is made is not a temporary purpose, in the present case rehabilitation of flood sufferers and settling for that purpose a new village site.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The High Court's view of section 5(1) of the Act was incorrect and it failed to appreciate the scope of the provisions of section 5(1).",
      "supporting_facts": [
        "f4",
        "f10"
      ],
      "legal_basis": "Section 5(1) Bombay Land Requisition Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Order passed without opportunity of being heard, contravenes Art. 19(1)(f) and (g), purpose permanent so no power under Land Requisition Act which is for temporary use, amounts to acquisition, not bona fide, suitable lands ignored due to influence, buildings and factory on land so section 5(2) procedure required.",
      "supporting_facts": [
        "f4",
        "f5",
        "f8"
      ],
      "legal_basis": "Art. 19(1)(f)(g), Section 5(1) and 5(2) Bombay Land Requisition Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "On a plain reading of section 5(1), the only limitation is that the purpose must be a public purpose; words 'any land for any public purpose' are wide enough to include any public purpose whether temporary or otherwise; no implied restriction to temporary purpose; temporary life of Act not to be conflated with character of purpose.",
      "addresses_issue": "i1",
      "key_observation": "Section 5(1) imposes no restriction as to the manner in which the land is to be used or that it must be temporary."
    },
    {
      "id": "cr2",
      "text": "Section 9 requires restoration of land to owner when derequisitioned, but has nothing to do with nature of purpose; life of power and purpose are distinct.",
      "addresses_issue": "i1",
      "key_observation": "Requisition acquires only right of possession and user, not proprietary right."
    },
    {
      "id": "cr3",
      "text": "No antithesis between requisition power and acquisition under Land Acquisition Act; both can be used sequentially; initiation of LA proceedings after requisition does not indicate abuse.",
      "addresses_issue": "i1",
      "key_observation": "Exercise of requisition power does not exhaust or make incompatible acquisition power."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The power to requisition under section 5(1) of the Bombay Land Requisition Act can be exercised where the public purpose is not temporary, such as rehabilitation of flood sufferers by settling a new village site.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Bombay Land Requisition Act 23 of 1948 (extended by Bombay Land Requisition Extension and Amendment Act 33 of 1959)",
      "sections": [
        "Section 5(1)",
        "Section 5(2)",
        "Section 9",
        "Section 15"
      ],
      "relevance": "Authorises requisition of any land for any public purpose without restriction to temporary use; impugned order passed under Section 5(1)"
    },
    {
      "name": "Land Acquisition Act 1 of 1894",
      "sections": [
        "Section 4",
        "Part VI"
      ],
      "relevance": "State initiated proceedings for same lands after requisition; no bar to using after requisition; Part VI allows temporary occupation up to 3 years"
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 19(1)(f)",
        "Article 19(1)(g)"
      ],
      "relevance": "Challenged by respondents as contravened but not decided by Supreme Court"
    }
  ],
  "outcome": {
    "disposition": "partially_accepted",
    "summary": "Appeal allowed, High Court order set aside as erroneous on scope of section 5(1); matter remanded to High Court to decide other questions raised in the petition in accordance with law.",
    "relief_granted": "Impugned requisition order upheld on main issue; remand for other issues",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The Bombay Land Requisition Act was, in our opinion, never intended to be used for the permanent acquisition of the lands of citizens as is being sought to be done in, the instant case. We can only characterise the attempt to take the lands of the petitioners under that Act as an abuse of the provisions of that Act.",
      "speaker": "lower_court",
      "significance": "High Court's reasoning which was overruled by Supreme Court"
    },
    {
      "text": "On a plain reading of the section it is clear that the only limitation to the power which it confers is the temporary life of the Act. But the words any land for any public purpose are sufficiently wide enough, to include any public purpose whether temporary or otherwise.",
      "speaker": "court",
      "significance": "Core holding on scope of section 5(1)"
    },
    {
      "text": "The life of the power and the purpose for which it is exercised are two distinct ingredients of section 5(1) and ought not to be confused.",
      "speaker": "court",
      "significance": "Distinguishes temporary nature of Act from purpose of requisition"
    }
  ],
  "_case_id": "1967_153",
  "_label": 1,
  "_text_length": 13372,
  "_extracted_at": "2026-02-10T20:22:01.953749"
}