{
  "metadata": {
    "case_name": "Unnamed Appellant (Practising Advocate) v. State of Gujarat",
    "case_year": 1965,
    "court": "Supreme Court of India",
    "judges": [
      "Shelat, J.",
      "Bachawat, J.",
      "Wanchoo, C.J.",
      "Vaidialingam, J.",
      "Mitter, J."
    ],
    "case_number": "Criminal Appeal No. 105 of 1965",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant, a practising advocate, was engaged by Rama Shamal and Raiji Shamal, two of the accused in Criminal Case No. 26 of 1963 before the Judicial Magistrate, Baroda, charged under ss. 302, 436, 334 read with s. 149 of the Penal Code.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On January 12, 1963, the appellant presented a bail application on behalf of the said two accused. The Magistrate granted bail on each executing a personal bond of Rs. 1,500 with surety for the like amount.",
      "type": "procedural",
      "date": "1963-01-12",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On January 25, 1963, bail bonds were furnished by a person calling himself Udesing Abhesing. The appellant identified that person as Udesing Abhesing and as personally known to him. On the strength of his identification, the Magistrate accepted the bonds and released the two accused on bail.",
      "type": "material",
      "date": "1963-01-25",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Thereafter, one of the accused absented himself from the Court on three occasions and the Magistrate issued notice on the said surety.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "On March 11, 1963, the real Udesing Abhesing appeared and denied that he had executed the said bonds or stood as surety.",
      "type": "material",
      "date": "1963-03-11",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The Magistrate issued an informal notice to the appellant to explain why action should not be taken against him for identifying a person who had falsely impersonated as Udesing Abhesing. The appellant gave his reply.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "The Magistrate recorded statements of the real Udesing Abhesing and of one Chiman Shamal to satisfy himself that there was substance in the allegation.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "On July 19, 1963, the Magistrate issued a show cause notice to the appellant under s. 476, Cr. P.C. and the appellant filed his reply.",
      "type": "procedural",
      "date": "1963-07-19",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "After an enquiry under s. 476, the Magistrate ordered filing of a complaint against the appellant in respect of offences under ss. 205, 467 and 468 read with s. 114 of the Penal Code.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "In an appeal filed by the appellant, the Additional Sessions Judge held that the said complaint was justified but only in respect of the offence under s. 205 read with s. 114.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "In a revision by the appellant (Criminal Revision Application No. 378 of 1964), a single Judge of the Gujarat High Court dismissed the revision on January 11, 1965, stating 'This is a matter in which this Court should never interfere in revision.'",
      "type": "procedural",
      "date": "1965-01-11",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "The High Court gave certificate under Art. 134(1)(c) of the Constitution.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the High Court's order dismissing the revision application is a final order within the meaning of Art. 134(1)(c) of the Constitution.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the case involves a substantial question of law as regards expediency under s. 476 Cr. P.C. to warrant a certificate under Art. 134(1)(c).",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The revision before High Court raised whether Magistrate was justified in ordering complaint under s. 476 Cr. P.C. for offences under ss. 205, 467, 468 r/w 114 IPC.",
      "supporting_facts": [
        "f9",
        "f10",
        "f11"
      ],
      "legal_basis": "s. 476 Cr. P.C."
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The High Court's order dismissing the revision was not a final order as it did not determine the complaint filed by the Magistrate nor decide the controversy between the State of Gujarat and the appellant whether the appellant had committed the said offence.",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": "Art. 134(1)(c) Constitution"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Discussed tests for finality of judgments/orders: determines principal matter; finally disposes of rights of parties; applied English, Privy Council, Indian cases distinguishing between orders in main proceedings vs. independent proceedings like revisions against s.476 orders.",
      "addresses_issue": "i1",
      "key_observation": "Revision against Magistrate's order under s.476 is independent proceeding; High Court's dismissal finally disposes of controversy whether complaint justified."
    },
    {
      "id": "cr2",
      "text": "Even if final, no substantial question of law or principle involved; question of expediency under s.476 is factual, concurrent findings by Magistrate and Sessions Judge.",
      "addresses_issue": "i2",
      "key_observation": "High Court not competent to certify mere question of fact."
    },
    {
      "id": "cr3",
      "text": "Bachawat J. (for himself and Mitter J.): Order directing filing of complaint is interlocutory, preliminary step in prosecution; does not determine guilt/innocence; bar under s.195(1)(b) Cr.P.C. removed but trial pending.",
      "addresses_issue": "i1",
      "key_observation": "Not final as rights of parties not finally decided."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "High Court's order is final but certificate incompetent as no substantial question of law; alternatively, order interlocutory.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Appeal not maintainable under Art. 134(1)(c).",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Salaman v. Warner",
      "citation": "1891 1 Q.B. 734",
      "treatment": "referred",
      "relevance": "Test for finality: decision determining main dispute."
    },
    {
      "case_name": "Abdul Rehman v. D. K. Cassim Sons",
      "citation": "6 I.A. 76",
      "treatment": "followed",
      "relevance": "Finality in relation to suit; if suit still live, not final."
    },
    {
      "case_name": "S. Kuppuswami Rao v. The King",
      "citation": "1947 F.C.R. 180",
      "treatment": "followed",
      "relevance": "Judgment/order same meaning in civil/criminal; test of final disposal."
    },
    {
      "case_name": "Mohammad Amin Brothers Ltd. v. Dominion of India",
      "citation": "1949 F.C.R. 842",
      "treatment": "followed",
      "relevance": "Test: finally disposes of rights of parties."
    },
    {
      "case_name": "Sardar Syedna Taher Saifuddin Saheb v. State of Bombay",
      "citation": "1958 S.C.R. 1007",
      "treatment": "followed",
      "relevance": "Preliminary issue not final if rest undecided."
    },
    {
      "case_name": "Ramesh v. Patni",
      "citation": "1966 3 S.C.R. 198",
      "treatment": "followed",
      "relevance": "Art.226 petition independent; finality judged therein, not by original controversy."
    },
    {
      "case_name": "State of Orissa v. Madan Gopal",
      "citation": "1952 S.C.R. 28",
      "treatment": "followed",
      "relevance": "Interim order final if disposes of petition completely."
    },
    {
      "case_name": "Durga Prasad v. State of U.P.",
      "citation": "A.I.R. 1960 All. 728",
      "treatment": "distinguished",
      "relevance": "Remand order not final; would be if decided merits."
    },
    {
      "case_name": "Haripada Dey v. State of West Bengal",
      "citation": "1956 S.C.R. 639",
      "treatment": "followed",
      "relevance": "No certificate on mere question of fact."
    },
    {
      "case_name": "Babboo v. State of Uttar Pradesh",
      "citation": "1965 2 S.C.R. 771",
      "treatment": "followed",
      "relevance": "Certificate only for substantial question of law."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "302",
        "436",
        "334",
        "149",
        "205",
        "467",
        "468",
        "114"
      ],
      "relevance": "Charges against original accused and appellant for forgery/impersonation in bail bonds."
    },
    {
      "name": "Code of Criminal Procedure",
      "sections": [
        "476",
        "195",
        "479A"
      ],
      "relevance": "Inquiry and complaint for offences in relation to court proceedings; bar on prosecution without complaint."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "134(1)(c)"
      ],
      "relevance": "Appeal from High Court judgment/final order in criminal proceeding if certified fit."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court held the appeal not maintainable as the High Court's certificate under Art. 134(1)(c) was incompetent, either because no substantial question of law involved (Shelat J.) or order interlocutory (Bachawat J.). Appeal dismissed without examining merits.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "'This is a matter in which this Court should never interfere in revision. The revision application is, therefore, dismissed.'",
      "speaker": "court",
      "significance": "High Court's dismissal order in revision."
    },
    {
      "text": "Does the judgment or order as made finally dispose of the rights of the parties?",
      "speaker": "court",
      "significance": "Test for finality from Bozson v. Altrincham."
    },
    {
      "text": "The finality of that order was not to be judged by relating that order with the controversy in the complaint.",
      "speaker": "court",
      "significance": "Key holding on independent nature of revision proceeding."
    }
  ],
  "_case_id": "1967_267",
  "_label": 0,
  "_text_length": 26836,
  "_extracted_at": "2026-02-10T20:23:25.286200"
}