{
  "metadata": {
    "case_name": "Commissioner of Income-tax v. Respondents (Hindu Undivided Family)",
    "case_year": 1966,
    "court": "Supreme Court of India",
    "judges": [
      "Shah, J."
    ],
    "case_number": "Civil Appeal No. 2177 of 1966",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Respondents, a Hindu undivided family, assessed for assessment year 1949-50 to tax under s 23 of the Mysore Income-tax Act on total income of Rs. 10,100/-",
      "type": "procedural",
      "date": "1949-50 assessment year",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Second Additional Income-tax Officer, Urban Circle, Bangalore, commenced proceeding under s. 34 of Mysore Income-tax Act for re-assessment of income for 1949-50 and served notice on March 6, 1951",
      "type": "procedural",
      "date": "1951-03-06",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On May 21, 1954, Income-tax Officer determined respondents' total income at Rs. 75,957/-",
      "type": "procedural",
      "date": "1954-05-21",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "In appeal, Appellate Assistant Commissioner of Income-tax, A Range, Bangalore, by order dated November 4, 1961, set aside the order and directed Income-tax Officer to make fresh assessment after inquiries on certain matters",
      "type": "procedural",
      "date": "1961-11-04",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "At request of respondents under s. 66(2) of Mysore Income-tax Act, Commissioner of Income-tax, Mysore, referred two questions to High Court of Mysore",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Questions referred: (1) Whether, if notice under s. 34 issued within prescribed period, Income-tax Officer can assess/re-assess escaped income after four years from close of assessment year? (2) Whether Appellate Assistant Commissioner competent to set aside and direct re-do of assessment as done?",
      "type": "legal",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "At hearing of reference, respondents did not press first question; High Court answered second question in affirmative",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Income-tax Officer commenced inquiry directed by Appellate Assistant Commissioner",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Respondents applied to High Court of Mysore in Writ Petition No. 1076 of 1962 for writ of prohibition restraining Income-tax Officer from continuing assessment proceeding for 1949-50, claiming barred by limitation",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "High Court of Mysore by judgment and order dated July 12, 1963 upheld contention, allowed petition, holding s. 34 Mysore Income-tax Act similar to Rule 34 Mysore Sales Tax Act, 1948, and case falls within rule in M/s K.S. Subbarayappa and Sons v. State of Mysore (1952 Mysore L.J. 234)",
      "type": "procedural",
      "date": "1963-07-12",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Commissioner of Income-tax appealed to Supreme Court with special leave",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the proceeding for re-assessment under s. 34 of Mysore Income-tax Act for 1949-50 is barred by limitation after expiry of four years from close of assessment year, despite notice served within time",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether Appellate Assistant Commissioner competent to set aside and direct Income-tax Officer to re-do assessment",
      "framed_by": "high_court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Proceeding under s. 34 commenced validly with notice on March 6, 1951 within four years; Appellate Assistant Commissioner set aside order but not notice, merely remanded for inquiry; no period prescribed for completion, so can continue post four years",
      "supporting_facts": [
        "f2",
        "f3",
        "f4"
      ],
      "legal_basis": "Section 34 Mysore Income-tax Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Re-assessment proceeding barred by limitation due to expiry of four years; provisions of s. 34 Mysore Income-tax Act similar to Rule 34 Mysore Sales Tax Act, 1948, as per K.S. Subbarayappa case",
      "supporting_facts": [
        "f2",
        "f10"
      ],
      "legal_basis": "Section 34 Mysore Income-tax Act; Rule 34 Mysore Sales Tax Act, 1948"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Proceeding under s. 34 may be commenced if escaped income and notice served within four years of end of assessment year; no period for completion prescribed, so can complete after four years",
      "addresses_issue": "i1",
      "key_observation": "Notice served March 6, 1951 within time; AAC vacated assessment order but did not set aside notice, only remanded for inquiry"
    },
    {
      "id": "cr2",
      "text": "First reference question not pressed, deemed answered against respondents; cannot reagitate in writ petition under Art. 226",
      "addresses_issue": "i1",
      "key_observation": "High Court erred in holding proceeding barred"
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "If notice under s. 34 served within four years, Income-tax Officer may proceed to assess/re-assess even after four years from close of assessment year, as no completion period prescribed",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "M/s K.S. Subbarayappa and Sons v. State of Mysore",
      "citation": "1952 Mysore L.J. 234",
      "treatment": "distinguished",
      "relevance": "High Court applied analogy to sales tax rule, but Supreme Court holds Mysore Income-tax Act provisions allow completion post four years"
    }
  ],
  "statutes_cited": [
    {
      "name": "Mysore Income-tax Act, 1923",
      "sections": [
        "s 34",
        "s 23",
        "s 22(2)",
        "s 66(2)"
      ],
      "relevance": "Governs re-assessment proceedings; notice under s 34 within four years permits completion thereafter"
    },
    {
      "name": "Mysore Sales Tax Act, 1948",
      "sections": [
        "Rule 34"
      ],
      "relevance": "High Court drew similarity, but not applicable to income-tax provisions"
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 226"
      ],
      "relevance": "Writ petition filed under; cannot reagitate deemed answered reference question"
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; High Court judgment set aside; re-assessment proceedings not barred by limitation as notice under s. 34 was served within four years and Appellate Assistant Commissioner did not set aside the notice.",
    "relief_granted": "Writ of prohibition quashed; Income-tax Officer permitted to continue proceedings",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "But if a proper notice is served within the period provided by the section, the proceeding may be completed even after the expiry of four years from the close of the assessment year, for the Act prescribes no period for completion of the proceeding.",
      "speaker": "court",
      "significance": "Core holding on limitation under s. 34"
    },
    {
      "text": "The High Court was, in our judgment, plainly in error in holding that the proceeding for re-assessment was barred.",
      "speaker": "court",
      "significance": "Direct reversal of High Court decision"
    }
  ],
  "_case_id": "1967_253",
  "_label": 0,
  "_text_length": 6197,
  "_extracted_at": "2026-02-10T20:23:14.969045"
}