{
  "metadata": {
    "case_name": "Villiammi Achi v. Nagappa Chettiar",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "Wanchoo, J."
    ],
    "case_number": "Civil Appeal No. 806 of 1964",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Nagappa (father of Pallaniappa) made a will on June 10, 1934, disposing certain properties in favour of persons including his wife, and giving the residue absolutely to Pallaniappa, appointing him executor.",
      "type": "background",
      "date": "1934-06-10",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Will stated most properties were testator's exclusive self-acquired property, but made with consent of son Pallaniappa.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Nagappa died in July 1934; Pallaniappa obtained probate and possessed residue after legacies.",
      "type": "material",
      "date": "1934-07",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "All properties left by Nagappa were joint family properties of Nagappa and Pallaniappa; Pallaniappa could acquire by survivorship.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Respondent Nagappa Chettiar adopted by Pallaniappa in 1941.",
      "type": "material",
      "date": "1941",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Appellant Villiammi Achi is widow of Pallaniappa; Nachiammai Achi (dead) was Pallaniappa's mother.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Pallaniappa died on September 16, 1956, after Hindu Succession Act, 1956 came into force.",
      "type": "material",
      "date": "1956-09-16",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Suit by respondent against appellant and others for two-thirds share of properties left by Pallaniappa, for separate possession after partition.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f9",
      "text": "Trial court decreed suit giving two-thirds to respondent, one-sixth each to appellant and Nachiammai's representative.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Madras High Court in Appeal No. 347 of 1958 dismissed appellant's appeal on July 13, 1962.",
      "type": "procedural",
      "date": "1962-07-13",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Special leave granted by Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether there was election by Pallaniappa to take under his father's will and if so, whether the respondent would be bound by it.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether Pallaniappa threw the entire property into the family hotch-pot after adoption of the respondent, making it joint family property.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Pallaniappa's conduct in obtaining probate and carrying out will terms amounted to election; residue became his absolute property; respondent acquired no interest by adoption in 1941; no joint family property at Pallaniappa's death; respondent bound by election under S.180 Indian Succession Act.",
      "supporting_facts": [
        "f3",
        "f4",
        "f5",
        "f7"
      ],
      "legal_basis": "S. 180 Indian Succession Act, 1925"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "No election by Pallaniappa as he had title by survivorship irrespective of will; S.180 does not apply; even if election, respondent not bound as his interest independent of father upon adoption.",
      "supporting_facts": [
        "f4",
        "f5"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Pallaniappa threw entire property into family hotch-pot after adoption, making it joint family property.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "No election under S.180 as Pallaniappa would get property by survivorship anyway; no benefit derived from will requiring choice.",
      "addresses_issue": "i1",
      "key_observation": "Election arises only where legatee must choose between own property willed away and testator's property given by will."
    },
    {
      "id": "cr2",
      "text": "Even assuming election, father's will cannot change joint family property character in son's hands; son takes interest by birth independent of father under Mitakshara law.",
      "addresses_issue": "i1",
      "key_observation": "Adopted son acquires independent interest in joint family property upon adoption."
    },
    {
      "id": "cr3",
      "text": "Unnecessary to consider blending into hotchpot as election issue resolves in respondent's favour.",
      "addresses_issue": "i2",
      "key_observation": "Property remains joint family property."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "No election by Pallaniappa; even if any, does not bind adopted son whose interest is independent; properties remain joint family property.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Halsbury's Laws of England, Third Edition, Vol. 14, p. 588, para 1091",
      "citation": null,
      "treatment": "referred",
      "relevance": "Explains doctrine of election: legatee must choose between own property and benefits under will."
    },
    {
      "case_name": "Mulla's Hindu Law, Thirteenth Edition, p. 249, para 223",
      "citation": null,
      "treatment": "followed",
      "relevance": "Share on partition of ancestral property is ancestral as regards male issues."
    },
    {
      "case_name": "Mulla's Hindu Law, Thirteenth Edition, p. 251, para 224",
      "citation": null,
      "treatment": "followed",
      "relevance": "Son takes interest in ancestral property by birth, independent of father."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Succession Act, 1925",
      "sections": [
        "Section 180"
      ],
      "relevance": "Enunciates doctrine of election; does not apply as no choice required."
    },
    {
      "name": "Hindu Succession Act, 1956",
      "sections": [],
      "relevance": "Came into force before Pallaniappa's death."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court upholds High Court and trial court decrees; respondent entitled to two-thirds share as joint family property; appeal by special leave dismissed.",
    "relief_granted": "Preliminary decree for partition confirming two-thirds share to respondent, one-sixth each to appellant and Nachiammai's representative.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"election under s. 180 would only arise where the legatee derives some benefit from the will to which he would not be entitled except for the will.\"",
      "speaker": "court",
      "significance": "Core reasoning why no election applies."
    },
    {
      "text": "\"the right which the son takes at his birth in the ancestral property is wholly independent of his father.\"",
      "speaker": "court",
      "significance": "Explains adopted son's independent interest."
    },
    {
      "text": "\"A father cannot turn joint family property into absolute property of his son by merely making a will.\"",
      "speaker": "court",
      "significance": "Will does not alter property character."
    }
  ],
  "_case_id": "1967_110",
  "_label": 0,
  "_text_length": 13950,
  "_extracted_at": "2026-02-10T20:21:18.111874"
}