{
  "metadata": {
    "case_name": "Commissioner of Income-tax v. Dewas Cine Corporation",
    "case_year": 1966,
    "court": "Supreme Court of India",
    "judges": [
      "Shah, J."
    ],
    "case_number": "Civil Appeal No. 2163 of 1966",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "S.G. Sanghi and Hari Prasad entered into an agreement to carry on business in partnership as exhibitors of cinematograph films in the name and style of Dewas Cine Corporation with effect from March 1, 1947.",
      "type": "background",
      "date": "1947-03-01",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Each partner who was an owner of a cinematograph theatre brought his theatre into the books of the partnership as an asset of the partnership.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "For the assessment years 1950-51 to 1952-53 the Income-tax Officer allowed depreciation aggregating to Rs. 44,380/- in respect of the two theatres.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The partnership was dissolved on September 30, 1951.",
      "type": "procedural",
      "date": "1951-09-30",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "On dissolution it was agreed between the partners that the theatres should be returned to their original owners.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "In the books of account maintained by the partnership, the assets were shown as taken over on October 1, 1951 at the original price less the depreciation allowed the depreciation being equally divided between the two partners.",
      "type": "material",
      "date": "1951-10-01",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "In proceedings for assessment for the year 1952-53 the respondent was treated as a registered firm.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "The Appellate Tribunal held that by restoring the two theatres to the two original owners there was a transfer by the firm and the entries adjusting the depreciation and writing off the assets at the original value amounted to total recoupment of the entire depreciation by the partnership and on that account proviso 2 to s. 10(2)(vii) of the Income-tax Act, 1922, applied.",
      "type": "disputed",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "The High Court of Madhya Pradesh answered the following question referred to it by the Tribunal in the negative: Whether on the facts and in the circumstances of the case, the amount of Rs. 44,380/- was rightly included in the total income of the assessee in the year 1952-53 under the second proviso to s. 10(2)(vii) of the Income-tax Act?",
      "type": "procedural",
      "date": "1964-04-15",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "The Commissioner of Income-tax has appealed to this Court with certificate granted by the High Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Appeal from the judgment and order dated April 15, 1964 of the Madhya Pradesh High Court in Misc. Civil Case No. 22 of 1963.",
      "type": "procedural",
      "date": "1964-04-15",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether on the facts and in the circumstances of the case, the amount of Rs. 44,380/- was rightly included in the total income of the assessee in the year 1952-53 under the second proviso to s. 10(2)(vii) of the Income-tax Act?",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The Income-tax Appellate Tribunal held that since the theatres were returned to the partners in settling the accounts of the partners on dissolution, the theatres were in law sold to the partners.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": "proviso 2 to s. 10(2)(vii) of the Income-tax Act, 1922"
    },
    {
      "id": "pa2",
      "text": "Each partner is entitled to have the assets of the partnership sold for discharging the debts and obligations of the partnership, and for the purpose of dividing the residue among the partners if property is allotted to the partners in satisfaction of their claims, the transaction must be deemed in law to take the form of a notional sale of the property to the partner in consideration of the money value of his share.",
      "supporting_facts": [
        "f5",
        "f6"
      ],
      "legal_basis": "Lindley on Partnership, 12th Edn., at p. 568; Addanki Narayanappa and another v. Bhaskara Krishnappa and others"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The High Court disagreed with the Tribunal's view that the theatres were in law sold to the partners.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Under the Partnership Act, 1932, property which is brought into the partnership by the partners when it is formed or which may be acquired in the course of the business becomes the property of the partnership and a partner is, subject to any special agreement between the partners, entitled upon dissolution to a share in the money representing the value of the property.",
      "addresses_issue": "i1",
      "key_observation": "When the two partners brought in the theatres of their respective ownership into the partnership, the theatres must be deemed to have become the property of the partnership."
    },
    {
      "id": "cr2",
      "text": "Under s. 46 of the Partnership Act, 1932, on the dissolution of the firm every partner or his representative is entitled, as against all the other partners or their representatives, to have the property of the firm applied in payment of the debts and liabilities of the firm, and to have the surplus distributed among the partners or their representatives according to their rights.",
      "addresses_issue": "i1",
      "key_observation": "Section 48 of the Partnership Act provides for the mode of settlement of accounts between the partners."
    },
    {
      "id": "cr3",
      "text": "The distribution of surplus is for the purpose of adjustment of the rights of the partners in the assets of the partnership it does not amount to transfer of assets.",
      "addresses_issue": "i1",
      "key_observation": "On dissolution of the partnership, each theatre must be deemed to be returned to the original owner, in satisfaction partially or wholly of his claim to a share in the residue of the assets after discharging the debts and other obligations. But thereby the theaters were not in law sold by the partnership to the individual partners in consideration of their respective share in the residue."
    },
    {
      "id": "cr4",
      "text": "The expressions sale and sold are not defined in the Income-tax Act--those expressions are used in s. 10(2)(vii) in their ordinary meaning. Sale, according to its ordinary meaning is a transfer of property for a price, and adjustment of the rights of the partners in a dissolved firm is not a transfer, nor it is for a price.",
      "addresses_issue": "i1",
      "key_observation": "Section 10(2) of the Income-tax Act permits certain allowances to be debited in the computation of profits or gains of the business, profession or vocation carried on by the assessee in the year of account one such allowance is prescribed by cl. (vii), the material part of which is in respect of any such building, machinery or plant which has been sold or discarded or demolished or destroyed, the amount by which the written down value thereof exceeds the amount for which the building, machinery or plant, as the case may be, is actually sold or its scrap value Provided that-- Provided further that where the amount for which any such building, machinery or plant is sold, whether during the continuance of the business or after the cessation thereof, exceeds the written down value, so much of the excess as does not exceed the difference between the original cost and the written down value shall be deemed to be profits of the previous year in which the sale took place."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Restoration of theatres to original owners on dissolution does not amount to a sale under s.10(2)(vii) of Income-tax Act, 1922, as distribution of partnership assets is adjustment of partners' rights, not a transfer for a price.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Addanki Narayanappa and another v. Bhaskara Krishnappa and others",
      "citation": null,
      "treatment": "referred",
      "relevance": "Cited by Revenue to support notion of sale on dissolution"
    }
  ],
  "statutes_cited": [
    {
      "name": "Income-tax Act, 1922",
      "sections": [
        "s. 10(2)(vii)"
      ],
      "relevance": "Second proviso applies to sale of assets where sale price exceeds written down value, deeming excess as profits"
    },
    {
      "name": "Partnership Act, 1932",
      "sections": [
        "s. 46",
        "s. 48"
      ],
      "relevance": "Governs dissolution, settlement of accounts, and distribution of assets without constituting a sale"
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court upheld the High Court's view that there was no sale of the theatres upon dissolution, hence Rs. 44,380/- not includible in income under second proviso to s.10(2)(vii).",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "Sale, according to its ordinary meaning is a transfer of property for a price, and adjustment of the rights of the partners in a dissolved firm is not a transfer, nor it is for a price.",
      "speaker": "court",
      "significance": "Defines why no 'sale' occurred under Income-tax Act"
    },
    {
      "text": "The distribution of surplus is for the purpose of adjustment of the rights of the partners in the assets of the partnership it does not amount to transfer of assets.",
      "speaker": "court",
      "significance": "Core reasoning rejecting Revenue's notional sale argument"
    }
  ],
  "_case_id": "1967_222",
  "_label": 0,
  "_text_length": 6572,
  "_extracted_at": "2026-02-10T20:23:16.077947"
}