{
  "metadata": {
    "case_name": "Harnam Singh v. Ishar Singh & Ors.",
    "case_year": 1966,
    "court": "Supreme Court of India",
    "judges": [
      "Bhargava, J."
    ],
    "case_number": "Civil Appeal No. 1377 of 1966",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Gurdwara Jhandawala, also known as Guru Granth Sahib Dera Bhai Saida Ram, managed by Mahant Harnam Singh as Mohatmim, in possession of Dera and agricultural land.",
      "type": "background",
      "date": null,
      "source": "respondents"
    },
    {
      "id": "f2",
      "text": "Institution existed before residents donated property; initially known as Guru Granth Sahib Dera Bhai Saida Ram with Bhai Saida Ram as Mahant.",
      "type": "background",
      "date": null,
      "source": "respondents"
    },
    {
      "id": "f3",
      "text": "On February 19, 1904, Shamilat land (92 bighas 12 biswas) donated by inferior proprietors of village Jhandawala to the Dera; confirmed by mutation on July 1, 1905.",
      "type": "material",
      "date": "1904-02-19",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Mahant Mehtab Singh Sadh Nirmala succeeded, then his Chela Mahant Narain Singh.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "On July 20, 1926, Mahant Narain Singh executed will bequeathing rights in Dera to his Chela Harnam Singh (appellant).",
      "type": "material",
      "date": "1926-07-20",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Gurdwara constructed over 8 kanals 17 marlas of donated land.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Suit instituted on September 21, 1953 under s.92 CPC by two plaintiffs (Ishar Singh and another) after permission from Advocate-General; Ishar Singh died, LRs brought on record.",
      "type": "procedural",
      "date": "1953-09-21",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Allegations against appellant: abduction of women, harbouring dacoits, malversation of trust income, closure of Langar, stoppage of religious activities, immoral acts.",
      "type": "disputed",
      "date": null,
      "source": "respondents"
    },
    {
      "id": "f9",
      "text": "Plaintiffs are Lambardars and residents of village Jhandawala, Sikhs by religion; claimed as representatives of land owners and residents.",
      "type": "admitted",
      "date": null,
      "source": "respondents"
    },
    {
      "id": "f10",
      "text": "District Judge dismissed suit: public religious trust exists, but plaintiffs lack interest under s.92 CPC, failed to prove misconduct.",
      "type": "procedural",
      "date": "1962-09-07",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Punjab High Court (Regular First Appeal No. 29 P of 1956) set aside dismissal, decreed suit, removed appellant as Mahant.",
      "type": "procedural",
      "date": "1962-09-07",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "All Mahants from Bhai Saida Ram to Harnam Singh were Sadh Nirmalas; institution registered as branch of Panchayati Akhara at Kankhal near Hardwar; worship includes Samadh.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Langar provided free kitchen to visitors, not specifically to village residents as of right.",
      "type": "background",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether plaintiffs-respondents had sufficient interest in the public trust to institute suit under s.92 CPC as representatives of land owners/residents of village Jhandawala or as Sikhs.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether Nirmala Sadhus are Sikhs such that Sikh plaintiffs have interest in the institution.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Plaintiffs-respondents had no such interest in the public trust as would entitle them to institute suit under s.92 CPC; merely Lambardars and residents insufficient; no proof they are successors of donors.",
      "supporting_facts": [
        "f9",
        "f13"
      ],
      "legal_basis": "Section 92 CPC; T.R. Ramachandra Ayyar v. Parameswaran Unni; Vaidyanatha Ayyar v. Swaminatha Ayyar (PC)"
    },
    {
      "id": "pa2",
      "text": "Institution not a Sikh Gurdwara; Nirmala Sadhus are not Sikhs.",
      "supporting_facts": [
        "f12"
      ],
      "legal_basis": "Kirpa Singh v. Ajaipal Singh; historical texts and census reports"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Gurdwara established as public trust by village residents; plaintiffs as representatives of land owners and residents have interest; villagers donated nucleus land.",
      "supporting_facts": [
        "f1",
        "f3",
        "f9"
      ],
      "legal_basis": "Section 92 CPC"
    },
    {
      "id": "ra2",
      "text": "Institution is Sikh Gurdwara for Sikhs; Nirmala Sadhus are section of Sikhs; plaintiffs as Sikhs have interest.",
      "supporting_facts": [
        "f9",
        "f12"
      ],
      "legal_basis": null
    },
    {
      "id": "ra3",
      "text": "Appellant indulged in activities justifying removal: abduction, harbouring dacoits, misuse of funds, etc.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Plaintiffs not proven as inferior owners or successors of 1904 donors; Lambardars/residents lack specific interest; mere residence and Langar for visitors insufficient.",
      "addresses_issue": "i1",
      "key_observation": "Interest must be clear and specific, not general religious or remote village interest."
    },
    {
      "id": "cr2",
      "text": "Nirmala Sadhus originated from Sikhs but deviated over 300 years; follow Vedanta, worship Samadhs, akin to Udasis; treated as Hindus in some areas including Faridkot; not Sikhs.",
      "addresses_issue": "i2",
      "key_observation": "Historical texts, census, precedents show Nirmalas distinct from Sikhs."
    },
    {
      "id": "cr3",
      "text": "Suit not properly instituted for lack of interest under s.92 CPC; no need to decide on misconduct.",
      "addresses_issue": "i1",
      "key_observation": "Object of s.92 is to prevent interference without real interest."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Plaintiffs lack requisite interest under s.92 CPC to institute suit.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Nirmala Sadhus are not Sikhs; institution not Sikh Gurdwara.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "T.R. Ramachandra Ayyar v. Parameswaran Unni",
      "citation": "I.L.R. 42 Mad. 360",
      "treatment": "followed",
      "relevance": "Interest required under s.92 CPC must be specific, not mere religious affiliation."
    },
    {
      "case_name": "Vaidyanatha Ayyar v. Swaminatha Ayyar",
      "citation": "51 I.A. 282",
      "treatment": "followed",
      "relevance": "Approved view that bare religious interest insufficient; prevents suits without real interest."
    },
    {
      "case_name": "Kirpa Singh v. Ajaipal Singh",
      "citation": "I.L.R. II Lah. 142",
      "treatment": "followed",
      "relevance": "Nirmala Sadhus not Sikhs, detailed analysis of history and texts."
    },
    {
      "case_name": "Hem Singh v. Basant Das",
      "citation": "63 I.A. 180",
      "treatment": "followed",
      "relevance": "Udasis not Sikhs despite using Sikh scriptures."
    },
    {
      "case_name": "Shiromani Gurdwara Parbandhak Committee v. Ram Parshad",
      "citation": null,
      "treatment": "referred",
      "relevance": "Udasis are schismatics, not Sikhs."
    },
    {
      "case_name": "Bawa Ishar Das v. Dr. Mohan Singh",
      "citation": "A.I.R. 1939 Lah. 239",
      "treatment": "followed",
      "relevance": "Udasi institutions not Sikh Gurdwaras despite reading Granth Sahib."
    }
  ],
  "statutes_cited": [
    {
      "name": "Code of Civil Procedure",
      "sections": [
        "Section 92"
      ],
      "relevance": "Governs institution of suits against public trusts; requires plaintiff to have interest in trust."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; High Court decree set aside; District Judge's decree dismissing suit restored, as plaintiffs lacked interest under s.92 CPC to institute the suit.",
    "relief_granted": "Restoration of District Judge's decree dismissing suit; appellant retains office of Mahant.",
    "costs": "With costs."
  },
  "key_quotes": [
    {
      "text": "\"to entitle him to sue under s. 92, C.P.C., it is not enough that the plaintiff is a Hindu by religion, but he must have a clear interest in the particular trust over and above that which millions of his countrymen may be said to have by virtue of their religion\"",
      "speaker": "court",
      "significance": "Defines requisite interest under s.92 CPC."
    },
    {
      "text": "\"Nirmalas were only nominally Sikhs.\"",
      "speaker": "court",
      "significance": "From Macauliffe, key to holding Nirmalas not Sikhs."
    },
    {
      "text": "\"the Udasis, so far as the matter can be decided by beliefs and practices, are, from the point of view of Sikhs, schismatics who separated in the earliest days of the movement\"",
      "speaker": "court",
      "significance": "Privy Council view applied analogously to Nirmalas."
    }
  ],
  "_case_id": "1967_234",
  "_label": 1,
  "_text_length": 21775,
  "_extracted_at": "2026-02-10T20:23:16.916525"
}