{
  "metadata": {
    "case_name": "Partnership Firm v. Commercial Tax Officer",
    "case_year": 1966,
    "court": "Supreme Court of India",
    "judges": [
      "Ramaswami, J."
    ],
    "case_number": "Civil Appeal No. 2176 of 1966",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The appellant is a partnership firm carrying business in bamboos, timber and firewood at Gokavaram in the State of Andhra Pradesh.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The firm had been registered as a dealer under the Andhra Pradesh General Sales Tax Act No. VI of 1957.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "For the assessment year 1962-63, the appellant submitted a return showing a gross turnover of Rs. 13,89,130.70 P and claimed exemption on a turnover of Rs. 13,68,174.39 P which according to the appellant represented the amount of sales effected by its commission agents and sales of firewood.",
      "type": "material",
      "date": "1962-63",
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "By a notice dated November 28, 1963, the Commercial Tax Officer, Rajahmundry called upon the appellant to show cause as to why it should be assessed for the year 1962-63 on a turnover of Rs. 13,89,130.70 P at 2 per cent. Eleven items were comprised in the notice.",
      "type": "procedural",
      "date": "1963-11-28",
      "source": "respondent"
    },
    {
      "id": "f5",
      "text": "Item No 1, relating to a turnover of Rs. 96,527.10 P was under the firewood account. It was alleged by the appellant that it paid the single point tax at 2 per cent to the Forest Department on the amounts for which the forest goods were taken in auction.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "As regards items 2 to 11 the appellant claimed exemption on the ground that its agents, Messrs. Kusuma Arjayya and Batlanki Veera Venkayya, Rajahmundry, paid the tax.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "The case of the appellant was that it sent goods for sale to its commission agents and under the contract of agency the commission agents were empowered to pay sales-tax and had paid the same directly to the Sales Tax Department.",
      "type": "admitted",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "In accordance with the usual commercial practice the commission agents collected Dharmam on the sales conducted by them and appropriated those collections for charitable purposes.",
      "type": "material",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "The commission agents furnished accounts to the appellant but in these accounts the amounts collected towards sales-tax and Dharmam were not specifically shown as it was understood between the parties that the amounts collected towards sales tax would be remitted to the Sales Tax Department and the amounts collected towards Dharmam would be credited to the charity account of the commission agents and suitably utilised by them.",
      "type": "material",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f10",
      "text": "Aggrieved by the assessment notice of the respondent disallowing its claim for exemption the appellant-firm filed a writ petition No. 1404 of 1963 dated December 7, 1963 before the High Court of Andhra Pradesh under Art. 226 of the Constitution praying for the grant of a writ in the nature of certiorari calling for the records relating to sales-tax assessments of the appellant for the year 1962-63 and quashing the notice dated November 28, 1963 issued by the respondent.",
      "type": "procedural",
      "date": "1963-12-07",
      "source": "petitioner"
    },
    {
      "id": "f11",
      "text": "By its judgment dated April 16, 1964 the High Court dismissed the writ petition.",
      "type": "procedural",
      "date": "1964-04-16",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "This appeal is brought by a certificate granted by the High Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether Explanation III to s. 2(1)(n) of the Andhra Pradesh General Sales Tax Act, 1957 enlarged the scope of the word 'sale' and by means of a fiction converted what are not sales in law into taxable sales, and is therefore ultra vires of the powers of the State Legislature under Entry 48 in List II of Sch. VII of the Constitution.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether the appellant was liable to be assessed to tax again on items Nos. 2 to 11 where the commission agents had already paid the sales-tax.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether the third Explanation to s. 2(1)(n) of the Act violated the guarantee under Art. 14 of the Constitution.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Explanation III to s. 2(1)(n) of the Act enlarged the scope of the word sale and by means of a fiction converted what are not sales in law into taxable sales for the purpose of the Act, and therefore, the Explanation was ultra vires of the powers of the State Legislature which had no legislative competence to impose a tax under Entry 48 in List II of Sch. VII of the Constitution.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "Section 2(1)(n) Explanation III, Andhra Pradesh General Sales Tax Act, 1957; Entry 48 List II Sch. VII Constitution; Indian Sale of Goods Act, 1930"
    },
    {
      "id": "pa2",
      "text": "In any event items Nos. 2 to 11 of the notice related to goods which the appellant had sent for sale to the commission agents and as the latter had already paid the sales-tax the appellant was not liable to be assessed to tax again on the same transaction as there was only one sale.",
      "supporting_facts": [
        "f6",
        "f7"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "The third Explanation to s. 2(1)(n) of the Act violated the guarantee under Art. 14 of the Constitution since the classification contemplated, i.e., sales through commission agents who account fully for all collections made and sales through commission agents who do not account for collections, was not made on any intelligible differentia and had no rational relationship to the purpose of the statute.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": "Article 14 Constitution"
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The real object of the Explanation is to prevent the misuse by the assessee of the relationship of principal and agent for the purpose of evading tax. The real effect of the third Explanation is to impose the tax only when there was a transfer of title to the goods and not where there is a mere contract of agency.",
      "addresses_issue": "i1",
      "key_observation": "The phrase 'when the goods are transferred' in cls. (1) and (2) of Explanation III means when title to the goods is transferred and so construed it is impossible to say that the Explanation enlarges the scope of the main section."
    },
    {
      "id": "cr2",
      "text": "As a matter of law there is a distinction between a contract of sale and a contract of agency by which the agent is authorised to sell or buy on behalf of the principal and make over either the sale proceeds or the goods to the principal. The true relationship of the parties in each case has to be gathered from the nature of the contract, its terms and conditions, and the terminology used by the parties is not decisive of the legal relationship.",
      "addresses_issue": "i2",
      "key_observation": "The question as to whether the transactions in the present case are sales or contracts of agency is a mixed question of fact and law and must be investigated with reference to the material which the appellant might be able to place before the appropriate authority. The question is not one which can properly be determined in an application for a writ under Art. 226 of the Constitution."
    },
    {
      "id": "cr3",
      "text": "The classification is based upon an intelligible differentia and it has a rational relationship with the object sought to be achieved by the statute.",
      "addresses_issue": "i3",
      "key_observation": "There is no substance in this argument."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Explanation III to s. 2(1)(n) does not enlarge the scope of 'sale' but deems two independent sales where there is transfer of title from principal to agent and agent to purchaser, to prevent tax evasion.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Whether transactions are sales or agency contracts is a mixed question of fact and law to be determined by the assessing authority, not in writ proceedings.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Explanation III does not violate Article 14 as the classification has intelligible differentia and rational nexus to the statute's object.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "State of Madras v. Gannon Dunkerley Co. (Madras) Ltd.",
      "citation": "9 S.T.C. 353",
      "treatment": "followed",
      "relevance": "Expression 'sale of goods' in Entry 48 List II must be interpreted in legal sense as per Sale of Goods Act, requiring agreement to sell, money consideration, and passing of title."
    },
    {
      "case_name": "W. T. Lamb and Sons v. Goring Brick Company Limited",
      "citation": "1932 K.B. 710",
      "treatment": "followed",
      "relevance": "Agreement appointing sole selling agents held to be vendor-purchaser, not principal-agent, based on nature of contract."
    },
    {
      "case_name": "Hutton v. Lippert",
      "citation": "1883 8 A.C. 309",
      "treatment": "followed",
      "relevance": "Contract purported as guarantee or agency held to be sale based on construction; terminology not decisive."
    }
  ],
  "statutes_cited": [
    {
      "name": "Andhra Pradesh General Sales Tax Act, 1957",
      "sections": [
        "Section 2(1)(n)",
        "Explanation III"
      ],
      "relevance": "Defines 'sale'; Explanation III deems two sales in principal-agent transfers where agent sells at one rate and passes lower rate to principal or fails to account fully, to prevent evasion."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 226",
        "Article 14",
        "Entry 48 List II Sch. VII"
      ],
      "relevance": "Writ jurisdiction; equality; state power to tax sales."
    },
    {
      "name": "Indian Sale of Goods Act, 1930",
      "sections": [],
      "relevance": "Legal definition of sale adopted for constitutional entry."
    },
    {
      "name": "Government of India Act, 1935",
      "sections": [
        "Entry 48 List II Sch. VII"
      ],
      "relevance": "Precedent on interpretation of 'sale of goods'."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court held that the High Court judgment was right and dismissed the appeal, upholding the assessment notice and rejecting challenges to Explanation III under sales tax law and Articles 14 and legislative competence.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The real object of the Explanation is to prevent the misuse by the assessee of the relationship of principal and agent for the purpose of evading tax.",
      "speaker": "court",
      "significance": "Explains purpose of Explanation III."
    },
    {
      "text": "The true relationship of the parties in each case has to be gathered from the nature of the contract, its terms and conditions, and the terminology used by the parties is not decisive of the legal relationship.",
      "speaker": "court",
      "significance": "Distinguishes sale from agency based on substance."
    },
    {
      "text": "It is therefore impossible to accept the contention put forward on behalf of the appellant that the Explanation has converted what, in fact, is not a sale into a sale for the purpose of assessment to sales-tax.",
      "speaker": "court",
      "significance": "Rejects ultra vires challenge."
    }
  ],
  "_case_id": "1967_95",
  "_label": 0,
  "_text_length": 14104,
  "_extracted_at": "2026-02-10T20:20:45.900939"
}