{
  "metadata": {
    "case_name": "Bank v. Workman",
    "case_year": 1966,
    "court": "Supreme Court of India",
    "judges": [
      "Vaidialingam, J."
    ],
    "case_number": "Civil Appeal No. 440 of 1966",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Respondent was Assistant Accountant at main Office of the Bank at Calcutta.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Bank noticed serious irregularities in respondent's work in Current Accounts Department, particularly in current account ledgers Nos. 4 and 6.",
      "type": "material",
      "date": null,
      "source": "bank"
    },
    {
      "id": "f3",
      "text": "By order dated March 8, 1961, respondent was suspended with immediate effect and informed charges would be communicated.",
      "type": "procedural",
      "date": "1961-03-08",
      "source": "bank"
    },
    {
      "id": "f4",
      "text": "By communication dated March 13/14, 1961, respondent required to explain four allegations: overdrafts allowed in ledger Nos. 4 (Messrs. Commercial Bureau) and 6 (Messrs. Evergreen Paper Syndicate and Messrs. Gokul Chand Radharam) without sanction; failed to bring irregularities to notice; pass-book of ledger No. 4 missing.",
      "type": "material",
      "date": "1961-03-13",
      "source": "bank"
    },
    {
      "id": "f5",
      "text": "Respondent replied on March 17, 1961, admitting granting temporary overdrafts in good faith without reference to higher authorities, calling it a blunder; believed credit-worthiness due to long association and prior overdrafts; no financial loss to Bank; admitted negligence; not his duty to report debit balances or responsible for missing pass-book; expressed regret and sought excuse.",
      "type": "admitted",
      "date": "1961-03-17",
      "source": "respondent"
    },
    {
      "id": "f6",
      "text": "Bank issued charge-sheet on June 3, 1961, mainly on overdrafts without permission; informed of enquiry on June 20, 1961.",
      "type": "procedural",
      "date": "1961-06-03",
      "source": "bank"
    },
    {
      "id": "f7",
      "text": "Respondent replied on July 11, 1961 to charge-sheet, again admitting blunder in allowing overdrafts without reference, in good faith; no loss to Bank; negligence but bona fide; not his duty for figures; pleaded 20 years service, sought excuse.",
      "type": "admitted",
      "date": "1961-07-11",
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "Enquiry on June 20, 1961 by Agent (Inquiry Officer): Respondent examined first, admitted understanding charge-sheet, nothing more to add to explanation; admitted blunder of Rs. 87,000 advances without reference; no cheque initialled by Mr. Bhatena traced; declined to cross-examine three other officers; questioned Mr. Bhatena and Mr. Savkar, no further questions; appealed for sympathy admitting omission.",
      "type": "procedural",
      "date": "1961-06-20",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Inquiry Officer report dated November 10, 1961: Found guilty of main charges (admitted); exonerated on minor charges; offence serious meriting dismissal but recommended discharge considering service and no loss.",
      "type": "procedural",
      "date": "1961-11-10",
      "source": "inquiry_officer"
    },
    {
      "id": "f10",
      "text": "Bank discharged respondent by letter June 27, 1962, with pay-order for Rs. 472.70 for July 1962 wages.",
      "type": "procedural",
      "date": "1962-06-27",
      "source": "bank"
    },
    {
      "id": "f11",
      "text": "Respondent representation dated July 11, 1962 to Managing Director: Admitted fault, no loss, sought mercy and reinstatement; did not attack enquiry or findings.",
      "type": "admitted",
      "date": "1962-07-11",
      "source": "respondent"
    },
    {
      "id": "f12",
      "text": "Managing Director rejected on September 17, 1962.",
      "type": "procedural",
      "date": "1962-09-17",
      "source": "bank"
    },
    {
      "id": "f13",
      "text": "Pending industrial dispute, Bank applied to National Industrial Tribunal on March 17, 1962 under s.33(2) for approval; transferred to Central Labour Court, Dhanbad on April 18, 1962.",
      "type": "procedural",
      "date": "1962-03-17",
      "source": "bank"
    },
    {
      "id": "f14",
      "text": "Respondent objections dated September 2, 1963 before Labour Court: First time claimed advice led to admitting guilt; overdrafts per oral orders by Agent/Superintendent; not allowed Union representation or cross-examination.",
      "type": "disputed",
      "date": "1963-09-02",
      "source": "respondent"
    },
    {
      "id": "f15",
      "text": "Labour Court order dated May 13, 1964: Rejected approval; enquiry not fair, violated natural justice (examined first and cross-examined; no cross-exam; no Union); but complied with s.33(2)(b) proviso.",
      "type": "procedural",
      "date": "1964-05-13",
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the domestic enquiry conducted by the Bank against the respondent was fair and in compliance with principles of natural justice.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether approval should be granted under s.33(2)(b) of the Industrial Disputes Act, 1947.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Domestic enquiry was fair; respondent admitted guilt at all stages; was given opportunities to explain and cross-examine but declined; no violation of natural justice.",
      "supporting_facts": [
        "f5",
        "f7",
        "f8",
        "f11"
      ],
      "legal_basis": "Principles of natural justice as laid down by Supreme Court"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Enquiry violated natural justice: examined first and cross-examined to substantiate charges; not allowed to cross-examine witnesses; not allowed Union assistance.",
      "supporting_facts": [
        "f14"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Labour Court erred on cross-examination and Union assistance: respondent put questions to witnesses Bhatena and Savkar, stated no further questions; declined to cross-examine others; no request for Union representation.",
      "addresses_issue": "i1",
      "key_observation": "Record shows opportunities given and declined."
    },
    {
      "id": "cr2",
      "text": "Examining respondent first not violation when he admitted guilt at all stages; no need for management evidence if guilt admitted; questions gave opportunity to explain/mitigate, not inquisition.",
      "addresses_issue": "i1",
      "key_observation": "Admission of guilt makes further evidence empty formality; distinguished Associated Cement where denial existed."
    },
    {
      "id": "cr3",
      "text": "Rules of natural justice: if denial, management proves first; if admission, can examine workman first for explanation; still allow cross-exam etc. if witnesses called.",
      "addresses_issue": "i1",
      "key_observation": "No violation in this case."
    },
    {
      "id": "cr4",
      "text": "Labour Court correctly held compliance with s.33(2)(b) proviso.",
      "addresses_issue": "i2",
      "key_observation": "Action part of same transaction."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Domestic enquiry was fair, no violation of natural justice principles; Labour Court order erroneous.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Approval under s.33(2)(b) granted by setting aside Labour Court order.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Strawboard Manufacturing Co. v. Gobind",
      "citation": "1962 Supp. 3 S.C.R. 618",
      "treatment": "followed",
      "relevance": "Compliance with proviso to s.33(2)(b) as part of same transaction."
    },
    {
      "case_name": "Associated Cement Co. Ltd. v. Workmen",
      "citation": "1964 3 S.C.R. 652",
      "treatment": "distinguished",
      "relevance": "Not fair to cross-examine employee first if denying charges; but inapplicable here due to admission."
    }
  ],
  "statutes_cited": [
    {
      "name": "Industrial Disputes Act, 1947",
      "sections": [
        "s. 33(2)(b)"
      ],
      "relevance": "Application for approval of discharge during pending dispute; proviso compliance held satisfied."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Supreme Court allowed the appeal by special leave, set aside the Labour Court's order dated May 13, 1964 refusing approval, held domestic enquiry fair and compliant with natural justice, granted approval to the Bank's action of discharging the respondent.",
    "relief_granted": "Approval of discharge granted",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "When once the workman himself has, in answer to the charge levelled against him, admitted his guilt, in our opinion, there will be nothing more for the management to enquire into.",
      "speaker": "court",
      "significance": "Core holding on natural justice when guilt admitted."
    },
    {
      "text": "It seems to us that it is not fair in domestic enquiries against industrial employees that at the very commencement of the enquiry, the employee should be closely cross-examined, even before any other evidence is led against him.",
      "speaker": "court",
      "significance": "Quote from Associated Cement distinguished."
    }
  ],
  "_case_id": "1967_149",
  "_label": 1,
  "_text_length": 23419,
  "_extracted_at": "2026-02-10T20:22:03.169093"
}