{
  "metadata": {
    "case_name": "State of Maharashtra v. Respondents (Members of Editorial Board of Maharashtra Weekly)",
    "case_year": 1965,
    "court": "Supreme Court of India",
    "judges": [
      "Hidayatullah, J."
    ],
    "case_number": "Criminal Appeal No. 11 of 1965",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Public Prosecutor, West Khandesh, Dhulia filed complaint with previous sanction of State Government against four persons, members of Editorial Board of Marathi Weekly named Maharashtra, under S. 500 IPC.",
      "type": "material",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f2",
      "text": "In issue of Maharashtra dated October 30, 1959, article published tending to defame M. A. Deshmukh, I.A.S., Collector and District Magistrate, West Khandesh, in respect of his conduct in discharge of public functions.",
      "type": "material",
      "date": "1959-10-30",
      "source": "prosecution"
    },
    {
      "id": "f3",
      "text": "Weekly Maharashtra registered as newspaper; declaration in Form 1 under Art. 3 of Press and Registration of Books Act, 1867 filed by Sudhakar Gopal Madane describing himself as editor, printer and publisher.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Particular copy of Maharashtra containing defamatory article bore name of Madane as editor, printer and publisher; front page showed Editorial Board consisting of three respondents and Madane the Editor.",
      "type": "material",
      "date": "1959-10-30",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Additional Sessions Judge, Dhulia, by order dated October 26, 1963, held respondents 2, 3 and 4 could be charged with Editor as Members of Editorial Board; prima facie case based on admissions; prosecution to prove they were Editors, Printers, Publishers.",
      "type": "procedural",
      "date": "1963-10-26",
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "Respondents 2, 3 and 4 filed Criminal Revision Application No. 17 of 1964 before Bombay High Court.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f7",
      "text": "Learned Single Judge of Bombay High Court, by judgment and order dated April 15, 1964, discharged respondents; relied on Madane's statement under S. 342 CrPC that he wrote the article; newspaper showed Madane as Editor; no other competent evidence.",
      "type": "procedural",
      "date": "1964-04-15",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Madane admitted he wrote the alleged defamatory article.",
      "type": "admitted",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f9",
      "text": "State of Maharashtra filed appeal by special leave to Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether Members of the Editorial Board other than the Editor can be prosecuted for the defamatory article.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether statement under S. 342 CrPC of accused No. 1 (Madane) can be treated as evidence exonerating the respondents.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether presumption under S. 7 of Press and Registration of Books Act, 1867 can be raised against the Editorial Board members.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Learned Single Judge of High Court wrong in treating statement under S. 342 CrPC of Madane as evidence exonerating present respondents.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "S. 342 CrPC"
    },
    {
      "id": "pa2",
      "text": "Presumption under S. 7 of Press and Registration of Books Act, 1867 can be raised against Editorial Board, holding them responsible for defamatory article.",
      "supporting_facts": [
        "f3",
        "f4"
      ],
      "legal_basis": "S. 7, Press and Registration of Books Act, 1867"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "No evidence establishing they were Editors, Printers or Publishers; only members of Editorial Board; Madane solely responsible as declared editor.",
      "supporting_facts": [
        "f3",
        "f4",
        "f7",
        "f8"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Statement under S. 342 CrPC of accused not strictly evidence; no oath administered; only becomes evidence if accused offers under S. 342-A.",
      "addresses_issue": "i2",
      "key_observation": "First argument of State is correct but matter not to be decided solely on whether statement could be read as evidence."
    },
    {
      "id": "cr2",
      "text": "S. 7 Press Act raises presumption against person named in declaration or printed as editor on newspaper copy; editor defined as person who controls selection of matter published.",
      "addresses_issue": "i3",
      "key_observation": "Presumption attaches to Madane as name printed as Editor and in declaration; he selected material."
    },
    {
      "id": "cr3",
      "text": "No presumption against others who did not declare as editors; no concern with publishing the article; fair to discharge them.",
      "addresses_issue": "i1",
      "key_observation": "Order of discharge proper; no reason to interfere."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Members of Editorial Board other than named Editor cannot be prosecuted based on presumption under S. 7 Press Act unless they are declared or printed as editor.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Presumption under S. 7 attaches only to person whose name is subscribed in declaration or printed as editor on newspaper.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "S. 500"
      ],
      "relevance": "Offence of defamation charged against accused."
    },
    {
      "name": "Press and Registration of Books Act, 1867",
      "sections": [
        "S. 7",
        "Art. 3"
      ],
      "relevance": "Presumption as to editor, printer, publisher; declaration in Form I."
    },
    {
      "name": "Code of Criminal Procedure",
      "sections": [
        "S. 342",
        "S. 342-A"
      ],
      "relevance": "Statement of accused not evidence unless offered as witness."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court dismissed the appeal by special leave, upheld the order of Bombay High Court discharging the respondents (members of Editorial Board other than Editor), finding no basis to prosecute them for the defamatory article as presumption under S. 7 Press Act applies only to the named Editor Madane.",
    "relief_granted": "Discharge of respondents upheld",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"the presumption will attach to Madane as having selected the material for publication in the newspaper.\"",
      "speaker": "court",
      "significance": "Core holding on application of S. 7 presumption to named editor only."
    },
    {
      "text": "\"No doubt under the Code of Criminal Procedure the statement of an accused may be taken into consideration in an inquiry or trial but it is not strictly evidence in the case.\"",
      "speaker": "court",
      "significance": "Clarifies status of S. 342 statement."
    },
    {
      "text": "\"The term editor is defined in the Act to mean a person who controls the selection of the matter that is published in a newspaper.\"",
      "speaker": "court",
      "significance": "Defines 'editor' for presumption under Press Act."
    }
  ],
  "_case_id": "1967_278",
  "_label": 0,
  "_text_length": 7298,
  "_extracted_at": "2026-02-10T20:23:48.880483"
}