{
  "metadata": {
    "case_name": "Ex-Jagirdar of Jagir Nevri Bhorasa v. State",
    "case_year": 1965,
    "court": "Supreme Court of India",
    "judges": [
      "Shelat, J."
    ],
    "case_number": "Civil Appeal No. 98 of 1965",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant is the ex-jagirdar of certain villages called Jagir Nevri Bhorasa.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "While the jagir was in his possession, appellant constructed roads, one of which is the road connecting Bhorasa with Dewas Astha Road, about 1 1/2 miles in length, lined on both sides with mango trees.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "In 1951, the Madhya Bharat Abolition of Jagirs Act, 28 of 1951 was passed for resumption of jagir lands; right, title and interest of appellant in jagir extinguished and lands vested in State.",
      "type": "material",
      "date": "1951",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "In 1955, Tehsildar put up mangoes grown on the said trees for public auction.",
      "type": "procedural",
      "date": "1955",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Appellant by application dated February 8, 1955 objected to auction, claiming trees planted and reared by him, constituted a grove within s.5(b)(iv) of the Act and continued to belong to him.",
      "type": "disputed",
      "date": "1955-02-08",
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "Tehsildar rejected application; appellant's appeal and revision before Board of Revenue also rejected.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Appellant filed writ petition in Madhya Pradesh High Court, Gwalior Bench, Civil Misc. Petition No. 77 of 1959, dismissed on December 7, 1961 on ground that trees could not constitute a grove.",
      "type": "procedural",
      "date": "1961-12-07",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Appellant obtained special leave and filed this appeal.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the said trees standing on the two sides of the said road can be said to be a grove within the meaning of sec. 5(b)(iv) of the Madhya Bharat Abolition of Jagirs Act, 28 of 1951.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Trees were planted and reared by appellant, constituted a grove within s.5(b)(iv) of the Act and therefore continued to belong to him.",
      "supporting_facts": [
        "f2",
        "f5"
      ],
      "legal_basis": "Section 5(b)(iv) of Madhya Bharat Abolition of Jagirs Act, 28 of 1951"
    },
    {
      "id": "pa2",
      "text": "Although trees situate on road sides, at some places there may be group or groups of trees sufficiently large in number and closely standing together to preclude that particular area from being used for cultivation or other purpose, constituting a grove.",
      "supporting_facts": [
        "f2"
      ],
      "legal_basis": "Section 5(b)(iv) of Madhya Bharat Abolition of Jagirs Act, 28 of 1951"
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Act passed for resumption of jagir-lands; sec.3 provides date of resumption, sec.4(1) consequences including vesting of trees in State; sec.5 exceptions including groves under subcl.(iv) of sec.5(b) continue to belong to jagirdar.",
      "addresses_issue": "i1",
      "key_observation": "Legislature used 'trees' in different contexts; policy to resume public-use properties but retain personal use ones."
    },
    {
      "id": "cr2",
      "text": "Grove in sec.5(b)(iv) to be understood in ordinary dictionary sense: small wood, group of trees standing together without undergrowth, affording shade, cluster not large enough for forest.",
      "addresses_issue": "i1",
      "key_observation": "Conveys compactness, group sufficient to preclude land from primary use other than grove-land."
    },
    {
      "id": "cr3",
      "text": "No requirement trees be fruit-bearing or planted by jagirdar; must be sufficient number in group; trees in file on road side for shade do not fulfil requirements.",
      "addresses_issue": "i1",
      "key_observation": "Possible some places along road have groups constituting grove; no inquiry made by authorities or High Court."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Trees standing in a file on road side intended to furnish shade would not fulfil requirements of a grove; but if at places groups sufficient in number and proximity to constitute grove, then yes under sec.5(b)(iv).",
      "resolves_issue": "i1",
      "in_favor_of": "partial"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Daropadi v. Mannu Lal",
      "citation": "A.I.R. 1929 All 557",
      "treatment": "referred",
      "relevance": "4 fruit trees on boundaries not a grove under Agra Tenancy Act."
    },
    {
      "case_name": "Kashi v. Jagoo Bai",
      "citation": "A.I.R. 1934 All 290",
      "treatment": "referred",
      "relevance": "Isolated trees not a grove."
    },
    {
      "case_name": "Shiv Sahai Hari Nandan",
      "citation": "A.I.R. 1963 All 413",
      "treatment": "followed",
      "relevance": "13 mango trees covering major part constituted grove-land despite some cultivation."
    },
    {
      "case_name": "Hasan v. State of Bombay",
      "citation": "62 Bom. L.R. 617",
      "treatment": "followed",
      "relevance": "Grove means area covered by cluster of trees planted by human agency but not forest; similar provision."
    }
  ],
  "statutes_cited": [
    {
      "name": "Madhya Bharat Abolition of Jagirs Act, 28 of 1951",
      "sections": [
        "Section 3",
        "Section 4(1)",
        "Section 5(b)(iv)",
        "Section 5(b)",
        "Section 5(c)"
      ],
      "relevance": "Provides for resumption of jagirs, vesting of trees in State except groves which continue with jagirdar."
    },
    {
      "name": "Agra Tenancy Act, 1926",
      "sections": [
        "Section 3"
      ],
      "relevance": "Definition of grove-land referred for ordinary understanding."
    },
    {
      "name": "P. Tenancy Act, 1939",
      "sections": [
        "Section 3(5)"
      ],
      "relevance": "Trees sufficient to preclude primary use other than grove-land."
    },
    {
      "name": "Madhya Pradesh Abolition of Proprietory Rights (Estates, Mahals, Alienated Lands) Act, 1 of 1951",
      "sections": [
        "Section 5(h)"
      ],
      "relevance": "Identical terms to s.5(b)(iv) for grove interpretation."
    }
  ],
  "outcome": {
    "disposition": "remanded",
    "summary": "Appeal allowed, judgment and order of High Court set aside, case remanded to High Court to decide writ petition after calling finding from Board of Revenue on whether trees at any place along road sufficient in number and proximity to constitute grove(s), with opportunity to parties for evidence.",
    "relief_granted": "Remand for inquiry and finding",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"a grove has been defined as a small wood groups of trees standing together without undergrowth.\"",
      "speaker": "court",
      "significance": "Dictionary meaning adopted for 'grove' absent statutory definition."
    },
    {
      "text": "\"the word grove conveys compactness or at any rate substantial compactness to be recognized as a unit by itself which must consist of a group of trees in sufficient number to preclude the land on which they stand from being primarily used for a purpose, such as cultivation, other than as a grove-land.\"",
      "speaker": "court",
      "significance": "Core test for constituting a grove."
    }
  ],
  "_case_id": "1967_262",
  "_label": 1,
  "_text_length": 13358,
  "_extracted_at": "2026-02-10T20:23:13.566754"
}