{
  "metadata": {
    "case_name": "Appellant (Medical Student) v. Respondent (State/Principal, Medical College, Gauhati)",
    "case_year": 1967,
    "court": "Supreme Court of India",
    "judges": [
      "Wanchoo, C.J."
    ],
    "case_number": "Civil Appeal No. 1028 of 1967",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant was expelled from the Medical College, Gauhati on October 26, 1966.",
      "type": "material",
      "date": "1966-10-26",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Appellant tendered unqualified apology on October 27, 1966 and attended classes up to the end of October 1966.",
      "type": "procedural",
      "date": "1966-10-27",
      "source": "appellant"
    },
    {
      "id": "f3",
      "text": "Principal did not accept the apology; on November 2, 1966, appellant was told that examination fee for exam starting November 4, 1966 would not be accepted due to expulsion order.",
      "type": "material",
      "date": "1966-11-02",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "High Court vacation from September 17, 1966 to November 19, 1966; Mr. Justice S.K. Dutta nominated as Vacation Judge, to sit on dates including October 31, 1966 and November 10, 1966; extremely urgent matters by appointment through Registrar.",
      "type": "background",
      "date": "1966-09-17",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Mr. Justice Dutta went to Sibsagar after October 31, 1966 sitting for Commission of Enquiry and was not available at Gauhati on November 2, 1966.",
      "type": "background",
      "date": "1966-11-02",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Appellant gave notice to Government Advocate on November 2, 1966 at Gauhati, then went to Sibsagar, presented writ petition to Dutta J. who entertained it and passed interim orders.",
      "type": "procedural",
      "date": "1966-11-02",
      "source": "appellant"
    },
    {
      "id": "f7",
      "text": "Copy of interim order prepared at Sibsagar, taken to Gauhati, sealed, served on university; appellant allowed to sit examination subject to writ result.",
      "type": "procedural",
      "date": "1966-11-03",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Papers sent to Gauhati; High Court dealt with writ petition and passed miscellaneous orders after vacation.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Writ petition heard in May 1967; preliminary objection raised that Dutta J. could not act as Judge while Commission of Enquiry and could not at Sibsagar as seat is Gauhati.",
      "type": "procedural",
      "date": "1967-05",
      "source": "respondent"
    },
    {
      "id": "f10",
      "text": "High Court Bench (Chief Justice and Goswami J.): Chief Justice held Dutta J. could not act as Judge while Commission and not at Sibsagar, set aside stay and rule nisi, dismissed petition; Goswami J. agreed on seat issue.",
      "type": "procedural",
      "date": "1967-05-24",
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether Mr. Justice Dutta could act as a Judge of the High Court while working as a Commission of Enquiry.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether Mr. Justice Dutta could exercise jurisdiction as a Judge of the High Court at Sibsagar when the seat of the High Court is at Gauhati.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether the writ petition should be dismissed due to irregular presentation at Sibsagar, even after papers reached Gauhati.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Dutta J. could act as Judge of High Court while heading temporary Commission of Enquiry under Commission of Enquiry Act, as he does not demit office as Judge.",
      "supporting_facts": [
        "f5",
        "f9"
      ],
      "legal_basis": "Commission of Enquiry Act"
    },
    {
      "id": "pa2",
      "text": "Even if presentation at Sibsagar irregular, irregularity cured when petition sent to Gauhati and dealt with there; petition should not be dismissed.",
      "supporting_facts": [
        "f7",
        "f8"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Dutta J. could not act as Judge while performing duties of Commission of Enquiry.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Dutta J. could not exercise jurisdiction at Sibsagar as seat of High Court is Gauhati.",
      "supporting_facts": [
        "f4",
        "f6"
      ],
      "legal_basis": "Art. 10 of the Assam High Court Order, 1948"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Judge of High Court appointed to head temporary Commission under Commission of Enquiry Act does not demit office as Judge; entitled to sit as Judge when Commission not sitting continuously.",
      "addresses_issue": "i1",
      "key_observation": "Dutta J. remained part of High Court and could act as Judge."
    },
    {
      "id": "cr2",
      "text": "Assuming Dutta J. could not pass orders outside Gauhati, presentation at Sibsagar irregular but cured when petition reached Gauhati and dealt with; no reason to dismiss petition.",
      "addresses_issue": "i2",
      "key_observation": "Irregularity in presentation and stay order cured; petition validly before High Court at Gauhati."
    },
    {
      "id": "cr3",
      "text": "Chief Justice's remarks on 'unholy haste and hurry' and unnecessary zeal by Dutta J. uncalled for; action proper given urgency and Dutta J.'s view of jurisdiction; judicial decorum requires restraint.",
      "addresses_issue": "i3",
      "key_observation": "No basis for criticism; remarks bring High Court into disrepute."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "High Court Judge heading temporary Commission of Enquiry remains Judge and can act as such when time permits.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Irregular presentation of writ at non-seat location cured upon reaching proper seat; writ not to be dismissed on that ground.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h3",
      "text": "High Court order dismissing writ set aside; remit for reconsideration of admission treating as presented at Gauhati.",
      "resolves_issue": "i3",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Principal, Patna College v. K.S. Raman",
      "citation": "1966 1 S.C.R. 974, A.I.R. 1966 S.C. 707",
      "treatment": "distinguished",
      "relevance": "Facts different; observations on haste not applicable here due to vacation and urgency."
    }
  ],
  "statutes_cited": [
    {
      "name": "Commission of Enquiry Act",
      "sections": [],
      "relevance": "Appointments temporary, not whole-time; Judge remains part of High Court."
    },
    {
      "name": "Assam High Court Order, 1948",
      "sections": [
        "Art. 10"
      ],
      "relevance": "Seat of High Court at Gauhati; assumed orders outside seat irregular."
    }
  ],
  "outcome": {
    "disposition": "partially_accepted",
    "summary": "Appeal allowed; High Court order dismissing writ petition set aside and case remanded to High Court to reconsider admission of writ petition, treating it as presented when it reached Gauhati, and if admitted, set down for hearing.",
    "relief_granted": "Writ petition remanded for reconsideration on merits.",
    "costs": "No order as to costs."
  },
  "key_quotes": [
    {
      "text": "A Judge of the High Court when he is appointed to head a Commission, of this kind does not demit his office as a Judge and when the Commission is not actually sitting he is entitled to sit as a Judge of the High Court.",
      "speaker": "court",
      "significance": "Core holding on Judge's dual role."
    },
    {
      "text": "Judicial decorum has to be maintained at all times and even where criticism is justified it must be in language of utmost restraint.",
      "speaker": "court",
      "significance": "Rebuke of High Court Chief Justice's remarks against colleague."
    },
    {
      "text": "Remarks such as these made by the learned Chief Justice make a sorry reading and bring the High Court over which he presides into disrepute.",
      "speaker": "court",
      "significance": "Emphasizes need for restrained judicial language."
    }
  ],
  "_case_id": "1967_220",
  "_label": 1,
  "_text_length": 17270,
  "_extracted_at": "2026-02-10T20:23:17.544792"
}