{
  "metadata": {
    "case_name": "State of Andhra Pradesh & Ors. v. Various Respondents",
    "case_year": 1966,
    "court": "Supreme Court of India",
    "judges": [
      "Subba Rao, C.J."
    ],
    "case_number": "Civil Appeals Nos. 40-46,48-68, 70-74 and 76-86 of 1966",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "These 44 appeals by certificate are preferred against the common judgment of a Division Bench of the Andhra Pradesh High Court allowing the petitions filed by the respondents under Art. 226 of the Constitution for directing the State of Andhra Pradesh and other appropriate authorities to forbear from collecting the assessment of land revenue under the provisions of the Andhra Pradesh Land Revenue Additional Assessment and Cess Revision Act, 1962 (Act 22 of 1962), as amended by the Andhra Pradesh Land Revenue Additional Assessment and Cess Revision Amendment Act, 1962 (Act 23 of 1962).",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The Principal Act was passed on September 27, 1962 and it came into force on July 1, 1962 and the Amending Act was passed on December 24, 1962, and it came into force on July 1, 1962.",
      "type": "background",
      "date": "1962-07-01",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The main object in passing the Principal Act was to rationalize the land revenue assessment in the State by bringing uniformity between Telangana and Andhra areas and to raise the rate of revenue in view of the rise in prices and to make the ryots bear equitably their share of the burden of the plans.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Under s. 3 of the Act there is no classification at all in the case of dry lands.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "The ayacut basis adopted in the Table under S. 4 of the Act has no rational relation to the taram or quality of the land or the nature of the irrigation source.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "The minimum fixed by the proviso in many cases is more than 100 per cent increase fixed by the section and thus, the proviso has exceeded the section.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "The Act is silent as to the machinery for making the assessment, the criteria for fixation of the assessment, within the range of a fixed maximum and a minimum the rights and remedies of the assesses and the obligation of the Government to survey the lands.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Ryotwari Settlement was conducted in seven stages: demarcation of boundaries, survey, inspection, classification of soils, assessment, matters subsequent to assessment, and records of settlement.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Soil was classified into series (e.g., Alluvial islands, Regar, Red ferruginous soil), classes based on variety and physical situation, and sorts (good, bad, ordinary, worst).",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "In wet land, additional distinctions based on proximity to irrigation channel, level, drainage, and water supply method.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Assessment based on net produce after deducting cost of cultivation, valued in money, with Government share as percentage.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Table of class and sort rates called Taram applied equally to similar soils.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Standing Orders of the Board of Revenue: assessment on land, not exceeding half net produce, no tax for second crop on dry land, double crop wet lands charged half first crop, remissions for water failure.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "In Telangana, relative scale in annas or annawari, adjusted for prices, population, etc., checked against cultivator profit.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f15",
      "text": "Ryotwari Settlements abandoned in 1939 due to unpopularity as they led to increases.",
      "type": "background",
      "date": "1939",
      "source": "court"
    },
    {
      "id": "f16",
      "text": "Andhra Pradesh Land Revenue Assessment Standardization Act, 1956 and Hyderabad Land Revenue Special Assessment Act, 1952 standardized rates by surcharge.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f17",
      "text": "Land Revenue Reforms Committee (1958) recommended: land revenue as % of net produce, irrigated land assessment on dry potential + irrigation charge based on service, factors: productivity, capacity of source (duration), ability to pay.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f18",
      "text": "Under S. 3: additional assessment 75% of prior assessment for dry land, minimum 50 naye paise per acre.",
      "type": "material",
      "date": null,
      "source": "statute"
    },
    {
      "id": "f19",
      "text": "Under S. 4: wet land additional 100% or 50% based on irrigation class, with min/max per Table based on ayacut extent and taram/bhagana groups.",
      "type": "material",
      "date": null,
      "source": "statute"
    },
    {
      "id": "f20",
      "text": "S. 6: additional assessment treated as land revenue.",
      "type": "material",
      "date": null,
      "source": "statute"
    },
    {
      "id": "f21",
      "text": "S. 8: District Collector notifies Government sources under classes I, II, IV; appeal to Board of Revenue.",
      "type": "material",
      "date": null,
      "source": "statute"
    },
    {
      "id": "f22",
      "text": "Statistical data shows no correlation between ayacut extent and water supply duration; examples from taluks like Anantapur, Dharmavaram, etc., where sources with similar duration have varying ayacuts.",
      "type": "disputed",
      "date": null,
      "source": "court"
    },
    {
      "id": "f23",
      "text": "In many cases, minimum rate exceeds 100% of prior assessment.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f24",
      "text": "Examples: Kumbum tank (10,000 acres, class II), Bukkaepatnam (184 acres, class III), both >8 months supply.",
      "type": "material",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether Sections 3 and 4 of the Andhra Pradesh Land Revenue Additional Assessment and Cess Revision Act, 1962 (as amended) are constitutionally valid, particularly whether they offend Articles 14 and 19 of the Constitution due to lack of reasonable classification, arbitrary rates based on ayacut without relation to soil quality/productivity, and absence of assessment machinery.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether there is machinery/procedure for assessment under the Act.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether revenue assessment under the Act is 'by authority of law' within Art. 265.",
      "framed_by": "lower_court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The High Court erred in concluding no reasonable relation to soil quality; Legislature imposed surcharge on previous rates fixed on tarams (Andhra) / bhaganas (Telangana).",
      "supporting_facts": [
        "f8",
        "f9",
        "f11",
        "f14"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Classification under S.4 based on ayacut has correlation to duration of water supply; statistical data (average/majority tests) supports relation to taram/bhagana and water duration.",
      "supporting_facts": [
        "f19",
        "f22"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "S.6 incorporates pre-existing procedure via Standing Orders of Board of Revenue and Andhra Pradesh Revenue Recovery Act.",
      "supporting_facts": [
        "f20"
      ],
      "legal_basis": null
    },
    {
      "id": "pa4",
      "text": "For dry lands, 50 np minimum low; marginal cases don't invalidate; wet lands duration corresponds to ayacut.",
      "supporting_facts": [
        "f18"
      ],
      "legal_basis": "Art. 14 (reasonable classification)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Land assessment historically based on taram/bhagana per soil quality/productivity; Act ignores this, adopts arbitrary flat minimums and ayacut basis unrelated to quality/productivity.",
      "supporting_facts": [
        "f8",
        "f9",
        "f11",
        "f14",
        "f18",
        "f19"
      ],
      "legal_basis": "Art. 14"
    },
    {
      "id": "ra2",
      "text": "Act lacks machinery for assessment, criteria, notices, remedies; confers arbitrary uncanalized power.",
      "supporting_facts": [
        "f7",
        "f20"
      ],
      "legal_basis": "Art. 14 (procedural arbitrariness)"
    },
    {
      "id": "ra3",
      "text": "For Yeleru river lands, do not fall under dry/single/double crop categories.",
      "supporting_facts": [
        "f1"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Dry lands: flat 75% + min 50 np/acre ignores taram/soil quality; no reasonable classification.",
      "addresses_issue": "i1",
      "key_observation": "Irrespective of quality/productivity, every acre bears minimum, displacing scientific ryotwari basis."
    },
    {
      "id": "cr2",
      "text": "Wet lands: classification by ayacut extent (classes I-IV) lacks rational relation to taram/quality or water duration; statistics show no correlation (varying ayacuts for same duration, vice versa); min rates often >100% prior.",
      "addresses_issue": "i1",
      "key_observation": "Ayacut does not correspond to months of supply; many long-duration tanks in lower classes due to small ayacut."
    },
    {
      "id": "cr3",
      "text": "S.6 treats additional assessment as land revenue for recovery, but does not incorporate assessment procedure/Standing Orders; no notice, opportunity, designation of officer, remedies; nebulous machinery.",
      "addresses_issue": "i2",
      "key_observation": "Typical taxing statute lacks machinery; official arbitrariness violates Art.14."
    },
    {
      "id": "cr4",
      "text": "Art.14 permits classification if intelligible differentia with rational relation to object; here, lacks both; fiscal statutes get leeway but cannot introduce unreasonable discrimination.",
      "addresses_issue": "i1",
      "key_observation": "Scheme gives up taram principle for arbitrary flat rates/ayacut; enables discrimination."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Sections 3 and 4 offend Art.14 due to lack of reasonable classification (flat mins ignore soil quality; ayacut unrelated to duration/quality) and procedural arbitrariness (no assessment machinery).",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "S.6 does not provide/incorporate assessment procedure.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Kunnathat Thathunni Moopil Nair v. State of Kerala",
      "citation": "1961 3 S.C.R. 77",
      "treatment": "followed",
      "relevance": "Flat rate tax on land regardless of income/fertility violates Art.14 for lack of classification."
    },
    {
      "case_name": "East India Tobacco Co. v. State of Andhra Pradesh",
      "citation": "1963 1 S.C.R. 404",
      "treatment": "followed",
      "relevance": "Taxation laws must pass Art.14 test; State has wide discretion but not unlimited."
    },
    {
      "case_name": "Khandige Sham Bhat v. Agricultural Income Tax Officer",
      "citation": "1963 3 S.C.R. 899",
      "treatment": "followed",
      "relevance": "Effect of law, not phraseology, determines if discriminatory; larger leeway in fiscal but must adhere to Art.14."
    },
    {
      "case_name": "C.V. Rajagopalachariar v. State of Madras",
      "citation": "A.I.R. 1960 Mad. 543",
      "treatment": "distinguished",
      "relevance": "Surcharge on prior scientific rates valid; unlike here where scheme discards basis."
    },
    {
      "case_name": "H.H. Vishwasha Thirtha Swamiar of Sri Pejawar Mutt v. State of Mysore",
      "citation": "1966 1 Mys. L.J. 351",
      "treatment": "distinguished",
      "relevance": "Temporary surcharge on existing rates valid; not applicable to new arbitrary scheme."
    }
  ],
  "statutes_cited": [
    {
      "name": "Andhra Pradesh Land Revenue Additional Assessment and Cess Revision Act, 1962 (Act 22 of 1962)",
      "sections": [
        "3",
        "4",
        "6",
        "8"
      ],
      "relevance": "Challenged provisions for additional assessment on dry/wet lands; held unconstitutional under Art.14."
    },
    {
      "name": "Andhra Pradesh Land Revenue Additional Assessment and Cess Revision Amendment Act, 1962 (Act 23 of 1962)",
      "sections": [],
      "relevance": "Amends Principal Act; concerned only with Act as amended."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "14",
        "19",
        "226",
        "265"
      ],
      "relevance": "Ss.3,4 offend Art.14 (equality); writs under 226; assessment must be by authority of law (265)."
    },
    {
      "name": "Andhra Pradesh Land Revenue Assessment Standardization Act, 1956",
      "sections": [],
      "relevance": "Prior surcharge standardization."
    },
    {
      "name": "Hyderabad Land Revenue Special Assessment Act, 1952",
      "sections": [],
      "relevance": "Prior surcharge standardization."
    },
    {
      "name": "Madras Land Revenue Surcharge Act (19 of 1954)",
      "sections": [],
      "relevance": "Cited in precedent."
    },
    {
      "name": "Madras Land Revenue Additional Surcharge Act (30 of 1955)",
      "sections": [],
      "relevance": "Cited in precedent."
    },
    {
      "name": "Mysore Land Revenue Surcharge Act (13 of 1961)",
      "sections": [],
      "relevance": "Cited in precedent."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeals against the Andhra Pradesh High Court judgment striking down provisions of the Act are dismissed; the provisions offend Art.14 of the Constitution.",
    "relief_granted": "High Court direction to forbear collection upheld.",
    "costs": "with costs"
  },
  "key_quotes": [
    {
      "text": "Official arbitrariness is more subversive of the doctrine of equality than statutory discrimination.",
      "speaker": "court",
      "significance": "Core reasoning on why lack of machinery violates Art.14."
    },
    {
      "text": "A statute may expressly make a discrimination between persons or things or may confer power on an authority who would be in a position to do so.",
      "speaker": "court",
      "significance": "Explains Art.14 scope in taxation."
    },
    {
      "text": "The classification attempt in either case has no reasonable relation to the objects sought to be achieved, namely, imposition of fair assessments and rationalisation of the revenue assessment structure.",
      "speaker": "court",
      "significance": "Rejects State's classification defense."
    }
  ],
  "_case_id": "1967_233",
  "_label": 0,
  "_text_length": 50932,
  "_extracted_at": "2026-02-10T20:23:25.561702"
}