{
  "metadata": {
    "case_name": "Sons of Golam Hossain Kasim Ariff v. Respondent (Wealth Tax Authorities)",
    "case_year": 1968,
    "court": "Supreme Court of India",
    "judges": [
      "Grover, J."
    ],
    "case_number": "Civil Appeals Nos. 2129 to 2132 of 1968",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "By a deed dated November 19, 1928 as modified by a deed of rectification dated July 5, 1930 one Golam Hossain Kasim Ariff created a wakf-alal-aulad in respect of his properties in Noormul Lohia Lane and Armenian Street in Calcutta.",
      "type": "background",
      "date": "1928-11-19",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The settler appointed himself as the sole Mutwalli for the term of his life and provided that after his death his widow Aisha Bibi and his sons would act as Mutwallis jointly.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The settler died on January 1, 1937, leaving behind his widow Aisha Bibi and three sons who are the appellants.",
      "type": "background",
      "date": "1937-01-01",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Clause 5 of the deed: After payment of all necessary outgoings, the Mutwalli shall apply the net income: 1/5 to settler during life, 1/6 to each son during life, 1/10 to wife during life, by monthly instalments. Minors' shares invested after maintenance and education, made over at majority. Ultimate benefit to poor musalmans.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Appellants, beneficiaries, were paying income tax on amounts received from Mutwalli.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Wealth Tax Act, 1957 came into force in 1957.",
      "type": "background",
      "date": "1957",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "For assessment years 1957-58 and 1958-59, appellants assessed to wealth tax on basis of share in wakf estate. Immovable property valued at 20 times annual municipal valuation; 1/6th value plus other properties as net wealth of each assessee.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Appeals to Appellate Assistant Commissioner of Wealth Tax dismissed.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Further appeals to Income Tax Appellate Tribunal: Tribunal held right to receive share of rents and profits is property/interest in property, not limited to 6 years, thus asset u/s 2(e); rejected annuity argument u/s 2(e)(iv); rejected maintenance non-transferable argument; directed valuation on Parks table at 6% rent security.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Reference u/s 27 Wealth Tax Act to Calcutta High Court: 'Whether on the facts and circumstances stated the right of the assessee to receive a specified share of the net income from the Wakf Estate is an asset the capitalised value of which is assessable to Wealth-tax?' High Court answered in affirmative in favour of revenue.",
      "type": "procedural",
      "date": "1964-12-04",
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the right of an assessee to receive a specified share of the net income from an estate in respect of which Wakf-alal-aulad has been created is an asset assessable to Wealth Tax.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The right to receive a share of the income under wakf-alal-aulad cannot be regarded as property even in wide sense; under Mohammedan law, wakf ties property to God, ownership vests in Almighty, Mutawalli is manager not trustee.",
      "supporting_facts": [
        "f1",
        "f2",
        "f3",
        "f4"
      ],
      "legal_basis": "Mohammedan Law; Mussalman Wakf Validating Act 1913"
    },
    {
      "id": "pa2",
      "text": "The right is a mere right to an annuity u/s 2(e)(iv) Wealth Tax Act, terms preclude commutation to lump sum.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": "Wealth Tax Act s.2(e)(iv)"
    },
    {
      "id": "pa3",
      "text": "Allowances payable by way of maintenance, non-transferable u/s 6(dd) TP Act, no market value for inclusion in net wealth.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": "Transfer of Property Act s.6(dd); Wealth Tax Act s.5"
    },
    {
      "id": "pa4",
      "text": "Right reserved for maintenance and support to avoid invalidity of deed; not partible, alienable, personal to beneficiary, lacks attributes of property.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": "Mussalman Wakf Validating Act 1913; Abdul Karim Adenwalla v. Rahimabai"
    },
    {
      "id": "pa5",
      "text": "Right not capable of valuation u/s 7(1) as no open market sale possible.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": "Wealth Tax Act s.7(1)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Right to receive aliquot share of net income is property/asset u/s 2(e); distinction between aliquot share and annuity.",
      "supporting_facts": [
        "f4",
        "f7"
      ],
      "legal_basis": "Wealth Tax Act s.2(e)"
    },
    {
      "id": "ra2",
      "text": "Even if non-transferable, has value; value as if sold in open market via actuarial valuation.",
      "supporting_facts": [
        "f7",
        "f9"
      ],
      "legal_basis": "Wealth Tax Act s.7(1)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Assets u/s 2(e) includes property of every description; right to aliquot share of net income is property in widest sense.",
      "addresses_issue": "i1",
      "key_observation": "No reason to restrict meaning of asset; comprehensive definition includes all property barring exceptions."
    },
    {
      "id": "cr2",
      "text": "Not satisfied that share meant merely for maintenance; even if so construed to preserve validity, still asset liable to wealth tax.",
      "addresses_issue": "i1",
      "key_observation": "Right to share of income is asset u/s 2(e)."
    },
    {
      "id": "cr3",
      "text": "Valuation u/s 7(1) hypothetical: assume open market exists; not actual sale.",
      "addresses_issue": "i1",
      "key_observation": "Asset valued as if saleable."
    },
    {
      "id": "cr4",
      "text": "Not a right to annuity u/s 2(e)(iv); annuity has judicially interpreted legal meaning, not dictionary; aliquot share distinct from fixed annuity.",
      "addresses_issue": "i1",
      "key_observation": "Exception does not apply."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The right to receive an aliquot share of the net income of the wakf properties is an asset within s.2(e) Wealth Tax Act, capitalised value assessable to wealth tax.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Vidya Varuthi v. Balusami Ayyar",
      "citation": "48 I.A. 302",
      "treatment": "followed",
      "relevance": "Wakf extinguishes settlor's right, ownership to God, Mutawalli superintendent."
    },
    {
      "case_name": "Abdul Karim Adenwalla v. Rahimabai",
      "citation": "48 Bom. L.R. 67",
      "treatment": "referred",
      "relevance": "Distinction between reservation for maintenance (non-transferable) and life interest."
    },
    {
      "case_name": "Commissioner, Hindu Religious Endowments, Madras v. Shri Lakshmindra Thirtha Swamiar of Sri Shirur Mutt",
      "citation": "1954 S.C.R. 1005",
      "treatment": "followed",
      "relevance": "Property given wide connotation including interests with proprietary characteristics."
    },
    {
      "case_name": "Commissioner of Wealth Tax, Bombay City v. Purshottam N. Amersey",
      "citation": "71 I.T.R. 180",
      "treatment": "followed",
      "relevance": "Assets definition comprehensive; includes all property; hypothetical valuation u/s 7(1)."
    },
    {
      "case_name": "Commissioner of Inland Revenue v. Crossman",
      "citation": "1937 A.C. 26",
      "treatment": "referred",
      "relevance": "Hypothetical open market valuation."
    }
  ],
  "statutes_cited": [
    {
      "name": "Wealth Tax Act, 1957",
      "sections": [
        "s.2(e)",
        "s.2(m)",
        "s.3",
        "s.4",
        "s.5",
        "s.7(1)",
        "s.27"
      ],
      "relevance": "Definition of assets includes property every description barring exceptions like certain annuities and short interests; charging section; valuation as open market price."
    },
    {
      "name": "Mussalman Wakf Validating Act, 1913",
      "sections": [
        "s.3"
      ],
      "relevance": "Validates wakf-alal-aulad for family maintenance with ultimate charitable benefit."
    },
    {
      "name": "Transfer of Property Act",
      "sections": [
        "s.6(dd)"
      ],
      "relevance": "Rights to future maintenance not transferable."
    },
    {
      "name": "Code of Civil Procedure",
      "sections": [
        "s.60"
      ],
      "relevance": "Non-attachability of maintenance rights."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 19(1)(f)"
      ],
      "relevance": "Wide meaning of property."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeals against the Calcutta High Court judgment upholding wealth tax assessment on appellants' right to specified share of wakf net income as an asset are dismissed.",
    "relief_granted": "None",
    "costs": "Dismissed with costs"
  },
  "key_quotes": [
    {
      "text": "\"assets includes property of every description, movable or immovable but does not include-- (iv) any right to any annuity...\"",
      "speaker": "court",
      "significance": "Central definition interpreted broadly."
    },
    {
      "text": "There is no reason or justification to give any restricted meaning to the word asset as defined by s. 2(e) of the Act when the language employed shows that it was intended to include property of every description.",
      "speaker": "court",
      "significance": "Core holding on scope of 'assets'."
    },
    {
      "text": "when the statute uses the words 'if sold in the open market' it does not contemplate actual sale... but only enjoins that it should be assumed that there is an open market.",
      "speaker": "court",
      "significance": "Explains hypothetical valuation method."
    }
  ],
  "_case_id": "1969_208",
  "_label": 0,
  "_text_length": 18105,
  "_extracted_at": "2026-02-10T20:26:49.399592"
}