{
  "metadata": {
    "case_name": "Star Co. Ltd. v. Commissioner of Income-tax",
    "case_year": 1968,
    "court": "Supreme Court of India",
    "judges": [
      "Grover, J."
    ],
    "case_number": "Civil Appeal No. 1635 of 1968",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The assessee is a public limited company carrying on, inter alia, business of dealing in shares and securities. Profits and losses from share transactions treated as business.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "During assessment year 1954-55 (accounting year 1953-54), assessee suffered loss of Rs. 1,11,816 on sale of 1,575 preference shares of Fort William Jute Co. Ltd.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Shares purchased: 1,620 shares on May 22, 1952 at Rs. 186 per share; 50 shares on May 27, 1952 at Rs. 184 per share from Mugneeram Bangur Co.",
      "type": "material",
      "date": "1952-05-22",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Shares sold on December 23, 1953 at Rs. 115 per share to Mugneeram Bangur Co., resulting in loss included in P&L as loss on sale of investment.",
      "type": "material",
      "date": "1953-12-23",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "On May 21, 1952, agreement between Kettlewell Bullen Co. (managing agents of Fort William Jute Co. Ltd.) and Mugneeram Bangur Co. to sell entire holdings: 6,920 pref shares at Rs. 185, 600 ord at Rs. 400.",
      "type": "background",
      "date": "1952-05-21",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Kettlewell Bullen issued circular to shareholders informing of agreement, resignation from July 1, 1952, and offer by Mugneeram Bangur to purchase shares at same prices.",
      "type": "background",
      "date": "1952-05-21",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Market price of preference shares on May 21, 1952 ranged between Rs. 119 and Rs. 122 per share.",
      "type": "material",
      "date": "1952-05-21",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Mugneeram Bangur transferred large part of 8,617 pref shares to three companies: Manwar Textile Agency Ltd., Union Co. Ltd., and Star Co. Ltd. (assessee).",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Bangur Brothers Ltd. appointed managing agents of Fort William Jute Co. from July 1, 1952 for 10 years.",
      "type": "background",
      "date": "1952-07-01",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Assessee overdrew bank account to acquire shares.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Income-tax Officer and Appellate Assistant Commissioner rejected claim that loss arose in ordinary course of share dealing business, holding it contribution to scheme of acquisition of managing agency by Mugneeram Bangur Co.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Appellate Tribunal: No evidence assessee made pawn in scheme; even if Mugneeram Bangur had controlling interest, not conclusive; but shares not in course of business as distinguished in P&L account as investment loss, not stock-in-trade.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Calcutta High Court, on reference (Income-tax Reference No. 205 of 1961), answered question in negative against assessee: Transactions stood apart, large amount, bought/sold to same party in one lot, purchased day after agreement at premium over market, overall picture shows helped Bangurs in scheme.",
      "type": "procedural",
      "date": "1965-05-07",
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "Market rate of pref shares constant at Rs. 119 from April 16 to May 21, 1952.",
      "type": "material",
      "date": "1952-04-16",
      "source": "court"
    },
    {
      "id": "f15",
      "text": "P&L account showed other share dealings of much lesser value and minimal profits/losses compared to Fort William Jute shares.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f16",
      "text": "Assessee connected with Bangurs: two out of four directors were Bangurs.",
      "type": "background",
      "date": null,
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether on the facts and in the circumstances of the case, the loss of Rs. 1,11,816/- suffered by the assessee on the sale of shares of Fort William Jute Company Limited was a loss that arose in its share dealing business.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "High Court not entitled to reverse findings of fact of Appellate Tribunal as department did not challenge them by reference.",
      "supporting_facts": [
        "f12"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Question of mixed fact and law; Tribunal findings on facts final (no evidence of being pawn in scheme); High Court must accept and cannot re-appraise evidence.",
      "supporting_facts": [
        "f12"
      ],
      "legal_basis": "CIT v. Greaves Cotton Co. Ltd.; Oriental Investment Co. P. Ltd. v. CIT"
    },
    {
      "id": "pa3",
      "text": "Assessee not privy to scheme: no interest in managing agency, not subsidiary/associate of Mugneeram Bangur group.",
      "supporting_facts": [
        "f16"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Question referred in general terms out of Tribunal order against assessee; no need for separate reference on reasons.",
      "supporting_facts": [
        "f12"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Question arises from Tribunal's final conclusion against assessee; no need for department to reference reasons favoring assessee.",
      "addresses_issue": "i1",
      "key_observation": "Tribunal upheld view of authorities below though for different reasons."
    },
    {
      "id": "cr2",
      "text": "Even accepting Tribunal's negation of 'pawn' finding, on admitted facts shares not acquired in ordinary course of business: purchased at premium over market day after agreement, sold back same party at loss, distinguished in P&L, overdraft, other dealings minimal.",
      "addresses_issue": "i1",
      "key_observation": "Extraordinary features lead to irresistible conclusion not ordinary course."
    },
    {
      "id": "cr3",
      "text": "High Court could examine if Tribunal applied legal principles correctly on mixed questions.",
      "addresses_issue": "i1",
      "key_observation": "Findings defective if no evidence or perverse, but here primary facts support conclusion."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Loss did not arise in ordinary course of assessee's share dealing business.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Commissioner of Income-tax, Bombay City v. Greaves Cotton Co. Ltd.",
      "citation": "68 I.T.R. 200",
      "treatment": "referred",
      "relevance": "High Court cannot re-appraise evidence or arrive at contrary findings of fact to Tribunal unless defective."
    },
    {
      "case_name": "Oriental Investment Co. P. Ltd. v. Commissioner of Income-tax",
      "citation": "72 I.T.R. 408",
      "treatment": "referred",
      "relevance": "On mixed law and fact, High Court accepts Tribunal's primary facts but examines legal principles applied."
    }
  ],
  "statutes_cited": [
    {
      "name": "Income-tax Act, 1922",
      "sections": [
        "s. 66(1)"
      ],
      "relevance": "Reference to High Court on questions of law arising from Tribunal order."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court dismissed the appeal by certificate from Calcutta High Court, answering the referred question in the negative against the assessee, holding the loss not arising in ordinary course of share dealing business.",
    "relief_granted": null,
    "costs": "Dismissed with costs."
  },
  "key_quotes": [
    {
      "text": "\"On admitted and proved facts there can be no manner of doubt that the assessee did not acquire the preference shares in the ordinary course of business.\"",
      "speaker": "court",
      "significance": "Core holding on why loss not business loss."
    },
    {
      "text": "\"All the above facts and circumstances which have some extraordinary features lead to the irresistible conclusion that whatever the motives which entered into the acquisition of the shares, they were certainly not bought and sold in the ordinary course of business.\"",
      "speaker": "court",
      "significance": "Summarizes reasoning based on transaction peculiarities."
    }
  ],
  "_case_id": "1969_84",
  "_label": 0,
  "_text_length": 15377,
  "_extracted_at": "2026-02-10T20:25:15.574498"
}