{
  "metadata": {
    "case_name": "Lessor (Appellant) v. Lessee (Respondent)",
    "case_year": 1968,
    "court": "Supreme Court of India",
    "judges": [
      "Grover, J."
    ],
    "case_number": "Civil Appeal No 1655 of 1968",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Respondent entered into a deed of lease on October 26, 1951 with the appellant in respect of premises Nos. 8 & 9, Mahatma Gandhi Road, South Parade, Civil Station, Bangalore.",
      "type": "background",
      "date": "1951-10-26",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Lease stipulated to be for a period of 10 years in the first instance with effect from November 1, 1961, with an option to the lessee to renew the same as long as desired.",
      "type": "material",
      "date": "1961-11-01",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Clauses 9 and 10 of the lease deed provide that the lessee shall have the right to renew the lease at the end of every 10 years on the same rental of Rs. 450/- per month and same terms and conditions as long as they desire, and lessor shall not raise any objection, provided lessee does not transfer or alienate.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Before the expiry of the initial 10-year period, the lessee wrote to the lessor informing intention to exercise the option to renew for a further 10 years from November 1, 1961.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Lessor did not comply with the request for renewal.",
      "type": "disputed",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "After serving a notice, lessee filed a suit for specific performance of the covenant for renewal, praying that lessor be directed to execute a registered deed of lease or court execute it.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Lessor pleaded, inter alia, that the condition relating to renewal was hit by the rule against perpetuity.",
      "type": "disputed",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Trial court decreed the suit in favour of the lessee.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "First appellate court and Mysore High Court affirmed the decree in Regular Second Appeal No. 811 of 1965, judgment dated December 20, 1967.",
      "type": "procedural",
      "date": "1967-12-20",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Appeal by special leave to Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether an option given to a lessee to get the lease, which is initially for a period of 10 years, renewed after every 10 years as long as desired is hit by the rule of perpetuity under s.14 of the Transfer of Property Act and is void.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The condition relating to renewal is hit by the rule against perpetuity embodied in s.14 of the Transfer of Property Act.",
      "supporting_facts": [
        "f3",
        "f7"
      ],
      "legal_basis": "Section 14, Transfer of Property Act"
    },
    {
      "id": "pa2",
      "text": "The renewal clauses are covenants that run with the land and on a correct construction attract s.14 immediately.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": "Section 14, Transfer of Property Act"
    },
    {
      "id": "pa3",
      "text": "The lease was for 10 years only in the first instance, not a lease in perpetuity.",
      "supporting_facts": [
        "f2"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The stipulation relating to renewal cannot be regarded as transferring property or any rights therein, so s.14 not applicable.",
      "supporting_facts": [
        "f3",
        "f6"
      ],
      "legal_basis": "Section 14, Transfer of Property Act; Section 105, Transfer of Property Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Section 14 applies only where there is transfer of property; the initial transfer was for 10 years only, and renewal stipulation does not transfer property or rights therein.",
      "addresses_issue": "i1",
      "key_observation": "Renewal clauses do not create an interest falling within s.14."
    },
    {
      "id": "cr2",
      "text": "A lease is a transfer of a right to enjoy property, but can be in perpetuity subject to reversion; however, renewal option is not such a transfer.",
      "addresses_issue": "i1",
      "key_observation": "Rule against perpetuity based on preventing destruction of alienation liberty."
    },
    {
      "id": "cr3",
      "text": "Renewal clauses are personal covenants or covenants running with land under s.40, not creating interest in property or easement.",
      "addresses_issue": "i1",
      "key_observation": "S.40 enforces such obligations against transferees with notice."
    },
    {
      "id": "cr4",
      "text": "Even under English law, covenants for perpetual renewal are upheld if clear, without perpetuity objection.",
      "addresses_issue": "i1",
      "key_observation": "Covenant annexed to land, free from perpetuity taint."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The option to renew the lease every 10 years indefinitely is not hit by the rule against perpetuity under s.14 of the Transfer of Property Act and is valid.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Ganesh Sonar v. Purnendu Narayan Singha Ors.",
      "citation": "1962 Patna 201",
      "treatment": "followed",
      "relevance": "Option to lessor to determine lease is personal covenant, not creating interest in land, so s.14 not applicable; distinguishes English law."
    },
    {
      "case_name": "Woodall v. Clifton",
      "citation": "1905 2 Ch. 257",
      "treatment": "distinguished",
      "relevance": "English case holding option to lessor to purchase fee simple invalid under perpetuity; distinguished post-TPA as contract does not create interest."
    },
    {
      "case_name": "Muller v. Trafalgar",
      "citation": "1901 1 Ch. 54",
      "treatment": "referred",
      "relevance": "Covenant for renewal runs with land; no perpetuity issue."
    },
    {
      "case_name": "Rogers v. Hosegood",
      "citation": "1900 2 Ch. 388",
      "treatment": "followed",
      "relevance": "Covenant for renewal running with land is free from perpetuity because annexed to land."
    },
    {
      "case_name": "Weg Motors Ltd. v. Hales Others",
      "citation": null,
      "treatment": "referred",
      "relevance": "Quotes Farwell J. approving no perpetuity objection to renewal covenants."
    }
  ],
  "statutes_cited": [
    {
      "name": "Transfer of Property Act",
      "sections": [
        "Section 14",
        "Section 5",
        "Section 105",
        "Section 40"
      ],
      "relevance": "S.14 embodies rule against perpetuity; applies to transfers creating remote interests. S.5 defines transfer. S.105 defines lease as transfer of right to enjoy. S.40 enforces covenants running with land annexed to ownership."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal by special leave against the Mysore High Court judgment affirming the decree for specific performance of the lease renewal covenant is dismissed, upholding the validity of the perpetual renewal option.",
    "relief_granted": "Affirmation of trial court decree directing execution of renewal lease deed.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The stipulation relating to the renewal could not be regarded as transferring property or any rights therein.",
      "speaker": "court",
      "significance": "Core reasoning why s.14 not attracted."
    },
    {
      "text": "But if I assume that this is a covenant for renewal running with the land it is then in my opinion free from any taint of perpetuity because it is annexed to the land.",
      "speaker": "court",
      "significance": "Quotation from Farwell J. upholding renewal covenants."
    },
    {
      "text": "The clauses containing the option to get the lease renewed on the expiry of each term of ten years can by no means be regarded as creating an interest in property of the nature that would fall within the ambit of s.14.",
      "speaker": "court",
      "significance": "Direct holding on renewal options."
    }
  ],
  "_case_id": "1969_86",
  "_label": 0,
  "_text_length": 9356,
  "_extracted_at": "2026-02-10T20:25:17.339225"
}