{
  "metadata": {
    "case_name": "Appellant v. Raj Kumar Rukmini Raman Brahma",
    "case_year": 1966,
    "court": "Supreme Court of India",
    "judges": [
      "Ramaswami, J."
    ],
    "case_number": "Civil Appeal No. 748 of 1966",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Respondent is the son of the late Raja Sharda Mahesh Narain Singh Shah of Agori Barhar Raj, tehsil Robertsganj in Mirzapur district.",
      "type": "background",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f2",
      "text": "Raja Anand Brahma Shah, a Malguzar of more than Rs. 10,000 annually, executed Gujaranama deeds in favour of his younger brothers and his mother separately in the year 1949, transferring certain villages in lieu of their right of maintenance.",
      "type": "background",
      "date": "1949",
      "source": "respondent"
    },
    {
      "id": "f3",
      "text": "One Gujaranama executed by Raja Anand Brahma Shah in favour of respondent Raj Kumar Rukmini Raman Brahma on October 5, 1949, registered on January 18, 1950.",
      "type": "material",
      "date": "1949-10-05",
      "source": "respondent"
    },
    {
      "id": "f4",
      "text": "Agori Raj is an impartible estate; according to law and custom, eldest son becomes owner, younger sons have right to maintenance given by reasonable share of estate.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Gujaranama deed states transfer to respondent in lieu of his right of maintenance, delivers proprietary possession, allows possession to male lineal descendants per custom, reverts if no male descendants, transferee pays land revenue, etc.",
      "type": "material",
      "date": "1949-10-05",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Respondent made application before Rehabilitation Grants Officer, Mirzapur under s.79 of U.P. Zamindari Abolition and Land Reforms Act, 1950 for determination and payment of rehabilitation grant.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f7",
      "text": "Appellant opposed application, contending transfer not legally recognised under s.23(1)(a) of the Act for assessing rehabilitation grant as made after July 1, 1948.",
      "type": "disputed",
      "date": null,
      "source": "appellant"
    },
    {
      "id": "f8",
      "text": "Rehabilitation Grants Officer by order dated January 28, 1961 held respondent entitled to rehabilitation grant.",
      "type": "procedural",
      "date": "1961-01-28",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Appellant preferred appeal to Additional Civil Judge, Mirzapur in Revenue Appeal No. 417 of 1961, rejected and appeal dismissed on December 4, 1962.",
      "type": "procedural",
      "date": "1962-12-04",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Appellant filed revision in Allahabad High Court, Civil Revision No. 373 of 1963, dismissed on February 16, 1965.",
      "type": "procedural",
      "date": "1965-02-16",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Appeal by special leave to Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Appellant did not deny customary right of maintenance of junior members in written statement before Rehabilitation Grants Officer; no disputed question of fact raised, challenge only on question of law.",
      "type": "admitted",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the Gujaranama deed dated October 5, 1949 executed by Raja Anand Brahma Shah is a transfer by way of sale or gift within the meaning of s. 23(1) of the Act and cannot therefore be recognised for purpose of assessing the amount of Rehabilitation Grant.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the case should be remanded to the Rehabilitation Grants Officer on account of procedural irregularities, such as not following Civil Procedure Code provisions.",
      "framed_by": "appellant"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "On a true construction of the document the transaction must be taken to be a gift of the property by Raja Anand Brahma Shah to the respondent.",
      "supporting_facts": [
        "f3",
        "f5"
      ],
      "legal_basis": "s. 23(1) of the U.P. Zamindari Abolition and Land Reforms Act, 1950"
    },
    {
      "id": "pa2",
      "text": "Rehabilitation Grants Officer did not follow provisions of Civil Procedure Code by treating application as plaint and objection as written statement, bound to frame issues and take evidence; case should be remanded.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": "Civil Procedure Code"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Transfer was in lieu of right of maintenance as per custom of impartible estate.",
      "supporting_facts": [
        "f2",
        "f3",
        "f4",
        "f5"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "No warrant for argument that transaction is gift; deed states transfer in lieu of right of maintenance which is obligatory upon holder of impartible estate; not sale as no money consideration; it is a settlement.",
      "addresses_issue": "i1",
      "key_observation": "Gujaranama deed dated October 5, 1949 is not hit by s.23 of the Act."
    },
    {
      "id": "cr2",
      "text": "Impartible estate regarded as joint family property; junior members have right of maintenance based on joint ownership; cites Privy Council decisions confirming right to maintenance out of impartible estate.",
      "addresses_issue": "i1",
      "key_observation": "Admission in deed of customary right to maintenance for younger sons."
    },
    {
      "id": "cr3",
      "text": "No case for remand as appellant did not deny customary right of maintenance; no disputed question of fact raised before Rehabilitation Grants Officer; challenge only on question of law.",
      "addresses_issue": "i2",
      "key_observation": "Procedural irregularities do not warrant remand."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Gujaranama deed dated October 5, 1949 is not a transfer by way of sale or gift under s.23(1) but a settlement in lieu of obligatory right of maintenance in impartible estate, recognised for rehabilitation grant.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "No remand required due to lack of factual disputes.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Shiba Prasad Singh v. Rani Prayag Kumari Devi",
      "citation": "59 I.A. 331",
      "treatment": "followed",
      "relevance": "Impartible estate by custom not separate property of holder; if ancestral and by primogeniture, part of joint family estate."
    },
    {
      "case_name": "Rani Sartaj Kuari v. Deoraj Kuari",
      "citation": "15 I.A. 51",
      "treatment": "followed",
      "relevance": "Right to restrain alienations incompatible with impartibility."
    },
    {
      "case_name": "First Pittapur case",
      "citation": "26 I.A. 83",
      "treatment": "followed",
      "relevance": "Right to maintenance and survivorship remain in impartible joint family property."
    },
    {
      "case_name": "Collector of Gorakhpur v. Ram Sunder Mal",
      "citation": "61 I.A. 286",
      "treatment": "followed",
      "relevance": "Right of maintenance to junior members out of impartible estate based on joint ownership."
    },
    {
      "case_name": "Baijnath Prasad Singh v. Tej Bali Singh",
      "citation": "48 I.A. 195",
      "treatment": "followed",
      "relevance": "Negatives view destructive of joint family property doctrine for impartible zamindari; right of survivorship not mere spes."
    },
    {
      "case_name": "Raja Yarlagadda Mallikariuna Prasad Nayadu v. Raja Yarlagadda Durga Prasad Nayadu (Challapalli case)",
      "citation": null,
      "treatment": "followed",
      "relevance": "Junior members holding lands for maintenance considered joint in estate with zamindar."
    },
    {
      "case_name": "Protap Chandra Deo v. Jagadish Chandra Deo",
      "citation": "54 I.A. 289",
      "treatment": "referred",
      "relevance": "Power of holder of impartible raj to dispose by will."
    }
  ],
  "statutes_cited": [
    {
      "name": "U.P. Zamindari Abolition and Land Reforms Act, 1950 (U.P. Act 1 of 1951)",
      "sections": [
        "s. 3(12)",
        "s. 23",
        "s. 24",
        "s. 73",
        "s. 79"
      ],
      "relevance": "Defines intermediary; prohibits recognition of transfers by sale/gift after July 1, 1948 for rehab grant; provides for payment of rehab grant to intermediaries except thekedars with revenue >10k; application for determination."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court rejected the appellant's arguments, holding that the Gujaranama deed was not a transfer by way of sale or gift under s.23 but a settlement in lieu of maintenance right in an impartible estate, thus recognised for rehabilitation grant purposes. No remand ordered due to absence of factual disputes.",
    "relief_granted": "Respondent entitled to rehabilitation grant as determined by lower authorities.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"according to law and custom the eldest son of the Raja becomes the owner of the estate on the death of the earlier Raja and the younger sons have a right to maintenance and they are given a reasonable share of the estate in lieu of the right of maintenance\"",
      "speaker": "court",
      "significance": "Admission in Gujaranama deed confirming customary maintenance right."
    },
    {
      "text": "\"the Gujaranama deed dated October 5, 1949 is not hit by the provision of s. 23 of the Act\"",
      "speaker": "court",
      "significance": "Core holding rejecting appellant's main contention."
    },
    {
      "text": "\"the right of maintenance to junior members out of an impartible estate was based on joint ownership of the junior members of the family\"",
      "speaker": "court",
      "significance": "Explains legal basis for recognising the transfer."
    }
  ],
  "_case_id": "1969_225",
  "_label": 0,
  "_text_length": 13712,
  "_extracted_at": "2026-02-10T20:26:55.315893"
}