{
  "metadata": {
    "case_name": "Remington Rand of India Ltd. v. Their Workmen",
    "case_year": 1966,
    "court": "Supreme Court of India",
    "judges": [
      "Shelat, J."
    ],
    "case_number": "Civil Appeal No. 1551 of 1966",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Workmen of appellant-company in Madras and other branches demanded revision of wage-scales, dearness allowance, medical benefit, bonus for 1963-64, gratuity etc.",
      "type": "material",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f2",
      "text": "Disputes referred by Government of Madras to Industrial Tribunal, Madras vide notification dated April 6, 1965 in I.D. No. 21 of 1965.",
      "type": "procedural",
      "date": "1965-04-06",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Tribunal granted some demands and rejected rest; award dated February 28, 1966.",
      "type": "procedural",
      "date": "1966-02-28",
      "source": "lower_court"
    },
    {
      "id": "f4",
      "text": "Company filed appeal by special leave challenging award only on bonus for 1963-64, medical benefits, and revision of gratuity scheme.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "Company had paid bonus at 4 months basic pay; workmen demanded maximum per Payment of Bonus Act, 1965 on consolidated wages; Tribunal granted 20% of consolidated wages.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Workmen's demand for medical: reimbursement of all medical expenses on production of bills; cited Calcutta scheme; rejected company's offer of medical officer and Rs.100 medicines per year as discriminatory.",
      "type": "material",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f7",
      "text": "Tribunal framed medical scheme: company to pay cost of medicines prescribed by company's doctor and all hospitalization if recommended by company's doctor; no ceiling.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Workmen's gratuity demands: enhance max limit from 15 to 20 months salary; gratuity payable even on dismissal for misconduct minus financial loss.",
      "type": "material",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f9",
      "text": "Tribunal modified gratuity scheme accepting demands; qualifying period graded 5-15 years, gratuity on dismissal minus loss.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Company has medical scheme for Calcutta workmen; extended to Bangalore, Hyderabad, Kerala via prior SC decisions.",
      "type": "background",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether bonus for 1963-64 should be calculated per Payment of Bonus Act, 1965 or Full Bench Formula.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether Tribunal's medical benefit scheme without ceiling is justified or Calcutta scheme should apply.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether gratuity payable on dismissal for misconduct, qualifying period, and forfeiture for grave misconduct.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Bonus award at 20% consolidated wages invalid as Payment of Bonus Act, 1965 inapplicable to 1963-64; calculate per Full Bench Formula.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": "Jalan Trading Co. v. Mill Mazdoor Union (1967) 1 S.C.R. 15"
    },
    {
      "id": "pa2",
      "text": "Medical scheme should match Calcutta scheme with ceiling; Tribunal unjustified in imposing unlimited burden including major diseases/hospitalization.",
      "supporting_facts": [
        "f6",
        "f7",
        "f10"
      ],
      "legal_basis": "Remington Rand of India v. The Workmen (C.A. Nos. 856, 1475, 2119 of 1968, Dec 10, 1968)"
    },
    {
      "id": "pa3",
      "text": "Gratuity not payable on dismissal for misconduct, especially gross like violence; qualifying period 15 years; deduct loss insufficient for grave misconduct.",
      "supporting_facts": [
        "f8",
        "f9"
      ],
      "legal_basis": "Calcutta Insurance Co. Ltd. v. Their Workmen (1967) 2 S.C.R. 596; Delhi Cloth General Mills Co. Ltd. v. The Workmen (1969) 2 S.C.R. 307"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Conceded bonus per Full Bench Formula as Act inapplicable.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": "Jalan Trading Co. v. Mill Mazdoor Union"
    },
    {
      "id": "ra2",
      "text": "No need for uniform conditions across regions; Tribunal's scheme fair, no interference to match Calcutta.",
      "supporting_facts": [
        "f6",
        "f7"
      ],
      "legal_basis": null
    },
    {
      "id": "ra3",
      "text": "Gratuity earned for long service; payable on dismissal minus monetary loss only; prior decisions do not require 15 years qual or forfeiture for grave misconduct.",
      "supporting_facts": [
        "f8",
        "f9"
      ],
      "legal_basis": "Garment Cleaning Works v. Its Workmen (1962) 2 S.C.R. 711"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Bonus Act inapplicable; set aside award and remand for calculation per Full Bench Formula.",
      "addresses_issue": "i1",
      "key_observation": "Concession by respondents; Jalan Trading decision applies."
    },
    {
      "id": "cr2",
      "text": "Medical: No difference between regions; substitute Tribunal scheme with Calcutta scheme as fair and reasonable; extends to family except contagious diseases.",
      "addresses_issue": "i2",
      "key_observation": "Prior Remington Rand decisions applied Calcutta scheme to other regions."
    },
    {
      "id": "cr3",
      "text": "Gratuity: Qualifying period 15 years continuous service for dismissal on misconduct; forfeiture for grave misconduct (violence, riotous behaviour) even without monetary loss; gratuity ensures good conduct to end.",
      "addresses_issue": "i3",
      "key_observation": "Distinguishes simple vs grave misconduct; follows Calcutta Insurance and Delhi Cloth; rejects general forfeiture but allows for indiscipline."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Bonus for 1963-64 per Full Bench Formula, not Bonus Act.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Medical scheme substituted with Calcutta scheme details provided.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h3",
      "text": "Gratuity scheme modified: 15 years qual for misconduct dismissal; forfeiture for violence/riotous behaviour; otherwise deduct loss.",
      "resolves_issue": "i3",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Jalan Trading Co. v. Mill Mazdoor Union",
      "citation": "1967 1 S.C.R. 15",
      "treatment": "followed",
      "relevance": "Bonus Act 1965 inapplicable to 1963-64"
    },
    {
      "case_name": "Remington Rand of India v. The Workmen",
      "citation": "C.A. Nos. 856, 1475 and 2119 of 1968, decided Dec 10, 1968",
      "treatment": "followed",
      "relevance": "Applied Calcutta medical scheme to Bangalore etc."
    },
    {
      "case_name": "Calcutta Insurance Co. Ltd. v. Their Workmen",
      "citation": "1967 2 S.C.R. 596",
      "treatment": "followed",
      "relevance": "15 years qual for gratuity on misconduct dismissal; good conduct to end"
    },
    {
      "case_name": "Delhi Cloth General Mills Co. Ltd. v. The Workmen",
      "citation": "1969 2 S.C.R. 307",
      "treatment": "followed",
      "relevance": "Forfeiture of gratuity for grave misconduct like violence even without monetary loss"
    },
    {
      "case_name": "Garment Cleaning Works v. Its Workmen",
      "citation": "1962 2 S.C.R. 711",
      "treatment": "distinguished",
      "relevance": "Rejected general forfeiture; approved deduction of loss but not for grave misconduct"
    },
    {
      "case_name": "Motipur Zamindari P Ltd. v. Workmen",
      "citation": "1965 2 L.L.J. 139",
      "treatment": "distinguished",
      "relevance": "Deduction of loss instead of forfeiture for moral turpitude"
    },
    {
      "case_name": "Employees v. Reserve Bank of India",
      "citation": "1966 1 S.C.R. 25",
      "treatment": "referred",
      "relevance": "Substituted forfeiture with deduction of loss"
    },
    {
      "case_name": "Remington Rand of India Ltd. v. Their Workmen (Bangalore)",
      "citation": "1968 1 L.L.J. 542",
      "treatment": "followed",
      "relevance": "15 years qual for misconduct cases"
    },
    {
      "case_name": "Remington Rand of India v. The Workmen (Kerala)",
      "citation": "1968 1 S.C.R. 164",
      "treatment": "followed",
      "relevance": "15 years qual for misconduct"
    }
  ],
  "statutes_cited": [
    {
      "name": "Payment of Bonus Act, 1965",
      "sections": [],
      "relevance": "Inapplicable to bonus year 1963-64"
    }
  ],
  "outcome": {
    "disposition": "partially_accepted",
    "summary": "Appeal allowed; award set aside on bonus (remanded for Full Bench Formula), medical (substituted Calcutta scheme), gratuity (modified with 15 years qual for misconduct and forfeiture for grave misconduct).",
    "relief_granted": "Modifications to schemes as directed; bonus remanded.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"Gratuity is not paid to the employee gratuitously or merely as a matter of boon. It is paid to him for the service rendered by him to the employer, and when it is once earned it is difficult to understand why it should necessarily be denied to him whatever may be the nature of misconduct for his dismissal.\"",
      "speaker": "court",
      "significance": "From Garment Cleaning, distinguished for grave misconduct"
    },
    {
      "text": "\"Long and meritorious service must mean long and unbroken period of service meritorious to the end.\"",
      "speaker": "court",
      "significance": "From Calcutta Insurance, basis for 15 years qual and good conduct"
    },
    {
      "text": "Distinction between technical misconduct, misconduct causing damage, and serious misconduct like violence which may entail forfeiture of gratuity.",
      "speaker": "court",
      "significance": "From Delhi Cloth, adopted for gratuity scheme modification"
    }
  ],
  "_case_id": "1969_121",
  "_label": 1,
  "_text_length": 34600,
  "_extracted_at": "2026-02-10T20:26:01.036380"
}