{
  "metadata": {
    "case_name": "Kanpur Nagar Mahapalika (formerly Municipal Board, Kanpur) v. Respondent",
    "case_year": 1966,
    "court": "Supreme Court of India",
    "judges": [
      "Ray, J."
    ],
    "case_number": "Civil Appeal No. 1749 of 1966",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The appellant was formerly known as Municipal Board, Kanpur and thereafter as Kanpur Nagar Mahapalika. The appellant in the former name of Municipal Board, Kanpur and the respondent entered into a contract in writing for construction of zone pumping stations and reservoirs at Kanpur. One of the clauses in the said agreement in writing contained an arbitration agreement between the parties.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The respondent filed original suit No. 45 of 1946 in the Court of Civil and Sessions Judge, Kanpur, against the Municipal Board, Kanpur and claimed a sum of Rs. 60,802-4-9 representing the claims on account of balance sum due according to the final bills, interest on the amount due, refund of security deposit and interest thereon.",
      "type": "material",
      "date": "1946",
      "source": "respondent"
    },
    {
      "id": "f3",
      "text": "The Municipal Board, Kanpur thereafter made an application under section 34 of the Arbitration Act, 1940 for stay of the suit contending that the suit related to a matter agreed to be referred to arbitration. On 9th August, 1952, the Court ordered stay of the proceedings.",
      "type": "procedural",
      "date": "1952-08-09",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The plaintiff preferred an appeal against the order. By an order dated 4th November, 1957 the High Court at Allahabad directed that since the appeal was not pressed by the plaintiff the Court should proceed with the matter of reference.",
      "type": "procedural",
      "date": "1957-11-04",
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "Thereafter on 17th May, 1958 the Court of Additional Civil Judge, Kanpur sent the matter to Shri K. Roy, Superintending Engineer, who was appointed an arbitrator on the reference.",
      "type": "procedural",
      "date": "1958-05-17",
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "The arbitrator on 8th March, 1960 made an award in favour of the plaintiff respondent for the sum of Rs. 42,772-2-9 on account of final bill, a sum of Rs. 9,705/- on account of refund of security deposit and interest on the security deposit.",
      "type": "material",
      "date": "1960-03-08",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "The appellant thereafter made an application for setting aside the award on the ground that the arbitrator misconducted himself in the proceedings by not properly considering and deciding that the claim of the plaintiff was barred by section 326 of the U.P. Act 2 of 1916.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "The Additional Civil Judge, Kanpur by judgment dated 31st May, 1960 set aside the award by holding that the arbitrator wrongly decided the point of limitation and thereby misconducted himself.",
      "type": "procedural",
      "date": "1960-05-31",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "The High Court at Allahabad by judgment dated 3rd May, 1962 reversing the order of the Civil Judge setting aside an award.",
      "type": "procedural",
      "date": "1962-05-03",
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the arbitrator misconducted himself by not properly considering and deciding that the claim was barred by section 326 of the U.P. Act 2 of 1916, and whether there was an error of law apparent on the face of the award.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the claim by the contractor for money due on account of the work done was governed by section 326 of the U.P. Act prescribing six months limitation or by three years under the Limitation Act.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The award was bad by reason of an error apparent on the face of the award. The arbitrator misconducted himself by not properly considering and deciding that the claim was barred by section 326 of the U.P. Act 2 of 1916. The arbitrator should have specifically dealt with the question of limitation.",
      "supporting_facts": [
        "f2",
        "f6",
        "f7"
      ],
      "legal_basis": "Section 326 of the U.P. Act 2 of 1916"
    },
    {
      "id": "pa2",
      "text": "If an error of law appears on the face of the award it is a ground for remitting it or setting it aside.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": "Arbitration Act, 1940"
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The High Court referred to two lines of decisions of the Allahabad High Court on whether the claim was governed by section 326 (six months) or Limitation Act (three years). The High Court concluded that if the arbitrator had decided in favour of the plaintiff and did not accept the six months limitation under section 326, it would not be an error of law apparent on the face of the Award.",
      "addresses_issue": "i2",
      "key_observation": "Error of law on face of award requires a legal proposition in the award or incorporated document that is erroneous."
    },
    {
      "id": "cr2",
      "text": "In the present case, the award does not lay down any proposition of law on the question of limitation. The award does not put any construction on section 326. An error of law on the face means some legal proposition which is the basis of the award and erroneous.",
      "addresses_issue": "i1",
      "key_observation": "No legal proposition forming basis of award, hence no error apparent on face."
    },
    {
      "id": "cr3",
      "text": "It is sufficient if the arbitrator gives an award on the whole case without dealing with each issue separately. Mistakes in law or fact not appearing on face do not vitiate award.",
      "addresses_issue": "i1",
      "key_observation": "Arbitrator decides questions within jurisdiction; no principle of construction not countenanced by law appears on face."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The award cannot be impeached for error on face as it contains no legal proposition as basis. High Court was correct in refusing to set aside the award.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Messrs. Alopi Parshad and Sons Ltd. v. Union of India",
      "citation": "1962 S.C.R. 793",
      "treatment": "followed",
      "relevance": "Distinction between general reference and specific reference on question of law."
    },
    {
      "case_name": "Champsey Bhara Co. v. Jivraj Balloo Spinning and Weaving Co. Ltd.",
      "citation": "1923 A.C. 480",
      "treatment": "followed",
      "relevance": "Error of law on face means legal proposition in award or incorporated document that is erroneous."
    },
    {
      "case_name": "Dr. S. Dutt v. University of Delhi",
      "citation": "A.I.R. 1958 S.C. 1050",
      "treatment": "followed",
      "relevance": "Award discloses error on face if it contains erroneous legal proposition in itself or incorporated paper."
    }
  ],
  "statutes_cited": [
    {
      "name": "Arbitration Act, 1940",
      "sections": [
        "Section 34"
      ],
      "relevance": "Application for stay of suit; ground for setting aside award if error on face."
    },
    {
      "name": "U.P. Act 2 of 1916 (Municipalities Act)",
      "sections": [
        "Section 326"
      ],
      "relevance": "Prescribes six months limitation for contractor claims against Municipal Board; disputed if applicable."
    },
    {
      "name": "Limitation Act",
      "sections": [],
      "relevance": "Three years period for claims, alternative to section 326."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal fails and is dismissed with costs. The High Court was correct in reversing the lower court's order setting aside the award and restoring it.",
    "relief_granted": "Award in favour of respondent upheld (Rs. 42,772-2-9 final bill + Rs. 9,705 security deposit + interest).",
    "costs": "Dismissed with costs."
  },
  "key_quotes": [
    {
      "text": "If an error of law appears on the face of the award it is a ground for remitting it or setting it aside.",
      "speaker": "court",
      "significance": "States ground for challenging award under Arbitration Act."
    },
    {
      "text": "An error of law on the face of the award means that one can find in the award, or in a document actually incorporated thereto... some legal proposition which is the basis of the award and which one can then say is erroneous.",
      "speaker": "court",
      "significance": "Defines 'error of law on face of award' quoting Lord Dunedin."
    },
    {
      "text": "The award in the present case cannot be impeached either for stating the reasons for the judgment or for stating any legal proposition which is the basis of the award.",
      "speaker": "court",
      "significance": "Core holding why award upheld."
    }
  ],
  "_case_id": "1969_85",
  "_label": 0,
  "_text_length": 6434,
  "_extracted_at": "2026-02-10T20:25:12.855998"
}