{
  "metadata": {
    "case_name": "Sons of Meda v. Buru and others",
    "case_year": 1966,
    "court": "Supreme Court of India",
    "judges": [
      "Shah, J."
    ],
    "case_number": "Civil Appeal No. 1115 of 1966",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Ram Sarup was the owner of a piece of land measuring 30 bighas 12 biswas.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "By a deed dated August 16, 1935, Ram Sarup mortgaged without possession a part of the land measuring approximately 26 bighas with one Meda.",
      "type": "material",
      "date": "1935-08-16",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Ram Sarup on November 27, 1941, mortgaged with possession the entire area of the land to Ananda.",
      "type": "material",
      "date": "1941-11-27",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Ram Sarup then sold his rights in 27 bighas and 1 biswa of the land on May 14, 1943 to Buru and others--who may be collectively called the plaintiffs--for Rs. 6,000.",
      "type": "material",
      "date": "1943-05-14",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The plaintiffs then applied on May 23, 1951, under s. 4 of the Redemption of Mortgages Punjab Act 2 of 1913 for redeeming the mortgage in favour of Meda.",
      "type": "procedural",
      "date": "1951-05-23",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "This application was rejected on June 29, 1951.",
      "type": "procedural",
      "date": "1951-06-29",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Thereafter the plaintiffs instituted on August 20, 1960, a suit in the civil court for redemption of the mortgage.",
      "type": "procedural",
      "date": "1960-08-20",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "The suit was resisted, inter alia, on the ground that the period of limitation prescribed by Art. 14 of the Indian Limitation Act, 1908, had expired.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f9",
      "text": "The record of the proceedings before the Assistant Collector was destroyed before the suit was filed, and an extract from the register of redemption applications could be tendered in evidence. The last column of the extract contained the entry 'The application is rejected and should be consigned to the record room.'",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "An endorsement on the docket maintained by the Advocate who appeared in the case before the Assistant Collector showed an endorsement dated June 29, 1951 'Application rejected. The petitioner has today been ordered to file a civil suit.'",
      "type": "procedural",
      "date": "1951-06-29",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "The Trial Court dismissed the suit for redemption of the mortgage in favour of Meda, and granted a decree for redemption of the second mortgage dated November 27, 1941.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "The plaintiffs appealed to the District Court, Gurgaon. The District Court allowed the appeal and ordered redemption of the land including the mortgage in favour of Meda.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "The decree passed by the District Court was confirmed in second appeal by the High Court of Punjab dated November 18, 1965 in Regular Second Appeal No. 1169 of 1962.",
      "type": "procedural",
      "date": "1965-11-18",
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "With special leave, this appeal has been preferred by sons of Meda.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f15",
      "text": "The Trial Court and the District Court held that the petition for redemption was not tried by the Assistant Collector; he rejected the petition holding that the application raised complicated questions of fact and law, and on that account was not triable in exercise of the summary jurisdiction prescribed under Act 2 of 1913. With this view the High Court agreed.",
      "type": "admitted",
      "date": null,
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the suit for redemption of the first mortgage in favour of Meda was barred by limitation under Art. 14 of the Limitation Act, 1908, due to the rejection of the application under s. 4 of the Redemption of Mortgages Punjab Act 2 of 1913 on June 29, 1951, and the finality under s. 12 of that Act.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The order of the Assistant Collector rejecting the petition under s. 4 of the Punjab Act 2 of 1913 became final by virtue of s. 12 of the Act and the mortgagor could not sue to redeem the mortgage in favour of Meda after the expiry of one year from the date of the order, as per Art. 14 of the Limitation Act, 1908.",
      "supporting_facts": [
        "f6",
        "f8",
        "f15"
      ],
      "legal_basis": "Section 12, Redemption of Mortgages Punjab Act 2 of 1913; Article 14, Indian Limitation Act, 1908"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The Assistant Collector rejected the petition holding that the application raised complicated questions of fact and law, which could not be tried in a summary proceeding under the Act.",
      "supporting_facts": [
        "f10",
        "f15"
      ],
      "legal_basis": "Redemption of Mortgages Punjab Act 2 of 1913"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Section 9(1)(a) of the Act authorises the Collector to dismiss the petition for reasons to be recorded, where the mortgagee raises objection on a ground other than the amount of deposit or if the mortgagor is not willing to pay the sum demanded by the mortgagee. There is no evidence that the mortgagor declined to pay the sum demanded by the mortgagee. Again the Assistant Collector did not pass an order dismissing the petition for any reasons recorded by him. He merely ordered that the case raised complicated questions of fact and law which could not be tried in a summary proceeding. Such an order, in our judgment, does not fall within the terms of s. 9 of Act 2 of 1913.",
      "addresses_issue": "i1",
      "key_observation": "Even if by the order the petition was dismissed, not the form of the order, but its substance will determine the application of the period of limitation prescribed by Art. 14 of the Limitation Act."
    },
    {
      "id": "cr2",
      "text": "An order relegating the mortgagor to a civil suit for obtaining an order of redemption even if it becomes final does not bar a suit for redemption, for it raises no cloud on the title of the mortgagor arising out of the mortgage. Such an order is not one which is required to be set aside. An order required to be set aside is one which the officer making it has jurisdiction to make and has the effect of barring the claim for relief unless it is set aside.",
      "addresses_issue": "i1",
      "key_observation": "The order of the Assistant Collector merely declared the rights of the plaintiff under the common law. It did not bar the claim to relief for redemption in a civil suit, and on that account it was not an order which was required to be set aside."
    },
    {
      "id": "cr3",
      "text": "Cites Tulsi Das v. Diala Ram and Dewan Chand v. Raghbir Singh supporting that no suit under s. 12 is necessary or competent to establish rights, and there is no bar to the mortgagor suing for redemption in the civil courts within the period allowed by law in ordinary course.",
      "addresses_issue": "i1",
      "key_observation": "The suit referred to in s. 12 is to establish the erroneous nature of the order, but no civil court can grant a declaration that the Collector's view was wrong and compel summary enquiry."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "We are unable to agree with the appellants' contention that since no suit was filed within one year of the date on which the application of the plaintiffs was rejected by the Assistant Collector, the order dismissing the application was conclusive, and the suit for redemption by the plaintiffs was not maintainable.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Tulsi Das v. Diala Ram",
      "citation": null,
      "treatment": "followed",
      "relevance": "The order of the Collector does not affect the rights of the parties; no suit under s. 12 necessary, no bar to civil suit for redemption."
    },
    {
      "case_name": "Dewan Chand v. Raghbir Singh",
      "citation": null,
      "treatment": "followed",
      "relevance": "Same view expressed that no bar to mortgagor suing for redemption in civil courts."
    }
  ],
  "statutes_cited": [
    {
      "name": "Redemption of Mortgages (Punjab) Act 2 of 1913",
      "sections": [
        "Section 4",
        "Section 5",
        "Section 6",
        "Section 7",
        "Section 8",
        "Section 9",
        "Section 10",
        "Section 11",
        "Section 12"
      ],
      "relevance": "Governs summary redemption proceedings; order under s.9(1)(a) requires reasons; s.12 allows suit to establish rights but order not barring civil redemption suit if merely relegating to civil court."
    },
    {
      "name": "Indian Limitation Act, 1908",
      "sections": [
        "Article 14, Schedule 1"
      ],
      "relevance": "Prescribes one year limitation for suit to set aside order of government officer; does not apply as order not required to be set aside."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court dismissed the appeal by special leave preferred by the sons of Meda, confirming the decree of the Punjab High Court, District Court, and allowing the plaintiffs' suit for redemption of both mortgages including the one in favour of Meda.",
    "relief_granted": "Redemption of the land including the mortgage in favour of Meda.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "Such an order, in our judgment, does not fall within the terms of s. 9 of Act 2 of 1913.",
      "speaker": "court",
      "significance": "Determines that the rejection order was not a valid dismissal under the Act triggering limitation."
    },
    {
      "text": "An order relegating the mortgagor to a civil suit for obtaining an order of redemption even if it becomes final does not bar a suit for redemption.",
      "speaker": "court",
      "significance": "Core holding that the order does not create a bar under limitation law."
    },
    {
      "text": "The order of the Collector does not affect the rights of the parties in any way it is conclusive to this extent only that the petition for summary redemption has been dismissed and no other petition under the Act would lie.",
      "speaker": "court",
      "significance": "Explains limited effect of the Collector's order, quoting Tulsi Das v. Diala Ram."
    }
  ],
  "_case_id": "1969_229",
  "_label": 0,
  "_text_length": 8919,
  "_extracted_at": "2026-02-10T20:27:33.538497"
}