{
  "metadata": {
    "case_name": "Motor Industries Company Employees Association v. Motor Industries Company",
    "case_year": 1968,
    "court": "Supreme Court of India",
    "judges": [
      "Shelat, J"
    ],
    "case_number": "Civil Appeal No. 2123 of 1968",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "On August 24, 1964 the said association handed over to the management a charter of demands.",
      "type": "background",
      "date": "1964-08-24",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Negotiations between the parties having failed, the demands were taken before the conciliation officer when the parties arrived at a settlement dated December 23, 1964.",
      "type": "background",
      "date": "1964-12-23",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On April 29, 1966, the management issued a notice suspending for a day, i.e., May 4, 1966, one B. G. Shenoy as and by way of penalty.",
      "type": "material",
      "date": "1966-04-29",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "In consequence of a protest by the association, the said suspension was postponed and on May 10, 1966, the management served a charge-sheet on Shenoy and suspended him pending an enquiry.",
      "type": "material",
      "date": "1966-05-10",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "On May 11, 1966 the association demanded withdrawal of the said suspension and the said charge-sheet.",
      "type": "material",
      "date": "1966-05-11",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Discussions took place on that day from 9.45 A.M. to 12.30 P.M. between the association and the management and the parties thereafter adjourned at 1 P.M. for lunch having decided to resume the talks at 2.30 P.M.",
      "type": "procedural",
      "date": "1966-05-11",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "At 2 P.M. the first shift ended and the workers of the second shift began to come in. The workmen of the first shift, however, stayed on and those of the second shift along with the workmen of the general shift joined them and all of them went on strike.",
      "type": "material",
      "date": "1966-05-11",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "The discussions which were resumed at 2.30 P.M. ended in an agreement at 5 P.M. and the workmen returned to work.",
      "type": "material",
      "date": "1966-05-11",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "On May 18, 1966 the assistant establishment officer submitted a complaint to the chief personnel officer alleging certain acts of misconduct by a crowd of workmen mentioning therein the names of five of them including the said three workmen.",
      "type": "material",
      "date": "1966-05-18",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "On May 25, 1966 charge-sheets alleging stoppage of work, abandoning the place of work, inciting clerks and officers of G. 2 department to join the said strike, disorderly behaviour including intimidation and assault on one, A. Lakshman Rao, were served upon those five workmen.",
      "type": "material",
      "date": "1966-05-25",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Correspondence thereafter ensued between the association and the management wherein the association protested against the management's decision to adopt disciplinary action against the said five workmen despite the agreement arrived at on May 11, 1966.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "A domestic enquiry was held on June 30, 1966 which was completed on July 27, 1966 when the enquiry officer made his report holding the said three workmen, Sandhyavoo, Prabhakar and Vasudevan, guilty of acts of misconduct under standing order 22(2), (3), (13) and (18). He exonerated the other two workmen except on the charge of participating in the strike and loitering about under clauses (2) and (18) of the said standing order.",
      "type": "procedural",
      "date": "1966-06-30",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "On August 12, 1966, the management, agreeing with the report, passed orders of dismissal against the said three workmen which gave rise to the said reference.",
      "type": "material",
      "date": "1966-08-12",
      "source": "court"
    },
    {
      "id": "f14",
      "text": "The Government of Mysore referred the dispute to the Labour Court, Bangalore, for adjudication under S. 10(1)(c) of the Industrial Disputes Act, 1947 in Reference No. 39 of 1967.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f15",
      "text": "On March 23, 1968 the Labour Court gave its award holding that the said enquiry was validly held and that the management were justified in passing the said orders of dismissal.",
      "type": "procedural",
      "date": "1968-03-23",
      "source": "lower_court"
    },
    {
      "id": "f16",
      "text": "The agreement dated May 11, 1966 was oral. According to Bernard, Secretary of the association, the agreement was that (a) the charges and the suspension order passed against the said Shenoy should be withdrawn (b) the company should pay the wages for the 3½ hours period of the strike provided the workmen made good the loss of production during that period, and (c) the management would take no action against any one for going on strike.",
      "type": "disputed",
      "date": "1966-05-11",
      "source": "petitioner"
    },
    {
      "id": "f17",
      "text": "The evidence of Martin, the company's technical director, was that the company agreed only not to punish the said Shenoy and to consider paying wages for the hours of the strike.",
      "type": "disputed",
      "date": "1966-05-11",
      "source": "respondent"
    },
    {
      "id": "f18",
      "text": "The Labour Court held that the association failed to prove that the management had agreed not to take action against any of the workmen in connection with the strike though it may be that they might have agreed not to victimise any workman for participating in the strike.",
      "type": "admitted",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f19",
      "text": "Evidence showed that Vasudevan along with other workmen entered the G. 2 department at about 3 P.M. on that day and thumping his hand on the table of the said Lakshman Rao threatened that officer in the following words: 'I am in the forefront of the crowd. You cannot do anything. You ask your people to come out and you also come out. Otherwise you can see what we can do for you.'",
      "type": "material",
      "date": "1966-05-11",
      "source": "respondent"
    },
    {
      "id": "f20",
      "text": "The said Lakshman Rao had also deposed that he was surrounded by the workers who started pushing and pulling him.",
      "type": "material",
      "date": "1966-05-11",
      "source": "respondent"
    },
    {
      "id": "f21",
      "text": "Evidence against Prabhakar was that he too was in the forefront of that crowd which squeezed Lakshman Rao and some members thereof inflicted kicks on him.",
      "type": "material",
      "date": "1966-05-11",
      "source": "respondent"
    },
    {
      "id": "f22",
      "text": "Evidence of one Raja, the assistant personnel officer, and others that Sandhyavoo was one of those in the forefront of that crowd. According to Raja, Sandhyavoo tried to lift him from his seat with a view to force him to leave his table and finding that the crowd had become restive he left his place.",
      "type": "material",
      "date": "1966-05-11",
      "source": "respondent"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the strike was illegal under s. 24 of the Industrial Disputes Act or in contravention of any law as required by standing order 22(2) and (3), given that the association did not give a call for the strike.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether the disciplinary proceedings were in contravention of the agreement arrived at on May 11, 1966, and therefore, the dismissal amounted to unfair labour practice.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether the orders of dismissal were passed on charges including that of intimidation though the misconduct of intimidation was not found proved by the enquiry officer.",
      "framed_by": "petitioner"
    },
    {
      "id": "i4",
      "text": "Whether punishing only three workmen when a large number of workmen had taken part constituted victimisation.",
      "framed_by": "petitioner"
    },
    {
      "id": "i5",
      "text": "Whether the findings of the enquiry officer were based on no evidence or were perverse.",
      "framed_by": "petitioner"
    },
    {
      "id": "i6",
      "text": "Construction of cl. 5 of the settlement dated December 23, 1964: whether it imposed notice obligation only on the association and not on individual workmen.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The said association not having given a call for the said strike, the said charges were misconceived and the orders of dismissal were consequently not sustainable.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "Settlement dated December 23, 1964 cl. 5; s. 23, s. 24 Industrial Disputes Act"
    },
    {
      "id": "pa2",
      "text": "The said strike, which was spontaneously staged by the workmen, was not illegal under s. 24 of the Industrial Disputes Act, nor was it in contravention of any law as required by standing order 22(2) and (3).",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "s. 24 Industrial Disputes Act; Standing Order 22(2),(3)"
    },
    {
      "id": "pa3",
      "text": "The said disciplinary proceedings were in contravention of the agreement arrived at on May 11, 1966, and therefore, the dismissal following such disciplinary proceedings amounted to unfair labour practice.",
      "supporting_facts": [
        "f8",
        "f16"
      ],
      "legal_basis": "Agreement dated May 11, 1966"
    },
    {
      "id": "pa4",
      "text": "The orders of dismissal were passed on charges including that of intimidation though the misconduct of intimidation was not found proved by the enquiry officer and hence the said orders were illegal.",
      "supporting_facts": [
        "f12"
      ],
      "legal_basis": null
    },
    {
      "id": "pa5",
      "text": "To punish only three workmen when a large number of workmen had taken part in staging the strike and in inciting others to join it constituted victimisation.",
      "supporting_facts": [
        "f7",
        "f13"
      ],
      "legal_basis": null
    },
    {
      "id": "pa6",
      "text": "The findings of the enquiry officer were based on no evidence or were perverse in that no reasonable body of persons could have arrived at them on the evidence before him.",
      "supporting_facts": [
        "f12"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The strike was in breach of cl. 5 of the settlement dated December 23, 1964, which bound the workmen as represented by the association.",
      "supporting_facts": [
        "f2",
        "f7"
      ],
      "legal_basis": "Industrial Disputes Act ss. 2(p), 18(3), 12(3); Standing Order 22(2),(3),(13),(18)"
    },
    {
      "id": "ra2",
      "text": "The oral agreement on May 11, 1966 did not include a promise not to take disciplinary action against workmen for the strike.",
      "supporting_facts": [
        "f8",
        "f17"
      ],
      "legal_basis": null
    },
    {
      "id": "ra3",
      "text": "The enquiry officer's findings included disorderly behaviour which encompassed intimidation based on accepted evidence.",
      "supporting_facts": [
        "f12",
        "f19",
        "f20",
        "f21",
        "f22"
      ],
      "legal_basis": null
    },
    {
      "id": "ra4",
      "text": "The three workmen were leaders in the forefront of the crowd committing graver misconduct, justifying selective action without victimisation.",
      "supporting_facts": [
        "f19",
        "f20",
        "f21",
        "f22",
        "f13"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The construction of cl. 5 of the settlement suggested by Mr. Ramamurthi is contrary to (a) the tenor of that settlement, (b) the provisions of the Industrial Disputes Act under which a settlement arrived at between an employer and a union representing the employees during conciliation proceedings is binding not only on such union but also the workmen whom it represents and (c) the principles of collective bargaining recognised by industrial law.",
      "addresses_issue": "i6",
      "key_observation": "Settlement binds workmen represented by association; cl. 5 prohibits direct action without notice by either party, including strikes by workmen without association call."
    },
    {
      "id": "cr2",
      "text": "The strike was a lightning one, was resorted to without notice and was not at the call of the association and was, therefore, in breach of cl. 5. It was illegal not under s. 24 but under s. 29 as breach of binding settlement.",
      "addresses_issue": "i1",
      "key_observation": "Participation in or incitement to such strike constitutes misconduct under Standing Order 22."
    },
    {
      "id": "cr3",
      "text": "Labour Court finding that association failed to prove management agreed not to take action against workmen for the strike is a finding of fact with cogent reasons; no interference.",
      "addresses_issue": "i2",
      "key_observation": "Management did not impose penalty for mere joining strike."
    },
    {
      "id": "cr4",
      "text": "Enquiry officer accepted evidence of management's witnesses detailing threats, pushing, kicking, and forcing officers out, which constitutes intimidation though not explicitly stated; finding of disorderly behaviour includes it.",
      "addresses_issue": "i3",
      "key_observation": "Acceptance of evidence means acceptance of intimidation version."
    },
    {
      "id": "cr5",
      "text": "Management took serious view only of incitement, intimidation and disorderly behaviour by leaders in forefront; no discrimination or victimisation as they were not equally situated with others.",
      "addresses_issue": "i4",
      "key_observation": "No action for mere participation/loitering common to all."
    },
    {
      "id": "cr6",
      "text": "Findings not perverse; evidence supports leaders' role in graver acts; selecting leaders for action not wrong.",
      "addresses_issue": "i5",
      "key_observation": "Domestic enquiry suffered no infirmity."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Cl. 5 of settlement binds workmen; lightning strike without notice in breach of settlement is illegal under s. 29; participation/incitement is misconduct under Standing Order 22.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "No proof of agreement on May 11 barring disciplinary action; proceedings not unfair labour practice.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Enquiry officer's finding of disorderly behaviour includes intimidation based on accepted evidence.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    },
    {
      "id": "h4",
      "text": "Selective punishment of leaders for graver misconduct not victimisation or discrimination.",
      "resolves_issue": "i4",
      "in_favor_of": "respondent"
    },
    {
      "id": "h5",
      "text": "Enquiry findings not perverse or based on no evidence.",
      "resolves_issue": "i5",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Tata Engineering and Locomotive Co. Ltd. v. C. B. Mitter",
      "citation": "C.A.No. 633 of 1963, dec. on April 2,1964",
      "treatment": "followed",
      "relevance": "Strike in contravention of similar no-strike-without-notice clause in settlement is illegal under s. 29 though not under s. 24."
    },
    {
      "case_name": "Burn Co. Ltd. v. Workmen",
      "citation": "1959 1 L.L.J. 450",
      "treatment": "distinguished",
      "relevance": "No bearing on facts where leaders of graver misconduct were selectively punished."
    }
  ],
  "statutes_cited": [
    {
      "name": "Industrial Disputes Act, 1947",
      "sections": [
        "s. 10(1)(c)",
        "s. 12(3)",
        "s. 18(3)",
        "s. 23",
        "s. 24",
        "s. 26",
        "s. 27",
        "s. 29",
        "s. 2(p)"
      ],
      "relevance": "Reference for adjudication; settlement binding on workmen; strike illegality and punishments distinguished between ss. 23-24-26 and s. 29."
    },
    {
      "name": "Standing Orders",
      "sections": [
        "22(2)",
        "22(3)",
        "22(13)",
        "22(18)"
      ],
      "relevance": "Participating in illegal strike, inciting, disorderly behaviour, loitering as misconduct punishable by dismissal."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court upheld the Labour Court's award, finding the domestic enquiry valid and dismissals justified. The appeal by the association challenging the dismissals of three workmen for misconduct during an illegal strike was dismissed.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"The construction of cl. 5 of the settlement suggested by Mr. Ramamurthi is contrary to a the tenor of that settlement, b the provisions of the Industrial Disputes Act... and c the principles of collective bargaining recognised by industrial law.\"",
      "speaker": "court",
      "significance": "Rejects distinction between union and workmen; settlement binds both."
    },
    {
      "text": "\"The strike was illegal not under s. 24 but because it was in contravention of the settlement binding on the workmen concerned.\"",
      "speaker": "court",
      "significance": "Clarifies basis of strike illegality under s. 29."
    },
    {
      "text": "\"Acceptance of this evidence by the enquiry officer must necessarily mean acceptance of the version of these officers that they were intimidated by the crowd...\"",
      "speaker": "court",
      "significance": "Upholds enquiry findings implying intimidation."
    }
  ],
  "_case_id": "1969_56",
  "_label": 0,
  "_text_length": 29398,
  "_extracted_at": "2026-02-10T20:25:33.583843"
}