{
  "metadata": {
    "case_name": "Appellant Company v. Union of India and Ors.",
    "case_year": 1966,
    "court": "Supreme Court of India",
    "judges": [
      "Ramaswami, J."
    ],
    "case_number": "Civil Appeal No. 1576 of 1966",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "In the month of August, 1942 the appellant company hereinafter called the Company was incorporated with its registered office in the city of Jullundur dealing in sale and purchase of land as its substantial business.",
      "type": "background",
      "date": "1942-08",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "By a sale deed executed on November 24, 1944 the company purchased 646 karnals, 9 marlas of land from Harjit Singh for a sum of Rs. 32,326/-. The land was located in village Monanpura of District Sheikupura, now in West Pakistan. Out of the consideration for the sale, a sum of Rs. 9,000/- was left with the company for payment to the previous mortgagees and the balance of the money was paid to Harjit Singh before the Sub-Registrar at the time of registration.",
      "type": "material",
      "date": "1944-11-24",
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "On the basis of the registered sale deed the company was allotted 27 standard acres and 11 1/2 units of land village Bohani, Tehsil Phagwara District Kapurthala in the year 1950 in lieu of the land abandoned in Pakistan. A sanad number K2/4/8 dated March 9, 1950 was issued in favour of the company.",
      "type": "material",
      "date": "1950-03-09",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "There was consolidation of holdings in village Bohani and as a result of consolidation the area allotted to the company came to 23 kanals and 5 marlas.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Out of this the company sold 9-1/2 kanals to Mohan Singh, a Jat of village Bohani for Rs. 1900.00 by registered sale deed dated May 22, 1956.",
      "type": "procedural",
      "date": "1956-05-22",
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "Another portion of 2 kanals and 15 marlas was sold on September 12, 1958 for Rs. 10,012/- to one Mehnga Singh and his sons.",
      "type": "procedural",
      "date": "1958-09-12",
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "It was later discovered that the company had been allotted less area of land than it was entitled to as a result of consolidation operations and so an additional area of 24 kanals was allotted to the company in village Bohani to make up the deficiency.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "On August 30, 1960 the Managing Officer, respondent number 3, made a report, Annexure C, to the Chief Settlement Commissioner, Respondent number 2 recommending cancellation of the allotment of land to the company and consequently the grant of permanent rights to it.",
      "type": "procedural",
      "date": "1960-08-30",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "The company was heard by the Chief Settlement Commissioner.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "The Chief Settlement Commissioner rejected the registered sale deed and balance sheets and relying on the jamabandi, annexure X, came to the conclusion that at the time of partition the company did not own any land in Pakistan nor was it in occupation of any such land. By his order dated February 27, 1961 respondent number 2 set aside the permanent rights acquired by the company to the extent of 27 standard acres, 11 1/2 units and also cancelled the quasi-permanent allotment of the land made in the name of the company.",
      "type": "procedural",
      "date": "1961-02-27",
      "source": "respondent"
    },
    {
      "id": "f11",
      "text": "On March 29, 1961 a revision petition was filed by the company to the Central Government, respondent number 1. But the revision petition was dismissed on May 10, 1961.",
      "type": "procedural",
      "date": "1961-03-29",
      "source": "petitioner"
    },
    {
      "id": "f12",
      "text": "On June 8, 1961 the company filed a writ petition under Art. 226 of the Constitution praying for grant of a writ to quash the order of the Chief Settlement Commissioner dated February 27, 1961. The writ petition was allowed by Shamshat Bahadur, J.",
      "type": "procedural",
      "date": "1961-06-08",
      "source": "petitioner"
    },
    {
      "id": "f13",
      "text": "The respondent took the matter in appeal under cl. 10 of Letters Patent to a Division Bench which reversed the judgment of the learned single Judge and ordered the writ petition to be dismissed. Judgment dated October 26, 1965 in Letters Patent Appeal No. 174 of 1964.",
      "type": "procedural",
      "date": "1965-10-26",
      "source": "respondent"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the Chief Settlement Commissioner had jurisdiction to cancel the allotment under Section 24(2) of the Displaced Persons (Compensation and Rehabilitation) Act, 1954 without a finding that the allotment was obtained by fraud, false representation or concealment of material fact.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the jamabandi (Annexure II) relied upon by the Chief Settlement Commissioner was the jamabandi of the year 1946-47 depicting the state of affairs as on August 15, 1947.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The document described as jamabandi, annexure II to writ petition, was not the jamabandi of the year 1946-47 of the land in dispute. It consisted of three notes dated May 3, 1951: one saying 'Maamur bai' (no land of non-Muslims), second related to Kartar Chand and Gopal Dass who embraced Islam, third related to sale by Harjit Singh to S.A. Latif. These notes were made for exchange of jamabandi and did not depict the state of affairs as on August 15, 1947.",
      "supporting_facts": [
        "f2",
        "f10"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The company did not own any land in Pakistan at the time of partition nor was in occupation, as per jamabandi Annexure X, and thus allotment was undeserved.",
      "supporting_facts": [
        "f10"
      ],
      "legal_basis": "Section 24 of the Displaced Persons (Compensation and Rehabilitation) Act, 1954"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "It is not necessary to examine the jamabandi document in detail. The appeal must be allowed on the ground that there is no finding of the Chief Settlement Commissioner that the Company had obtained allotment of the land by means of fraud, false representation or concealment of any material fact within the meaning of s. 24(2) of the Act.",
      "addresses_issue": "i1",
      "key_observation": "The Chief Settlement Commissioner recorded a finding that the company had not proved its title and the allotment was undeserved, but this is not tantamount to a finding of fraud, false representation or concealment."
    },
    {
      "id": "cr2",
      "text": "Such a finding is a condition precedent for taking action under s. 24(2) of the Act. The condition imposed by the section is mandatory and in the absence of any such finding the Chief Settlement Commissioner had no jurisdiction to cancel the allotment.",
      "addresses_issue": "i1",
      "key_observation": "Mere finding of no title is insufficient; specific finding of fraud etc. required."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Chief Settlement Commissioner has no jurisdiction under Section 24(2) to cancel allotment without finding of fraud, false representation or concealment of material fact.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Displaced Persons (Compensation and Rehabilitation) Act, 1954",
      "sections": [
        "Section 24"
      ],
      "relevance": "Empowers Chief Settlement Commissioner to review orders, and specifically under sub-section (2) to cancel allotments obtained by fraud, false representation or concealment of material fact, which requires a mandatory finding as condition precedent."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 226"
      ],
      "relevance": "Basis for writ petition filed by company."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "The appeal is allowed with costs. The judgment of the Division Bench dated October 26, 1965 in Letters Patent Appeal is reversed and the judgment of Shamshat Bahadur, J., dated November 28, 1963 quashing the order of the Chief Settlement Commissioner dated February 27, 1961 is restored.",
    "relief_granted": "Quashing of Chief Settlement Commissioner's order dated February 27, 1961; restoration of single judge's judgment allowing writ petition.",
    "costs": "Appeal allowed with costs."
  },
  "key_quotes": [
    {
      "text": "It is true that the Chief Settlement Commissioner had recorded a finding that the company had not proved its title to any land in village Momonpura and the allotment was undeserved. But this is not tantamount to a finding that the allotment had been obtained by a false representation or fraud or concealment of material facts.",
      "speaker": "court",
      "significance": "Distinguishes between mere lack of title and required finding of fraud etc. under S.24(2)"
    },
    {
      "text": "Such a finding is a condition precedent for taking action under s. 24(2) of the Act. The condition imposed by the section is mandatory and in the absence of any such finding the Chief Settlement Commissioner had no jurisdiction to cancel the allotment.",
      "speaker": "court",
      "significance": "Core holding on jurisdictional requirement."
    }
  ],
  "_case_id": "1969_230",
  "_label": 1,
  "_text_length": 7639,
  "_extracted_at": "2026-02-10T20:27:34.273266"
}