{
  "metadata": {
    "case_name": "Consumers of electricity in Godhra area (Appellants) v. Respondent Electricity Company",
    "case_year": 1969,
    "court": "Supreme Court of India",
    "judges": [
      "Hegde, J."
    ],
    "case_number": "Civil Appeals Nos. 15 and 16 of 1969",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "On November 19, 1922, the then Government of Bombay granted a licence under the Indian Electricity Act, 1910 to Lady Sulochna Chinubhai Co. authorising it to generate and supply electricity to the consumers in Godhra area. Clause 10 of the licence prescribed the maximum charges that the licensee could levy for the power supplied.",
      "type": "background",
      "date": "1922-11-19",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The respondent is the successor of the said licensee.",
      "type": "background",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "After the Electricity Supply Act, 1948 came into force, a rating committee was constituted under s. 57(2) of the Supply Act at the request of the respondent on January 19, 1950.",
      "type": "procedural",
      "date": "1950-01-19",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On the recommendation of that committee, the Government fixed with effect from February 1, 1952, the following charges for the power supplied: 0-7-9 pies per unit for the electricity supplied for lights and fans with a minimum of Rs. 3/- per month per installation and for motive power at 4 annas per unit with a minimum of Rs. 4-8-0 per month per installation.",
      "type": "material",
      "date": "1952-02-01",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The Supply Act was amended in 1956.",
      "type": "background",
      "date": "1956",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The respondent increased the charges for motive power from January 1, 1963 to 35 NP. per unit with a minimum of Rs. 7/- per month for every installation.",
      "type": "disputed",
      "date": "1963-01-01",
      "source": "respondent"
    },
    {
      "id": "f7",
      "text": "On June 22, 1963, the rates for light and fans were increased with effect from July 1, 1963 to 70 NP. per unit with a minimum of Rs. 5/- per month for every installation.",
      "type": "disputed",
      "date": "1963-07-01",
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "The plaintiffs appellants who are consumers of electricity in the Godhra area sued the respondent-company on behalf of all the consumers in that area seeking to restrain the respondent from enforcing the enhanced charges sought to be collected from the consumers of power used for lights and fans as well as of motive power.",
      "type": "procedural",
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "The suits to restrain the respondent from levying the proposed increased charges were dismissed by the trial court.",
      "type": "procedural",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Those decrees were affirmed by the first appellate court as well as by a single judge of the Gujarat High Court in second appeals.",
      "type": "procedural",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "The appellate bench of the Gujarat High Court reversed those decrees and dismissed the suits holding that under the Supply Act as amended in 1956 the respondent has a unilateral right to enhance the charges subject to the conditions prescribed in the VI Schedule to that Act.",
      "type": "procedural",
      "date": "1968-12-03",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Appeals to Supreme Court by certificate. Civil Appeal No. 15 of 1969 relates to the enhancement of charges for electricity power for lights and fans and Civil Appeal No. 16 of 1969 relates to the enhancement of charges for the motive power.",
      "type": "procedural",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "There is no dispute as regards the charges fixed by the Government with effect from February 1, 1952, under s. 57(2)(c) of the Supply Act on the basis of the recommendation made by the rating committee.",
      "type": "admitted",
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether under the provisions of the Supply Act as amended in 1956, the respondent was competent to unilaterally enhance the charges.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The respondent was not competent to enhance the charges in question without the matter having been considered by a rating committee.",
      "supporting_facts": [
        "f6",
        "f7"
      ],
      "legal_basis": "Electricity Supply Act, 1948 prior to 1956 amendment; vested right to charges fixed in 1952 until revised by Government on basis of rating committee recommendation"
    },
    {
      "id": "pa2",
      "text": "The amendments made in 1956 do not affect the charges fixed in 1952 and they continue to rule till altered by the Government in accordance with law.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": "s. 6 of the General Clauses Act, 1897; State of Punjab v. Mohar Singh; Deep Chand v. State of U.P."
    },
    {
      "id": "pa3",
      "text": "The consumers have a vested right to be governed by the charges fixed in 1952 until the same is revised by the Government on the basis of the recommendation of a rating committee. The provisions of the Amending Act are not retrospective in character nor is there any inconsistency between those provisions and the present provisions.",
      "supporting_facts": [
        "f4",
        "f13"
      ],
      "legal_basis": "Electricity Supply Act, 1948 s.57(2)(c)"
    },
    {
      "id": "pa4",
      "text": "The present s. 57A(1)(e) can only govern the charges fixed under s. 57A(1)(d) and it has no impact on an order made under the old s. 57(2)(c). The charges so fixed can only be modified by the Government after getting a report from the rating committee.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": "Electricity Supply Act, 1948"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The amendments made to the Supply Act in 1956 have substantially altered the scheme as regards levying charges. It is now open to a licensee to alter the charges fixed by the Government unilaterally subject to the conditions prescribed in s. 57A and in Sch. VI of the Supply Act.",
      "supporting_facts": [
        "f5",
        "f6",
        "f7"
      ],
      "legal_basis": "Electricity Supply Act, 1948 as amended in 1956, s.57A and Sixth Schedule"
    },
    {
      "id": "ra2",
      "text": "The rights and liabilities of the respondent at present are exclusively regulated by the provisions of the Supply Act as it stands now. The terms of licences as they originally stood or as they stood on the coming into force of the Supply Act in 1948 are of no consequence.",
      "supporting_facts": [],
      "legal_basis": "Electricity Supply Act, 1948 s.57"
    },
    {
      "id": "ra3",
      "text": "There is no question of vested rights in these cases; herein we are only concerned with the procedure to be adopted in modifying the charges fixed in 1952.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "From an examination of these provisions it would be seen that under the Supply Act prior to its amendment in 1956, the charges fixed by the Govt. under s 57(2)(c) remained in force unless reduced by the licensee in the meantime till the same were altered by a subsequent order made by the Govt. after getting a fresh recommendation from the rating committee but under the law as it now stands the rate fixed by the Government under s. 57A(1)(d) would be in operation only for such period not exceeding three years as the State Govt. may specify in the order. Thereafter it can be enhanced by the licensee in accordance with the provisions contained in Sch. VI.",
      "addresses_issue": "i1",
      "key_observation": "Substantial difference between pre-1956 and post-1956 schemes regarding enhancement of charges."
    },
    {
      "id": "cr2",
      "text": "Section 57 of the Supply Act as it stands now lays down that the provisions of Sch. VI shall be deemed to be incorporated in the licence of every licensee not being a local authority... Hence we have to read into that licence the provisions contained in Sch. VI. If any of the earlier provisions in the licence... are inconsistent with the provisions of Sch. VI or s. 57A as they are now they must be held to be void and of no effect.",
      "addresses_issue": "i1",
      "key_observation": "Provisions of Sch. VI override inconsistent prior licence terms."
    },
    {
      "id": "cr3",
      "text": "There is no question of affecting any vested right. There is no dispute that the charges fixed can be altered. The controversy relates to the procedure to be adopted in altering them. That controversy does not touch any vested right. The procedure in question must necessarily be regulated by the law in force at the time of the alteration of the charges.",
      "addresses_issue": "i1",
      "key_observation": "No vested right affected; procedure governed by current law."
    },
    {
      "id": "cr4",
      "text": "In Amalgamated Electricity Co., Ltd. v. N. S. Bhathena this Court held that the maximum stipulated in the licence no longer governed the right of the licensee to enhance the charges; his rights were exclusively governed by the provisions contained in paragraph 1 of Sch. VI of the Supply Act.",
      "addresses_issue": "i1",
      "key_observation": "Licensee has statutory unilateral right to adjust rates under Sch. VI para 1."
    },
    {
      "id": "cr5",
      "text": "If we merely look at those terms [licence as modified by Sch. VI], as we think we ought to, then there is no dispute that the respondent was within its rights in enhancing the charges as admittedly it has followed the procedure prescribed by law.",
      "addresses_issue": "i1",
      "key_observation": "Respondent competent to unilaterally enhance charges."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Under the provisions of the Electricity (Supply) Act, 1948 as amended in 1956, particularly s.57, s.57A and Sixth Schedule, the provisions of the Sixth Schedule are deemed incorporated into the licence, overriding inconsistent prior terms, and the licensee has a unilateral right to enhance charges after the expiry of the period fixed by the Government order, subject to conditions in Sch. VI.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "State of Punjab v. Mohar Singh",
      "citation": "1955 S.C.R. 893",
      "treatment": "distinguished",
      "relevance": "Observations on s.6(c),(d),(e) General Clauses Act regarding repeal and re-enactment; does not apply as no vested rights affected and new Act indicates different intention."
    },
    {
      "case_name": "Deep Chand v. State of U.P.",
      "citation": "1959 2 Supp. S.C.R. 8",
      "treatment": "distinguished",
      "relevance": "Effect of repugnancy between State and Central Act; no bearing on the point in issue."
    },
    {
      "case_name": "Amalgamated Electricity Co., Ltd. v. N. S. Bhathena",
      "citation": null,
      "treatment": "followed",
      "relevance": "Licensee's right to enhance charges governed exclusively by para 1 of Sch. VI of Supply Act, not prior licence maximums; unilateral adjustment permitted."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Electricity Act, 1910",
      "sections": [
        "Clause 10 of licence"
      ],
      "relevance": "Original licence granted under this Act prescribing maximum charges; now overridden by Supply Act provisions."
    },
    {
      "name": "Electricity (Supply) Act, 1948",
      "sections": [
        "s.57",
        "s.57(2)(c)",
        "s.57A",
        "s.57A(1)(a)",
        "s.57A(1)(b)",
        "s.57A(1)(c)",
        "s.57A(1)(d)",
        "s.57A(1)(e)",
        "Sixth Schedule para I, IA, II",
        "Seventh Schedule"
      ],
      "relevance": "Provisions deemed incorporated into licence; govern charges adjustment post-1956 amendment; licensee can unilaterally enhance after specified period subject to notice, profit limits, etc."
    },
    {
      "name": "General Clauses Act, 1897",
      "sections": [
        "s.6"
      ],
      "relevance": "Effects of repeal; not applicable as no vested rights destroyed and new provisions regulate procedure."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court held that the respondent electricity company was competent to unilaterally enhance the charges under the Electricity (Supply) Act, 1948 as amended in 1956, as the provisions of the Sixth Schedule are deemed incorporated into the licence overriding prior inconsistent terms, and the company followed the prescribed procedure. The appeals challenging the Gujarat High Court's decision are dismissed.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The procedure in question must necessarily be regulated by the law in force at the time of the alteration of the charges.",
      "speaker": "court",
      "significance": "Clarifies that current law governs procedure for charge enhancement, no vested rights issue."
    },
    {
      "text": "If we merely look at those terms [licence as modified], as we think we ought to, then there is no dispute that the respondent was within its rights in enhancing the charges as admittedly it has followed the procedure prescribed by law.",
      "speaker": "court",
      "significance": "Concludes in favor of respondent's unilateral right."
    },
    {
      "text": "para 1 of Sch. VI... empowered the licensee to adjust his rates... the adjustment is unilateral and that the licensee has a statutory right to adjust his rates provided he conforms to the requirements of that paragraph.",
      "speaker": "court",
      "significance": "Quotes Amalgamated case affirming unilateral adjustment right under Sch. VI."
    }
  ],
  "_case_id": "1969_168",
  "_label": 0,
  "_text_length": 29733,
  "_extracted_at": "2026-02-10T20:26:56.766712"
}