{
  "metadata": {
    "case_name": "Sansthan v. Respondent No. 4 and Ors.",
    "case_year": 1966,
    "court": "Supreme Court of India",
    "judges": [
      "Grover, J."
    ],
    "case_number": "Civil Appeal No. 862 of 1966",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant is a private religious Trust managed by Laxman Anant Mulay described as Wahiwatdar/Manager.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Main source of income for performing acts including daily worship of family deity Shri Kalanka Devi is derived from endowed agricultural land.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Respondent No. 4 is the tenant in field survey No. 94 with an area of 30 acres 8 gunthas in Mouza Malrajura, district Akola.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Notice under s. 91 of the Berar Regulation of Agricultural Leases Act served on respondent No. 4 in 1955 stating Sansthan required field for personal cultivation.",
      "type": "procedural",
      "date": "1955",
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "Notice served on behalf of appellant on respondent No. 4 under s. 38 of the Bombay Tenancy and Agricultural Lands (Vidarbha Region) Act, 1958 on January 30, 1961 to terminate tenancy without prejudice to previous proceedings.",
      "type": "procedural",
      "date": "1961-01-30",
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "Application filed on behalf of appellant under s. 36 of the Act for possession, opposed by respondent No. 4.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Naib Tehsildar rejected the application on ground that Sansthan was not a land-holder who could cultivate land personally.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Order of Naib Tehsildar confirmed by Sub-Divisional Officer and Maharashtra Revenue Tribunal on appeals.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Appellant filed petition under Art. 227 of Constitution before Bombay High Court, Nagpur Bench, dismissed; Letters Patent Appeal No. 40 of 1965 dismissed on April 8, 1965.",
      "type": "procedural",
      "date": "1965-04-08",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "It was common ground that the Sansthan was a private trust and not governed by Bombay Public Trusts Act.",
      "type": "admitted",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the Sansthan could take advantage of provisions in the Bombay Tenancy and Agricultural Lands (Vidarbha Region) Act, 1958 by which possession can be claimed from tenant on ground that it is required for personal cultivation.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Under Explanation I to s. 2(12) of the Act, idol or Sansthan falls within meaning of person subject to physical or mental disability and can be deemed to cultivate personally if cultivated by servants or hired labourers; similar to minor.",
      "supporting_facts": [
        "f1",
        "f2"
      ],
      "legal_basis": "Bombay Tenancy and Agricultural Lands (Vidarbha Region) Act, 1958 s. 2(12) Explanation I"
    },
    {
      "id": "pa2",
      "text": "Provisions of Berar Regulation of Agricultural Leases Act, 1951 allowed public trusts of charitable nature to claim possession for personal cultivation.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": "Berar Regulation of Agricultural Leases Act, 1951"
    },
    {
      "id": "pa3",
      "text": "Manager/Wahiwatdar falls within definition of trustee under s. 2(18) Bombay Public Trusts Act and is landlord who can claim possession for personal cultivation, citing Ishwardas case.",
      "supporting_facts": [
        "f1"
      ],
      "legal_basis": "Bombay Public Trusts Act s. 2(18); Ishwardas v. Maharashtra Revenue Tribunal Ors."
    },
    {
      "id": "pa4",
      "text": "Provisions debarring appellant from claiming possession for personal cultivation violative of Articles 14 and 19(1)(f) of Constitution.",
      "supporting_facts": [
        "f1"
      ],
      "legal_basis": "Constitution Articles 14, 19(1)(f)"
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Idol is juristic person capable of holding property but not capable of cultivating land personally; requires direct nexus between person claiming and agricultural processes under personal supervision; cultivation must be by natural persons not legal persons.",
      "addresses_issue": "i1",
      "key_observation": "Legislative intent requires direct nexus; no intermediary; following Shri Kesheorai Deo Sansthan case."
    },
    {
      "id": "cr2",
      "text": "Appellant's case does not fall within Explanation I to s. 2(12) as physical/mental disability defined in s. 2(22) emphasizes personal labour or supervision.",
      "addresses_issue": "i1",
      "key_observation": "Domination idea of personal cultivation is doing by person himself, not through others."
    },
    {
      "id": "cr3",
      "text": "Provisions of repealed Berar Regulation of Agricultural Leases Act, 1951 not applicable after enactment of 1958 Act.",
      "addresses_issue": "i1",
      "key_observation": "Repealed statute no longer in force."
    },
    {
      "id": "cr4",
      "text": "Sansthan is private trust not governed by Bombay Public Trusts Act; manager/Wahiwatdar not trustee under s. 2(18); properties vest in deity/Sansthan, not manager.",
      "addresses_issue": "i1",
      "key_observation": "Distinction between trustee and manager/Shebait of idol; Ishwardas distinguished as it concerned public trust."
    },
    {
      "id": "cr5",
      "text": "Act immune from attack under Articles 14 and 19(1)(f) by Article 31A of Constitution.",
      "addresses_issue": "i1",
      "key_observation": "Protected by Art. 31A."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Sansthan cannot claim possession from tenant for personal cultivation under the Act.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Ishwardas v. Maharashtra Revenue Tribunal Ors.",
      "citation": "1968 3 S.C.R. 441",
      "treatment": "referred | distinguished",
      "relevance": "Distinguished as it concerned public trust under Bombay Public Trusts Act; court there refrained from opining on private Sansthan."
    },
    {
      "case_name": "Shri Mahadeo Paikaji Kolhe Yavatmal v. The State of Bombay",
      "citation": "1962, 1 S.C.R. 733",
      "treatment": "referred",
      "relevance": "Act immune under Art. 31A."
    },
    {
      "case_name": "Sri Ram Ram Narain Medhi v. The State of Bombay",
      "citation": "1959 Supp. 1 S.C.R. 489",
      "treatment": "referred",
      "relevance": "Act immune under Art. 31A."
    },
    {
      "case_name": "Shri Kesheorai Deo Sansthan, Karanji v. Bapurao Deoba Ors.",
      "citation": "1964 Mah. L.J. 589",
      "treatment": "followed",
      "relevance": "Direct nexus required for personal cultivation; no intermediary; cultivation by natural persons."
    }
  ],
  "statutes_cited": [
    {
      "name": "Bombay Tenancy and Agricultural Lands (Vidarbha Region) Act, 1958",
      "sections": [
        "s. 2(12)",
        "s. 2(22)",
        "s. 2(32)",
        "s. 36",
        "s. 38"
      ],
      "relevance": "Defines personal cultivation requiring direct nexus; governs termination of tenancy for personal cultivation; Sansthan ineligible."
    },
    {
      "name": "Berar Regulation of Agricultural Leases Act, 1951",
      "sections": [
        "s. 91"
      ],
      "relevance": "Repealed; prior notice served but provisions not applicable post-1958 Act."
    },
    {
      "name": "Bombay Public Trusts Act",
      "sections": [
        "s. 2(18)"
      ],
      "relevance": "Defines trustee; inapplicable to private trust Sansthan."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 14",
        "Art. 19(1)(f)",
        "Art. 31A",
        "Art. 227"
      ],
      "relevance": "Challenge under 14,19 rejected due to 31A; petition under 227 dismissed."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal by special leave dismissed; High Court order upheld; Sansthan held ineligible to claim possession for personal cultivation as it cannot cultivate personally under the Act.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "the dominating idea of anything done personally or in person is that the thing must be done by the person himself and not by or through some one else.",
      "speaker": "court",
      "significance": "Explains rejection of personal cultivation by juristic person."
    },
    {
      "text": "the legislative intent clearly is that in order to claim a cultivation as a personal cultivation there must be established a direct nexus between the person who makes such a claim, and the agricultural processes or activities carried on the land.",
      "speaker": "court",
      "significance": "Core reasoning from cited case adopted."
    },
    {
      "text": "The Act is rendered immune from attack on these grounds in view of the provisions of Article 31A of the Constitution.",
      "speaker": "court",
      "significance": "Rejects constitutional challenge."
    }
  ],
  "_case_id": "1969_82",
  "_label": 0,
  "_text_length": 11083,
  "_extracted_at": "2026-02-10T20:25:18.974773"
}