{
  "metadata": {
    "case_name": "Nathulal v. Phoolchand",
    "case_year": 1966,
    "court": "Supreme Court of India",
    "judges": [
      "Shah, J."
    ],
    "case_number": "Civil Appeal No. 2345 of 1966",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Nathulal was the owner of a Ginning Factory constructed on a plot of agricultural land bearing Khasra No. 259/1. The land stood entered in the revenue records in the name of Chittarmal, brother of Nathulal.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On February 26, 1951, Nathulal agreed to sell to Phoolchand the land and the Ginning Factory for Rs. 43,011/-. He received in part payment Rs. 22,011/-, and put Phoolchand in possession of the property. Phoolchand agreed to pay the balance on or before May 7, 1951. The terms of the agreement were reduced to writing in counterpart and were duly signed by the parties.",
      "type": "material",
      "date": "1951-02-26",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Phoolchand failed to pay the balance of Rs. 21,000/- on or before May 7, 1951.",
      "type": "admitted",
      "date": "1951-05-07",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Phoolchand did not make the tender as pleaded by him.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Nathulal had undertaken to get the name of Chittarmal removed from the revenue records and to get his own name entered, but the lands continued to stand recorded in the name of Chittarmal till October 6, 1952.",
      "type": "material",
      "date": "1952-10-06",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "By virtue of s. 70(4) of the Madhya Bharat Land Revenue and Tenancy Act 66 of 1950, Phoolchand not being an agriculturist the land could not be sold to him without the sanction of the State Government.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "On October 8, 1951, Nathulal rescinded the contract on the plea that Phoolchand had failed to pay on the due date the balance of price.",
      "type": "procedural",
      "date": "1951-10-08",
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "In May 1954, Nathulal commenced an action in the Court of the District Judge, Nimar, for a decree for possession of the land and the factory and for mesne profits from the date of delivery till possession was restored to him, alleging that Phoolchand was a trespasser.",
      "type": "procedural",
      "date": "1954-05",
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "Phoolchand contended that Nathulal had failed to get the name of Chittarmal deleted from the revenue record according to the terms of the agreement, that he was ready and willing to pay the balance of Rs. 21,000/-, that he had sent a telegram on May 7, 1951, offering to pay the balance against execution of the sale deed, that the agreement had been unlawfully altered by Nathulal after execution by adding a clause declaring possession unlawful in default of payment.",
      "type": "disputed",
      "date": "1951-05-07",
      "source": "respondent"
    },
    {
      "id": "f10",
      "text": "The Trial Court decreed the suit holding that Phoolchand committed breach of contract in that he failed to pay the balance due by him on or before the due date.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "In appeal, the High Court of Madhya Pradesh reversed the decree. The High Court declared that Nathulal was entitled to the balance of consideration Rs. 21,000/- also mesne profits at the rate of Rs. 1,500/- per annum from May 7, 1951 till the date on which Rs. 21,000/- were deposited by Phoolchand within two months of the passing of the decree. Subject to this direction Phoolchand was allowed to retain possession of the entire property. If Phoolchand committed default Nathulal may claim possession with mesne profits at Rs. 3,000/- per annum.",
      "type": "procedural",
      "date": "1965-12-03",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Phoolchand had arranged with a Bank to borrow upto Rs. 75,000/-, when needed by him.",
      "type": "material",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether Phoolchand could defeat Nathulal's claim for possession by establishing defence of part-performance under s. 53A of the Transfer of Property Act.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether Nathulal or Phoolchand committed breach of contract.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether s. 70(8) of the Madhya Bharat Land Revenue and Tenancy Act bars the plea of part performance.",
      "framed_by": "petitioner"
    },
    {
      "id": "i4",
      "text": "Whether Phoolchand was willing to perform his part of the contract.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Phoolchand committed breach of contract by failing to pay the balance due on or before May 7, 1951, and was a trespasser.",
      "supporting_facts": [
        "f3",
        "f7",
        "f8"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "By virtue of s. 70(8) of the Madhya Bharat Land Revenue and Tenancy Act, the plea of part performance is not available to a person put in possession under a contract of sale.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": "s. 70(8) Madhya Bharat Land Revenue and Tenancy Act 66 of 1950"
    },
    {
      "id": "pa3",
      "text": "Phoolchand was not willing to perform his part of the contract.",
      "supporting_facts": [
        "f3",
        "f4"
      ],
      "legal_basis": null
    },
    {
      "id": "pa4",
      "text": "Nathulal was bound to perform conditions (rectify records and obtain sanction) only after Rs. 21,000/- was paid.",
      "supporting_facts": [
        "f5",
        "f6"
      ],
      "legal_basis": null
    },
    {
      "id": "pa5",
      "text": "The act done in pursuance of the contract must be independent of the terms of the contract.",
      "supporting_facts": [
        "f2"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Nathulal failed to get the name of Chittarmal deleted from the revenue record and to obtain sanction under s. 70(4), committing breach of contract.",
      "supporting_facts": [
        "f5",
        "f6"
      ],
      "legal_basis": "s. 70(4) Madhya Bharat Land Revenue and Tenancy Act 66 of 1950"
    },
    {
      "id": "ra2",
      "text": "Phoolchand was ready and willing to pay the balance of Rs. 21,000/-, had sent a telegram on May 7, 1951 offering to pay against execution of sale deed, and had bank arrangement to borrow up to Rs. 75,000/-; agreement was unlawfully altered by Nathulal.",
      "supporting_facts": [
        "f9",
        "f12"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Nathulal was guilty of breach of contract for not rectifying revenue records till October 6, 1952 and not securing sanction under s. 70(4), which was an implied condition of the agreement.",
      "addresses_issue": "i2",
      "key_observation": "Phoolchand could be called upon to pay balance only after Nathulal performed his part."
    },
    {
      "id": "cr2",
      "text": "s. 70(8) does not bar defence of part performance under s. 53A T.P. Act as there is no sale, only contract of sale and equity to defend possession.",
      "addresses_issue": "i3",
      "key_observation": "s. 70(8) requires registration for validity of sale, but part performance relies on contract, not sale."
    },
    {
      "id": "cr3",
      "text": "Conditions of s. 53A satisfied: written contract signed by Nathulal, Phoolchand took possession in part performance and paid Rs. 22,011/-, act in furtherance not needing to be independent.",
      "addresses_issue": "i1",
      "key_observation": "All four conditions for part performance defence fulfilled."
    },
    {
      "id": "cr4",
      "text": "Phoolchand was willing to perform: had bank arrangement; sequence of obligations requires Nathulal to perform first (rectify records, obtain sanction); TP Act s.4 incorporates Contract Act sequence.",
      "addresses_issue": "i4",
      "key_observation": "Repeal of Madhya Bharat Act by MP Land Revenue Code 1959 has no retrospective operation."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Phoolchand can defend possession under s. 53A of the Transfer of Property Act against Nathulal's ejectment claim.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Nathulal committed breach by not performing his obligations first; implied condition to obtain sanction under s. 70(4).",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "s. 70(8) does not bar part performance defence.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    },
    {
      "id": "h4",
      "text": "Phoolchand was willing to perform his part, considering sequence of obligations under contract.",
      "resolves_issue": "i4",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Motilal and Others v. Narhelal and Another",
      "citation": "L.R. 57 I.A. 333",
      "treatment": "followed",
      "relevance": "Agreement to transfer property not transferable without permission deemed subject to implied condition that transferor obtains sanction."
    },
    {
      "case_name": "Mrs. Chandnee Widya Vati Madden v. Dr. C. L. Katial Others",
      "citation": "1964 2 S.C.R. 495",
      "treatment": "followed",
      "relevance": "Agreement to transfer property not transferable without permission deemed subject to implied condition that transferor obtains sanction."
    },
    {
      "case_name": "Bank of India Ltd. Ors. v. Jamsetji A. H. Chinoy and Messrs. Chinoy and Company",
      "citation": "L.R. 77 I.A. 76, 91",
      "treatment": "followed",
      "relevance": "To prove readiness and willingness, purchaser need not produce money or vouch concluded scheme; bank arrangement suffices."
    }
  ],
  "statutes_cited": [
    {
      "name": "Transfer of Property Act",
      "sections": [
        "s. 53A",
        "s. 4"
      ],
      "relevance": "Defence of part performance available; chapters on contracts part of Indian Contract Act; sequence of obligations considered."
    },
    {
      "name": "Madhya Bharat Land Revenue and Tenancy Act 66 of 1950",
      "sections": [
        "s. 70(4)",
        "s. 70(8)"
      ],
      "relevance": "Land not transferable to non-agriculturist without sanction (implied condition); s.70(8) requires registration for sale validity but does not bar part performance under contract."
    },
    {
      "name": "Indian Contract Act, 1872",
      "sections": [],
      "relevance": "Obligations under contract to be performed in sequence via TP Act s.4."
    },
    {
      "name": "Madhya Pradesh Land Revenue Code, 1959",
      "sections": [],
      "relevance": "Repeal of Madhya Bharat Act has no retrospective operation."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court upheld the High Court's decree allowing Phoolchand to retain possession upon payment of balance Rs. 21,000/- and mesne profits within two months, failing which Nathulal entitled to possession and higher mesne profits. Nathulal's appeal dismissed.",
    "relief_granted": "Phoolchand allowed to retain possession subject to payment; Nathulal entitled to balance and mesne profits.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"Phoolchand could be called upon to pay the balance of the price only after Nathulal performed his part of the contract.\"",
      "speaker": "court",
      "significance": "Determines sequence of obligations and who breached first."
    },
    {
      "text": "\"To the making of such a claim, relying upon the doctrine of part performance in s. 53A of the Transfer of Property Act, there is nothing in s. 70(8) ... which may operate as a bar.\"",
      "speaker": "court",
      "significance": "Rejects bar to part performance defence."
    },
    {
      "text": "\"In considering whether a person is willing to perform his part of the contract the sequence in which the obligations under a contract are to be performed must be taken into account.\"",
      "speaker": "court",
      "significance": "Confirms Phoolchand's willingness given Nathulal's prior obligations."
    }
  ],
  "_case_id": "1969_118",
  "_label": 0,
  "_text_length": 11505,
  "_extracted_at": "2026-02-10T20:26:05.864772"
}