{
  "metadata": {
    "case_name": "Mani Mani & Ors. v. Joshua",
    "case_year": 1966,
    "court": "Supreme Court of India",
    "judges": [
      "Grover, J."
    ],
    "case_number": "Civil Appeal No. 683 of 1966",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Uthupu Mani died in 1943. He had three sons: eldest Uduppu (died between 1929-1935), second Joshua (respondent), third Mani Mani (appellant). Also left daughters including appellant No. 3 Mani Achamma.",
      "type": "background",
      "date": "1943",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "First settlement by Uthupu in 1102 ME (1927 AD) when Uduppu alive and Mani Mani not born.",
      "type": "background",
      "date": "1927",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On October 9, 1935, Uthupu executed registered settlement deed Exh. A (Udampady): A Schedule (building as Hall and cart-shed on 2 cents) to Mariamma; B Schedule (storied building and 30 cents garden land) to Joshua; C Schedule (four rooms facing West and 36 cents garden land) to Mani Mani. Mutations effected in favour of donees.",
      "type": "material",
      "date": "1935-10-09",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Uthupu executed first will in January 1943, deposited with District Registrar, Kottayam.",
      "type": "background",
      "date": "1943-01",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Uthupu executed second will in April 1943, kept with District Registrar.",
      "type": "background",
      "date": "1943-04",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Uthupu executed third will Exh. 3 on May 31, 1943, last will and testament. Mentioned two settlements (1927, 1935) and two previous wills. Declared it final and operative. Bequeathed five items to Joshua, including C Schedule (given to Mani in 1935) and cart-shed on 2 cents from A Schedule (given to Mariamma). No specific mention of B Schedule properties.",
      "type": "material",
      "date": "1943-05-31",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "In Exh. 3, testator stated he invalidated previous settlements and wills by first will; made changes out of pity for Joshua; forgave Joshua and gave him specified immovable properties forever; Mani Mani sole heir to remaining assets; wife Mariamma to manage till conditions met; revoked all prior deeds and wills.",
      "type": "material",
      "date": "1943-05-31",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "In 1955, Joshua filed suit for recovery of B Schedule properties (storied building and 30 cents), claiming vested under 1935 settlement, independent of will bequests.",
      "type": "procedural",
      "date": "1955",
      "source": "respondent"
    },
    {
      "id": "f9",
      "text": "Defendants (Mariamma, Mani etc.): Joshua accepted benefits under will (five items including properties from A and C Schedules), elected under will, precluded from claiming B Schedule under 1935 settlement.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f10",
      "text": "Trial court (Subordinate Judge): Settlement 1935 effected with mutations; plaintiff got title/possession to B Schedule; will Exh. 3 cancelled 1935 arrangement, bequeathed properties from A/C to plaintiff; s.180 Indian Succession Act applied, plaintiff elected will benefits; suit dismissed.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Kerala High Court (judgment Jan 3, 1965, Appeal Suit No. 86/1960): Reversed trial court; no specific disposition of B Schedule in will; general words don't revoke prior gift; s.180 not applicable to plaintiff, but to defendants; decreed suit for Joshua.",
      "type": "procedural",
      "date": "1965-01-03",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Supreme Court appeal by special leave.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the settlement of 1935 had been given effect to and whether plaintiff's suit merited dismissal on account of the applicability of the doctrine of election embodied in s. 180 of the Indian Succession Act.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Plaintiff accepted benefit under will Exh. 3 by taking five items including properties allotted to Mariamma and Mani under 1935 settlement; exercised right of election to take under will; precluded from asserting right to B Schedule under 1935 settlement.",
      "supporting_facts": [
        "f3",
        "f6",
        "f7",
        "f9"
      ],
      "legal_basis": "Section 180 Indian Succession Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "B Schedule properties vested under 1935 settlement; five items in will independent/separate; no specific mention/disposition of B Schedule in will; general words don't show intention to dispose of plaintiff's property; no election triggered.",
      "supporting_facts": [
        "f3",
        "f6",
        "f8"
      ],
      "legal_basis": "No specific disposition in will; general words presume testator disposes only own property"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Testator in Exh. 3 under impression he could revoke 1935 settlement; explicitly stated invalidated prior settlements/wills; bequeathed to Joshua properties from A/C Schedules, treating all as his own; detailed bequests show disposed entire estate including 1935 properties; recitals confirm revocation.",
      "addresses_issue": "i1",
      "key_observation": "Testator treated entire properties as his, revoking 1935 settlement."
    },
    {
      "id": "cr2",
      "text": "Will Exh. 3 shows intention to dispose of properties gifted to Joshua; even general words + circumstances (bequests from others' shares, residuary to Mani) imply inclusion; s.180 applies as testator professed to dispose of non-owned property.",
      "addresses_issue": "i1",
      "key_observation": "Election arises where intention clear from will face or circumstances, beyond reasonable doubt."
    },
    {
      "id": "cr3",
      "text": "No compensation under Indian law s.180; if elected will benefits, must relinquish settlement claims.",
      "addresses_issue": "i1",
      "key_observation": "Joshua cannot retain both."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Testator by Exh. 3 intended to revoke 1935 settlement and dispose of all properties as his own; doctrine of election under s.180 applies; Joshua, having taken will benefits, cannot claim B Schedule under settlement.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Miller v. Thurgood",
      "citation": "10 L.T.R. 255",
      "treatment": "referred",
      "relevance": "Specific disposition triggers election; general words do not, unless intention clear."
    },
    {
      "case_name": "Whitley v. Whitley",
      "citation": "54 E.R. 1104",
      "treatment": "followed",
      "relevance": "Election where general words + circumstances show intention to dispose of other's property."
    },
    {
      "case_name": "Re Allens Estate, Prescott v. Allen and Beaumont",
      "citation": null,
      "treatment": "referred",
      "relevance": "Gift of residue construed as testator's ostensible property."
    },
    {
      "case_name": "Re Booker, Booker v. Booker",
      "citation": null,
      "treatment": "referred",
      "relevance": "Strict approach: intention to include non-owned property must be beyond reasonable doubt."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Succession Act",
      "sections": [
        "Section 180"
      ],
      "relevance": "Doctrine of election: if will disposes of non-owned property and gives benefit, must elect; no compensation principle in India."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; Kerala High Court judgment reversed; trial court decree restored dismissing Joshua's suit for B Schedule properties on ground of election under s.180.",
    "relief_granted": "Suit dismissed",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"This will is executed by resolving as these and totally changing all the deeds registered by me prior to this and the Wills kept in custody and this Will alone shall, unless I act otherwise, be and ought to be in force in future.\"",
      "speaker": "court",
      "significance": "Testator's express revocation of prior settlements including 1935 deed."
    },
    {
      "text": "\"It is thus necessary to look at the will and read it carefully which has been done by us and we have no manner of doubt that Uthupu, the testator, intended to include properties gifted to Joshua by the settlement of 1935 in the bequest which he made to Mani of the entire residue.\"",
      "speaker": "court",
      "significance": "Court's conclusion on testator's intention triggering election."
    }
  ],
  "_case_id": "1969_292",
  "_label": 1,
  "_text_length": 20450,
  "_extracted_at": "2026-02-10T20:27:30.929060"
}