{
  "metadata": {
    "case_name": "Ranibai v. Respondent No. 1",
    "case_year": 1966,
    "court": "Supreme Court of India",
    "judges": [
      "Grover, J."
    ],
    "case_number": "Civil Appeal No. 532 of 1966",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Jangi Jogi inherited properties consisting of some groves and a house in village Mukupdpur in the erstwhile State of Rewa which later became part of Madhya Pradesh.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Jangi Jogi had a son Laldas who died in 1945 leaving the appellant, his widow, as his heir and legal representative.",
      "type": "material",
      "date": "1945",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "After the death of Laldas, Jangi Jogi married Mst. Jugli Bai in 1948.",
      "type": "material",
      "date": "1948",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Jangi Jogi died sometime in 1950.",
      "type": "material",
      "date": "1950",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Respondent No. 1 raised a claim to the properties of Jangi Jogi by virtue of a gift deed and moved criminal courts under S. 145 Cr.P.C.; on December 29, 1962 an order was made directing possession to be delivered to respondent No. 1.",
      "type": "procedural",
      "date": "1962-12-29",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Appellant instituted suit in Civil Judge at Rewa along with Jugli Bai for declaration of rights and possession of properties.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Respondent No. 1 claimed continuous possession for more than 12 years and ownership; alternatively, Jugli Bai had interest but her thumb impression on plaint obtained by fraud.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "Trial court framed 12 issues.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "During pendency, plaintiff No. 2 Jugli Bai entered compromise with respondent No. 1 giving up claims.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Trial court found thumb impression of Jugli Bai not obtained by fraud but she changed sides; no gift deed made by Jangi Jogi; appellant in possession until dispossessed by respondent No. 1 via S. 145 Cr.P.C.; respondent illegally occupied and was trespasser; but dismissed suit as estate devolved on Jugli Bai who compromised.",
      "type": "admitted",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "District Judge set aside trial court decree, held compromise not binding on appellant, trial court did not decide all issues, remanded for fresh disposal.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "High Court dismissed appeal of appellant, held she had no interest citing Hindu Women's Rights to Property Act 1937 s. 3(2) and Umayal Achi case; compromise valid under O.23 r.3 CPC; respondent clothed with Jugli Bai's rights.",
      "type": "procedural",
      "date": "1962-09-17",
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Jugli Bai filed application under O.23 r.1 CPC on February 19, 1959 withdrawing her claim and suit to extent of her claim, filing compromise with defendant.",
      "type": "procedural",
      "date": "1959-02-19",
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Application under O.23 r.3 CPC filed stating suit of plaintiff No. 2 be dismissed, no relief to her.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether appellant, widow of predeceased son, had interest or right to possession of properties left by Jangi Jogi under Hindu Women's Rights to Property Act 1937.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether compromise by Jugli Bai adversely affected appellant's rights and entitled dismissal of suit.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether appellant entitled to restoration of possession from respondent No. 1 found to be trespasser, given her possession in lieu of maintenance.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Appellant in possession until dispossessed by trespass; entitled to restoration from trespasser.",
      "supporting_facts": [
        "f10"
      ],
      "legal_basis": "Specific Relief Act s.9"
    },
    {
      "id": "pa2",
      "text": "Entitled to maintenance from father-in-law's estate; possession in lieu thereof; could take boy in adoption vesting rights retrospectively.",
      "supporting_facts": [
        "f2",
        "f4",
        "f10"
      ],
      "legal_basis": "Hindu Women's Rights to Property Act 1937; Hindu Adoption and Maintenance Act 1956 s.19"
    },
    {
      "id": "pa3",
      "text": "Compromise by Jugli Bai not binding on appellant who was not party.",
      "supporting_facts": [
        "f9",
        "f11"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Continuous possession over 12 years perfecting title; gift deed from Jangi Jogi.",
      "supporting_facts": [
        "f5",
        "f7"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Jugli Bai sole heir; compromise valid under O.23 r.3 CPC; transfers rights to respondent.",
      "supporting_facts": [
        "f9",
        "f12",
        "f13",
        "f14"
      ],
      "legal_basis": "CPC O.23 r.1, r.3"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Appellant entitled to maintenance from father-in-law's estate; possession in lieu not defeatable by Jugli Bai or trespasser without securing maintenance.",
      "addresses_issue": "i1",
      "key_observation": "Right to maintenance not liable to defeat except by bona fide purchaser; courts protect widow's possession for maintenance."
    },
    {
      "id": "cr2",
      "text": "Applications under O.23 r.1 and r.3 only withdrew Jugli Bai's claim; could not dismiss appellant's suit.",
      "addresses_issue": "i2",
      "key_observation": "Compromise did not adversely affect appellant as she had no right per High Court, but possession rights exist independently."
    },
    {
      "id": "cr3",
      "text": "Appellant had possessory title against trespasser respondent; entitled to declaration and restoration per Privy Council in Ismail Ariff.",
      "addresses_issue": "i3",
      "key_observation": "Possession sufficient evidence of title against wrong-doer; High Court erred in holding respondent clothed with Jugli Bai's rights."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Widow of predeceased son entitled to maintenance and possession in lieu thereof from father-in-law's estate until remarriage or proper provision made.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Compromise by Jugli Bai withdrawing her claim does not dismiss co-plaintiff appellant's suit or transfer rights to trespasser.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h3",
      "text": "Plaintiff with possession entitled to restoration against trespasser lacking title.",
      "resolves_issue": "i3",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Umayal Achi v. Lakshmi Achi",
      "citation": "1945 F.C.R. 1",
      "treatment": "referred",
      "relevance": "High Court relied to deny s.3(2) rights to widow of predeceased son"
    },
    {
      "case_name": "Rachawa Others v. Shivayogappa",
      "citation": "I.L.R. 18 Bom. 679",
      "treatment": "followed",
      "relevance": "Purchaser with notice not entitled to possession without securing maintenance for widow in possession"
    },
    {
      "id": "pc3",
      "case_name": "Yellawa Ors. v. Bhimangavda",
      "citation": "I.L.R. 18 Bom. 452",
      "treatment": "followed",
      "relevance": "Settled practice not to allow heir to recover property from maintenance widow without securing maintenance"
    },
    {
      "case_name": "Ismail Ariff v. Mohamed Ghouse",
      "citation": "20 I.A. 99",
      "treatment": "followed",
      "relevance": "Possession proves title against wrong-doer; entitled to declaration and injunction"
    }
  ],
  "statutes_cited": [
    {
      "name": "Criminal Procedure Code",
      "sections": [
        "S. 145"
      ],
      "relevance": "Proceedings leading to respondent's possession"
    },
    {
      "name": "Hindu Women's Rights to Property Act 1937",
      "sections": [
        "s. 3(2)"
      ],
      "relevance": "Rights of widow of predeceased son questioned"
    },
    {
      "name": "Part C States Laws Act 1950",
      "sections": [],
      "relevance": "Extended 1937 Act to Rewa State effective April 16, 1950"
    },
    {
      "name": "Code of Civil Procedure",
      "sections": [
        "O. 23 r. 1",
        "O. 23 r. 3"
      ],
      "relevance": "Applications for withdrawal and compromise by Jugli Bai"
    },
    {
      "name": "Specific Relief Act 1877",
      "sections": [
        "S. 9"
      ],
      "relevance": "Recovery of possession from dispossession not in due course of law"
    },
    {
      "name": "Hindu Succession Act",
      "sections": [
        "s. 14 Explanation"
      ],
      "relevance": "Contemplates female Hindu in possession of joint family property in lieu of maintenance"
    },
    {
      "name": "Hindu Adoption and Maintenance Act 1956",
      "sections": [
        "s. 19"
      ],
      "relevance": "Governs rights of widowed daughter-in-law to maintenance post-1956"
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; judgment of Madhya Pradesh High Court set aside and that of District Judge restored; case remanded for fresh decision as per District Judge; costs awarded to appellant in Supreme Court and High Court.",
    "relief_granted": "Reversal of High Court; restoration of remand order; costs and court fee recoverable from respondent No. 1",
    "costs": "Costs in Supreme Court and High Court to appellant, recoverable from respondent No. 1; court fee per O.33 r.8 Supreme Court Rules from respondent No. 1"
  },
  "key_quotes": [
    {
      "text": "\"It cannot be disputed that the appellant who is the widow of a predeceased son of Jangi Jogi was entitled to receive maintenance so long as she did not remarry out of the estate of her father-in-law.\"",
      "speaker": "court",
      "significance": "Affirms appellant's maintenance right"
    },
    {
      "text": "\"The possession of the plaintiff was sufficient evidence of title as owner against the defendant.\" (Sir Richard Couch, Privy Council)",
      "speaker": "court",
      "significance": "Establishes possessory title against trespasser"
    },
    {
      "text": "\"It is difficult to see how on the basis of these applications the suit of the appellant could be dismissed.\"",
      "speaker": "court",
      "significance": "Rejects dismissal based on Jugli Bai's withdrawal"
    }
  ],
  "_case_id": "1969_20",
  "_label": 1,
  "_text_length": 14014,
  "_extracted_at": "2026-02-10T20:25:21.064210"
}