{
  "metadata": {
    "case_name": "State of Rajasthan v. Respondent",
    "case_year": 1966,
    "court": "Supreme Court of India",
    "judges": [
      "Shah, J."
    ],
    "case_number": "Civil Appeal No. 812 of 1966",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The respondent carries on the business of fabricating steel doors, windows, sashes and other goods.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On April 20, 1957, the respondent submitted tender to the Executive Engineer, Ajmer Central Division, for providing and fixing S.H. Windows W Type, S.H. Windows W1 Type, T.H. Windows and Composite Windows of certain sizes in accordance with specifications, designs, drawings and instructions.",
      "type": "material",
      "date": "1957-04-20",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The tender was accepted and the respondent carried out the contract.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Sales Tax Officer B Circle, Jaipur City included Rs. 23,480/- received under the contract in the taxable turnover of the respondent, holding that the contract was one of sale of goods and the respondent voluntarily offered to fit the goods without separate charge.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "Deputy Commissioner (Excise and Taxation) in appeal held that two contracts resulted: one for providing doors and windows, another for fixing; price of supplied materials taxable, not service charge. Remanded for assessment on price of materials only.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "Board of Revenue in revisional power confirmed Deputy Commissioner's order, observing that the contract was not a contract of service.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Board of Revenue referred question to Rajasthan High Court: Whether on proper interpretation of the contract between applicant and Executive Engineer, C.P.W.D., Ajmer, for providing and fixing steel windows to Accountant General's Office, Jaipur, and terms of transaction, Board justified in holding contract divisible into sale of windows and labour charges for fixing, partly liable to sales-tax.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Rajasthan High Court on May 13, 1965 held contract was building contract, amount received not taxable.",
      "type": "procedural",
      "date": "1965-05-13",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Tender terms: Item rate-tender for execution for President of India of work specified, at rates specified, per specifications, designs, drawings, instructions; materials as provided; complete in 6 months.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Items of work: providing and fixing four different types of windows.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Conditions: Work per attached specifications; completed in 6 months; windows fitted with rawl plugs in cut stoneworks; plain or ground glass as decided by Engineer-in-Charge; note offering plain glass only, extra for ground glass; quotation based on mild steel billets price, revision if controlled price changes; sales tax extra.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Specifications related to steel used, glazing, fittings, finish of windows.",
      "type": "material",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether on the proper interpretation of the contract between the applicant and the Executive Engineer, C.P.W.D., Ajmer, regarding the providing and fixing of the steel windows to the Accountant General's Office, Jaipur, and looking to the terms of the transaction of the type undertaken by the applicant the Board were justified in holding that the contract was divisible between two parts representing the sale of the windows and the labour charges in fixing the same and thus partly liable to sales-tax?",
      "framed_by": "lower_court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Respondent carried on business of fabricating and selling window and door leaves etc., entered into contract for sale of windows, undertook to fix to promote sale without separate charge; terms of tender not decisive, true effect from nature of work and invoice; usual for manufacturers/dealers to fix specialized articles without making it works contract; examples: motor-tyres, air-conditioning units etc.",
      "supporting_facts": [
        "f1",
        "f3",
        "f9"
      ],
      "legal_basis": "Halsbury's Laws of England, 3rd Edn., Vol. 34 Art. 3"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Contract was for work in execution of which movable property passed, not contract for sale of windows and separate service for fixing.",
      "supporting_facts": [
        "f9",
        "f10",
        "f11"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Whether contract is for sale of goods or service depends on main object from terms, circumstances, custom of trade; no universal rule. Contract of sale: main object transfer of property in chattel qua chattel; otherwise work and labour. Test: whether or not work/labour bestowed on something that becomes subject of sale; ownership of materials or value ratio considered but not conclusive.",
      "addresses_issue": "i1",
      "key_observation": "Quoted Halsbury's Laws of England."
    },
    {
      "id": "cr2",
      "text": "Respondent agreed to fix windows of certain specifications in building as part of works contract, not sell window-leaves as chattels; appears from tender terms: fabricate per specs, fix within 6 months with rawl plugs; rate based on steel price with revision; no two contracts, fixing essential, not incidental.",
      "addresses_issue": "i1",
      "key_observation": "Property passed on completion of work by accretion, not before."
    },
    {
      "id": "cr3",
      "text": "In building contract entire and indivisible, no sale of goods; property in materials passes by accretion.",
      "addresses_issue": "i1",
      "key_observation": "Cited State of Madras v. Gannon Dunkerley."
    },
    {
      "id": "cr4",
      "text": "Contract for work using goods: three forms - (1) work + supply for price (composite); (2) materials accessory/incidental to work; (3) voluntary supply (no sale). Here second category: contract for execution of work not involving sale.",
      "addresses_issue": "i1",
      "key_observation": "Cited Government of Andhra Pradesh v. Guntur Tobaccos Ltd."
    },
    {
      "id": "cr5",
      "text": "Distinguished Patnaik and McKenzies: there contracts for sale of buses as chattels.",
      "addresses_issue": "i1",
      "key_observation": "Based on terms and circumstances."
    },
    {
      "id": "cr6",
      "text": "Arun Electrics: High Court answer discharged as based on ambiguous invoice, not evidence of intention.",
      "addresses_issue": "i1",
      "key_observation": "No conclusive evidence."
    },
    {
      "id": "cr7",
      "text": "Agreed with High Court in State of Madras v. Richardson Cruddas: consolidated payment for fabricate/supply/erect; no dissection of value; predominant skill/labour.",
      "addresses_issue": "i1",
      "key_observation": "Works contract."
    },
    {
      "id": "cr8",
      "text": "Distinguished Love v. Norman Wright: observations not universal test; test is whether chattel qua chattel passes and service separate/incidental to sale. Here primary to fix, specs in contract, special skill required, property passes on fixing as part of building.",
      "addresses_issue": "i1",
      "key_observation": "Agree with High Court."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The contract was a works contract, not for sale of goods; object to enter works contract to prepare and fix windows per specifications; fixing essential term; property in windows passed on completion of work when affixed to building by accretion, not as chattels.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "State of Madras v. Gannon Dunkerley Co. (Madras) Ltd.",
      "citation": "9 S.T.C. 353",
      "treatment": "followed",
      "relevance": "In building contract entire and indivisible, no sale of goods; property passes by accretion."
    },
    {
      "case_name": "Government of Andhra Pradesh v. Guntur Tobaccos Ltd.",
      "citation": "16 S.T.C. 240 (S.C.)",
      "treatment": "followed",
      "relevance": "Forms of works contracts using goods; here materials incidental to work."
    },
    {
      "case_name": "Patnaik and Company v. State of Orissa",
      "citation": "16 S.T.C. 364 (S.C.)",
      "treatment": "distinguished",
      "relevance": "Contract for sale of buses as chattels."
    },
    {
      "case_name": "Mckenzies Ltd. v. State of Maharashtra",
      "citation": "16 S.T.C. 518 (S.C.)",
      "treatment": "distinguished",
      "relevance": "Contract for sale of buses as chattels."
    },
    {
      "case_name": "Commissioner of Sales Tax, Maharashtra State, Bombay v. Arun Electrics",
      "citation": "16 S.T.C. 385",
      "treatment": "referred",
      "relevance": "High Court answer discharged; based on ambiguous invoice, not intention."
    },
    {
      "case_name": "Arun Electrics, Bombay v. Commissioner of Sales Tax, Maharashtra State",
      "citation": "17 S.T.C. 576",
      "treatment": "followed",
      "relevance": "Discharged High Court answer in Arun Electrics."
    },
    {
      "case_name": "State of Madras v. Richardson Cruddas Ltd.",
      "citation": "21 S.T.C. 245",
      "treatment": "followed",
      "relevance": "Contract for fabricate/supply/erect steel structures was works contract."
    },
    {
      "case_name": "Love v. Norman Wright Builders Ltd.",
      "citation": "1944 1 K.B. 484",
      "treatment": "distinguished",
      "relevance": "Not universal test; depends if chattel passes qua chattel with separate/incidental service."
    }
  ],
  "statutes_cited": [
    {
      "name": "Bombay Sales Tax Act, 1959",
      "sections": [],
      "relevance": "Mentioned in context of Arun Electrics case."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court agreed with the Rajasthan High Court that the contract was a building works contract and not liable to sales tax on the amount received, as it was not a contract for sale of goods but for work in execution of which property passed by accretion upon fixing.",
    "relief_granted": "None specified; upheld High Court decision in favor of respondent.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"A contract of sale is a contract whose main object is the transfer of the property in, and the delivery of the possession of, a chattel as a chattel to the buyer.\"",
      "speaker": "court",
      "significance": "Defines test to distinguish sale from works contract, from Halsbury."
    },
    {
      "text": "\"Whether a contract is of the first or the second class must depend upon the circumstances.\"",
      "speaker": "court",
      "significance": "Classifies works contracts; holds this case second category (no sale)."
    },
    {
      "text": "The fixing of windows in the manner stipulated required special technical skill. If the windows were not properly fixed the contract would not be complete.",
      "speaker": "court",
      "significance": "Emphasizes fixing as essential, not incidental to sale."
    },
    {
      "text": "\"We agree with the High Court that it was only upon the fixing of the window-leaves and when the window-leaves had become a part of the building construction that the property in the goods passed under the terms of the contract.\"",
      "speaker": "court",
      "significance": "Core holding on passage of property."
    }
  ],
  "_case_id": "1969_19",
  "_label": 0,
  "_text_length": 17121,
  "_extracted_at": "2026-02-10T20:25:33.394480"
}