{
  "metadata": {
    "case_name": "Lala Praduman Kumar v. Virendra Goyal",
    "case_year": 1966,
    "court": "Supreme Court of India",
    "judges": [
      "Shah, J."
    ],
    "case_number": "Civil Appeal No. 648 of 1966",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Under a deed dated October 28, 1949, Virendra Goyal, the first respondent, obtained permanent tenancy rights in 28 plots of land owned by Lala Praduman Kumar.",
      "type": "background",
      "date": "1949-10-28",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The tenant agreed to pay Rs. 250/- per annum as advance rent on the first day of January of each year, and in default of payment of rent for two consecutive years the tenancy rights were to stand forfeited.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Goyal transferred his tenancy rights to Lala Hukam Chand.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Pursuant to the lease several tenements were raised on the land demised.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The tenant failed to pay the rent accrued due for two years.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The appellant served a notice on January 4, 1960, terminating the tenancy.",
      "type": "procedural",
      "date": "1960-01-04",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Appellant instituted an action in the Court of the City Munsiff, Saharanpur, against Virendra Goyal and Lala Hukam Chand for a decree in ejectment and for an order for payment of Rs. 545/11- as rent and compensation.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Several contentions were raised in their written statement by the defendants one of which alone is material. The tenants prayed that they should be given relief against forfeiture of their tenancy rights under s. 114 of the Transfer of Property Act.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f9",
      "text": "In the Trial Court the tenants deposited an amount of Rs. 1,099-34.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "The Trial Judge held that the conditions relating to deposit in Court of rent in arrear interest thereon, and costs of the suit were not complied with and decreed the plaintiffs claim.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "In appeal to the District Court the tenant offered to pay the balance of the amount of the rent due together with costs of the suit and appeal and interest at the rate of 6 per annum or such other rate as the Court may direct and deposit in Court Rs. 2,082.50 in the aggregate.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f12",
      "text": "The learned District Judge was of the view that the amount paid by the tenants was in excess of the amount due by them.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "There are valuable constructions over the plot and defendants dispossession would put them to a great loss.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "The District Court found that the appellants are entitled to the benefit of section 114 of the Transfer of Property Act and are relieved against the forfeiture.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f15",
      "text": "The second appeal against this decision was summarily dismissed by the High Court of Allahabad on December 4, 1964.",
      "type": "procedural",
      "date": "1964-12-04",
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether jurisdiction under s. 114 of the Transfer of Property Act to relieve against forfeiture for non-payment of rent may only be exercised by the Court of First Instance and not by the Court of Appeal.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether the Trial Court gave an opportunity to the tenants to pay the amount of rent due together with interest and costs, but the tenants failed to avail themselves of the opportunity, so the appellate Court had no jurisdiction to grant another opportunity.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether discretion was, in the circumstances, not properly exercised by the District Court.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Jurisdiction under s. 114 of the Transfer of Property Act to relieve against forfeiture for non-payment of rent may only be exercised by the Court of First Instance and not by the Court of Appeal.",
      "supporting_facts": [],
      "legal_basis": "Section 114 of the Transfer of Property Act"
    },
    {
      "id": "pa2",
      "text": "The Trial Court gave an opportunity to the tenants to pay the amount of rent due together with interest and costs, but the tenants failed to avail themselves of the opportunity. In the circumstances the appellate Court had no jurisdiction to grant another opportunity to the tenants to make the requisite payment and grant relief against forfeiture of the tenancy.",
      "supporting_facts": [
        "f9",
        "f10"
      ],
      "legal_basis": "Section 114 of the Transfer of Property Act"
    },
    {
      "id": "pa3",
      "text": "In any event, discretion was, in the circumstances, not properly exercised by the District Court.",
      "supporting_facts": [
        "f11",
        "f12",
        "f13",
        "f14"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Section 114 of the Transfer of Property Act provides: Where a lease of immovable property has determined by forfeiture for non-payment of rent, and the lessor sues to eject the lessee, if, at the hearing of the suit, the lessee pays or tenders to the lessor the rent in arrear, together with interest thereon and his full costs of the suit, or gives such security as the Court thinks sufficient for making such payment within fifteen days, the Court may, in lieu of making a decree for ejectment, pass an order relieving the lessee against the forfeiture and thereupon the lessee shall hold the property leased as if the forfeiture had not occurred.",
      "addresses_issue": "i1",
      "key_observation": "The covenant of forfeiture of tenancy for non-payment of rent is regarded by the Courts as merely a clause for securing payment of rent, and unless the tenant has by his conduct disentitled himself to equitable relief the Courts grant relief against forfeiture of tenancy on the tenant paying the rent due, interest thereon and costs of the suit."
    },
    {
      "id": "cr2",
      "text": "Jurisdiction to relieve against forfeiture for non-payment of rent may be exercised by the Court if the tenant in a suit in ejectment at the hearing of the suit pays the arrears of rent together with interest thereon and full costs of the suit. In terms s. 114 makes payment of rent at the hearing of the suit in ejectment a condition of the exercise of the Courts jurisdiction but an appeal being a rehearing of the suit, in appropriate cases it is open to the appellate Court at the hearing of the appeal to relieve the tenant in default against forfeiture.",
      "addresses_issue": "i1",
      "key_observation": "Passing of a decree in ejectment against the tenant by the Court of First Instance does not take away the jurisdiction of the appellate Court to grant equitable relief."
    },
    {
      "id": "cr3",
      "text": "There is no bar to the exercise of jurisdiction by the appellate court merely because in the Court of First Instance relief against forfeiture was claimed by the tenants and they failed to avail themselves of the opportunity of paying the amount of rent together with interest thereon and costs of the suit. Failure to avail themselves of the opportunity does not operate as a bar to the jurisdiction of the Appellate Court. The Appellate Court may, having regard to the conduct of the tenant, decline to exercise its discretion to grant him relief against forfeiture. The question is not one of jurisdiction but of discretion.",
      "addresses_issue": "i2",
      "key_observation": "In exercising the discretion under s. 114 of the Transfer of Property Act, each case must be judged by itself, the delay, the conduct of the parties and the difficulties to which the landlord has been put should be weighed against the tenant."
    },
    {
      "id": "cr4",
      "text": "The District Court has observed that valuable constructions had been put upon the land leased and the tenants had deposited an amount very much larger than the amount due to the landlord. Having regard to the circumstances the District Court was of the view that discretion should be exercised in favour of the tenants. The High Court summarily dismissed the appeal. The High Court must be taken to have confirmed the view of the District Court.",
      "addresses_issue": "i3",
      "key_observation": "In our view, there is no substance in any of the contentions."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Jurisdiction to relieve against forfeiture for non-payment of rent may be exercised by the appellate court at the hearing of the appeal to relieve the tenant in default against forfeiture.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Failure by tenants to avail opportunity in trial court does not bar appellate court's jurisdiction; it is a matter of discretion based on conduct.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "District Court properly exercised discretion in favour of tenants given excess deposit and valuable constructions.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Chilukuri Tripura Sundaramma v. Chilkuri Venketes-Warlu alias Ramchandram and others",
      "citation": "A.I.R. 1949 Mad. 841",
      "treatment": "followed",
      "relevance": "Appellate court jurisdiction to grant relief under s.114 TPA"
    },
    {
      "case_name": "Janab Vellathi and others v. Smt. K. Kadervel Thayammal",
      "citation": "A.I.R. 1958 Mad. 232",
      "treatment": "followed",
      "relevance": "Appellate court jurisdiction to grant relief under s.114 TPA"
    },
    {
      "case_name": "Shrikishanlal and others v. Ramnath Jankiprasad Ahir and others",
      "citation": "I.L.R. 1944 Nag. 877",
      "treatment": "followed",
      "relevance": "Appellate court jurisdiction to grant relief under s.114 TPA"
    },
    {
      "case_name": "Budhi Ballabh and others v. Jai Kishen Kandpal",
      "citation": "1963 A.L.J. 132",
      "treatment": "followed",
      "relevance": "Appellate court jurisdiction to grant relief under s.114 TPA"
    },
    {
      "case_name": "Bhagwant Rambhau Khese v. Ramchandra Kesho Pathak",
      "citation": "A.I.R. 1953 Bom. 129",
      "treatment": "followed",
      "relevance": "Appellate court jurisdiction to grant relief under s.114 TPA in cases under Bombay Rents Act"
    },
    {
      "case_name": "Namdeo Lokman Lodhi v. Narmadabai and others",
      "citation": null,
      "treatment": "followed",
      "relevance": "Discretion under s.114 TPA to be exercised considering delay, conduct of parties and difficulties to landlord"
    }
  ],
  "statutes_cited": [
    {
      "name": "Transfer of Property Act",
      "sections": [
        "114"
      ],
      "relevance": "Relief against forfeiture for non-payment of rent upon payment of arrears, interest and costs at hearing of suit; appellate court may exercise in rehearing"
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court held there is no substance in any of the contentions raised by the appellant and dismissed the appeal, confirming the relief granted to the tenants against forfeiture under s.114 TPA by the District Court and upheld by the High Court.",
    "relief_granted": "Tenants relieved against forfeiture upon payment of rent arrears, interest and costs",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The covenant of forfeiture of tenancy for non-payment of rent is regarded by the Courts as merely a clause for securing payment of rent, and unless the tenant has by his conduct disentitled himself to equitable relief the Courts grant relief against forfeiture",
      "speaker": "court",
      "significance": "Explains equitable basis for relief under s.114 TPA"
    },
    {
      "text": "an appeal being a rehearing of the suit, in appropriate cases it is open to the appellate Court at the hearing of the appeal to relieve the tenant in default against forfeiture.",
      "speaker": "court",
      "significance": "Affirms appellate jurisdiction under s.114 TPA"
    },
    {
      "text": "It is a maxim of equity that a person who comes in equity must do equity and must come with clean hands and if the conduct of the tenant is such that it disentitles him to relief in equity, then the courts hands are not tied to exercise it in his favour.",
      "speaker": "court",
      "significance": "Guideline for exercising discretion under s.114 TPA"
    }
  ],
  "_case_id": "1969_38",
  "_label": 0,
  "_text_length": 8065,
  "_extracted_at": "2026-02-10T20:25:24.943202"
}