{
  "metadata": {
    "case_name": "Samant N. Balakrishna v. George Fernandez & S.K. Patil",
    "case_year": 1968,
    "court": "Supreme Court of India",
    "judges": [
      "Hidayatullah, C.J."
    ],
    "case_number": "Civil Appeals Nos. 895 and 896 of 1968",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "In the last General Election to Parliament from the Bombay South Parliamentary constituency eight candidates offered themselves. Mr. George Fernandez secured 1,47,841 votes as against his nearest rival Mr. S.K. Patil who secured 1,18,407 votes. Result declared on February 24, 1967, and Mr. George Fernandez returned.",
      "type": "background",
      "date": "1967-02-24",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Election petition filed by Mr. Samant N. Balakrishna, an elector, challenging election of Mr. Fernandez, ostensibly in interest of Mr. S.K. Patil. Petition keenly contested with full support of Mr. S.K. Patil.",
      "type": "procedural",
      "date": "1967-04-07",
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "Petition based on grounds in paragraph 2, sub-paragraphs A to J. Sub-paragraphs A to D (invalidity for non-compliance with s.62 RP Act, Arts. 326,327 Constitution: secrecy of ballot, double registration, omission of voters, impersonation) given up in High Court.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "Sub-paragraphs E to J alleged corrupt practices. Accompanied by annexures A to D (newspaper extracts from Maratha, Blitz). E: Statements by Jagadguru Shankaracharya at Shivaji Park Feb 16, 1967 charging Patil with complicity in arson Nov 7, 1966; similar by Madhu Limaye. F: Shankaracharya on cow slaughter. G: Speeches by Fernandez and workers describing Patil as enemy of Muslims/Christians. H: Maratha Jan 25, 1967 false statement Patil paid 15 lacs to Jack Sequeira; Gokhale speech. I: Maratha issues Jan 5,31, Feb 5,8 1967 on Shiv Sena supporting Patil as traitor. J: Maratha Dec 24,28,31 1966 false statements on Patil; plus 33 issues Dec 12,1966 to Feb 21,1967.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "Fernandez written statement filed June 14, 1967; Patil July 4, 1967. Amendments: Oral amendment changing Ex.D to E. July 4 application for 2-K,L (L: Blitz article Nov 5,1966 by Fernandez). Sept 12 application for 7 additions to 2J: 4 allowed (i: Shivaji Park Jan 31 speech by Fernandez; ii: Bristol Grill Feb 9 press conf; iii: Sabu Siddik Chawl Feb 10; iv: Chowpati Jan 8 by Madhu Limaye); 3 rejected.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "Office objection April 7, 1967: originals of Ex A-D not filed, mere repetitions. Reply: Undertake to file originals/translations later. No effort till July 3: Amendment to correct D to E, annex originals. Issues settled July 3. Originals tendered July 7. Particulars furnished Aug 4.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Bombay High Court dismissed petition with costs against petitioner and Patil on Jan 29, 1968.",
      "type": "procedural",
      "date": "1968-01-29",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Evidence commenced Aug 25, 1967; petitioner proved copies of newspapers marked exhibits.",
      "type": "procedural",
      "date": "1967-08-25",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Roznamas show originals of Maratha not filed with petition but later, beyond limitation period.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Only 10 extracts from Maratha in Ex A-D filed initially; 33 issues in 2J last para not filed timely; Ex E filed July 3/7.",
      "type": "material",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether amendments to election petition introducing new corrupt practices by candidate personally (speeches, Blitz article) after limitation period were allowable, distinguishing material facts vs particulars under ss.83,86(5) RP Act.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether Mr. Atrey (editor Maratha) acted as agent of Fernandez with his consent for publications under s.123(4), triggering s.100(1)(b) or requiring material effect under s.100(1)(d).",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether originals/extracts of newspapers filed timely with petition, affecting validity of corrupt practice allegations.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Amendments merely amplification/particulars of existing corrupt practice under s.123(4); new instances permissible post-limitation per s.86(5), Harish Chandra Bajpai; thorough investigation needed.",
      "supporting_facts": [
        "f4",
        "f5"
      ],
      "legal_basis": "ss.83,86(5),100 RP Act 1951; Harish Chandra Bajpai v. Triloki Singh"
    },
    {
      "id": "pa2",
      "text": "Originals/extracts filed or waived; evidence proceeded without objection.",
      "supporting_facts": [
        "f6",
        "f8"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Atrey agent of Fernandez; consent presumed from association, common cause, column 'George Fernandez Election Front', mutual support; similarity in statements infers consent.",
      "supporting_facts": [
        "f4",
        "f10"
      ],
      "legal_basis": "s.123(4) Expl; s.100(1)(b) RP Act; Rama Krishna case, Inder Lall Yugal Kishore"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "No originals filed timely; 33 issues added post-limitation without extracts/particulars; amendments introduce new causes (personal acts by Fernandez), not amplification.",
      "supporting_facts": [
        "f6",
        "f9",
        "f10"
      ],
      "legal_basis": "ss.81,83,86(5) RP Act; material facts vs particulars distinction"
    },
    {
      "id": "ra2",
      "text": "No specific consent to each publication; Atrey acted as editor/newspaper owner independently, not all acts attributable; agency limited, no presumption for s.100(1)(b).",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": "s.100(1)(b),(d); s.123(4); Kumara Nand v. Brijmohan Lal"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Originals of Maratha not filed with petition; only 10 extracts timely; 33 issues post-limitation; no incorporation by reference without exact offending portions.",
      "addresses_issue": "i3",
      "key_observation": "Roznamas accurate; office objection and reply confirm delay."
    },
    {
      "id": "cr2",
      "text": "Distinction material facts (complete cause of action/ground) vs particulars (amplification); s.86(5) allows particulars amendment but bars new corrupt practice particulars/grounds post-limitation.",
      "addresses_issue": "i1",
      "key_observation": "Original 2J charged agent (Maratha/Atrey); amendments charged candidate personally - new cause under s.123(4)(a) vs (b)(iii)."
    },
    {
      "id": "cr3",
      "text": "Amendments for personal speeches/press conf/Blitz article disallowed as new charges; agency averment and belief averment allowed as completing existing cause.",
      "addresses_issue": "i1",
      "key_observation": "Harish Chandra Bajpai allows instances of same charge, not new charges altering petition character."
    },
    {
      "id": "cr4",
      "text": "Atrey agent conceded; but consent to each publication not proved; newspaper acts independent of agency; no general consent inferred from support/association.",
      "addresses_issue": "i2",
      "key_observation": "s.100(1)(b) requires specific consent; else s.100(1)(d) needs material effect proof. Candidate's belief key under s.123(4)."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Amendments introducing corrupt practices by candidate personally disallowed under s.86(5) RP Act as new grounds post-limitation.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Original petition confined to agent's (Atrey/Maratha) acts under s.100(1)(d)/(b) with consent needed; consent not established for publications.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Newspaper originals/extracts not filed timely; limits case to quoted extracts in body.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Harish Chandra Bajpai v. Triloki Singh",
      "citation": "1957 S.C.R. 370",
      "treatment": "distinguished",
      "relevance": "Allows particulars/new instances of existing charge, not new charges post-limitation."
    },
    {
      "case_name": "Jagan Nath v. Jaswant Singh",
      "citation": "1954 S.C.R. 892",
      "treatment": "followed",
      "relevance": "Strict observance of statutory requirements in election petitions."
    },
    {
      "case_name": "Kumara Nand v. Brijmohan Lal Sharma",
      "citation": "1967 2 S.C.R. 127",
      "treatment": "followed",
      "relevance": "Candidate's belief key in s.123(4); responsibility for agent's publication."
    },
    {
      "case_name": "Sheopat Singh v. Ram Pratap",
      "citation": "1965 1 S.C.R. 175",
      "treatment": "followed",
      "relevance": "Averment of belief/non-belief essential for corrupt practice."
    },
    {
      "case_name": "Chandi Prasad Chokhani v. State of Bihar",
      "citation": "1962 2 S.C.R. 289",
      "treatment": "followed",
      "relevance": "Amendments controlled by RP Act; no new grounds."
    }
  ],
  "statutes_cited": [
    {
      "name": "Representation of the People Act, 1951",
      "sections": [
        "s.62",
        "s.81",
        "s.83",
        "s.86",
        "s.100",
        "s.101",
        "s.116A",
        "s.123(3)",
        "s.123(3A)",
        "s.123(4)"
      ],
      "relevance": "Governs election petitions, corrupt practices (false statements re character/conduct), amendments, grounds for voiding election, consent, material effect."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 326",
        "Art. 327"
      ],
      "relevance": "Adult suffrage, election laws; grounds A-D abandoned."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court disallowed key amendments as introducing new corrupt practices by candidate post-limitation, confined case to agent's acts without proven consent/material effect; upheld High Court dismissal of election petition.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The entire and complete cause of action must be in the petition in the shape of material facts, the particulars being the further information to complete the picture.",
      "speaker": "court",
      "significance": "Defines distinction material facts vs particulars under s.83 RP Act."
    },
    {
      "text": "Publication of false statements by an agent is one cause of action, publication of false statements by the candidate is quite a different cause of action.",
      "speaker": "court",
      "significance": "Explains why amendments for candidate's personal acts are new grounds."
    },
    {
      "text": "The statutory requirements of the law of Election in India must be strictly observed.",
      "speaker": "court",
      "significance": "Cites Jagan Nath; underscores strict pleading in election law."
    }
  ],
  "_case_id": "1969_163",
  "_label": 0,
  "_text_length": 102754,
  "_extracted_at": "2026-02-10T20:26:47.887059"
}