{
  "metadata": {
    "case_name": "Management (Pradeep Lamp Works) v. Their Workmen",
    "case_year": 1967,
    "court": "Supreme Court of India",
    "judges": [
      "Dua, J."
    ],
    "case_number": "Civil Appeal No. 482 of 1967",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Strike launched by the workers on the morning of the 27th February, 1964.",
      "type": "material",
      "date": "1964-02-27",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Lock-out declared by the Management on February 27, 1964, beginning with February 28, 1964 and ending with March 22, 1964.",
      "type": "material",
      "date": "1964-02-28 to 1964-03-22",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On March 20, 1964 the Governor of Bihar referred the following disputes to the Industrial Tribunal: Whether the strike launched by the workers on the morning of the 27th February, 1964, was justified? Whether the lock-out declared by the Management is justified? Whether the workmen are entitled to wages for the period of strike and or lock-out.",
      "type": "procedural",
      "date": "1964-03-20",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Tribunal held that the strike by the workmen on February 27, 1964 was not justified.",
      "type": "admitted",
      "date": "1966-10-13",
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "Tribunal held that the lock-out declared by the Management on February 27, 1964 was justified but no justification for continuing the lock-out on the following days.",
      "type": "disputed",
      "date": "1966-10-13",
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "Tribunal decided that the workmen were entitled to wages for the remaining period of the lock-out.",
      "type": "admitted",
      "date": "1966-10-13",
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Proceedings of the Tribunal held on September 29, 1966: Parties present; Management represented by Shri Pandey S. Prasad; workmen by advocates; written statement filed late and not accepted; Workers Union adduces evidence; Management examines M.W.1 Trilokinath Rastogi and M.W.2 Shri R.M. Kahattriya; Management prays for adjournment to examine more witnesses, prayer rejected; oral evidence of management closed; Union examines L.W.1 Krishna Thakur; case adjourned to next day.",
      "type": "procedural",
      "date": "1966-09-29",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Appellant made a written application on September 29, 1966 seeking opportunity for producing witnesses named therein, but prayer disallowed.",
      "type": "procedural",
      "date": "1966-09-29",
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "Trivial instance of slapping a workman which led to a demand by the workmen for an apology from the offending party, leading to the strike and lock-out.",
      "type": "background",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f10",
      "text": "Award dated October 13, 1966 of the Industrial Tribunal, Bihar, Patna in Reference No. 7 of 1964 pronounced on November 10, 1966.",
      "type": "procedural",
      "date": "1966-10-13",
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the lock-out by the Management was justified after February 27, 1964?",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the workmen are entitled to wages for the period of lock-out between February 28, 1964 and March 22, 1964?",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether the appellant had been deprived of a reasonable opportunity of adducing evidence in support of its case before the Tribunal?",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The finding of fact that the lock-out was unjustified after February 27, 1964 is not open to challenge, but the order is open to question because the appellant was deprived of a reasonable opportunity of adducing evidence; Tribunal wrongly rejected prayer for adjournment on September 29, 1966 despite giving time to Karamchari Sangh; discretion exercised arbitrarily and contrary to judicial procedure; written application for witnesses disallowed discriminatorily.",
      "supporting_facts": [
        "f7",
        "f8"
      ],
      "legal_basis": "Article 136 of the Constitution"
    },
    {
      "id": "pa2",
      "text": "Full wages cannot be awarded for the lock-out period as blame is apportionable to both parties; normal practice is to award half wages.",
      "supporting_facts": [
        "f1",
        "f2",
        "f4",
        "f5"
      ],
      "legal_basis": "India General Navigation and Railway Co. Ltd. v. Their Workmen (1960 2 S.C.R. 1); India Marine Service Private Ltd. v. Their Workmen (1963 3 S.C.R. 575)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Parties must be presumed to have been directed to come ready with oral evidence on September 29, 1966; appellant should have produced previous order to rebut presumption; question of adjournment is matter of discretion not assailable under Article 136.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Management adopting dilatory tactics; trivial slapping incident led to demand for apology, strike and lock-out; workmen deprived of wages for one illegal strike day; thereafter willing to work but management continued unjustified lock-out; full wages justified.",
      "supporting_facts": [
        "f1",
        "f2",
        "f9"
      ],
      "legal_basis": "pany Ltd. v. Their Employees"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Appellant conceded finding of fact on strike not open to challenge.",
      "addresses_issue": "i1",
      "key_observation": "Finding of fact not challenged."
    },
    {
      "id": "cr2",
      "text": "Order disallowing adjournment prima facie arbitrary and injudicious; more appropriate to adjourn to following day on costs.",
      "addresses_issue": "i3",
      "key_observation": "Tribunal's discretion exercised poorly."
    },
    {
      "id": "cr3",
      "text": "Incumbent on Tribunal to apply mind to apportionment of blame between parties and its effect on wages for lock-out after February 28, 1964; order ignoring this infirm and difficult to sustain.",
      "addresses_issue": "i2",
      "key_observation": "Blame on both parties requires apportionment."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Tribunal's order on continuation of lock-out and wages infirm as it failed to apportion blame between parties.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Tribunal's rejection of adjournment prima facie arbitrary.",
      "resolves_issue": "i3",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "India General Navigation and Railway Co. Ltd. v. Their Workmen",
      "citation": "1960 2 S.C.R. 1",
      "treatment": "followed",
      "relevance": "When blame attaches to both parties in illegal strike context, divide loss half and half; award half wages."
    },
    {
      "case_name": "India Marine Service Private Ltd. v. Their Workmen",
      "citation": "1963 3 S.C.R. 575",
      "treatment": "followed",
      "relevance": "Where unjustified strike followed by lock-out that becomes unjustified due to duration, apportion blame half and half; award half wages."
    },
    {
      "case_name": "pany Ltd. v. Their Employees",
      "citation": null,
      "treatment": "referred",
      "relevance": "Assault on workman not serious enough to justify lock-out continuation."
    }
  ],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Article 136"
      ],
      "relevance": "Scope of appeal by special leave; findings of fact generally not challengeable but procedural fairness reviewable."
    }
  ],
  "outcome": {
    "disposition": "partially_accepted",
    "summary": "Appeal directed against Tribunal award holding lock-out unjustified after Feb 27 and awarding full wages; Court finds Tribunal failed to apportion blame and exercise discretion properly on evidence but text cuts off without final explicit order; indicates infirmity in award.",
    "relief_granted": "Implied criticism suggesting remand consideration for apportionment and evidence.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"When the blame attaches to both the parties, we think that they should divide the loss half and half between them.\"",
      "speaker": "court",
      "significance": "Principle from precedent applied to wages apportionment."
    },
    {
      "text": "\"In a case where a strike is unjustified and is followed by a lock-out which becomes unjustified a case for apportionment of blame arises.\"",
      "speaker": "court",
      "significance": "Directly relevant to facts; supports half wages."
    },
    {
      "text": "\"The order of the Tribunal ignoring this important aspect is infirm and is difficult to sustain.\"",
      "speaker": "court",
      "significance": "Court's key finding on wages award error."
    }
  ],
  "_case_id": "1969_136",
  "_label": 1,
  "_text_length": 11311,
  "_extracted_at": "2026-02-10T20:26:04.829647"
}