{
  "metadata": {
    "case_name": "Appellant v. Urmilla Sundari Dassi",
    "case_year": 1956,
    "court": "Supreme Court of India",
    "judges": [
      "Grover, J."
    ],
    "case_number": "Civil Appeal No. 1356 of 1956",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "One Ratanamala Dassi who was governed by the Bengal School of Hindu Law as modified by the Hindu Succession Act 1956 died intestate in January 1964 leaving no issue or lineal descendants.",
      "type": "background",
      "date": "1964-01",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Her husband Monmotha Nath Dutt had predeceased her.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The said Ratnamala Dassi left her surviving the appellant and respondents 2 and 3, the brothers of her husband and respondent 1, Urmilla Sundari Dassi her husbands sister.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "In 1964 respondent No. 1 instituted a suit for a declaration that as an heiress of Ratnamala Dassi she had 1/4 share in the movable and immovable property left by her and that she be allotted her share by partition of those properties.",
      "type": "procedural",
      "date": "1964",
      "source": "respondent"
    },
    {
      "id": "f5",
      "text": "The appellant entered appearance and took up the plea in his written statement that under the Act he and respondents 2 and 3 being the brothers of the husband of the deceased Ratnamala Dassi were the heirs in preference to respondent 1 who was the sister of the deceaseds husband.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "The suit was tried on the original side by a learned Single Judge of the Calcutta High Court who granted a preliminary decree on December 23, 1964 in favour of respondent 1 holding that she had 1/4 share in the estate left by Ratnamala Dassi.",
      "type": "procedural",
      "date": "1964-12-23",
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "The appellant preferred an appeal to a division bench which was dismissed.",
      "type": "procedural",
      "date": "1965-12-03",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "This is an appeal by certificate from a judgment of the Calcutta High Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "whether, according to the order of succession as laid down in Class II of the Schedule to s. 8 of the Act, brother would succeed in preference to the sister or whether the brother and sister would succeed jointly having equal shares",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "brother being prefixed by arabic numeral 3 came before sister which word had the numeral 4 before it and that the object of using the numerals within a particular group was to prescribe the order of precedence or preference.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": "Class II of the Schedule to s. 8 of the Hindu Succession Act 1956"
    },
    {
      "id": "pa2",
      "text": "the use of the arabic numerals in groups II, III and IV of Class II must have some meaning otherwise the legislature would have used such numerals in respect of the heirs numbered only in class II but in class I as well.",
      "supporting_facts": [],
      "legal_basis": "Schedule to Hindu Succession Act 1956"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Opposed the appellant's claim that numerals indicate preference among heirs in entry II of Class II.",
      "supporting_facts": [
        "f4",
        "f6"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The use of arabic numerals is decisive of the point whether or not the heirs specified in entry II of class II succeed simultaneously and equally. It is inconceivable that a matter of such importance should have been left to the employment of numerals alone.",
      "addresses_issue": "i1",
      "key_observation": "Numerals appear redundant; combined effect of sections indicates heirs named after numerals II,III,IV composed three entries only."
    },
    {
      "id": "cr2",
      "text": "s.11 says quite clearly that the property of an intestate shall be divided between the heirs specified in any one entry in class II of the Schedule so that they share equally. That language would not be consistent with the view that the heirs shown against the arabic numerals constitute an entry within the meaning of s. 11.",
      "addresses_issue": "i1",
      "key_observation": "Heirs in one entry in Class II take simultaneously and share equally."
    },
    {
      "id": "cr3",
      "text": "The Act was meant to lay down a comprehensive and uniform system of inheritance... that in succession there should be equal distribution between male and female heirs.",
      "addresses_issue": "i1",
      "key_observation": "No reason to distinguish male and female heirs in Class II; scheme treats them equally."
    },
    {
      "id": "cr4",
      "text": "Generally speaking numbers or numerals are employed in a statute for the sake of convenient and easy reference but their use cannot override the statutory provisions.",
      "addresses_issue": "i1",
      "key_observation": "Numerals for reference, not to create order of preference."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Brother and sister in entry II(3) and II(4) of Class II succeed jointly having equal shares, as per s.11 of the Act.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Hindu Succession Act 1956",
      "sections": [
        "Section 8",
        "Section 9",
        "Section 10",
        "Section 11",
        "Section 15",
        "Section 16",
        "Schedule Class I",
        "Schedule Class II"
      ],
      "relevance": "Governs order of succession for intestate female Hindu; property devolves upon heirs of husband as per Class II; heirs in same entry share equally."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal is dismissed holding that under Class II entry II of the Schedule to s.8 read with ss.11,15,16 of the Hindu Succession Act 1956, the brothers and sister of the predeceased husband take the estate equally.",
    "relief_granted": null,
    "costs": "dismissed with costs"
  },
  "key_quotes": [
    {
      "text": "the property of an intestate shall be divided between the heirs specified in any one entry in class II of the Schedule so that they share equally.",
      "speaker": "court",
      "significance": "Directly interprets s.11 to mandate equal shares among heirs in same Class II entry."
    },
    {
      "text": "It is inconceivable that a matter of such importance should have been left to the employment of numerals alone.",
      "speaker": "court",
      "significance": "Rejects argument that arabic numerals in Schedule create order of preference."
    },
    {
      "text": "in succession there should be equal distribution between male and female heirs.",
      "speaker": "court",
      "significance": "Highlights core reform of the Act for gender equality in inheritance."
    }
  ],
  "_case_id": "1969_227",
  "_label": 0,
  "_text_length": 9515,
  "_extracted_at": "2026-02-10T20:26:42.411366"
}