{
  "metadata": {
    "case_name": "Delhi Cloth and General Mills Co. Ltd. v. Respondents",
    "case_year": 1966,
    "court": "Supreme Court of India",
    "judges": [
      "Grover, J."
    ],
    "case_number": "Civil Appeal No. 1424 of 1966",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Delhi Cloth and General Mills Co. Ltd. operates a number of industrial establishments which are factories within the meaning of s. 2(m) of the Factories Act 1948 in the Delhi area.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The company has to pay a total sum of Rs. 12,775.00 as annual licence fee for all its factories in Delhi, calculated according to the Horse Power and the maximum number of workers to be employed on any day during the year as given in the Schedule to Rule 5. The maximum fee payable is Rs. 2,000/- for a factory.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Factories can be run only after registration and under a licence granted under the Act and the Rules on payment of the prescribed fee. The licence is renewed every year under Rule 7 on payment of the same fee.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Every licence granted or renewed remains in force up to December 31 of the year for which it is granted or renewed.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "In January 1963 the company filed a petition under Arts. 226 and 227 of the Constitution in the Punjab High Court, Circuit Bench at Delhi (Civil Writ No. 3-D of 1963) challenging the validity of Rule 7 read with Rule 5 and its Schedule of the Delhi Factories Rules 1950 made under s. 112 of the Factories Act 1948.",
      "type": "procedural",
      "date": "1963-01",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The writ petition was dismissed by a division bench on February 11, 1965.",
      "type": "procedural",
      "date": "1965-02-11",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "The company filed the present appeal by certificate.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "In the return filed in the High Court, it was stated that at least 60% of the amount realised as licence fee was being utilised on running the department.",
      "type": "admitted",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f9",
      "text": "The fees were being charged for the running of the whole establishment including the Factory Inspectorate which provides free inspection and expert technical advice to factory owners in matters connected with safety, health, welfare and compliance with the Factories Act.",
      "type": "admitted",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f10",
      "text": "The High Court found that 60% of the amount of licence fees realised was actually spent on services rendered to the factory owners.",
      "type": "admitted",
      "date": null,
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether Rule 7 read with Rule 5 and its Schedule of the Delhi Factories Rules 1950 is valid, specifically whether the licence fee for renewal is a fee or a tax lacking quid pro quo.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The payment for renewal of the licence is only to endorse the licence as valid for the next year and the amount charged cannot entail services commensurate with the amount; element of quid pro quo distinguishing fee from tax is absent.",
      "supporting_facts": [
        "f2",
        "f3",
        "f4"
      ],
      "legal_basis": "Corporation of Calcutta v. Liberty Cinema"
    },
    {
      "id": "pa2",
      "text": "The Act contains provisions for benefits to workmen by factory owners; Inspectors constitute a policing agency to ensure compliance, not services for factory owners or workmen.",
      "supporting_facts": [
        "f1"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "High Court failed to apply principles from decisions like Liberty Cinema for determining if levy is fee or tax.",
      "supporting_facts": [],
      "legal_basis": "Corporation of Calcutta v. Liberty Cinema; H.H. Sudhundra Thirtha Swamiar v. Commissioner"
    },
    {
      "id": "pa4",
      "text": "Inspectors only ensure statutory compliance and launch prosecutions; no broader services.",
      "supporting_facts": [],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Work by Inspectors to ensure implementation of Act's provisions for health and welfare of workers is service rendered in return for the fee.",
      "supporting_facts": [
        "f8",
        "f9"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "In each case, examine scheme of statutory provisions, duties of inspecting staff, and nature of work to determine if services make levy a fee; Liberty Cinema distinguishable as no service there, but here contributions maintain supervisory authority like in religious institutions cases.",
      "addresses_issue": "i1",
      "key_observation": "Present case falls within class where contributions for supervising public institutions are fees."
    },
    {
      "id": "cr2",
      "text": "Detailed provisions in Factories Act Chapters II-V on inspecting staff, health, safety, welfare involve technical advice, guidance, preventing dangers, benefiting factory owners.",
      "addresses_issue": "i1",
      "key_observation": "Inspectors render service beyond policing, e.g., warnings on dangerous machinery, orders for safety."
    },
    {
      "id": "cr3",
      "text": "60% of fees spent on services; no case made that collections merged in general revenue.",
      "addresses_issue": "i1",
      "key_observation": "Levy reasonably related to expenditure; High Court finding of fact final."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The amount paid as licence fee is not a tax but a fee which could be properly levied.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Corporation of Calcutta v. Liberty Cinema",
      "citation": "1955 2 S.C.R. 477",
      "treatment": "distinguished",
      "relevance": "No service rendered by corporation; inspection not service to licensee; levy held tax."
    },
    {
      "case_name": "H.H. Sudhundra Thirtha Swamiar v. Commissioner for Hindu Religious Charitable Endowments, Mysore",
      "citation": "1963 Supp. 2 S.C.R. 302",
      "treatment": "followed",
      "relevance": "Levy for specific service with reasonable relation to expenses is fee; no direct relation or voluntariness required."
    },
    {
      "case_name": "Mahant Sri Jagannath Ramanuj Das v. State of Orissa",
      "citation": "1954 S.C.R. 1046",
      "treatment": "followed",
      "relevance": "Contributions for Commissioner supervising religious institutions are fee, not merged in general revenue."
    },
    {
      "case_name": "Ratilal Panachand Gandhi v. State of Bombay",
      "citation": "1954 S.C.R. 1055",
      "treatment": "followed",
      "relevance": "Contributions to special fund for public trusts administration are fee; services beneficial in public interest."
    }
  ],
  "statutes_cited": [
    {
      "name": "Factories Act 1948",
      "sections": [
        "s. 2(m)",
        "s. 9",
        "s. 10",
        "s. 11",
        "s. 12-14",
        "s. 17-20",
        "s. 21-23",
        "s. 27",
        "s. 35-40",
        "s. 49",
        "s. 112",
        "Chapter II",
        "Chapter III",
        "Chapter IV",
        "Chapter V",
        "Chapter X"
      ],
      "relevance": "Provisions for inspecting staff, health, safety, welfare; inspectors provide services via inspections, advice, orders."
    },
    {
      "name": "Delhi Factories Rules 1950",
      "sections": [
        "Rule 5",
        "Rule 7",
        "Schedule",
        "R. 65(3)"
      ],
      "relevance": "Prescribe licence fees based on HP and workers; renewal fees challenged as tax."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 226",
        "Art. 227"
      ],
      "relevance": "Basis for writ petition in High Court."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal against the dismissal of the writ petition challenging the validity of the licence fee under Delhi Factories Rules as a tax is dismissed; the court holds the levy is a fee with quid pro quo via inspector services.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "A levy in the nature of a fee does not cease to be of that character merely because there is an element of compulsion or coerciveness present in it.",
      "speaker": "court",
      "significance": "Clarifies fee need not be voluntary or directly linked to individual service."
    },
    {
      "text": "There can be no manner of doubt that the amount which the appellant company has to pay as licence fee is not in the nature of a tax but is a fee which could be properly levied.",
      "speaker": "court",
      "significance": "Final holding on nature of the levy."
    }
  ],
  "_case_id": "1969_94",
  "_label": 0,
  "_text_length": 15382,
  "_extracted_at": "2026-02-10T20:26:00.675003"
}