{
  "metadata": {
    "case_name": "State of West Bengal v. Jugal Kishore More",
    "case_year": 1968,
    "court": "Supreme Court of India",
    "judges": [
      "Shah J."
    ],
    "case_number": "Criminal Appeal No. 14 of 1968",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "In the course of investigation of offences under ss. 420, 467, 471 and 120B I.P. Code the Officer in charge submitted an application before the Chief Presidency Magistrate, Calcutta, for a warrant for arrest of Jugal Kishore More and others and forwarding to Ministry of External Affairs for extradition as More was believed to be in Hong Kong.",
      "type": "procedural",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f2",
      "text": "It was stated that More and others were parties to a criminal conspiracy in Calcutta between May 1961 and December 1962 to defraud Government of India in respect of India's foreign exchange.",
      "type": "material",
      "date": "1961-05 to 1962-12",
      "source": "prosecution"
    },
    {
      "id": "f3",
      "text": "Chief Presidency Magistrate held enquiry and on July 19, 1965 ordered that prima facie case made out of criminal conspiracy hatched in Calcutta, directed bailable warrant in Form II Sch. V CrPC for arrest of More, sent to Secretary Home Political Department, Government of West Bengal.",
      "type": "procedural",
      "date": "1965-07-19",
      "source": "lower_court"
    },
    {
      "id": "f4",
      "text": "Copy of warrant sent to Commissioner of Police, Calcutta. More described as Manager, Premko Traders of 7, Wyndham Street and 28, Kings Road, Hong Kong.",
      "type": "procedural",
      "date": "1965-07-19",
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "Warrant forwarded by West Bengal Govt to Ministry of External Affairs, then to High Commissioner for India, Hong Kong, who requested Colonial Secretary, Hong Kong for extradition under Fugitive Offenders Act, 1881.",
      "type": "procedural",
      "date": null,
      "source": "government"
    },
    {
      "id": "f6",
      "text": "Central Magistrate, Hong Kong endorsed warrant under s.13 Part II and s.26 Part IV Fugitive Offenders Act 1881, directed Hong Kong Police to arrest More. Satisfied warrant issued by lawful authority.",
      "type": "procedural",
      "date": null,
      "source": "hong_kong_court"
    },
    {
      "id": "f7",
      "text": "More arrested on November 24, 1965 in Hong Kong.",
      "type": "procedural",
      "date": "1965-11-24",
      "source": "hong_kong_police"
    },
    {
      "id": "f8",
      "text": "On April 4, 1966, Central Magistrate Hong Kong overruled objection that no jurisdiction under Fugitive Offenders Act 1881 since India no longer British Possession.",
      "type": "procedural",
      "date": "1966-04-04",
      "source": "hong_kong_court"
    },
    {
      "id": "f9",
      "text": "On May 16, 1966, Hanuman Prasad (father of More) filed petition in Calcutta High Court under s.439 CrPC and Art.227 Constitution to quash warrant and restrain extradition.",
      "type": "procedural",
      "date": "1966-05-16",
      "source": "respondent"
    },
    {
      "id": "f10",
      "text": "Division Bench: A. Roy J. held warrant not illegal, procedure not irregular. Gupta J. held without jurisdiction, no notified order under s.3 Extradition Act 1962.",
      "type": "procedural",
      "date": null,
      "source": "high_court"
    },
    {
      "id": "f11",
      "text": "R. Mukherji J. held Magistrate had no power to issue warrant in that manner, Fugitive Offenders Act 1881 ceased on Constitution, procedure per 1955 letter ignored, no basis under Extradition Act 1962, quashed warrant and proceedings dated April 20, 1967.",
      "type": "procedural",
      "date": "1967-04-20",
      "source": "high_court"
    },
    {
      "id": "f12",
      "text": "State of West Bengal appealed to Supreme Court by special leave.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the Chief Presidency Magistrate had power to issue warrant for arrest of More for extradition from Hong Kong and whether the procedure followed was legal, given India's status as Republic and applicability of Fugitive Offenders Act 1881 and Extradition Act 1962.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the notification of May 21, 1955 by Ministry of External Affairs prescribing procedure for securing fugitive offenders from Commonwealth countries was valid and binding on courts.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether absence of notification under s.3 Extradition Act 1962 including Hong Kong barred the requisition for surrender.",
      "framed_by": "respondent"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Chief Presidency Magistrate issued warrant validly on prima facie case. Procedure followed per Government of India notification dated May 21, 1955 after Supreme Court ruling in Menon case. Requisition is executive function, courts provide prima facie proof.",
      "supporting_facts": [
        "f1",
        "f3",
        "f12"
      ],
      "legal_basis": "Code of Criminal Procedure 1898 Sch V Form II; Notification No. K/52/6131/41 dated 21st May 1955; State of Madras v. C.G. Menon"
    },
    {
      "id": "pa2",
      "text": "Extradition is political act by State; courts cannot question Hong Kong authorities' actions under their municipal law. Warrant has no extra-territorial operation but assists diplomatic requisition.",
      "supporting_facts": [
        "f5",
        "f6",
        "f7"
      ],
      "legal_basis": "Fugitive Offenders Act 1881 (as applied in Hong Kong)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Warrant issued without jurisdiction as Fugitive Offenders Act 1881 ceased post-Constitution; no notified order under s.3 Extradition Act 1962 for Hong Kong; procedure per 1955 notification illegal invasion of judicial authority.",
      "supporting_facts": [
        "f3",
        "f11"
      ],
      "legal_basis": "Extradition Act 1962 s.3; State of Madras v. C.G. Menon; Fugitive Offenders Act 1881 inapplicable post-1950"
    },
    {
      "id": "ra2",
      "text": "Hong Kong Central Magistrate had no authority to endorse Indian warrant as India not British possession; requisition political act beyond judicial scrutiny but inconsistent with law.",
      "supporting_facts": [
        "f6",
        "f8"
      ],
      "legal_basis": "Fugitive Offenders Act 1881"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Extradition is surrender by one State to another, political act pursuant to treaty or arrangement, governed by municipal law. Courts in requisitioning State provide prima facie proof; other State decides surrender after enquiry.",
      "addresses_issue": "i1",
      "key_observation": "Requisition for surrender is function of State, not courts; warrant aids but has no extra-territorial operation."
    },
    {
      "id": "cr2",
      "text": "Fugitive Offenders Act 1881 inapplicable in India post-Republic per Menon case, but 1955 notification devised interim procedure using CrPC warrants forwarded via diplomatic channels, which Commonwealth countries honour.",
      "addresses_issue": "i2",
      "key_observation": "Notification advisory, not imposing executive will on courts; Chief Presidency Magistrate acted within power."
    },
    {
      "id": "cr3",
      "text": "Absence of s.3 notification under 1962 Act does not bar diplomatic persuasion for surrender; Hong Kong acted validly under own law.",
      "addresses_issue": "i3",
      "key_observation": "India's courts cannot judge foreign municipal law actions."
    },
    {
      "id": "cr4",
      "text": "Principle from Savarkar case: once offender in India, irregularity in bringing cannot affect trial jurisdiction.",
      "addresses_issue": "i1",
      "key_observation": "Invalidity of warrant does not prevent trial if brought lawfully."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Chief Presidency Magistrate competent to issue warrant on prima facie case; procedure per 1955 notification valid; no illegality in forwarding warrant for diplomatic requisition.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Extradition Act 1962 does not prohibit diplomatic channels for surrender absent notification.",
      "resolves_issue": "i3",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "State of Madras v. C.G. Menon",
      "citation": "1955 1 S.C.R. 280",
      "treatment": "followed",
      "relevance": "Fugitive Offenders Act 1881 inapplicable in India post-Republic for surrender to British possessions."
    },
    {
      "case_name": "Emperor v. Vinayak Damodar Savarkar",
      "citation": "I.L.R. 35 Bom. 225",
      "treatment": "followed",
      "relevance": "Irregularity in bringing accused from foreign territory does not affect jurisdiction to try once in country."
    },
    {
      "case_name": "Re. Government of India and Mubarak Ali Ahmed",
      "citation": "1952 1 All E.R. 1060",
      "treatment": "referred",
      "relevance": "Fugitive Offenders Act 1881 continued via India Consequential Provision Act 1949; offender surrendered to India."
    },
    {
      "case_name": "Mobarik Ali Ahmed v. State of Bombay",
      "citation": "1958 S.C.R. 328",
      "treatment": "referred",
      "relevance": "Offender tried and convicted in India after surrender under Fugitive Offenders Act."
    },
    {
      "case_name": "Re. Kwesi Armah",
      "citation": "1966 2 All E.R. 1006",
      "treatment": "referred",
      "relevance": "Act applied to Republic of Ghana."
    },
    {
      "case_name": "Armah v. Government of Ghana",
      "citation": "1966 3 All E.R. 177",
      "treatment": "referred",
      "relevance": "House of Lords upheld extradition from UK to Ghana Republic."
    },
    {
      "case_name": "Zacharia v. Republic of Cyprus",
      "citation": "1962 2 All E.R. 438",
      "treatment": "referred",
      "relevance": "Extradition to Cyprus Republic under Fugitive Offenders Act."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "420",
        "467",
        "471",
        "120B"
      ],
      "relevance": "Offences under investigation: cheating, forgery, using forged document, conspiracy to defraud foreign exchange."
    },
    {
      "name": "Code of Criminal Procedure, 1898",
      "sections": [
        "439",
        "82"
      ],
      "relevance": "Petition to quash; warrants executable anywhere in India; Form II Sch V used."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "227",
        "14",
        "372"
      ],
      "relevance": "High Court supervisory jurisdiction; equal protection; continuance of laws."
    },
    {
      "name": "Extradition Act, 1962",
      "sections": [
        "3",
        "12",
        "13",
        "19",
        "2(a)"
      ],
      "relevance": "Consolidates extradition law; applies to notified Commonwealth countries; requisition by Central Govt."
    },
    {
      "name": "Fugitive Offenders Act, 1881 (UK)",
      "sections": [
        "13 Part II",
        "26 Part IV",
        "5",
        "12",
        "14"
      ],
      "relevance": "Basis for Hong Kong endorsement and arrest; backing of warrants between British possessions."
    },
    {
      "name": "Indian Extradition Act, 1903",
      "sections": null,
      "relevance": "Adapted post-1950; for surrender to foreign states and HM Dominions."
    },
    {
      "name": "India Consequential Provision Act, 1949 (UK)",
      "sections": [
        "1"
      ],
      "relevance": "Continued existing laws post-India becoming Republic."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; judgment and order of Calcutta High Court quashing the warrant of arrest dated July 30, 1965 issued by Chief Presidency Magistrate and all subsequent proceedings set aside. Procedure held valid.",
    "relief_granted": "Restoration of warrant and proceedings for extradition of Jugal Kishore More.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "Extradition is the surrender by one State to another of a person desired to be dealt with for crimes of which he has been accused or convicted and which are justiciable in the courts of the other State.",
      "speaker": "court",
      "significance": "Defines extradition and its political nature."
    },
    {
      "text": "The notification issued was only in the nature of advice about the procedure to be followed and did not in any manner seek to impose any executive will upon the Courts in matters judicial.",
      "speaker": "court",
      "significance": "Upholds validity of 1955 notification."
    },
    {
      "text": "Where a man is in the country and is charged before a Magistrate with an offence under the Penal Code it will not avail him to say that he was brought there illegally from a foreign country.",
      "speaker": "court",
      "significance": "From Savarkar case; limits challenges to mode of bringing accused."
    }
  ],
  "_case_id": "1969_156",
  "_label": 1,
  "_text_length": 49197,
  "_extracted_at": "2026-02-10T20:26:17.670575"
}