{
  "metadata": {
    "case_name": "Hem Chandra Naskar and Yogendra Nath Naskar (shebaits of Sri Iswar Kubereswar Mahadeb Thakur and Sri Sri Anandamoyee Kalimata) v. Commissioner of Income Tax",
    "case_year": 1968,
    "court": "Supreme Court of India",
    "judges": [
      "Ramaswami, J."
    ],
    "case_number": "Civil Appeals Nos. 690 to 694 of 1968",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "One Ram Kristo Naskar left a will dated 17th May, 1899 by which he left certain properties as debuttar to two deities Sri Iswar Kubereswar Mahadeb Thakur and Sri Sri Anandamoyee Kalimata in the land adjoining his residential house at 74/75 Beliaghata Main Road.",
      "type": "background",
      "date": "1899-05-17",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "He appointed his two adopted sons Hem Chandra Naskar (since deceased) and Yogendra Nath Naskar as the shebaits.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Elaborate provision was made as to the manner in which the income from the property was to be spent.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "For a long time the income from the property was assessed in the hands of the shebaits as trustees.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "In respect of the assessment years 1950-51 and 1951-52, the two shebaits contended that there was no trust executed in the case and as such the income from the property did not attract liability to tax and particularly the assessments made in the name of Hem Chandra Naskar and his brother Yogendra Nath Naskar as trustees of the debuttar estate could not be sustained.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "The Appellate Assistant Commissioner accepted this contention on appeal and set aside the assessments.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Finding that the assessments have been set aside on the footing that the status of the assessees had not been correctly determined the Income Tax Officer initiated proceedings for the assessment years 1952-53 and 1953-54 against Hem Chandra Naskar and Yogendra Nath Naskar, the shebaits of the two deities and completed the assessments on the deities in the status of an individual and through the shebaits.",
      "type": "procedural",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f8",
      "text": "The claim for exemption under the proviso to section 4(3)(i) of the Income Tax Act was rejected.",
      "type": "procedural",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f9",
      "text": "On appeal the Appellate Assistant Commissioner upheld the assessment orders of the Income Tax Officer.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "The assessee appealed to the Appellate Tribunal and contended that the deities were not chargeable to tax under s. 3 of the Act that section 41 of the Act did not apply to the facts of the case.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f11",
      "text": "Though the shebaits were the managers who could come under the ambit of section 41, they had not been appointed by or under any order of the court and therefore the assessments were invalid and should be set aside.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f12",
      "text": "It was also contended that the case of the trustee having been specifically given up it would not be open to the Income Tax Department to bring the shebaits under any of the categories mentioned in section 41.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f13",
      "text": "The departmental representative contended that the assessments had been made on the shebaits not under section 41 as trustees or managers but that the deities had been assessed as individuals and that section 41 was a surplusage in making the assessments.",
      "type": "admitted",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f14",
      "text": "The Tribunal held that though the shebaits were the managers for the purpose of section 41, they were not so appointed by or under any order of the court, and, therefore, the second condition required by section 41 was not fulfilled, and the shebaits could not be proceeded against.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f15",
      "text": "The Appellate Tribunal added that the specific provision which the Tribunal first relied was that of trustees under section 41, but that case having been given up the further attempt to assess the shebaits as managers under section 41 could not be upheld.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f16",
      "text": "At the instance of the Commissioner of Income Tax, the Appellate Tribunal referred the following question of law for the opinion of the High Court under section 66(1) of the Act: Whether on the facts and in the circumstances of the case, the assessment on the deities through the shebaits under the provisions of section 41 of the Indian Income Tax Act were in accordance with law?",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f17",
      "text": "Judgment and order dated April 3, 4, 5, 1965 of the Calcutta High Court in Income-tax Reference No. 50 of 1961.",
      "type": "procedural",
      "date": "1965-04-05",
      "source": "lower_court"
    },
    {
      "id": "f18",
      "text": "These appeals are brought from the judgment of the Calcutta High Court dated 3rd, 4th and 5th April, 1965 on a certificate granted under section 66A of the Indian Income Tax Act, 1922.",
      "type": "procedural",
      "date": "1965-04-05",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether on the facts and in the circumstances of the case, the assessments on the deities through the shebaits were in accordance with law.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether a Hindu deity can be treated as a unit of assessment under section 3 and 4 of the Income Tax Act, 1922.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "There was no trust executed in the case and as such the income from the property did not attract liability to tax; assessments as trustees could not be sustained.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "The deities were not chargeable to tax under s. 3 of the Act; section 41 of the Act did not apply as shebaits had not been appointed by or under any order of the court.",
      "supporting_facts": [
        "f10",
        "f11"
      ],
      "legal_basis": "Section 3, Section 41 of Income Tax Act, 1922"
    },
    {
      "id": "pa3",
      "text": "The case of the trustee having been specifically given up it would not be open to the Income Tax Department to bring the shebaits under any of the categories mentioned in section 41.",
      "supporting_facts": [
        "f12"
      ],
      "legal_basis": "Section 41 of Income Tax Act, 1922"
    },
    {
      "id": "pa4",
      "text": "The word 'individual' in s. 3 of the Act should not be construed as including a Hindu deity because it was not a real but a juristic person.",
      "supporting_facts": [],
      "legal_basis": "Section 3 of Income Tax Act, 1922; Section 2(31) of Income Tax Act, 1961"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The assessments had been made on the shebaits not under section 41 as trustees or managers but that the deities had been assessed as individuals and that section 41 was a surplusage in making the assessments.",
      "supporting_facts": [
        "f13"
      ],
      "legal_basis": "Section 3 of Income Tax Act, 1922"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The question referred should be modified by deleting 'under the provisions of section 41' as superfluous to bring out the real controversy: whether assessments on deities through shebaits were in accordance with law.",
      "addresses_issue": "i1",
      "key_observation": "Section 41 not central; focus on whether deity assessable."
    },
    {
      "id": "cr2",
      "text": "A Hindu idol is a juristic person in whom the dedicated property vests; it is a juridical entity capable of holding property.",
      "addresses_issue": "i2",
      "key_observation": "Idol as juristic person per authorities like Dakor temple case, Vidyapurna, Pramatha Nath Mullick."
    },
    {
      "id": "cr3",
      "text": "The juristic person in the idol is not the material image but represents the spiritual purpose of the donor; dedicated property vests in it.",
      "addresses_issue": "i2",
      "key_observation": "Gods own property only figuratively; idol embodies pious purpose."
    },
    {
      "id": "cr4",
      "text": "Shebaits are human guardians entrusted with possession and management, analogous to managers of infant heir.",
      "addresses_issue": "i2",
      "key_observation": "Idol needs shebaits for management."
    },
    {
      "id": "cr5",
      "text": "There is no principle why a deity as legal person should not be taxed if allowed to own property, sue, etc.",
      "addresses_issue": "i2",
      "key_observation": "Hindu idol capable of holding property and being taxed through shebaits."
    },
    {
      "id": "cr6",
      "text": "Word 'individual' in s.3 includes juristic entities, not restricted to human beings; supported by Sodra Devi and 1961 Act as exposition.",
      "addresses_issue": "i2",
      "key_observation": "'Individual' wide enough for groups, corporations, deities."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Hindu idol is a juristic entity capable of holding property and of being taxed through its shebaits.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Hindu deity falls within the meaning of the word 'individual' under section 3 of the Act and can be treated as a unit of assessment.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Assessments on the deities through the shebaits were in accordance with law.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Manohar Ganesh v. Lakshmiram (Dakor temple case)",
      "citation": "I.L.R. 12 Bom. 247",
      "treatment": "followed",
      "relevance": "Hindu idol is juridical person; no trust required for dedication."
    },
    {
      "case_name": "Vidyapurna Tirtha Swami v. Vidyanidhi Tirtha Swami Ors.",
      "citation": "I.L.R. 27 Mad. 435",
      "treatment": "followed",
      "relevance": "Consecrated idol in Hindu temple is juridical person."
    },
    {
      "case_name": "Maharanee Shibessouree Dehia v. Mothooranath Acharjo",
      "citation": "13 M.I.A. 270",
      "treatment": "referred",
      "relevance": "Judicial Committee decisions on idol's legal personality."
    },
    {
      "case_name": "Prosanna Kumari Debya v. Golab Chand Baboo",
      "citation": "L.R. 2 I.A. 145",
      "treatment": "followed",
      "relevance": "Property belongs to idol in ideal sense; managed by shebait."
    },
    {
      "case_name": "Pramatha Nath Mullick v. Pradyumna Kumar Mullick Ors.",
      "citation": "52 I.A. 245",
      "treatment": "followed",
      "relevance": "Hindu idol is juristic entity with power to sue/be sued; shebait as manager."
    },
    {
      "case_name": "Commissioner of Income Tax, Madhya Pradesh Bhopal v. Sodra Devi",
      "citation": "1958 S.C.R. 1",
      "treatment": "followed",
      "relevance": "'Individual' includes group of persons or juristic entities like corporations."
    },
    {
      "case_name": "Bhupati Ramlal",
      "citation": "10 C.L.J. 355",
      "treatment": "referred",
      "relevance": "Dedication to deity is material embodiment of pious purpose."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income Tax Act, 1922",
      "sections": [
        "Section 3",
        "Section 4(3)(i)",
        "Section 41",
        "Section 66(1)",
        "Section 66A"
      ],
      "relevance": "Deity assessable as 'individual' under s.3; assessments through shebaits valid; reference and certificate provisions."
    },
    {
      "name": "Income Tax Act, 1961",
      "sections": [
        "Section 2(31)"
      ],
      "relevance": "Parliamentary exposition clarifying 'person' includes artificial juridical persons; supports broad meaning of 'individual' in 1922 Act."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court held that a Hindu deity is a juristic entity and 'individual' under Section 3 of the 1922 Act, capable of being assessed to tax through its shebaits. The assessments for 1952-53 and 1953-54 were valid, dismissing the appeals against the High Court's judgment.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "Our conclusion is that the Hindu idol is a juristic entity capable of holding property and of being taxed through its shebaits who are entrusted with the possession and management of its property.",
      "speaker": "court",
      "significance": "Core holding on taxability of deities."
    },
    {
      "text": "We are accordingly of opinion that a Hindu deity falls within the meaning of the word individual under section 3 of the Act and can be treated as a unit of assessment under that section.",
      "speaker": "court",
      "significance": "Interprets 'individual' to include juristic persons like deities."
    },
    {
      "text": "A Hindu idol is, according to long established authority... a juristic entity. It has a juridical status with the power of suing and being sued.",
      "speaker": "court",
      "significance": "Quotes Pramatha Nath Mullick affirming idol's legal personality."
    }
  ],
  "_case_id": "1969_17",
  "_label": 0,
  "_text_length": 19993,
  "_extracted_at": "2026-02-10T20:24:49.331238"
}