{
  "metadata": {
    "case_name": "Union of India v. Respondent (Sub-Inspector of Police)",
    "case_year": 1965,
    "court": "Supreme Court of India",
    "judges": [
      "Mitter, J."
    ],
    "case_number": "Civil Appeal No. 1111 of 1965",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Respondent appointed as Sub-Inspector of Police by Inspector-General of Police in Sind before partition of India.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Respondent posted in Delhi by Deputy Inspector-General of Police Delhi after migration to India.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "In 1949, respondent posted as Sub-Inspector of Police in Police Station Daryaganj, Delhi.",
      "type": "background",
      "date": "1949",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Departmental enquiry launched against respondent in 1949 on charge of acceptance of bribe in connection with a criminal case.",
      "type": "material",
      "date": "1949",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Diwanchand Dhatia employed as Deputy Superintendent of Police in City of Delhi until April 1949, retired that month, re-employed from date of retirement as Deputy Superintendent of Police, Enforcement Department.",
      "type": "background",
      "date": "1949-04",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Enquiry against respondent conducted by Diwanchand Dhatia after his retirement but during re-employment period.",
      "type": "procedural",
      "date": "1949",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Respondent found guilty of the charge.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Respondent dismissed from service by order dated December 8, 1949 passed by Jagannath, Superintendent of Police in Delhi Police Force.",
      "type": "material",
      "date": "1949-12-08",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Respondent filed suit challenging dismissal on January 12, 1954 in court of Subordinate Judge Delhi.",
      "type": "procedural",
      "date": "1954-01-12",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Union of India filed written statement disputing contentions.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Subordinate Judge framed issues on competency of Jagannath to pass dismissal order and Diwanchand Bhatia to conduct enquiry, decreed suit in favour of plaintiff.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Decree upheld in appeal by Additional District Judge, Delhi.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Decree upheld in Second Appeal by single Judge of Punjab High Court, who modified salary figure but upheld main issues.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "Letters Patent Appeal No. 36-D of 1963 summarily dismissed by Punjab High Court Circuit Bench at Delhi on April 11, 1963.",
      "type": "procedural",
      "date": "1963-04-11",
      "source": "lower_court"
    },
    {
      "id": "f15",
      "text": "Ex. D-5: Certificate that Diwanchand Bhatia received charge as Officiating Deputy Superintendent of Police, Enforcement, Delhi on forenoon of 28th April 1949.",
      "type": "admitted",
      "date": "1949-04-28",
      "source": "respondent"
    },
    {
      "id": "f16",
      "text": "Ex. D-4: Order of Inspector-General of Police, Delhi dated June 6, 1949 posting Diwanchand Bhatia to city vice Malik Bodh Raj, DSP Enforcement.",
      "type": "admitted",
      "date": "1949-06-06",
      "source": "respondent"
    },
    {
      "id": "f17",
      "text": "Diwanchand Bhatia testified he took charge as per documents and conducted enquiry.",
      "type": "admitted",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f18",
      "text": "Diwanchand Bhatia received application from Jagannath SP for enquiry, conducted preliminary enquiry, found prima facie case, sent to District Magistrate who approved departmental enquiry.",
      "type": "disputed",
      "date": "1949",
      "source": "prosecution"
    },
    {
      "id": "f19",
      "text": "File relating to departmental enquiry destroyed under Police Rule 12.35 by order of Abdul Rehman on 15th January 1953, per Ex. D-2.",
      "type": "admitted",
      "date": "1953-01-15",
      "source": "court"
    },
    {
      "id": "f20",
      "text": "Jagannath was Superintendent of Police, City, with charge over police stations including Faiz Bazar where respondent posted.",
      "type": "admitted",
      "date": "1950",
      "source": "court"
    },
    {
      "id": "f21",
      "text": "Delhi area including New Delhi, Old Delhi, rural areas under one District Magistrate; police under Inspector-General with two Superintendents: one for Delhi City, one for New Delhi.",
      "type": "background",
      "date": "1950",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the dismissal was illegal because the officer entrusted with departmental enquiry (Diwanchand Dhatia) was not a police officer.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the order of dismissal passed by Shri Jagannath was invalid because he was not a District Superintendent of Police.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether the dismissal was void on account of non-compliance with Rule 16.38 of the Punjab Police Rules.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Jagannath, functioning as Superintendent of Police (not designated District SP), was competent to pass dismissal order under Police Act and Punjab Police Rules.",
      "supporting_facts": [
        "f20",
        "f21"
      ],
      "legal_basis": "Police Act 1861 ss. 1, 2, 3, 4, 7; Punjab Police Rules 1934 rr. 11, 12, 13, 14, 16.1"
    },
    {
      "id": "pa2",
      "text": "Diwanchand Bhatia was a police officer (Deputy SP Enforcement) superior to Sub-Inspector, competent to conduct enquiry.",
      "supporting_facts": [
        "f5",
        "f6",
        "f15",
        "f16",
        "f17"
      ],
      "legal_basis": "Punjab Police Rules 1934 r. 16.24(1)"
    },
    {
      "id": "pa3",
      "text": "Rule 16.38 complied with: preliminary enquiry done, prima facie case sent to District Magistrate who approved departmental enquiry.",
      "supporting_facts": [
        "f18"
      ],
      "legal_basis": "Punjab Police Rules 1934 r. 16.38"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Diwanchand Bhatia not a police officer as he had retired and was re-employed only in Enforcement Department.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Jagannath not competent as he was not designated District Superintendent of Police.",
      "supporting_facts": [
        "f8",
        "f20"
      ],
      "legal_basis": "Police Act 1861 s. 7"
    },
    {
      "id": "ra3",
      "text": "No compliance with Rule 16.38: no evidence of informing District Magistrate or his decision for departmental enquiry; strict compliance mandatory.",
      "supporting_facts": [
        "f19"
      ],
      "legal_basis": "Punjab Police Rules 1934 r. 16.38; State of UP v. Babu Ram; Delhi Admin v. Chanan Shah"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "No difference between 'Superintendent of Police' in Rules and 'District Superintendent of Police' in Act; Jagannath as SP City competent over relevant police station.",
      "addresses_issue": "i2",
      "key_observation": "Police force expanded post-1861; multiple SPs possible per district; Act and Rules read together."
    },
    {
      "id": "cr2",
      "text": "Diwanchand Bhatia was Deputy SP Enforcement (police department), superior to Sub-Inspector, hence police officer competent to enquire.",
      "addresses_issue": "i1",
      "key_observation": "Enforcement merely specifies department; re-employment as DSP confirmed by documents and testimony."
    },
    {
      "id": "cr3",
      "text": "Testimony of Diwanchand Bhatia accepted: preliminary steps under R.16.38 followed, DM approved; no issue framed below, file destroyed lawfully.",
      "addresses_issue": "i3",
      "key_observation": "Substantial compliance even if directory; no reason to disbelieve witness."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Superintendent of Police equivalent to District Superintendent of Police for dismissal powers.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Re-employed DSP Enforcement is a police officer competent to conduct enquiry against Sub-Inspector.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h3",
      "text": "Compliance with Rule 16.38 established by evidence.",
      "resolves_issue": "i3",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "State of Uttar Pradesh and others v. Babu Ram",
      "citation": "1961 2 S.C.R. 679",
      "treatment": "referred",
      "relevance": "Police Act and Rules constitute self-contained code; strict compliance for dismissal."
    },
    {
      "case_name": "Delhi Administration v. Chanan Shah",
      "citation": "1969 3 S.C.R. 653",
      "treatment": "referred",
      "relevance": "No departure from rules; even if directory, substantial compliance needed for Rule 16.38."
    }
  ],
  "statutes_cited": [
    {
      "name": "Police Act, 1861",
      "sections": [
        "s. 1",
        "s. 2",
        "s. 3",
        "s. 4",
        "s. 7"
      ],
      "relevance": "Vesting of police administration; appointment, dismissal powers of District Superintendents."
    },
    {
      "name": "Punjab Police Rules, 1934",
      "sections": [
        "r. 11",
        "r. 12",
        "r. 13",
        "r. 14",
        "r. 16",
        "r. 16.1",
        "r. 16.24",
        "r. 16.38",
        "r. 12.35"
      ],
      "relevance": "Police districts, command structure, punishments, enquiry procedure, destruction of records."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 311"
      ],
      "relevance": "Subject to provisions for dismissal of inferior officers."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; judgments and orders of courts below set aside; suit filed by respondent dismissed.",
    "relief_granted": "Dismissal of suit upholding validity of respondent's dismissal from service.",
    "costs": "No order as to costs of this appeal; previous order for costs not disturbed (special leave granted on condition appellant pays respondent's costs)."
  },
  "key_quotes": [
    {
      "text": "\"In our opinion, there is no difference between 'Superintendent of Police' in the Rules and 'District Superintendent of Police' in the Act.\"",
      "speaker": "court",
      "significance": "Resolves competency of Jagannath to dismiss."
    },
    {
      "text": "\"We see no force in this contention as the Enforcement Department was still a police department and a Deputy Superintendent of Police Enforcement was still a Deputy Superintendent of Police.\"",
      "speaker": "court",
      "significance": "Confirms Diwanchand Bhatia as police officer."
    },
    {
      "text": "\"We see no reason to disbelieve the testimony of Diwanchand Bhatia.\"",
      "speaker": "court",
      "significance": "Accepts compliance with Rule 16.38."
    }
  ],
  "_case_id": "1969_61",
  "_label": 1,
  "_text_length": 19381,
  "_extracted_at": "2026-02-10T20:25:21.219114"
}