{
  "metadata": {
    "case_name": "Swatantra Party Candidate (Appellant) v. Elector (Respondent No. 1)",
    "case_year": 1968,
    "court": "Supreme Court of India",
    "judges": [
      "BacHawAT, J.",
      "Sikri, J.",
      "Hegde, J."
    ],
    "case_number": "Civil Appeal No. 1438 of 1968",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "At the last general election to the Lok Sabha from the Banaskantha Parliamentary constituency in Gujarat there were three contesting candidates. The appellant, the Swatantra party candidate, secured 110,028 votes. Respondent No. 2, the Congress party candidate secured 1,05,621 votes. Respondent No. 3, an independent candidate secured 14,265 votes. The appellant was declared elected.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The election petition was filed by respondent No. 1, an elector in the constituency on April 10, 1967 alleging a number of corrupt practices on the part of the appellant or his election agents, but at the trial, he pressed only the charge of corrupt practice under s. 123(2) proviso (a)(ii) of the Representation of the People Act, 1951.",
      "type": "procedural",
      "date": "1967-04-10",
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "In the petition the charge was that several persons with the consent of the appellant or his election agents induced or attempted to induce the electors to believe that if they voted for the Congress party candidate they would become the objects of divine displeasure and spiritual censure. In the particulars of this charge it was alleged that in the public meetings held at Amirgadh, Ikbalgadh, Wav, Laxmipura, Tharad Bhabhar and other places one Shambhu Maharaj told the electors that if they voted for the Congress candidate they would commit the sin of cow slaughter and urged them in the name of mother cow to take a vow not to vote for the Congress candidate with the result that several members of the audience publicly took the vow.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "The appellant filed his written statement on June 1, 1967.",
      "type": "procedural",
      "date": "1967-06-01",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "On September 9, 1967, the High Court gave leave to respondent No. 1 to amend the petition, by adding the charge that certain persons were threatened that they would commit the sins of go hatya, Brahma-hatya and Sadhuhatya, if they worked for the Congress candidate. The order disallowed amendments seeking to introduce charges of appeal to voters in the name of religion under S. 123(3).",
      "type": "procedural",
      "date": "1967-09-09",
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "The appellant filed his additional written statement on October 19, 1967.",
      "type": "procedural",
      "date": "1967-10-19",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Issues were framed on November 30, 1967.",
      "type": "procedural",
      "date": "1967-11-30",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Respondent No. 1 filed his list of witnesses on January 11, 1968.",
      "type": "procedural",
      "date": "1968-01-11",
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "The trial started on February 21, 1968 and P.W. 1, P.W. 2, P.W. 3 and P.W. 4 were examined. P.W. 4, Ram Swarup was a witness with regard to the meeting at Amirgadh.",
      "type": "procedural",
      "date": "1968-02-21",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "The issues were amended on March 1, 1968 so as to make it clear that there was no charge of any corrupt practice under S. 123(3).",
      "type": "procedural",
      "date": "1968-03-01",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "On March 2, 1968, P.W. 6, P.W. 7, P.W. 8 and P.W. 9 were examined. P.W. 7 and P.W. 8 spoke about the meetings at Palanpur and Bhabhar. P.W. 9 Bhogilal spoke about the meeting at Ikbalgadh.",
      "type": "procedural",
      "date": "1968-03-02",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "On March 4, 1968, P.W. 10 and P.W. 11 were examined and spoke about the meetings at Wav and Laxmipura. On the same day, P.W. 12 S. P. Pandya, a sub-inspector of police at Palanpur, and P.W. 13, C.B. Barot, a short-hand writer were examined.",
      "type": "procedural",
      "date": "1968-03-04",
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "The examination of Barot was concluded on March 6, 1968. Barot proved that he took shorthand notes of the speeches of Shambhu Maharaj at Ikbalgadh, Amirgadh, Bhabhar, Laxmipura, Wav and Tharad and sent reports of the speeches to S. P. Pandya.",
      "type": "material",
      "date": "1968-03-06",
      "source": "prosecution"
    },
    {
      "id": "f14",
      "text": "On March 5, 1968, respondent No. 1 filed an application for leave to amend the petition by adding portions of the speeches which referred to the command of Shankracharya not to vote for the Congress and the consequences of not obeying the command. The application was allowed on March 7, 1968.",
      "type": "procedural",
      "date": "1968-03-07",
      "source": "lower_court"
    },
    {
      "id": "f15",
      "text": "The trial was then adjourned and started again on April 8, 1968. Between April 8 and April 15, P.W. 17, P.W. 18, D.W. 1 and D.W. 2 were examined. The judgment was delivered on April 22 and 23, 1968.",
      "type": "procedural",
      "date": "1968-04-22",
      "source": "lower_court"
    },
    {
      "id": "f16",
      "text": "The High Court found that the aforesaid practice was committed by Shambhu Maharaj with the consent of one Punambhai, the election agent of the appellant, and declared the appellant's election to be void.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f17",
      "text": "Ikbalgadh speech (Ex. B1) and the Amirgadh speech (Ex. B3) were delivered on February 8, 1967. The Wav speech (Ex. B4) was delivered on February 9, 1967.",
      "type": "material",
      "date": "1967-02-08",
      "source": "court"
    },
    {
      "id": "f18",
      "text": "There was then an acute political controversy with regard to the total ban on cow slaughter. Section 5(1) of the Bombay Animal Preservation Act, 1954 (Bombay Act No. LXXII of 1954) as amended by Gujarat Act No. XVI of 1961, there was a total ban on cow slaughter in Gujarat. But there was no absolute ban on cow slaughter in several other States.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f19",
      "text": "Shambhu Maharaj was a kirtankar of repute and well known and respected for his lectures on Hindu religion. The audience consisted mostly of illiterate and orthodox Hindus of the rural areas, adivasis and rabaris belonging to the scheduled tribes and scheduled castes.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f20",
      "text": "Punambhai was present at the Amirgadh meeting. He addressed the meeting before Shambhu Maharaj spoke. Shambhu Maharaj addressed several other election meetings of the Swatantra party. Punambhai issued a pamphlet calling one of the meetings.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f21",
      "text": "P.W. 10 proved that he was asked by Punambhai to call Shambhu Maharaj for addressing another meeting as the voters were uneducated and had deep belief in religion. Punambhai accompanied Shambhu Maharaj from one place to another. On February 8, 1967 he went with Shambhu Maharaj to the meeting at Ikbalgadh and thereafter went to Amirgadh. On February 9, he went with Shambhu Maharaj to the meeting at Wav.",
      "type": "material",
      "date": "1967-02-08",
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the trial judge should have allowed the amendment on March 7, 1968 adding particulars regarding the command of Jagadguru Shankracharya.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether corrupt practice under s. 123(2) proviso (a)(ii) of the Representation of the People Act, 1951 was committed by Shambhu Maharaj with the consent of the appellant's election agent Punambhai in the speeches at Ikbalgadh, Amirgadh and Wav by inducing electors to believe that voting for Congress would make them objects of divine displeasure or spiritual censure on account of sin of cow slaughter.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The order passed by the High Court on March 7, 1968 allowing the amendment was illegal as it was sought at a late stage of the trial, respondent No.1 was not acting in good faith, had withheld information earlier, and it resulted in manifest injustice.",
      "supporting_facts": [
        "f2",
        "f4",
        "f5",
        "f9",
        "f10",
        "f11",
        "f12",
        "f13",
        "f14"
      ],
      "legal_basis": "Section 83(1)(b), Section 86(5) of Representation of the People Act, 1951"
    },
    {
      "id": "pa2",
      "text": "The speeches do not prove the corrupt practice alleged in the petition as originally framed, particularly no proof that electors were urged to take a vow not to vote for Congress.",
      "supporting_facts": [
        "f3",
        "f17"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Public criticism of the Congress party for not abolishing cow slaughter throughout the country was permissible and legitimate.",
      "supporting_facts": [
        "f18"
      ],
      "legal_basis": "Section 123(2) proviso (a)(ii) of Representation of the People Act, 1951"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Shambhu Maharaj committed corrupt practice at election meetings held at Ikbalgadh where P.W. 9 was present, Amirgadh where P.W. 4 was present and at Wav where one Chotaji Bhattji was present.",
      "supporting_facts": [
        "f3",
        "f9",
        "f11",
        "f12"
      ],
      "legal_basis": "Section 123(2) proviso (a)(ii) of Representation of the People Act, 1951"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The order of the trial judge allowing the amendment was erroneous because it was applied for at a very late stage after commencement of trial, respondent No.1 deliberately refrained from including it earlier despite knowledge, acted in bad faith, and caused manifest injustice to appellant.",
      "addresses_issue": "i1",
      "key_observation": "Leave to amend at late stage should be exceptional; here petitioner could have discovered earlier with diligence."
    },
    {
      "id": "cr2",
      "text": "Even after disallowing amendment, the original charge of corrupt practice under s.123(2) proviso (a)(ii) is proved in the Amirgadh speech (Ex. B3) where electors told voting Congress makes them partners in sin of go-hatya, calculated to interfere with free exercise of electoral right given status of speaker and audience.",
      "addresses_issue": "i2",
      "key_observation": "Dominant theme was sin of cow slaughter leading to divine displeasure; cow venerated, go-hatya cardinal sin."
    },
    {
      "id": "cr3",
      "text": "Shambhu Maharaj spoke at Amirgadh with consent of election agent Punambhai who was present, arranged meetings, accompanied him, did not object.",
      "addresses_issue": "i2",
      "key_observation": "Offending passages integral to theme; Punambhai consenting party."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Order allowing amendment of March 7, 1968 set aside as erroneous.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Corrupt practice under s. 123(2) proviso (a)(ii) committed at Amirgadh meeting on February 8, 1967 with consent of election agent; election void.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Harish Chandra Bajpai v. Triloki Singh",
      "citation": "1957 S.C.R. 371",
      "treatment": "followed",
      "relevance": "Amendments under s.86(5) cannot introduce new corrupt practice; particulars must be given early."
    },
    {
      "case_name": "Evans v. Bartlam",
      "citation": "1937 A.C. 473",
      "treatment": "followed",
      "relevance": "Appellate court must remedy injustice from trial court's erroneous discretion."
    },
    {
      "case_name": "Ram Dial v. San Lal",
      "citation": "1959 Supp. 2 S.C.R. 748",
      "treatment": "followed",
      "relevance": "Corrupt practice if speech calculated to interfere with free exercise of electoral right."
    },
    {
      "case_name": "Narbada Prasad v. Chhagan Lal",
      "citation": "1969 S.C.R. 499",
      "treatment": "followed",
      "relevance": "Telling voters they commit sin of go-hatya by voting certain way induces belief of divine displeasure."
    }
  ],
  "statutes_cited": [
    {
      "name": "Representation of the People Act, 1951",
      "sections": [
        "s. 83(1)(b)",
        "s. 86(5)",
        "s. 116A",
        "s. 116C",
        "s. 123(2) proviso (a)(ii)",
        "s. 123(3)"
      ],
      "relevance": "Governs election petitions, corrupt practices of undue influence by inducing belief of divine displeasure or spiritual censure; amendments to particulars."
    },
    {
      "name": "Bombay Animal Preservation Act, 1954 (as amended by Gujarat Act No. XVI of 1961)",
      "sections": [
        "s. 5(1)"
      ],
      "relevance": "Total ban on cow slaughter in Gujarat, context of political controversy."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal dismissed confirming the High Court's declaration that the appellant's election is void due to corrupt practice under s.123(2) proviso (a)(ii) at Amirgadh meeting, though amendment order set aside.",
    "relief_granted": "Election of appellant declared void",
    "costs": "No order as to costs"
  },
  "key_quotes": [
    {
      "text": "\"the order allowing the amendment has resulted in manifest injustice to the appellant.\"",
      "speaker": "court",
      "significance": "Basis for setting aside amendment order"
    },
    {
      "text": "\"Having regard to the character of the audience, the speech was calculated to interfere with the free exercise of electoral right.\"",
      "speaker": "court",
      "significance": "Finding corrupt practice proved"
    },
    {
      "text": "\"It is quite obvious that to remind the voters that they would be committing the sin of go-hatya would be to remind them that they would be objects of divine displeasure or spiritual censure.\"",
      "speaker": "court",
      "significance": "Explains why go-hatya references constitute undue influence"
    },
    {
      "text": "\"Nothing so bad as those speeches I have come across in election cases.\"",
      "speaker": "court",
      "significance": "Hegde J.'s view on severity of speeches"
    }
  ],
  "_case_id": "1969_157",
  "_label": 0,
  "_text_length": 23191,
  "_extracted_at": "2026-02-10T20:27:09.428689"
}