{
  "metadata": {
    "case_name": "Office bearers of M/s S.K.G. Sugar Ltd., Lauriya v. Respondent No. 1",
    "case_year": 1966,
    "court": "Supreme Court of India",
    "judges": [
      "Hegde J."
    ],
    "case_number": "Criminal Appeal No. 189 of 1966",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellants are office bearers of M/s S.K.G. Sugar, Ltd., Lauriya.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "A complaint has been registered against the appellants under sub-rule 3 of rule 3 of Sugarcane Control Order, 1955 read with s. 7 of the Essential Commodities Act, 1955 on the ground that they have failed to pay to the sellers the price of the sugarcane purchased by them, within the time prescribed.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The said complaint is being investigated.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Appellants unsuccessfully sought intervention of the High Court of Patna under Art. 226 of the Constitution in Cr. W.J.C. No. 11 of 1966.",
      "type": "procedural",
      "date": "1966-07-04",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Appeal brought after obtaining special leave from this Court against the judgment and order dated July 4, 1966 of the Patna High Court.",
      "type": "procedural",
      "date": "1966-07-04",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the investigation which is being carried on against the appellants under sub-rule 3 of rule 3 of Sugarcane Control Order, 1955 read with s. 7 of the Essential Commodities Act, 1955 is in accordance with law.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Sub-rule 3 of rule 3 could not have been validly issued under s. 3 of the Act as s. 3 cannot be used for controlling the payment of the price of food crops; food crops are outside its scope.",
      "supporting_facts": [
        "f1",
        "f2"
      ],
      "legal_basis": "Section 3 of Essential Commodities Act, 1955"
    },
    {
      "id": "pa2",
      "text": "Regulation of the price of sugarcane is expressly dealt with by the Bihar Sugar Factories Control Act, 1937 and therefore cannot be impliedly spelled out from the provisions of the Order and the Act.",
      "supporting_facts": [
        "f2"
      ],
      "legal_basis": "Bihar Sugar Factories Control Act, 1937"
    },
    {
      "id": "pa3",
      "text": "Parliament had no competence to enact any law relating to the control of sugarcane as that subject is within the exclusive legislative jurisdiction of the State, being a part of agriculture.",
      "supporting_facts": [
        "f1",
        "f2"
      ],
      "legal_basis": "Entry 33 of List III of the Constitution"
    },
    {
      "id": "pa4",
      "text": "The impugned order contravenes the fundamental right guaranteed under Art. 19(1).",
      "supporting_facts": [
        "f2"
      ],
      "legal_basis": "Article 19(1) of the Constitution"
    },
    {
      "id": "pa5",
      "text": "In view of s. 11 of the Act, no cognizance could have been taken of the offence alleged.",
      "supporting_facts": [
        "f2",
        "f3"
      ],
      "legal_basis": "Section 11 of Essential Commodities Act, 1955"
    },
    {
      "id": "pa6",
      "text": "The complaint made before the police does not disclose a cognizable offence and as such the police could not have taken up the investigation.",
      "supporting_facts": [
        "f2",
        "f3"
      ],
      "legal_basis": "Section 4(1)(f) and Second Schedule of Cr.P.C."
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Section 2(a)(v) of the Act defines essential commodity to include foodstuffs; clause (b) of s. 2 provides that food-crops include sugarcane. Sections 3(1), 3(2)(b) and (c) empower regulation of production, supply, distribution, and price control of essential commodities including food-crops.",
      "addresses_issue": "i1",
      "key_observation": "Sugarcane comes within the ambit of the Act; Parliament intended to bring under control the cultivation and sale of food-crops."
    },
    {
      "id": "cr2",
      "text": "In Ch. Tika Ramji v. State of U.P., it was held that the Act includes sugarcane within essential commodities and empowers control over its production, supply, distribution, and price.",
      "addresses_issue": "i1",
      "key_observation": "Central Government well within powers to issue Sugarcane Control Order, 1955."
    },
    {
      "id": "cr3",
      "text": "Sub-rule 3 of rule 3 specifically mandates payment within 14 days unless agreement to contrary; this alters pre-Constitution Bihar Act under Art. 372.",
      "addresses_issue": "i1",
      "key_observation": "Specific mandate in sub-rule 3; Bihar Act altered by competent authority."
    },
    {
      "id": "cr4",
      "text": "Entry 33 of List III empowers Parliament to legislate on production, supply and distribution of foodstuffs; Parliament declared control expedient.",
      "addresses_issue": "i1",
      "key_observation": "Parliament competent to enact the Act."
    },
    {
      "id": "cr5",
      "text": "No fundamental right under Art. 19(1) conferred on a buyer not to pay the price of goods purchased or to pay whenever he pleases.",
      "addresses_issue": "i1",
      "key_observation": "No violation of Art. 19(1)."
    },
    {
      "id": "cr6",
      "text": "Question of cognizance under s. 11 premature as no court has taken cognizance yet.",
      "addresses_issue": "i1",
      "key_observation": "Stage of cognizance has still to come."
    },
    {
      "id": "cr7",
      "text": "Offence punishable with three years imprisonment falls within Second Schedule of Cr.P.C., hence cognizable under s. 4(1)(f); police can investigate.",
      "addresses_issue": "i1",
      "key_observation": "Complaint discloses cognizable offence."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The investigation against the appellants under sub-rule 3 of rule 3 of Sugarcane Control Order, 1955 read with s. 7 of Essential Commodities Act, 1955 is in accordance with law.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Ch. Tika Ramji and Ors. etc. v. The State of U.P. and Ors.",
      "citation": "1956 S.C.R. 432",
      "treatment": "followed",
      "relevance": "Held that Essential Commodities Act, 1955 includes sugarcane as essential commodity; empowers Central Government to control production, supply, distribution, and price of sugarcane via Sugarcane Control Order, 1955 under Entry 33 List III."
    }
  ],
  "statutes_cited": [
    {
      "name": "Essential Commodities Act, 1955",
      "sections": [
        "s. 2(a)(v)",
        "s. 2(b)",
        "s. 3(1)",
        "s. 3(2)(b)",
        "s. 3(2)(c)",
        "s. 7",
        "s. 11"
      ],
      "relevance": "Defines essential commodities to include sugarcane as food-crop; empowers issuance of control orders for regulating production, supply, distribution, trade, commerce, and price control; offence under s.7."
    },
    {
      "name": "Sugarcane Control Order, 1955",
      "sections": [
        "rule 3 sub-rule 3"
      ],
      "relevance": "Mandates purchaser to pay price of sugarcane to seller within 14 days unless agreement to contrary."
    },
    {
      "name": "Bihar Sugar Factories Control Act, 1937",
      "sections": [],
      "relevance": "Pre-Constitution Act regulating sugarcane price; altered by subsequent competent authority (Sugarcane Control Order)."
    },
    {
      "name": "Code of Criminal Procedure",
      "sections": [
        "s. 4(1)(f)",
        "Second Schedule"
      ],
      "relevance": "Defines cognizable offence; offence punishable with 3 years imprisonment is cognizable, allowing police investigation."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 19(1)",
        "Art. 226",
        "Art. 372",
        "Entry 33 List III"
      ],
      "relevance": "No fundamental right violated; High Court writ jurisdiction; pre-Constitution laws continue until altered; concurrent legislative power over trade in foodstuffs."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Court dismissed the appeal, holding that all contentions raised by the appellants challenging the validity of the investigation lack merit. The investigation under the specified provisions is lawful.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"From the scheme of cls. (b) and (c) of s. 2 and s. 3 of the Act, it is clear that the Parliament intended to bring under control the cultivation and sale of food-crops.\"",
      "speaker": "court",
      "significance": "Establishes legislative intent to include sugarcane under Essential Commodities Act."
    },
    {
      "text": "\"No fundamental right is conferred on a buyer not to pay the price of the goods purchased by him or to pay the same whenever he pleases.\"",
      "speaker": "court",
      "significance": "Rejects Art. 19(1) challenge."
    }
  ],
  "_case_id": "1969_198",
  "_label": 0,
  "_text_length": 9316,
  "_extracted_at": "2026-02-10T20:26:43.837781"
}