{
  "metadata": {
    "case_name": "Appellant Company v. Commissioner of Agricultural Income-tax, Kerala State",
    "case_year": null,
    "court": "Supreme Court of India",
    "judges": [
      "Shah J."
    ],
    "case_number": null,
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "An amount of Rs. 55,708 received as an instalment of consideration payable under a deed dated February 19, 1962.",
      "type": "material",
      "date": "1962-02-19",
      "source": "petitioner"
    },
    {
      "id": "f2",
      "text": "Appellant company claimed the amount was of the nature of capital and not income, hence not liable to be taxed.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "Appellate Tribunal held that the transaction was one of sale of old trees unfit for tapping; price received for sale of rubber trees not liable to be included in agricultural income as defined in section 2 of the Agricultural Income-tax Act.",
      "type": "admitted",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f4",
      "text": "By the covenants of the agreement, a right to cut and remove the trees and not to subject them to the process of tapping was granted; grant being of trees and not of a right to tap trees, company received no income out of the transaction.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "At the instance of the Commissioner of Agricultural Income-tax, Kerala State, three questions were referred to the High Court of Kerala.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f6",
      "text": "High Court declined to answer question Nos. 1 and 2, and on the third question recorded an answer in the negative.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "With special leave granted by this court, the assessee has appealed to this court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "No finding by the Tribunal that there were any attendant circumstances indicating the agreement did not record the covenant relating to cutting of trees and was intended to camouflage a grant of rights to tap latex from standing rubber trees.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Urged before Tribunal that wording of agreement alone could not be criterion; actual intention was to subject trees to slaughter tapping and remove after tapping.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f10",
      "text": "Counsel for the State invited attention of Tribunal that consideration fixed was consistent with grant of right to tap and not sale of trees.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f11",
      "text": "Tribunal held no extraneous motives could be imported into terms of agreement; agreement was one for sale of rubber trees and sale proceeds a capital receipt.",
      "type": "admitted",
      "date": null,
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "On the facts and in the circumstances of the case, is the Tribunal right in holding that there is nothing in the agreement dated February 19, 1962, to show that it was a composite agreement of lease and sale?",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "On the facts and in the circumstances of the case, is the Tribunal right in holding that the agreement dated February 19, 1962, is an agreement for an outright sale of rubber trees?",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Is the Tribunal right in giving a literal interpretation to the agreement without duly considering the attendant circumstances like the unreasonableness of the time allowed for cutting and removing the trees, the unreasonableness of the amount shown as consideration for the sale of the rubber trees, that the trees are capable of being tapped for two or three years more, etc., and how the parties acted under it?",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The amount received was capital receipt from sale of rubber trees unfit for tapping, not agricultural income; agreement granted right to cut and remove trees, not to tap.",
      "supporting_facts": [
        "f1",
        "f2",
        "f3",
        "f4",
        "f11"
      ],
      "legal_basis": "Section 2 of the Agricultural Income-tax Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Agreement did not represent true intention; attendant circumstances like unreasonableness of time, amount, trees capable of tapping more years indicate it camouflaged grant of right to tap latex.",
      "supporting_facts": [
        "f9",
        "f10"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Frame of the third question answered by High Court open to grave objection; no finding by Tribunal on attendant circumstances; question could only arise out of Tribunal order.",
      "addresses_issue": "i3",
      "key_observation": "Assumption of facts not determined by Tribunal; High Court exercising advisory jurisdiction could only answer questions arising from Tribunal order."
    },
    {
      "id": "cr2",
      "text": "High Court in error assuming facts not found by Tribunal and holding agreement did not represent true bargain.",
      "addresses_issue": "i3",
      "key_observation": "Tribunal held covenants represented genuine bargain; true relationship vendor-purchaser, not lessor-lessee."
    },
    {
      "id": "cr3",
      "text": "High Court observation that Tribunal held revenue not entitled to go behind document incorrect; Tribunal merely held on effect of covenants.",
      "addresses_issue": "i3",
      "key_observation": "Third question did not arise out of Tribunal order; High Court should have declined to answer."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Third question did not arise out of the order of the Tribunal and High Court should have declined to answer it.",
      "resolves_issue": "i3",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Agricultural Income-tax Act",
      "sections": [
        "2"
      ],
      "relevance": "Definition of agricultural income; sale proceeds of rubber trees not included"
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; order passed by High Court set aside; third question did not arise from Tribunal order.",
    "relief_granted": "High Court judgment reversed in favour of assessee",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The Tribunal merely held that the covenants in the agreement represented a genuine bargain between the parties and on the effect of those covenants it had to determine the true relationship, and the true relationship was one of vendor and purchaser and not of lessor lessee.",
      "speaker": "court",
      "significance": "Clarifies Tribunal's actual holding on the agreement"
    },
    {
      "id": "kq2",
      "text": "The question referred to the High Court could only arise out of the order of the Tribunal.",
      "speaker": "court",
      "significance": "Limits High Court's advisory jurisdiction"
    }
  ],
  "_case_id": "1969_59",
  "_label": 1,
  "_text_length": 5557,
  "_extracted_at": "2026-02-10T20:25:15.869166"
}