{
  "metadata": {
    "case_name": "Rampur Distillery & Chemical Co. Ltd. v. Company Law Board",
    "case_year": 1969,
    "court": "Supreme Court of India",
    "judges": [
      "Shah, J."
    ],
    "case_number": "Civil Appeals No. 488 and 489 of 1969",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The Rampur Distillery Company Ltd. (Rampur Company) is a manufacturer of industrial alcohol.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "In 1943 the Rampur Company appointed Govan Brothers its managing agent for 20 years.",
      "type": "background",
      "date": "1943",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "In July 1946 a group of persons referred to as the Dalmia Group assumed control over Govan Brothers. V.H. Dalmia became Managing Director of Govan Brothers.",
      "type": "background",
      "date": "1946-07",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On March 19, 1953, information was lodged by the Registrar of Joint Stock Companies, Delhi, that V.H. Dalmia and others had committed offences of criminal breach of trust.",
      "type": "background",
      "date": "1953-03-19",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "By virtue of s. 330 of the Companies Act, 1956, the managing agency of the Rampur Company was to expire on August 15, 1960, unless re-appointed.",
      "type": "procedural",
      "date": "1960-08-15",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "On December 10, 1959 the Rampur Company reappointed Govan Brothers, Managing Agent for ten years with effect from August 15, 1960, and applied to the Central Government for approval. The Central Government granted extension for five years under s. 326.",
      "type": "procedural",
      "date": "1959-12-10",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "In the report of the Commission headed by Mr. Justice Vivian Bose, the dealings of V.H. Dalmia in relation to the financial affairs of some companies of which he was a director was severely criticized, finding him guilty of grossly improper conduct in 1946-47.",
      "type": "background",
      "date": "1946-1947",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "In May 1964 the police lodged criminal proceedings against V.H. Dalmia and 23 others charging them with criminal conspiracy, criminal breach of trust, forgery and falsification of accounts in respect of Dalmia Jain Airways Ltd. Proceedings still pending.",
      "type": "background",
      "date": "1964-05",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "On September 23, 1964, the Rampur Company passed a resolution appointing Govan Brothers Managing Agent for five years from August 15, 1965, and applied to Central Government for approval.",
      "type": "procedural",
      "date": "1964-09-23",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "The application was referred to the Company Law Board under s. 10E, which extended tenure till March 31, 1967.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Rampur Company applied on August 25, 1966 for extension upto August 1970, rejected by the Board.",
      "type": "procedural",
      "date": "1966-08-25",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "On June 10, 1967, Rampur Company filed petition in Delhi High Court to quash Board's decision and extend term till March 31, 1970.",
      "type": "procedural",
      "date": "1967-06-10",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Single Judge granted petition, holding reasons personal to V.H. Dalmia irrelevant as managing agent is private limited company.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "Division Bench set aside single judge order, remitted for fresh decision, holding acts of directors of corporate managing agent relevant.",
      "type": "procedural",
      "date": "1968-11-04",
      "source": "lower_court"
    },
    {
      "id": "f15",
      "text": "Post-remand, single judge dismissed writ petition.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f16",
      "text": "In Letters Patent Appeal No. 30 of 1968, Division Bench set aside order, directed Board to consider post-1947 acts of V.H. Dalmia.",
      "type": "procedural",
      "date": "1968-11-04",
      "source": "lower_court"
    },
    {
      "id": "f17",
      "text": "Two appeals by special leave: one by Company Law Board, one by Rampur Company.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether in determining if a managing agent is fit and proper under s. 326(2)(b) Companies Act, 1956, the Company Law Board must consider past and present conduct of its directors, or only present fitness.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the satisfaction of the Central Government/Company Law Board under s. 326(2) is subjective and immune from judicial review, or quasi-judicial requiring objective appraisal.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Reasons for failure to extend managing agency entirely personal to V.H. Dalmia irrelevant to affairs of managing agent company or Rampur Company.",
      "supporting_facts": [
        "f13"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Past acts cannot be ignored but Board must consider fitness at date of proposal including subsequent conduct.",
      "supporting_facts": [
        "f16"
      ],
      "legal_basis": "s. 326(2)(b) Companies Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Where managing agent is corporate body, acts and conduct of its directors relevant to determine fitness.",
      "supporting_facts": [
        "f14",
        "f7",
        "f8"
      ],
      "legal_basis": "s. 326(2)(b)"
    },
    {
      "id": "ra2",
      "text": "Satisfaction under s. 326(2)(b) is subjective and decision not challengeable if based on relevant considerations.",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": "s. 326(2)(b); Barium Chemicals"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Section 326 uses present tense but past acts and conduct cannot be ignored; Board must consider all past and present acts, interests of shareholders, creditors, public.",
      "addresses_issue": "i1",
      "key_observation": "Board restricted to 1946-47 Bose Commission findings, ignored subsequent progress and pending criminal case."
    },
    {
      "id": "cr2",
      "text": "Power under s. 326 is quasi-judicial: requires objective appraisal, consider relevant/ignore irrelevant matters, act judicially per natural justice.",
      "addresses_issue": "i2",
      "key_observation": "Satisfaction not purely subjective; reviewable if misapprehends conditions, irrelevant materials, ignores relevant."
    },
    {
      "id": "cr3",
      "text": "High Court right in directing Board to consider entire conduct past and present of directors.",
      "addresses_issue": "i1",
      "key_observation": "High Court not court of appeal but checks if Board considered relevant circumstances."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "In considering fitness under s. 326(2)(b), Board must review all relevant circumstances including past and present conduct of directors, company progress, shareholder/public interests.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Power under s. 326 quasi-judicial, not purely subjective; judicially reviewable for irrelevancy or ignoring relevant materials.",
      "resolves_issue": "i2",
      "in_favor_of": "partial"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Barium Chemicals Ltd. v. Company Law Board",
      "citation": "1966 Suppl. S.C.R. 311",
      "treatment": "distinguished",
      "relevance": "Distinguished as s.237(b) administrative/subjective; contrasts with quasi-judicial s.326."
    },
    {
      "case_name": "Rohtas Industries Ltd. v. S.D. Agarwal",
      "citation": "A.I.R. 1969 C. 707",
      "treatment": "followed",
      "relevance": "Opinion under s.237(b) not challengeable but circumstances can be."
    },
    {
      "case_name": "Nakkuda Ali v. M.F. De S. Jayaratne",
      "citation": "1951 A.C. 66",
      "treatment": "referred",
      "relevance": "Reasonable grounds must exist objectively for power exercise."
    },
    {
      "case_name": "Ridge v. Baldwin",
      "citation": "1964 A.C. 40",
      "treatment": "followed",
      "relevance": "Duty to act judicially even without express provision; review for breach of statutory obligation."
    },
    {
      "case_name": "Padfield v. Minister of Agriculture",
      "citation": "1968 1 All E.R. 694",
      "treatment": "followed",
      "relevance": "Minister's discretion reviewable; must consider complaint properly."
    }
  ],
  "statutes_cited": [
    {
      "name": "Companies Act, 1956",
      "sections": [
        "s. 326",
        "s. 330",
        "s. 10E",
        "s. 324",
        "s. 237"
      ],
      "relevance": "Approval for managing agent appointment/reappointment requires satisfaction on public interest, fitness/propriety, fair terms; quasi-judicial."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Both appeals dismissed. High Court order upheld directing Company Law Board to reconsider application considering all relevant past and present circumstances including V.H. Dalmia's entire conduct. Board to dispose within one month.",
    "relief_granted": "Remand to Company Law Board for fresh consideration",
    "costs": "No order as to costs in this Court"
  },
  "key_quotes": [
    {
      "text": "The satisfaction contemplated by s. 326 must, therefore, be the result of an objective appraisal of the relevant materials.",
      "speaker": "court",
      "significance": "Defines nature of Board's satisfaction as objective/quasi-judicial."
    },
    {
      "text": "Investment of that power carries with it a duty to act judicially i.e. to hold an enquiry in a manner consistent with rules of natural justice.",
      "speaker": "court",
      "significance": "Establishes quasi-judicial duty under s.326."
    },
    {
      "text": "in adjudging whether a person is fit and proper to be appoint past actings and conduct cannot be ignored.",
      "speaker": "court",
      "significance": "Mandates consideration of past conduct for present fitness."
    }
  ],
  "_case_id": "1969_224",
  "_label": 0,
  "_text_length": 21464,
  "_extracted_at": "2026-02-10T20:26:39.811084"
}