{
  "metadata": {
    "case_name": "C. Misra & Ors. v. Union of India & Ors.",
    "case_year": 1969,
    "court": "Supreme Court of India",
    "judges": [
      "Grover, J."
    ],
    "case_number": "Civil Appeal No. 452 of 1969",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellants are residents of Delhi who passed the pre-medical examination of the Delhi University held in April 1968 and obtained 62.5 marks.",
      "type": "background",
      "date": "1968-04",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "In June 1968 appellants applied for admission to the first year M.B., B.S. class at the Lady Harding Medical College, New Delhi but were not admitted.",
      "type": "background",
      "date": "1968-06",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Appellants thereafter applied for admission to the Maulana Azad Medical College, New Delhi, a constituent college of the University of Delhi established by the Government of India in June 1958.",
      "type": "background",
      "date": "1968-06",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "According to the college prospectus, 125 students are admitted annually: 15 seats reserved for scheduled caste candidates, 5 for scheduled tribes, 25 seats (excluding seats reserved for Government of India nominees) reserved for girl students on merit.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Eligible categories for admission: (a) Residents of Delhi; (b) Sons/daughters of Central Government servants posted in Delhi; (c) Candidate whose father is dead and wholly dependent on brother/sister who is Central Government servant posted in Delhi; (d) Sons/daughters of residents of specified Union Territories sponsored by their Administration; (e) Sons/daughters of Central Government servants posted in Indian Missions abroad; (f) Cultural Scholars; (g) Colombo Plan Scholars; (h) Thailand Scholars; (i) Jammu & Kashmir State Scholars.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "23 seats reserved for categories (c) to (h). Minimum percentage of marks in aggregate of compulsory subjects: 55%. Appellants had 62.5 marks and were domiciled in Delhi.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "In 1968, 9 students nominated by Central Government out of 23 reserved seats (categories c to h), who obtained less percentage of marks than appellants.",
      "type": "disputed",
      "date": "1968",
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "Appellants filed writ petition under Arts. 226 and 227 in Delhi High Court challenging power of Central Government to make nominations, praying to strike down nominations and admit appellants and others strictly on merit.",
      "type": "procedural",
      "date": "1968",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Delhi High Court by judgment dated December 3, 1968 dismissed writ petition, upheld authority of Central Government, but found 2 nominations contrary to rules and directed those seats to general pool; ordered respondents to fill two seats from merit list where petitioner No.1 is No.4 and No.2 is No.9.",
      "type": "procedural",
      "date": "1968-12-03",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Appellants filed review petition under s.114 and O.47 R.1 CPC in December 1968, dismissed by High Court on January 27, 1969.",
      "type": "procedural",
      "date": "1969-01-27",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Certificate granted under Arts. 133(1)(c) and 132(1) on February 1, 1969 for appeal against writ judgment dated December 3, 1968.",
      "type": "procedural",
      "date": "1969-02-01",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Medical Courses Admission Committee on November 5, 1965 recognised 23 seats reserved for certain categories for nomination, approved by Standing Committee and Academic Council on March 3, 1966.",
      "type": "background",
      "date": "1965-11-05",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "University of Delhi is statutory body under Delhi University Act 1922; S.30 allows Ordinances for admission; Ordinance 11 provides Medical Courses Admission Committee.",
      "type": "admitted",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the provision for reservation of seats for categories c to h is unconstitutional, suffering from discrimination under Art. 14 read with Arts. 15(1),(4) and 29(2).",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether nominations to reserved seats were made contrary to rules.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether appellants have locus standi to challenge nominations to reserved seats.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Reservation of seats not based on reasonable classification, suffers from vice of discrimination; hit by Art.14 r/w Arts.15(1),(4) and 29(2); categories c to h not socially/educationally backward or SC/ST.",
      "supporting_facts": [
        "f7",
        "f5"
      ],
      "legal_basis": "Art.14, 15(1),(4), 29(2)"
    },
    {
      "id": "pa2",
      "text": "System of nominations by Government instead of Admission Committee per se discriminatory.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Some nominations illegal as candidates did not apply by August 1, 1968.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Rules in prospectus have statutory sanction; Central Government entitled to nominate for reserved seats as it bears financial burden.",
      "supporting_facts": [
        "f3",
        "f12",
        "f13"
      ],
      "legal_basis": "Delhi University Act S.30, Ordinance 11"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Art.15(1) and 29(2) not attracted as no discrimination on grounds only of religion, race, caste etc.",
      "addresses_issue": "i1",
      "key_observation": "Rules do not discriminate on prohibited grounds."
    },
    {
      "id": "cr2",
      "text": "Reservation based on reasonable classification: intelligible differentia (backward areas, service exigencies, reciprocal arrangements, peculiar problems of J&K) with rational relation to object of providing medical education facilities from specified sources.",
      "addresses_issue": "i1",
      "key_observation": "Classification founded on intelligible differentia distinguishing from general category; rational nexus to object."
    },
    {
      "id": "cr3",
      "text": "Central Government appropriate authority for nominations due to diverse standards/ backgrounds; acted reasonably by nominating only 9/23 seats.",
      "addresses_issue": "i1",
      "key_observation": "No preferential treatment; necessary for uniformity."
    },
    {
      "id": "cr4",
      "text": "Appellants have no locus standi to challenge nominations as they do not compete for reserved seats; no obligation on Government to release seats to general pool.",
      "addresses_issue": "i2",
      "key_observation": "Assumption unfounded; High Court erred in examining merits."
    },
    {
      "id": "cr5",
      "text": "Point on late applications not raised in original writ, only in review; appellants lack right to challenge anyway.",
      "addresses_issue": "i3",
      "key_observation": "Not entertainable."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Reservation provisions constitutional under Art.14; reasonable classification.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Appellants lack locus standi to challenge validity of specific nominations to reserved seats.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Shri Ram Krishna Dalmia v. Shri Justice S. Tendolkar Others",
      "citation": "1959 S.C.R. 279",
      "treatment": "followed",
      "relevance": "Art.14 forbids class legislation but permits reasonable classification based on intelligible differentia with rational relation to object."
    },
    {
      "case_name": "Minor P. Rajendran v. State of Madras",
      "citation": "1968 2 S.C.R. 786",
      "treatment": "distinguished",
      "relevance": "District-wise classification lacked rational nexus; here sources properly classified."
    },
    {
      "case_name": "Umesh Ch. Sinha v. V. N. Singh, Principal, P.M.C. Hospital Ors.",
      "citation": "I.L.R. 46 Patna 616",
      "treatment": "distinguished",
      "relevance": "Preferential treatment to children of university employees lacked nexus; no such favoritism here."
    }
  ],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 14",
        "Art. 15(1)",
        "Art. 15(4)",
        "Art. 29(2)",
        "Art. 226",
        "Art. 227",
        "Art. 132(1)",
        "Art. 133(1)(c)",
        "Art. 136"
      ],
      "relevance": "Reservation tested against equality and non-discrimination; writ jurisdiction; appeal."
    },
    {
      "name": "Delhi University Act, 1922",
      "sections": [
        "S. 30"
      ],
      "relevance": "Ordinances for admission of students."
    },
    {
      "name": "Code of Civil Procedure, 1908",
      "sections": [
        "S. 114",
        "O. 47 R. 1",
        "O. 47 R. 7",
        "S. 141"
      ],
      "relevance": "Review petition; non-appealability of review dismissal."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal dismissed upholding Delhi High Court judgment validating Central Government's nomination power for reserved seats; appellants lack locus to challenge specific nominations; no interference with High Court's direction on two irregular seats as no appeal filed against it.",
    "relief_granted": "None",
    "costs": "No order as to costs"
  },
  "key_quotes": [
    {
      "text": "Art. 14 forbids class legislation it does not forbid reasonable classification.",
      "speaker": "court",
      "significance": "Core test for validity under Art.14 cited from Dalmia case."
    },
    {
      "text": "The appellants do not compete for the reserved seats and have no locus standi in the matter of nomination to such seats.",
      "speaker": "court",
      "key_observation": "Denies petitioners right to challenge nominations."
    },
    {
      "text": "The Central Government is under no obligation to release those seats to the general pool.",
      "speaker": "court",
      "significance": "Rejects assumption that invalid nominations revert to merit pool."
    }
  ],
  "_case_id": "1969_53",
  "_label": 0,
  "_text_length": 17410,
  "_extracted_at": "2026-02-10T20:25:24.491600"
}