{
  "metadata": {
    "case_name": "State of Gujarat v. Shantilal Mangaldas",
    "case_year": 1968,
    "court": "Supreme Court of India",
    "judges": [
      "Hidayatullah C.J.",
      "Shah J.",
      "Ramaswami J.",
      "Mitter J.",
      "Grover J."
    ],
    "case_number": "Civil Appeal No. 1377 of 1968",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "By Resolution dated April 18, 1927, the Borough Municipality of Ahmedabad declared its intention to make a town-planning scheme known as The City Wall Improvement Town Planning Scheme in respect of a specified area.",
      "type": "procedural",
      "date": "1927-04-18",
      "source": "lower_court"
    },
    {
      "id": "f2",
      "text": "A plot of land No. 221 measuring 18,219 square yards belonging to the first respondent was covered by the scheme.",
      "type": "material",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f3",
      "text": "The Provincial Government sanctioned the intention to make the scheme, and a draft scheme was then prepared under which the area of plot No. 221 was reconstituted into two plots- Plot No. 176 measuring 15,403 square yards reserved for the first respondent and Plot No. 178 measuring 2,816 square yards reserved for the local authority for constructing quarters for municipal employees.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The draft scheme was sanctioned by the Government of Bombay on August 7, 1942.",
      "type": "procedural",
      "date": "1942-08-07",
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "On August 13, 1942, the Government of Bombay appointed an arbitrator under Act 1 of 1915 to decide matters set out in s. 30 of the Act. From time to time several arbitrators were appointed, but apparently little progress was made.",
      "type": "procedural",
      "date": "1942-08-13",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The Bombay Town Planning Act 1 of 1915 was repealed by s. 90 of the Bombay Town Planning Act 27 of 1955 with effect from April 1, 1957. By s. 90(2) making of any scheme commenced under the repealed Act was to be continued and the provisions of the new Act were to have effect.",
      "type": "procedural",
      "date": "1957-04-01",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "The arbitrator appointed under Act 1 of 1915 was designated Town Planning Officer under Act 27 of 1955, and the proceedings under the City Wall Improvement Town Planning Scheme were continued before him.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "On August 23, 1957, the Town Planning Officer informed the first respondent that Rs. 25,411 were awarded to him as compensation for plot No. 178.",
      "type": "material",
      "date": "1957-08-23",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "The first respondent filed a petition in the High Court of Gujarat challenging the validity of Act 27 of 1955 and acquisition of plot No. 178 on the plea that the Act infringed Art. 31(2) of the Constitution.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f10",
      "text": "The scheme was sanctioned by the Government of Gujarat on July 21, 1965, and the final scheme came into operation on September 1, 1965.",
      "type": "procedural",
      "date": "1965-07-21",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "The High Court of Gujarat by judgment dated January 24, 1968 declared ss. 53 and 67 of the Bombay Town Planning Act 27 of 1955 ultra vires insofar as they authorise the local authority to acquire lands under a town-planning scheme, and declared invalid the City Wall Improvement Town Planning Scheme No. 5.",
      "type": "procedural",
      "date": "1968-01-24",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "With certificate granted by the High Court, this appeal is preferred by the State of Gujarat.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether ss. 53 and 67 of the Bombay Town Planning Act 27 of 1955, insofar as they authorise acquisition of land by the local authority under town-planning schemes, violate Article 31(2) of the Constitution.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the Act specifies principles for determination of compensation within the meaning of Article 31(2).",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether the Act falls within the exception in Article 31(5)(b)(ii) as a law for promotion of public health.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Bombay Act 27 of 1955 is not a law relating to acquisition of lands, but a law dealing with health and public sanitation enacted with the object of promotion of public health and falls within Art. 31(5)(b)(ii).",
      "supporting_facts": [
        "f1",
        "f3"
      ],
      "legal_basis": "Article 31(5)(b)(ii); Entry 6 List II; Entry 20 List III"
    },
    {
      "id": "pa2",
      "text": "Alternatively, the Act specifies the principles on which compensation is to be determined and the guarantee under Art. 31(2) is not infringed.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": "Sections 53, 67, 71 Bombay Town Planning Act 1955; Article 31(2)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The Act authorises compulsory transfer of ownership in land to the local authority for public purposes and falls within Art. 31(2A), requiring compensation as just equivalent.",
      "supporting_facts": [
        "f2",
        "f8"
      ],
      "legal_basis": "Article 31(2), 31(2A)"
    },
    {
      "id": "ra2",
      "text": "Increase in value of reconstituted plot cannot be taken into account for compensation as it is a community benefit, not attributable to acquisition.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": "P. Vajravelu Mudaliar; Bela Banerjee; N.B. Jeejeebhoy; Metal Corporation"
    },
    {
      "id": "ra3",
      "text": "Compensation based on market value at date of declaration of intention (1927) rather than date of acquisition is not just equivalent.",
      "supporting_facts": [
        "f1",
        "f10"
      ],
      "legal_basis": "Article 31(2)"
    },
    {
      "id": "ra4",
      "text": "No principle for compensating owners to whom no reconstituted plot is allotted.",
      "supporting_facts": [],
      "legal_basis": "Section 67"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The Act is a law for compulsory acquisition of land as it provides for vesting of lands required by local authority in it under s.53(a), but does not fall within Art.31(5)(b)(ii) as it is permanent acquisition, not mere abatement of menace.",
      "addresses_issue": "i3",
      "key_observation": "Acquisition for public park or embankment not protected by Art.31(5)(b)(ii)."
    },
    {
      "id": "cr2",
      "text": "Compensation need not be in money alone; allotment of reconstituted plot or adjustment under ss.67,71 constitutes compensation. S.53 provides statutory readjustment of rights, not vesting of all lands in local authority first.",
      "addresses_issue": "i1",
      "key_observation": "No intermediate vesting in local authority; simultaneous extinction of original rights and springing up of rights in reconstituted plots."
    },
    {
      "id": "cr3",
      "text": "Market value at date of declaration of intention specifies a principle for compensation under Art.31(2); adequacy not justiciable post-Fourth Amendment.",
      "addresses_issue": "i2",
      "key_observation": "Principles specified are relevant and not illusory."
    },
    {
      "id": "cr4",
      "text": "Remarks in P. Vajravelu Mudaliar case treating compensation as just equivalent are obiter and not binding. Metal Corporation case wrongly decided and overruled.",
      "addresses_issue": "i1",
      "key_observation": "Post-Fourth Amendment, principles for compensation not challengeable on inadequacy."
    },
    {
      "id": "cr5",
      "text": "Act does not violate Art.14; no option to acquire under Land Acquisition Act once scheme sanctioned.",
      "addresses_issue": "i1",
      "key_observation": "Land subject to scheme must be dealt under Town Planning Act."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Ss.53 and 67 of Bombay Town Planning Act 1955 do not infringe Art.31(2); they specify principles for compensation.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "P. Vajravelu Mudaliar observations on 'just equivalent' are obiter; Metal Corporation overruled.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "P. Vajravelu Mudaliar v. Special Deputy Collector",
      "citation": "1965 1 S.C.R. 614",
      "treatment": "distinguished",
      "relevance": "Obiter on 'just equivalent' not binding; principles specified valid."
    },
    {
      "case_name": "N.B. Jeejeebhoy v. Assistant Collector",
      "citation": "1965 1 S.C.R. 636",
      "treatment": "distinguished",
      "relevance": "Pre-Fourth Amendment case; reasoning separated."
    },
    {
      "case_name": "Union of India v. Metal Corporation of India Ltd.",
      "citation": "1967 1 S.C.R. 255",
      "treatment": "overruled",
      "relevance": "Wrongly held principles irrelevant; overruled."
    },
    {
      "case_name": "State of West Bengal v. Mrs. Bela Banerjee",
      "citation": "1954 S.C.R. 558",
      "treatment": "referred",
      "relevance": "Pre-amendment view of compensation as just equivalent."
    },
    {
      "case_name": "Deputy Commr., Kamrup v. Durga Nath Sharma",
      "citation": "1968 1 S.C.R. 561",
      "treatment": "followed",
      "relevance": "Permanent acquisition not within Art.31(5)(b)(ii)."
    }
  ],
  "statutes_cited": [
    {
      "name": "Bombay Town Planning Act, 1955",
      "sections": [
        "53",
        "67",
        "71",
        "90",
        "32",
        "65",
        "66",
        "81",
        "84"
      ],
      "relevance": "Provisions for town planning schemes, reconstitution of plots, vesting, compensation adjustment via market value at declaration date."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 31",
        "Article 31(2)",
        "Article 31(2A)",
        "Article 31(5)(b)(ii)",
        "Article 14",
        "Article 19(1)(f)"
      ],
      "relevance": "Guarantee against compulsory acquisition without compensation on specified principles; adequacy not justiciable."
    },
    {
      "name": "Bombay Town Planning Act, 1915",
      "sections": [
        "30",
        "90"
      ],
      "relevance": "Repealed but schemes continued under 1955 Act."
    },
    {
      "name": "Land Acquisition Act, 1894",
      "sections": [
        "4(1)"
      ],
      "relevance": "Basis for comparison; market value principle analogous."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; High Court judgment declaring ss.53 and 67 ultra vires set aside; City Wall Improvement Town Planning Scheme No.5 valid.",
    "relief_granted": "Declaration that ss.53 and 67 valid; scheme upheld.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"No such law shall be called in question in any court on the ground that the compensation provided by that law is not adequate.\"",
      "speaker": "court",
      "significance": "Core of Art.31(2) post-Fourth Amendment; excludes adequacy challenge."
    },
    {
      "text": "The Metal Corporation case was wrongly decided and should be over-ruled.",
      "speaker": "court",
      "significance": "Overrules precedent holding principles irrelevant."
    },
    {
      "text": "\"Compensation need not necessarily be in terms of money... A law which provides for making satisfaction to an expropriated owner by allotment of other property may be deemed to be a law providing for compensation.\"",
      "speaker": "court",
      "significance": "Broadens concept of compensation to include plot adjustment."
    }
  ],
  "_case_id": "1969_266",
  "_label": 1,
  "_text_length": 83602,
  "_extracted_at": "2026-02-10T20:27:37.452246"
}