{
  "metadata": {
    "case_name": "Appellants (Collector of Delhi) v. Respondent",
    "case_year": 1966,
    "court": "Supreme Court of India",
    "judges": [
      "Ramaswami, J."
    ],
    "case_number": "Civil Appeal No. 1613 of 1966",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "An auction was held for the sale of licence of country liquor shop in Bela Road for the year 1949-50 on March 23, 1949.",
      "type": "material",
      "date": "1949-03-23",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The auction took place in pursuance of the conditions of Auction of Excise Shops in Delhi for the year 1949-50 Ex. D-28.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Clauses 31 and 33 of the conditions: The Chief Commissioner is under no obligation to grant any license until he is assured of financial status of the bidder. At the conclusion of the auction an enquiry will be made into the financial position of any bidder not known to the excise staff and any such bidder shall if necessary be called upon to furnish security... All final bids will be made subject to the confirmation by the Chief Commissioner who may reject any bid without assigning any reasons.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The respondent offered the highest bid of Rs. 4,01,000/- for the shop.",
      "type": "material",
      "date": "1949-03-23",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Under the Excise Rules the bidder had to deposit one-sixth of the purchase price within seven days of the auction but the deposit was not made by the respondent.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "In these circumstances the Chief Commissioner did not confirm the bid of the respondent and resale of the Excise Shop was ordered.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "On May 3, 1949 the shop was again auctioned when Messrs Daulat Ram Amar Singh offered the highest bid of Rs. 2,20,000/- which was confirmed by the Chief Commissioner, on July 7, 1949.",
      "type": "material",
      "date": "1949-05-03",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Holding the respondent liable for the loss of Rs. 1,81,000 being the difference between the bid of the respondent and of Messrs Daulat Ram Amar Singh the Collector of Delhi started proceedings for the recovery of Rs. 1,81,000.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "On July 22, 1949 the respondent filed a suit in the court of Senior Subordinate Judge, Delhi praying for a permanent injunction restraining the appellants from taking any proceedings to recover the amount.",
      "type": "procedural",
      "date": "1949-07-22",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "The trial judge decreed the suit holding that the sale was subject to confirmation by the Chief Commissioner under cl. 33 and since the auction in favour of the respondent was not accepted by him there was no binding obligation between the parties.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "The decree of the trial court was upheld by the lower appellate court.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "In second appeal False, J., took the view that cl. 33 was not in consonance with the statutory rules and the contract came into existence when the bidding was closed in favour of the respondent on March 23, 1949. The respondent was therefore held liable.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "The respondent preferred an appeal under Letters Patent. The Division Bench allowed the appeal reversing the decision of the single Judge and restored that of the trial court.",
      "type": "procedural",
      "date": "1963-08-19",
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "This appeal is brought by certificate from the judgment of the Division Bench of the Punjab High Court dated August 19, 1963 in Letters Patent Appeal No. 50-D of 1960.",
      "type": "procedural",
      "date": "1963-08-19",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the contract of sale was complete upon the highest bid or only upon confirmation by the Chief Commissioner under Clause 33 of the conditions, and whether the respondent is liable for the deficiency on resale due to failure to deposit one-sixth of the bid amount.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The respondent was under a legal obligation to pay one-sixth of the annual fee within seven days of the auction under cl. 21 of r. 5.34 and it was due to his default that a resale of the excise shop was ordered. Under cl. 22 of r. 5.34 the respondent was liable for the deficiency in price and all expenses of such resale.",
      "supporting_facts": [
        "f4",
        "f5",
        "f7",
        "f8"
      ],
      "legal_basis": "Clause 21 and 22 of Rule 5.34 of Excise Rules; Punjab Excise Act, 1914"
    },
    {
      "id": "pa2",
      "text": "The phrase 'person to whom a shop has been sold' in cl. 21 of r. 5.34 means a person whose bid has been provisionally accepted.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": "Clause 21 of Rule 5.34"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The sale was subject to confirmation by the Chief Commissioner under cl. 33 and since the auction in favour of the respondent was not accepted by him there was no binding obligation between the parties.",
      "supporting_facts": [
        "f3",
        "f6"
      ],
      "legal_basis": "Clause 33 of Conditions Ex. D-28"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The first portion of cl. 21 requires the person to whom the shop has been sold to deposit one-sixth of the total annual fee within seven days. But the sale is deemed to have been made in favour of the highest bidder only on the completion of the formalities before the conclusion of the sale.",
      "addresses_issue": "i1",
      "key_observation": "Sale not complete till confirmation."
    },
    {
      "id": "cr2",
      "text": "Clause 16 of r. 5.34 states that all sales are open to revision by the Chief Commissioner. Under cl. 18, the Collector has to make a report to the Chief Commissioner where in his discretion he is accepting a lower bid. Clause 33 states that all final bids will be made subject to the confirmation by the Chief Commissioner who may reject any bid without assigning any reasons.",
      "addresses_issue": "i1",
      "key_observation": "Contract of sale was not complete till the bid was confirmed by the Chief Commissioner."
    },
    {
      "id": "cr3",
      "text": "Till such confirmation the person whose bid has been provisionally accepted is entitled to withdraw his bid. When the bid is so withdrawn before the confirmation of the Chief Commissioner the bidder will not be liable for damages on account of any breach of contract or for the shortfall on the resale.",
      "addresses_issue": "i1",
      "key_observation": "An acceptance of an offer may be either absolute or conditional. If the acceptance is conditional the offer can be withdrawn at any moment until absolute acceptance has taken place."
    },
    {
      "id": "cr4",
      "text": "It is not possible to accept that 'person to whom a shop has been sold' in cl. 21 means a person whose bid has been provisionally accepted. The first part of cl. 21 deals with a completed sale.",
      "addresses_issue": "i1",
      "key_observation": "Chief Commissioner disapproved the bid; essential pre-requisites of a completed sale are missing."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "There is no liability imposed on the respondent for payment of the deficiency in the price as the contract was not complete till confirmation by the Chief Commissioner.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Hussey v. Horne-Payne",
      "citation": "1878 8 Ch. D. 670",
      "treatment": "followed",
      "relevance": "Acceptance subject to approval of title is conditional; no binding contract until absolute acceptance."
    }
  ],
  "statutes_cited": [
    {
      "name": "Punjab Excise Act, 1914 (as extended to Delhi Province)",
      "sections": [
        "Section 34(2)",
        "Section 60"
      ],
      "relevance": "Security for observance of licence terms; recovery of deficiency and expenses from defaulting bidder."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court dismissed the appeal, upholding the judgment of the Punjab High Court Division Bench dated August 19, 1963, holding that there was no completed contract of sale without confirmation by the Chief Commissioner and thus no liability on the respondent for the deficiency on resale.",
    "relief_granted": "Permanent injunction in favour of respondent upheld; no recovery of Rs. 1,81,000.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "All final bids will be made subject to the confirmation by the Chief Commissioner who may reject any bid without assigning any reasons.",
      "speaker": "court",
      "significance": "Key condition making bids provisional."
    },
    {
      "text": "The contract of sale was not complete till the bid was confirmed by the Chief Commissioner and till such confirmation the person whose bid has been provisionally accepted is entitled to withdraw his bid.",
      "speaker": "court",
      "significance": "Core holding on no binding obligation."
    },
    {
      "text": "The expression subject to the title being approved by our solicitors appears to me to be plainly an additional term.",
      "speaker": "court",
      "significance": "Quote from Hussey v. Horne-Payne explaining conditional acceptance."
    }
  ],
  "_case_id": "1969_96",
  "_label": 0,
  "_text_length": 10252,
  "_extracted_at": "2026-02-10T20:26:05.228758"
}