{
  "metadata": {
    "case_name": "Sitabai and another v. Ramchandra",
    "case_year": 1966,
    "court": "Supreme Court of India",
    "judges": [
      "Ramaswami, J."
    ],
    "case_number": "Civil Appeal No. 856 of 1966",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Dulichand and Bhagirath were brothers and the properties concerned are ancestral.",
      "type": "admitted",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f2",
      "text": "Bhagirath predeceased Dulichand, his elder brother, sometime in 1930.",
      "type": "admitted",
      "date": "1930",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Plaintiff Sitabai is the widow of Bhagirath.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "After Bhagirath died, plaintiff Sitabai was living with Dulichand as a result of which connection an illegitimate child defendant Ramchandra was born in 1935.",
      "type": "admitted",
      "date": "1935",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Dulichand died on March 13, 1958.",
      "type": "material",
      "date": "1958-03-13",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Sometime before his death Sitabai adopted plaintiff number 2 Suresh Chandra and an adoption deed was executed on March 4, 1958.",
      "type": "material",
      "date": "1958-03-04",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "After the death of Dulichand Ramchandra took possession of the joint family properties.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Plaintiffs brought suit for ejectment of defendant Ramchandra from the disputed properties (agricultural land and house).",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Defendant contested suit claiming Dulichand surrendered lands to Jagirdar who resettled with defendant; Dulichand executed will bequeathing house to defendant.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f10",
      "text": "Trial court decided all issues in favour of plaintiffs and granted decree for possession of land and house.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "District Judge modified decree: will valid for half share of house, defendant entitled to half share.",
      "type": "procedural",
      "date": "1962-04-21",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Madhya Pradesh High Court in Second Appeal No. 275 of 1962 reversed lower courts, dismissed suit entirely, holding plaintiff 2 did not obtain coparcenary interest.",
      "type": "procedural",
      "date": "1965-09-07",
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Appeal by special leave to Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the High Court was right in holding that plaintiff number 2 Suresh Chandra at the time of his adoption by plaintiff number 1 did not become a coparcener of Dulichand in the joint family properties.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether rights of Inamdars tenants were heritable under Madhya Bharat Land Revenue and Tenancy Act, 1950.",
      "framed_by": "respondent"
    },
    {
      "id": "i3",
      "text": "Whether jurisdiction of Civil Court was barred by Madhya Bharat Land Revenue and Tenancy Act, 1950.",
      "framed_by": "respondent"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "High Court erred in holding that adoption by widow under Hindu Adoptions and Maintenance Act, 1956 makes adopted son son of widow only, not of deceased husband; adopted son becomes coparcener.",
      "supporting_facts": [
        "f2",
        "f3",
        "f6"
      ],
      "legal_basis": "Hindu Adoptions and Maintenance Act, 1956 ss. 5, 6, 7, 8, 11, 12, 14"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Plaintiff 2 became son of plaintiff 1 only from 1958, did not obtain coparcenary interest; on adoption date Dulichand sole coparcener.",
      "supporting_facts": [
        "f5",
        "f6",
        "f12"
      ],
      "legal_basis": "Hindu Adoptions and Maintenance Act, 1956"
    },
    {
      "id": "ra2",
      "text": "Rights of Inamdars tenants not heritable under Madhya Bharat Land Revenue and Tenancy Act, 1950; no contract with Inamdar.",
      "supporting_facts": [
        "f5",
        "f9"
      ],
      "legal_basis": "Madhya Bharat Land Revenue and Tenancy Act, 1950 ss. 63-88, 87, 89"
    },
    {
      "id": "ra3",
      "text": "Civil Court jurisdiction barred by Madhya Bharat Land Revenue and Tenancy Act, 1950.",
      "supporting_facts": [],
      "legal_basis": "Madhya Bharat Land Revenue and Tenancy Act, 1950"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Joint family may consist of single male member and widows; property does not cease to be joint family property.",
      "addresses_issue": "i1",
      "key_observation": "After Bhagirath's death, Dulichand sole surviving coparcener but joint family continued as Sitabai alive with maintenance right."
    },
    {
      "id": "cr2",
      "text": "Under Hindu Adoptions and Maintenance Act, 1956, adoption by widow makes adopted child son of both widow and deceased husband; absorbed in widow's family, becomes coparcener with Dulichand.",
      "addresses_issue": "i1",
      "key_observation": "Ss. 11(vi), 12, 14 imply child becomes child of both spouses; ties severed from birth family, replaced in adoptive family."
    },
    {
      "id": "cr3",
      "text": "Rights of ordinary tenants heritable under personal law absent special provision; s.86 contemplates heritability.",
      "addresses_issue": "i2",
      "key_observation": "No provision denying heritability to ordinary tenants."
    },
    {
      "id": "cr4",
      "text": "Civil court jurisdiction not barred; issue decided by lower courts, not challenged in High Court.",
      "addresses_issue": "i3",
      "key_observation": "Not permissible to raise at this stage."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Suresh Chandra upon adoption by Sitabai became coparcener with Dulichand; after Dulichand's death, sole surviving coparcener entitled to possession.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Rights of tenants heritable.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h3",
      "text": "Civil court jurisdiction not barred.",
      "resolves_issue": "i3",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Gowli Buddanna v. Commissioner of Income-tax, Mysore",
      "citation": "60 I.T.R. 293 S.C.",
      "treatment": "followed",
      "relevance": "Joint family may consist of single coparcener and widows; property retains joint character."
    },
    {
      "case_name": "Attorney General of Ceylon v. A.R. Arunachalam Chettiar",
      "citation": "1957 A.C. 540",
      "treatment": "followed",
      "relevance": "Property does not cease to be joint due to temporary single coparcener; ownership changes quality upon adoption."
    },
    {
      "case_name": "Arukushi Narayan v. Janabai Sama Sawat",
      "citation": "67 B.L.R. 864",
      "treatment": "followed",
      "relevance": "Effect of adoption under HAMA 1956: child of both spouses."
    }
  ],
  "statutes_cited": [
    {
      "name": "Hindu Adoptions and Maintenance Act, 1956",
      "sections": [
        "Section 5",
        "Section 6",
        "Section 7",
        "Section 8",
        "Section 11",
        "Section 12",
        "Section 14"
      ],
      "relevance": "Governs valid adoption by widow; adopted child deemed child of adoptive mother and deceased husband, becomes coparcener."
    },
    {
      "name": "Madhya Bharat Land Revenue and Tenancy Act, 1950",
      "sections": [
        "Sections 63 to 88",
        "Section 86",
        "Section 87",
        "Section 89"
      ],
      "relevance": "Rights of ordinary tenants heritable under personal law; no bar to civil jurisdiction."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Supreme Court set aside Madhya Pradesh High Court judgment dated September 7, 1965 in Second Appeal No. 275 of 1962 and restored Additional District Judge's decree dated April 21, 1962 in First Appeal No. 26 of 1961 granting decree for agricultural lands and half share of house to plaintiff 2.",
    "relief_granted": "Decree for possession of agricultural lands in village Palasia and half share of house to plaintiff 2 Suresh Chandra.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"under the Hindu system of law a joint family may consist of a single male member and widows of deceased male members and that the property of a joint family did not cease to belong to a joint family merely because the family is represented by a single coparcener\"",
      "speaker": "court",
      "significance": "Establishes continuation of joint family with single coparcener."
    },
    {
      "text": "\"the true effect and interpretation of ss. 11 and 12 of Act No. 78 of 1956 therefore is that when either of the spouses adopts a child, all the ties of the child in the family of his or her birth become completely severed and these are all replaced by those created by the adoption in the adoptive family.\"",
      "speaker": "court",
      "significance": "Defines effect of adoption by widow under HAMA."
    }
  ],
  "_case_id": "1969_214",
  "_label": 1,
  "_text_length": 19231,
  "_extracted_at": "2026-02-10T20:26:41.121921"
}