{
  "metadata": {
    "case_name": "State of Mysore v. Respondent",
    "case_year": 1966,
    "court": "Supreme Court of India",
    "judges": [
      "Ramaswami, J."
    ],
    "case_number": "Civil Appeal No. 1312 of 1966",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The respondent was working as an Executive Engineer in the Public Works Department of the Hyderabad State and was in charge of certain project works during the period June 1949 to September 1950.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On the basis of some information the explanation of the respondent was called for in respect of certain alleged irregularities in the execution of certain project works. The respondent sent in his explanations dated June 14, 1951 and December 10, 1951 to the Superintending Engineer, Munirabad.",
      "type": "procedural",
      "date": "1951-06-14",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "In October 1953 the Enquiry Officer came to the conclusion that some loss had been caused in respect of four projects more due to lack of foresight and organising capacity on the part of the respondent than to any intentional misappropriation.",
      "type": "material",
      "date": "1953-10",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "A show cause notice was issued on March 11, 1955 asking the respondent to show cause why he should not be stopped from crossing the efficiency bar with effect from February 9, 1952 and why a sum of Rs. 23,371/- should not be recovered from his salary on account of the loss caused to the Government by the respondent's negligence.",
      "type": "procedural",
      "date": "1955-03-11",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "After the respondent had shown cause the matter was sent by the Government to the Public Service Commission. The Public Service Commission recommended that in addition to stopping the respondent at the efficiency bar for the period 1952 to 1957 as recommended by the Government, the pecuniary loss caused to the Government should be recovered from the respondent.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "On November 1, 1956 the States Reorganisation came into force and the services of the respondent stood transferred to the State of Mysore.",
      "type": "procedural",
      "date": "1956-11-01",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "By its order dated October 14, 1958 the Mysore Government directed that the respondent should be retired compulsorily from service and should also be asked to make good sum of Rs. 4,576/- being the amount of loss caused to Government.",
      "type": "procedural",
      "date": "1958-10-14",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "The respondent challenged this order by a writ petition on the ground that the Enquiry Officer at Hyderabad had exonerated him of all the charges excepting one and also because the report of the Enquiry Officer was not furnished to the respondent. The High Court of Mysore allowed the writ petition and quashed the order of the Government.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Thereafter the Mysore Government took further steps in the matter and the respondent presented several other writ petitions in the Mysore High Court impinging the subsequent action of the Mysore Government.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "By an order made on December 10, 1960 the respondent who was to have retired with effect from October 27, 1960, the date on which he completed the age of 55 years was continued in service but under suspension pending completion of the disciplinary proceedings against him.",
      "type": "procedural",
      "date": "1960-12-10",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "The Government by a subsequent order dated May 19, 1961 revoked the previous order of December 10, 1960 and permitted the respondent to retire dropping altogether the disciplinary proceedings against him.",
      "type": "procedural",
      "date": "1961-05-19",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "After his retirement the respondent filed writ petition No. 1280 of 1961 praying for declaration that he should be regarded as having crossed the efficiency bar in his pay scale on February 9, 1952 and that he should be given all the increments after the efficiency bar in the pay scale of an Executive Engineer and that he should be paid the difference and his pension should be fixed on the basis of enhanced salary claimed by him.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "The Mysore High Court by judgment dated October 1, 1962 in Writ Petition No. 1280 of 1961 directed the appellant to determine the salary payable to the respondent on the basis that he had been permitted to cross the efficiency bar in time scale of pay of Rs. 900-50-1200-EB-75-1500 in Osmania Sikka rupees and that the increments above the efficiency bar be withheld by the appellant should not be paid to him and the salary so determined should be taken into account for determining the amount of pension payable to the respondent.",
      "type": "procedural",
      "date": "1962-10-01",
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the respondent is entitled to cross the efficiency bar and receive increments above it without a specific sanction order under Rule 38 of the Hyderabad Civil Services Rules, merely because disciplinary proceedings were dropped.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the withholding of the increment at the efficiency bar was intended to operate as a penalty for alleged misconduct, such that dropping proceedings automatically restores it.",
      "framed_by": "respondent"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Under r. 38 of the Hyderabad Civil Service Rules a specific order ought to be made permitting the respondent to cross the efficiency bar. The stoppage at efficiency bar had no connection with the recovery of loss sustained by the Government.",
      "supporting_facts": [
        "f4",
        "f13"
      ],
      "legal_basis": "Rule 38 of the Hyderabad Civil Services Rules, 1952; Rule 52 of the Mysore Civil Services Rules, 1958"
    },
    {
      "id": "pa2",
      "text": "Dropping of disciplinary proceedings does not automatically entitle the respondent to cross the efficiency bar, as an express order of the appropriate authority is necessary.",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": "Rule 38 of the Hyderabad Civil Services Rules"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The withholding of the increment at the efficiency bar was intended to operate as a penalty for alleged misconduct. Upon dropping of the disciplinary proceedings without recording any finding of guilt no penalty could be imposed.",
      "supporting_facts": [
        "f4",
        "f11"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Once the Government had taken the decision to stop the respondent at the efficiency bar by way of penalty it must be held that the Government had waived their right to stop the respondent at the efficiency bar for administrative reasons under r. 38.",
      "supporting_facts": [
        "f5",
        "f11"
      ],
      "legal_basis": "Rule 38 of the Hyderabad Civil Services Rules"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "In view of the language of r. 38 of the Hyderabad Rules and r. 52 of the Mysore Rules before the respondent could claim payment of increments next above the bar it is necessary that the Government should make a special order sanctioning such payment.",
      "addresses_issue": "i1",
      "key_observation": "Disciplinary proceedings were dropped but the result claimed by the respondent cannot automatically follow."
    },
    {
      "id": "cr2",
      "text": "The notice dated March 16, 1955 against the respondent asked him to show cause why he should not be stopped from crossing the efficiency bar and why a sum of Rs. 23,371-14-2 should not be recovered from him on account of loss caused to the Government by his negligence. The stoppage at efficiency bar had no connection with the recovery of loss.",
      "addresses_issue": "i1",
      "key_observation": "It cannot be said that the Government wanted to impose the efficiency bar because it wanted to reimburse itself for the loss caused by the respondent."
    },
    {
      "id": "cr3",
      "text": "There is no warrant for the contentions advanced on behalf of the respondent. It is not possible to accept the contention of the respondent that the Government must be deemed to have given specific sanction under r. 38 merely because disciplinary proceedings had been dropped.",
      "addresses_issue": "i2",
      "key_observation": "An express order of the appropriate authority is necessary before the respondent is allowed to cross the efficiency bar."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Before the respondent could claim payment of increments next above the efficiency bar it is necessary that the Government should make a special order sanctioning such payment under Rule 38.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Hyderabad Civil Services Rules, 1952",
      "sections": [
        "Rule 38"
      ],
      "relevance": "Requires specific sanction of the authority empowered to withhold increments for crossing efficiency bar."
    },
    {
      "name": "Mysore Civil Services Rules, 1958",
      "sections": [
        "Rule 52"
      ],
      "relevance": "In the same language as r. 38 of the Hyderabad Civil Service Rules."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "The appeal is allowed, the judgment of the Mysore High Court dated October 1, 1962 is set aside, and the writ petition filed by the respondent is dismissed.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "Where an efficiency bar is prescribed in a time scale the increment next above the bar shall not be given to a Government servant without the specific sanction of the authority empowered to withhold increments.",
      "speaker": "court",
      "significance": "Quotes Rule 38 verbatim, central to the holding."
    },
    {
      "text": "It is manifest that in view of the language of r. 38 of the Hyderabad Rules and r. 52 of the Mysore Rules before the respondent could claim payment of increments next above the bar it is necessary that the Government should make a special order sanctioning such payment.",
      "speaker": "court",
      "significance": "Core reasoning rejecting automatic crossing of efficiency bar."
    }
  ],
  "_case_id": "1969_112",
  "_label": 1,
  "_text_length": 8843,
  "_extracted_at": "2026-02-10T20:26:01.599116"
}