{
  "metadata": {
    "case_name": "Mortgagees (Appellants) v. Debtors (Respondents)",
    "case_year": 1966,
    "court": "Supreme Court of India",
    "judges": [
      "Mitter, J."
    ],
    "case_number": "Civil Appeals Nos. 123 and 124 of 1966",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Creditors (appellants) were in possession of properties under two mortgage deeds of Samvat years 1997 and 1999, first for Rs. 991 and second for Rs. 1,011; mortgagees with possession appropriating usufruct for last 50 years and paying revenue and other dues.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Lands situate in Bajana State with Girasdari system.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Saurashtra Land Reforms Act, XXV of 1951 came into force on July 23, 1951.",
      "type": "background",
      "date": "1951-07-23",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Mamlatdar order dated 16th January 1954 (Ex. 8/1): Girasdar allowed to keep certain lands as Gharkhed; S. Nos. 684 and 685 held by mortgagees as khalsa, full assessment ordered, no need to grant occupancy rights.",
      "type": "procedural",
      "date": "1954-01-16",
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "Decision of Bhayati Court of Bajana State: Bajana State had no title or interest in the land, Jats Mul-Girasdars were independent proprietors.",
      "type": "background",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "Respondents (debtors, Girasdars) applied for adjustment of debt under Saurashtra Agricultural Debtors Relief Act, 1954 to Civil Judge on May 2, 1955.",
      "type": "procedural",
      "date": "1955-05-02",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Civil Judge: Directed restoration of lands to debtors subject to limitations and conditions; debtors to pay Rs. 1,698/- in twelve yearly instalments.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Assistant Judge, Surendranagar (appeal): Mortgages not extinguished; creditors not tenants under s.6; modified award accordingly.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Gujarat High Court judgments dated April 28, 1965 in Civil Revision Applications Nos. 88 and 93 of 1961: Affirmed Assistant Judge; no confiscation to State; Debtors Relief Act provisions prevail.",
      "type": "procedural",
      "date": "1965-04-28",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Appellants relied on Forms 7 and 8 under Land Reforms Act rules to claim proprietary rights.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f11",
      "text": "Debtors are class C Girasdars; total area of agricultural land comprised in estate did not exceed 120-00 (under s.5(c)).",
      "type": "background",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the debtors had lost all their interest in the lands mortgaged by reason of the operation of the Saurashtra Land Reforms Act, XXV of 1951 and as such were incompetent to make an application under the Saurashtra Agricultural Debtors Relief Act, 1954.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Debtors lost rights in lands declared khalsa by Special Mamlatdar order; mortgages extinguished by forfeiture to State/paramount power; relied on Bhayati Court decision, Forms 7 and 8; no subsisting mortgage on date of Debtors Relief Act application.",
      "supporting_facts": [
        "f4",
        "f5",
        "f10"
      ],
      "legal_basis": "Saurashtra Land Reforms Act; Bhayati Court decision"
    },
    {
      "id": "pa2",
      "text": "Special Mamlatdar's decision binding as no appeal filed; debtors cannot agitate rights ignoring it.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Mamlatdar order only for full assessment recovery, no title vested in creditors; Bhayati Court decided State had no title, Girasdars proprietors; no extinguishment of mortgages.",
      "supporting_facts": [
        "f4",
        "f5"
      ],
      "legal_basis": "Saurashtra Land Reforms Act s.6 (mortgagees not tenants)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Land Reforms Act regulates Girasdars and tenants, not mortgages; Mamlatdar had no jurisdiction to terminate mortgage rights; order only decided no occupancy rights needed as lands khalsa, full assessment; mortgagees not tenants under s.6.",
      "addresses_issue": "i1",
      "key_observation": "Special Mamlatdar decided only whether debtors could get occupancy certificates; no adjudication of rights inter se between debtors and creditors."
    },
    {
      "id": "cr2",
      "text": "Mortgagees paying revenue under s.76(c) Transfer of Property Act; cannot acquire title in derogation of mortgagors; payments add to mortgage money under s.72(b).",
      "addresses_issue": "i1",
      "key_observation": "No compensation awarded to debtors for khalsa lands; occupancy certificates to mortgagees cannot extinguish mortgagors' title."
    },
    {
      "id": "cr3",
      "text": "Debtors' rights not extinguished under Land Reforms Act; competent under Debtors Relief Act to scale down debt and restore possession.",
      "addresses_issue": "i1",
      "key_observation": "Objects of two Acts different; no need to decide if Debtors Relief Act overrides Land Reforms Act."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Debtors' rights in mortgaged lands not extinguished by Land Reforms Act; Mamlatdar order did not affect inter se rights; award under Debtors Relief Act valid.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Saurashtra Land Reforms Act, XXV of 1951",
      "sections": [
        "s.2(15)",
        "s.2(13)",
        "s.2(30)",
        "s.3",
        "s.4",
        "s.5(c)",
        "s.6(1)",
        "s.19",
        "s.20",
        "s.24",
        "s.31",
        "s.36",
        "s.46",
        "s.51"
      ],
      "relevance": "Regulates Girasdars and tenants; deems cultivators as tenants except mortgagees; no effect on mortgage rights; Mamlatdar jurisdiction limited."
    },
    {
      "name": "Saurashtra Agricultural Debtors Relief Act, 1954",
      "sections": [],
      "relevance": "Governs rights of debtors and creditors inter se; scales down debts; provides for restoration of possession to debtors."
    },
    {
      "name": "Transfer of Property Act",
      "sections": [
        "s.72(b)",
        "s.76(c)"
      ],
      "relevance": "Mortgagee in possession must pay revenue; payments added to mortgage money, no acquisition of title."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court dismissed the appeals, holding that debtors' rights not extinguished under Land Reforms Act; affirmed High Court and lower courts' orders directing restoration of lands to debtors subject to payment of adjusted debt.",
    "relief_granted": "Restoration of lands to debtors; payment of Rs. 1,698/- in twelve yearly instalments.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The said Officer had no jurisdiction to terminate any rights under mortgage.",
      "speaker": "court",
      "significance": "Clarifies limit of Mamlatdar's jurisdiction under Land Reforms Act."
    },
    {
      "text": "In our view all that the Special Mamlatdar decided and had jurisdiction to decide under the Act was, whether the debtors could be given occupancy certificates or allotted any land Gharkhed.",
      "speaker": "court",
      "significance": "Defines scope of Mamlatdar order; no effect on mortgage rights."
    },
    {
      "text": "The right of the mortgagors not being extinguished under any provision of law to which our attention was drawn, no fault can be found with the award as finally modified.",
      "speaker": "court",
      "significance": "Affirms validity of Debtors Relief Act award."
    }
  ],
  "_case_id": "1969_175",
  "_label": 0,
  "_text_length": 16672,
  "_extracted_at": "2026-02-10T20:26:38.235139"
}