{
  "metadata": {
    "case_name": "Owners of China Baug v. Ahmedabad Municipal Corporation & Ors.",
    "case_year": 1967,
    "court": "Supreme Court of India",
    "judges": [
      "Shah, J."
    ],
    "case_number": "Civil Appeal No. 1102 of 1967",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellants are owners of China Baug situated on the southern bank of the river Sabarmati within the limits of the Municipal Corporation of Ahmedabad.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Ahmedabad Municipal Corporation resolved to move the State Government to acquire a part of the land of the appellants for setting up a Samadhi of Mahatma Gandhi.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On September 10, 1959, the Commissioner, Ahmedabad Division, in the State of Bombay, issued a notification under S. 4 of the Land Acquisition Act, stating that lands specified (3428 sq. yards 3 sq. ft. out of Survey No. 348B, and 494 sq. yards 5 sq. ft. out of Survey No. 349) are likely to be needed for public purpose viz. for The Memorial of Rashtrapita Mahatma Gandhi.",
      "type": "procedural",
      "date": "1959-09-10",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Enquiry was made under s. 5A of the Land Acquisition Act and after receiving the report of the Collector.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "By virtue of the Bombay Reorganization Act, 1960, the Commissioner, Baroda Division of the State of Gujarat was the appropriate authority and issued a notification under S. 6 of the Land Acquisition Act on August 31, 1961, that the lands were required for the public purpose specified i.e. Memorial of Mahatma Gandhi (3562 sq. yards out of Survey No. 348B and 387 sq. yards out of Survey No. 349; remaining area under S.4 from 348B abandoned).",
      "type": "procedural",
      "date": "1961-08-31",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Appellants moved a petition in the High Court of Gujarat (Special Civil Application No. 622 of 1961) for a writ quashing the proceedings under the Land Acquisition Act and the two notifications dated September 10, 1959 and August 31, 1961 and for a writ restraining the Commissioner, Baroda Division, and the Government of the State of Gujarat from enforcing the notifications.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "The High Court rejected the petition by judgment and order dated July 28, 29, 30, 1965.",
      "type": "procedural",
      "date": "1965-07-28",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "With certificate granted by the High Court under Art. 133(1)(c) of the Constitution this appeal is preferred by the appellants.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Government of the State of Bombay issued on September 5, 1958 a notification under s. 3(4) of the Commissioners of Divisions Act, conferring and imposing on the Commissioners concerned the powers and duties under the enactments specified therein, including adaptations in Land Acquisition Act: in s.4(1) after 'appropriate Government' inserted 'or the Commissioner'; in s.6(1) after 'appropriate Government' inserted 'or, as the case may be, the Commissioner'.",
      "type": "background",
      "date": "1958-09-05",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the Commissioners of Divisions Act 8 of 1958 pursuant to which the Commissioners of Divisions were vested with authority to discharge statutory functions vested in the State Government was ultra vires the legislature.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether the Commissioner, Baroda Division, State of Gujarat was incompetent to issue the notification under S. 6 without issuing a fresh notification under s. 4.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether the provisions of ss. 77 and 78 of the Provincial Municipal Corporations Act, 1949, should have been complied with, and whether acquisition of land for a Memorial to Mahatma Gandhi was acquisition for a Municipal purpose.",
      "framed_by": "petitioner"
    },
    {
      "id": "i4",
      "text": "Whether the notifications under ss. 4 & 6 were illegal and unenforceable for not setting out the instrumentality which was to carry out the purpose.",
      "framed_by": "petitioner"
    },
    {
      "id": "i5",
      "text": "Whether the Commissioner, Baroda Division, in issuing the notification under s. 6 did not apply his mind to the evidence before him.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The Commissioners of Divisions Act 8 of 1958 was ultra vires the legislature as ss. 3(3) and 3(4) constituted excessive delegation of legislative power to the State Government resulting in abdication of the functions of the State Legislature.",
      "supporting_facts": [],
      "legal_basis": "Commissioners of Divisions Act 8 of 1958 ss.3(3), 3(4)"
    },
    {
      "id": "pa2",
      "text": "In any event the Commissioner, Baroda Division, State of Gujarat was incompetent to issue the notification under S. 6 without issuing a fresh notification under s. 4.",
      "supporting_facts": [
        "f3",
        "f5"
      ],
      "legal_basis": "Land Acquisition Act ss.4,6; Bombay Reorganization Act, 1960"
    },
    {
      "id": "pa3",
      "text": "Since the land was notified for acquisition for the purposes of the Municipal Corporation the provisions of ss. 77 and 78 of the Provincial Municipal Corporations Act, 1949, should have been complied with. In any event acquisition of land for a Memorial to Mahatma Gandhi was not acquisition for a Municipal purpose and the notifications were without the authority of law.",
      "supporting_facts": [
        "f2"
      ],
      "legal_basis": "Provincial Municipal Corporations Act, 1949 ss.77,78"
    },
    {
      "id": "pa4",
      "text": "The instrumentality which was to carry out the purpose not having been set out in the notifications under ss. 4 & 6 the notifications were illegal and unenforceable.",
      "supporting_facts": [
        "f3",
        "f5"
      ],
      "legal_basis": "Land Acquisition Act ss.4,6"
    },
    {
      "id": "pa5",
      "text": "The Commissioner, Baroda Division, in issuing the notification under s. 6 did not apply his mind to the evidence before him and on that account the notification was liable to be struck down.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": "Land Acquisition Act s.6"
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "This Court has in Arnold Rodricks v. State of Maharashtra by majority held that the powers conferred by s. 3(4) on the State Governments are not unguided and that the State Legislature has by enacting S. 3(4) not abdicated its powers in favour of the executive, for it has laid down the legislative policy and has left it to the State Government to reorganise the administration consequent on the setting up of Commissioners Divisions. The challenge to the vires of the Commissioners of Divisions Act 8 of 1958 must fail.",
      "addresses_issue": "i1",
      "key_observation": "No excessive delegation."
    },
    {
      "id": "cr2",
      "text": "The notification under s. 4 was issued by the Commissioner, Ahmedabad Division, exercising powers as an officer of the State of Bombay. But after the notification was issued, the State of Bombay was reorganized and the area in which the land is situated was included in the new State of Gujarat. The Commissioner of Baroda Division was competent to exercise the powers under the Commissioners of Divisions Act which continued to remain in force in the new State of Gujarat in respect of the Land Acquisition Act and had on that account power to issue a notification under s. 6. There is nothing requiring a fresh s.4 notification.",
      "addresses_issue": "i2",
      "key_observation": "Commissioner Baroda competent for s.6 without fresh s.4."
    },
    {
      "id": "cr3",
      "text": "There is nothing in ss. 77(1), 78(1) which supports the contention that before initiation of a proceeding for acquisition of land, which it is necessary or expedient for any purpose of the Municipal Act to be acquired, the Commissioner of the Municipality must start negotiations for purchase by private agreement. Exercise of power to move the State under S. 78 is not conditioned by any such limitation. The notification under s. 4 does not refer to any purpose of the Ahmedabad Municipal Corporation. The land is needed for setting up a memorial to Mahatma Gandhi at a place associated with him, and that purpose was a public purpose because of the universal veneration in which the memory of Mahatma Gandhi is held.",
      "addresses_issue": "i3",
      "key_observation": "Public purpose under Land Acquisition Act; no need for Municipal Act compliance as not specified as municipal purpose."
    },
    {
      "id": "cr4",
      "text": "The Land Acquisition Act does not provide that the instrumentality which is to carry out the purpose must be set out in the notifications under ss. 4 & 6. Gujarat High Court in Chandulal Patel overruled by Full Bench in Ramji Popatbhai, and this court agreed in Vishnu Prasad Ramdas Gohil that failure to specify the instrumentality does not affect validity.",
      "addresses_issue": "i4",
      "key_observation": "No need to specify instrumentality."
    },
    {
      "id": "cr5",
      "text": "The use of the expression 'the remaining area of the said lands notified under section 4 is hereby abandoned' does not justify an inference that the Commissioner did not apply his mind. The entire Survey No. 348B was not notified under s.4, only a part, and s.6 covered more but abandoned excess.",
      "addresses_issue": "i5",
      "key_observation": "Commissioner applied mind; area discrepancy explained."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Commissioners of Divisions Act 8 of 1958 is valid; no excessive delegation.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Commissioner Baroda Division competent to issue s.6 notification without fresh s.4.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "No mandatory compliance with ss.77-78 Provincial Municipal Corporations Act required; acquisition for Gandhi Memorial is public purpose under Land Acquisition Act.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    },
    {
      "id": "h4",
      "text": "Notifications valid without specifying instrumentality.",
      "resolves_issue": "i4",
      "in_favor_of": "respondent"
    },
    {
      "id": "h5",
      "text": "Commissioner applied mind in issuing s.6 notification.",
      "resolves_issue": "i5",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Arnold Rodricks & Anr. v. State of Maharashtra & Ors.",
      "citation": "1966 3 S.C.R. 885",
      "treatment": "followed",
      "relevance": "Powers under s.3(4) Commissioners of Divisions Act not unguided; no abdication by legislature."
    },
    {
      "case_name": "Chandulal Patel v. The State of Gujarat",
      "citation": "Special Civil Application No. 800 of 1961; 1969 Guj. L.R. 164",
      "treatment": "overruled",
      "relevance": "Held failure to mention instrumentality invalidates notification; overruled."
    },
    {
      "case_name": "Ramji Popatbhai v. Jamnadas",
      "citation": null,
      "treatment": "followed",
      "relevance": "Full Bench overruled Chandulal Patel; failure to specify instrumentality does not invalidate."
    },
    {
      "case_name": "Vishnu Prasad Ramdas Gohil & Others v. The State of Gujarat",
      "citation": null,
      "treatment": "followed",
      "relevance": "Agreed with Full Bench; failure to specify instrumentality does not affect validity of ss.4 or 6 notifications."
    }
  ],
  "statutes_cited": [
    {
      "name": "Land Acquisition Act, 1894",
      "sections": [
        "Section 4",
        "Section 5A",
        "Section 6"
      ],
      "relevance": "Notifications issued under ss.4 and 6 for public purpose of Gandhi Memorial; no need for fresh s.4 or instrumentality specification; s.6(3) conclusive evidence of public purpose."
    },
    {
      "name": "Commissioners of Divisions Act, 1958 (Bombay Act 8 of 1958)",
      "sections": [
        "Section 3"
      ],
      "relevance": "Validly conferred powers on Commissioners to issue notifications under Land Acquisition Act; no excessive delegation."
    },
    {
      "name": "Provincial Municipal Corporations Act, 1949",
      "sections": [
        "Section 66(42)",
        "Section 77",
        "Section 78"
      ],
      "relevance": "Ss.77-78 provide alternative for acquisition but not mandatory precondition; purpose not municipal so extended definition unnecessary."
    },
    {
      "name": "Bombay Reorganization Act, 1960",
      "sections": [],
      "relevance": "Transferred authority to Commissioner Baroda Division in Gujarat State."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 133(1)(c)"
      ],
      "relevance": "Certificate for appeal to Supreme Court."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court dismissed the appeal, upholding the notifications under ss.4 and 6 of the Land Acquisition Act issued by the Commissioners for acquiring land for a Memorial to Mahatma Gandhi as valid, rejecting all contentions on vires of Commissioners Act, competence, municipal compliance, instrumentality, and application of mind.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"A notification issued under s. 6 is by sub-s. (3) conclusive evidence that the land is needed for a public purpose.\"",
      "speaker": "court",
      "significance": "Emphasizes statutory conclusiveness of public purpose declaration."
    },
    {
      "text": "\"The purpose of acquisition being one which falls within the normal connotation of the expression public purpose within the meaning of s. 4 of the Land Acquisition Act, it is unnecessary to rely upon the extended meaning...\"",
      "speaker": "court",
      "significance": "Confirms Gandhi Memorial as inherent public purpose."
    },
    {
      "text": "\"Failure to specify the instrumentality which is to execute the public purpose does not affect the validity of the notification either under S. 4 or under S. 6.\"",
      "speaker": "court",
      "significance": "Rejects requirement to name executing agency."
    }
  ],
  "_case_id": "1969_129",
  "_label": 0,
  "_text_length": 17681,
  "_extracted_at": "2026-02-10T20:26:04.753951"
}