{
  "metadata": {
    "case_name": "Sihor Electricity Works Ltd. v. Gujarat Electricity Board & Anr.",
    "case_year": 1966,
    "court": "Supreme Court of India",
    "judges": [
      "Ramaswami, J."
    ],
    "case_number": "Civil Appeals Nos. 452 and 453 of 1966",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The appellant, the Sihor Electricity Works Ltd., is a public limited company carrying on the business of generating and distributing electrical energy under the licence granted to it under the Indian Electricity Act, 1910, having its supply area within the limits of Sihor Town situated in the district of Bhavnagar in Saurashtra. At the relevant time it was a distributing licensee distributing the energy purchased in bulk from the first respondent.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The first respondent is the Gujarat Electricity Board which is a Corporation constituted under the Electricity Supply Act, 1948 for the purposes of generation, supply and distribution of electricity in the State of Gujarat.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The second respondent is the Saurashtra Electrical and Metal Industries Private Ltd., a private limited company carrying on the business of manufacturing electrical accessories etc. and having its factory at Sihor within the area of supply of the appellant company.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The appellant brought a suit against the respondents in the Court of Civil Judge Junior Division of Sihor being Civil Suit No. 45 of 1960 to obtain a declaration that the decision of the first respondent contained in its letters dated 3rd June, 1960 and 24th October, 1960 to give direct supply to the factory of the second respondent within the area of supply of the appellant and without its consent was illegal and ultra vires its powers under the Electricity Supply Act, 1948, and for a permanent injunction restraining the first respondent from implementing the said decision.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The case of the appellant was that the first respondent was not entitled to give direct supply to the second respondent as the maximum demand of the appellant at the time of request of the second respondent was more than twice the maximum demand asked for by the second respondent. The appellant company alleged that the maximum demand of the appellant company in the relevant period, namely, September 1959 to December 1959 was between 262 to 349 KVA while the maximum demand of the second respondent had never exceeded 40 to 45 KVA.",
      "type": "admitted",
      "date": "1959-09 to 1959-12",
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "The first respondent contested the suit on the ground that the decision was legal and proper because the maximum demand of the appellant company at the time of request was less than twice the maximum demand asked for by the second respondent from the first respondent. It was contended that the demand asked for by the second respondent was 398 KVA, and, therefore, the first respondent was entitled in law to give direct supply to the second respondent.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f7",
      "text": "The trial Judge held that the decision of the first respondent to give direct supply of electricity to the second respondent was ultra vires the power of the first respondent under section 19(1)(b)(ii) of the Act and was, therefore, null and void and gave a declaration to that effect in favour of the appellant. The trial Judge refused to grant the consequential relief of injunction dated 31st March, 1960.",
      "type": "procedural",
      "date": "1960-03-31",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Aggrieved by the decree passed by the trial Judge the two respondents filed separate appeals in the District Court. The appellant preferred a cross-objection contending that the trial Judge was in error in refusing to grant injunction. The District Judge of Bhavnagar by a common judgment delivered on 12th October, 1963 accepted the contentions urged on behalf of the respondents and allowed the appeals, holding no jurisdiction under s.76(1) and on merits entitled under s.19(1)(b)(ii), dismissed the suit.",
      "type": "procedural",
      "date": "1963-10-12",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "The appellant preferred appeals to the High Court of Gujarat being Civil Second Appeals Nos. 33 and 34 of 1964. Mr. Justice P. N. Bhagwati dismissed the same by a common judgment dated 4th July, 1964. Jurisdiction exists as arbitration waivable, but held s.19(1)(b)(ii) compares actual max demand of licensee with anticipated max demand of consumer.",
      "type": "procedural",
      "date": "1964-07-04",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Right up to the end of December, 1959 the maximum off take of electricity by the second respondent from the appellant was not more than 50 KVA. The maximum demand of the licensee on that period was 291 KVA.",
      "type": "material",
      "date": "1959-12",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the High Court was right in holding that section 19(1)(b)(ii) of the Act prescribed that a comparison must be made between the actual maximum demand of the licensee company and the anticipated maximum demand of the consumer before the Electricity Board can decide to give direct supply to the consumer within the area of supply of the licensee company.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the jurisdiction of the Civil Court to entertain the suit was excluded by reason of s. 76(1) of the Act.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The first respondent was not entitled to give direct supply to the second respondent as the maximum demand of the appellant at the time of request of the second respondent was more than twice the maximum demand asked for by the second respondent. Maximum demand of appellant September 1959 to December 1959 was between 262 to 349 KVA while maximum demand of second respondent never exceeded 40 to 45 KVA.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": "Section 19(1)(b)(ii) of the Electricity Supply Act, 1948"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The decision was legal and proper because the maximum demand of the appellant company at the time of request was less than twice the maximum demand asked for by the second respondent from the first respondent. The demand asked for by the second respondent was 398 KVA.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": "Section 19(1)(b)(ii) of the Electricity Supply Act, 1948"
    },
    {
      "id": "ra2",
      "text": "The jurisdiction of the Civil Court to entertain the suit was excluded by reason of s. 76(1) of the Act.",
      "supporting_facts": [],
      "legal_basis": "Section 76(1) of the Electricity Supply Act, 1948"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The maximum demand as defined in section 2(8) of the Act has relation only to an existing state of facts and there can be no maximum demand in relation to a future period. On a true construction of section 19(1)(b)(ii) what is required to be compared is the maximum demand by the applicant on the licensee at that time and not any hypothetical or anticipated demand.",
      "addresses_issue": "i1",
      "key_observation": "Maximum demand is based on past actual supply and take, per definition in s.2(8); words 'asked for' are descriptive of request, not anticipated demand."
    },
    {
      "id": "cr2",
      "text": "The provision for arbitration under s.76 is not mandatory for individuals' benefit and can be waived; civil court has jurisdiction.",
      "addresses_issue": "i2",
      "key_observation": "Inserted not in interest of public good but for benefit of individuals; either party can waive."
    },
    {
      "id": "cr3",
      "text": "Applicability of clause (ii) restricted to persons taking electricity from licensee; new applicants can use clause (iii) if licensee unable/unwilling.",
      "addresses_issue": "i1",
      "key_observation": "No hardship; no anomaly if construction for appellant accepted."
    },
    {
      "id": "cr4",
      "text": "Right up to end of December 1959, second respondent's maximum offtake not more than 50 KVA; licensee's 291 KVA; conditions of s.19(1)(b)(ii) not satisfied.",
      "addresses_issue": "i1",
      "key_observation": "First respondent not entitled to supply direct."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Section 19(1)(b)(ii) requires comparison of licensee's actual maximum demand (past) with applicant's actual maximum demand on licensee (past), not anticipated demand on Board.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Civil court has jurisdiction; arbitration under s.76(1) waivable.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Electricity (Supply) Act, 1948",
      "sections": [
        "Section 19(1)(b)(ii)",
        "Section 2(8)",
        "Section 76(1)",
        "Section 18",
        "Section 26",
        "Section 49"
      ],
      "relevance": "Governs Board's power to supply directly in licensee's area; defines maximum demand; provides for arbitration; duties and powers of Board."
    },
    {
      "name": "Indian Electricity Act, 1910",
      "sections": [
        "Section 22"
      ],
      "relevance": "Licence duties apply to Board except s.22; Board not obligated to supply unlike licensees."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "The appeals are allowed; judgment of Gujarat High Court dated 4th July 1964 and District Judge dated 12th October 1963 set aside; judgment and decree of Civil Judge Junior Division at Sihor dated 31st March 1960 restored.",
    "relief_granted": "Declaration that GEB's decision to give direct supply is illegal and ultra vires; injunction consequential but trial court refused it.",
    "costs": "Costs in this Court and the High Court."
  },
  "key_quotes": [
    {
      "text": "\"the maximum demand as defined in section 2(8) of the Act has relation only to an existing state of facts and there can be no maximum demand in relation to a future period\"",
      "speaker": "court",
      "significance": "Core interpretation rejecting anticipated demand under s.19(1)(b)(ii)"
    },
    {
      "text": "\"the phrase supplied and taken in section 2(8) of the Act... shows that the ascertainment of maximum demand is dependent upon the electricity, actually supplied and taken in any particular period in the past\"",
      "speaker": "court",
      "significance": "Explains why maximum demand is historical, not prospective"
    }
  ],
  "_case_id": "1969_9",
  "_label": 1,
  "_text_length": 19369,
  "_extracted_at": "2026-02-10T20:24:44.743274"
}