{
  "metadata": {
    "case_name": "Landlord (Appellant) v. Tenant (Respondent)",
    "case_year": 1966,
    "court": "Supreme Court of India",
    "judges": [
      "Hidayatullah, C.J."
    ],
    "case_number": "Civil Appeal No. 499 of 1966",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant (landlord) made application under S. 13 of the East Punjab Urban Rent Restriction Act, 1949 for eviction of respondent (tenant) alleging non-payment of rent for premises from October 1, 1959 to June 30, 1961. Rent was Rs. 32/8/- plus water connection charges Rs. 2/8/-",
      "type": "material",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f2",
      "text": "On first date of hearing, tenant tendered Rs. 292/8/- as rent from October 1, 1960 to June 30, 1961, Rs. 7/- as interest, and Rs. 25/- as costs. Amounts accepted by landlord without prejudice to claim for earlier period",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f3",
      "text": "Tenant made two deposits in Court of Senior Sub-Judge, Ludhiana under s. 31 of East Punjab Relief of Indebtedness Act, 1934: Rs. 210/- on December 23, 1959 and Rs. 210/- on July 18, 1960. Deposits claimed as valid tender of rent",
      "type": "material",
      "date": "1959-12-23",
      "source": "respondent"
    },
    {
      "id": "f4",
      "text": "Deposits under s. 31 were not only of arrears of rent but prospectively for some future period for which rent was not then due",
      "type": "disputed",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Rent Controller held tenant not in default. Order affirmed by Appellate Authority and Punjab High Court on March 18, 1964 in Civil Revision No. 750 of 1962",
      "type": "procedural",
      "date": "1964-03-18",
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "High Court followed earlier decision in Mam Chand v. Chhotu Ram reported in 1 L.R. 1964 1 Pb. 626",
      "type": "background",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Before Supreme Court hearing, respondent objected to special leave alleging inaccurate statements in petition regarding issues before lower courts",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "Supreme Court rejected respondent's objection (C.M.P. No. 64 of 1969) holding no false averment in special leave petition",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether deposit under s. 31 of the East Punjab Relief of Indebtedness Act, 1934 constitutes a valid tender or payment of rent under s. 13 of the East Punjab Urban Rent Restriction Act, 1949 so as to save tenant from eviction",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Deposit under s. 31 of Relief of Indebtedness Act is not a valid tender under s. 13 of Urban Rent Restriction Act. Challenged correctness of High Court decision and earlier decision in Mam Chand v. Chhotu Ram",
      "supporting_facts": [
        "f1",
        "f3",
        "f4"
      ],
      "legal_basis": "S. 13 East Punjab Urban Rent Restriction Act, 1949"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Deposit under s. 31 of Relief of Indebtedness Act was valid tender of rent under s. 13 of Urban Rent Restriction Act",
      "supporting_facts": [
        "f2",
        "f3"
      ],
      "legal_basis": "S. 31 East Punjab Relief of Indebtedness Act, 1934; S. 13 East Punjab Urban Rent Restriction Act, 1949; Mam Chand v. Chhotu Ram"
    },
    {
      "id": "ra2",
      "text": "Special leave should not be granted due to inaccurate, untrue and misleading statements in petition for special leave regarding issues before lower courts",
      "supporting_facts": [
        "f5",
        "f7"
      ],
      "legal_basis": "Hari Narain v. Badri Das; Rajabhai Abdul Rehman Munshi v. Vasudev Dhanjibhai Mody"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "S. 13 of Urban Rent Restriction Act provides only one mode for tenant to save eviction: tender full arrears of rent, interest and costs on first hearing before Rent Controller. No other deposit procedure provided in the Act",
      "addresses_issue": "i1",
      "key_observation": "Act does not lay down any other procedure under which money can be deposited with any Government Authority"
    },
    {
      "id": "cr2",
      "text": "S. 31 of Relief of Indebtedness Act intended for debtors-creditors relations involving interest; not for landlords-tenants where no interest ordinarily payable. Deposit stops interest from running, which is irrelevant for rent",
      "addresses_issue": "i1",
      "key_observation": "Phrase 'any person who owes money' must be read in context of Act as whole, covering cases with interest agreements"
    },
    {
      "id": "cr3",
      "text": "Senior Sub-Judge Court not intended as clearing house for rent. Partial deposits allowed under s. 31 cannot be valid tender for rent. Deposits here included future rent, contrary to s. 19 read with s. 6 of Rent Act prohibiting advance rent recovery",
      "addresses_issue": "i1",
      "key_observation": "Landlords not required to check Senior Sub-Judge Court for tenant deposits"
    },
    {
      "id": "cr4",
      "text": "High Court misunderstood s. 31; Division Bench view contrary to two single Judge decisions of same court preferring narrower interpretation",
      "addresses_issue": "i1",
      "key_observation": "Single Judges' decisions to be preferred"
    },
    {
      "id": "cr5",
      "text": "No gross misstatement in special leave petition; only one issue before all courts",
      "addresses_issue": null,
      "key_observation": "Objection not sustainable unlike Hari Narain and Rajabhai cases"
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Deposit under s. 31 of East Punjab Relief of Indebtedness Act, 1934 does not constitute valid payment or tender under s. 13 of East Punjab Urban Rent Restriction Act, 1949 and does not save tenant from eviction consequences of default",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Mam Chand v. Chhotu Ram",
      "citation": "1 L.R. 1964 1 Pb. 626",
      "treatment": "distinguished",
      "relevance": "Followed by High Court Division Bench but held incorrect; extended view of s. 31 deposit"
    },
    {
      "case_name": "Hari Narain v. Badri Das",
      "citation": "1964 2 S.C.R. 203",
      "treatment": "referred",
      "relevance": "Cited by respondent for denying special leave due to misstatements; distinguished as no gross misstatement here"
    },
    {
      "case_name": "Rajabhai Abdul Rehman Munshi v. Vasudev Dhanjibhai Mody",
      "citation": "1964 3 S.C.R. 480",
      "treatment": "referred",
      "relevance": "Cited by respondent for denying special leave due to misstatements; distinguished"
    }
  ],
  "statutes_cited": [
    {
      "name": "East Punjab Urban Rent Restriction Act, 1949",
      "sections": [
        "S. 13",
        "S. 19",
        "S. 6"
      ],
      "relevance": "Governs eviction for non-payment of rent; only specific tender on first hearing saves tenant; prohibits advance rent recovery"
    },
    {
      "name": "East Punjab Relief of Indebtedness Act, 1934",
      "sections": [
        "S. 31"
      ],
      "relevance": "Allows deposit to stop interest in debtor-creditor relations; not applicable to landlord-tenant rent payments"
    },
    {
      "name": "Punjab Urban Rent Restriction Act, 1947",
      "sections": [
        "S. 13"
      ],
      "relevance": "Mentioned in proviso to S. 13 of 1949 Act"
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed, judgment of Punjab High Court set aside, eviction of tenant ordered with three months time to vacate the premises. Costs throughout borne by respondent.",
    "relief_granted": "Eviction of tenant from premises; three months to vacate",
    "costs": "Costs throughout borne by respondent"
  },
  "key_quotes": [
    {
      "text": "\"The Act does not lay down any other procedure under which money can be deposited with any Government Authority. Such provisions are to be found in other Rent Control Acts but are missing in this Act.\"",
      "speaker": "court",
      "significance": "Explains strict interpretation of s. 13 tender requirement"
    },
    {
      "text": "\"No interest is agreed to be paid by tenants, at any rate, not ordinarily, and, therefore, the section cannot be said to cover a case between a landlord and a tenant.\"",
      "speaker": "court",
      "significance": "Key reason why s. 31 Relief Act inapplicable to rent"
    },
    {
      "text": "\"It could not have been intended that all tenants who may be disinclined to pay rent to their landlords should be enabled to deposit it in the Court of a Senior Sub-Judge making the Senior Sub-Judge, a kind of a Rent Collector for all landlords.\"",
      "speaker": "court",
      "significance": "Rejects broad application of s. 31 to rent disputes"
    }
  ],
  "_case_id": "1969_180",
  "_label": 1,
  "_text_length": 10275,
  "_extracted_at": "2026-02-10T20:26:39.785347"
}