{
  "metadata": {
    "case_name": "Shree Raja Kandregula Srinivasa Jagannadha Rao Panthulu Bahadur v. State of Andhra Pradesh & Ors.",
    "case_year": 1968,
    "court": "Supreme Court of India",
    "judges": [
      "Dua, J."
    ],
    "case_number": "Civil Appeals Nos. 1619 and 1620 of 1968",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Shree Raja Kandregula Srinivasa Jagannadha Rao Panthulu Bahadur was the Inamdar of village Kalipatnam in Narsapuram Taluk in the West Godavari District.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Government issued notification Ex. A-13 dated November 2, 1949 under s. 3(2) of the Madras Estates Land Reduction of Rent Act XXX of 1947 reducing the rates of rent payable in respect of delta dry ryoti lands in Kalipatnam village.",
      "type": "material",
      "date": "1949-11-02",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Inam Settlement Officer, Vijayawada, made order dated May 31, 1950 (Ex. A-1) holding that Kalipatnam was an inam estate as defined in s. 2(7) of the Madras Estates Abolition and Conversion into Ryotwari Act XXVI of 1948.",
      "type": "material",
      "date": "1950-05-31",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Appellant instituted suit challenging validity of Ex. A-13 and Ex. A-1.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Trial Court decreed the suit in part.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Andhra Pradesh High Court by judgment and order dated April 17, 1964 in Appeal Suits Nos. 21 of 1959 and 362 of 1958 held that Civil Courts had no jurisdiction to entertain the suit.",
      "type": "procedural",
      "date": "1964-04-17",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Village Kalipatnam has no wet or garden lands; entire land is delta dry in which wet paddy is raised under Kalipatnam project channel; ryots pay Rs. 51/- per acre water rate to Government (from Ex. B-24).",
      "type": "disputed",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Special Officer compared Kalipatnam with Losaragutlapadu village; relied on settlement register entry for Losaragutlapadu soil; no such entry or soil analysis for Kalipatnam.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "In Statements Ex. B-5 and Ex. B-6 furnished by plaintiff, classification shown as dry though cultivated with double crop of paddy; water from Government project.",
      "type": "admitted",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f10",
      "text": "D.W.5 (Shri J. Sambamurthy) deposed that lands treated as dry; some double crops, small garden extents; Kalipatnam at tail end of delta.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f11",
      "text": "D.W.7 (Shri J. Satyanarayana, Tahsildar) stated lands sanctioned for two crops; water rate increased in 1958.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the Civil Courts have jurisdiction to entertain the suit questioning the legality of notification Ex. A-13 dated November 2, 1949 reducing the rates of rent in respect of delta dry ryoti lands in village Kalipatnam under the Madras Estates Land Reduction of Rent Act XXX of 1947, given s.8 thereof.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Challenge to Ex. A-1 declaring village as inam estate conceded to be incompetent as kind of grant decided by Tribunal under Reduction of Rent Act; any Civil Court finding ignored by Tribunal.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": "Reduction of Rent Act"
    },
    {
      "id": "pa2",
      "text": "Notification Ex. A-13 not made in compliance with s.3(2) as Special Officer failed to determine class of land (wet/dry/garden) under s.2 based on relevant factual inquiry; relied solely on irrelevant settlement register of Losaragutlapadu without evidence of similar soil; lands actually wet as paddy grown, water rate paid.",
      "supporting_facts": [
        "f2",
        "f7",
        "f8",
        "f9",
        "f10",
        "f11"
      ],
      "legal_basis": "ss.2, 3(2) Reduction of Rent Act; principles of natural justice"
    },
    {
      "id": "pa3",
      "text": "High Court observation that proprietor cannot classify as wet without owning water source unsound.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Ex. A-13 made pursuant to s.3(2); covered by s.8(i) barring Civil Court jurisdiction; complete machinery in ss.3A, 3B for rectification.",
      "supporting_facts": [
        "f2"
      ],
      "legal_basis": "ss.3(2), 8 Reduction of Rent Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Appellant conceded challenge to Ex. A-1; left only with Ex. A-13.",
      "addresses_issue": "i1",
      "key_observation": "Question whether Ex. A-13 immune under s.8(i)."
    },
    {
      "id": "cr2",
      "text": "Reduction of Rent Act provides for Special Officer under s.2 to determine average cash rents and assessments for classes of land (wet, dry, garden) based on factual inquiry; s.3(1) Government fixes rates on recommendations; s.8 bars questioning orders under s.3(2).",
      "addresses_issue": "i1",
      "key_observation": "Statutory scheme requires proper determination of land class."
    },
    {
      "id": "cr3",
      "text": "Exclusion of Civil jurisdiction explicit/implied only if compliance with Act and judicial procedure; courts examine non-compliance (Mask & Co., Dhulabhai).",
      "addresses_issue": "i1",
      "key_observation": "Special Officer determination based solely on irrelevant Ex. B-24 (Losaragutlapadu register, no Kalipatnam entry/soil analysis); no rational basis, violates judicial procedure."
    },
    {
      "id": "cr4",
      "text": "Thus Ex. A-13 not in conformity with Act; s.8 inapplicable; Civil Courts have jurisdiction.",
      "addresses_issue": "i1",
      "key_observation": "Notification ultra vires."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Civil Courts have jurisdiction to question Ex. A-13 as not made in compliance with s.3(2); notification struck down as contrary to law and ultra vires.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Secretary of State v. Mask and Company",
      "citation": "1940 67 I.A. 222",
      "treatment": "followed",
      "relevance": "Exclusion of Civil jurisdiction explicit or implied; courts examine non-compliance with Act or judicial procedure."
    },
    {
      "case_name": "Dhulabhai and others v. The State of Madhya Pradesh and another",
      "citation": "1968 3 S.C.R. 662",
      "treatment": "followed",
      "relevance": "Summary of principles: finality to tribunal orders excludes courts only if compliance and adequate remedy; otherwise jurisdiction lies."
    },
    {
      "case_name": "O. K. Muthuswamy Mudaliar Ors. v. State of Madras",
      "citation": null,
      "treatment": "referred",
      "relevance": "Settlement register entry not conclusive; factual irrigation determines land value/class."
    }
  ],
  "statutes_cited": [
    {
      "name": "Madras Estates Land Reduction of Rent Act XXX of 1947",
      "sections": [
        "s.2",
        "s.3",
        "s.3(2)",
        "s.7",
        "s.8"
      ],
      "relevance": "Empowers Special Officer to recommend rent reduction after inquiry into land classes; Government fixes rates; s.8 bars court challenge to valid s.3(2) orders."
    },
    {
      "name": "Madras Estates Abolition and Conversion into Ryotwari Act XXVI of 1948",
      "sections": [
        "s.2(7)"
      ],
      "relevance": "Defines inam estate; challenge to declaration conceded."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeals allowed with costs; report of Special Officer and notification Ex. A-13 struck down as invalid for non-compliance with Act; authorities may proceed afresh; challenge to Ex. A-1 not pressed.",
    "relief_granted": "Notification Ex. A-13 and Special Officer report struck down.",
    "costs": "Costs awarded to appellants."
  },
  "key_quotes": [
    {
      "text": "The determination of the Special Officer is solely based on the settlement register containing no entry in regard to Kalipatnam. This material is irrelevant and cannot constitute a rational basis...",
      "speaker": "court",
      "significance": "Core finding on invalidity due to lack of evidence."
    },
    {
      "text": "Where the statute gives a finality to the orders of the special tribunal the Civil Courts jurisdiction must be held to be excluded if there is adequate remedy... Such provision, however, does not exclude those cases where the provisions of the particular Act have not been complied with...",
      "speaker": "court",
      "significance": "Quotes Dhulabhai principles applied to uphold jurisdiction."
    }
  ],
  "_case_id": "1969_246",
  "_label": 1,
  "_text_length": 25254,
  "_extracted_at": "2026-02-10T20:27:39.011692"
}