{
  "metadata": {
    "case_name": "Appellant (Tenant) v. Respondents 1, 2 and 3",
    "case_year": null,
    "court": "Supreme Court of India",
    "judges": [
      "C. Shah, J."
    ],
    "case_number": null,
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "For many years before 1955 the appellant was a tenant of the Government in respect of a part of a building which was originally evacuee property.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The property was treated as part of the compensation pool and was put up for auction on December 7, 1955. A bid offered by respondents 1, 2 and 3 was accepted by the Government, but no certificate was immediately issued.",
      "type": "material",
      "date": "1955-12-07",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The Managing Officer addressed a letter to respondents 1, 2 and 3 on December 8, 1956 informing them that provisional possession was decided to be given of the property subject to terms and conditions stipulated in the Indemnity Bond and the special affidavit executed by them.",
      "type": "material",
      "date": "1956-12-08",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "One of the conditions was that the respondents were entitled to realise rent from the tenants who were directed to attorn to respondents 1-3 with effect from December, 1956.",
      "type": "material",
      "date": "1956-12",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Pursuant to this direction the respondents collected the rent from the appellant from and after December 4, 1956.",
      "type": "admitted",
      "date": "1956-12-04",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The Delhi Rent Control Act 59 of 1958 was brought into force with effect from some time in the year 1958.",
      "type": "background",
      "date": "1958",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "The first respondent served on the 21st February 1964 a notice on the appellant determining the tenancy and requiring the appellant to deliver possession of the premises in his occupation.",
      "type": "procedural",
      "date": "1964-02-21",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "He thereafter instituted on August 7, 1964 a suit in the Civil Court at Delhi for an order in ejectment.",
      "type": "procedural",
      "date": "1964-08-07",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "The suit was resisted by the appellant contending inter alia that under the provisions of Delhi Rent Control Act, 1958 the suit was not maintainable in the Civil Court and that in any event the notice served upon the appellant did not operate to terminate the tenancy.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f10",
      "text": "These contentions were rejected by the Trial Court and a decree in ejectment was passed.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "The decree was confirmed in appeal to the District Court and in Second Appeal to the High Court.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "By special leave the appellant has appealed to this Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Till the institution of the suit no certificate of sale or any deed conveying title to the property was executed in favour of the respondents by the Government.",
      "type": "material",
      "date": "1964-08-07",
      "source": "court"
    },
    {
      "id": "f14",
      "text": "There is no evidence on the record that the price stipulated to be paid was in fact paid by the respondents before the suit was instituted.",
      "type": "disputed",
      "date": null,
      "source": "court"
    },
    {
      "id": "f15",
      "text": "The appellant did attorn to the respondents.",
      "type": "admitted",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "The principal question which falls to be determined in this appeal is whether the Civil Court had jurisdiction to entertain the suit.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Under the provisions of Delhi Rent Control Act, 1958 the suit was not maintainable in the Civil Court.",
      "supporting_facts": [
        "f6",
        "f8",
        "f13"
      ],
      "legal_basis": "Delhi Rent Control Act, 1958, Section 3 and proviso"
    },
    {
      "id": "pa2",
      "text": "The premises at the date of the institution of the suit did not belong to the Government.",
      "supporting_facts": [
        "f13",
        "f14"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "The premises were let to him by the respondents by virtue of an agreement with the Government or otherwise within the meaning of the proviso.",
      "supporting_facts": [
        "f3",
        "f4",
        "f5",
        "f15"
      ],
      "legal_basis": "Delhi Rent Control Act, 1958, Section 3 proviso"
    },
    {
      "id": "pa4",
      "text": "In any event the notice served upon the appellant did not operate to terminate the tenancy.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The Civil Court had jurisdiction because the premises belonged to the Government.",
      "supporting_facts": [
        "f13"
      ],
      "legal_basis": "Delhi Rent Control Act, 1958, Section 3(a)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Where evacuee property is put up for sale at an auction and the bid is accepted by the Government and price is received by the Government even in the absence of a sale deed executed or a certificate, the purchaser would be deemed to be an owner and not the Government.",
      "addresses_issue": "i1",
      "key_observation": "But no evidence that price was paid, and respondents failed to prove it; documents not considered."
    },
    {
      "id": "cr2",
      "text": "The question whether the consideration has been paid by the respondents to the Government is one of fact within the special knowledge of the respondents. They have not stated in the plaint nor have they attempted to prove that they have paid the consideration.",
      "addresses_issue": "i1",
      "key_observation": "Case does not fall under Section 3(a)."
    },
    {
      "id": "cr3",
      "text": "In any event the case is clearly governed by the proviso to Section 3: premises lawfully let by respondent to the appellant by virtue of agreement with Government.",
      "addresses_issue": "i1",
      "key_observation": "Managing Officer giving provisional possession and direction to attorn amounts to letting."
    },
    {
      "id": "cr4",
      "text": "Direction on the appellants to pay rent to respondent would in effect amount to a direction to attorn to him. Acting in pursuance of the direction of the managing officer after the property had been auctioned to the respondent would in law amount to a letting by the respondent.",
      "addresses_issue": "i1",
      "key_observation": "Not limited to voluntary act."
    },
    {
      "id": "cr5",
      "text": "Facts identical to Shiv Nath case: provisional possession, authorisation to recover rent, tenants directed to attorn, rent received constitutes letting under proviso.",
      "addresses_issue": "i1",
      "key_observation": "Suit not maintainable in Civil Court."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The case does not fall under the terms of Section 3(a) of the Delhi Rent Control Act.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "The case is clearly governed by the proviso to Section 3: lawfully let by the respondents by virtue of agreement with Government, constituting letting.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h3",
      "text": "The suit was not maintainable in the Civil Court.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Bishan Paul v. Mothu Ram",
      "citation": null,
      "treatment": "followed",
      "relevance": "Purchaser deemed owner if bid accepted and price received, even without sale deed or certificate."
    },
    {
      "case_name": "Shiv Nath v. Shri Mela Ram (Civil Appeals Nos. 546 of 1966 and 331 to 334 of 1967)",
      "citation": "D - 25-4-1969 SC",
      "treatment": "followed",
      "relevance": "Identical facts: provisional possession, direction to attorn, rent receipt constitutes letting under proviso to Section 3; jurisdiction with Rent Controller."
    },
    {
      "case_name": "Civil Appeal No. 546 of 1966 SC and companion appeals",
      "citation": null,
      "treatment": "followed",
      "relevance": "Interpreting proviso to Section 3: direction to attorn amounts to letting."
    }
  ],
  "statutes_cited": [
    {
      "name": "Delhi Rent Control Act, 1958 (59 of 1958)",
      "sections": [
        "Section 3",
        "Section 3 proviso",
        "Section 3(a)"
      ],
      "relevance": "Jurisdiction for ejectment suits lies with Rent Controller, not Civil Court, unless premises belong to Government; proviso applies to lettings by persons by virtue of agreement with Government."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "The appeal is allowed as the Civil Court lacked jurisdiction to entertain the ejectment suit under Section 3 and proviso of the Delhi Rent Control Act, 1958; decree of ejectment set aside.",
    "relief_granted": "Suit held not maintainable in Civil Court",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "This Court has held that where evacuee property is put up for sale at an auction and the bid is accepted by the Government and price is received by the Government even in the absence of a sale deed executed or a certificate, the purchaser would be deemed to be an owner and not the Government.",
      "speaker": "court",
      "significance": "Defines when title passes to auction purchaser."
    },
    {
      "text": "Even if it were assumed that the premises belonged to Government it would have to be held in the circumstances of the case, that it was lawfully let by the respondent to the appellants inasmuch as the Managing Officers giving provisional possession of the property to the respondent would really mean delivering symbolical possession of the property to him with the result that a direction on the appellants to pay rent to him would in effect amount to a direction to attorn to him.",
      "speaker": "court",
      "significance": "Interprets 'letting' under proviso to include attornment direction."
    },
    {
      "id": "kq3",
      "text": "In either view of the case the suit was not maintainable in the Civil Court.",
      "speaker": "court",
      "significance": "Core holding on jurisdiction."
    }
  ],
  "_case_id": "1969_146",
  "_label": 1,
  "_text_length": 7218,
  "_extracted_at": "2026-02-10T20:26:03.535497"
}