{
  "metadata": {
    "case_name": "Kanta Kathuria v. Manik Chand Surana",
    "case_year": 1968,
    "court": "Supreme Court of India",
    "judges": [
      "M. Hidayatullah C.J.",
      "G.K. Mitter J.",
      "S.M. Sikri J.",
      "A.N. Ray J.",
      "P. Jaganmohan Reddy J."
    ],
    "case_number": "Civil Appeal No. 1869 of 1968",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Mrs. Kanta Kathuria is an advocate practicing at Bikaner.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Election to Rajasthan Legislative Assembly from Kolayat Constituency held on February 18, 1967; Mrs. Kathuria declared elected on February 22, 1967 with 11926 votes against respondent's 8311 votes.",
      "type": "material",
      "date": "1967-02-18",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "One defeated candidate, Shri Manik Chand Surana, filed Election Petition No. 16 of 1967 questioning election on ground that Mrs. Kathuria held office of Special Government Pleader, an office of profit under Government of Rajasthan on date of nomination and election.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f4",
      "text": "Mrs. Kathuria appointed by Government of Rajasthan as Special Government Pleader on June 26, 1965 vide Ex.1 to conduct arbitration cases between Government and Modern Construction Company Pvt. Ltd. arising out of construction of Rana Pratap Sagar Dam and Jawahar Sagar Dam, along with Shri Murali Manohar Vyas, Government Advocate, Jodhpur.",
      "type": "material",
      "date": "1965-06-26",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Appointment in pursuance of Rule 8(b) of Order XXVII of First Schedule to CPC, 1908 read with clause (7) of Section 2 of the Code.",
      "type": "procedural",
      "date": "1965-06-26",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Remuneration fixed at Rs. 150 per day for hearing, Rs. 75 per day for travel/adjourned/preparation days.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Mrs. Kathuria began appearing from March 27, 1965; paid Rs. 26,325 for work till November 28, 1966 and Rs. 900 from February 26, 1967 to March 2, 1967.",
      "type": "admitted",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "Arbitration proceedings continuing on date of filing election petition and at time of election.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Prior to this employment, Mrs. Kathuria never paid income-tax exceeding Rs. 1200 in any year.",
      "type": "admitted",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f10",
      "text": "Rajasthan High Court (Jagat Narayan J.) allowed election petition on August 12, 1968 holding Mrs. Kathuria disqualified under Article 191.",
      "type": "procedural",
      "date": "1968-08-12",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Appeal filed in Supreme Court on August 20, 1968.",
      "type": "procedural",
      "date": "1968-08-20",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Governor of Rajasthan promulgated Ordinance 3/68 on December 24, 1968 removing disqualification retrospectively for Special Government Pleader etc.; followed by Rajasthan Act No. 5 of 1969 assented April 4, 1969.",
      "type": "material",
      "date": "1969-04-04",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Office first held by Mr. Maneklal Mathur; Mrs. Kathuria appointed to assist Government Advocate in absence of Shri Manak Lal Mathur on suggestion of Government Advocate, approved by Law Minister March 30, 1965.",
      "type": "background",
      "date": "1965-03-30",
      "source": "petitioner"
    },
    {
      "id": "f14",
      "text": "On Sept 3, 1965, fees fixed as share of Rs.150 daily fee of Shri Manak Lal Mathur; on Nov 18, 1965, sanctioned Rs.150 daily to appellant instead.",
      "type": "material",
      "date": "1965-11-18",
      "source": "petitioner"
    },
    {
      "id": "f15",
      "text": "Appellant did not appear Nov 29, 1966 to Feb 25, 1967.",
      "type": "material",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f16",
      "text": "Election petition alleged corrupt practices involving Shri Mathura Dass Mathur (Minister, candidate from different constituency) but he was not joined as party.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the post of Special Government Pleader held by Mrs. Kathuria was an 'office of profit' under the Government of Rajasthan within the meaning of Article 191(1)(a) of the Constitution on the date of nomination and election.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether Rajasthan Act No. 5 of 1969 validly removes the disqualification retrospectively notwithstanding the judgment of the High Court.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether the election petition was defective for non-joinder of Shri Mathura Dass Mathur against whom corrupt practices were alleged, under Section 82(b) of the Representation of the People Act, 1951.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Appointment as Special Government Pleader did not constitute holding an 'office of profit' as it was merely engagement of an advocate to assist in specific arbitration cases, not a subsisting permanent substantive position independent of the holder.",
      "supporting_facts": [
        "f4",
        "f13",
        "f14"
      ],
      "legal_basis": "Article 191(1)(a); Great Western Railway Co. v. Bater; McMillan v. Guest; Statesman Pvt. Ltd. v. H.R. Deb"
    },
    {
      "id": "pa2",
      "text": "Even if an office of profit, disqualification removed retrospectively by Rajasthan Act No. 5 of 1969, which is valid as State Legislature competent to declare offices not disqualifying under Article 191(1)(a).",
      "supporting_facts": [
        "f12"
      ],
      "legal_basis": "Article 191(1)(a); Rajasthan Act 5 of 1969"
    },
    {
      "id": "pa3",
      "text": "Election petition defective as Shri Mathura Dass Mathur not joined as respondent despite allegations of corrupt practices against him; Section 82(b) requires joining candidates at the same election.",
      "supporting_facts": [
        "f16"
      ],
      "legal_basis": "Section 82(b), Representation of the People Act, 1951"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Mrs. Kathuria held office of Special Government Pleader, a substantive position created independently, held successively (previously by Mr. Maneklal Mathur), for profit under State Government.",
      "supporting_facts": [
        "f4",
        "f7",
        "f8",
        "f9"
      ],
      "legal_basis": "Article 191(1)(a); Mahadeo Shantibhai v. Others; Statesman Pvt. Ltd. v. H.R. Deb"
    },
    {
      "id": "ra2",
      "text": "Rajasthan Legislature not competent to remove disqualification retrospectively under Article 191(1)(a) post-election; such validation invalid as disqualification determined by law at time of nomination.",
      "supporting_facts": [
        "f12"
      ],
      "legal_basis": "Article 191(1)(a)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Minority (Hidayatullah CJ): Office of Special Government Pleader created as substantive permanent position independent of holder, successively held, for profit under State; tests from Rowlatt J. in Great Western Railway satisfied.",
      "addresses_issue": "i1",
      "key_observation": "Government created special office for group of arbitration cases, not mere briefing of lawyer."
    },
    {
      "id": "cr2",
      "text": "Majority (Sikri J.): No office as engagement merely to assist in particular cases under Rule 8B Order 27 CPC; no independent existence apart from holder; notification does not create office.",
      "addresses_issue": "i1",
      "key_observation": "'Office' in Article 191 means subsisting permanent substantive position per Rowlatt J., approved in McMillan v. Guest."
    },
    {
      "id": "cr3",
      "text": "Both majority and minority hold Rajasthan Act 5/1969 valid retrospectively; State Legislature empowered under Article 191(1)(a) to declare offices not disqualifying, no constitutional bar to retrospectivity; settled legislative practice.",
      "addresses_issue": "i2",
      "key_observation": "Article 191 contemplates declaration by law; no express/implied prohibition on retrospective effect."
    },
    {
      "id": "cr4",
      "text": "Petition defective for non-joinder; Section 82(b) refers to candidates at same election, not other constituencies.",
      "addresses_issue": "i3",
      "key_observation": "Shri Mathur candidate from different constituency."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Appointment as Special Government Pleader not an 'office of profit' under Article 191(1)(a) (majority); even if so, disqualification removed retrospectively by valid Rajasthan Act 5/1969 (unanimous).",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Rajasthan Act 5/1969 constitutionally valid with retrospective operation under Article 191(1)(a).",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h3",
      "text": "Election petition liable to be dismissed for non-joinder under Section 82(b) RPA 1951.",
      "resolves_issue": "i3",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Statesman Pvt. Ltd. v. H.R. Deb",
      "citation": "1968 3 S.C.R. 614",
      "treatment": "followed",
      "relevance": "Meaning of 'office' as position with attached duties of public character."
    },
    {
      "case_name": "McMillan v. Guest",
      "citation": "1942 A.C. 561",
      "treatment": "followed",
      "relevance": "Definition of 'office' per Lord Wright and approval of Rowlatt J."
    },
    {
      "case_name": "Great Western Railway Co. v. Bater",
      "citation": "8 Tax Cases 231",
      "treatment": "followed",
      "relevance": "Rowlatt J.'s test: subsisting permanent substantive position independent of holder."
    },
    {
      "case_name": "Mahadeo Shantibhai v. Others",
      "citation": "Civil Appeal No. 1832 of 1967 (1969 2 S.C.R. 422)",
      "treatment": "distinguished",
      "relevance": "Panel lawyer watching cases held office of profit; differs from mere assistance in specific case."
    },
    {
      "case_name": "Mitchell v. Ross",
      "citation": "1960 2 All E.R. 238",
      "treatment": "referred",
      "relevance": "Acceptance of Rowlatt J.'s definition by Lords Atkin and Wright."
    },
    {
      "case_name": "Sakhawat Ali v. State of Orissa",
      "citation": "1955 1 S.C.R. 1004",
      "treatment": "referred",
      "relevance": "Legislature may disqualify paid legal practitioners from elections."
    }
  ],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Article 191"
      ],
      "relevance": "Disqualifications for membership including office of profit; State Legislature may declare offices not disqualifying."
    },
    {
      "name": "Representation of the People Act, 1951",
      "sections": [
        "Section 80",
        "Section 82",
        "Section 116A"
      ],
      "relevance": "Election petitions; parties to be joined; appeals from High Court."
    },
    {
      "name": "Code of Civil Procedure, 1908",
      "sections": [
        "Order XXVII Rule 8B",
        "Section 2(7)"
      ],
      "relevance": "Appointment of Government Pleader or Special Government Pleader for suits."
    },
    {
      "name": "Rajasthan Legislative Assembly Members (Prevention of Disqualification) Act, 1969 (Act No. 5 of 1969)",
      "sections": [
        "Sections 3, 4"
      ],
      "relevance": "Declares Special Government Pleader etc. not offices of profit, retrospectively."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed unanimously; High Court judgment and order dated August 12, 1968 set aside; election petition dismissed. Election of Mrs. Kanta Kathuria upheld as no disqualification under Article 191 or removed by retrospective Act 5/1969. Non-joinder also fatal.",
    "relief_granted": "Election petition dismissed; appellant's election declared valid.",
    "costs": "Parties to bear their own costs throughout."
  },
  "key_quotes": [
    {
      "text": "'an office or employment which was a subsisting, permanent, substantive position, which had an existence independent from the person who filled it, which went on and was filled in succession by successive holders'",
      "speaker": "court",
      "significance": "Rowlatt J.'s definition of 'office' adopted by both majority and minority."
    },
    {
      "text": "We would, therefore, hold that the High Court was right in its conclusion that Mrs. Kathuria held an office. Since there is no dispute that it was for profit and under the State, the election of Mrs. Kathuria must be held to be void as she was disqualified to stand for the election.",
      "speaker": "court",
      "significance": "Minority holding on office of profit."
    },
    {
      "text": "It seems to us that the words 'its holder' occurring in Art. 191(1)(a), indicate that there must be an office which exists independently of the holder of the office.",
      "speaker": "court",
      "significance": "Majority reasoning why no office existed."
    },
    {
      "text": "Notwithstanding any judgment or order of any Court or Tribunal, the aforesaid offices shall not disqualify or shall be deemed never to have disqualified the holders thereof...",
      "speaker": "court",
      "significance": "Operative part of Rajasthan Act 5/1969 upheld retrospectively."
    }
  ],
  "_case_id": "1969_240",
  "_label": 1,
  "_text_length": 38113,
  "_extracted_at": "2026-02-10T20:27:38.479286"
}