{
  "metadata": {
    "case_name": "Munni Devi & Anr. v. Gokal Chand",
    "case_year": 1966,
    "court": "Supreme Court of India",
    "judges": [
      "Shah, J."
    ],
    "case_number": "Civil Appeal No. 899 of 1966",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Gokal Chand--first respondent--was a tenant of shop No. 34/2, Dispensary Road, Dehra Dun, which belongs to Munni Devi--the first appellant.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Munni Devi applied to the Rent Control Eviction Officer, Dehra Dun, for an order in ejectment on the plea that Gokal Chand had committed default in paying rent.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "The R.C.E. Officer passed an order observing that the tenant did not lead any evidence to show that he had not vacated the shop and it was clear on the evidence that the tenant was not in occupation of the shop and had let it out to one Alladia. He accordingly declared that the shop was vacant.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f4",
      "text": "The R.C.E. Officer allotted the shop to Kishorilal.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "Kishorilal then applied to the R.C.E. Officer that the shop allotted to him was in the illegal occupation of Rawel Chand s/o Gokal Chand.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "On May 22, 1957, the R.C.E. Officer declared that Gokal Chand the previous tenant had vacated the shop and that Rawel Chand was in illegal occupation of the shop. He accordingly issued a notice under s. 7A(3) of the Act.",
      "type": "procedural",
      "date": "1957-05-22",
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Gokal Chand then filed a civil suit in the Court of the Munsif, Dehra Dun, for a declaration that he was an allottee and a tenant of the shop and that he was in possession in that capacity. To that suit were impleaded Munni Devi and Kishorilal as party defendants.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "The Trial Court held that Gokal Chand had at no time vacated the shop, nor was his tenancy terminated. He accordingly made an order declaring that Gokal Chand was an allottee and a tenant of the shop and was entitled to remain in occupation of the same.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "An appeal against that order to the District Court was dismissed.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "A second appeal to the High Court was also unsuccessful (judgment and decree dated May 14, 1965 in Second Appeal No. 4136 of 1964).",
      "type": "procedural",
      "date": "1965-05-14",
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the civil court had jurisdiction to entertain the suit filed by Gokal Chand, given that the Act sets up a complete machinery for determining vacancy and s.16 provides that no order made by the District Magistrate shall be called in question in any Court.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The suit filed by Gokal Chand was not maintainable, for the Act sets up a complete machinery for determining after enquiry whether any premises governed by the Act have fallen vacant, and for making an order calling upon the person or persons in wrongful occupation to vacate and deliver possession of the premises, and that by express enactment in s.16, the order of the District Magistrate is declared final.",
      "supporting_facts": [
        "f3",
        "f4",
        "f6"
      ],
      "legal_basis": "Sections 7, 7A, 16 of U.P. Temporary Control of Rent and Eviction Act, 1947"
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The Legislature has invested the District Magistrate with power on the existence of a vacancy to allot the premises to another person, but the Legislature has not made the determination of the preliminary state of facts by the District Magistrate conclusive. The jurisdiction to pass an order in ejectment only arises if there is a vacancy. The right of a tenant in possession is a valuable right and there is nothing in s.7 or s.7A which confers jurisdiction upon the District Magistrate to conclusively determine the facts on the existence of which his jurisdiction arises.",
      "addresses_issue": "i1",
      "key_observation": "Whether there is a vacancy is a jurisdictional fact which could not be decided by the District Magistrate finally. By reaching an erroneous decision, he cannot clothe himself with jurisdiction which he does not possess. It is only when the order is with jurisdiction that the order is not liable to be challenged in a Civil Court by virtue of s.16 of the Act."
    },
    {
      "id": "cr2",
      "text": "Cites Lord Esher M.R. in Reg. v. Commissioner of Income-tax: Legislature may entrust tribunal with jurisdiction to determine preliminary facts; if so, no appeal unless provided.",
      "addresses_issue": "i1",
      "key_observation": "Approved in Ebrahim Aboobakar v. Custodian-General."
    },
    {
      "id": "cr3",
      "text": "In Chaube Jagdish Prasad v. Ganga Prasad, civil court could determine facts like new construction despite prior order under s.3A.",
      "addresses_issue": "i1",
      "key_observation": "Similar to present case where court can examine jurisdictional fact of vacancy."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Undoubtedly the District Magistrate has jurisdiction to make orders under ss.7, 7A of the Act, if there be a vacancy. But whether there is a vacancy is a jurisdictional fact which could not be decided by him finally.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Reg. v. Commissioner of Income-tax",
      "citation": "21 Q.B.D. 313",
      "treatment": "followed",
      "relevance": "Explains jurisdiction of inferior tribunals to determine preliminary facts."
    },
    {
      "case_name": "Ebrahim Aboobakar v. Custodian-General of Evacuee Property",
      "citation": "1952 S.C.R. 696",
      "treatment": "followed",
      "relevance": "Approves the rule from Reg. v. Commissioner of Income-tax."
    },
    {
      "case_name": "Chaube Jagdish Prasad v. Ganga Prasad Chaturvedi",
      "citation": null,
      "treatment": "followed",
      "relevance": "Civil court can determine jurisdictional facts like new construction despite prior administrative order."
    }
  ],
  "statutes_cited": [
    {
      "name": "U.P. Temporary Control of Rent and Eviction Act, 1947",
      "sections": [
        "Section 3",
        "Section 7",
        "Section 7A",
        "Section 16"
      ],
      "relevance": "Imposes restrictions on eviction; provides for reporting vacancies, allotment, action against illegal occupation; bars challenge to valid DM orders in court."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court dismissed the appeal by special leave, upholding the civil courts' jurisdiction to examine the jurisdictional fact of vacancy despite s.16 of the Act.",
    "relief_granted": "Declaration that Gokal Chand is allottee and tenant entitled to possession upheld.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"Whether there is a vacancy is a jurisdictional fact which could not be decided by him finally. By reaching an erroneous decision, he cannot clothe himself with jurisdiction which he does not possess.\"",
      "speaker": "court",
      "significance": "Core holding on limits of District Magistrate's jurisdiction."
    },
    {
      "text": "\"No order made under this Act by the State Government or the District Magistrate shall be called in question in any Court.\"",
      "speaker": "court",
      "significance": "Quotes s.16, but clarifies it applies only to orders with jurisdiction."
    }
  ],
  "_case_id": "1969_228",
  "_label": 0,
  "_text_length": 9342,
  "_extracted_at": "2026-02-10T20:26:37.820222"
}