{
  "metadata": {
    "case_name": "Appellant v. Respondents",
    "case_year": 1966,
    "court": "Supreme Court of India",
    "judges": [
      "Hegde, J."
    ],
    "case_number": "Civil Appeal No. 1369 of 1966",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The appellant, the 1st respondent and one Sukh Lal referred their disputes to five arbitrators as per written agreement executed on September 9, 1955.",
      "type": "background",
      "date": "1955-09-09",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Arbitrators made their award on October 11, 1955 and duly served notice of making and signing the award on the parties. The award was thereafter registered.",
      "type": "procedural",
      "date": "1955-10-11",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On November 1, 1955 the appellant filed a suit in the court of Munsiff Hawali Meerut praying that the award be made a rule of the court and decree passed in accordance with the same.",
      "type": "procedural",
      "date": "1955-11-01",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Notice taken in that suit could not be personally served on the defendants as they refused to accept the same. That fact was reported to the court by the process server as per his report dated 19-11-1955.",
      "type": "procedural",
      "date": "1955-11-19",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Defendants filed their written statement on February 3, 1956 challenging validity of the award on grounds of arbitrators' misconduct (decided on personal knowledge), undue influence in obtaining arbitration agreement, subject matter not referable to arbitration under U.P. Act 1 of 1951, and suit barred by time.",
      "type": "disputed",
      "date": "1956-02-03",
      "source": "respondent"
    },
    {
      "id": "f6",
      "text": "Trial court accepted defendants' contention that arbitrators guilty of misconduct, held undue influence not made out, upheld subject matter not referable under U.P. Act 1 of 1951.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "In appeal, Civil Judge reversed trial court: agreed arbitrators used personal knowledge but held agreement permitted it; held dispute arbitrable as question of law; held objections time-barred as not taken within prescribed time.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Allahabad High Court in Civil Revision No. 653 of 1959 dated September 11, 1962 differed from appellate court: held arbitration agreement did not empower arbitrators to use personal knowledge, hence legal misconduct; disputes not referable under U.P. Act 1 of 1951; objections not time-barred.",
      "type": "procedural",
      "date": "1962-09-11",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Sukh Lal died during pendency of proceedings.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Award states: 'We gave our consideration to the entire dispute which is in full knowledge of us, the panchas.'",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "No proof that notice of filing of award into court was given to defendants under Art. 158 Limitation Act, 1908. Plaint does not disclose award produced with it; no copy of award sent with plaint or notice mentioning filing.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Arbitration agreement (material portion translated): 'All the panchas and Sarpanchas are residents of village Keli Pargana Sarawa. The power is given to them that the said Panchas and Sarpanch, whatever decision, in whatever manner will give in relation to our land described below... that will be final...'",
      "type": "material",
      "date": "1955-09-09",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Contention that suit barred by time not pressed before trial court or any other court.",
      "type": "admitted",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether arbitrators committed legal misconduct by deciding disputes on basis of personal knowledge without specific empowerment in arbitration agreement.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether disputes could be referred to arbitration in view of provisions of U.P. Act 1 of 1951.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether objections to award were barred by time under Art. 158 Limitation Act, 1908.",
      "framed_by": "court"
    },
    {
      "id": "i4",
      "text": "Whether High Court could interfere under s. 115 CPC with appellate court's interpretation of arbitration agreement.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Under terms of arbitration agreement, arbitrators were empowered to decide disputes on basis of personal knowledge.",
      "supporting_facts": [
        "f12"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "High Court could not correct erroneous interpretation by appellate court under s. 115 CPC.",
      "supporting_facts": [],
      "legal_basis": "Section 115 Code of Civil Procedure"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Award vitiated by misconduct as arbitrators decided disputes primarily on personal knowledge.",
      "supporting_facts": [
        "f10"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Arbitration agreement obtained by undue influence.",
      "supporting_facts": [],
      "legal_basis": null
    },
    {
      "id": "ra3",
      "text": "Subject matter of dispute could not be referred to arbitration under U.P. Act 1 of 1951.",
      "supporting_facts": [],
      "legal_basis": "U.P. Act 1 of 1951"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Arbitration agreement does not empower arbitrators specifically or by implication to decide on personal knowledge; phrase 'in whatever manner' does not mean that. Proceedings are quasi-judicial, must follow natural justice; parties not informed of arbitrators' personal knowledge or given opportunity to rebut misconceptions.",
      "addresses_issue": "i1",
      "key_observation": "Arbitrators guilty of legal misconduct; award vitiated."
    },
    {
      "id": "cr2",
      "text": "Disputes could not have been referred to arbitration under U.P. Act 1 of 1951.",
      "addresses_issue": "i2",
      "key_observation": "High Court conclusion correct."
    },
    {
      "id": "cr3",
      "text": "No notice of filing award served on defendants; Art. 158 Limitation Act requires service of notice of filing award; objections not barred by time.",
      "addresses_issue": "i3",
      "key_observation": "No proof of notice; suit by party, not arbitrator; award not necessarily filed with plaint."
    },
    {
      "id": "cr4",
      "text": "Arbitration implies decision per ordinary law unless specifically departed from; normally implied term arbitrators decide per ordinary law.",
      "addresses_issue": "i1",
      "key_observation": "Cited Chandris case."
    },
    {
      "id": "cr5",
      "text": "No need to decide s.115 CPC issue as High Court decision eminently just.",
      "addresses_issue": "i4",
      "key_observation": "High Court correct on merits."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Arbitrators committed legal misconduct by using personal knowledge without empowerment in agreement and without affording natural justice.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Disputes not referable to arbitration under U.P. Act 1 of 1951.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Objections to award not barred by limitation absent notice of filing award.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Chandris Isbrandtsen Moller Co. Inc.",
      "citation": null,
      "treatment": "referred",
      "relevance": "Arbitration normally implies decision in accordance with ordinary law unless specifically provided otherwise."
    }
  ],
  "statutes_cited": [
    {
      "name": "U.P. Act 1 of 1951",
      "sections": [],
      "relevance": "Prohibits reference of certain disputes to arbitration; applied to hold disputes not arbitrable."
    },
    {
      "name": "Limitation Act, 1908",
      "sections": [
        "Article 158"
      ],
      "relevance": "30 days from service of notice of filing award to object; no such notice served."
    },
    {
      "name": "Code of Civil Procedure",
      "sections": [
        "Section 115"
      ],
      "relevance": "High Court's revisional jurisdiction; not decided as merits favor High Court."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court upheld Allahabad High Court's decision setting aside the award on grounds of arbitrators' misconduct and non-arbitrability of disputes under U.P. Act 1 of 1951, rejecting appellant's contentions including on limitation and s.115 CPC interference.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "'We gave our consideration to the entire dispute which is in full knowledge of us, the panchas.'",
      "speaker": "court",
      "significance": "Admits arbitrators used personal knowledge, basis for misconduct finding."
    },
    {
      "text": "The proceedings before the arbitrators are quasi-judicial proceedings. They must be conducted in accordance with the principles of natural justice.",
      "speaker": "court",
      "significance": "Core reasoning for holding misconduct due to lack of opportunity to rebut personal knowledge."
    },
    {
      "text": "the decision reached by the High Court is an eminently just one.",
      "speaker": "court",
      "significance": "Affirms High Court's ruling dismissing enforcement of award."
    }
  ],
  "_case_id": "1969_241",
  "_label": 0,
  "_text_length": 9673,
  "_extracted_at": "2026-02-10T20:27:43.366184"
}