{
  "metadata": {
    "case_name": "Karta of Hindu Undivided Family (Appellant) v. Respondents",
    "case_year": 1966,
    "court": "Supreme Court of India",
    "judges": [
      "Shah, J."
    ],
    "case_number": "Civil Appeals Nos. 2436 and 2437 of 1966",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Rajah Padmanabha Ravi Varma was the karta of a Hindu undivided family governed by the Marumakkattayam law.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On his death in 1961 the appellant his brother became the karta of the family.",
      "type": "background",
      "date": "1961",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "In 1909 the members of the family, while remaining joint, had entered into an arrangement for separate enjoyment of certain properties of the family by different members.",
      "type": "background",
      "date": "1909",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "For the assessment year 1958-59 Rajah Padmanabha filed, in the status of a Hindu undivided family, a return under the Expenditure-tax Act of the taxable expenditure incurred by him in respect of the property under his personal control and direct enjoyment.",
      "type": "procedural",
      "date": "1958-59",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The Expenditure-tax Officer added thereto the expenditure incurred by the other members of the family in respect of properties set apart for their use and enjoyment.",
      "type": "material",
      "date": "1958-59",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The Expenditure-tax Officer also served a notice of assessment under s. 15(2) calling for a return of expenditure by the Hindu undivided family for the assessment year 1959-60.",
      "type": "procedural",
      "date": "1959-60",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "The appellant then moved petitions before the High Court of Kerala under Art. 226 of the Constitution for writs quashing the assessment and the notice of demand for the year 1958-59 and the notice calling for a return for the assessment year 1959-60 contending, inter alia, that he was not liable to be assessed to tax on expenditure incurred in respect of property not under his control.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "High Court of Kerala (single Judge) upheld the contention.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "In appeal a Division Bench of the High Court set aside the order of the single Judge.",
      "type": "procedural",
      "date": "1965-11-05",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Marumakkattayam law applied originally by usage to a section of the Hindus inhabiting the South-Western coastal region in India.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Some centuries ago a section of the Hindu inhabitants of North Malabar were converted en masse to Islam, but they still continued to remain governed by the Marumakkattayam law especially in matters of property relations among members of the family.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "The principal incident of Marumakkattayam law is that it is matriarchate members of the family constituting a Marumakkattayam tarwad are descended through a common ancestress in the female line with equal rights in the property of the family.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Under the customary Marumakkattayam law no partition of the family estate may be made, but items of the family property may by agreement be separately enjoyed by the members. On death of the interest of a member devolved by survivorship.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Management of the family property remained in the hands of the eldest male member, and in the absence of a male member a female member.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f15",
      "text": "A tarwad may consist of two or more branches known as thavazhies, each tavazhi or branch consisting of one of the female members of the tarwad and her children and all her descendants in the female line.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f16",
      "text": "The District of Malabar formed part of the State of Madras till October 31, 1956.",
      "type": "background",
      "date": "1956-10-31",
      "source": "court"
    },
    {
      "id": "f17",
      "text": "Madras Marumakkattayam Act, 22 of 1933: only a tarwad could claim partition.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f18",
      "text": "By the Madras Marumakkattayam Amendment Act 26 of 1958 enacted by the Kerala Legislature the right to claim partition was also granted to individual members.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f19",
      "text": "Mappilla Marumakkattayam Act 17 of 1939: any member of a Mappilla tarwad could claim partition (ss.13,14); succession to property obtained by partition was governed by Islamic law (s.18); Karnavan required to maintain inventory (s.3); etc.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f20",
      "text": "Several legislative measures in Travancore-Cochin and Kerala modified customary Marumakkattayam law for Hindus.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f21",
      "text": "Hindu Succession Act 30 of 1956: defined Marumakkattayam law (s.3(h)); devolution by Hindu Succession Act not customary law (s.7); ss.8,10,15,23 apply with modifications (s.17).",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f22",
      "text": "Hindu Adoptions and Maintenance Act 78 of 1956 and Hindu Marriage Act 23 of 1955 apply to Hindus governed by Marumakkattayam law.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f23",
      "text": "Community of Mappillas governed by Marumakkattayam law is a small community restricted to northern area of Malabar District and dwindling.",
      "type": "background",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether Section 3 of the Expenditure-tax Act discriminates on the ground of religion under Article 14 by treating Hindu undivided family governed by Marumakkattayam law as a unit of assessment (higher tax on total expenditure) while treating Mappilla undivided family governed by Marumakkattayam law as an individual (lower tax rate).",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The law which enables the Expenditure-tax Officer to assess tax on the expenditure of all members of the Hindu undivided family governed by the Marumakkattayam law discriminates on the ground of religion between the Hindu undivided family and a Mappilla undivided family governed by the Marumakkattayam law resident in North Malabar, as Hindu family assessed on total expenditure as HUF while Mappilla as individual at lower rate.",
      "supporting_facts": [
        "f1",
        "f2",
        "f10",
        "f11",
        "f23"
      ],
      "legal_basis": "Section 3 Expenditure-tax Act; Article 14 Constitution"
    },
    {
      "id": "pa2",
      "text": "Appellant not liable to be assessed to tax on expenditure incurred in respect of property not under his control.",
      "supporting_facts": [
        "f4",
        "f5",
        "f7"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Under s.3 Expenditure-tax Act, tax imposed on individuals and Hindu undivided families; undivided family of Hindus treated as unit, non-Hindus as individuals.",
      "addresses_issue": "i1",
      "key_observation": "HUF under Marumakkattayam is still Hindu undivided family."
    },
    {
      "id": "cr2",
      "text": "Equal protection does not require absolute equality; tax laws allow reasonable classification; Legislature may select units, rates etc. rationally.",
      "addresses_issue": "i1",
      "key_observation": "No mathematically precise classification required."
    },
    {
      "id": "cr3",
      "text": "Differences between Hindu tarwad (Mitakshara/Marumakkattayam) and Mappilla tarwad due to statutes: partition rights, succession (Hindu Succession Act vs Islamic), management etc.; Mappillas small dwindling community in North Malabar.",
      "addresses_issue": "i1",
      "key_observation": "Laws applicable differ widely justifying classification."
    },
    {
      "id": "cr4",
      "text": "Long legislative history in tax laws (Income-tax from 1869, Wealth-tax, Gift-tax etc.) treats HUF as distinct unit, Mappilla tarwads as individuals; no intent to discriminate on religion.",
      "addresses_issue": "i1",
      "key_observation": "Consistent scheme for effective administration."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Section 3 Expenditure-tax Act does not discriminate under Art.14; reasonable classification upheld; Hindu tarwad is HUF unit of taxation.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Raja Jagannath Baksh Singh v. State of Uttar Pradesh",
      "citation": "1963 1 S.C.R. 220",
      "treatment": "followed",
      "relevance": "Courts will not strike down tax law merely because other objects could have been taxed."
    }
  ],
  "statutes_cited": [
    {
      "name": "Expenditure-tax Act 29 of 1957",
      "sections": [
        "Section 3",
        "Section 15(2)"
      ],
      "relevance": "Charging section; treats HUF as unit of assessment."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 14",
        "Article 226"
      ],
      "relevance": "Equal protection; writ jurisdiction."
    },
    {
      "name": "Madras Marumakkattayam Act 22 of 1933",
      "sections": [
        "s.38"
      ],
      "relevance": "Partition only by tarwad for Hindus."
    },
    {
      "name": "Madras Marumakkattayam Amendment Act 26 of 1958",
      "sections": [
        "s.38(2)"
      ],
      "relevance": "Partition right to individuals for Hindus."
    },
    {
      "name": "Mappilla Marumakkattayam Act 17 of 1939",
      "sections": [
        "ss.13,14",
        "s.18",
        "s.3",
        "s.5(2)",
        "s.7",
        "s.11"
      ],
      "relevance": "Partition by any member, Islamic succession, inventory etc. for Mappillas."
    },
    {
      "name": "Hindu Succession Act 30 of 1956",
      "sections": [
        "s.3(h)",
        "s.7",
        "s.17",
        "ss.8,10,15,23"
      ],
      "relevance": "Modifies devolution in Marumakkattayam tarwads."
    },
    {
      "name": "Hindu Adoptions and Maintenance Act 78 of 1956",
      "sections": [],
      "relevance": "Applies to Marumakkattayam Hindus."
    },
    {
      "name": "Hindu Marriage Act 23 of 1955",
      "sections": [],
      "relevance": "Applies to Marumakkattayam Hindus."
    },
    {
      "name": "Various pre-1956 Acts (Malabar Marriage Act 4/1896, etc.; Cochin/Travancore Acts)",
      "sections": [],
      "relevance": "Modified customary Marumakkattayam law."
    },
    {
      "name": "Income-tax Acts (1869 to 1961), Wealth-tax Act 27/1957, Gift-tax 18/1958, etc.",
      "sections": [],
      "relevance": "Historical treatment of HUF as taxable unit."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeals by special leave against the Kerala High Court Division Bench order upholding the assessment under Expenditure-tax Act are dismissed. No discrimination under Art.14 found in treating Hindu undivided family as unit of taxation vis-a-vis Mappilla tarwads.",
    "relief_granted": null,
    "costs": "Dismissed with costs."
  },
  "key_quotes": [
    {
      "text": "\"The Parliament has declared for the purpose of the Expenditure-tax Act an undivided family of Hindus as a unit of taxation and imposed tax at the rates prescribed.\"",
      "speaker": "court",
      "significance": "Defines scope of s.3; includes Marumakkattayam HUF."
    },
    {
      "text": "\"Equal protection clause of the Constitution does not enjoin equal protection of the laws as abstract propositions.\"",
      "speaker": "court",
      "significance": "Rejects absolute equality in tax classification."
    },
    {
      "text": "\"A taxing statute is not, therefore, exposed to attack on the ground of discrimination merely because different rates of taxation are prescribed for different categories of persons.\"",
      "speaker": "court",
      "significance": "Upholds legislative discretion in taxation."
    }
  ],
  "_case_id": "1969_164",
  "_label": 0,
  "_text_length": 19159,
  "_extracted_at": "2026-02-10T20:26:45.048027"
}