{
  "metadata": {
    "case_name": "Election Petitioner (Appellant) v. Jagat Ram Aryan (Respondent)",
    "case_year": 1968,
    "court": "Supreme Court of India",
    "judges": [
      "Bachawat, J."
    ],
    "case_number": "Civil Appeal No. 1527 of 1968",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Last date for filing nomination papers was January 20, 1967; date of scrutiny was January 23, 1967; poll on February 21, 1967; counting and declaration of result on March 1, 1967.",
      "type": "procedural",
      "date": "1967-01-20",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Candidates who filed nomination papers on January 23, 1967 before Assistant Returning Officer Kahan Singh: (1) Jagat Ram Aryan, (2) Faquir Chand, (3) Narain Dass, (4) Nikka Ram, (5) Bhagat Ram, (6) Om Parkash, (7) Swami Raj.",
      "type": "procedural",
      "date": "1967-01-23",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Returning Officer Abdul Gani on scrutiny accepted nomination papers of Jagat Ram Aryan and Faquir Chand as valid; rejected others for various reasons.",
      "type": "procedural",
      "date": "1967-01-23",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "At poll, contest between Jagat Ram Aryan (Congress candidate) and Faquir Chand (National Conference candidate); Jagat Ram Aryan secured larger number of votes and was declared elected.",
      "type": "material",
      "date": "1967-02-21",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Appellant, a voter in the Bhaderwah Scheduled Caste Assembly Constituency, filed Election Petition No. 33 of 1967 to set aside respondent's election on ground that nomination papers of Narain Dass, Nikka Ram and Bhagat Ram were improperly rejected.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "High Court found nomination paper of Bhagat Ram properly rejected; this finding no longer challenged.",
      "type": "admitted",
      "date": "1968-04-29",
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Nikka Ram's nomination rejected on grounds: (1) did not make/subscribe oath per s.51(a) J&K Constitution, (2) not member of scheduled caste, (3) father's name not correctly shown in electoral rolls.",
      "type": "disputed",
      "date": "1967-01-23",
      "source": "returning_officer"
    },
    {
      "id": "f8",
      "text": "Narain Dass's nomination rejected on grounds: (1) did not make/subscribe oath per s.51(a), (2) not member of scheduled caste.",
      "type": "disputed",
      "date": "1967-01-23",
      "source": "returning_officer"
    },
    {
      "id": "f9",
      "text": "High Court found both Narain Dass and Nikka Ram members of scheduled caste Megh; error in Nikka Ram's father's name in electoral roll not ground for rejection per s.44(4) J&K Representation of People Act, 1957; rejected contention that Narain Dass did not deposit Rs.125 per s.45(2).",
      "type": "background",
      "date": "1968-04-29",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Both Narain Dass and Nikka Ram filed signed oath forms along with nomination papers.",
      "type": "admitted",
      "date": "1967-01-23",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Appellant's case: Narain Dass and Nikka Ram made oaths and signed oath forms in presence of Assistant Returning Officer Kahan Singh at time of presenting nomination papers. Witnesses: Narain Dass, Nikka Ram, Abdul Qayum, Abdul Rehman.",
      "type": "disputed",
      "date": "1967-01-23",
      "source": "petitioner"
    },
    {
      "id": "f12",
      "text": "Respondent's case: Narain Dass and Nikka Ram did not make/subscribe oath before Assistant Returning Officer; oath forms filled and signed before presentation, not in his presence. Witnesses: Kahan Singh (Asst RO), Abdul Gani (RO).",
      "type": "disputed",
      "date": "1967-01-23",
      "source": "respondent"
    },
    {
      "id": "f13",
      "text": "High Court accepted respondent's case; Supreme Court agrees.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Requirement of oath in s.51(a) inserted by Constitution Sixth Amendment Act, 1965; Narain Dass and Nikka Ram possibly unaware.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f15",
      "text": "Instruction No.7(7) in Handbook for Returning Officers: Oath must be made orally before authorized officer then signed; not mere signing. For illiterates, read out and thumb impression. Authorized officer to endorse and give certified copy.",
      "type": "background",
      "date": null,
      "source": "election_commission"
    },
    {
      "id": "f16",
      "text": "Kahan Singh not conversant with instructions; did not ask them to read oath or sign in presence.",
      "type": "material",
      "date": "1967-01-23",
      "source": "court"
    },
    {
      "id": "f17",
      "text": "Oath forms filed by Narain Dass and Nikka Ram bore no endorsement by Asst RO that oath made/subscribed before him; no certified copy furnished.",
      "type": "material",
      "date": "1967-01-23",
      "source": "admitted"
    },
    {
      "id": "f18",
      "text": "Abdul Gani gave opportunity to produce affidavits proving oath; none filed.",
      "type": "procedural",
      "date": "1967-01-23",
      "source": "returning_officer"
    },
    {
      "id": "f19",
      "text": "Narain Dass, Nikka Ram, Abdul Qayum, Abdul Rehman are interested witnesses (Jana Sangh candidates/party men); testimony rejected in favour of Kahan Singh.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f20",
      "text": "Returning Officer and Asst RO authorized by Election Commission Notification No.3/4 J&K/65.",
      "type": "background",
      "date": null,
      "source": "election_commission"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether Narain Dass and Nikka Ram made and subscribed the oath or affirmation as required by s.51(a) of the J&K Constitution.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Nomination papers of Narain Dass and Nikka Ram improperly rejected, particularly for failure to make oath; they made oaths and signed forms in presence of Asst RO.",
      "supporting_facts": [
        "f5",
        "f11"
      ],
      "legal_basis": "s.51(a) J&K Constitution"
    },
    {
      "id": "pa2",
      "text": "Witness testimony proves oaths were made before Asst RO.",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Narain Dass and Nikka Ram did not make or subscribe oath before Asst RO; forms pre-signed and presented.",
      "supporting_facts": [
        "f12",
        "f17"
      ],
      "legal_basis": "s.51(a) J&K Constitution; s.47(2)(a) J&K Representation of People Act, 1957"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "High Court correctly accepted respondent's case; no oath made/subscribed before Asst RO despite signed forms filed; mere filing signed forms insufficient compliance with s.51(a).",
      "addresses_issue": "i1",
      "key_observation": "Absence of endorsement on oath forms and no affidavits produced; interested witnesses' testimony rejected."
    },
    {
      "id": "cr2",
      "text": "Breach of Election Commission instructions by Asst RO does not mean oath was made.",
      "addresses_issue": "i1",
      "key_observation": "On scrutiny date, candidates not qualified under s.51(a); nominations liable to rejection under s.47(2)(a)."
    },
    {
      "id": "cr3",
      "text": "Filing signed oath forms before scrutiny date makes no difference; qualification must exist on scrutiny date per Pashupati Nath v. Harihar Prasad.",
      "addresses_issue": "i1",
      "key_observation": "Candidates not qualified to be chosen on scrutiny date."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Narain Dass and Nikka Ram neither signed oath forms before Asst RO nor made oath/affirmation before him; not in compliance with s.51(a); nominations properly rejected under s.47(2)(a).",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Pashupati Nath v. Harihar Prasad",
      "citation": "1968 2 S.C.R. 812, A.I.R. 1968 S.C. 1064",
      "treatment": "followed",
      "relevance": "Nomination liable to rejection if qualification under Art.173(a) (corr. to s.51(a)) does not exist on scrutiny date, even if signed oath filed earlier."
    }
  ],
  "statutes_cited": [
    {
      "name": "Jammu and Kashmir Constitution",
      "sections": [
        "s.51(a)"
      ],
      "relevance": "Candidate must make and subscribe oath/affirmation before authorized person; qualification required on scrutiny date."
    },
    {
      "name": "Jammu and Kashmir Representation of the People Act, 1957",
      "sections": [
        "s.44(4)",
        "s.45(2)",
        "s.46",
        "s.47(2)(a)",
        "s.123"
      ],
      "relevance": "Presentation/scrutiny of nominations; grounds for rejection including lack of qualification under s.51; deposit; appeal."
    },
    {
      "name": "J&K Representation of the People (Conduct of Election and Election Petition) Rules, 1957",
      "sections": [
        "Form 2A"
      ],
      "relevance": "Form of nomination paper for legislative assembly."
    },
    {
      "name": "Constitution (Sixth Amendment) Act, 1965",
      "sections": [],
      "relevance": "Inserted oath requirement in s.51(a)."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal against High Court judgment dismissing election petition upheld; election of Jagat Ram Aryan from Bhaderwah Scheduled Caste Assembly Constituency not set aside as nominations of Narain Dass and Nikka Ram properly rejected for non-compliance with s.51(a) oath requirement.",
    "relief_granted": "None",
    "costs": "No order as to costs"
  },
  "key_quotes": [
    {
      "text": "\"neither Narain Dass nor Nikka Ram, signed the oath forms before the Assistant Returning Officer nor did they make the oath or affirmation before him.\"",
      "speaker": "court",
      "significance": "Core finding on factual dispute resolving the issue."
    },
    {
      "text": "\"this was not sufficient compliance with the requirement of s.51(a).\"",
      "speaker": "court",
      "significance": "Holds pre-signed oath forms inadequate."
    },
    {
      "text": "\"On the date fixed for the scrutiny of nominations they were not qualified to be chosen to fill the seat in the legislature under s.51(a) of the J&K Constitution and their nomination papers were liable to be rejected under s.47(2)(a)\"",
      "speaker": "court",
      "significance": "Legal consequence of non-compliance."
    }
  ],
  "_case_id": "1969_280",
  "_label": 0,
  "_text_length": 12063,
  "_extracted_at": "2026-02-10T20:27:34.939399"
}