{
  "metadata": {
    "case_name": "Om Prakash v. Lalchand",
    "case_year": 1969,
    "court": "Supreme Court of India",
    "judges": [
      "Ray, J."
    ],
    "case_number": "Civil Appeal No 32 of 1969",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Mid-term election held in May 1968 for Assembly seat from Ellenabad Constituency in District of Hissar.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Polling on 14 May 1968, results announced on 16 May 1968.",
      "type": "procedural",
      "date": "1968-05-14",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Appellant obtained 15,485 votes, respondent Lalchand (returned candidate) secured 20,816 votes, respondent Prithvi Raj obtained 5,726 votes.",
      "type": "material",
      "date": "1968-05-16",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Appellant filed Election Petition No. 14 of 1968 challenging election of Lalchand; dismissed by Punjab and Haryana High Court on 19 November 1968.",
      "type": "procedural",
      "date": "1968-11-19",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Allegation in petition: Sat Guru Jagjit Singh issued farman on or about 20 April 1968 directing Namdhari followers to oppose appellant (son of Choudhury Devi Lal, enemy of Namdhari Guru), threatening ex-communication, non-acceptance of Prasad, spiritual censure as traitors if disobeyed.",
      "type": "disputed",
      "date": "1968-04-20",
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "Allegation in petition: On 21 April 1968, meeting at Sant Nagar where Sat Guru Jagjit Singh convened Dewan of Namdharis, took vow to defeat appellant as son of enemy family, treated as vow by every Namdhari.",
      "type": "disputed",
      "date": "1968-04-21",
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "Respondent Lalchand denied issuance of farman and holding of meeting on 21 April 1968.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "Appellant adduced no documentary evidence for farman or meeting; relied on oral testimony of PW 29 Ram Dayal and PW 30 Parma Nand Sharma.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "PW 29 Ram Dayal: Former MLA, resigned Congress, contested against Choudhury Devi Lal in 1957 and won but unseated; helped Lalchand in 1967 and 1968 elections; testified Sat Guru exhorted Namdharis to vote for Lalchand with warnings; spoke of meeting at Rania on 28 April 1968.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f10",
      "text": "PW 30 Parma Nand Sharma: Testified to meeting at Sant Nagar on 21 April 1968 where Guru directed vote for Lalchand under threat of ex-communication; said he testified for Congress as summoned and spoke truth.",
      "type": "disputed",
      "date": "1968-04-21",
      "source": "petitioner"
    },
    {
      "id": "f11",
      "text": "Exhibit PW 24/2: Diary entry of Gurbhajan Singh dated 21 April 1968 mentioning Sat Guru at Sant Nagar making appeal to vote for Ch. Lalchand but no mention of threats or utterances.",
      "type": "admitted",
      "date": "1968-04-21",
      "source": "petitioner"
    },
    {
      "id": "f12",
      "text": "Exhibits PW 24/1 and PW 24/2: Pamphlets published after 16 May 1968 mentioning meeting.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f13",
      "text": "Allegation: Respondent Lalchand gave Rs. 20,000 cash to Prithvi Raj to contest election (meeting of Kumhars on 30 March 1968 decided to field Kumhar candidate, Prithvi Raj).",
      "type": "disputed",
      "date": "1968-03-30",
      "source": "petitioner"
    },
    {
      "id": "f14",
      "text": "PW 11 Kanshi Ram, PW 12 Jot Ram, PW 13 Rawat (all Kumhars): Testified Bawa Bir Singh paid Rs. 20,000 to Prithvi Raj in presence of Lalchand.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f15",
      "text": "No documentary evidence for Rs. 20,000 payment.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f16",
      "text": "Poster Exhibit PW 1/1 printed at Kwality Art Printers: 10,000 copies; manuscript Exhibit PW 34/2 signed by Lalchand, Muni Lal Azad, Jai Gopal Verma; printed on asking of Lalchand identified by Azad and Verma.",
      "type": "material",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f17",
      "text": "PW 35 Lachhman Das (Manager, Kwality Art Printers): Identified poster and manuscript; printed on request of Lalchand; sent copy to Chief Electoral Officer via Exhibit PW 34/1 received 2 May 1968.",
      "type": "material",
      "date": "1968-05-02",
      "source": "petitioner"
    },
    {
      "id": "f18",
      "text": "PW 36 Jai Gopal Verma, PW 37 Muni Lal Azad: Accompanied Lalchand to press, identified him, signed manuscript.",
      "type": "material",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f19",
      "text": "Exhibit PW 34/1: Letter from press to Chief Electoral Officer dated 2 May 1968 with enclosures PW 34/2 and PW 34/3; proved by PW (Muni Lal Jain).",
      "type": "admitted",
      "date": "1968-05-02",
      "source": "court"
    },
    {
      "id": "f20",
      "text": "Dispute on signature of Lalchand on manuscript: PW 58 Ratan Lal Aggarwal (genuine); RW 2 A.S. Kapoor (forged).",
      "type": "disputed",
      "date": null,
      "source": "court"
    },
    {
      "id": "f21",
      "text": "Content of Exhibit PW 1/1: Appeal alleging appellant (Ch. Partap Singh/Om Prakash, son of Ch. Devi Lal) indulged in smuggling under father's auspices, obnoxious person; urges vote for Lalchand (Rising Sun).",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f22",
      "text": "Witnesses PW 14, 16, 18, 19, 21, 23, 29, 30, 31 testified to distribution and publication of poster.",
      "type": "material",
      "date": null,
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether poster Exhibit PW 1/1 constitutes corrupt practice under section 123(4) of the Representation of the People Act, 1951 (publication of false statement relating to personal character/conduct of candidate, reasonably calculated to prejudice prospects).",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether appeal/farman/speech by Sat Guru Jagjit Singh constitutes corrupt practice under section 123(2) of the Act (appeal to vote on grounds of religion).",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether Lalchand guilty of corrupt practice of bribery under section 123(1) of the Act by giving Rs. 20,000 to Prithvi Raj to contest.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Poster Exhibit PW 1/1 against personal character of appellant (smuggling, obnoxious), constitutes corrupt practice u/s 123(4).",
      "supporting_facts": [
        "f16",
        "f17",
        "f18",
        "f19",
        "f21",
        "f22"
      ],
      "legal_basis": "Section 123(4) of the Representation of the People Act, 1951"
    },
    {
      "id": "pa2",
      "text": "Sat Guru Jagjit Singh issued farman ~20 April 1968 and speech at Sant Nagar 21 April 1968 directing Namdharis to oppose/vote against appellant under threats, attracting s.123(2).",
      "supporting_facts": [
        "f5",
        "f6",
        "f8",
        "f9",
        "f10",
        "f11"
      ],
      "legal_basis": "Section 123(2) of the Representation of the People Act, 1951"
    },
    {
      "id": "pa3",
      "text": "Lalchand gave Rs. 20,000 via Bawa Bir Singh to Prithvi Raj to contest, constituting bribery u/s 123(1).",
      "supporting_facts": [
        "f13",
        "f14",
        "f15"
      ],
      "legal_basis": "Section 123(1) of the Representation of the People Act, 1951"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "No farman issued, no meeting on 21 April 1968; oral evidence unreliable.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "No evidence of Rs. 20,000 gift by candidate/agent/with consent or to induce contesting; no elements of s.123(1).",
      "supporting_facts": [
        "f15"
      ],
      "legal_basis": "Section 123(1) of the Representation of the People Act, 1951"
    },
    {
      "id": "ra3",
      "text": "Poster printed after polling (post 14 May); Lachhman Das not printer/publisher; joined April 1968; receipt/bill books not produced; signature forged; rubber stamp date 22 May 1968 tampered.",
      "supporting_facts": [
        "f20"
      ],
      "legal_basis": "Section 123(4) of the Representation of the People Act, 1951"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Rejected s.123(2) ground: No documentary evidence; oral testimony of PW 29 (biased, supported Lalchand) and PW 30 (antecedents suggest untruthfulness) unreliable/uncorroborated; diary Ex PW24/2 mentions appeal but no threats; post-election pamphlets unreliable.",
      "addresses_issue": "i2",
      "key_observation": "Extremely unsafe to rely on uncorroborated oral testimony of such witnesses; unable to accept meeting/speech as alleged."
    },
    {
      "id": "cr2",
      "text": "Rejected s.123(1) bribery: No evidence gift by candidate/agent/with consent or object to induce standing as candidate; elements not satisfied.",
      "addresses_issue": "i3",
      "key_observation": "No evidence on key elements of offence under s.123(1)."
    },
    {
      "id": "cr3",
      "text": "Accepted s.123(4): Poster Ex PW1/1 printed pre-polling (letter to Electoral Officer 2 May); Lachhman Das disinterested, evidence unchallenged; signatures/witnesses reliable despite expert conflict; content attacks personal character (smuggling, obnoxious); false, published by Lalchand, prejudiced prospects; overwhelming evidence of distribution.",
      "addresses_issue": "i1",
      "key_observation": "Evidence establishes beyond doubt: publication by Lalchand, false statement on personal character/conduct, calculated to prejudice election."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Respondent Lalchand guilty of corrupt practice under section 123(4); election void.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Representation of the People Act, 1951",
      "sections": [
        "123(4)",
        "123(2)",
        "123(1)",
        "116A"
      ],
      "relevance": "Defines corrupt practices; basis for election petition and appeal."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; election of respondent Lalchand set aside on ground of corrupt practice under section 123(4) by publication of false poster attacking appellant's personal character.",
    "relief_granted": "Election petition allowed; election of Lalchand declared void.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"It is extremely unsafe and hazardous to rely on the uncorroborated and isolated oral testimony of such a person.\" (re: PW 29 Ram Dayal)",
      "speaker": "court",
      "significance": "Rejects religious appeal ground due to unreliable witness."
    },
    {
      "text": "\"The evidence in the present case established beyond any measure of doubt first that Exhibit P.W. 1/1 ... was published, secondly, that Lalchand got the same printed and published, thirdly, that the statement was in relation to the personal character and conduct of the appellant, fourthly, the statement is false and fifthly, the same was calculated to prejudice the prospects of the appellants election.\"",
      "speaker": "court",
      "significance": "Core finding upholding corrupt practice under s.123(4)."
    }
  ],
  "_case_id": "1969_216",
  "_label": 1,
  "_text_length": 16466,
  "_extracted_at": "2026-02-10T20:26:45.034843"
}