{
  "metadata": {
    "case_name": "Jagirdar of Pohari Jagir v. State",
    "case_year": 1966,
    "court": "Supreme Court of India",
    "judges": [
      "Mitter, J."
    ],
    "case_number": "Civil Appeal No. 302 of 1966",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The appellant was a Sardar and a Jagirdar in the former Gwalior State. His Jagir known as Pohari Jagir was resumed by the State on December 4, 1952 under the Madhya Bharat Abolition of Jagirs Act, 28 of 1951.",
      "type": "background",
      "date": "1952-12-04",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The appellant received a memorandum from the Jagir Commissioner on February 23, 1958 regarding the compensation payable to him under s. 13 of the Act in respect of the resumption of his jagir.",
      "type": "procedural",
      "date": "1958-02-23",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The memorandum gave the total amount of compensation determined and the deductions to be made therefrom but did not contain the data forming the basis of the calculations nor show how the authority disposed of the appellant's claim to compensation and made its own computation.",
      "type": "material",
      "date": "1958-02-23",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On February 24, 1958 the appellant applied to the Jagir Commissioner for a copy of the judgment.",
      "type": "procedural",
      "date": "1958-02-24",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The application for copy of the judgment was returned to the appellant on March 11, 1958 with an endorsement that the same could be had on payment of fees.",
      "type": "procedural",
      "date": "1958-03-11",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "On March 12, 1958 the appellant applied for a copy of the judgment after paying the fees mentioned and a copy of the judgment was given to him on March 18, 1958.",
      "type": "procedural",
      "date": "1958-03-12",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "The appellant preferred his appeal to the Board of Revenue on June 2, 1958.",
      "type": "procedural",
      "date": "1958-06-02",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "The Board of Revenue threw out the appeal on the ground that it was barred by time under s. 29 of the Act without going into the merits.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Madhya Pradesh High Court, Gwalior Bench in Misc. Civil Petition 64 of 1961 by order dated November 13, 1962 refused to quash the order of the Board of Revenue under Art. 227 of the Constitution.",
      "type": "procedural",
      "date": "1962-11-13",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Appeal by special leave to Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the appeal to the Board of Revenue was barred by time under s. 29 of the Madhya Bharat Abolition of Jagirs Act, 1951, particularly whether the time taken in obtaining a copy of the judgment of the Jagir Commissioner can be excluded from the period of 90 days.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the provisions of the Limitation Act, 1908 apply to appeals before the Board of Revenue under the Jagirs Act via ss. 30, 34 and 149(2) of the Ryotwari Act.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The memorandum did not contain the data or basis for calculations, so a copy of the judgment was necessary to formulate grounds of appeal; time taken to obtain copy should be excluded under Limitation Act principles.",
      "supporting_facts": [
        "f2",
        "f3",
        "f4",
        "f5",
        "f6",
        "f7"
      ],
      "legal_basis": "Limitation Act, 1908 ss. 5, 12, 29(2); s. 29 Jagirs Act"
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Neither Government nor Jagirdar can file effective appeal without copy of judgment showing how decision under s.13 was arrived at; memorandum insufficient.",
      "addresses_issue": "i1",
      "key_observation": "Memorandum merely showed amount payable but not computation or disposal of claims."
    },
    {
      "id": "cr2",
      "text": "No express provision in Jagirs Act for condonation, but s.30 incorporates Ryotwari Act procedure; ss.34 and 149(2) of Ryotwari Act apply Limitation Act provisions including extension and computation of limitation period.",
      "addresses_issue": "i2",
      "key_observation": "Principles of Limitation Act apply; s.12 excludes time for obtaining copy."
    },
    {
      "id": "cr3",
      "text": "Agree with MP HC in Brijrajsingh that 'principles of limitation' means extension of period; even if literal, principle allows extension if delay explained.",
      "addresses_issue": "i2",
      "key_observation": "Word 'principle' due to inept drafting; meant 'period'."
    },
    {
      "id": "cr4",
      "text": "Appellant not guilty of laches; applied for copy next day after memorandum; even if from March 12-18, delay minimal (1-2 days); Board failed to consider condonation.",
      "addresses_issue": "i1",
      "key_observation": "Board did not act judicially."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Time spent in obtaining copy of judgment forming basis of decision under s.13 should be excluded in computing 90 days under s.29 of Jagirs Act.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Provisions of Limitation Act ss.4-25 including s.12 apply to appeals under Jagirs Act via Ryotwari Act.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h3",
      "text": "Board of Revenue erred in dismissing appeal on limitation without considering exclusion of time or condonation; did not act judicially.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Brijrajsingh v. The Board of Revenue and another",
      "citation": null,
      "treatment": "followed",
      "relevance": "Held that 'principles of limitation' in s.149(2) Ryotwari Act means extension of period of limitation."
    }
  ],
  "statutes_cited": [
    {
      "name": "Madhya Bharat Abolition of Jagirs Act, 1951",
      "sections": [
        "3",
        "4",
        "5",
        "8",
        "12",
        "13",
        "14",
        "29",
        "30"
      ],
      "relevance": "Governs resumption of jagirs, compensation determination by Jagir Commissioner, appeal to Board within 90 days of communication of decision; no express condonation but incorporates Ryotwari procedure."
    },
    {
      "name": "Revenue Administration and Ryotwari Land Revenue and Tenancy Act, Samvat 2007",
      "sections": [
        "34",
        "149(2)"
      ],
      "relevance": "Procedure for proceedings under Jagirs Act; applies Limitation Act for extension and computation of limitation."
    },
    {
      "name": "Limitation Act, 1908",
      "sections": [
        "3",
        "4 to 25",
        "5",
        "12",
        "29(2)"
      ],
      "relevance": "Applies to appeals; s.12 excludes time for obtaining copy; s.5 for condonation; s.29(2) for special laws."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "227"
      ],
      "relevance": "High Court jurisdiction invoked to quash Board order."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "The Supreme Court allowed the appeal by special leave, holding that the Board of Revenue failed to act judicially by not excluding time taken to obtain copy of judgment or considering condonation of minimal delay, and the High Court erred in upholding the Board's order.",
    "relief_granted": "Set aside High Court order; implied remand or direction for Board to hear appeal on merits.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "In order that an appeal may be effective the appellant must be able to formulate his grounds for challenging the judgment which has gone against him.",
      "speaker": "court",
      "significance": "Explains necessity of copy of judgment for effective appeal."
    },
    {
      "text": "the time spent in obtaining a copy of the judgment forming the basis or giving the reasons of the decision should have been excluded in computing the period of 90 days under s. 29 of the Jagirs Act.",
      "speaker": "court",
      "significance": "Core holding on exclusion of time under Limitation Act s.12."
    },
    {
      "text": "The Board of Revenue had not acted judicially in throwing out the appeal.",
      "speaker": "court",
      "significance": "Justifies intervention against Board's order."
    }
  ],
  "_case_id": "1969_293",
  "_label": 1,
  "_text_length": 12342,
  "_extracted_at": "2026-02-10T20:27:33.700629"
}