{
  "metadata": {
    "case_name": "Civil Appeals Nos. 1954 and 1955 of 1966",
    "case_year": 1966,
    "court": "Supreme Court of India",
    "judges": [
      "Hegde, J."
    ],
    "case_number": "Civil Appeals Nos. 1954 and 1955 of 1966",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The suit properties are the stridhana properties of Barji.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Barji died in September 1950. Her husband Patu Ram predeceased her around 1904.",
      "type": "background",
      "date": "1950-09",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Patu Ram's father Bool Chand and brothers Tulsi Ram, Behari Lal and Hira Lal predeceased Barji.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Patu Ram and Barji had a son Jugal Kishore who predeceased Patu Ram, leaving widow Bindri who died in 1931 with no children.",
      "type": "background",
      "date": "1931",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Radha Kishan, the adopted son of Patu Ram and Barji, died about 20 years before Barji's death, leaving widow (defendant No. 6) and children including defendants Nos. 1 to 3 through another wife.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Radha Kishan's son Roshanlal died a few months before Barji's death. His daughter Balwanti predeceased Barji leaving children defendants 4 and 5.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Tulsi Ram's son Prahlad Rai predeceased Barji leaving widow defendant No. 8 and son defendant No. 7.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "By the time of Barji's death, all children of Behari Lal and Hira Lal had died but some had children and grandchildren.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "After Barji's death, properties came into possession of defendant No. 6.",
      "type": "procedural",
      "date": "1950-09",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Defendant No. 1 sued for possession claiming she and sisters are preferential heirs; Amar Nath not impleaded, application rejected; dispute referred to arbitration which upheld claim of defendants Nos. 1 to 3.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Amar Nath (plaintiff) brought present suit claiming exclusive entitlement to suit properties.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Trial court accepted claim of defendants Nos. 1 to 3.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "High Court held plaintiff exclusively entitled as nearest heir.",
      "type": "procedural",
      "date": "1963-05-30",
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "Properties are not sulka and Barji was married in approved form.",
      "type": "admitted",
      "date": null,
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "whether the daughters of a pre-deceased son of a Hindu Woman are entitled to succeed to her stridhana?",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "After son's son come son's daughters. Alternatively, expression 'sons son' includes son's daughter.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": "Interpretation of Mitakshara (Colebrooke translation)"
    },
    {
      "id": "pa2",
      "text": "List in Mitakshara is illustrative not exhaustive; 'without issue' means without progeny including son's daughter; propinquity is test so husband's brother's son cannot prefer over son's daughters.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": "Yajnyawalcya text; Vijnyaneswara commentary; Mitakshara"
    },
    {
      "id": "pa3",
      "text": "In view of Hindu Woman's Rights to Property Act XVIII of 1937, defendants 1 to 3 are nearer heirs.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": "Hindu Woman's Rights to Property Act, 1937"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Rules of succession in paragraph 147 of Mulla's Principles of Hindu Law are exhaustive; defendants Nos. 1 to 3 not entitled; plaintiff is preferential heir as nearest in degree.",
      "supporting_facts": [
        "f1",
        "f14"
      ],
      "legal_basis": "Paragraph 147 Mulla's Hindu Law; Mitakshara"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Proceed on basis that properties are stridhana of Barji married in approved form; order of succession in para 147 applies if correct and exhaustive.",
      "addresses_issue": "i1",
      "key_observation": "Order till 'sons son' well settled."
    },
    {
      "id": "cr2",
      "text": "Rules based on Yajnyawalcya and elaborated in Mitakshara (Colebrooke translation); after items 1-7 (son's son), goes to husband then his heirs.",
      "addresses_issue": "i1",
      "key_observation": "Colebrooke translation accurate, relied by Judicial Committee and High Courts."
    },
    {
      "id": "cr3",
      "text": "Reject contention that list illustrative or 'progeny' includes son's daughter beyond specified; opposed to commentaries and century of decisions; children do not take as body.",
      "addresses_issue": "i1",
      "key_observation": "Propinquity not sole test for stridhana succession."
    },
    {
      "id": "cr4",
      "text": "'Sons son' does not include son's daughter as daughters daughter precedes daughters son.",
      "addresses_issue": "i1",
      "key_observation": "Masculine includes feminine rule inapplicable."
    },
    {
      "id": "cr5",
      "text": "Cases cited by petitioners (Patna HC on maiden, Bali Kesserbai on sapinda) not relevant; 1937 Act applies only to separate property of Hindu male, not female's stridhana.",
      "addresses_issue": "i1",
      "key_observation": "Confirmed by Annagouda case on similar Act 11 of 1929."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Daughters of pre-deceased son not entitled to succeed to stridhana; succession follows exhaustive order in para 147 of Mulla; after son's son, to husband then his heirs; plaintiff exclusively entitled as nearest heir.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Bhimacharya Bin Venkappacharya v. Ramcharya Bin Bhimacharya",
      "citation": "I.L.R 33 Bom. 452",
      "treatment": "followed",
      "relevance": "Translation of Mitakshara accords with Colebrooke."
    },
    {
      "case_name": "Kumar Raghava Surendra Sahi v Babui Lachmi Kuer",
      "citation": "1939 I.L.R. 18 Pat. 690; L.R. 33 I.A. 176",
      "treatment": "distinguished",
      "relevance": "Relates to stridhana of maiden, not married woman."
    },
    {
      "case_name": "Bali Kesserbai v. Hunsraj Morarji",
      "citation": null,
      "treatment": "distinguished",
      "relevance": "On scope of placita 9 regarding sapindas, not on issue."
    },
    {
      "case_name": "Annagouda Nathgouda Patil v. Court of Wards",
      "citation": "1952 S.C.R. 208",
      "treatment": "followed",
      "relevance": "Act 11 of 1929 (similar to 1937 Act) does not apply to stridhana of Hindu female."
    }
  ],
  "statutes_cited": [
    {
      "name": "Hindu Woman's Rights to Property Act, XVIII of 1937",
      "sections": [
        "Section 3(1)"
      ],
      "relevance": "Applies only to separate property of Hindu male dying intestate, not to stridhana of Hindu female."
    },
    {
      "name": "Act 11 of 1929",
      "sections": null,
      "relevance": "Similar to 1937 Act; governs only separate property of Hindu male, not female's property."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court upheld Punjab High Court judgment holding plaintiff Amar Nath exclusively entitled to Barji's stridhana as nearest heir among husband's heirs; claims of defendants Nos. 1 to 3 and other contesting defendants rejected.",
    "relief_granted": "Plaintiff exclusively entitled to suit properties",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The question of law that arises for decision in these appeals by certificate is whether the daughters of a pre-deceased son of a Hindu Woman are entitled to succeed to her stridhana?",
      "speaker": "court",
      "significance": "Frames the core legal issue."
    },
    {
      "text": "It is not well settled that stridhana of a Hindu woman governed by Mitakshara passes in the order mentioned in Mitakshara and the children of the deceased woman do not take the same as a body either jointly or as tenants-in-common.",
      "speaker": "court",
      "significance": "Key holding on exhaustive nature of succession order."
    },
    {
      "text": "Propinquity is not the sole or even the principal test in the matter of succession to stridhana.",
      "speaker": "court",
      "significance": "Rejects argument based on nearness of blood."
    }
  ],
  "_case_id": "1969_231",
  "_label": 0,
  "_text_length": 18533,
  "_extracted_at": "2026-02-10T20:27:40.910936"
}