{
  "metadata": {
    "case_name": "Appellant v. Respondents",
    "case_year": 1968,
    "court": "Supreme Court of India",
    "judges": [
      "Hegde, J."
    ],
    "case_number": "Civil Appeal No. 1426 of 1968",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "On August 8, 1966, the appellant applied to the R.T.A. Coimbatore for a permit to ply a stage carriage on the route Bhavani to Vellithiruppur.",
      "type": "background",
      "date": "1966-08-08",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "That was entirely a new route. No stage carriage was plying on that route at that time.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The R.T.A. published that application under s. 57(3) of the Act.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Respondents Nos. 2-3 and others made representations against that application contending that there was no need to grant a stage carriage permit for that route.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f5",
      "text": "The R.T.A. overruled their objection and granted the permit asked for on October 9, 1967.",
      "type": "procedural",
      "date": "1967-10-09",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "As against the order of the R.T.A. some of the objectors went up in appeal to the State Transport Appellate Tribunal, Madras.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "The Additional State Transport Appellate Tribunal allowed the appeal by its order of February 22, 1968 holding that the procedure adopted by the R.T.A. was not in accordance with law inasmuch as it had failed to determine the question of the need for a service in that route before entertaining the application for a stage carriage permit.",
      "type": "procedural",
      "date": "1968-02-22",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "The appellant challenged that order before the High Court of Madras in Writ Petition No. 908 of 1968.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "The High Court dismissed that application on April 16, 1968.",
      "type": "procedural",
      "date": "1968-04-16",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Hence this appeal by certificate.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "The scope of s. 47(3) of the Motor Vehicles Act, 1939: whether the determination as to the number of stage carriages required on a route should be done at a stage anterior to that of entertaining applications for stage carriage permits or that it could be done at the time it considers applications made by operators for stage carriage permits in that route.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Sub-s. (3) of s. 57 of the Act is wide enough to allow competing operators to apply for the route in question when the first applicant's application is published and representations called for.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": "Section 57(3) of the Motor Vehicles Act, 1939"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The procedure adopted by the R.T.A. was not in accordance with law inasmuch as it had failed to determine the question of the need for a service in that route before entertaining the application for a stage carriage permit. The procedure adopted by the R.T.A. contravened s. 47(3) of the Act.",
      "supporting_facts": [
        "f1",
        "f5",
        "f7"
      ],
      "legal_basis": "Section 47(3) of the Motor Vehicles Act, 1939"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "If ss. 47 and 57 of the Act are read together it appears to us to be clear that the view taken by the Appellate Tribunal and the High Court is the correct view.",
      "addresses_issue": "i1",
      "key_observation": "Contrary view will throw open the door for manipulations and nepotism. There may be possibility of the personality of the applicant influencing the decision of the R.T.A. on the question of need for a stage carriage permit in the route and thereby public interest which should be the main consideration while taking a decision under s. 47(3) may suffer."
    },
    {
      "id": "cr2",
      "text": "We are unable to accept this contention. That sub-section merely permits representations to be made in respect of the application published. Such representations cannot take the form of competing applications.",
      "addresses_issue": "i1",
      "key_observation": "If at the time of making his representation an operator can also make an application for a stage carriage permit for that route, that application again will have to be published under s. 57(3) and objections called for. Extending the logic... at the time of making representations to those applications, further applications can be made. This may turn out to be an unending chain."
    },
    {
      "id": "cr3",
      "text": "On an examination of the relevant provisions of the Act and the purpose behind ss. 47, and 57, we are convinced that before granting a stage carriage permit two independent steps have to be taken. Firstly there should a determination by the R.T.A. under s.47(3) of the number of stage carriages for which stage carriage permits may be granted in that route. Thereafter applications for stage carriage permits in that route should be entertained.",
      "addresses_issue": "i1",
      "key_observation": "The R.T.A. is not competent to grant stage carriage permits for more carriages than fixed under s.47(3)."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The R.T.A. must first determine under s.47(3) the number of stage carriages for which stage carriage permits may be granted in the route before entertaining applications.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "M/s. Jaya Ram Motor Service v. S. Rajarathinam and ors.",
      "citation": "Civil Appeal No. 95 of 1965 (decided on 27-10-1967)",
      "treatment": "followed",
      "relevance": "The scheme of sec. 47 is that... the Authority first considers it under sec. 47(1)... then fixes under sec. 47(3)... Sec. 47 envisages two stages of the inquiry: (i) the fixing of the number of permit under s. 47(3) and (ii) the consideration thereafter of the application for grant of a permit."
    },
    {
      "case_name": "Abdul Mateen v. Ram Kailash Pandey",
      "citation": null,
      "treatment": "referred",
      "relevance": "The Authority may modify the limit fixed by it under sec. 47(3) but once such a limit is fixed, it cannot ignore it while considering the applications before it under sec. 48."
    }
  ],
  "statutes_cited": [
    {
      "name": "Motor Vehicles Act, 1939",
      "sections": [
        "47(1)",
        "47(2)",
        "47(3)",
        "48(1)",
        "57(3)"
      ],
      "relevance": "Prescribes procedure for RTA in considering applications for stage carriage permits; requires prior determination of number of permits under s.47(3) before entertaining applications under s.57(3)"
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal is dismissed, upholding the Madras High Court's dismissal of the writ petition and the Tribunal's order setting aside the RTA's grant of permit for failure to follow s.47(3) procedure.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "On an examination of the relevant provisions of the Act and the purpose behind ss. 47, and 57, we are convinced that before granting a stage carriage permit two independent steps have to be taken.",
      "speaker": "court",
      "significance": "Core holding on the two-stage process under the Act"
    },
    {
      "text": "if contrary view is taken it will throw open the door for manipulations and nepotism.",
      "speaker": "court",
      "significance": "Reason for rejecting RTA's approach to protect public interest"
    }
  ],
  "_case_id": "1969_18",
  "_label": 0,
  "_text_length": 12880,
  "_extracted_at": "2026-02-10T20:24:45.257368"
}