{
  "metadata": {
    "case_name": "Income-tax Authorities v. Respondent Firm",
    "case_year": 1966,
    "court": "Supreme Court of India",
    "judges": [
      "Shah, J."
    ],
    "case_number": "Civil Appeal No. 2456 of 1966",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "In determining the taxable income of the respondent firm for the assessment year 1948-49 the Income-tax Officer added to the income returned a sum of Rs. 1,60,000 as undisclosed receipts.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The order adding Rs. 1,60,000 was confirmed in appeal by the Appellate Assistant Commissioner, and by the Tribunal.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The Income-tax Officer commenced a proceeding for the levy of penalty and under s. 28(1)(c) of the Indian Income-tax Act, 1922 directed the respondent firm to pay Rs. 60,000 as penalty.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The Appellate Assistant Commissioner confirmed the penalty order in appeal.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The Income-tax Appellate Tribunal rejected the contention of the respondent that the order imposing penalty upon the firm after the original firm was dissolved was without jurisdiction.",
      "type": "procedural",
      "date": null,
      "source": "tribunal"
    },
    {
      "id": "f6",
      "text": "The Tribunal referred the following question to the High Court of Patna: Whether on the facts and in the circumstances of the case the imposition of penalty under s. 28(1)(c) of the Indian Income-tax Act, upon the petitioner firm (respondent) as constituted at the time of levy of penalty was legal and valid?",
      "type": "procedural",
      "date": null,
      "source": "tribunal"
    },
    {
      "id": "f7",
      "text": "The firm which carried on the business during the calendar year 1947 was dissolved on July 7, 1951 when Butto Kristo Roy, one of the partners, died.",
      "type": "background",
      "date": "1951-07-07",
      "source": "tribunal"
    },
    {
      "id": "f8",
      "text": "During the previous year 1947 there was no instrument of partnership in existence, but the terms of the oral partnership were the same as set out in the partnership deed dated October 17, 1949.",
      "type": "background",
      "date": "1947",
      "source": "tribunal"
    },
    {
      "id": "f9",
      "text": "The business of the firm was continued with effect from July 8, 1951 by the new firm as successor to the business of the old firm. The terms of the partnership were the same as set out in the deed dated October 17, 1949 and the partners and their shares were also the same except that Baidyanath Roy took the place of Butto Kristo Roy.",
      "type": "background",
      "date": "1951-07-08",
      "source": "tribunal"
    },
    {
      "id": "f10",
      "text": "With effect from April 28, 1952, the business was carried on by a partnership constituted by Baidyanath Roy and Bijali Kanti Roy under an instrument dated August 27, 1952.",
      "type": "background",
      "date": "1952-04-28",
      "source": "tribunal"
    },
    {
      "id": "f11",
      "text": "There was no dissolution of the firm, which was carrying on the business; there was only a change in the constitution of the old firm from April 28, 1952.",
      "type": "background",
      "date": "1952-04-28",
      "source": "tribunal"
    },
    {
      "id": "f12",
      "text": "The High Court held that penalty could be legally levied only upon the original firm constituted in the account year relevant to the assessment year 1948-49 and not upon the new firm constituted under the deed dated April 27, 1952.",
      "type": "procedural",
      "date": "1964-01-27",
      "source": "patna_high_court"
    },
    {
      "id": "f13",
      "text": "Penalty was levied on July 30, 1954.",
      "type": "procedural",
      "date": "1954-07-30",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether on the facts and in the circumstances of the case the imposition of penalty under s. 28(1)(c) of the Indian Income-tax Act, upon the petitioner firm (respondent) as constituted at the time of levy of penalty was legal and valid?",
      "framed_by": "tribunal"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The Tribunal and the High Court erred in assuming that the source of power to impose penalty was s.44 of the Indian Income-tax Act, 1922; instead, ss.26 and 28 apply to cases of reconstitution.",
      "supporting_facts": [
        "f7",
        "f9",
        "f10",
        "f11"
      ],
      "legal_basis": "Sections 26(1), 26(2), 28(1)(c), Indian Income-tax Act, 1922"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The order imposing penalty upon the firm after the original firm was dissolved was without jurisdiction.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "Section 44, Indian Income-tax Act, 1922"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Section 44 applies only to cases of discontinuance of the business of a firm and not where there is dissolution of the firm but no discontinuance of its business.",
      "addresses_issue": "i1",
      "key_observation": "The Tribunal and High Court erred in assuming s.44 applied."
    },
    {
      "id": "cr2",
      "text": "Mere dissolution of a firm without discontinuance of the business will not attract s.44; cases of reconstitution are covered by s.26(1), succession by s.26(2).",
      "addresses_issue": "i1",
      "key_observation": "A firm is a unit of assessment independent of partners; it survives reconstitution."
    },
    {
      "id": "cr3",
      "text": "Assessment under Chapter IV includes imposition of penalty under s.28; on reconstitution, penalty imposed on the firm as constituted at the time under s.26 read with s.28.",
      "addresses_issue": "i1",
      "key_observation": "Whether new partners liable for failure of original partners was not investigated before Tribunal and High Court."
    },
    {
      "id": "cr4",
      "text": "In a reference under s.66, only questions raised or argued before Tribunal may be answered.",
      "addresses_issue": "i1",
      "key_observation": "The specific question does not permit enquiry into s.26 liability."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Section 44 does not apply to reconstitution without discontinuance; ss.26(1),(2) and 28 govern penalty on reconstituted firm.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Appeal fails as the reference question limits scope; broader issue under s.26 not argued before Tribunal.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "S. M. S. Karuppiah Pillai v. Commissioner of Income-tax, Madras",
      "citation": "51 I.T.R. 823",
      "treatment": "followed",
      "relevance": "S.44 applies only on discontinuance of business, not mere dissolution."
    },
    {
      "case_name": "Shivram Poddar v. Income-tax Officer, Central Circle II, Calcutta",
      "citation": null,
      "treatment": "followed",
      "relevance": "Explains scheme of s.44, its relation to ss.25,26,28; s.44 not for reconstitution or succession."
    },
    {
      "case_name": "C. A. Abraham v. Income-tax Officer, Kottayam",
      "citation": "41 I.T.R. 425",
      "treatment": "referred",
      "relevance": "S.44 applies where discontinuance follows dissolution; penalty part of assessment."
    },
    {
      "case_name": "Commissioner of Income-tax, Madras v. S. V. Angidi Chettiar",
      "citation": "44 I.T.R. 739",
      "treatment": "followed",
      "relevance": "ITO can impose penalty under s.44 with s.28 on firm discontinued on partner's death."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act, 1922",
      "sections": [
        "s. 28(1)(c)",
        "s. 44",
        "s. 26(1)",
        "s. 26(2)",
        "s. 25(1)",
        "s. 3",
        "s. 23(3),(4)",
        "s. 66"
      ],
      "relevance": "Governs assessment, penalty imposition on firms, including reconstituted or successor firms; s.44 limited to discontinuance."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal against the Patna High Court judgment is dismissed, as the reference question was limited and did not permit consideration of liability under s.26 read with s.28, which was not argued before the Tribunal.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "Section 44 is fairly plain it applies to cases of discontinuance of the business of a firm and not where there is dissolution of the firm but no discontinuance of its business.",
      "speaker": "court",
      "significance": "Clarifies scope of s.44."
    },
    {
      "text": "A firm whether registered or unregistered is recognised under the Act as a unit of assessment... it invests the firm with a personality which survives reconstitution.",
      "speaker": "court",
      "significance": "Explains firm's independent status for assessment."
    },
    {
      "text": "The appeal fails and is dismissed.",
      "speaker": "court",
      "significance": "Final disposition upholding High Court on procedural grounds."
    }
  ],
  "_case_id": "1969_37",
  "_label": 0,
  "_text_length": 11554,
  "_extracted_at": "2026-02-10T20:25:19.286311"
}