{
  "metadata": {
    "case_name": "Controller of Estate Duty v. Estate of Purnabai Sagarmal Mody",
    "case_year": 1967,
    "court": "Supreme Court of India",
    "judges": [
      "Shah, Ag. C.J."
    ],
    "case_number": "Civil Appeal No. 438 of 1967",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Purnabai widow of Sagarmal Mody held on April 1, 1953 three deposit receipts of the aggregate face value of Rs. 6,26,724-14-0 with the State Bank of Bikaner.",
      "type": "background",
      "date": "1953-04-01",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "By her letter dated July 22, 1952 Purnabai informed the Bank that she intended to make a gift of the amounts of two out of the three receipts to Suryakant son of her adopted son Satyanarayana, and requested that the receipts be renewed for three months in the joint names of Purnabai Sagarmal Mody and or Surya Kant S. Mody--payable to either or survivor.",
      "type": "material",
      "date": "1952-07-22",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Pursuant to this letter two fresh receipts were issued on August 3, 1953 for Rs. 5,00,000 and Rs. 45,793/4/-.",
      "type": "material",
      "date": "1953-08-03",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "A receipt for Rs. 80,931 10/- was previously obtained in the joint names of Purnabai and Suryakant on July 4, 1953.",
      "type": "material",
      "date": "1953-07-04",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "On August 16, 1953 Purnabai executed a deed of gift in favour of Suryakant in respect of the three receipts containing recitals that out of natural love and affection she hands over the Fixed Deposit Receipts total for Rs. 6,26,724/14/- to Satyanarayana as father and natural guardian of Suryakant, and Satyanarayana accepted the gift.",
      "type": "material",
      "date": "1953-08-16",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The gift deed contained a confirmation by Satyanarayana that he had accepted the gift for and on behalf of Suryakant to the intent that Suryakant shall be the absolute owner.",
      "type": "material",
      "date": "1953-08-16",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "On August 17, 1953 Purnabai addressed a letter to the Manager of the Bank enclosing a copy of the declaration of gift and intimated that her grand-son Suryakant was the sole owner of the amount of the two fixed deposit receipts and till Suryakant attained majority the receipts should remain in the joint names.",
      "type": "material",
      "date": "1953-08-17",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "From time to time Purnabai presented the receipts for renewal when they matured and obtained fresh receipts in the joint names of herself and Suryakant.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "On August 25, 1955 the receipt for Rs. 80,931/10/- was encashed and out of the amount of Rs. 86,732/- realized, Rs. 5,000/- were invested in the name of Suryakant in National Savings Certificates. The balance was deposited with a firm in Bombay in the name of Suryakant alone.",
      "type": "material",
      "date": "1955-08-25",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Purnabai died on February 15, 1956.",
      "type": "material",
      "date": "1956-02-15",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "After Purnabai's death, the two receipts were encashed by Suryakant.",
      "type": "material",
      "date": "1956",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Assistant Controller of Estate Duty held that possession and enjoyment of the gifted property was not assumed by the donee to the entire exclusion of the donor, and included the amounts in Purnabai's estate; for the third receipt, included due to within two years of death.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Central Board of Revenue confirmed the order, holding Purnabai had right to receive money and discharged receipts alone.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "Board referred question to Rajasthan High Court: Whether sum of Rs. 6,85,193/- correctly included under s.10.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f15",
      "text": "Rajasthan High Court answered affirmatively on April 11, 1966.",
      "type": "procedural",
      "date": "1966-04-11",
      "source": "lower_court"
    },
    {
      "id": "f16",
      "text": "Appeal to Supreme Court with certificate.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether on the facts and in the circumstances of the case the sum of Rs. 6,85,193/- was correctly included in the estate of the deceased as property deemed to pass on her death under section 10 of the Estate Duty Act, 1953?",
      "framed_by": "lower_court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Fixed deposit receipts were held by Purnabai in her name as benamidar for Suryakant.",
      "supporting_facts": [
        "f2",
        "f5",
        "f7"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Purnabai did everything possible to divest herself of her interest, retained no interest, and in obtaining renewals acted as benamidar or on behalf of Suryakant.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Bank having notice of gift could not have parted with money except for benefit of minor.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "Imperial Bank of India, Madras v. Krishnamurthi"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "At all material times Purnabai had right to receive money from Bank by discharge, and discharged receipts alone; property not held by donee to entire exclusion of donor.",
      "supporting_facts": [
        "f8",
        "f12",
        "f13"
      ],
      "legal_basis": "Section 10, Estate Duty Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Deposit receipts renewed in joint names till August 25, 1955; payable to either or survivor; Purnabai continued to obtain in joint names, presumably not parting with control.",
      "addresses_issue": "i1",
      "key_observation": "Purnabai had authority to withdraw without consulting guardian."
    },
    {
      "id": "cr2",
      "text": "Section 10 deems gift to pass on death unless bona fide possession and enjoyment immediately assumed by donee and retained to entire exclusion of donor or benefit to him.",
      "addresses_issue": "i1",
      "key_observation": "Phraseology involved but purport clear."
    },
    {
      "id": "cr3",
      "text": "Conduct of Purnabai indicates no intention to part with control; renewed in joint names post-gift; presented alone for renewal; could receive moneys excluding Suryakant.",
      "addresses_issue": "i1",
      "key_observation": "Bona fide possession and enjoyment not immediately assumed by Suryakant to entire exclusion of Purnabai."
    },
    {
      "id": "cr4",
      "text": "Right retained by Purnabai to have receipts in joint names and power to recover without concurrence of Suryakant shows she retained benefits.",
      "addresses_issue": "i1",
      "key_observation": "Third receipt encashed within two years of death, liable under Act."
    },
    {
      "id": "cr5",
      "text": "No evidence receipts in possession of Satyanarayana exclusively or Purnabai acted as guardian/benamidar.",
      "addresses_issue": "i1",
      "key_observation": "High Court right in answering against appellant."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Bona fide possession and enjoyment of the gifted property was not immediately assumed by the donee Suryakant and retained to the entire exclusion of Purnabai; amounts correctly included in estate under s.10.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Imperial Bank of India, Madras v. Krishnamurthi",
      "citation": "A.I.R. 1933 Madras 628",
      "treatment": "referred",
      "relevance": "Bank with notice of trust liable if pays out inconsistently with fiduciary duty; distinguished as not deciding if bank could refuse Purnabai."
    }
  ],
  "statutes_cited": [
    {
      "name": "Estate Duty Act, 1953",
      "sections": [
        "Section 10"
      ],
      "relevance": "Property taken under gift deemed to pass on donor's death unless bona fide possession and enjoyment immediately assumed by donee to entire exclusion of donor; proviso for subsequent enjoyment for two years."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court upheld the Rajasthan High Court's affirmative answer to the reference question, confirming inclusion of Rs. 6,85,193/- in Purnabai's estate under s.10 of Estate Duty Act as property deemed to pass on death.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"bona fide possession and enjoyment of it was not immediately assumed by the donee and thenceforward retained to the entire exclusion of the donor or of any benefit to him by contract or otherwise\"",
      "speaker": "court",
      "significance": "Core test under s.10 for exclusion from estate duty."
    },
    {
      "text": "The deposit receipts were renewed on several occasions even after the execution of the deed of gift in the joint names of Purnabai and Suryakant. Purnabai alone presented the fixed deposit receipts for renewal.",
      "speaker": "court",
      "significance": "Evidence donor retained control, negating exclusion."
    }
  ],
  "_case_id": "1969_202",
  "_label": 0,
  "_text_length": 14032,
  "_extracted_at": "2026-02-10T20:26:43.865456"
}