{
  "metadata": {
    "case_name": "Kalianna Gounder v. Palani Gounder & T.P. Sengottaiah",
    "case_year": 1966,
    "court": "Supreme Court of India",
    "judges": [
      "Shah, J."
    ],
    "case_number": "Civil Appeal No. 1360 of 1966",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Palani Gounder and his son T.P. Sengottaiah (defendants) own Survey No. 765-B in Kugallur village.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Kalianna Gounder (plaintiff) agreed on July 4, 1956 to purchase the land from defendants for Rs. 12,000.",
      "type": "material",
      "date": "1956-07-04",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Memorandum executed reciting Rs. 2,000 paid as advance by plaintiff to defendants; within 60 days plaintiff to pay balance and execute sale deed; failing that, loses advance and nothing binding.",
      "type": "material",
      "date": "1956-07-04",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Memorandum written by Ramamurthy Iyer, signatures attested by Kaliyanna Gounder.",
      "type": "procedural",
      "date": "1956-07-04",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "On July 7, 1956, defendants informed plaintiff by letter that only Rs. 350 paid, not Rs. 2,000; balance Rs. 1,650 promised within three days not paid; agreement cancelled.",
      "type": "material",
      "date": "1956-07-07",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Plaintiff instituted suit for specific performance, deposited Rs. 10,000 in court (balance purchase price). Received letter on July 14, 1956, sued same day.",
      "type": "procedural",
      "date": "1956-07-14",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Defendants' written statement: Urgent need of money; agreed to sell; only Rs. 350 paid on July 4, 1956; plaintiff obtained possession of memorandum on representation to pay balance Rs. 1,650 within three days; not paid, cancelled. Agreement altered by adding 'Clear the debts and execute the sale deed free from encumbrance'.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "Plaintiff is illiterate agriculturist; defendants educated, second defendant President of Local Panchayat.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Plaintiff pleaded in para 6 of plaint that defendants under evil influence and instigation of Karuppa Gounden, Pongia Goundar and Appachi Gounder (planning to have property) evading contract.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f10",
      "text": "Plaintiff stated pangalis inimical to him offered Rs. 16,000, inducing defendants to resile.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f11",
      "text": "No relation of trust or confidence between plaintiff and defendants.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "No discussion at execution about encumbrances on land; no evidence of subsisting encumbrances.",
      "type": "background",
      "date": "1956-07-04",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Words 'Clear the debts and execute the sale deed free from encumbrance' written in cramped style before schedule, after first three paragraphs; ink possibly different shade; Ramamurthy Iyer explained ink from different pen due to exhaustion.",
      "type": "disputed",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Trial Court (Court of First Instance) decreed suit for specific performance, accepted plaintiff's testimony and Ramamurthy Iyer.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f15",
      "text": "Madras High Court (Appeal No. 351 of 1958, judgment January 19, 1962) reversed: Only Rs. 350 paid; obtained on representation; not paid balance; altered in material particulars; suit not maintainable.",
      "type": "procedural",
      "date": "1962-01-19",
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the plaintiff paid Rs. 350 only as contended by the defendants on July 4, 1956, and obtained possession of the agreement on a false representation.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the memorandum was altered in material particulars after execution, and was on that account discharged.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Paid full Rs. 2,000 on July 4, 1956 to defendants.",
      "supporting_facts": [
        "f2",
        "f3"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Supported by witness Ramamurthy Iyer (writer). Defendants resiled due to better offer from inimical pangalis (Rs. 16,000) and instigation.",
      "supporting_facts": [
        "f9",
        "f10"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "No alteration; words written contemporaneously; even if later, not material as vendors duty to clear encumbrances.",
      "supporting_facts": [
        "f13"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Only Rs. 350 paid on July 4, 1956; obtained possession of memorandum on representation to pay balance Rs. 1,650 within three days; not paid, agreement cancelled.",
      "supporting_facts": [
        "f5",
        "f7"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Agreement altered in material particulars after execution by adding words 'Clear the debts and execute the sale deed free from encumbrance'.",
      "supporting_facts": [
        "f7",
        "f13"
      ],
      "legal_basis": null
    },
    {
      "id": "ra3",
      "text": "Supported by T.P. Sengottaiah and attesting witness Kaliyanna Gounder.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Dispute resolved by considering conflicting testimony in light of broad probabilities. Memorandum recites Rs. 2,000 received; delivered to illiterate plaintiff; defendants educated; unlikely to part with memo on bare promise without endorsement. Burden on defendants to prove not paid. Plaintiff deposited Rs. 10,000 soon after. No need for source evidence due to recital. Failure to reply to notice explained by suit filing same day. Plea of instigation sufficient. Ramamurthy Iyer's testimony reliable.",
      "addresses_issue": "i1",
      "key_observation": "Story of only Rs. 350 paid untrue, excuse to resile."
    },
    {
      "id": "cr2",
      "text": "No original document, but evidence shows words not added later materially: cramped style, position in doc, Ramamurthy's explanation of ink. Even if added post-execution, not material as no discussion of encumbrances, none proven, vendor's duty to clear. Cites Halsbury and Nathu Lal v. Mussamat Gomti Kuar: alteration not varying rights/liabilities/legal effect not material.",
      "addresses_issue": "i2",
      "key_observation": "Alteration, if any, not material."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Plaintiff paid Rs. 2,000 as recited; no false representation.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "No material alteration in memorandum discharging it.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h3",
      "text": "Suit for specific performance maintainable; decree trial court.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Nathu Lal and Ors. v. Mussamat Gomti Kuar and Others",
      "citation": "L.R. 67 I.A. 318",
      "treatment": "followed",
      "relevance": "Material alteration defined as varying rights, liabilities or legal position; applied to hold added encumbrance clause not material."
    }
  ],
  "statutes_cited": [],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; decree of High Court set aside; decree of Trial Court restored with costs in this Court and High Court.",
    "relief_granted": "Specific performance of agreement decreed.",
    "costs": "Costs in this Court and in the High Court."
  },
  "key_quotes": [
    {
      "text": "The memorandum expressly recites that the defendants have received Rs. 2,000 as advance and within sixty days from today the plaintiff should pay the balance of the sale price and execute the sale deed.",
      "speaker": "court",
      "significance": "Basis for preferring plaintiff's case on payment."
    },
    {
      "text": "A material alteration is one which varies the rights, liabilities, or legal position of the parties as ascertained by the deed in its original state.",
      "speaker": "court",
      "significance": "Definition applied to reject alteration plea."
    },
    {
      "id": "kq3",
      "text": "The broad probabilities of the case strongly support his testimony. Having carefully considered the evidence we are of the view that the story of the defendants that only Rs. 350 were paid to them on July 4, 1956, and not Rs. 2,000 as recited in the memorandum is untrue.",
      "speaker": "court",
      "significance": "Core finding overturning High Court."
    }
  ],
  "_case_id": "1969_103",
  "_label": 1,
  "_text_length": 13819,
  "_extracted_at": "2026-02-10T20:25:59.636288"
}