{
  "metadata": {
    "case_name": "Manohar Lal (Proprietor of Jai Jai Ram Manohar Lal) v. National Building Material Supply, Gurgaon",
    "case_year": 1966,
    "court": "Supreme Court of India",
    "judges": [
      "Shah, J."
    ],
    "case_number": "Civil Appeal No. 697 of 1966",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "On March 11, 1950, Manohar Lal s/o Jai Jai Ram commenced an action in the Court of the Subordinate Judge, Nainital, for a decree for Rs. 10,139/12/- being the value of timber supplied to the defendant National Building Material Supply, Gurgaon. The action was instituted in the name of Jai Jai Ram Manohar Lal, which was the name in which the business was carried on. The plaintiff Manohar Lal subscribed his signature at the foot of the plaint as Jai Jai Ram Manohar Lal, by the pen of Manohar Lal, and the plaint was also similarly verified.",
      "type": "material",
      "date": "1950-03-11",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The defendant by its written statement contended that the plaintiff was an unregistered firm and on that account incompetent to sue.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f3",
      "text": "On July 18, 1952, the plaintiff applied for leave to amend the plaint. Manohar Lal stated that the business name of the plaintiff is Jai Jai Ram Manohar Lal and therein Manohar Lal the owner and proprietor is clearly shown and named. It is a joint Hindu family business and the defendant and all knew it that Manohar Lal whose name is there along with the father's name is the proprietor of it. The name is not an assumed or fictitious one. The plaintiff on those averments applied for leave to describe himself in the cause title as Manohar Lal proprietor of Jai Jai Ram Manohar Lal and in paragraph 1 to state that he carried on the business in timber in the name of Jai Jai Ram Manohar Lal. Apparently no reply was filed to this application by the defendant.",
      "type": "procedural",
      "date": "1952-07-18",
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "The Subordinate Judge granted leave to amend the plaint. He observed that there was no doubt that the real plaintiff was Manohar Lal himself, that it was Manohar Lal who intended to file and did in fact file the action, and that the amendment was intended to bring what in effect had been done in conformity with what in fact should have been done.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "The defendant then filed a supplementary written statement raising two additional contentions: 1) that Manohar Lal was not the sole owner of the business and that his other brothers were also the owners of the business; and 2) that in any event the amendment became effective from July 18, 1952, and on that account the suit was barred by the law of limitation.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f6",
      "text": "The Trial Judge decreed the claim for Rs. 6,568/6/3.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Against that decree an appeal was preferred to the High Court of Allahabad in First Appeal No. 257 of 1953. The High Court being of the view that the action was instituted in the name of a non-existing person and Manohar Lal having failed to aver in the application for amendment that the action was instituted in the name of Jai Jai Ram Manohar Lal on account of some bona fide mistake or omission, the Subordinate Judge was incompetent to grant leave to amend the plaint.",
      "type": "procedural",
      "date": "1964-11-09",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "The High Court held that the suit instituted by the joint Hindu family business in the name of an assumed business title was a suit by a person who did not exist and was therefore a nullity. Hence there could be no amendment of the description of such a plaintiff who did not exist in the eye of law.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "The High Court was also of the opinion that the substitution of the name of Manohar Lal as a plaintiff during the pendency of the action took effect from July 18, 1952, and the action must be deemed to be instituted on that date; the amendment could not take effect retrospectively and on the date of the amendment the action was barred by the law of limitation.",
      "type": "disputed",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "The plaintiff has appealed to this Court with special leave.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the suit instituted in the name of Jai Jai Ram Manohar Lal (a business name of a joint Hindu family) was a nullity as by a non-existing person, and whether the amendment substituting Manohar Lal as proprietor was permissible.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the amendment application required an averment of bona fide mistake for it to be granted.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether the amendment took effect from the date of amendment (July 18, 1952), rendering the suit barred by limitation.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The business name Jai Jai Ram Manohar Lal is not assumed or fictitious; Manohar Lal is the proprietor and owner of the joint Hindu family business, and the defendant knew this.",
      "supporting_facts": [
        "f1",
        "f3"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "The plaintiff was carrying on business as commission agent in the name of Jai Jai Ram Manohar Lal and was competent to sue in his own name as Manager of the Hindu undivided family.",
      "supporting_facts": [
        "f3",
        "f10"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The plaintiff was an unregistered firm and on that account incompetent to sue.",
      "supporting_facts": [
        "f2"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Manohar Lal was not the sole owner of the business and that his other brothers were also the owners of the business.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": null
    },
    {
      "id": "ra3",
      "text": "The amendment became effective from July 18, 1952, and on that account the suit was barred by the law of limitation.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": "law of limitation"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Rules of procedure are intended to be a handmaid to the administration of justice. A party cannot be refused just relief merely because of some mistake, negligence, inadvertence or even infraction of the rules of procedure.",
      "addresses_issue": "i1",
      "key_observation": "Court always gives leave to amend unless mala fide or injury to opponent not compensable by costs."
    },
    {
      "id": "cr2",
      "text": "The question whether there should be an amendment or not really turns upon whether the name in which the suit is brought is the name of a non-existent person or whether it is merely a misdescription of existing persons. If the former, the suit is a nullity; if the latter, prima facie amendment ought to be allowed.",
      "addresses_issue": "i1",
      "key_observation": "Cited Amulakchand Mewaram case."
    },
    {
      "id": "cr3",
      "text": "In Purushottam Umedbhai case, a plaint filed in the name of a firm doing business outside India is not a nullity but a plaint by partners with defective description, amendable under s.153 CPC or O.VI r.17.",
      "addresses_issue": "i1",
      "key_observation": "Suit here is misdescription, not nullity."
    },
    {
      "id": "cr4",
      "text": "There is no rule that unless in an application for amendment it is expressly averred that the error is due to bona fide mistake, the Court has no power to grant leave.",
      "addresses_issue": "i2",
      "key_observation": "Power to amend serves ends of justice, not governed by narrow technical limitations."
    },
    {
      "id": "cr5",
      "text": "Since the name was merely a misdescription of the original plaintiff, no question of limitation arises; the plaint must be deemed on amendment to have been instituted in the name of the real plaintiff on the original date.",
      "addresses_issue": "i3",
      "key_observation": "Amendment relates back to original institution date."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "All amendments should be permitted as necessary for determining the real question in controversy, unless injustice to the other side.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Suit in business name of joint Hindu family is misdescription of real plaintiff (proprietor/manager), not nullity; amendment permissible.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h3",
      "text": "No requirement for averment of bona fide mistake in amendment application.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h4",
      "text": "Amendment of misdescription relates back; suit instituted on original date, not barred by limitation.",
      "resolves_issue": "i3",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Purushottam Umedbhai and Company v. Messrs. Manilal and Sons",
      "citation": "1961 1 S.C.R. 982",
      "treatment": "followed",
      "relevance": "Plaint in firm name outside India is misdescription, not nullity; amendable to correct description."
    },
    {
      "case_name": "Amulakchand Mewaram and others v. Babulal Kanalal Taliwala",
      "citation": "35 Bom. L.R. 569",
      "treatment": "followed",
      "relevance": "Suit in joint family business name is misdescription of existing persons; amendment should be allowed."
    }
  ],
  "statutes_cited": [
    {
      "name": "Code of Civil Procedure",
      "sections": [
        "O. XXX",
        "s. 153",
        "O. VI r. 17"
      ],
      "relevance": "O.30 does not permit suit in firm name for non-Indian firms; s.153/O.VI r.17 allow amendment of misdescription."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed, decree of High Court set aside. Trial Court's order granting amendment upheld as correct; High Court erred in dismissing suit on technicality. Since High Court did not deal with merits, implied restoration of trial court decree. Defendant to pay costs in Supreme Court and High Court.",
    "relief_granted": "Decree of trial court for Rs. 6,568/6/3 restored implicitly; costs awarded to appellant.",
    "costs": "Defendant to pay costs in this Court and the High Court."
  },
  "key_quotes": [
    {
      "text": "\"Rules of procedure are intended to be a handmaid to the administration of justice. A party cannot be refused just relief merely because of some mistake, negligence, inadvertence or even infraction of the rules of procedure.\"",
      "speaker": "court",
      "significance": "Core principle justifying amendment despite procedural defects."
    },
    {
      "text": "\"The question whether there should be an amendment or not really turns upon whether the name in which the suit is brought is the name of a non-existent person or whether it is merely a misdescription of existing persons.\"",
      "speaker": "court",
      "significance": "Distinguishes nullity from amendable misdescription, key to decision."
    },
    {
      "text": "\"Since the name in which the action was instituted was merely a misdescription of the original plaintiff, no question of limitation arises.\"",
      "speaker": "court",
      "significance": "Resolves limitation issue by relation back doctrine."
    }
  ],
  "_case_id": "1969_285",
  "_label": 1,
  "_text_length": 11466,
  "_extracted_at": "2026-02-10T20:27:30.663482"
}