{
  "metadata": {
    "case_name": "Plaintiff v. Defendant",
    "case_year": 1969,
    "court": "Supreme Court of India",
    "judges": [
      "Hegde, J."
    ],
    "case_number": "Civil Appeal No. 1953 of 1969",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Suit properties originally belonged to the family of one Veerbaswantji Rao Deshmukh.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Veerbaswantji Rao Deshmukh died in 1892 without male issues, leaving behind his widow Ratnabai and a daughter Lakshmibai.",
      "type": "background",
      "date": "1892",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Ratnabai succeeded to the estate of her husband and died in 1924.",
      "type": "background",
      "date": "1924",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On Ratnabai's death, Lakshmibai became entitled to the suit properties.",
      "type": "background",
      "date": "1924",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Parwatibai alias Prayag Bai took unlawful possession of the suit properties.",
      "type": "disputed",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Lakshmibai instituted a suit for possession against Parwatibai in the court of Sadar Adalath, Gulbarga, and obtained a decree.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "In execution of the decree, Lakshmibai obtained delivery of the lands described in Schedule II to the plaint.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Lakshmibai died in 1948.",
      "type": "background",
      "date": "1948",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Sometime after Lakshmibai's death, Parwatibai also died.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "The defendant, claiming to be the sister's son of Veerbaswanth Rao Deshmukh, got himself impleaded as the legal representative of Lakshmibai in the execution proceedings and sought delivery of the lands in Schedule I of the plaint.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Vishwanath, alleging to be the legal representative of Parwatibai, got himself impleaded in the execution proceedings.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "The defendant and Vishwanath entered into a compromise, pursuant to which Vishwanath delivered possession of the lands in Schedule I to the defendant.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "The plaintiff applied to the court to reopen the execution proceedings and implead him as the legal representative of Lakshmibai, claiming he is the adopted son of Lakshmibai.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "The executing court dismissed the plaintiff's application, holding that his remedy was by way of a separate suit.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f15",
      "text": "A revision against that order to the High Court was rejected.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f16",
      "text": "The plaintiff filed a suit in the court of Subordinate District Judge, Bidar, for a declaration that he is entitled to be impleaded in the execution proceedings as representative of Lakshmibai and to proceed with execution after setting aside the order based on the compromise between defendant and Vishwanath.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f17",
      "text": "That suit was dismissed on the ground that it was hit by s. 42 of the Specific Relief Act as the plaintiff did not sue for possession of the concerned property.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f18",
      "text": "The plaintiff instituted the present suit for possession of the suit properties on the basis of his title.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f19",
      "text": "The trial court dismissed the suit in respect of lands in Schedule I on the ground that the relief is barred by Order 2, rule 2, CPC; decreed suit for possession of lands in Schedule II except items 3 and 9; decreed claim for cash amount.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f20",
      "text": "Both plaintiff and defendant appealed to the Mysore High Court, which affirmed the trial court's decision.",
      "type": "procedural",
      "date": "1968-10-18",
      "source": "high_court"
    },
    {
      "id": "f21",
      "text": "Both courts upheld the plaintiff's claim that he was adopted by the husband of Lakshmibai; question not reopened in Supreme Court.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f22",
      "text": "Before High Court, plaintiff's counsel conceded that suit for items 3 and 9 of Schedule II is barred by limitation.",
      "type": "admitted",
      "date": null,
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the plaintiff's claim in respect of the lands mentioned in Schedule I of the plaint is barred by Order 2, rule 2, Code of Civil Procedure.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The previous suit was misconceived and an exercise in futility; proper remedy was suit for possession on title; causes of action different.",
      "supporting_facts": [
        "f16",
        "f17",
        "f18"
      ],
      "legal_basis": "Order 2, rule 2, Code of Civil Procedure"
    },
    {
      "id": "pa2",
      "text": "Allow mesne profits at least from date of suit.",
      "supporting_facts": [],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Plaintiff's suit in respect of Schedule I lands barred by Order 2, rule 2, CPC as previous suit should have included claim for possession.",
      "supporting_facts": [
        "f16",
        "f19",
        "f20"
      ],
      "legal_basis": "Order 2, rule 2, Code of Civil Procedure"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The previous suit for declaration to implead in execution was misconceived; remedy was suit for possession on title.",
      "addresses_issue": "i1",
      "key_observation": "Previous suit futile; trial court and High Court erred in treating it as suit for declaration of title."
    },
    {
      "id": "cr2",
      "text": "Order 2, rule 2 requires suit to include whole claim for the cause of action; cause of action in previous suit different from present suit for possession on title.",
      "addresses_issue": "i1",
      "key_observation": "Cause of action is foundation of suit; previous cause did not enable claim for possession."
    },
    {
      "id": "cr3",
      "text": "Cited Mohd. Hafiz v. Mohd. Zakaria: If cause enables larger relief but plaintiff limits claim, cannot seek balance later.",
      "addresses_issue": "i1",
      "key_observation": "Previous suit did not enable possession relief."
    },
    {
      "id": "cr4",
      "text": "No need to consider if Order 2, rule 2 applies to suit under s.42 Specific Relief Act.",
      "addresses_issue": "i1",
      "key_observation": "Issue not reached due to conclusion on cause of action."
    },
    {
      "id": "cr5",
      "text": "No claim for mesne profits in plaint, so cannot allow.",
      "addresses_issue": null,
      "key_observation": "No basis to grant mesne profits."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Plaintiff's suit for possession of lands in Schedule I not barred by Order 2, rule 2, CPC as causes of action in previous and present suits different.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Mohd. Hafiz v. Mohd. Zakaria",
      "citation": null,
      "treatment": "followed",
      "relevance": "Illustrates that if cause of action enables larger relief but claim limited, balance cannot be sought later."
    }
  ],
  "statutes_cited": [
    {
      "name": "Code of Civil Procedure",
      "sections": [
        "Order 2, rule 2"
      ],
      "relevance": "Governs whether previous suit bars present claim; held inapplicable due to different causes of action."
    },
    {
      "name": "Specific Relief Act",
      "sections": [
        "Section 42"
      ],
      "relevance": "Previous suit dismissed as hit by this section for not claiming possession; no need to decide applicability of O2 R2 to such suits."
    }
  ],
  "outcome": {
    "disposition": "partially_accepted",
    "summary": "Supreme Court held that trial court and High Court erred in barring claim for Schedule I lands under Order 2, rule 2, CPC due to different causes of action in previous suit; appeal succeeds on that point; no mesne profits as not claimed.",
    "relief_granted": "Suit for possession of Schedule I lands allowed (reversing lower courts).",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The requirement of Order 2, rule 2, Code of Civil Procedure is that every suit should include the whole of the claim which the plaintiff is entitled to make in respect of a cause of action.",
      "speaker": "court",
      "significance": "Defines scope of O2 R2 CPC."
    },
    {
      "text": "Cause of action means the cause of action for which the suit was brought. It cannot be said that the cause of action on which the present suit was brought is the same as that in the previous suit.",
      "speaker": "court",
      "significance": "Key to holding that bar does not apply."
    },
    {
      "text": "His remedy was to file a suit for the possession of the concerned properties on the basis of his title.",
      "speaker": "court",
      "significance": "Identifies correct remedy, distinguishing previous suit."
    }
  ],
  "_case_id": "1969_147",
  "_label": 1,
  "_text_length": 7313,
  "_extracted_at": "2026-02-10T20:26:09.129712"
}