{
  "metadata": {
    "case_name": "Petitioners v. State of West Bengal",
    "case_year": 1969,
    "court": "Supreme Court of India",
    "judges": [
      "Ramaswami J."
    ],
    "case_number": "Writ Petition No. 327 of 1968",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Petitioners obtained rule against State of West Bengal for writ of habeas corpus under Art. 32 directing release from detention under s.3(2) of Preventive Detention Act, 1950.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Order of detention against petitioner No. 2 Sk. Abdul Karim made on 17th February, 1968 by District Magistrate of Hooghly under s.3(2) of the Act for acting in manner prejudicial to maintenance of supplies and services essential to community.",
      "type": "material",
      "date": "1968-02-17",
      "source": "lower_court"
    },
    {
      "id": "f3",
      "text": "Grounds of detention communicated on 17-2-1968: Arrested on 2-2-68 carrying 60 kgs rice without authority from Dankuni Bazar to Dankuni Rly Station for despatch to rationing areas; on 9-2-68 detrained with 1 maund rice; on 10-2-68 carrying 20 kgs rice each with smugglers to Sealdah, detrained at Baranagore; on 11-2-68 carrying 15 kgs rice to Howrah.",
      "type": "disputed",
      "date": "1968-02-02",
      "source": "lower_court"
    },
    {
      "id": "f4",
      "text": "Sk. Abdul Karim made representation to State Government on 21st February, 1968 against detention order.",
      "type": "procedural",
      "date": "1968-02-21",
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "Advisory Board made report on 22nd April, 1968 stating sufficient cause for detention of Sk. Abdul Karim.",
      "type": "procedural",
      "date": "1968-04-22",
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "Governor of West Bengal confirmed detention order on 24th July, 1968 under s.11(1) of the Act.",
      "type": "procedural",
      "date": "1968-07-24",
      "source": "respondent"
    },
    {
      "id": "f7",
      "text": "Petitioners alleged representations not considered by State Government but merely forwarded to Advisory Board.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "In counter-affidavit, respondent stated no requirement to consider representation before forwarding to Advisory Board; later said refrained for unprejudiced consideration.",
      "type": "admitted",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f9",
      "text": "Orders of detention against petitioners Nos. 5 Nirmal Chandra Jana, No. 6 Sk. Ibrahim and No. 8 Nur Mohd. suffer from same legal defect.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "At conclusion of hearing on 15th January, 1969, court directed release of petitioners, reasons to be furnished later.",
      "type": "procedural",
      "date": "1969-01-15",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the State Government is obliged under Art.22(5) of the Constitution to consider the representation of the detenu before forwarding it to the Advisory Board, or if mere forwarding without consideration renders detention illegal.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Representations of petitioners were not considered by respondent Government of West Bengal but merely forwarded to Advisory Board without consideration, making detention bad in law.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "Art. 22(5) of the Constitution"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "No requirement of law compelling State Government to consider detenu's representation before forwarding to Advisory Board; constituted for that purpose under s.8 of the Act; refrained to secure unprejudiced consideration.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": "s.8, s.9 of Preventive Detention Act, 1950"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Art.22(5) implicitly requires State Government to properly consider representation expeditiously upon receipt, independent of Advisory Board; failure to do so violates constitutional right, rendering detention illegal.",
      "addresses_issue": "i1",
      "key_observation": "Constitutional right to representation includes right to proper consideration by authority to whom made; not illusory formality."
    },
    {
      "id": "cr2",
      "text": "Allegation that representation not considered not controverted; personal freedom at stake, procedural safeguards under Art.22 mandatory.",
      "addresses_issue": "i1",
      "key_observation": "Even with Advisory Board reference, Government must consider representation before reference."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "State Government obliged to consider detenu's representation under Art.22(5) before forwarding to Advisory Board; failure renders detention order illegal and ultra vires.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Preventive Detention Act, 1950 (Act IV of 1950)",
      "sections": [
        "s.3(1)",
        "s.3(2)",
        "s.3(3)",
        "s.7(1)",
        "s.8",
        "s.9",
        "s.10",
        "s.11(1)",
        "s.11A(1)",
        "s.13"
      ],
      "relevance": "Governs making, communication, representation, Advisory Board review, confirmation and revocation of detention orders; compliance challenged."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art.22(4)",
        "Art.22(5)",
        "Art.22(7)",
        "Art.21",
        "Art.32"
      ],
      "relevance": "Safeguards for preventive detention; right to grounds and representation; basis for writ petition."
    },
    {
      "name": "Foreigners Act, 1946 (XXXI of 1946)",
      "sections": [],
      "relevance": "Referenced in s.3(1)(b) of Preventive Detention Act."
    },
    {
      "name": "General Clauses Act, 1897 (X of 1897)",
      "sections": [
        "s.21"
      ],
      "relevance": "Referenced in s.13 of Preventive Detention Act for revocation."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Writ petition accepted; detention orders dated 17-2-1968 against petitioner No.2 Sk. Abdul Karim and confirmation order dated 24-7-1968, and similar orders against petitioners Nos.5,6,8 held illegal and ultra vires; petitioners directed to be released.",
    "relief_granted": "Release from detention",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "the constitutional right to make a representation guaranteed by Art.22(5) must be taken to include by necessary implication the constitutional right to a proper consideration of the representation by the authority to whom it is made.",
      "speaker": "court",
      "significance": "Core holding on implied obligation under Art.22(5)"
    },
    {
      "text": "All the procedural requirements of Article 22 are in our opinion mandatory in character and even if one of the procedural requirement is not complied with, the order of detention would be rendered illegal.",
      "speaker": "court",
      "significance": "Emphasizes mandatory nature of safeguards"
    }
  ],
  "_case_id": "1969_267",
  "_label": 1,
  "_text_length": 22878,
  "_extracted_at": "2026-02-10T20:27:27.561740"
}