{
  "metadata": {
    "case_name": "Appellant v. Respondent",
    "case_year": 1966,
    "court": "Supreme Court of India",
    "judges": [
      "Grover, J."
    ],
    "case_number": "Civil Appeal No. 1658 of 1966",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "A contract was entered into between appellant and the respondent on January 28, 1964 for sale of 200 bags of Cone yarn.",
      "type": "material",
      "date": "1964-01-28",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The contract contained an arbitration clause: In case of any dispute arising out of this contract the matter in dispute shall be referred to the arbitration of the Indian Chamber of Commerce whose decision shall be binding on both the parties.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The contract provided: The Court at Calcutta alone and no other court whatsoever shall have jurisdiction to entertain and try suits in respect of any claim or disputes arising out of or under this contract or in any way relating to the same.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Certain disputes arose between the parties relating to the supply of goods.",
      "type": "disputed",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The respondent demanded a payment of Rs. 25,658.90 as price of the goods alleged to have been supplied.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f6",
      "text": "The appellant maintained that the said goods were not according to the contract and had been rightly rejected.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "The appellant did not happen to be a member of the Indian Chamber of Commerce, Calcutta, whereas the respondent was a member.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "The dispute having been referred to the Chamber the appellant wrote to the Registrar of the Tribunal of Arbitration of the Chamber of Commerce to intimate the names of the persons constituting the court to enable the appellant to ascertain whether they were independent and disinterested persons.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "The Registrar sent a reply saying that the names of the arbitrators constituting the court could not be disclosed to the appellant as it was a non-member.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Later on a list of the office-bearers and committee members was sent but according to the appellant the names of the arbitrators were not disclosed.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f11",
      "text": "In September 1964 the Registrar intimated that the meeting of the court of the arbitrators would be held on September 24, 1964.",
      "type": "procedural",
      "date": "1964-09-24",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "The appellant's attorney again sought information regarding the names and particulars of the arbitrators but without success.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f13",
      "text": "The appellant filed an application under s. 33 of the Indian Arbitration Act.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f14",
      "text": "Calcutta High Court dismissed the petition on November 19, 1965 in Matter No. 213 of 1964.",
      "type": "procedural",
      "date": "1965-11-19",
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the arbitration agreement contained in the contract was void and ineffective as clauses a and b were in conflict with each other.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether the Rules of the Tribunal of Arbitration of the Indian Chamber of Commerce were illegal and void, particularly Rule III which allows non-disclosure of arbitrators' names to non-members.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether Rule III of the Rules of Arbitration of the Indian Chamber of Commerce conflicts with the provisions of the Indian Arbitration Act, especially ss. 5, 11, and 30, and violates natural justice.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The arbitration agreement was void and ineffective as clauses a and b reproduced above were in conflict with each other.",
      "supporting_facts": [
        "f2",
        "f3"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "The Rules of the Tribunal of Arbitration of the Indian Chamber of Commerce were illegal and void.",
      "supporting_facts": [
        "f7",
        "f9",
        "f10"
      ],
      "legal_basis": "Indian Arbitration Act"
    },
    {
      "id": "pa3",
      "text": "Rule III of the Rules of Arbitration of the Indian Chamber of Commerce comes into conflict with the provisions of the Act, as non-disclosure of the names of the arbitrators by the Registrar is violative not only of the rules of natural justice but also infringes the provisions of the Act.",
      "supporting_facts": [
        "f8",
        "f9",
        "f10",
        "f12"
      ],
      "legal_basis": "Rule III; ss. 5, 11 of the Act; natural justice"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The Arbitration Rules of the Chamber of Commerce did not offend any of the sections of the Act as the powers of the court under ss. 5 and 11 remained unaffected by the aforesaid Rules.",
      "supporting_facts": [],
      "legal_basis": "ss. 5, 11 of the Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "There is no merit in the challenge to the validity of the arbitration agreement on the ground that the Rules of the Indian Chamber of Commerce enable the Registrar to withhold disclosure of the names of the Arbitration Court to a non-member party.",
      "addresses_issue": "i2",
      "key_observation": "The power given to the Registrar is discretionary and he is not bound in every case to refuse to disclose the names."
    },
    {
      "id": "cr2",
      "text": "As soon as proceedings before the arbitrators commence both parties are in a position to know the names and particulars of the arbitrators and if there is any objection on well known grounds to their conducting the arbitration the same can be taken at that stage.",
      "addresses_issue": "i3",
      "key_observation": "Under s. 5 it is not essential that the authority of an appointed arbitrator should be got revoked before the commencement of the arbitration proceedings. Section 11 contemplates a stage subsequent to the arbitrators entering on the reference."
    },
    {
      "id": "cr3",
      "text": "There is no conflict between Rule III (3) of the Rules of Arbitration of Chamber of Commerce and ss. 5 and 11 or s. 30 of the Act. These Rules do not interfere with or take away the powers and the jurisdiction of the court under the aforesaid provisions.",
      "addresses_issue": "i3",
      "key_observation": "The appellant agreed to submit to the arbitration of Indian Chamber of Commerce which meant that it was bound by all the Rules of Arbitration of the said body."
    },
    {
      "id": "cr4",
      "text": "The appointment of the arbitrator was complete as the arbitrator was known, being the Chamber of Commerce, which under its Rules is authorised to delegate its power to a smaller body.",
      "addresses_issue": "i1",
      "key_observation": "The Rules were expressly or by necessary implication incorporated into the contract."
    },
    {
      "id": "cr5",
      "text": "The aforesaid Rule framed by Chambers of Commerce is based on the elimination of all possibility or chance of a party trying to influence the members of the Arbitration Court before they enter upon or proceed with the reference.",
      "addresses_issue": "i3",
      "key_observation": "Similar rules exist in Bengal, Bombay, and Madras Chambers of Commerce."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The Rules of the Indian Chamber of Commerce do not conflict with ss. 5, 11, or 30 of the Indian Arbitration Act.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Non-disclosure of arbitrators' names to non-members prior to commencement does not invalidate the arbitration agreement or violate natural justice.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "The arbitration agreement is valid and binding.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Suraj Ratan Binany v. Hindustan Motors Ltd.",
      "citation": "Matter No. 95 of 1963 (Calcutta High Court, decided on C-4-1964)",
      "treatment": "distinguished",
      "relevance": "Unreported judgment where similar contention raised; held non-disclosure problematic as parties need to know names to challenge under ss. 5, 11; not followed by High Court or Supreme Court."
    },
    {
      "case_name": "Russell on Arbitration",
      "citation": "17th Edn., at page 207",
      "treatment": "referred",
      "relevance": "States appointment of arbitrator by a party is not complete without communication to other party; held inapplicable as arbitrator (Chamber) was known."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Arbitration Act",
      "sections": [
        "s. 33",
        "s. 5",
        "s. 11",
        "s. 30"
      ],
      "relevance": "Petition under s.33 to challenge arbitration agreement; ss.5,11 for revocation/removal of arbitrator; s.30 for setting aside award; rules do not affect court powers."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal by special leave against the Calcutta High Court's dismissal of the s.33 petition is dismissed, upholding the validity of the arbitration agreement and the rules of the Indian Chamber of Commerce.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The power given to the Registrar is discretionary and he is not bound in every case to refuse to disclose the names.",
      "speaker": "court",
      "significance": "Rejects challenge to Rule III as absolute bar to disclosure."
    },
    {
      "text": "It must be remembered that the appellant agreed to submit to the arbitration of Indian Chamber of Commerce which meant that it was bound by all the Rules of Arbitration of the said body.",
      "speaker": "court",
      "significance": "Emphasizes contractual incorporation of rules."
    },
    {
      "text": "The aforesaid Rule which has been framed by all these bodies of long standing and experience in the field of business is based on the elimination of all possibility or chance of a party trying to influence the members of the Arbitration Court.",
      "speaker": "court",
      "significance": "Justifies purpose of non-disclosure rule."
    }
  ],
  "_case_id": "1969_232",
  "_label": 0,
  "_text_length": 8691,
  "_extracted_at": "2026-02-10T20:27:30.260426"
}