{
  "metadata": {
    "case_name": "Appellants v. Respondent",
    "case_year": 1966,
    "court": "Supreme Court of India",
    "judges": [
      "Shah, J."
    ],
    "case_number": "Civil Appeal No. 808 of 1966",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The respondent is the owner of a house in the town of Ahmedabad.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The appellants are the tenants of that house at a monthly rental of Rs. 2,171/-.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Under the agreement of lease the appellants were to pay out of the agreed rent Rs. 810/- per month, and the balance was to be appropriated towards a loan advanced by them to the respondent for constructing the house.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The appellants had also agreed to pay municipal taxes and electricity charges.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The appellants filed suit No. 1308 of 1963 in the Court of the Small Causes, Ahmedabad, for an order, inter alia, determining the standard rent of the premises in exercise of the power under s. 11 of the Bombay Rents, Hotel and Lodging House Rates Control Act 57 of 1947.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The Court of Small Causes, Ahmedabad, on an application filed by the appellants fixed the contractual rent as interim standard rent and directed the appellants to pay the rent and municipal taxes.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Pursuant to this order, the appellants deposited Rs. 2,403/- as rent and Rs. 8,921.25 due as municipal taxes for the year 1964-65.",
      "type": "procedural",
      "date": "1964-65",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "An application by the respondent to withdraw the amount deposited in Court was resisted by the appellants.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "The Court permitted the respondent to withdraw Rs. 2,403/- but not the municipal taxes.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "The respondent then obtained an order for the issue of a distress warrant under S. 53 of the Presidency Small Cause Courts Act 15 of 1882 read with r. 5 of the Rules framed under the Bombay Rents, Hotel and Lodging House Rates Control Act, 1947, for recovery of the amount due as municipal taxes.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Distress was levied, and the order was confirmed.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "A revision application moved in the High Court of Gujarat against that order was rejected on September 3, 1965.",
      "type": "procedural",
      "date": "1965-09-03",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Appeal by special leave to the Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether r. 5 of the Rules framed under S. 49 of the Bombay Rents, Hotel and Lodging House Rates Control Act 57 of 1947, is ultra vires the State Government.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether the Court of Small Causes Ahmedabad has jurisdiction to pass an order issuing a distress warrant when trying a suit or proceeding under Bombay Act 57 of 1947 especially when an application for determination of standard rent under s. 11 of the Act is pending.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether the municipal taxes and electricity charges constitute rent which may be recovered by the issue of a distress warrant.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "r. 5 of the Rules framed under S. 49 of the Bombay Rents, Hotel and Lodging House Rates Control Act 57 of 1947, is ultra vires the State Government.",
      "supporting_facts": [],
      "legal_basis": "S. 49 Bombay Rents Act"
    },
    {
      "id": "pa2",
      "text": "The Court of Small Causes Ahmedabad has no jurisdiction to pass an order issuing a distress warrant when trying a suit or proceeding under Bombay Act 57 of 1947 especially when an application for determination of standard rent under s. 11 of the Act is pending.",
      "supporting_facts": [
        "f5",
        "f6"
      ],
      "legal_basis": "S. 11, 28 Bombay Rents Act; S. 53 Presidency Small Cause Courts Act"
    },
    {
      "id": "pa3",
      "text": "The municipal taxes and electricity charges do not constitute rent which may be recovered by the issue of a distress warrant.",
      "supporting_facts": [
        "f4",
        "f9"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "By the express terms of the tenancy the appellants had undertaken to pay the municipal taxes and electricity charges as part of the rent.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "By the express terms of the tenancy the appellants had undertaken to pay the municipal taxes and electricity charges as part of the rent it is not open to them to contend that they are not rent recoverable by the issue of a distress warrant.",
      "addresses_issue": "i3",
      "key_observation": "Municipal taxes and electricity charges constitute rent under the lease agreement."
    },
    {
      "id": "cr2",
      "text": "Section 28 invests existing courts with exclusive jurisdiction to try suits and proceedings relating to recovery of rent or possession and claims under the Act, but does not set up new courts; such courts retain powers conferred by their constituting statutes.",
      "addresses_issue": "i2",
      "key_observation": "Court of Small Causes, Ahmedabad, governed by Presidency Small Cause Courts Act, competent to issue distress warrant under S.53."
    },
    {
      "id": "cr3",
      "text": "Rule 5 framed under S.49(2)(iii) Bombay Rents Act was not ultra vires when framed and continued in force post-Ahmedabad City Courts Act.",
      "addresses_issue": "i1",
      "key_observation": "Rule 5 valid and applicable."
    },
    {
      "id": "cr4",
      "text": "Jurisdiction to issue distress warrant not suspended while application for standard rent pending; contractual rent payable until determined.",
      "addresses_issue": "i2",
      "key_observation": "Court ordered deposit of rent and taxes; taxes not withdrawable by landlord, hence arrears existed."
    },
    {
      "id": "cr5",
      "text": "Landlord cannot obtain amount twice, but deposit not making amount available to landlord allows distress application.",
      "addresses_issue": "i2",
      "key_observation": "No bar to distress despite court order preventing withdrawal."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Municipal taxes and electricity charges undertaken as part of rent are recoverable by distress warrant.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Court of Small Causes, Ahmedabad has jurisdiction to issue distress warrant under S.53 Presidency Small Cause Courts Act even in proceedings under Bombay Rents Act.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Rule 5 under Bombay Rents Act not ultra vires.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Bombay Rents, Hotel and Lodging House Rates Control Act, 1947 (Bom. 57 of 1947)",
      "sections": [
        "S. 11",
        "S. 28",
        "S. 31",
        "S. 49"
      ],
      "relevance": "Confers jurisdiction on Small Causes Courts for rent recovery suits, standard rent fixation, rules for procedure including distress warrants."
    },
    {
      "name": "Presidency Small Cause Courts Act, 1882 (15 of 1882)",
      "sections": [
        "S. 53"
      ],
      "relevance": "Empowers issuance of distress warrant for rent recovery."
    },
    {
      "name": "Provincial Small Cause Courts Act, 1887 (9 of 1887)",
      "sections": [],
      "relevance": "Ceased to apply to Ahmedabad post Ahmedabad City Courts Act."
    },
    {
      "name": "Ahmedabad City Courts Act, 1961 (19 of 1961)",
      "sections": [
        "S. 17",
        "S. 18",
        "S. 19"
      ],
      "relevance": "Extended Presidency Small Cause Courts Act to Ahmedabad, amended Bombay Rents Act for exclusive jurisdiction."
    },
    {
      "name": "Bombay Reorganization Act, 1960 (11 of 1960)",
      "sections": [
        "S. 87"
      ],
      "relevance": "Continued rules in force post-reorganization."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court dismissed the appeal, upholding the Gujarat High Court's rejection of revision against the distress warrant order for municipal taxes issued by the Court of Small Causes, Ahmedabad.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "By the express terms of the tenancy the appellants had undertaken to pay the municipal taxes and electricity charges as part of the rent it is not open to them to contend that they are not rent recoverable by the issue of a distress warrant.",
      "speaker": "court",
      "significance": "Rejects argument that taxes are not rent."
    },
    {
      "id": "kq2",
      "text": "Section 28 merely confers upon the existing Courts exclusive jurisdiction in respect of matters relating to possession of premises and recovery of rent and to determine claims and questions arising under that Act.",
      "speaker": "court",
      "significance": "Clarifies nature of jurisdiction under Bombay Rents Act."
    }
  ],
  "_case_id": "1969_42",
  "_label": 0,
  "_text_length": 12975,
  "_extracted_at": "2026-02-10T20:25:19.435450"
}