{
  "metadata": {
    "case_name": "Commissioner of Income Tax v. Respondents",
    "case_year": 1968,
    "court": "Supreme Court of India",
    "judges": [
      "Shah, Ag. C.J."
    ],
    "case_number": "Civil Appeal Nos. 736 to 739, 91-3 and 1621 of 1968",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Proceeding for assessment to Income-tax for the year 1949-50.",
      "type": "procedural",
      "date": "1949-50",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Respondents claimed that the dividend distributed by the Ukhra Estate Zamindaries Ltd. was exempt from tax, because the fund out of which the dividend was distributed did not form part of the accumulated profits of the Company.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f3",
      "text": "Total dividend distributed by the Company: Rs. 2,24,000.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Rs. 1,12,500 out of total dividend represented capital gains arising to the Company on or after April 1, 1948.",
      "type": "material",
      "date": "1948-04-01",
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "Income-tax Officer rejected the contention and brought the dividend to tax in the hands of the respondents.",
      "type": "procedural",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f6",
      "text": "Appellate Assistant Commissioner held that Rs. 1,12,500 was not dividend within s. 2(6A) and share distributed to shareholders out of that amount was exempt from income-tax.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Tribunal reversed the order of the Appellate Assistant Commissioner.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Tribunal's view: definition of dividend in s. 2(6A) not exhaustive; amount distributed if dividend in ordinary parlance chargeable under general charging section; clause concerned with deemed dividends; exclusion of certain capital gains had no bearing.",
      "type": "background",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Question referred by Tribunal to High Court under s. 66(1): Whether on the facts and circumstances the amount of Rs. 28,125 was rightly included as dividend in the total income of the assessee for 1949-50?",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "High Court answered the question in the negative.",
      "type": "procedural",
      "date": "1964-12-02",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Commissioner appealed to Supreme Court with certificates granted by High Court.",
      "type": "procedural",
      "date": null,
      "source": "prosecution"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether on the facts and in the circumstances of the case the amount of Rs. 28,125 was rightly included as dividend in the total income of the assessee for the assessment year 1949-50?",
      "framed_by": "lower_court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Definition of dividend in s. 2(6A) in force in the year of assessment was not exhaustive, and if the amount distributed was dividend in ordinary parlance it became chargeable under the general charging section, and that clause 2(6A) was concerned with deemed dividends, and exclusion of certain capital gains by the proviso had no bearing on the issue raised by the revenue.",
      "supporting_facts": [
        "f3",
        "f7",
        "f8"
      ],
      "legal_basis": "s. 2(6A) Income Tax Act, 1922"
    },
    {
      "id": "pa2",
      "text": "Share of dividend which is not chargeable to tax by virtue of the exemption clause is still liable to tax as income other than dividend.",
      "supporting_facts": [],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Rs. 1,12,500 out of total Rs. 2,24,000 represented capital gains arising on or after April 1, 1948 and not being dividend within s. 2(6A), the share distributed to shareholders out of that amount was exempt.",
      "supporting_facts": [
        "f3",
        "f4",
        "f6"
      ],
      "legal_basis": "s. 2(6A) proviso Income Tax Act, 1922"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Dividend in its ordinary connotation means the sum paid to or received by a shareholder proportionate to his share holding out of the total sum distributed.",
      "addresses_issue": "i1",
      "key_observation": "Ordinary meaning provided."
    },
    {
      "id": "cr2",
      "text": "Relevant definition in s. 2(6A) for 1949-50: inclusive definition including distribution of accumulated profits, excluding capital gains arising after 31st March 1948 by proviso.",
      "addresses_issue": "i1",
      "key_observation": "Legislature expressly excluded capital gains after 31.3.1948 from dividend."
    },
    {
      "id": "cr3",
      "text": "Dividend distributed is not impressed with the character of the profits from which it reaches the shareholder; mere distribution out of capital gains does not make it capital gains in hands of shareholder.",
      "addresses_issue": "i1",
      "key_observation": "But exclusion applies."
    },
    {
      "id": "cr4",
      "text": "Definition inclusive but capital gains excluded by express enactment cannot be regarded as dividend within the Act.",
      "addresses_issue": "i1",
      "key_observation": "Only proportionate share out of accumulated profits excluding excepted capital gains is taxable dividend."
    },
    {
      "id": "cr5",
      "text": "No warrant for view that definition only includes deemed dividends; to regard excepted capital gains as not accumulated profits for definition but as dividend in popular notion nullifies statute.",
      "addresses_issue": "i1",
      "key_observation": "Strained construction not to be adopted."
    },
    {
      "id": "cr6",
      "text": "Agree with High Court that proportionate share of capital gains out of which dividend distributed is exempt under s. 12 as dividend income.",
      "addresses_issue": "i1",
      "key_observation": "Exempt."
    },
    {
      "id": "cr7",
      "text": "Argument that exempt dividend still taxable as other income not raised before Tribunal or High Court; not to be entertained.",
      "addresses_issue": "i1",
      "key_observation": "Not raised."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The proportionate share of the capital gains out of which the dividend was distributed to the shareholders must be deemed exempt from liability to pay tax under s. 12 as dividend income liable to tax.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Income Tax Act, 1922",
      "sections": [
        "s. 2(6A)",
        "s. 66(1)",
        "s. 12"
      ],
      "relevance": "Definition of dividend excludes capital gains after 31.3.1948; reference under s.66(1); exemption of such dividend under s.12"
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeals by the Commissioner fail and are dismissed. The amount of Rs. 28,125 representing proportionate share of capital gains arising after 31.3.1948 is not includible as dividend in the assessee's income for 1949-50.",
    "relief_granted": "Exemption from tax on the dividend portion from excepted capital gains confirmed",
    "costs": "Dismissed with costs. One hearing fee."
  },
  "key_quotes": [
    {
      "text": "The proviso to the Explanation clearly enacted that capital gains arising after March 31, 1948 are not liable to be included within the expression dividend.",
      "speaker": "court",
      "significance": "Core reasoning for exclusion from dividend definition"
    },
    {
      "text": "To hold that the capital gains within the excepted period are not part of the accumulated profits for the purpose of the definition under s. 2(6A) and a distributive share thereof does not on that account fall within the definition of dividend and therefore of income chargeable to tax and still to regard them as a part of accumulated profits for the purpose of dividend in the popular connotation and to bring the share to tax in the hands of the shareholders is to nullify an express provision of the statute.",
      "speaker": "court",
      "significance": "Rejects Tribunal's interpretation as nullifying statute"
    },
    {
      "text": "We agree with the High Court that the proportionate share of the capital gains out of which the dividend was distributed to the shareholders of the Company must be deemed exempt from liability to pay tax under s. 12 as dividend income liable to tax.",
      "speaker": "court",
      "significance": "Final holding affirming High Court"
    }
  ],
  "_case_id": "1969_201",
  "_label": 0,
  "_text_length": 6024,
  "_extracted_at": "2026-02-10T20:26:37.003979"
}