{
  "metadata": {
    "case_name": "Sardana v. Aziz Ahmed Khan & Ors.",
    "case_year": 1965,
    "court": "Supreme Court of India",
    "judges": [
      "Grover, J."
    ],
    "case_number": "Civil Appeal No. 381 of 1965",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "On June 16, 1948 the appellant entered into an agreement with Aziz Ahmed Khan--respondent No. I--for the sale of certain properties comprising houses and plots in the town of Bareilly. The sale consideration of Rs. 1,45,000/- was stated have been already paid by the appellant to the vendor.",
      "type": "material",
      "date": "1948-06-16",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Subsequently disputes arose between the vendor and the appellant regarding the completion of the sale. These disputes were referred to the arbitration of Shri R.R. Agarwal who gave an award on August 30, 1949 which was made a rule of the court on November 30, 1949. A decree on the basis of the award was granted in favour of the appellant.",
      "type": "procedural",
      "date": "1949-08-30",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Sometimes after November 22, 1949 the vendor Aziz Ahmed Khan left India for Pakistan.",
      "type": "material",
      "date": "1949-11-22",
      "source": "lower_court"
    },
    {
      "id": "f4",
      "text": "On December 7, 1950 the appellant moved the Deputy Custodian Judicial Meerut Circle for confirmation of the transfer under s. 38 of the Administration of Evacuee Property Ordinance, 1949, Ordinance No. 27 of 1949, or under s. 40 of the Administration of Evacuee Property Act 1950 Act 31 of 1950.",
      "type": "procedural",
      "date": "1950-12-07",
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "On 9th May 1951 the Deputy Custodian accorded confirmation. The Additional Custodian, however, took suo motu action in exercise of his revisional jurisdiction and set aside the order passed by the Deputy Custodian.",
      "type": "procedural",
      "date": "1951-05-09",
      "source": "respondent"
    },
    {
      "id": "f6",
      "text": "On April 4, 1952 the appellant filed an application for execution of the decree passed on the basis of the award.",
      "type": "procedural",
      "date": "1952-04-04",
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "On May 10, 1952 objections were filed on behalf of the Custodian to the execution.",
      "type": "procedural",
      "date": "1952-05-10",
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "The District Judge held that the award made on August 30, 1949 could not have the effect of transferring the properties as the approval of the Collector had not been obtained under the notification dated July 29, 1949 which had been issued under s. 26 of U.P. Administration of Evacuee Property Ordinance No. 1 of 1949 and that on the date of the decree the transfer of properties could not be effected unless confirmed by the Custodian. It was further held by him that no interest by way of charge in favour of the appellant had been created on the properties in dispute. He was further of the view that s. 17(1) of the Central Act of 1950 created a bar to execution of the decree. The Execution application was consequently dismissed.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "The appellant filed an appeal to the High Court which was dismissed on May 2, 1961.",
      "type": "procedural",
      "date": "1961-05-02",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "When the appeal came up for hearing before this Court on February 22, 1968 it was considered expedient to have further findings on certain points. The following questions were therefore framed and remitted to the High Court: 1. the date on which Aziz Ahmed Khan migrated to Pakistan. 2. whether the properties of Aziz Ahmed Khan vested in the Custodian of Evacuee Property under U.P. Ordinance 1 of 1949 or Central Ordinance 12 of 1949 as made applicable to the State of U.P. by U.P. Ordinance 20 of 1949 or under the Central Ordinance 27 of 1949 or under Central Act of 1950.",
      "type": "procedural",
      "date": "1968-02-22",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "The High Court remitted these matters to the District Judge. His finding on the first question was that Aziz Ahmed Khan had migrated to Pakistan on some date after November 22, 1949. On the second question he found that Aziz Ahmed Khan's properties did not vest in the Custodian of Evacuee Property under any of the Ordinances or under the Central Act 31 of 1950.",
      "type": "background",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Certain additional evidence was produced before the High Court. The High Court expressed agreement with the conclusions of the District Judge on both the points. It may be mentioned that on certain subsidiary points the learned District Judge had also found that it had not been proved that a valid declaration under s. 7(1) of the Central Ordinance 27 of 1949 or of the corresponding provision in the Central Act 31 of 1950 was made for declaring Aziz Ahmed Khan an evacuee.",
      "type": "admitted",
      "date": null,
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether there is a bar to the execution of the decree based on the arbitration award in light of the evacuee property laws, given that Aziz Ahmed Khan migrated to Pakistan after the award and no vesting or declaration of evacuee status occurred.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the transfer effected by the award is effective without confirmation by the Custodian under s.38 of Ordinance 27/1949 or s.40 of Act 31/1950, even if the transferor became an evacuee after the transfer.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether a charge was created in favour of the appellant under para 6 of the award.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "In view of the findings which have been returned by the High Court on the points referred, there could be no bar to the execution of the decree which was based on the award. The properties of Aziz Ahmed Khan were never declared to be evacuee properties either under the Central Ordinance 27 of 1949 or the Central Act 31 of 1950, and they could not vest in the Custodian unless they had been so declared after appropriate proceedings.",
      "supporting_facts": [
        "f11",
        "f12"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "The decree in favour of the appellant was of the nature of a decree passed in a suit for specific performance. The court could and should have executed conveyance in favour of the appellant since Aziz Ahmed Khan was no longer available or was refusing to do so and the confirmation of the Custodian could be obtained before the registration was effected.",
      "supporting_facts": [
        "f2",
        "f3"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "The Additional Custodian had declined to confirm the transfer at the previous stage because there was no deed of sale or transfer.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Counsel for the respondent has drawn attention to a decision of this Court in Azimunissa Others v. The Deputy Custodian Evacuee Properties, District Deoria Ors. in which the effect of the declaration of U.P. Ordinance 1 of 1949 to be invalid by the courts came up for consideration.",
      "supporting_facts": [],
      "legal_basis": "Azimunissa Others v. Deputy Custodian Evacuee Properties"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Aziz Ahmed Khan migrated to Pakistan after November 22, 1949. At that point of time it was Central Ordinance 27 of 1949 which was in force. It appears highly doubtful that the respondent could take advantage of the provisions of automatic vesting contained in U.P. Ordinance 1 of 1949.",
      "addresses_issue": "i1",
      "key_observation": "Distinguishes from Azimunissa case due to timing of migration."
    },
    {
      "id": "cr2",
      "text": "There is, however, a serious hurdle in the way of the appellant even when the provisions of Central Ordinance 27 of 1949 or the Central Act 31 of 1950 are taken into consideration. Section 38(1) of that Ordinance provided that no transfer of any right or interest in any property after the 14th day of August 1947 by or on behalf of an evacuee or by or on behalf of a person who had become an evacuee after the date of the transfer shall be effective unless it was confirmed by the Custodian. Similar provisions in s.40(1) of Act 31/1950.",
      "addresses_issue": "i2",
      "key_observation": "Transfer ineffective unless confirmed by Custodian even if transferor becomes evacuee after transfer; no need for prior declaration of property as evacuee."
    },
    {
      "id": "cr3",
      "text": "Aziz Ahmed Khan became an evacuee within the meaning of s.2(d) of the Ordinance and Act as he left India for Pakistan after March 1, 1947. It was necessary for the appellant to have obtained the confirmation of the Custodian. The Additional Custodian declined to confirm the transfer and thus the condition precedent for the transfer to become effective remained unsatisfied.",
      "addresses_issue": "i2",
      "key_observation": "Appellant failed to obtain required confirmation."
    },
    {
      "id": "cr4",
      "text": "Even in the award which formed the basis of the decree it had been provided that the second party (Aziz Ahmed Khan) is hereby directed to execute the necessary documents... within one month from the date of the receipt of the confirmation or approval according to law... Therefore according to the award the confirmation or approval of the Custodian had to be obtained before the transfer documents were to be executed and completed in accordance with law.",
      "addresses_issue": "i2",
      "key_observation": "Award itself conditioned transfer on Custodian confirmation."
    },
    {
      "id": "cr5",
      "text": "Under s.39 of the Central Ordinance 27 of 1949 no document could be registered of the nature mentioned in s.38 unless the Custodian had confirmed the transfer. The prayer in the Execution Application that the court might grant assistance by execution of sale deed under the enabling para 5 of the Decree could not be entertained.",
      "addresses_issue": "i2",
      "key_observation": "Executing court cannot assist without confirmation."
    },
    {
      "id": "cr6",
      "text": "Para 6 of the award created a claim of Rs.1,50,000/- with interest at 12% if transaction not confirmed, charged on the properties and enforceable against all properties of second party and his person. The High Court dealt with this as if charge on evacuee property, but on reasoning about no declaration, this may not be correct. Refrain from final opinion; leave open for appropriate proceedings.",
      "addresses_issue": "i3",
      "key_observation": "Issue of charge left open."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Transfer by award ineffective without Custodian confirmation under s.38 Ordinance 27/1949 and s.40 Act 31/1950, even if transferor became evacuee after transfer.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Executing court cannot direct execution of conveyance without prior Custodian confirmation.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Question of charge under para 6 of award left open for future proceedings.",
      "resolves_issue": "i3",
      "in_favor_of": "partial"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Azimunissa Others v. The Deputy Custodian Evacuee Properties, District Deoria Ors.",
      "citation": "[1961] 2 S.C.R. 91",
      "treatment": "distinguished",
      "relevance": "Effect of invalidity of U.P. Ordinance 1/1949 and subsequent legislation; property vested under U.P. Ordinance continued to vest due to s.8(2-A) introduced in 1960, but distinguished here due to migration after Nov 22, 1949 under Central Ordinance 27/1949."
    },
    {
      "case_name": "Azimunnissa Ors. v. Assistant Custodian",
      "citation": "A.I.R. 1957 All. 561",
      "treatment": "referred",
      "relevance": "Held vesting under U.P. Ordinance 1/1949 invalid."
    }
  ],
  "statutes_cited": [
    {
      "name": "Administration of Evacuee Property Ordinance, 1949 (No. 27 of 1949)",
      "sections": [
        "s. 38(1)",
        "s. 39",
        "s. 2(d)",
        "s. 7(1)"
      ],
      "relevance": "No transfer effective unless confirmed by Custodian if transferor becomes evacuee after transfer; no registration without confirmation; definition of evacuee; declaration required for evacuee status."
    },
    {
      "name": "Administration of Evacuee Property Act, 1950 (Act 31 of 1950)",
      "sections": [
        "s. 40(1)",
        "s. 17(1)",
        "s. 2"
      ],
      "relevance": "Similar to s.38 Ordinance; bar to execution; definition of evacuee."
    },
    {
      "name": "U.P. Administration of Evacuee Property Ordinance No. 1 of 1949",
      "sections": [
        "s. 26"
      ],
      "relevance": "Approval of Collector required for transfers; notification July 29, 1949; automatic vesting provisions distinguished."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal is dismissed insofar as execution of the decree for transfer of properties is concerned, as the transfer requires prior confirmation by the Custodian which was not obtained. The question of the charge under para 6 of the award is left open for decision in appropriate proceedings.",
    "relief_granted": "None; liberty to pursue charge claim.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "No transfer of any right or interest in any property after the 14th day of August 1947 by or on behalf of an evacuee or by or on behalf of a person who had become an evacuee after the date of the transfer shall be effective unless confirmed by the Custodian.",
      "speaker": "court",
      "significance": "Core holding on s.38(1) Ordinance 27/1949 applicability even post-transfer evacuee status."
    },
    {
      "text": "It was incumbent on the appellant to obtain the confirmation order before he could ask for any further steps to be taken by the courts in the matter of execution and registration of the transfer deed.",
      "speaker": "court",
      "significance": "Explains why execution application fails."
    },
    {
      "text": "We would, however, refrain from expressing any final opinion as in fairness to both sides this question should be left for being decided, if taken, in appropriate proceedings including proceedings before the Executing Court.",
      "speaker": "court",
      "significance": "Leaves charge issue open."
    }
  ],
  "_case_id": "1969_217",
  "_label": 0,
  "_text_length": 12957,
  "_extracted_at": "2026-02-10T20:26:48.340523"
}