{
  "metadata": {
    "case_name": "Union of India v. A.V. Narasimhalu",
    "case_year": 1966,
    "court": "Supreme Court of India",
    "judges": [
      "Shah, J."
    ],
    "case_number": "Civil Appeal No. 1361 of 1966",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "A.V. Narasimhalu (plaintiff) imported 43 reels of newsprint 13 1/4\" width under a bill of Entry dated July 15, 1954.",
      "type": "material",
      "date": "1954-07-15",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Width of newsprint being less than 15\", import duty was payable under the Open General Licence.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Assistant Collector of Customs held that the commodity imported fell within item 44 of the Customs Tariff and levied a duty of 33 3/8% ad valorem.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Plaintiff paid the duty under protest.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Plaintiff applied for refund of the duty relying upon a decision of the High Court of Madras in writ petition No. 402 of 1954 in which it was decided that newsprint of width less than 15\" was exempt from duty.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Application for refund rejected on the ground that the claim having not been made within three months of the date of demand was barred under s. 40 of the Sea Customs Act, 1878.",
      "type": "procedural",
      "date": null,
      "source": "customs_authorities"
    },
    {
      "id": "f7",
      "text": "Appeal to the Collector of Customs and revision application to the Central Board of Revenue were unsuccessful.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Plaintiff instituted an action in the City Civil Court for a decree for Rs. 2,669-62 against the Union of India.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Trial Court decreed the claim holding that the claim was not barred.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "In appeal, the Principal Judge, City Civil Court held that the City Civil Court had no jurisdiction to entertain the suit, relying upon Secretary of State for India v. Mask & Co.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "In Second Appeal No. 1287 of 1960, the High Court of Madras reversed the judgment of the Principal Judge, City Civil Court, and restored the decree passed by the trial court.",
      "type": "procedural",
      "date": "1963-04-05",
      "source": "high_court"
    },
    {
      "id": "f12",
      "text": "Union of India appealed to this Court (Supreme Court) with special leave.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the Civil Court had jurisdiction to entertain the suit challenging the levy of customs duty.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The jurisdiction of the Civil Court to entertain a suit on the ground that the duty was improperly or illegally levied is excluded by the Sea Customs Act, 1878.",
      "supporting_facts": [
        "f3",
        "f6",
        "f7"
      ],
      "legal_basis": "Sections 188, 191 of Sea Customs Act, 1878; Secretary of State for India v. Mask & Co."
    },
    {
      "id": "pa2",
      "text": "The Act is a complete code dealing with liability to pay customs duty and for obtaining relief against excessive or erroneous levy.",
      "supporting_facts": [
        "f1",
        "f3",
        "f8"
      ],
      "legal_basis": "Sea Customs Act, 1878; Dhulabhai v. State of Madhya Pradesh"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The Collector could not be said to be acting within his jurisdiction if he levied duty on goods not liable to duty, compelling payment under duress; such a case amounts to a common law right to property being interfered with, maintainable in civil court.",
      "supporting_facts": [
        "f3",
        "f4",
        "f5"
      ],
      "legal_basis": "Common law; Madras High Court writ petition No. 402 of 1954"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "It is unnecessary to consider whether the claim is barred under s. 40 of the Sea Customs Act, for the Civil Court had no jurisdiction to entertain the suit.",
      "addresses_issue": "i1",
      "key_observation": "Section 188 provides for appeal to Chief Customs Authority within three months, and orders in appeal are final subject to revision under s. 191."
    },
    {
      "id": "cr2",
      "text": "The Act creates a special liability and provides a complete machinery for determination of duty liability by a hierarchy of tribunals; jurisdiction of Civil Court excluded by clearest implication.",
      "addresses_issue": "i1",
      "key_observation": "Refusing to appeal under s. 188 does not invest Civil Court with jurisdiction."
    },
    {
      "id": "cr3",
      "text": "Civil courts have jurisdiction only in cases where Customs Authority has not complied with statute, acted without conformity to fundamental principles of judicial procedure, order not within competence, statute unconstitutional, or mala fide.",
      "addresses_issue": "i1",
      "key_observation": "None of these exceptions apply here; erroneous decision not beyond jurisdiction."
    },
    {
      "id": "cr4",
      "text": "Liability to pay customs duty is not a common law liability but arises by virtue of the Sea Customs Act, with complete machinery for redress.",
      "addresses_issue": "i1",
      "key_observation": "High Court prerogative writs under Article 226 remain available despite exclusion of civil court jurisdiction."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The jurisdiction of the civil court to entertain a suit challenging the validity of the imposition of the duty of customs is excluded.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Secretary of State for India v. Mask & Co.",
      "citation": "L.R. 67 I.A. 222",
      "treatment": "followed",
      "relevance": "Decision of Collector under s. 188 final and excludes civil court jurisdiction for adjudications on duty."
    },
    {
      "case_name": "Dhulabhai etc. v. State of Madhya Pradesh and Anr.",
      "citation": "A.I.R. 1969 S.C. 78",
      "treatment": "referred",
      "relevance": "Principles relating to exclusion of civil court jurisdiction where statute provides complete machinery."
    }
  ],
  "statutes_cited": [
    {
      "name": "Sea Customs Act, 1878",
      "sections": [
        "Section 40",
        "Section 182",
        "Section 188",
        "Section 191"
      ],
      "relevance": "Provides complete code for customs duty liability, appeals, revisions; excludes civil court jurisdiction by implication."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; suit ordered to be dismissed as civil court lacked jurisdiction. High Court's order maintained in effect by dismissing suit. Assurance by Attorney-General that Union of India will refund the amount irrespective of decision.",
    "relief_granted": "None to plaintiff; assurance of refund by Union of India.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The Act is a complete code dealing with liability to pay customs duty and for obtaining relief against excessive or erroneous levy and other related matters. The jurisdiction of the Civil Court to entertain a suit on the ground that the duty was improperly or illegally levied is excluded.",
      "speaker": "court",
      "significance": "Core holding on exclusion of civil court jurisdiction."
    },
    {
      "text": "We are glad to record the assurance given by the Attorney General that whatever may be the decision in the appeal, the Union of India will refund the amount of tax unauthorisedly recovered by the Assistant Collector of Customs.",
      "speaker": "court",
      "significance": "Highlights administrative assurance despite legal outcome."
    },
    {
      "text": "We trust that the Administrative authorities will act in a manner consistent not with technicalities, but with a broader concept of justice if a feeling is to be nurtured in the minds of the citizens that the Government is by and for the people.",
      "speaker": "court",
      "significance": "Court's observation on administrative fairness."
    }
  ],
  "_case_id": "1969_97",
  "_label": 1,
  "_text_length": 13116,
  "_extracted_at": "2026-02-10T20:25:58.420361"
}