{
  "metadata": {
    "case_name": "Appellants v. Respondents Nos. 1 and 2",
    "case_year": 1969,
    "court": "Supreme Court of India",
    "judges": [
      "Shelat, J."
    ],
    "case_number": "Civil Appeal No. 1278 of 1969",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The route between Meerut and Dankaur had no direct passenger bus service.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Existing routes: one from Meerut to Bulandshahar and another from Siana to Dankaur, crossing near Gulsothi, requiring passengers to change buses.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Appellants, amongst others, applied to the Regional Transport Authority (R.T.A.) for permits to operate a direct service from Meerut to Dankaur.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "R.T.A. followed procedure under s. 57 of the Motor Vehicles Act, published applications, objections raised by operators on existing routes.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "R.T.A. meeting on July 28, 1965: Agenda Item 3 - to pronounce decision regarding recognition and classification of Meerut to Dankaur via Hapur Gulsothi Sikandarabad route and grant of permits thereon.",
      "type": "procedural",
      "date": "1965-07-28",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "R.T.A. determined two questions: (a) whether the proposed route should be opened; (b) if so, to whom permits should be granted.",
      "type": "procedural",
      "date": "1965-07-28",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "R.T.A. concluded there was no sufficient demand for direct service, no justification for opening the new route, rejected applications.",
      "type": "material",
      "date": "1965-07-28",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Appeals filed before Appellate Tribunal, which reversed R.T.A. order and granted permits to the three appellants.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Respondents filed writ petitions in Allahabad High Court contending no appeal lay under s. 64(1), Tribunal lacked jurisdiction.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Single Judge of High Court dismissed writ petitions.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Division Bench of High Court allowed appeals against Single Judge, held no appeal lay under s. 64(1), quashed Tribunal's order.",
      "type": "material",
      "date": "1969-03-13",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Appeal to Supreme Court by certificate against High Court order dated March 13, 1969 in Special Appeal No. 1060 of 1967.",
      "type": "procedural",
      "date": "1969-03-13",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "When an applicant applies for a permit to run a passenger bus service on a new route on the ground that it is necessary in public interest, but the R.T.A. concludes there is no need and rejects the application, whether the order is one under s. 48 of the Motor Vehicles Act, 1939 and appealable under s. 64(1)?",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "No provision in the Act separately providing for the R.T.A. to decide first whether a particular route proposed by an applicant should be opened or not. Provisions of Chapter IV, particularly ss. 47 and 57, show that once application is made, published, objections invited, and R.T.A. rejects it, the order amounts to a refusal under s. 48, appealable under s. 64(1), no matter the reasons.",
      "supporting_facts": [
        "f3",
        "f4",
        "f5",
        "f6",
        "f7"
      ],
      "legal_basis": "ss. 47, 57, 48, 64(1) of Motor Vehicles Act, 1939"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "s. 47(3) contains power of R.T.A. to determine number of permits necessary for a route (not appealable under s. 64(1)), and also to decide whether proposed route should be opened or not. Only after these decisions, question of granting/refusing permits to applicants arises under s. 48, appealable under s. 64(1). Right of appeal is statutory, not inherent.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "ss. 47(3), 48, 64(1) of Motor Vehicles Act, 1939"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "R.T.A. must first decide under s. 47(3) whether new route is necessary in public interest and number of permits, as general order, not appealable under s. 64(1). Only then, under s. 48 read with s. 57, decide which applicants get permits.",
      "addresses_issue": "i1",
      "key_observation": "Decision not to open new route is general order under s. 47(3), anterior to s. 48 stage, individual applicants not concerned, not appealable."
    },
    {
      "id": "cr2",
      "text": "No difference whether R.T.A. first decides to open route and invites applications, or applicant proposes new route. In both, R.T.A. first decides necessity before s. 48.",
      "addresses_issue": "i1",
      "key_observation": "ss. 47 and 57 read together require prior decision on route necessity."
    },
    {
      "id": "cr3",
      "text": "Analysis of precedents: Abdul Mateen (s. 47(3) general order not appealable); Java Ram (rejection at s. 48 stage after prior decision appealable); Obliswami Naidu (R.T.A. must first decide necessity even for applicant-proposed route).",
      "addresses_issue": "i1",
      "key_observation": "Order limiting permits under s. 47(3) presupposes decision to open route; both general, not appealable."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "R.T.A.'s rejection of applications on ground of no need to open new route is a general order under s. 47(3), not under s. 48, hence not appealable under s. 64(1).",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Abdul Mateen v. R. Pandey",
      "citation": null,
      "treatment": "followed",
      "relevance": "s. 47(3) general order limiting permits not appealable under s. 64; cannot be reconsidered at s. 48 stage."
    },
    {
      "case_name": "M/s. Java Ram Motor Service v. S. Rajarathinam",
      "citation": "1963 3 S.C.R. 523",
      "treatment": "followed",
      "relevance": "Rejection of applications at s. 48 stage after prior decision to open route is appealable under s. 64(1), contrary to prior s. 47(3) order."
    },
    {
      "case_name": "R. Obliswami Naidu v. The Addl. State Transport Appellate Tribunal, Madras",
      "citation": "C.A. No. 95 of 1965",
      "treatment": "followed",
      "relevance": "R.T.A. must first decide necessity of new route proposed by applicant under ss. 47 and 57 before s. 48."
    }
  ],
  "statutes_cited": [
    {
      "name": "Motor Vehicles Act, 1939",
      "sections": [
        "s. 47",
        "s. 47(3)",
        "s. 48",
        "s. 57",
        "s. 64(1)",
        "s. 64-A",
        "Chapter IV"
      ],
      "relevance": "Governs procedure for permits: general orders on route necessity and permit numbers under s. 47(3) not appealable; individual grants/refusals under s. 48 appealable under s. 64(1)."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court upheld the High Court's view that no appeal lay under s. 64(1) against R.T.A.'s order rejecting applications for new route on ground of no public need, as it was a general order under s. 47(3).",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The question arising in this appeal... whether his order is one under s. 48... and is, therefore, appealable under s. 64(1) of that Act?",
      "speaker": "court",
      "significance": "Frames the core legal issue."
    },
    {
      "text": "If the order as to the number of permits is a general order passed under s. 47(3)... it must follow a fortiori that the decision as to whether the new route is necessary or not is equally a general order... not appealable under s. 64(1).",
      "speaker": "court",
      "significance": "Key reasoning on appealability."
    }
  ],
  "_case_id": "1969_108",
  "_label": 0,
  "_text_length": 13345,
  "_extracted_at": "2026-02-10T20:26:02.913476"
}