{
  "metadata": {
    "case_name": "Arshad Ahmad & Fazal Hussain v. State of Jammu & Kashmir",
    "case_year": 1969,
    "court": "Supreme Court of India",
    "judges": [
      "Sikri, J."
    ],
    "case_number": "Writ Petition No. 111 of 1969",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Arshad Ahmad was detained in pursuance of Detention Order dated September 19, 1967, passed under s. 3(1)(a)(i) of the Jammu & Kashmir Preventive Detention Act, 1964.",
      "type": "material",
      "date": "1967-09-19",
      "source": "respondent"
    },
    {
      "id": "f2",
      "text": "Detention order served on Arshad Ahmad by Jaswant Singh, Deputy Superintendent of Police CID, Jammu on September 27, 1967.",
      "type": "procedural",
      "date": "1967-09-27",
      "source": "respondent"
    },
    {
      "id": "f3",
      "text": "No grounds of detention were served on Arshad Ahmad, but an order dated October 25, 1967, issued by the Secretary to the Government, Home Department, was served on him informing him that it would be against the public interest to disclose the facts or the grounds of detention.",
      "type": "procedural",
      "date": "1967-10-25",
      "source": "respondent"
    },
    {
      "id": "f4",
      "text": "Fazal Hussain was detained by order dated January 3, 1968, passed under s. 3(1) read with s. 5 of the Jammu & Kashmir Preventive Detention Act, 1964.",
      "type": "material",
      "date": "1968-01-03",
      "source": "respondent"
    },
    {
      "id": "f5",
      "text": "Detention order served on Fazal Hussain in the Central Jail on January 8, 1968, and the same was read out to him.",
      "type": "procedural",
      "date": "1968-01-08",
      "source": "respondent"
    },
    {
      "id": "f6",
      "text": "By order dated January 11, 1968, Fazal Hussain was informed that it was against public interest to disclose facts or to communicate to him the grounds on which the detention order was passed.",
      "type": "procedural",
      "date": "1968-01-11",
      "source": "respondent"
    },
    {
      "id": "f7",
      "text": "Affidavit stating facts for Fazal Hussain sworn to by the Additional Secretary to the Government, Jammu and Kashmir, Home Department, on the basis of information derived from the record of the case.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "Endorsement below the detention order for Fazal Hussain: 'The notice of this order has been served upon Shri Fazal Hussain s/o Ayub Khan detenu by reading over the same to him. Sd/- Dy. Superintendent Central Jail, Jammu 8/1'.",
      "type": "procedural",
      "date": "1968-01-08",
      "source": "respondent"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the order dated October 25, 1967 under the proviso to s. 8 of the Jammu & Kashmir Preventive Detention Act, 1964, served after more than ten days from detention, renders the detention of Arshad Ahmad legal.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether the affidavit affirming service of detention order on Fazal Hussain should have been filed by the Deputy Superintendent Central Jail instead of the Additional Secretary.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The order dated October 25, 1967, was served too late and the detention of Arshad Ahmad became illegal when the time for serving the grounds of detention had expired.",
      "supporting_facts": [
        "f1",
        "f2",
        "f3"
      ],
      "legal_basis": "Section 8 of the Jammu & Kashmir Preventive Detention Act, 1964"
    },
    {
      "id": "pa2",
      "text": "The Deputy Superintendent Central Jail, who is alleged to have served the order of detention on Fazal Hussain, should have filed the affidavit.",
      "supporting_facts": [
        "f5",
        "f7"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "If an order has been made under the proviso to s. 8, it does not matter whether the order is made and served beyond the ten days time specified in s. 8.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": "Proviso to s. 8 of the Jammu & Kashmir Preventive Detention Act, 1964"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "It is the duty of the detaining authority to communicate the grounds within ten days of the date of detention if the case does not fall within the proviso. If the detaining authority neither communicates the grounds nor informs the detenu under the proviso within 10 days, the detention becomes illegal and a subsequent order under the proviso would not render the detention legal.",
      "addresses_issue": "i1",
      "key_observation": "The power under the proviso must be exercised before the lapse of ten days."
    },
    {
      "id": "cr2",
      "text": "Similar point arose in Abdul Jabar Butt v. State of Jammu & Kashmir; provisions are similar. Power to issue declaration under proviso should be exercised before the result of non-communication sets in.",
      "addresses_issue": "i1",
      "key_observation": "Construction must protect liberty of subject; executive cannot make order under proviso after ten days."
    },
    {
      "id": "cr3",
      "text": "In view of the endorsement on the detention order, it was not necessary that the Deputy Superintendent Central Jail should have filed an affidavit to affirm service.",
      "addresses_issue": "i2",
      "key_observation": "Endorsement sufficient proof of service."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Detention of Arshad Ahmad is illegal as the order under proviso to s. 8 was served beyond ten days from detention.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Endorsement on detention order suffices to prove service on Fazal Hussain; no need for separate affidavit by Deputy Superintendent.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Abdul Jabar Butt v. State of Jammu & Kashmir",
      "citation": "1957 S.C.R. 51, 59",
      "treatment": "followed",
      "relevance": "Similar provisions under earlier Jammu & Kashmir Preventive Detention Act; grounds must be communicated within time or proviso invoked timely to avoid illegal detention."
    }
  ],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Article 32"
      ],
      "relevance": "Basis for writ petition seeking habeas corpus."
    },
    {
      "name": "Jammu & Kashmir Preventive Detention Act, 1964",
      "sections": [
        "s. 3(1)(a)(i)",
        "s. 3(1) read with s. 5",
        "s. 8 and proviso"
      ],
      "relevance": "Governs detention orders, service of grounds within 10 days unless proviso invoked timely against public interest."
    }
  ],
  "outcome": {
    "disposition": "partially_accepted",
    "summary": "Petition allowed for Arshad Ahmad; his detention declared illegal and he directed to be released. Petition dismissed for Fazal Hussain as service of detention order properly affirmed by endorsement.",
    "relief_granted": "Arshad Ahmad to be released forthwith.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"If the detaining authority neither communicates the grounds of detention nor informs the detenu under the proviso within 10 days of the detention, the detention would become illegal and a subsequent order under the proviso would not have the effect of rendering the detention legal.\"",
      "speaker": "court",
      "significance": "Core holding on timeliness of proviso invocation."
    },
    {
      "text": "\"We are here concerned with the liberty of a subject and we must adopt a construction which would not have the effect of enabling the executive to make an order under the proviso at any time after the lapse of ten days specified in s. 8.\"",
      "speaker": "court",
      "significance": "Emphasizes protection of personal liberty."
    }
  ],
  "_case_id": "1969_72",
  "_label": 0,
  "_text_length": 6718,
  "_extracted_at": "2026-02-10T20:25:09.333030"
}