{
  "metadata": {
    "case_name": "Vizagapatam Dock Labour Board v. Visakhapatnam Stevedores Association & Ors.",
    "case_year": 1968,
    "court": "Supreme Court of India",
    "judges": [
      "Vaidialingam, J."
    ],
    "case_number": "Civil Appeal No. 2113 of 1968",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Central Government by order dated April 13, 1967 referred to Industrial Tribunal, Andhra Pradesh the question whether demand for bonus to Dock Labour Board Workers at Visakhapatnam Port for accounting years 1964-65, 1965-66 and 1966-67 was justified and if so at what rate.",
      "type": "procedural",
      "date": "1967-04-13",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Parties to reference: Board, Visakhapatnam Stevedores Association, certain individual Stevedores, Port Khalasis Union and Dock Workers Union.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Unions filed statements of claim demanding bonus at 14 paise per ton for 1964-65, 15 paise for 1965-66, 16 paise for 1966-67, claiming against Stevedores as registered employers, citing similar agreements in Calcutta, Cochin, Madras, Bombay.",
      "type": "material",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "Work at Visakhapatnam similar to other ports; all governed by Dock Workers (Regulation of Employment) Act 1948 and Vizagapatam Dock Workers Regulation of Employment Scheme, 1959.",
      "type": "background",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "Visakhapatnam Stevedores Association and members contested claim, urged Dock Workers are workmen of Board, not of Stevedores; Association not necessary party.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f6",
      "text": "Board filed written statement contesting Stevedores' claim that they are not employers; Board is statutory body under Act and Scheme, not carrying on industry; Stevedores carry on stevedoring industry; claim against Stevedores should not be converted against Board.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "Board filed additional statement: Stevedores Association appointed as Administrative Body, deemed agent for employers.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "Industrial Tribunal held Board is employer of dock workers, liable for tonnage bonus; awarded 13 paise per ton for 1964-65, 14 paise for 1965-66, 15 paise for 1966-67.",
      "type": "procedural",
      "date": "1968-05-24",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Board maintains Dock Labour pool; Stevedores contract with ship-owners, inform Board of labour needs, Board supplies labour with supervisors; Stevedores pay Board wages plus 10% General Welfare Levy; cannot engage outside labour or discipline workers directly.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Gang of workmen may work for different Stevedores on different days or same day.",
      "type": "background",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether Tribunal acted illegally and without jurisdiction in making Board liable for bonus when claim was against Stevedores Association and members.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether employer-employee relationship exists between Board and Dock Labour workmen under Act and Scheme, making Board liable for bonus.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Tribunal lacked jurisdiction to make Board liable as Unions' claim was specifically against Stevedores Association and members; claim should not be converted.",
      "supporting_facts": [
        "f3",
        "f5",
        "f6"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Board is statutory body administering Scheme, not employer; no master-servant relationship; functions not 'industry' under Industrial Disputes Act; Stevedores are employers carrying on stevedoring industry.",
      "supporting_facts": [
        "f6",
        "f9",
        "f10"
      ],
      "legal_basis": "Dock Workers (Regulation of Employment) Act 1948; Scheme 1959; Industrial Disputes Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Claim was for bonus against Board or Tribunal justified in considering who liable; Board is employer.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Dock workers are workmen of Board; master-servant ingredients exist.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": "Dock Workers (Regulation of Employment) Act 1948; Scheme"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Claim by Unions specifically against Stevedores as registered employers, citing their profits; references in statements confirm; Tribunal understood claim against Stevedores but erroneously held Board liable.",
      "addresses_issue": "i1",
      "key_observation": "Tribunal not justified in making Board liable contrary to pleadings and claim."
    },
    {
      "id": "cr2",
      "text": "Board administers Scheme for regularity of employment; allocates labour from pool as agent; workers under directions of Stevedores when allotted; Stevedores pay wages via Board; no master-servant between Board and workers.",
      "addresses_issue": "i2",
      "key_observation": "Board not employer; registered employer (Stevedores) is employer for allotted work."
    },
    {
      "id": "cr3",
      "text": "Board's functions (registration, wage fixation, discipline) statutory for Scheme administration, not industry; nexus requires employer-employee for industry under Industrial Disputes Act.",
      "addresses_issue": "i2",
      "key_observation": "Board carries no industry."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Tribunal erred in holding Board liable for bonus as claim was against Stevedores.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "No employer-employee relationship between Board and dock workers; Board not carrying on industry.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Kirloskar Oil Engines v. Hanmant Laxman Bibawe",
      "citation": "1963 3 S.C.R. 514",
      "treatment": "followed",
      "relevance": "No master-servant despite directions, based on scheme facts."
    },
    {
      "case_name": "C.V.A. Hydross Son v. Joseph Sanjon",
      "citation": "1967 1 L.L.J. 509",
      "treatment": "doubted",
      "relevance": "Kerala HC held Board employer; Court disagrees."
    },
    {
      "case_name": "A.C. Roy Co. Ltd. v. Taslim",
      "citation": "71 C.W.N. 531",
      "treatment": "followed",
      "relevance": "Calcutta HC: Worker allotted from pool becomes employee of registered employer."
    },
    {
      "case_name": "Gymkhana Club Union v. Management",
      "citation": "1968 1 S.C.R. 742",
      "treatment": "followed",
      "relevance": "Test for 'industry': nexus between employer-employees; occupation nature."
    }
  ],
  "statutes_cited": [
    {
      "name": "Dock Workers (Regulation of Employment) Act, 1948",
      "sections": [
        "Section 2",
        "Section 3",
        "Section 4",
        "Section 5",
        "Section 5A",
        "Section 5B"
      ],
      "relevance": "Defines Board, dock worker, employer, scheme; constitutes Board to administer scheme; regulates employment."
    },
    {
      "name": "Vizagapatam Dock Workers (Regulation of Employment) Scheme, 1959",
      "sections": [
        "Clause 2",
        "Clause 3",
        "Clause 5",
        "Clause 7",
        "Clause 8",
        "Clause 9",
        "Clause 11",
        "Clause 14",
        "Clause 18",
        "Clause 30-33",
        "Clause 36",
        "Clause 37",
        "Clause 38",
        "Clause 40",
        "Clause 44",
        "Clause 46",
        "Clause 51-53"
      ],
      "relevance": "Regulates registration, allocation of labour, payments, agency role of Administrative Body, obligations; Board not employer."
    },
    {
      "name": "Industrial Disputes Act",
      "sections": [],
      "relevance": "Bonus claim under; requires industry and employer-employee relation."
    },
    {
      "name": "Payment of Wages Act, 1936",
      "sections": [],
      "relevance": "Implied contract terms for wages, etc."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; Tribunal award dated May 24, 1968 set aside; matter remanded to Industrial Tribunal for adjudication of claim against Stevedores Association and members, excluding Board; Tribunal at liberty to call supplementary statements and evidence.",
    "relief_granted": "Board exonerated; remand for Stevedores' liability.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"the claim for payment of bonus by the dock workers was essentially and in the main directed against the Stevedores Association and its members.\"",
      "speaker": "court",
      "significance": "Determines misdirection of liability by Tribunal."
    },
    {
      "text": "\"the Board cannot be considered to be the employer of the Dock Labour workmen.\"",
      "speaker": "court",
      "significance": "Core holding on no master-servant relationship."
    },
    {
      "text": "\"Industry is the nexus between employers and employees and it is this nexus which brings two distinct bodies together to produce a result.\"",
      "speaker": "court",
      "significance": "Explains why Board not engaged in industry."
    }
  ],
  "_case_id": "1969_100",
  "_label": 1,
  "_text_length": 39184,
  "_extracted_at": "2026-02-10T20:26:03.796681"
}