{
  "metadata": {
    "case_name": "Goburdhun v. Respondent No. 1",
    "case_year": 1966,
    "court": "Supreme Court of India",
    "judges": [
      "Mitter, J."
    ],
    "case_number": "Civil Appeal No. 2588 of 1966",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Partition suit launched in 1943 against a number of persons, main relief being partition of four annas Milkiat interest in Touzi No. 702, Tappa Haveli, Pargana Maheshi, District Champaran, Bihar.",
      "type": "material",
      "date": "1943",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Subordinate Judge of Motihari made a preliminary decree for partition declaring the first respondent's share in the property as claimed by him.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f3",
      "text": "High Court in appeal modified the decree reducing the plaintiff's share to Rs. 0-1-4 interest only.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f4",
      "text": "Supreme Court in further appeal upheld the trial court's preliminary decree on 5th October 1953.",
      "type": "procedural",
      "date": "1953-10-05",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Bihar Land Reforms Act, 1950 came into force on 25th September, 1950.",
      "type": "background",
      "date": "1950-09-25",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "First appellant made an application to the trial court in June 1958 praying that the proceedings for final decree be treated as having abated in view of the vesting of all estates in land in the State of Bihar.",
      "type": "procedural",
      "date": "1958-06",
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "Subordinate Judge accepted the application by order dated July 12, 1958.",
      "type": "procedural",
      "date": "1958-07-12",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Patna High Court allowed the appeal by judgment dated January 14, 1964 in First Appeal No. 572 of 1958, directing that the partition suit be allowed to proceed.",
      "type": "procedural",
      "date": "1964-01-14",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Bone of contention is the extensive bakasht lands in the aforesaid Mouza.",
      "type": "disputed",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the direction of the High Court that the partition suit launched in 1943 should be allowed to proceed in view of the provisions of s. 6 of the Bihar Land Reforms Act, 1950 which came into force on 25th September, 1950, is correct.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Under s. 6 of the Act all bakasht lands vested in the State and came to be held by the persons in khas possession thereof as raiyats under the State.",
      "supporting_facts": [
        "f5",
        "f9"
      ],
      "legal_basis": "Bihar Land Reforms Act, 1950 s.6"
    },
    {
      "id": "pa2",
      "text": "The consequence of s. 6 was to put an end to the character of the possession of the bakasht lands to the malik by causing them to vest in the State and simultaneously creating a tenancy in favour of the person in khas possession thereof. Bakasht lands fall under categories (b) and (c). Even if the plaintiff had a right to ask for demarcation of his share before the Act, he could not pursue his claim by a prayer that he be considered a tenant along with those in actual khas possession.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": "Bihar Land Reforms Act, 1950 s.6(1)(b), s.6(1)(c)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Opposed the abatement; suit should proceed.",
      "supporting_facts": [],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Object of the Bihar Land Reforms Act was to cause transference to the State of the interest of proprietors and tenure-holders in land etc. S.3 enables vesting by notification, s.4 sets consequences including vesting of estate free from encumbrances except interests saved. S.6 saves lands in khas possession of intermediary on date of vesting, deemed settled with intermediary as raiyat.",
      "addresses_issue": "i1",
      "key_observation": "Bakasht lands fall under s.6(1)(b) and (c)."
    },
    {
      "id": "cr2",
      "text": "Broad proposition that s.6 ends character of possession and creates new tenancy rejected. Even if appellants in actual khas possession, plaintiff co-sharer in constructive possession through them as possession of one co-sharer is possession of all.",
      "addresses_issue": "i1",
      "key_observation": "Deeming provision of s.6 enures for benefit of all who in eye of law in actual possession."
    },
    {
      "id": "cr3",
      "text": "Discussed precedents: Full Bench Patna held bakasht lands form substituted security, co-sharer has claim via constructive possession. Supreme Court cases distinguish: khas possession requires actual cultivation etc., not mere title; constructive possession for co-sharers applies.",
      "addresses_issue": "i1",
      "key_observation": "Equation of right to possession with khas possession not justified."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Plaintiff who was a co-sharer was in constructive possession through the appellants; deeming provision of s.6 enures for benefit of all co-sharers.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Mahanth Sukhdeo Das v. Kashi Prasad Tewari and Shrideo Misra v. Ramsewak Singh",
      "citation": "I.L.R. 37 Patna 918",
      "treatment": "followed",
      "relevance": "Full Bench Patna: bakasht lands deemed settled with ex-proprietor form substituted security for mortgage; co-sharer proprietor not in actual possession has claim via constructive possession."
    },
    {
      "case_name": "Surajnath Ahir v. Prithinath Singh",
      "citation": "1963-3 S.C.R. 290",
      "treatment": "followed",
      "relevance": "Khas possession requires actual possession by cultivation etc.; mere title to possession not sufficient for s.6(1)(c)."
    },
    {
      "case_name": "Ram Ran Bijai Singh v. Behari Singh alias Bagandha Singh",
      "citation": "1964 3 S.C.R. 363",
      "treatment": "followed",
      "relevance": "Possession of contesting defendants adverse; constructive possession treated within khas possession but not for adverse possessors or tenants claiming independent title."
    },
    {
      "case_name": "S. P. Shah v. B. N. Singh",
      "citation": "1969 3 S.C.R. 908",
      "treatment": "distinguished",
      "relevance": "Deemed settlement under s.6 creates new tenancy rights separate from vesting; applies to mortgage creditors seeking remedies under Chapter IV."
    },
    {
      "case_name": "Brijnandan Singh v. Jamuna Prasad",
      "citation": "A.I.R. 1958 Patna 580",
      "treatment": "referred",
      "relevance": "High Court construction of khas possession rejected."
    },
    {
      "case_name": "P. L. Reddy v. L. L. Reddy",
      "citation": null,
      "treatment": "referred",
      "relevance": "Observations on constructive possession applicable."
    }
  ],
  "statutes_cited": [
    {
      "name": "Bihar Land Reforms Act, 1950",
      "sections": [
        "s. 3",
        "s. 4",
        "s. 6",
        "s. 2(k)",
        "s. 14"
      ],
      "relevance": "Vesting of estates (s.3,4); saving of khas possession lands deemed settled as raiyati (s.6); definition of khas possession (s.2(k)); claims for debts (s.14, Chapter IV)."
    },
    {
      "name": "Chota Nagpur Tenancy Act, 1908",
      "sections": [
        "s. 43"
      ],
      "relevance": "Landlords privileged lands let out under registered lease."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal is dismissed. The High Court's direction allowing the partition suit to proceed is upheld, as the co-sharer plaintiff is entitled to constructive possession of bakasht lands under s.6 of the Bihar Land Reforms Act, 1950.",
    "relief_granted": "Partition suit to proceed",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The deeming provision of s. 6 must therefore enure for the benefit of all who in the eye of law would be regarded as in actual possession.",
      "speaker": "court",
      "significance": "Core holding on constructive possession for co-sharers."
    },
    {
      "text": "We consider that this equation of the right to possession with khas possession is not justified by principle or authority.",
      "speaker": "court",
      "significance": "Rejects appellants' broad proposition on s.6."
    },
    {
      "text": "The mere fact that a proprietor has a subsisting title to possession over certain land on the date of vesting would not make that land under his khas possession.",
      "speaker": "court",
      "significance": "Clarifies definition of khas possession from precedent."
    }
  ],
  "_case_id": "1971_106",
  "_label": 0,
  "_text_length": 15718,
  "_extracted_at": "2026-02-10T20:14:57.435375"
}