{
  "metadata": {
    "case_name": "Appellant v. Respondent",
    "case_year": 1970,
    "court": "Supreme Court of India",
    "judges": [
      "Mitter, J."
    ],
    "case_number": "Civil Appeal No. 1794 of 1970",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appeal from the judgment and order dated October 28, 1969 of the Mysore High Court in Tax Referred Case No. 12 of 1967.",
      "type": "procedural",
      "date": "1969-10-28",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Companies (Profits) Surtax Act, 1964 received assent of President on 2nd May, 1964.",
      "type": "background",
      "date": "1964-05-02",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "First assessment year under the Act commencing on 1st April 1964; previous year 1st April 1963 to 31st March 1964.",
      "type": "background",
      "date": "1963-04-01",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Directors of respondent appropriated three sums out of profits of year ending 31st March 1963 on 8th August 1963: Rs. 2,56,000 as plant modernisation and rehabilitation reserve; Rs. 1,00,000 as loan redemption reserve; Rs. 89,557/- as development rebate reserve.",
      "type": "material",
      "date": "1963-08-08",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "These appropriations proposed by directors in their report to general body of shareholders.",
      "type": "material",
      "date": "1963-03-31",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Capital of company computed as on first day of previous year relevant to assessment year i.e. 1st April 1963 per Rule 1 of Second Schedule to the Act.",
      "type": "material",
      "date": "1963-04-01",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether three several sums appropriated by the Directors of the respondent towards reserves on the 8th August 1963 out of the profits of the year ending 31st March, 1963 should be added to other items for computation of the capital of the respondent as on the 1st day of April, 1963 in terms of rule 1 of the Second Schedule to the Companies (Profits) Surtax Act, 1964.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "These appropriations having been made on the 8th August, 1963 could not be treated as components of capital as on the first day of the previous year i.e. 1-4-1963; on 1st April 1963 they only formed part of mass of undistributed profits, no portion earmarked or set apart for any particular purpose.",
      "supporting_facts": [
        "f4",
        "f6"
      ],
      "legal_basis": "Rule 1 of the Second Schedule to the Companies (Profits) Surtax Act, 1964"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The appropriations should be treated as components of capital as on 1st April 1963.",
      "supporting_facts": [
        "f4",
        "f5",
        "f6"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Accounts made up to 31st March 1963; though directors decided later on 8th August 1963, their determination to appropriate sums to reserves must be related to 1st April 1963 and treated as effective from that day; fact that calculation took time does not change nature of appropriation.",
      "addresses_issue": "i1",
      "key_observation": "Appropriation of profits to reserves determined after 1st April 1963 relates back to 1st April 1963."
    },
    {
      "id": "cr2",
      "text": "Cites Commissioner of Income-tax, Delhi v. Aryodaya Ginning Manufacturing Co. Ltd. (Bombay High Court) where similar appropriations had retrospective effect from end of accounting year.",
      "addresses_issue": "i1",
      "key_observation": "Reserves shown in balance sheet as of 31st December 1948 accepted by shareholders later as effective from that date."
    },
    {
      "id": "cr3",
      "text": "Distinguishes Commissioner of Income-tax v. Vasantha Mills Ltd. (Madras High Court); allocation on later day treated as effective from first day.",
      "addresses_issue": "i1",
      "key_observation": "No reserve until allocation, but allocation relates back."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The three reserves must be included in computation of capital as on 1st April 1963.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Commissioner of Income-tax, Delhi v. Aryodaya Ginning Manufacturing Co. Ltd.",
      "citation": "31 I.T.R. 145",
      "treatment": "followed",
      "relevance": "Resolutions appropriating profits to reserves after accounting year end have retrospective effect as of the end of that year."
    },
    {
      "case_name": "Commissioner of Income-tax v. Vasantha Mills Ltd.",
      "citation": null,
      "treatment": "distinguished",
      "relevance": "Dissent from Bombay view that no reserve until actual allocation; court holds later allocation effective from first day."
    }
  ],
  "statutes_cited": [
    {
      "name": "Companies (Profits) Surtax Act, 1964",
      "sections": [
        "Section 2(3)",
        "Section 2(5)",
        "Section 2(8)",
        "Section 4",
        "Second Schedule Rule 1",
        "Third Schedule"
      ],
      "relevance": "Imposes surtax on companies; defines chargeable profits, statutory deductions based on capital computed per Second Schedule; capital includes reserves as on first day of previous year."
    },
    {
      "name": "Income-tax Act, 1961",
      "sections": [
        "Section 34(3)"
      ],
      "relevance": "Reserves created under this section included in capital."
    },
    {
      "name": "Indian Income-tax Act, 1922",
      "sections": [
        "Section 10(2)(vi-b) proviso (b)"
      ],
      "relevance": "Reserves created under this proviso included in capital."
    },
    {
      "name": "Companies Act, 1956",
      "sections": [
        "Schedule VI Part I"
      ],
      "relevance": "Explanation to Rule 1 excludes certain items under RESERVES AND SURPLUS or CURRENT LIABILITIES from reserves for capital computation."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court held that the three reserves appropriated on 8th August 1963 from profits ending 31st March 1963 must be treated as part of the company's capital as on 1st April 1963 for surtax purposes, rejecting the appellant's contention.",
    "relief_granted": "Respondent's position upheld; reserves included in capital computation.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "Their determination to appropriate the sums mentioned to the three separate classes of reserves on the 8th August 1963 must be related to the 1st of April 1963 i.e. the beginning of the accounts for the new year and must be treated as effective from that day.",
      "speaker": "court",
      "significance": "Core holding on retrospective effect of reserve appropriations."
    },
    {
      "text": "the fact that they could not do so for the simple reason that the calculation and collection of figures of all the items of income, expenditure of the company for the year ending March 31, 1963 was bound to take some time cannot make any difference to the nature or quality of the appropriation of the profits to reserves",
      "speaker": "court",
      "significance": "Explains why post-dated appropriation relates back."
    }
  ],
  "_case_id": "1971_187",
  "_label": 0,
  "_text_length": 10022,
  "_extracted_at": "2026-02-10T20:14:54.601366"
}