{
  "metadata": {
    "case_name": "Appellant v. Block Development Officer Purulia & Ors.",
    "case_year": 1968,
    "court": "Supreme Court of India",
    "judges": [
      "Ray, J."
    ],
    "case_number": "Criminal Appeal No. 291 of 1968",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant filed a petition of complaint on 8 March 1966 against the Block Development Officer Purulia, the Officer-in-Charge of the local Police Station and T. Ganguly, the Deputy Superintendent of Police, Purulia under section 395 of the Indian Penal Code alleging that during search of the appellant's house they committed dacoity in the house.",
      "type": "material",
      "date": "1966-03-08",
      "source": "petitioner"
    },
    {
      "id": "f2",
      "text": "The Magistrate dismissed the complaint under section 203 of the Code of Criminal Procedure on the ground that the complaint was incompetent without sanction as the accused were Government servants.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f3",
      "text": "The complainant thereafter moved the Sessions Judge, Purulia against the order of dismissal. A reference was made to the Calcutta High Court.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "The learned Single Judge of the Calcutta High Court accepted the reference, set aside the order of the Magistrate and sent the case back for proceeding in accordance with law.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "On 27 March 1967 the Magistrate Shri S. K. Ganguly took cognizance of the case and fixed a date for holding judicial enquiry.",
      "type": "procedural",
      "date": "1967-03-27",
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "The Magistrate on 22 November 1967 came to the conclusion that a prima facie case under section 395 of the Indian Penal Code had been made out against the three accused and submitted a report to the Sub-Divisional Magistrate, Purulia.",
      "type": "procedural",
      "date": "1967-11-22",
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "The Sub-Divisional Magistrate, Purulia on receipt of the report of the judicial enquiry passed an order on 6 December 1967 directing the issue of process against all the three accused.",
      "type": "procedural",
      "date": "1967-12-06",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Process was issued by the Magistrate Shri S. Sarkar.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "One of the accused thereafter moved the High Court at Calcutta for quashing the process.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f10",
      "text": "The High Court at Calcutta held that cognizance of the offence was taken by the Magistrate Shri S. K. Ganguly but process was issued by the Magistrate Shri S. Sarkar and held that Shri Sarkar not having taken cognizance of the offence had no right to issue process under section 204 of the Code of Criminal Procedure.",
      "type": "procedural",
      "date": "1968-03-28",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "The High Court quashed the process and observed that the learned Magistrate who had taken cognizance of the offence if he was so advised would be at liberty to issue processes against the other two accused persons.",
      "type": "procedural",
      "date": "1968-03-28",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Appeal by special leave to Supreme Court from the judgment dated 28 March 1968 of the Calcutta High Court in Criminal Revision No. 159 of 1968.",
      "type": "procedural",
      "date": "1968-03-28",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether Shri Sarkar could have issued process when cognizance was taken by Shri S. K. Ganguly without any order of transfer of the case.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the High Court under section 561-A of the Code of Criminal Procedure could go into the question as to whether a prima facie case was established.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The High Court should not have gone to the question as to whether a prima facie case was established or not.",
      "supporting_facts": [
        "f10"
      ],
      "legal_basis": "Section 561-A of the Code of Criminal Procedure"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Cognizance was taken by Shri Ganguly but process issued by Shri Sarkar who had not taken cognizance and thus had no right to issue process under section 204 CrPC.",
      "supporting_facts": [
        "f5",
        "f8",
        "f10"
      ],
      "legal_basis": "Section 204 of the Code of Criminal Procedure"
    },
    {
      "id": "ra2",
      "text": "Evidence came from tainted sources and was not reliable, amounting to no case to go to the jury.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Under section 204 CrPC, the Magistrate who took cognizance could issue process. Sections 191 and 192 CrPC contemplate transfer of cases by a Magistrate who has taken cognizance.",
      "addresses_issue": "i1",
      "key_observation": "No order of transfer from Shri Ganguly to Shri Sarkar."
    },
    {
      "id": "cr2",
      "text": "Section 202 CrPC allows a Magistrate to whom case transferred to issue process after postponing for reasons recorded, but power under 202 is not limited by 204.",
      "addresses_issue": "i1",
      "key_observation": "Issue of process is judicial determination after examining complainant under section 200."
    },
    {
      "id": "cr3",
      "text": "High Court under section 561A can go into whether there is any legal evidence; finding of tainted unreliable evidence means no case.",
      "addresses_issue": "i2",
      "key_observation": "High Court correctly quashed process against T. Ganguly."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The Magistrate who took cognizance or to whom case transferred can issue process; without transfer, Shri Sarkar could not issue under section 204 CrPC.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "High Court correctly quashed the process.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "Section 395"
      ],
      "relevance": "Offence alleged: dacoity during house search"
    },
    {
      "name": "Code of Criminal Procedure",
      "sections": [
        "Section 203",
        "Section 200",
        "Section 204",
        "Section 202",
        "Section 191",
        "Section 192",
        "Section 561A"
      ],
      "relevance": "Governing procedure for complaints, cognizance, issue of process, transfers, and High Court inherent powers"
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court dismissed the appeal, upholding the Calcutta High Court's order quashing the processes issued by Shri S. Sarkar against the three accused, as cognizance was taken by Shri S. K. Ganguly without transfer of the case.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The issue of process is a matter for judicial determination. Before issuing a process the Magistrate has to examine the complainant.",
      "speaker": "court",
      "significance": "Explains why only cognizance-taking or transferee Magistrate can issue process"
    },
    {
      "text": "When the High Court said that the evidence in the present case came from tainted sources and was not reliable the High Court meant what can be described as no case to go to the jury.",
      "speaker": "court",
      "significance": "Justifies High Court's quashing on merits of evidence under s.561A"
    }
  ],
  "_case_id": "1971_522",
  "_label": 0,
  "_text_length": 5846,
  "_extracted_at": "2026-02-10T20:19:14.432261"
}