{
  "metadata": {
    "case_name": "State of Madras (Appellant) v. Assessee (Respondent)",
    "case_year": 1968,
    "court": "Supreme Court of India",
    "judges": [
      "Hegde, J."
    ],
    "case_number": "Civil Appeal No. 2186 of 1968",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The assessee is a dealer in Hides and Skins at Madras.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Assessment for the year 1958-59 was made on March 24, 1961.",
      "type": "procedural",
      "date": "1961-03-24",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Assessing officer and Appellate Assistant Commissioner disallowed two exemptions claimed by the assessee on the ground of interpolation in relative documents covering the turnover.",
      "type": "disputed",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f4",
      "text": "Appellate Assistant Commissioner enhanced the assessment on August 16, 1962 while disposing of the assessee's appeal.",
      "type": "procedural",
      "date": "1962-08-16",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Tribunal reversed the finding of interpolation and allowed the two exemptions.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "Tribunal held that Appellate Assistant Commissioner had no power to enhance the assessment, following Deputy Commissioner of Commercial Taxes v. Sri Swami and Company.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Madras High Court dismissed State's revision petition on July 3, 1967 in Tax Case No. 250 of 1964 (Revision No. 172).",
      "type": "procedural",
      "date": "1967-07-03",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Sales tax levied under Madras Sales Tax Act, 1939 until March 31, 1956; repealed by Madras General Sales Tax Act, 1959 effective April 1, 1959.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Assessee's appeal filed under Section 31 of 1959 Act.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Before enhancing, Appellate Assistant Commissioner gave opportunity to assessee to show cause.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the High Court was right in holding that the Appellate Assistant Commissioner of Commercial Taxes was incompetent to enhance the assessment of the assessee.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the High Court was justified in holding that the additional exemptions granted by the Tribunal were justified by the evidence on record.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Appellate Assistant Commissioner had power to enhance under Section 31 of 1959 Act; changes in machinery provisions did not affect vested rights.",
      "supporting_facts": [
        "f4",
        "f9"
      ],
      "legal_basis": "Section 31, Madras General Sales Tax Act, 1959"
    },
    {
      "id": "pa2",
      "text": "No vested right in procedure; 1959 Act simplified procedure without taking away substantive rights.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": "Section 61, Madras General Sales Tax Act, 1959"
    },
    {
      "id": "pa3",
      "text": "Reliance on Velukutty v. Kerala Sales Tax Appellate Tribunal.",
      "supporting_facts": [],
      "legal_basis": "Velukutty v. Kerala Sales Tax Appellate Tribunal"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Under 1939 Act, appellate authority could not enhance assessment; this immunity was a vested right protected by Section 61 of 1959 Act.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": "Section 61, Madras General Sales Tax Act, 1959; Madras Sales Tax Act, 1939"
    },
    {
      "id": "ra2",
      "text": "Section 61(2) of 1959 Act merely provides for transfer of pending appeals without enlarging powers.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": "Section 61(2), Madras General Sales Tax Act, 1959"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Second issue has no merit; Tribunal's finding of no interpolation is a finding of fact not to be interfered with.",
      "addresses_issue": "i2",
      "key_observation": "Tribunal's finding of fact upheld as High Court declined to interfere."
    },
    {
      "id": "cr2",
      "text": "1959 Act conferred power to enhance on Appellate Assistant Commissioner for first time, combining appellate and special powers under 1939 Act; no infringement of vested rights.",
      "addresses_issue": "i1",
      "key_observation": "No vested right in mere procedure; new procedure governs pending cases."
    },
    {
      "id": "cr3",
      "text": "Purpose of both Acts identical: prevent over-assessment or revenue loss; 1959 Act simplifies machinery without touching substance.",
      "addresses_issue": "i1",
      "key_observation": "Time limits for enhancement generally favour assessee."
    },
    {
      "id": "cr4",
      "text": "Section 61(1) preserves rights under repealed Act but 1959 Act provisions apply to pending appeals; no right infringed.",
      "addresses_issue": "i1",
      "key_observation": "Assessee filed appeal under 1959 Act."
    },
    {
      "id": "cr5",
      "text": "Deputy Commissioner v. Sri Swami and M. Balasundaram wrongly decided; no vested right against enhancement under 1939 Act as Revenue had revisional powers.",
      "addresses_issue": "i1",
      "key_observation": "Assessee had no absolute immunity."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Appellate Assistant Commissioner had power to enhance assessment under Section 31 of 1959 Act.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Tribunal's grant of exemptions justified as finding of fact.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "No vested right infringed by 1959 Act; decisions in Sri Swami and Balasundaram cases incorrect.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Deputy Commissioner of Commercial Taxes, Madras Division v. Sri Swami and Company",
      "citation": "13 S.T.C. 468",
      "treatment": "distinguished",
      "relevance": "Tribunal followed it; HC relied; SC holds observations incorrect."
    },
    {
      "case_name": "Deputy Commissioner of Commercial Taxes, Madras Division v. M. Balasundaram and Co.",
      "citation": "14 S.T.C. 996",
      "treatment": "overruled",
      "relevance": "HC relied; SC holds wrongly decided."
    },
    {
      "case_name": "Velukutty v. Kerala Sales Tax Appellate Tribunal, Trivandrum and Ors.",
      "citation": null,
      "treatment": "followed",
      "relevance": "Supports power to enhance under new Act for pending appeals."
    }
  ],
  "statutes_cited": [
    {
      "name": "Madras Sales Tax Act, 1939",
      "sections": [
        "Section 2(a-2)",
        "Section 2(a-3)",
        "Section 2(b-1)",
        "Section 2-B",
        "Section 2-A",
        "Section 11",
        "Section 9",
        "Section 12(1)",
        "Section 12(2)",
        "Section 12-A",
        "Section 12-B"
      ],
      "relevance": "Governed assessments pre-1959; limited appellate powers, no enhancement by appellate authority; special revisional powers."
    },
    {
      "name": "Madras General Sales Tax Act, 1959",
      "sections": [
        "Section 2(c)",
        "Section 28(3)",
        "Section 31",
        "Section 38",
        "Section 61",
        "Section 66"
      ],
      "relevance": "Repealed 1939 Act; conferred enhancement power on Appellate Assistant Commissioner; Section 61 preserves rights but applies new procedure to pending appeals."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Supreme Court allowed the appeal by certificate, set aside the Madras High Court decision, holding that the Appellate Assistant Commissioner had power to enhance the assessment under the 1959 Act and that no vested right of the assessee was infringed. Tribunal's finding on exemptions upheld.",
    "relief_granted": "Appeal allowed; High Court order reversed on issue of enhancement power.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "No assessee has any vested right in the procedure prescribed under the 1939 Act.",
      "speaker": "court",
      "significance": "Core holding rejecting respondent's claim of vested right in old procedure."
    },
    {
      "text": "The power conferred on the appellate authority under the 1959 Act is not wider than that the Commercial Tax Officer had under the 1939 Act.",
      "speaker": "court",
      "significance": "Explains no prejudice to assessee from new Act."
    },
    {
      "text": "This finding of the Tribunal is essentially a finding of fact and hence we will not be justified in interfering with that finding.",
      "speaker": "court",
      "significance": "Upholds Tribunal on exemptions."
    }
  ],
  "_case_id": "1971_644",
  "_label": 1,
  "_text_length": 26034,
  "_extracted_at": "2026-02-10T20:20:07.308648"
}