{
  "metadata": {
    "case_name": "Income-tax Officer v. First Respondent Firm",
    "case_year": 1968,
    "court": "Supreme Court of India",
    "judges": [
      "Hegde, J."
    ],
    "case_number": "Civil Appeal No. 1170 of 1968",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Respondents Nos. 2 and 3 are the partners in the first respondent-firm.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The first respondent-firm was duly registered under the Indian Income-tax Act 1922 as well as under the Income-tax Act 1961.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "In the original assessments of the firm for the assessment years 1958-59, 1960-61, 1961-62 and 1962-63, assessments were made on the slab rates prescribed under the respective Finance Acts applicable to registered Firms.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "In the individual assessments of the partners for their respective share in the income of the firm was included and assessed at the maximum rates since their assessments were made in the status of non-resident.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "On February 11, 1965, the first respondent firm was served with notices dated January 29, 1965 by the Income-tax Officer intimating that in its assessments for the assessment years 1958-59, 1960-61, 1961-62 and 1962-63, there are mistakes apparent from the record inasmuch as the firm had not been charged at the maximum rates of income-tax under S. 17(1) of the Indian Income-tax Act, 1922 and therefore he proposes to rectify those assessments under S. 154 of the Income-tax Act, 1961.",
      "type": "procedural",
      "date": "1965-02-11",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The respondents in their reply to those notices denied that there was any mistake apparent or otherwise in those orders of assessment. They disputed the Income-tax Officer's authority to make any correction.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f7",
      "text": "The Income-tax Officer did not accept the contention of the respondents and assessed them by applying the provisions of S. 17(1) of the 1922 Act.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "The respondents challenged the validity of the orders rectifying the assessments before the High Court of Bombay in Misc. Petition No. 104 of 1965 under Art. 226 of the Constitution.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "The High Court took the view that the original assessments made on the respondents were prima facie in accordance with law and at any rate as there was no obvious or patent mistake in those orders of assessment, the Income-tax Officer was incompetent to pass the impugned orders. Judgment dated February 3, 6, 1967.",
      "type": "procedural",
      "date": "1967-02-03",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "This appeal by certificate arises from the decision of the High Court of Bombay in Misc. Petition No. 104 of 1965.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether on the facts and in the circumstances of the case, the Income-tax Officer was within his powers in making the impugned rectifications under S. 154 of the Income-tax Act, 1961 on the ground of mistake apparent from the record regarding applicability of S. 17(1) of the Indian Income-tax Act, 1922 to the first respondent firm.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the first respondent firm came within the mischief of S. 17(1) of the Indian Income-tax Act, 1922, given the definition of 'person' in S. 2(9) thereof.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "In the original assessments of the firm, there was a mistake apparent from the record as the firm had not been charged at the maximum rates under S. 17(1) of the 1922 Act.",
      "supporting_facts": [
        "f3",
        "f5"
      ],
      "legal_basis": "S. 17(1) Indian Income-tax Act, 1922; S. 154 Income-tax Act, 1961"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "There was no mistake apparent or otherwise in the original orders of assessment. Disputed the Income-tax Officer's authority to make any correction.",
      "supporting_facts": [
        "f3",
        "f6"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Original assessments were prima facie in accordance with law and there was no obvious or patent mistake.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The question whether S. 17(1) of the 1922 Act applies to the firm is not free from doubt because 'person' in S. 2(9) of 1922 Act includes HUF and local authority but not explicitly firm, unlike S. 2(31) of 1961 Act.",
      "addresses_issue": "i2",
      "key_observation": "S. 17(1) can apply to a person; unless a firm can be considered as a person, it cannot govern."
    },
    {
      "id": "cr2",
      "text": "A mistake apparent on the record must be an obvious and patent mistake and not something which can be established by a long drawn process of reasoning on points on which there may conceivably be two opinions.",
      "addresses_issue": "i1",
      "key_observation": "The Income-tax Officer was not justified in opining there was an apparent mistake as the question is debatable."
    },
    {
      "id": "cr3",
      "text": "It was not open to the Income-tax Officer to go into the true scope of the relevant provisions in a proceeding under S. 154.",
      "addresses_issue": "i1",
      "key_observation": "Decision on a debatable point of law is not a mistake apparent from the record."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The Income-tax Officer was wholly wrong in holding that there was a mistake apparent from the record of the assessments of the first respondent.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Satyanarayan Laxminarayan Hegde and ors. v. Mallikarjun Bhavanappa Tirumale",
      "citation": "(1960) 1 S.C.R. 890",
      "treatment": "followed",
      "relevance": "Error which has to be established by long drawn process of reasoning on points where there may be two opinions cannot be error apparent on the face of the record under Art. 226."
    },
    {
      "case_name": "Sidhramappa v. Commissioner of Income-tax, Bombay",
      "citation": "21 I.T.R. 333",
      "treatment": "followed",
      "relevance": "A decision on a debatable point of law is not a mistake apparent from the record."
    }
  ],
  "statutes_cited": [
    {
      "name": "Income-tax Act, 1961",
      "sections": [
        "S. 154",
        "S. 2(31)",
        "S. 113"
      ],
      "relevance": "S. 154 for rectifying mistake apparent from record; S. 2(31) defines 'person' to include firm; S. 113 corresponded to S. 17(1) of 1922 Act but omitted from 1.4.1965."
    },
    {
      "name": "Indian Income-tax Act, 1922",
      "sections": [
        "S. 17(1)",
        "S. 35",
        "S. 2(9)"
      ],
      "relevance": "S. 17(1) applies maximum rates to non-resident persons (not explicitly firms); S. 35 corresponds to S. 154 of 1961 Act; S. 2(9) defines 'person'."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 226"
      ],
      "relevance": "High Court petition filed under this Article challenging rectification orders."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court held that the Income-tax Officer was not justified in rectifying the assessments under S. 154 as there was no mistake apparent from the record, thereby upholding the Bombay High Court's decision quashing the rectification orders.",
    "relief_granted": "Validity of rectification orders upheld as invalid",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "A mistake apparent on the record must be an obvious and patent mistake and not something which can be established by a long drawn process of reasoning on points on which there may conceivably be two opinions.",
      "speaker": "court",
      "significance": "Defines the scope of 'mistake apparent from the record' under S. 154."
    },
    {
      "text": "The Income tax Officer was wholly wrong in holding that there was a mistake apparent from the record of the assessments of the first respondent.",
      "speaker": "court",
      "significance": "Concludes that rectification powers were exceeded."
    }
  ],
  "_case_id": "1971_281",
  "_label": 0,
  "_text_length": 7775,
  "_extracted_at": "2026-02-10T20:15:34.678064"
}