{
  "metadata": {
    "case_name": "Commissioner of Income-tax v. R. Hanumanthappa & Son",
    "case_year": 1968,
    "court": "Supreme Court of India",
    "judges": [
      "Grover, J."
    ],
    "case_number": "Civil Appeal No. 704 of 1968",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The family of R. Hanumanthappa and son was being assessed in the status of Hindu undivided family with late R. Hanumanthappa as its karta till there was a partition and all the family assets including the cotton business were divided after the disruption of the joint family which took place on November 2, 1948.",
      "type": "background",
      "date": "1948-11-02",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The division took place among the following three coparceners: 1. R. Hanumanthappa, Karta, 2. R. Rama Setty his son and 3. R.R. Sreenivasa Murthy his grandson.",
      "type": "admitted",
      "date": "1948-11-02",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "After the disruption of the family the partnership firm was formed on November 22, 1948, the partners being the aforesaid erstwhile three coparceners of the Hindu Undivided family and R. Gopamma a widowed daughter of R. Hanumanthappa.",
      "type": "background",
      "date": "1948-11-22",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The partnership worked under the name and style of R. Hanumanthappa Son, Cotton Merchants. It did the same business which was being done by the H.U.F.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The business assets and liabilities falling to each coparcener's share were entered in their personal accounts and then retransferred to the partnership firm as contribution of capital with the exception of a few trade debts.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "In the deed of partnership paras 2 and 3 stated that the three parties desire to continue the family business constituting themselves into a partnership and admitting Gopamma, and that the partnership shall carry on, as successor to the business, originally carried on by the Hindu Undivided Family of Cotton Merchants Ginners and Pressers.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "The assessment for the assessment year 1949-50 was completed on December 29, 1949 on the H.U.F. The previous year was the Deepavali year i.e. November 30, 1947 to November 1, 1948.",
      "type": "procedural",
      "date": "1949-12-29",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "This assessment was sought to be reopened under s.34 of the Mysore Act and an additional demand of Rs. 2,25,942/- was raised by the order of the Income tax Officer dated September 23, 1959.",
      "type": "procedural",
      "date": "1959-09-23",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Before the Income tax Officer an exemption had been claimed on behalf of the disrupted H.U.F. under s.25(3) of the Mysore Act.",
      "type": "disputed",
      "date": null,
      "source": "assessee"
    },
    {
      "id": "f10",
      "text": "Income tax Officer rejected the contentions, relied on the partnership deed showing continuation, cash balance, book accounts and stocks transferred.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Appellate Assistant Commissioner upheld the view of the Income tax Officer that it was a case of succession and not of discontinuance.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Commissioner agreed with the reasons of the Appellate Assistant Commissioner.",
      "type": "procedural",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f13",
      "text": "On application under s.66(2) of the Mysore Act, question referred to High Court: Whether on the facts and in the circumstances of the case, the assessee is entitled to exemption under Section 25(3) of the Mysore Income-tax Act?",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Mysore High Court answered the question in favour of the assessee and against the Revenue on January 4, 1967.",
      "type": "procedural",
      "date": "1967-01-04",
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether on the facts and in the circumstances of the case, the assessee is entitled to exemption under Section 25(3) of the Mysore Income-tax Act?",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "There was no discontinuance of the business as contemplated by s.25(3) of the Mysore Act; it was a case of succession by the partnership firm.",
      "supporting_facts": [
        "f4",
        "f6",
        "f10"
      ],
      "legal_basis": "s.25(3) Mysore Income-tax Act, 1923"
    },
    {
      "id": "pa2",
      "text": "The partnership deed explicitly stated it shall carry on as successor to the business originally carried on by the H.U.F.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": "Partnership deed clauses"
    },
    {
      "id": "pa3",
      "text": "Preliminary objection rejected: Appeal lies under Art.136 despite pre-Constitution Mysore Act, as Indian IT Act extended post-1950.",
      "supporting_facts": [
        "f14"
      ],
      "legal_basis": "Art.136 Constitution, Finance Act 1950 s.3"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "On partition the business had disintegrated into several parts allotted individually to each coparcener, constituting discontinuance; assets acquired by firm were of divided members, not H.U.F., and fourth partner joined, so no succession.",
      "supporting_facts": [
        "f2",
        "f3",
        "f5"
      ],
      "legal_basis": "s.25(3) Mysore Income-tax Act, 1923"
    },
    {
      "id": "ra2",
      "text": "Disruption of H.U.F. broke the integrity of the business, causing total cessation.",
      "supporting_facts": [
        "f1"
      ],
      "legal_basis": "N.A.S.A. Annamalai Chettiar v. CIT"
    },
    {
      "id": "ra3",
      "text": "Mysore High Court judgment final as highest court under pre-Constitution Mysore Act, no appeal lies.",
      "supporting_facts": [
        "f14"
      ],
      "legal_basis": "Mysore Income-tax Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Words 'discontinued' and 'discontinuance' in s.25(3) refer to complete cessation of the business, not mere change of ownership.",
      "addresses_issue": "i1",
      "key_observation": "Uniformly decided that these words did not cover mere change of ownership but only complete cessation."
    },
    {
      "id": "cr2",
      "text": "Here, partnership explicitly continued the family business as successor; assets transferred, same business carried on; merely change from H.U.F. ownership to partnership ownership.",
      "addresses_issue": "i1",
      "key_observation": "No factual cessation of business or its discontinuance."
    },
    {
      "id": "cr3",
      "text": "Discontinuity must be real and factual of the business, not notional or jural of its owners.",
      "addresses_issue": "i1",
      "key_observation": "Requirement of s.25(3) is that the business should be discontinued, not that owners cease."
    },
    {
      "id": "cr4",
      "text": "Annamalai Chettiar case distinguishable as there the partnership deed did not state desire to continue as successor.",
      "addresses_issue": "i1",
      "key_observation": "Facts different; here clear intention to continue."
    },
    {
      "id": "cr5",
      "text": "Preliminary objection rejected; Art.136 covers any judgment by any court in territory of India.",
      "addresses_issue": "i1",
      "key_observation": "Finance Act 1950 extended Indian IT Act."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "No discontinuance of business under s.25(3) Mysore IT Act; assessee not entitled to exemption.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "High Court answer discharged; question answered in favour of Revenue.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Commissioner of Income tax Bombay v. P.E. Polson",
      "citation": "13 I.T.R. 384",
      "treatment": "followed",
      "relevance": "Words discontinued refer to complete cessation, not change of ownership."
    },
    {
      "case_name": "Commissioner of Income tax, Bombay v. Sanjana Co. Ltd.",
      "citation": "50 Bom. 87",
      "treatment": "followed",
      "relevance": "Liquidation and transfer to new company not discontinuance."
    },
    {
      "case_name": "Kalumal Shorimal v. Commissioner of Income tax, Punjab",
      "citation": "3 I.T.C. 341",
      "treatment": "followed",
      "relevance": "Partition of HUF; assessee continuing business under old name not discontinuance."
    },
    {
      "case_name": "Hanutram Bhuramal v. Commissioner of Income Tax, Bihar",
      "citation": "6 I.T.R. 290",
      "treatment": "followed",
      "relevance": "Similar principle on discontinuance."
    },
    {
      "case_name": "Income tax Appellate Tribunal Bombay v. Bachraj Nathani",
      "citation": "14 I.T.R. 191",
      "treatment": "followed",
      "relevance": "Discontinuity must be real and factual of business, not of owners."
    },
    {
      "case_name": "N.A.S.A. Annamalai Chettiar v. Commissioner of Income tax, Madras",
      "citation": "20 I.T.R. 238",
      "treatment": "distinguished",
      "relevance": "Partition split business into parts without successor intent; facts different here."
    }
  ],
  "statutes_cited": [
    {
      "name": "Mysore Income-tax Act, 1923",
      "sections": [
        "s.66(2)",
        "s.25(3)",
        "s.34"
      ],
      "relevance": "Reference of question; exemption claim on discontinuance; reopening assessment."
    },
    {
      "name": "Indian Income-tax Act, 1922",
      "sections": [
        "s.25(3)"
      ],
      "relevance": "Similar provision pre-1939 amendment; compared for interpretation of discontinuance."
    },
    {
      "name": "Finance Act, 1950",
      "sections": [
        "s.3",
        "s.13"
      ],
      "relevance": "Extended Indian IT Act to whole of India except J&K; repealed Mysore Act with savings."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art.136"
      ],
      "relevance": "Special leave to appeal against High Court judgment."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Supreme Court allowed the appeal by special leave, set aside the Mysore High Court's answer in favour of assessee, and answered the referred question in favour of Revenue holding no discontinuance of business under s.25(3) and no entitlement to exemption.",
    "relief_granted": "Question answered for Revenue",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"the partnership shall carry on, as successor to the business, originally carried on by the Hindu Undivided Family of Cotton Merchants Ginners and Pressers.\"",
      "speaker": "court",
      "significance": "Partnership deed clause showing explicit succession, no discontinuance."
    },
    {
      "text": " \"these words did not cover mere change of ownership but referred only to a complete cessation of the business.\"",
      "speaker": "court",
      "significance": "Core interpretation of 'discontinued' under s.25(3)."
    },
    {
      "text": "\"the discontinuity must be real and factual and it has to be of the business and not of its owner or owners.\"",
      "speaker": "court",
      "significance": "Distinguishes personal from business cessation."
    }
  ],
  "_case_id": "1971_318",
  "_label": 1,
  "_text_length": 16402,
  "_extracted_at": "2026-02-10T20:16:15.936509"
}