{
  "metadata": {
    "case_name": "State of Uttar Pradesh v. Jugal Kishore Bhatt & Babu Singh Gaur",
    "case_year": 1966,
    "court": "Supreme Court of India",
    "judges": [
      "Hegde, J."
    ],
    "case_number": "Civil Appeals Nos. 1011 and 1012 of 1966",
    "date_of_judgment": "1969-04-30"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Jugal Kishore Bhatt appointed as Sales-tax Officer on June 29, 1948 by Governor of U.P. Posts were temporary. Joined on July 15, 1948 on temporary basis.",
      "type": "background",
      "date": "1948-06-29",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Bhatt continued as Sales-tax Officer until 1951 on temporary basis.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "In 1951, G.O. No. ST 419/X-941 issued. Para 4 declared appointments to listed posts (including Sales-tax Officers) deemed substantive capacity within meaning of Governor's order on Fundamental Rule 26(d), with retrospective effect from first appointments, except officiating in leave vacancies.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Bhatt continued in department until 1953.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "In 1953, Governor under Art. 309 made rule allowing termination of temporary service by one month's notice or pay in lieu, applicable to temporary posts, officiating in permanent posts, etc., excluding certain categories.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "February 1953: Commissioner of Sales-tax informed Bhatt appointment terminates March 31, 1953, but re-employed subject to 1953 rule. Asked to consent by March 23, 1953. Bhatt consented.",
      "type": "procedural",
      "date": "1953-02",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Bhatt continued in service up to March 31, 1954. Appointment extended one year to March 31, 1955.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "G.O. No. ST-896/X-911 D/55 dated April 27, 1955: Extended posts of Sales-tax Officers up to March 31, 1956.",
      "type": "material",
      "date": "1955-04-27",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "G.O. No. ST-2562/X-911-A dated May 22, 1956: Converted 61 temporary posts of S.T.Os to permanent w.e.f. April 1, 1955. Orders on confirmation of individual officers to issue separately.",
      "type": "material",
      "date": "1956-05-22",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "May 1, 1958: State Government terminated Bhatt's services by one month's notice.",
      "type": "material",
      "date": "1958-05-01",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Bhatt represented against termination; rejected. Filed writ petition under Art. 226 before Allahabad High Court. Single judge allowed, set aside termination. Division Bench affirmed on November 10, 1964 (Special Appeal 483/1962).",
      "type": "procedural",
      "date": "1964-11-10",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Babu Singh Gaur appointed temporary Panchayat Raj Inspector on June 6, 1949. Temporary officers under Panchayat Raj declared substantive capacity under FR 26(d) retrospectively.",
      "type": "background",
      "date": "1949-06-06",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Temporary posts under Panchayat Raj converted to permanent subsequently. Made subject to 1953 Art. 309 rule.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "September 12, 1958: Gaur's services terminated by one month's notice.",
      "type": "material",
      "date": "1958-09-12",
      "source": "court"
    },
    {
      "id": "f15",
      "text": "Gaur filed writ under Art. 226. Single judge dismissed. Letters Patent Bench allowed on February 12, 1965 (Special Appeal 298/1960), set aside termination.",
      "type": "procedural",
      "date": "1965-02-12",
      "source": "court"
    },
    {
      "id": "f16",
      "text": "Admitted that respondents appointed temporarily to temporary posts. Later declared substantive capacity under FR 26(d) retrospectively for specific purposes.",
      "type": "admitted",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether temporary government servants, declared to hold temporary posts in substantive capacity under FR 26(d) retrospectively, and whose posts were later converted to permanent, acquire right to post such that services cannot be terminated by one month's notice under Art. 309 rule.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Respondents were temporary servants liable to termination by one month's notice. Declaration of substantive capacity under FR 26(d) and conversion of posts to permanent did not make them permanent government servants.",
      "supporting_facts": [
        "f3",
        "f5",
        "f9",
        "f16"
      ],
      "legal_basis": "Art. 309 rule; Fundamental Rule 26(d); State of U.P. v. Abdul Khalik"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Holding posts in substantive capacity, and after posts made permanent, they held permanent posts substantively, not terminable by simple notice.",
      "supporting_facts": [
        "f3",
        "f9",
        "f13",
        "f16"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "FR 26(d) and Governor's order dealt only with leave and increments, not nature of appointment for all purposes. Temporary appointments remained temporary despite declaration for specific purposes.",
      "addresses_issue": "i1",
      "key_observation": "Substantive capacity conferred only for counting leave for increments, not converting to permanent or substantive in permanent posts."
    },
    {
      "id": "cr2",
      "text": "G.O. converting posts to permanent stated confirmation of individuals separately; no confirmation given to respondents.",
      "addresses_issue": "i1",
      "key_observation": "Temporary servant does not become permanent unless declared or appointed as such under rules."
    },
    {
      "id": "cr3",
      "text": "Cited Purshotam Lal Dhingra: Substantive appointment to temporary post terminable by notice unless ripened to quasi-permanent.",
      "addresses_issue": "i1",
      "key_observation": "Appointment to temporary post, even substantive, gives no right to post."
    },
    {
      "id": "cr4",
      "text": "Cited State of Nagaland v. G. Vasantha: Conversion of temporary post to permanent does not confer additional rights on temporary appointee.",
      "addresses_issue": "i1",
      "key_observation": "Service terminable by prescribed notice."
    },
    {
      "id": "cr5",
      "text": "Cited State of U.P. v. Abdul Khalik: Similar facts; temporary substantive not equivalent to permanent; terminable by notice.",
      "addresses_issue": "i1",
      "key_observation": "Ratio covers case; no right merely from post conversion."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Temporary government servants do not acquire permanent status or right to post merely from FR 26(d) declaration or post conversion to permanent without separate confirmation.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Purshotam Lal Dhingra v. Union of India",
      "citation": "1958 S.C.R. 828",
      "treatment": "followed",
      "relevance": "Nature of substantive appointment to temporary post: terminable by notice."
    },
    {
      "case_name": "State of Nagaland v. G. Vasantha",
      "citation": "A.I.R. 1970 S.C. 537",
      "treatment": "followed",
      "relevance": "Temporary appointee's service terminable despite post becoming permanent."
    },
    {
      "case_name": "State of U.P. v. Abdul Khalik",
      "citation": null,
      "treatment": "followed",
      "relevance": "Temporary substantive servant terminable by one month's notice under Art. 309 rule; similar facts."
    }
  ],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Article 309",
        "Article 226"
      ],
      "relevance": "Art. 309: Rule for termination by notice. Art. 226: Basis for writ petitions."
    },
    {
      "name": "Fundamental Rules",
      "sections": [
        "Rule 26(d)"
      ],
      "relevance": "Declaration of substantive capacity in temporary posts only for leave/increment purposes."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeals allowed; High Court orders set aside; writ petitions dismissed. Termination orders upheld as valid under Art. 309 rule.",
    "relief_granted": null,
    "costs": "Parties to bear their own costs in Supreme Court and High Court."
  },
  "key_quotes": [
    {
      "text": "\"A temporary government servant does not become a permanent Government servant unless he gets that capacity either under some rule or he is declared or appointed by the Government as a permanent government servant.\"",
      "speaker": "court",
      "significance": "Core holding on status of temporary servants."
    },
    {
      "text": "\"The ratio of that decision is that a government servant temporarily appointed does not get a right to the post merely because the post held by him is converted into a permanent post.\"",
      "speaker": "court",
      "significance": "Explains application of Abdul Khalik precedent."
    }
  ],
  "_case_id": "1971_493",
  "_label": 1,
  "_text_length": 18512,
  "_extracted_at": "2026-02-10T20:16:57.004224"
}