{
  "metadata": {
    "case_name": "Son of Sardar Mujibul Rahman Khan v. Board of Revenue, U.P. & Ors.",
    "case_year": 1966,
    "court": "Supreme Court of India",
    "judges": [
      "Ray, J."
    ],
    "case_number": "Civil Appeal No. 2108 of 1966",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant is son of Sardar Mujibul Rahman Khan, a zamindar of villages in District of Kheri, Uttar Pradesh.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Raja Shatranjai (third respondent, decree-holder) was a creditor of appellant's father on basis of mortgage deed.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Raja Shatranjai obtained decree dated 28 September 1939 for Rs. 1,31,040-1-0 and Rs. 1931-1-0 as costs under U.P. Encumbered Estates Act, 1934 on application of Sardar Mujibul Rahman Khan under section 4 for liquidation of debts.",
      "type": "material",
      "date": "1939-09-28",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Decree transferred to Deputy Commissioner of Kheri for execution.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "U.P. Zamindari Abolition and Land Reforms Act, 1951 came into force; proprietary rights vested in State; intermediaries entitled to compensation.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Appellant, on father's death, entitled to 2/3rd of zamindari property and compensation; took delivery of compensation bonds worth Rs. 42,750 from Compensation Officer, Lakhimpur; brother Hikmat Hakim Khan received Rs. 21,250; total Rs. 64,000.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "On 14 April 1959, decree-holder applied to Collector, Kheri to order appellant and brother to return bonds or attach properties to extent of bonds for debt liquidation.",
      "type": "procedural",
      "date": "1959-04-14",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Collector rejected application on 17 August 1959.",
      "type": "procedural",
      "date": "1959-08-17",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Appeal by decree-holder dismissed by Additional Commissioner, Lucknow on 17 February 1960.",
      "type": "procedural",
      "date": "1960-02-17",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Revision before Board of Revenue: on 30 August 1960, member allowed revision; on 6 September 1960, another member concurred.",
      "type": "procedural",
      "date": "1960-08-30",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Board of Revenue issued three directions: (1) treasuries stop payment of instalment money or bonds; (2) Compensation Officer hand over bonds of Rs. 32,000 remaining with him for debt liquidation; (3) attach movable and immovable properties of appellant and brother.",
      "type": "material",
      "date": "1960-08-30",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Appellant filed application under Article 226 in Allahabad High Court to quash Board orders.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Single Judge quashed Board order except direction for Compensation Officer to hand over Rs. 32,000 bonds.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Decree-holder appealed; High Court Bench divided; third Judge: quashed direction No. 3 (attachment); upheld other two directions.",
      "type": "procedural",
      "date": "1965-01-15",
      "source": "court"
    },
    {
      "id": "f15",
      "text": "Appeal to Supreme Court by certificate from High Court judgment dated 15 January 1965.",
      "type": "procedural",
      "date": "1965-01-15",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the Board of Revenue, Uttar Pradesh had authority to pass the impugned orders directing stoppage of payments on compensation bonds, handover of remaining bonds by Compensation Officer, and attachment of properties.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Board of Revenue did not have power to issue the directions.",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": "Section 14 and 19 of U.P. Encumbered Estates Act, 1934"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Decree-holder entitled to recovery from compensation and rehabilitation grants; Board directions ensure compliance with statutes.",
      "supporting_facts": [
        "f3",
        "f6",
        "f11"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Decree passed under section 14 of 1934 Act; sent to Collector under section 19 for execution per Chapter V; Collector informed of secured debt not recoverable otherwise than from compensation.",
      "addresses_issue": "i1",
      "key_observation": "Special Judge to inform Collector of secured debt extent."
    },
    {
      "id": "cr2",
      "text": "Sections 23A and 23B introduced into 1934 Act by 1950 Act: Collector requires Compensation Officer to place compensation at disposal per section 70 of 1950 Act; Collector utilises for secured debts first, then others in priority.",
      "addresses_issue": "i1",
      "key_observation": "Compensation bonds to be utilised by Collector for debt liquidation."
    },
    {
      "id": "cr3",
      "text": "Absence of requisition does not confer right on judgment-debtor to take bonds; actus curia neminem gravabit.",
      "addresses_issue": "i1",
      "key_observation": "Judgment-debtor cannot take advantage of own wrong or lack of service."
    },
    {
      "id": "cr4",
      "text": "Proviso to section 18 of 1934 Act: secured debt recoverable from compensation as if security not extinguished.",
      "addresses_issue": "i1",
      "key_observation": "Decree-holder entitled to payment from compensation."
    },
    {
      "id": "cr5",
      "text": "Board directions secure compliance with sections 23A, 23B of 1934 Act and section 70 of 1950 Act; jurisdiction touches statutory obligations.",
      "addresses_issue": "i1",
      "key_observation": "Appellant not entitled to bonds without satisfying decree."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Board of Revenue had authority to issue directions; High Court rightly upheld directions except attachment which was quashed.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "U.P. Encumbered Estates Act, 1934",
      "sections": [
        "4",
        "14",
        "18",
        "19",
        "23A",
        "23B"
      ],
      "relevance": "Decree passage, execution by Collector, compensation placed at Collector's disposal for secured debt liquidation."
    },
    {
      "name": "U.P. Zamindari Abolition and Land Reforms Act, 1950",
      "sections": [
        "70"
      ],
      "relevance": "Compensation Officer to place amount at disposal of court/authority like Collector for proceedings affecting compensation rights."
    },
    {
      "name": "U.P. Zamindars Debt Reduction Act, 1952",
      "sections": [
        "8"
      ],
      "relevance": "Referenced in section 23B(1) for secured debts on proprietary rights."
    },
    {
      "name": "U.P. Zamindari Abolition and Land Reforms Rules, 1952",
      "sections": [
        "77(1)"
      ],
      "relevance": "Compensation Officer to issue notice to intermediary for bond delivery."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "226"
      ],
      "relevance": "Appellant's writ application to High Court."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal against the Allahabad High Court judgment upholding the Board of Revenue's directions (stoppage of payments and handover of remaining bonds) is dismissed; High Court had quashed the attachment direction.",
    "relief_granted": "None to appellant",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The principal question in this appeal is whether the first respondent, the Board of Revenue Uttar Pradesh had authority to pass, the order impugned in this appeal.",
      "speaker": "court",
      "significance": "Frames the core legal issue."
    },
    {
      "text": "The absence of the service of a requisition cannot confer a right on the judgment-debtor to take away the compensation money or bonds. The principle is actus curia neminem gravabit.",
      "speaker": "court",
      "significance": "Explains why appellant cannot retain bonds."
    },
    {
      "text": "The appellants were not entitled to, receive the bonds without satisfying the decree. The appellants were wrong in doing so. The appellant could not take advantage of his own wrong.",
      "speaker": "court",
      "significance": "Justifies Board's directions upholding statutory compliance."
    }
  ],
  "_case_id": "1971_569",
  "_label": 0,
  "_text_length": 12340,
  "_extracted_at": "2026-02-10T20:19:12.487012"
}