{
  "metadata": {
    "case_name": "Assessee (public limited company in jute business) v. Commissioner of Income-tax",
    "case_year": 1967,
    "court": "Supreme Court of India",
    "judges": [
      "Grover, J."
    ],
    "case_number": "Civil Appeal No. 1899 of 1967",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The assessee is a public limited company doing the business of jute and manufacturing of jute goods, following the mercantile system of accounting.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Assessment year 1955-56, previous year ended on 31st December 1954.",
      "type": "background",
      "date": "1954-12-31",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Assessee claimed deduction of Rs. 1,49,776 on account of sales tax determined to be payable by sales tax authorities on sales made during the previous year.",
      "type": "material",
      "date": null,
      "source": "assessee"
    },
    {
      "id": "f4",
      "text": "Income tax return filed on 13th January 1956.",
      "type": "procedural",
      "date": "1956-01-13",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Demand notice served by Sales Tax authorities on 21st November 1957.",
      "type": "material",
      "date": "1957-11-21",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Assessee filed revised income tax return on 9th November 1959 claiming the deduction.",
      "type": "procedural",
      "date": "1959-11-09",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Assessee contested sales tax liability before higher departmental authorities.",
      "type": "disputed",
      "date": null,
      "source": "assessee"
    },
    {
      "id": "f8",
      "text": "Income-tax Officer completed assessment on 11th March 1960, denying deduction because assessee denied liability and made no provision in books.",
      "type": "procedural",
      "date": "1960-03-11",
      "source": "income_tax_officer"
    },
    {
      "id": "f9",
      "text": "Appellate Assistant Commissioner confirmed ITO's order.",
      "type": "procedural",
      "date": null,
      "source": "appellate_assistant_commissioner"
    },
    {
      "id": "f10",
      "text": "Appellate Tribunal dismissed assessee's appeal.",
      "type": "procedural",
      "date": null,
      "source": "appellate_tribunal"
    },
    {
      "id": "f11",
      "text": "Tribunal referred question to Calcutta High Court: Whether Rs. 1,49,776 sales tax deductible as business expense.",
      "type": "procedural",
      "date": null,
      "source": "appellate_tribunal"
    },
    {
      "id": "f12",
      "text": "Calcutta High Court on 24th August 1966 held unpaid and disputed sales tax not deductible under s.10(2)(xv) or s.10(1) of Income Tax Act 1922.",
      "type": "procedural",
      "date": "1966-08-24",
      "source": "calcutta_high_court"
    },
    {
      "id": "f13",
      "text": "Assessee made no provision or debit entry for sales tax liability in its books of account.",
      "type": "admitted",
      "date": null,
      "source": "revenue"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether on the facts and in the circumstances of the case, amount of Rs. 1,49,776 which was claimed by the assessee as a deduction on account of sales tax was deductible as a business expense?",
      "framed_by": "appellate_tribunal"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Sales tax paid or unpaid admissible as deduction under s.10(2)(xv) or s.10(1) of Income Tax Act 1922. Under mercantile system, deduction permissible in year to which liability relates, irrespective of actual payment.",
      "supporting_facts": [
        "f1",
        "f2",
        "f3"
      ],
      "legal_basis": "Section 10(2)(xv), Section 10(1), Section 10(5) of Income Tax Act 1922"
    },
    {
      "id": "pa2",
      "text": "Sales tax is expenditure laid out wholly and exclusively for business. Liability to pay sales tax arises on sales/purchases, independent of assessment.",
      "supporting_facts": [
        "f3",
        "f5",
        "f7"
      ],
      "legal_basis": "Sales tax laws; Commissioner of Income-tax, West Bengal II v. Royal Boot House; Pope The King Match Factory v. Commissioner of Income-tax, Madras"
    },
    {
      "id": "pa3",
      "text": "Profits must be real profits on commercial principles; liability must be deducted from gross receipts to arrive at net profits.",
      "supporting_facts": [
        "f2"
      ],
      "legal_basis": "Section 10(1) of Income Tax Act 1922"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Unpaid and disputed sales tax liability cannot form basis for deduction under s.10(2)(xv) or s.10(1); mere legal liability not enough, must be expended.",
      "supporting_facts": [
        "f7",
        "f13"
      ],
      "legal_basis": "Section 10(2)(xv), Section 10(1) of Income Tax Act 1922"
    },
    {
      "id": "ra2",
      "text": "Assessee failed to debit liability in books of account, debarred from claiming deduction.",
      "supporting_facts": [
        "f13"
      ],
      "legal_basis": "Mercantile system requires entry in books"
    },
    {
      "id": "ra3",
      "text": "Distinction from Royal Boot House: there liability not disputed and provision made in accounts.",
      "supporting_facts": [
        "f7",
        "f13"
      ],
      "legal_basis": "Commissioner of Income-tax, West Bengal II v. Royal Boot House"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Under mercantile system, assessee entitled to deduct accrued liability for sales tax in relevant year, even if disputed or unpaid; liability arises on taxable sales, independent of assessment or demand enforcement.",
      "addresses_issue": "i1",
      "key_observation": "Liability quantified by demand notice dated 21st November 1957; dispute before higher authorities does not negate accrual."
    },
    {
      "id": "cr2",
      "text": "Sales tax is admissible expenditure under s.10(2)(xv); also deductible under s.10(1) as real profits computed on commercial principles require deducting such liabilities from gross receipts.",
      "addresses_issue": "i1",
      "key_observation": "Distinction from Royal Boot House without substance."
    },
    {
      "id": "cr3",
      "text": "Absence of debit entry in books does not debar deduction; entitlement depends on law, not assessee's accounting entries or view of rights.",
      "addresses_issue": "i1",
      "key_observation": "ITO must allow deduction if legally due."
    },
    {
      "id": "cr4",
      "text": "Pope The King Match Factory correctly lays down law: enforceable liability on demand date, appeals do not detract from it.",
      "addresses_issue": "i1",
      "key_observation": "Applies to sales tax similarly."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Assessee following mercantile system entitled to deduct sales tax liability accrued during relevant accounting year, even if disputed, unpaid, and no book entry made.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Commissioner of Income-tax, West Bengal II v. Royal Boot House",
      "citation": "75 I.T.R. 507",
      "treatment": "followed",
      "relevance": "Entitled to deduction for sales tax provision under mercantile system without actual payment, if liability not disputed; court holds distinction from present case without substance."
    },
    {
      "case_name": "Pope The King Match Factory v. Commissioner of Income-tax, Madras",
      "citation": "50 I.T.R. 495",
      "treatment": "followed",
      "relevance": "Deduction allowed for disputed excise duty demand debited in accounts under mercantile system; liability enforceable from demand date, appeals do not negate it."
    }
  ],
  "statutes_cited": [
    {
      "name": "Income Tax Act, 1922",
      "sections": [
        "Section 10(1)",
        "Section 10(2)(xv)",
        "Section 10(5)"
      ],
      "relevance": "Sales tax deductible as business expenditure under s.10(2)(xv) if laid out for business; under mercantile system, 'paid' means incurred per accounting method; under s.10(1), real profits after deducting liabilities."
    },
    {
      "name": "Sales Tax Laws",
      "sections": [],
      "relevance": "Liability to pay tax arises on taxable sales/purchases, independent of assessment or quantification."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal by special leave allowed; judgment of Calcutta High Court set aside. Assessee entitled to deduction of Rs. 1,49,776 sales tax liability for assessment year 1955-56.",
    "relief_granted": "Deduction allowed; High Court order reversed.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"under all sales tax laws including the statute with which we are concerned, the moment a dealer makes either purchases or sales which are subject to taxation, the obligation to pay the tax arises and taxability is attracted.\"",
      "speaker": "court",
      "significance": "Core holding on accrual of sales tax liability independent of assessment."
    },
    {
      "text": "\"Whether the assessee is entitled to a particular deduction or not will depend on the provision of law relating thereto and not on the view which the assessee might take of his rights nor can the existence or absence of entries in the books of account be decisive or conclusive in the matter.\"",
      "speaker": "court",
      "significance": "Rejects revenue's argument on lack of book entries."
    }
  ],
  "_case_id": "1971_280",
  "_label": 1,
  "_text_length": 10037,
  "_extracted_at": "2026-02-10T20:15:33.292276"
}