{
  "metadata": {
    "case_name": "State v. Respondent (Income-tax Officer)",
    "case_year": 1966,
    "court": "Supreme Court of India",
    "judges": [
      "Sikri, C.J."
    ],
    "case_number": "Criminal Appeal No. 236 of 1966",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The respondent was an Income-tax officer for about ten years from December, 1950 to September, 1960.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "While posted at Amritsar during 1954-55, respondent obtained petrol on credit from a petrol pump, bill Rs. 151, not paid.",
      "type": "admitted",
      "date": "1954-1955",
      "source": "prosecution"
    },
    {
      "id": "f3",
      "text": "Posted at Delhi from 1955 to 1958, obtained goods on credit from M/s Empire Stores worth Rs. 2,876.20, not paid.",
      "type": "admitted",
      "date": "1955-1958",
      "source": "prosecution"
    },
    {
      "id": "f4",
      "text": "Purchased goods on credit from M/s Sylco (cloth merchants and tailors), owed Rs. 1,853.10, not paid.",
      "type": "admitted",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f5",
      "text": "Owed Rs. 71.75 to M/s Electronics Limited.",
      "type": "admitted",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f6",
      "text": "Purchased refrigerator from M/s Oriental Radio Corporation at concession of Rs. 150, admitted liability.",
      "type": "admitted",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f7",
      "text": "Learned Special Judge found respondent had means to pay during relevant period, deliberately did not pay, period of limitation to recover expired.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "P.W. 13, Mukand Lal, partner of M/s Empire Stores, stated firm allowed respondent credit sales as known customer, all customers got credit, allowed long terms, avoided court, expected payment even if barred by time.",
      "type": "material",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f9",
      "text": "Punjab High Court, Circuit Bench at Delhi, acquitted respondent on December 24, 1965 in Criminal Appeal No. 16-D of 1964.",
      "type": "procedural",
      "date": "1965-12-24",
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether on the facts, the respondent should be convicted under Section 5(1)(b) of the Prevention of Corruption Act, 1947 for obtaining valuable things without or for inadequate consideration.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the respondent obtained pecuniary advantage by illegal means or otherwise abusing position as public servant under Section 5(1)(d) of the Prevention of Corruption Act, 1947.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Obtaining goods on credit amounted to obtaining valuable things without consideration or for consideration which respondent knew to be inadequate.",
      "supporting_facts": [
        "f2",
        "f3",
        "f4",
        "f5",
        "f6"
      ],
      "legal_basis": "Section 5(1)(b) of Prevention of Corruption Act, 1947; Section 23 of Contract Act (contracts illegal and void)"
    },
    {
      "id": "pa2",
      "text": "If respondent never intended to pay, he cheated shopkeepers, which is illegal, so obtained goods by illegal means.",
      "supporting_facts": [
        "f2",
        "f3",
        "f4",
        "f5",
        "f7"
      ],
      "legal_basis": "Section 5(1)(d) of Prevention of Corruption Act, 1947"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Purchase on credit is not without consideration as there was a clear promise to pay; even if no intention to pay, it is cheating but not without consideration under Section 5(1)(b).",
      "supporting_facts": [
        "f2",
        "f3",
        "f4",
        "f5",
        "f6"
      ],
      "legal_basis": "Section 5(1)(b) of Prevention of Corruption Act, 1947"
    },
    {
      "id": "ra2",
      "text": "Credit sales were not illegal transactions; Clause (d) does not cover such cases.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": "Section 5(1)(d) of Prevention of Corruption Act, 1947"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "There was consideration for goods on credit; cannot be said obtaining without consideration under Section 5(1)(b) unless proved agreement that trader would not demand payment and bill was formality; no such evidence.",
      "addresses_issue": "i1",
      "key_observation": "High Court right in holding no offence under Section 5(1)(b)."
    },
    {
      "id": "cr2",
      "text": "Obtaining goods on credit does not amount to pecuniary advantage under Section 5(1)(d) without agreement not to pay; respondent no different from non-official obtaining credit and not paying; credit given as known customer with fixed salary, not because of office.",
      "addresses_issue": "i2",
      "key_observation": "No evidence credit obtained because respondent was Income-tax Officer; firms give credit to officers for realizability from salaries."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "No offence committed under Section 5(1)(b) of Prevention of Corruption Act as there was consideration in credit purchases.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "No offence under Section 5(1)(d) as obtaining goods on credit without agreement not to pay does not amount to obtaining pecuniary advantage by illegal means.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Prevention of Corruption Act, 1947",
      "sections": [
        "Section 5(1)(b)",
        "Section 5(1)(d)",
        "Section 5(2)"
      ],
      "relevance": "Whether respondent guilty of criminal misconduct in obtaining valuable things without/inadequate consideration or pecuniary advantage by illegal means/abusing position"
    },
    {
      "name": "Indian Contract Act",
      "sections": [
        "Section 23"
      ],
      "relevance": "Special Judge held contracts per se illegal and void; High Court and Supreme Court disagreed for credit sales"
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court agreed with the Punjab High Court that no offence under Section 5(1)(b) or 5(1)(d) of the Prevention of Corruption Act was committed by the respondent in obtaining goods on credit without payment, as there was consideration and no pecuniary advantage obtained by illegal means.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The basic facts in this appeal... are not in dispute and the only question involved is whether on the facts, as found, the respondent should be convicted under Section 5(2) of the Prevention of Corruption Act.",
      "speaker": "court",
      "significance": "Frames the narrow issue before the court"
    },
    {
      "text": "If we were to hold otherwise it would be impossible for any officer to go to a shop and obtain credit for if he did not pay within a reasonable time a charge could be levied against him under Section 5(1)(d) of the Act.",
      "speaker": "court",
      "significance": "Explains policy reason for not extending Section 5(1)(d) to unpaid credit purchases"
    }
  ],
  "_case_id": "1971_218",
  "_label": 0,
  "_text_length": 6568,
  "_extracted_at": "2026-02-10T20:15:32.200686"
}