{
  "metadata": {
    "case_name": "Appellant (Accused No. 2) v. State",
    "case_year": 1969,
    "court": "Supreme Court of India",
    "judges": [
      "Shelat, J."
    ],
    "case_number": "Criminal Appeal No. 100 of 1969",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "On October 31, 1963, one Jivansingh Uttam Singh obtained a British passport bearing No. 183459 at Nairobi. On the strength of that passport he was returning to India with his family. On his way he died on board the ship.",
      "type": "background",
      "date": "1963-10-31",
      "source": "prosecution"
    },
    {
      "id": "f2",
      "text": "According to the prosecution that passport came into the hands of the appellant.",
      "type": "disputed",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f3",
      "text": "Bakshi Singh Sunder Singh (Accused No. 1) desired to go to the United Kingdom, but had no passport. The appellant agreed to arrange his journey and also for that purpose to obtain a passport for him.",
      "type": "disputed",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f4",
      "text": "The allegation was that the appellant prepared an application for a visa in the name of Bakshi Singh. With a view to procure the said visa the photograph of the said deceased Jivansingh was removed from the said passport and that of Bakshi Singh substituted.",
      "type": "disputed",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f5",
      "text": "The visa having in this fashion been obtained, Bakshi Singh journeyed to the United Kingdom having on his way made some intermediate halts.",
      "type": "material",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f6",
      "text": "The British authorities suspected that the passport was a forged document and repatriated Bakshi Singh to India. On his arrival he was handed over to the Special Police, Bombay.",
      "type": "material",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f7",
      "text": "The Special Police carried out investigation in the course of which they recorded statements of certain witnesses including that of Tanna Singh, the younger brother of Bakshi Singh.",
      "type": "procedural",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f8",
      "text": "On completion of the investigation, the police filed a charge-sheet before the Presidency Magistrate, 28th Court, Greater Bombay. Bakshi Singh was therein charged under secs. 419 and 471 read with sec. 468, and the appellant was charged under secs. 419/109, 468 and 471 of the Penal Code.",
      "type": "procedural",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f9",
      "text": "The Magistrate did not examine any witnesses during the committal proceedings but on a perusal of the charge-sheet and the documents filed before him under sec. 173 of the Code of Criminal Procedure framed the charges and committed, by his order dated September 13, 1968, Bakshi Singh and the appellant for trial before the Sessions Court.",
      "type": "procedural",
      "date": "1968-09-13",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "By the committal order, the Magistrate directed Bakshi Singh to stand his trial under secs. 120B, 419, 467 and 471 read with sec. 467, and the appellant under secs. 120B and 467 of the Penal Code. The offence of criminal conspiracy charged under sec. 120B was that Bakshi Singh and the appellant had conspired to forge the said passport for the use of Bakshi Singh.",
      "type": "procedural",
      "date": "1968-09-13",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Appellant filed application under sec. 561A of the Code of Criminal Procedure in Bombay High Court to quash the committal order, including contention under sec. 196A(2). High Court refused by judgment and order dated January 8, 1969 in Criminal Application No. 1341 of 1968.",
      "type": "procedural",
      "date": "1969-01-08",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Appeal by special leave to Supreme Court, limited to ground of sec. 196A(2).",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the Magistrate had jurisdiction to take cognizance of the offence of criminal conspiracy under sec. 120B without prior consent as required by sec. 196A(2) of the Code of Criminal Procedure, and therefore whether the committal order was without jurisdiction and had to be quashed.",
      "framed_by": "appellant"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "No consent as required by sec. 196A(2) having been first obtained, the Magistrate had no jurisdiction to take cognizance of the offence of conspiracy, and therefore, the committal order was without jurisdiction and had to be quashed.",
      "supporting_facts": [
        "f9",
        "f10"
      ],
      "legal_basis": "Section 196A(2) CrPC; Section 120B IPC"
    },
    {
      "id": "pa2",
      "text": "Relied on observations in minority judgment of S. K. Das, J. in Pramatha Nath Taluqdar v. Saroj Ranjan Sarkar.",
      "supporting_facts": [],
      "legal_basis": "Pramatha Nath Taluqdar v. Saroj Ranjan Sarkar"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The charge-sheet submitted by the police was for offences under secs. 419 and 471 read with sec. 468 against Bakshi Singh and under secs. 419/109, 471 and 468 against the appellant, and did not refer to or charge either with criminal conspiracy under sec. 120B. Therefore, cognizance was taken of those offences, not sec. 120B.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": "Section 190 CrPC"
    },
    {
      "id": "ra2",
      "text": "None of the witnesses' statements alleged conspiracy by the appellant with Bakshi Singh. The charge-sheet prima facie disclosed offence of abetment.",
      "supporting_facts": [
        "f7",
        "f8"
      ],
      "legal_basis": "Sections 419/109, 468, 471 IPC"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Sub-sec. 2 of sec. 196A provides that no court shall take cognizance of the offence of criminal conspiracy punishable under sec. 120B where the object is to commit any non-cognizable offence without consent. The charge framed was for conspiracy to forge passport (non-cognizable under sec. 467), so sec. 196A(2) applies.",
      "addresses_issue": "i1",
      "key_observation": "Taking cognizance occurs when Magistrate applies mind to suspected commission of offence upon police report, complaint etc."
    },
    {
      "id": "cr2",
      "text": "Magistrate took cognizance upon police report of offences in charge-sheet (abetment etc., not 120B). Later, at committal stage, framed 120B charge based on same materials, considering it more appropriate than sec. 109.",
      "addresses_issue": "i1",
      "key_observation": "Cognizance was of abetment offences alleged in charge-sheet, not conspiracy; sec. 196A(2) did not apply."
    },
    {
      "id": "cr3",
      "text": "The proper test is whether allegations in police report (charge-sheet) disclosed primarily and essentially an offence requiring consent under sec. 196A(2). Here, charge-sheet alleged abetment under secs. 419/109 etc., not conspiracy.",
      "addresses_issue": "i1",
      "key_observation": "Followed Pramatha Nath Taluqdar (minority view), Biroo Sardar v. Ariff, Ramchandra v. Emperor: depends on offence prima facie disclosed by facts alleged, not sections referred."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The Magistrate took cognizance of the offence of abetment of forgery and impersonation so far as the appellant was concerned and not of the offence of criminal conspiracy, and therefore sec. 196A(2) did not apply.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Pramatha Nath Taluqdar v. Saroj Ranjan Sarkar",
      "citation": "1962 Supp. 2 S.C.R. 297",
      "treatment": "referred",
      "relevance": "Minority judgment of S.K. Das J. on test for whether allegations disclose offence requiring sanction under sec. 196A(2): primarily and essentially charged offence, not mere allusion to conspiracy."
    },
    {
      "case_name": "Biroo Sardar v. Ariff",
      "citation": "A.I.R. 1925 Cal. 579",
      "treatment": "followed",
      "relevance": "It is not the sections referred to which matter but the offence prima facie disclosed."
    },
    {
      "case_name": "Ramchandra v. Emperor",
      "citation": "A.I.R. 1939 Bom. 129",
      "treatment": "followed",
      "relevance": "Question whether sanction necessary depends not on sections in complaint but offence prima facie disclosed by facts alleged."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Penal Code, 1860",
      "sections": [
        "419",
        "471",
        "468",
        "109",
        "120B",
        "467"
      ],
      "relevance": "Charges framed: abetment, forgery of passport, cheating by personation, criminal conspiracy to forge passport."
    },
    {
      "name": "Code of Criminal Procedure, 1898",
      "sections": [
        "173",
        "190",
        "196A(2)",
        "561A"
      ],
      "relevance": "Filing charge-sheet u/s 173; cognizance u/s 190; requirement of consent for conspiracy u/s 196A(2); quashing proceedings u/s 561A."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal against the Bombay High Court's refusal to quash the Magistrate's committal order fails as the Magistrate took cognizance of abetment offences in the police charge-sheet, not conspiracy under sec. 120B, so no consent under sec. 196A(2) CrPC was required.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"Taking cognizance does not involve any formal action or indeed action of any kind but occurs as soon as a Magistrate applies his mind to the suspected commission of an offence.\"",
      "speaker": "court",
      "significance": "Defines when cognizance is taken, key to holding that it occurred at charge-sheet stage for abetment offences."
    },
    {
      "text": "\"It would not be proper to decide the question of sanction merely by taking into consideration the offences mentioned in the heading or the use of the expression 'criminal conspiracy' in para 5. The proper test should be whether the allegations made... disclosed primarily and essentially an offence... for which consent... would be necessary.\"",
      "speaker": "court",
      "significance": "From Pramatha Nath case; test applied to determine offence cognized from charge-sheet facts."
    },
    {
      "id": "kq3",
      "text": "The appeal, therefore, fails and is dismissed.",
      "speaker": "court",
      "significance": "Final disposition of the appeal."
    }
  ],
  "_case_id": "1971_594",
  "_label": 0,
  "_text_length": 11900,
  "_extracted_at": "2026-02-10T20:19:20.720607"
}