{
  "metadata": {
    "case_name": "Balraj Khanna and Ors. v. Moti Ram",
    "case_year": 1971,
    "court": "Supreme Court of India",
    "judges": [
      "Vaidialingam J"
    ],
    "case_number": "Criminal Appeal No. 14 of 1971",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Respondent Moti Ram was serving as Liaison Officer, Municipal Corporation, Delhi during December 1964.",
      "type": "background",
      "date": "1964-12",
      "source": "respondent"
    },
    {
      "id": "f2",
      "text": "Appellants were members of the Standing Committee of the Municipal Corporation; first appellant Balraj Khanna was inimical towards respondent and influenced members.",
      "type": "background",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f3",
      "text": "Requisition given by Standing Committee members to Chairman for meeting to move resolution for immediate suspension of respondent.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f4",
      "text": "Meeting of Standing Committee held on December 10, 1964, attended by Commissioner, officers, press reporters; appellants made serious defamatory allegations against respondent and passed unanimous resolution suspending him.",
      "type": "material",
      "date": "1964-12-10",
      "source": "respondent"
    },
    {
      "id": "f5",
      "text": "Allegations against respondent given wide publicity, harming his reputation.",
      "type": "material",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f6",
      "text": "PW3, Secretary of Corporation, attended meeting and sent report Ex. PW3/B on next day to Commissioner listing allegations: LO deficient in duties, not working harmoniously with press, estranging members/officers/parties, sowing discord between Mayor and Commissioners, past undesirable means as Chief Reporter Hindustan Times, association brought slur, known for moral turpitude and seducing girls/women.",
      "type": "material",
      "date": "1964-12-11",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "In October 1964, seven appellants conspired to defame respondent and remove him; passed resolution on Dec 10, 1964 suspending him; three other members also parties.",
      "type": "disputed",
      "date": "1964-10",
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "All seven appellants made wild and baseless allegations involving moral turpitude during discussion; statements in Ex. PW3/B; gave publicity in newspapers.",
      "type": "disputed",
      "date": "1964-12-10",
      "source": "respondent"
    },
    {
      "id": "f9",
      "text": "Respondent filed complaint in court of Sub-Divisional Magistrate, Delhi against seven appellants under Section 500 IPC.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Before Magistrate, respondent and five witnesses examined under Section 202 CrPC; Magistrate dismissed complaint under Section 203 CrPC on grounds: no evidence which appellant made which allegation; resolution/discussion covered by Exceptions to Section 499 IPC.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Additional Sessions Judge dismissed respondent's revision summarily: material insufficient.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Delhi High Court in Criminal Revision No. 138 of 1968 on August 26, 1970 set aside Magistrate's order: evidence implicates all; directed further inquiry by Chief Judicial Magistrate.",
      "type": "procedural",
      "date": "1970-08-26",
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Appeal by special leave to Supreme Court: Criminal Appeal No. 14 of 1971.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether in defamation complaint under Section 500 IPC, actual words alleged to be defamatory must be set out verbatim or substantial reproduction suffices.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether complaint defective for not specifying which particular allegation made by which individual accused.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Scope of Magistrate's jurisdiction under Sections 202 and 203 CrPC: prima facie case based on complainant's materials.",
      "framed_by": "court"
    },
    {
      "id": "i4",
      "text": "Whether resolution and discussion covered by Exceptions to Section 499 IPC at dismissal stage.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "In defamation cases, actual words used must be set out verbatim in complaint; gist/substance insufficient; general allegation that appellants made statements in Ex. PW3/B not enough.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": "English law on libel (Halsbury, Charles Bradlaugh, Capital and Counties Bank, Collins v. Jones); Sarat Chandra Das v. State; Krishnarao v. Firm Radhakisan"
    },
    {
      "id": "pa2",
      "text": "Complaint must specify which allegation by which accused for effective defence.",
      "supporting_facts": [
        "f9",
        "f10"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Resolution/discussion protected by Exceptions to Section 499 IPC.",
      "supporting_facts": [
        "f4",
        "f6"
      ],
      "legal_basis": "Exceptions to Section 499 IPC"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Prima facie case made out; all appellants made statements in Ex. PW3/B; exact words/proof arise at trial.",
      "supporting_facts": [
        "f8",
        "f9"
      ],
      "legal_basis": "Sections 202, 203 CrPC; Emperor v. Col. Bholanath; K.S. Namjundaiah v. Setti Chikka Tippanna; Dhruba Charan Khandal v. Dinabandhu Patri"
    },
    {
      "id": "ra2",
      "text": "Substantial reproduction in complaint/Ex. PW3/B sufficient; English libel principles inapplicable to spoken defamation under IPC.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": "Section 499 IPC"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Under Sections 202/203 CrPC, Magistrate ascertains prima facie case from complainant's materials; not to weigh evidence for conviction.",
      "addresses_issue": "i3",
      "key_observation": "Prima facie case made out even if much said on both sides."
    },
    {
      "id": "cr2",
      "text": "English libel rules requiring verbatim words not applicable to spoken defamation under Section 499 IPC; substantial reproduction suffices, especially for long statements.",
      "addresses_issue": "i1",
      "key_observation": "Object is to enable court to judge if defamatory; complainant's interest to reproduce accurately."
    },
    {
      "id": "cr3",
      "text": "Complaint alleges all seven appellants made statements in Ex. PW3/B; no need to specify per accused unless different statements attributed.",
      "addresses_issue": "i2",
      "key_observation": "Evidence implicates all; specifics at trial."
    },
    {
      "id": "cr4",
      "text": "Exceptions to Section 499 and defences considered at trial, not dismissal stage.",
      "addresses_issue": "i4",
      "key_observation": "Magistrate's approach erroneous."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Substantial reproduction of alleged defamatory statements in complaint sufficient; no need for verbatim if long.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Where complainant alleges all accused made same statements (as per document), no need to attribute specifically to individuals at this stage.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Magistrate's dismissal under Section 203 CrPC erroneous; High Court correctly directed further inquiry.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Chandra Deo Singh v. Prokash Chandra Bose",
      "citation": "1964 1 S.C.R. 639",
      "treatment": "followed",
      "relevance": "Scope of Sections 202/203 CrPC: prima facie case from complainant's materials."
    },
    {
      "case_name": "Charles Bradlaugh and Annie Besant v. The Queen",
      "citation": "3 Q.B.D. 607",
      "treatment": "referred",
      "relevance": "Words constituting offence must be stated in indictment."
    },
    {
      "case_name": "Capital and Counties Bank Limited v. George Henty and Sons",
      "citation": "7 Appeal Cases 741",
      "treatment": "referred",
      "relevance": "Words must be set out for court to judge libel."
    },
    {
      "case_name": "Collins v. Jones",
      "citation": "1955 2 All England Reports 145",
      "treatment": "referred",
      "relevance": "Exact words essential in libel/slander."
    },
    {
      "case_name": "Sarat Chandra Das v. The State",
      "citation": "A.I.R. 1952 Orissa 351",
      "treatment": "distinguished",
      "relevance": "Precise words needed when different accused make different statements."
    },
    {
      "case_name": "Krishnarao v. Firm Radhakisan Ramshai",
      "citation": "1956 I.L.R. Nagpur 236",
      "treatment": "referred",
      "relevance": "Plaint must allege publication, set out words, etc. in defamation suit."
    },
    {
      "case_name": "Emperor v. Col. Bholanath",
      "citation": "51 I.L.R. 1929 All. 313",
      "treatment": "followed",
      "relevance": "Substance/purport of oral defamation sufficient; context needed."
    },
    {
      "case_name": "K.S. Namjundaiah v. Setti Chikka Tippanna",
      "citation": "1952 Criminal Law Journal Mysore 1633",
      "treatment": "followed",
      "relevance": "Substantial agreement on words sufficient."
    },
    {
      "case_name": "Dhruba Charan Khandal v. Dinabandhu Patri",
      "citation": "A.I.R. 1966 Orissa 15",
      "treatment": "followed",
      "relevance": "Substantial measure on words enough; distinguished Sarat Chandra."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Penal Code, 1860",
      "sections": [
        "Section 500",
        "Section 499"
      ],
      "relevance": "Defamation offence; exceptions not applicable at preliminary stage."
    },
    {
      "name": "Code of Criminal Procedure, 1898",
      "sections": [
        "Section 203",
        "Section 202"
      ],
      "relevance": "Dismissal of complaint; preliminary inquiry for prima facie case."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court dismissed the appeal by special leave, upheld Delhi High Court's order setting aside Magistrate's dismissal under Section 203 CrPC, and directed further inquiry into the complaint by Chief Judicial Magistrate.",
    "relief_granted": "Further inquiry into complaint under Section 500 IPC.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The object of the provisions of Section 202 Cr. P. C. is to enable the Magistrate to form an opinion as to whether process should be issued or not. At that stage what the Magistrate has to see is whether there is evidence in support of the allegations made in the complaint and not whether the evidence is sufficient to warrant a conviction.",
      "speaker": "court",
      "significance": "Defines scope of preliminary inquiry under CrPC."
    },
    {
      "text": "It will be highly desirable no doubt if the actual words stated to have been used by an accused and which are alleged to be defamatory are reproduced by the complainant. But in cases where the words spoken are too many or the statements made are too long, it will be the height of technicality to insist that the actual words and the entire statements should be reproduced verbatim.",
      "speaker": "court",
      "significance": "Relaxes verbatim requirement for spoken defamation."
    },
    {
      "text": "When the case of the complainant is that the seven appellants made the statements referred to in Ex. P. W. 3 B and he is prepared to go to trial on that footing, the question of the complainant being made to state the statements alleged to have been made by the individual accused does not at all arise.",
      "speaker": "court",
      "significance": "No need for individual attribution when all accused alleged to have made same statements."
    }
  ],
  "_case_id": "1971_184",
  "_label": 0,
  "_text_length": 28442,
  "_extracted_at": "2026-02-10T20:14:58.481154"
}