{
  "metadata": {
    "case_name": "Appellant (Tenant) v. Respondent (Landlord)",
    "case_year": 1968,
    "court": "Supreme Court of India",
    "judges": [
      "Grover, J"
    ],
    "case_number": "Civil Appeal No. 18 of 1968",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The appellant had been occupying a shop in Mathura belonging to the respondent from a very long time, at a monthly rental of Rs. 18.37.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "In 1962 the respondent wanted to construct rooms on the upper storey of the shop for his own residence, which could possibly be made only if the appellant vacated the shop for some period.",
      "type": "admitted",
      "date": "1962",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On June 4, 1962, the appellant and the respondent entered into an agreement reciting the above facts, agreeing that the shop would be vacated by the appellant on the condition that as soon as the required construction had been completed he would resume possession of the shop.",
      "type": "admitted",
      "date": "1962-06-04",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Agreement clauses: Second party (appellant) withdraws possession of shop No. 1/2C at Tilakdwar and gives to first party (respondent); first party to construct shop within thirty days and hand over possession; rent remains Rs. 18-6-0 per mensem including taxes; after construction, same rent; all sections of U.P. Rent Control and Eviction Act fully applicable; first party not entitled to derive benefits as property built after 1-1-51.",
      "type": "admitted",
      "date": "1962-06-04",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "After construction completed, appellant resumed possession of the shop.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Appellant offered rent to respondent but latter did not accept; appellant deposited rent from April 1, 1962 to July 31, 1963 in court under s. 7C of the Act.",
      "type": "admitted",
      "date": "1962-04-01 to 1963-07-31",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Respondent served notice dated April 20, 1963 under Transfer of Property Act purporting to terminate tenancy of appellant.",
      "type": "procedural",
      "date": "1963-04-20",
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "Respondent filed suit for ejectment of appellant, arrears of rent, damages etc.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f9",
      "text": "Munsif dismissed the suit holding appellant entitled to protection conferred by s. 3 of the Act.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "District Judge on appeal took contrary view, decreed the suit.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Allahabad High Court in Second Appeal No. 307 of 1965 affirmed District Judge's judgment dated April 14, 1967, holding respondent entitled to s. 1A and appellant could not be given benefit of s. 3.",
      "type": "procedural",
      "date": "1967-04-14",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Tenancy between appellant and respondent governed by provisions of the Act prior to reconstruction.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Reconstruction after 1962 agreement made buildings constructed within terms of s. 1-A of the Act.",
      "type": "admitted",
      "date": "1962",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the appellant, who was the tenant, was entitled to the benefit of s. 3 of U.P. Temporary Control of Rent and Eviction Act, 1947.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether it was open to the respondent to give up the benefit of s. 1-A of the Act or waive it by means of the agreement entered into in June 1962.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether the consideration or object of such agreement would be lawful within the meaning of s. 23 of the Indian Contract Act.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Appellant entitled to protection of s. 3 of the Act as tenancy governed by Act prior to reconstruction and agreement made Act fully applicable post-reconstruction.",
      "supporting_facts": [
        "f1",
        "f3",
        "f4",
        "f12"
      ],
      "legal_basis": "U.P. Temporary Control of Rent and Eviction Act, 1947 s. 3; agreement clauses"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Respondent entitled to rely on s. 1A of the Act as reconstruction post-1951, so Act does not apply; appellant not entitled to s. 3 benefit.",
      "supporting_facts": [
        "f2",
        "f13"
      ],
      "legal_basis": "U.P. Temporary Control of Rent and Eviction Act, 1947 s. 1A"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Tenancy governed by Act prior to reconstruction; post-reconstruction building falls under s. 1A exempting buildings constructed on or after 1-1-1951.",
      "addresses_issue": "i1",
      "key_observation": "s. 1A applies to reconstruction after 1962 agreement."
    },
    {
      "id": "cr2",
      "text": "s. 1A confers benefit on landlords to encourage construction; no prohibition against waiving it by agreement.",
      "addresses_issue": "i2",
      "key_observation": "Landlords can waive benefit of s. 1A as it is for their advantage."
    },
    {
      "id": "cr3",
      "text": "General principle allows waiver of statutory benefits for individual protection if no public policy infringement; no express prohibition in Act.",
      "addresses_issue": "i2",
      "key_observation": "Maxim cuilibet licet renuntiare juri pro se introducto applies."
    },
    {
      "id": "cr4",
      "text": "Agreement does not defeat provisions of law under s. 23 Contract Act as performance does not entail transgression of law; s. 1A for landlord benefit, waivable.",
      "addresses_issue": "i3",
      "key_observation": "No illegality in performance of agreement."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Landlord can waive benefit of s. 1A by agreement; such waiver not unlawful under s. 23 Contract Act; tenant entitled to s. 3 protection.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "s. 1A is exemption for landlords' benefit regarding post-1951 buildings, waivable without public policy issue.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Neminath Appayya Hanumannavar v. Jamboorao Satappa Kocheri",
      "citation": "A.I.R. 1966 Mysore 154",
      "treatment": "followed",
      "relevance": "Words in s. 23 Contract Act refer to performance entailing transgression of law; agreement void only if performance impossible without disobeying law."
    },
    {
      "case_name": "Vita Food Products Incorporated v. Unus Company Ltd. (in Liquidation)",
      "citation": "1939 A.C. 277, 293",
      "treatment": "referred",
      "relevance": "Rule nullifying contracts forbidden by statute is public policy; may refuse to nullify unless serious grounds."
    }
  ],
  "statutes_cited": [
    {
      "name": "U.P. Temporary Control of Rent and Eviction Act, 1947",
      "sections": [
        "s. 3",
        "s. 1A",
        "s. 5",
        "s. 7C"
      ],
      "relevance": "s. 3 restricts eviction without permission; s. 1A exempts post-1951 constructions (waivable); s. 7C for rent deposit; s. 5 controls rent."
    },
    {
      "name": "Indian Contract Act, 1872",
      "sections": [
        "s. 23"
      ],
      "relevance": "Agreement lawful unless defeats law; here, no defeat as s. 1A waivable."
    },
    {
      "name": "Transfer of Property Act",
      "sections": [],
      "relevance": "Notice under provisions purporting to terminate tenancy."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; judgment of Allahabad High Court set aside; judgment of trial court (Munsif) restored holding appellant entitled to s. 3 protection.",
    "relief_granted": "Ejectment suit dismissed; protection under s. 3 of Act.",
    "costs": "Appellant entitled to costs in this court."
  },
  "key_quotes": [
    {
      "text": "Now there can be no manner of doubt that the tenancy between the appellant and the respondent was governed by the provisions of the Act prior to the reconstruction of the premises.",
      "speaker": "court",
      "significance": "Establishes pre-existing protection under Act."
    },
    {
      "text": "the general principle is that every one has a right to waive and to agree to waive the advantage of a law or rule made solely for the benefit and protection of the individual in his private capacity which may be dispensed with without infringing any public right or public policy.",
      "speaker": "court",
      "significance": "Core principle allowing waiver of s. 1A."
    },
    {
      "text": "s. 1-A was meant for the benefit of owners of buildings which were under erection or were constructed after January 1, 1951. If a particular owner did not wish to avail of the benefit of that section there was no bar created by it in the way of his waiving, or giving up or abandoning the advantage or the benefit contemplated by the section.",
      "speaker": "court",
      "significance": "Direct holding on waivability of s. 1A."
    }
  ],
  "_case_id": "1971_81",
  "_label": 1,
  "_text_length": 11283,
  "_extracted_at": "2026-02-10T20:14:12.425943"
}