{
  "metadata": {
    "case_name": "Civil Appeal No. 1546 of 1969",
    "case_year": 1969,
    "court": "Supreme Court of India",
    "judges": [
      "Mathew, J."
    ],
    "case_number": "Civil Appeal No. 1546 of 1969",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Plot of land admeasuring 2108 square yards in Survey No. 171, Hissa No. 7, at Ghatkopar belonged to Jamnadas Chhotalal Dani.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On 15-11-1948, Jamnadas executed two leases in favour of Bhawani Laksamsi and Maojibhai Jethabhai, defendants 1 and 2. First lease covered the 2108 sq yd plot and another 805 sq yd plot, rent Rs. 75 per month for first plot. Second lease for third plot. Both for 10 years with option to surrender by 30-9-1953.",
      "type": "material",
      "date": "1948-11-15",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Lessees surrendered the two plots other than the 2108 sq yd plot on 15-1-1951 pursuant to option clause, so lease for the plot in question continued.",
      "type": "material",
      "date": "1951-01-15",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Jamnadas died on 14-8-1951, but before death gifted the leased property to the three respondents.",
      "type": "material",
      "date": "1951-08-14",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Lease for the plot determined by efflux of time on 30-9-1958.",
      "type": "material",
      "date": "1958-09-30",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Lessees continued in possession after 30-9-1958, paying rent at Rs. 75 per month.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "On 7-8-1959, lessors gave notice purporting to terminate tenancy by end of September 1959, alleging sub-letting and bona fide requirement for construction.",
      "type": "procedural",
      "date": "1959-08-07",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Lessees did not vacate. Lessors filed suit on 22-10-1959 in Small Causes Court Bombay, R.A.E. Suit No. 9293 of 1959.",
      "type": "procedural",
      "date": "1959-10-22",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Trial court (Judge, Small Causes Court, order 21-2-1963): No clear evidence of sub-letting, but plaintiffs required plot bona fide for construction under Section 13(1)(1) of Bombay Rents Act 1947. Tenancy terminated by efflux, continued by statutory immunity, not holding over under Section 116 TPA despite rent acceptance. One month's notice sufficient. Decree for lessors.",
      "type": "procedural",
      "date": "1963-02-21",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Appeal No. 95 of 1963 to Full Bench Small Causes Court, confirmed trial court decree, order dated 28-2-1968.",
      "type": "procedural",
      "date": "1968-02-28",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Petition under Article 227 Constitution to High Court of Bombay to quash Full Bench order, dismissed.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Appeal by special leave to Supreme Court, Civil Appeal No. 1546 of 1969.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Original lease granted for erecting a saw mill - manufacturing purpose (contended by appellants).",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether acceptance of rent by lessors after termination of contractual tenancy by efflux of time created a new tenancy by holding over under Section 116 of Transfer of Property Act, entitling lessees to six months' notice expiring with end of year of tenancy as original lease was for manufacturing purpose.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether lessees had status of statutory tenants protected under Bombay Rents Act, negating holding over.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether lessors had bona fide requirement for construction under Section 13(1)(1) of Bombay Rents Act 1947.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Fresh tenancy by holding over created by acceptance of rent after efflux of time on 30-9-1958. Statutory immunity from eviction immaterial for determining holding over under Section 116 TPA.",
      "supporting_facts": [
        "f5",
        "f6"
      ],
      "legal_basis": "Section 116 Transfer of Property Act"
    },
    {
      "id": "pa2",
      "text": "New contractual tenancy entitled to six months notice expiring end of year, as original lease for manufacturing purpose (erecting saw mill), incorporated by implication.",
      "supporting_facts": [
        "f2",
        "f13"
      ],
      "legal_basis": "Section 106 Transfer of Property Act; Manujendra Dutt v. Purendu Prosad Roy Chowdhury"
    },
    {
      "id": "pa3",
      "text": "Ganga Dutt Murarka v. Kartik Chandra Das requires reconsideration as vital points omitted.",
      "supporting_facts": [],
      "legal_basis": "Ganga Dutt Murarka v. Kartik Chandra Das"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "No new tenancy by holding over under Section 116 TPA due to statutory protection under Rent Act; acceptance of rent does not imply assent to new contractual tenancy.",
      "supporting_facts": [
        "f5",
        "f6",
        "f9"
      ],
      "legal_basis": "Section 116 Transfer of Property Act; Ganga Dutt Murarka v. Kartik Chandra Das; Bombay Rents Act"
    },
    {
      "id": "ra2",
      "text": "Lease not for manufacturing purpose.",
      "supporting_facts": [
        "f2"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Trial court and Full Bench correctly held no sub-letting but bona fide need for construction under Section 13(1)(1) Bombay Rents Act.",
      "addresses_issue": "i3",
      "key_observation": "No clear evidence of subletting."
    },
    {
      "id": "cr2",
      "text": "Acceptance of rent after expiry of contractual tenancy does not create new tenancy under Section 116 TPA where tenant has statutory immunity; tenant is statutory tenant, not holding over. Bilateral act required: offer by tenant remaining in possession and assent by landlord via rent acceptance in recognition of tenancy right.",
      "addresses_issue": "i1",
      "key_observation": "Statutory protection means possession not by contract but by statute; rent acceptance referable to statutory tenancy, not new contractual one."
    },
    {
      "id": "cr3",
      "text": "Ganga Dutt Murarka v. Kartik Chandra Das correctly decided, following Kai Khushroo; distinguishes Manujendra Dutt as inapplicable since tenancy determined by efflux, question is whether new tenancy created.",
      "addresses_issue": "i1",
      "key_observation": "No evidence landlord assented to continuance beyond statutory tenancy; animus of parties matters."
    },
    {
      "id": "cr4",
      "text": "Since no holding over, no need to consider if for manufacturing purpose requiring 6 months notice.",
      "addresses_issue": "i1",
      "key_observation": "Issue does not arise."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "No new contractual tenancy by holding over under Section 116 TPA created by rent acceptance post efflux where Rent Act provides statutory immunity; such acceptance does not amount to assent for new tenancy.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Lessors entitled to eviction decree on ground of bona fide requirement for construction under Section 13(1)(1) Bombay Rents Act 1947.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Ganga Dutt Murarka v. Kartik Chandra Das",
      "citation": "1961 3 S.C.R. 813",
      "treatment": "followed",
      "relevance": "Acceptance of rent post contractual tenancy expiry under Rent Act does not create new tenancy under Section 116 TPA."
    },
    {
      "case_name": "Kai Khushroo Bezonjee Capadia v. Bai Jerbai Hirjibhoy Warden",
      "citation": "1949-50 F.C.R. 262",
      "treatment": "followed",
      "relevance": "Holding over creates new tenancy by bilateral act; assent via rent acceptance must recognize tenancy right."
    },
    {
      "case_name": "Davies v. Bristow",
      "citation": "1920 3 K.B. 428",
      "treatment": "applied",
      "relevance": "Under Rent Restrictions Acts, rent acceptance post notice to quit does not assent to renewal."
    },
    {
      "case_name": "Morrison v. Jacobs",
      "citation": "1945 1 K.B. 577",
      "treatment": "applied",
      "relevance": "Rent receipt post expiry under Rent Acts not evidence of new contractual tenancy."
    },
    {
      "case_name": "Mangilal v. Sugan Chand",
      "citation": "A.I.R. 1965 S.C. 101",
      "treatment": "applied",
      "relevance": "Rent control provisions in addition to TPA notice requirements in certain contexts."
    },
    {
      "case_name": "Manujendra Dutt v. Purendu Prosad Roy Chowdhury Ors.",
      "citation": "1967 1 S.C.R. 475",
      "treatment": "distinguished",
      "relevance": "Section 106 TPA applies to statutory tenancies but inapplicable here as no new tenancy created post efflux."
    }
  ],
  "statutes_cited": [
    {
      "name": "Bombay Rents, Hotel and Lodging House Rates Control Act, 1947",
      "sections": [
        "Section 13(1)(1)"
      ],
      "relevance": "Provides immunity from eviction except on specified grounds like bona fide construction need; possession post efflux by statute, not contract."
    },
    {
      "name": "Transfer of Property Act",
      "sections": [
        "Section 116",
        "Section 106"
      ],
      "relevance": "Section 116 requires bilateral assent for holding over tenancy; not satisfied by rent acceptance under Rent Act. Section 106 for notice periods."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 227"
      ],
      "relevance": "High Court petition to quash lower court orders."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court dismissed the appeal by special leave, upholding High Court dismissal of Article 227 petition, confirming Small Causes Court decree for eviction on bona fide need. No holding over tenancy created. Appellants prayed for time to vacate; reference to earlier undertaking.",
    "relief_granted": "Eviction decree to respondents upheld; time to vacate as per undertaking.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"Acceptance by the landlord from the tenant, after the contractual tenancy had expired, of amounts equivalent to rent... did not amount to acceptance of rent from a lessee within the meaning of section 116 of the Transfer of Property Act.\"",
      "speaker": "court",
      "significance": "Core holding on no new tenancy under rent control."
    },
    {
      "text": "\"The act of holding over after the expiration of the term does not create a tenancy of any kind.\"",
      "speaker": "court",
      "significance": "Distinguishes holding over from statutory tenancy."
    },
    {
      "text": "\"Mere acceptance of amounts equivalent to rent by a landlord from a tenant in possession after a lease had been determined... cannot be regarded as evidence of a new agreement of tenancy.\"",
      "speaker": "court",
      "significance": "Explains impact of statutory immunity."
    }
  ],
  "_case_id": "1971_621",
  "_label": 0,
  "_text_length": 20444,
  "_extracted_at": "2026-02-10T20:19:36.860065"
}