{
  "metadata": {
    "case_name": "Accused Magistrate v. State",
    "case_year": 1969,
    "court": "Supreme Court of India",
    "judges": [
      "Vaidialingam, J."
    ],
    "case_number": "Criminal Appeal No. 154 of 1969",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "In 1963 the appellant was posted at Patna as Magistrate, 1st Class, with special powers to try Bad Livelihood Cases (L. Cases) under Section 110 of the Code of Criminal Procedure.",
      "type": "background",
      "date": "1963",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "In September 1963 two B. L. Cases Nos. 4 and 5 of 1963 had been started against Kailash Gope and Ramprit Gope and others respectively. Those cases were transferred to the file of the appellant for disposal.",
      "type": "background",
      "date": "September 1963",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "At the time of the transfer of cases, the accused persons had already been enlarged on bail. But the appellant noticed some defects in the bail bonds furnished by those persons.",
      "type": "material",
      "date": null,
      "source": "appellant"
    },
    {
      "id": "f4",
      "text": "Appellant gave directions that the defects in the bail bonds should be rectified. On the parties failing to rectify the defects, the appellant cancelled the bail bonds and remanded them to jail custody.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The parties against whom the B. L. Cases had been started, filed two applications before the District Magistrate, Patna for transferring their cases from the file of the court of the appellant to the file of another Magistrate on the ground that they seriously apprehended that they will not get justice at his hands.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "After coming to know of the filing of the transfer applications, the appellant recorded two orders on the order sheets of cases Nos. 4 and 5 making very serious allegations against the District Magistrate before whom the transfer applications were pending to the effect that the latter was attempting to interfere with the course of justice in the proceedings connected with the case Nos. 4 and 5.",
      "type": "disputed",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f7",
      "text": "Appellant is alleged to have inserted these two orders in the order sheets of the two cases long after the last orders were passed in those cases to make it appear that the remarks against the District Magistrate had been made much earlier.",
      "type": "disputed",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f8",
      "text": "The District Magistrate called for a report from the appellant and he sent the records of the proceedings to the District Magistrate with his report. In his report he had also stated that the matter is of great importance and the entire case and the order sheets should be kept intact for favour of any action that the High Court may consider fit and proper.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "In view of the allegations made by the appellant against the District Magistrate mentioned in the order sheets, the latter transferred the transfer applications to the file of the Additional District Magistrate on November 11, 1963.",
      "type": "procedural",
      "date": "1963-11-11",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "The Additional District Magistrate after hearing the parties transferred both the cases from the file of the appellant to another Magistrate and sent a report to the District Magistrate for initiation of proceedings against the appellant for having committed forgery in the order sheets in both the B. L. Cases.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "The report of the District Magistrate was forwarded to the State Government, who accorded sanction for prosecuting the appellant.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "The Senior District Prosecutor, Patna filed on December 21, 1964 a complaint in the Court of the Sub-Divisional Magistrate, Patna Sadar against the appellant. In the complaint it was alleged that the appellant has committed offences under Sections 465, 466 and 471 of the Penal Code.",
      "type": "procedural",
      "date": "1964-12-21",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "The Sub-Divisional Magistrate after taking cognizance of the offences alleged to have been committed by the appellant, transferred the case to the file of the Magistrate, 1st Class, Patna, initiating two commitment proceedings in respect of the alleged offences said to have been committed in each of the L. Cases.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "After examining the witnesses and perusing the documents, the Magistrate, 1st Class, committed the appellant to the Court of Sessions in both cases for trial under Sections 167, 466 and 471 of the Penal Code.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f15",
      "text": "The two Sessions Cases were accordingly started in the court of the Assistant Sessions Judge, Patna and charges were framed against the appellant under Sections 167, 466 and 471 of the Penal Code.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f16",
      "text": "The appellant filed two petitions before the Assistant Sessions Judge that trial could not be proceeded with as the mandatory provisions of Sections 195 and 476 of the Code have not been complied with. In fact his prayer in the applications filed before the Assistant Sessions Judge was that he should be acquitted.",
      "type": "procedural",
      "date": null,
      "source": "appellant"
    },
    {
      "id": "f17",
      "text": "The Assistant Sessions Judge by his order dated November 22, 1966 rejected the applications filed by the appellant and declined to consider the competency of trial as a preliminary issue at that stage.",
      "type": "procedural",
      "date": "1966-11-22",
      "source": "lower_court"
    },
    {
      "id": "f18",
      "text": "The appellant filed Criminal Revisions before the Sessions Judge against the order made by the Assistant Sessions Judge with a prayer to quash also the commitment orders of the Magistrate. He had also made a prayer for a reference to be made to the High Court to quash the proceedings pending before the Assistant Sessions Judge.",
      "type": "procedural",
      "date": null,
      "source": "appellant"
    },
    {
      "id": "f19",
      "text": "The Sessions Judge rejected the applications filed by the appellant.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f20",
      "text": "In consequence the appellant filed before the High Court Criminal Revision Nos. 345 and 346 of 1968 against the orders of the Sessions Judge declining to quash the commitment proceedings and to making a reference to the High Court in the two Sessions Cases against the appellant. He also filed Criminal Miscellaneous Petitions Nos. 248 and 249 of 1968 to quash the orders of the Magistrate, 1st Class to stand his trial for offences under Sections 167, 466 and 471 of the Penal Code.",
      "type": "procedural",
      "date": "1968",
      "source": "appellant"
    },
    {
      "id": "f21",
      "text": "The High Court rejected both the Criminal Revisions and the Criminal Miscellaneous Petitions by common order dated December 16, 1968.",
      "type": "procedural",
      "date": "1968-12-16",
      "source": "lower_court"
    },
    {
      "id": "f22",
      "text": "The said entries, interpolations and forgeries have been committed by the appellant between November 7, 1963 and November 11, 1963 after the appellant received the order dated November 6, 1963 of the District Magistrate Patna directing him to submit a report in respect of the allegations made against him in the transfer applications filed by the parties in the L. Cases.",
      "type": "disputed",
      "date": "1963-11-07 to 1963-11-11",
      "source": "prosecution"
    },
    {
      "id": "f23",
      "text": "Counsel appearing for the parties in the B. L. Cases in connection with the transfer applications filed by them, filed an application before the Additional District Magistrate that action should be taken by him to file a complaint against the appellant for offences under Sections 467 and 471 of the Penal Code.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f24",
      "text": "The Additional District Magistrate has examined certain witnesses and ultimately passed an order on December 16, 1963. This order is a combined order dealing with transfer applications as well as the application filed by the lawyer for filing a complaint against the appellant.",
      "type": "procedural",
      "date": "1963-12-16",
      "source": "court"
    },
    {
      "id": "f25",
      "text": "The Additional District Magistrate has held that prima facie the appellant must be considered to be guilty of having committed forgery and interpolations in the order sheets and therefore there is a good ground for transferring the B. L. Cases from his file to another magistrate. Accordingly, the Additional District Magistrate transferred the B. L. Cases to the file of the Sub-Divisional Magistrate, Patna Sadar. He had directed that a copy of the order be sent to the State Government for considering the question of giving sanction to take criminal and administrative action against the appellant.",
      "type": "procedural",
      "date": "1963-12-16",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the proceedings initiated against the appellant were without jurisdiction as the Sub-Divisional Magistrate was not competent to take cognizance of the complaint filed by the Senior District Prosecutor, requiring compliance with Sections 195(1)(b) and (c) and 476 of the CrPC.",
      "framed_by": "appellant"
    },
    {
      "id": "i2",
      "text": "Whether the offences under Sections 167, 466, and 471 IPC are covered by Section 195(1)(b) or (c) CrPC such that a complaint by the court is mandatory.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether the appellant can be considered a 'party to any proceeding in any court' for the purposes of Section 195(1)(c) CrPC in relation to Section 471 IPC.",
      "framed_by": "court"
    },
    {
      "id": "i4",
      "text": "Whether Section 476 CrPC applies requiring the Additional District Magistrate to file the complaint.",
      "framed_by": "appellant"
    },
    {
      "id": "i5",
      "text": "Whether the complaint discloses any offence requiring investigation.",
      "framed_by": "appellant"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The entire proceedings initiated against the appellant were without jurisdiction inasmuch as the Sub-Divisional Magistrate was not competent to take cognizance of the complaint filed by the Senior District Prosecutor. The authority to file the complaint against the appellant was the court to which the appellant was subordinate at the material time as is mandatory under Section 195(1)(b) and (c) of the Code.",
      "supporting_facts": [
        "f12",
        "f13"
      ],
      "legal_basis": "Section 195(1)(b) and (c) CrPC; Section 476 CrPC"
    },
    {
      "id": "pa2",
      "text": "There has been a violation of the mandatory provisions of Section 476 of the Code. The mere sanction given by the State Government under Section 197 of the Code is not, in the circumstances, sufficient to give jurisdiction to the Magistrate to take cognizance of the offences alleged against the appellant.",
      "supporting_facts": [
        "f11",
        "f24",
        "f25"
      ],
      "legal_basis": "Section 476 CrPC; Section 197 CrPC"
    },
    {
      "id": "pa3",
      "text": "The various averments made in the complaint will really show that the nature of the offence, if any, committed by the appellant will really come under Section 192 and 193 IPC. If the charge had been framed under Section 193 IPC, it would squarely fall under Clause (b) of Section 195(1) CrPC. The prosecution has adopted the device of not charging under Section 193 to evade the bar.",
      "supporting_facts": [
        "f12",
        "f22"
      ],
      "legal_basis": "Sections 192, 193 IPC; Section 195(1)(b) CrPC; Basir-Ul-Huq v. State of West Bengal"
    },
    {
      "id": "pa4",
      "text": "The appellant must be considered to be a party to the transfer applications filed by the persons concerned in the B.L. Cases, which were pending before the District Magistrate/Additional District Magistrate.",
      "supporting_facts": [
        "f5",
        "f9",
        "f10"
      ],
      "legal_basis": "Section 195(1)(c) CrPC; Section 471 IPC"
    },
    {
      "id": "pa5",
      "text": "The complaint does not disclose any offence and therefore the commitment proceedings should be quashed.",
      "supporting_facts": [
        "f12"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The offences alleged against the appellant are under Sections 167, 466 and 471 of the Penal Code. None of these sections are covered by Section 195(1)(b) CrPC. Section 466 is not covered by Clause (c) of Section 195(1) CrPC. Section 471 is, no doubt, taken in by the said clause, but to attract that clause it is necessary that the offence alleged should have been committed by a party to any proceeding in any court.",
      "supporting_facts": [
        "f12",
        "f14",
        "f15"
      ],
      "legal_basis": "Sections 167, 466, 471 IPC; Section 195(1)(b)(c) CrPC"
    },
    {
      "id": "ra2",
      "text": "The appellant can by no means be characterized to be a party to any proceeding in any court, in respect of the offence under Section 471 alleged against him. Therefore, there is no violation of either Clause (b) or (c) of Section 195(1) CrPC.",
      "supporting_facts": [
        "f5",
        "f9",
        "f10"
      ],
      "legal_basis": "Section 195(1)(c) CrPC"
    },
    {
      "id": "ra3",
      "text": "Section 476 of the Code also does not apply as the conditions stated therein do not exist in the present case.",
      "supporting_facts": [
        "f24",
        "f25"
      ],
      "legal_basis": "Section 476 CrPC"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The point of time at which the legality of the cognizance taken by the Magistrate is to be adjudged is the time when cognizance is actually taken under Section 190 CrPC. Section 195 is a limitation on the powers under Section 190.",
      "addresses_issue": "i1",
      "key_observation": "Magistrate must examine if power taken away by S.195 at cognizance stage."
    },
    {
      "id": "cr2",
      "text": "None of Sections 167, 466, 471 IPC are covered by S.195(1)(b). Clause (b) does not bar cognizance for S.167. High Court correctly held that charge under S.167 is justified and not a device to evade S.193 IPC.",
      "addresses_issue": "i2",
      "key_observation": "Ingredients of S.167 distinct from S.192/193; no evasion."
    },
    {
      "id": "cr3",
      "text": "S.466 IPC not covered by S.195(1)(b) or (c). For S.471, appellant not a 'party to any proceeding' merely because transfer applications alleged prejudice against him; he had official duty to report.",
      "addresses_issue": "i3",
      "key_observation": "Magistrate not personally interested; not a party."
    },
    {
      "id": "cr4",
      "text": "S.476 does not apply as S.195(1)(b)/(c) not attracted. Additional DM's inquiry was incidental to transfer applications, not under S.476; no complaint filed by him.",
      "addresses_issue": "i4",
      "key_observation": "Findings were reasons for transfer, not S.476 action."
    },
    {
      "id": "cr5",
      "text": "Even if S.465 included initially, appellant not a party, so S.195(1)(c) not bar. Complaint discloses offences under charged sections requiring trial; guilt to be determined later.",
      "addresses_issue": "i5",
      "key_observation": "Allegations require investigation; no quashing."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "None of the provisions of S.195(1)(b), (c) or S.476 CrPC operate as a bar to the jurisdiction of the Magistrate taking cognizance of the complaint.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Offences under Ss.167, 466 IPC not barred by S.195(1); S.471 not barred as appellant not a party to proceedings.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "S.476 CrPC not applicable.",
      "resolves_issue": "i4",
      "in_favor_of": "respondent"
    },
    {
      "id": "h4",
      "text": "Complaint discloses offences; proceedings valid.",
      "resolves_issue": "i5",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "L. Sethi v. R. P. Kapur",
      "citation": "1967 1 S.C.R. 520",
      "treatment": "followed",
      "relevance": "Legality of cognizance adjudged at time of taking cognizance under S.190 CrPC."
    },
    {
      "case_name": "Basir-Ul-Huq v. The State of West Bengal",
      "citation": "1953 S.C.R. 836",
      "treatment": "referred",
      "relevance": "S.195 bar cannot be evaded by charging distinct offence not covered by section."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Penal Code, 1860",
      "sections": [
        "167",
        "192",
        "193",
        "463",
        "465",
        "466",
        "471"
      ],
      "relevance": "Offences charged: fabrication of false evidence (167), forgery of court record (466), using forged document (471); distinguished from perjury (193) and basic forgery (463/465)."
    },
    {
      "name": "Code of Criminal Procedure, 1898",
      "sections": [
        "110",
        "190",
        "195",
        "197",
        "476"
      ],
      "relevance": "S.195 limits cognizance for certain offences; S.197 sanction obtained; S.476 procedure for court complaint on forgery not followed/applicable."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court dismissed the appeal by special leave against the Patna High Court's order dated December 16, 1968, upholding the validity of proceedings and commitment orders directing the appellant to stand trial for offences under Sections 167, 466 and 471 IPC. Held that no bar under Sections 195(1)(b)/(c) or 476 CrPC applies.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "Section 195 is in fact a limitation on the unfettered powers of a magistrate to take cognizance under Section 190 of the Code.",
      "speaker": "court",
      "significance": "Explains scope of S.195 as jurisdictional bar."
    },
    {
      "text": "Merely on the basis that the applications for transfer of certain cases pending before the appellant had been filed making allegation against the appellant will not make the appellant a party to those proceedings.",
      "speaker": "court",
      "significance": "Key holding on 'party' under S.195(1)(c)."
    },
    {
      "text": "Whether the appellant is ultimately found to be guilty or not is a different point. The allegations in the complaint do disclose that the offences alleged against the appellant require investigation.",
      "speaker": "court",
      "significance": "Rejects quashing for no offence disclosed."
    }
  ],
  "_case_id": "1971_232",
  "_label": 0,
  "_text_length": 22276,
  "_extracted_at": "2026-02-10T20:15:44.011624"
}