{
  "metadata": {
    "case_name": "Jage Ram & Ors. v. Mahabir Prasad & Ors.",
    "case_year": 1967,
    "court": "Supreme Court of India",
    "judges": [
      "Shah, C.J."
    ],
    "case_number": "Civil Appeal No. 609 of 1967",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Jage Ram and two others (defendants) were lessees of certain property belonging to Mahabir Prasad, his mother Gunwanti Devi and his wife Saroj Devi (plaintiffs).",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Plaintiffs commenced an action in the Court of the Subordinate Judge, First Class, Delhi, for a decree for Rs. 61,750 being the amount of rent due by the defendants.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The Subordinate Judge, Delhi decreed the suit.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Execution of the decree was resisted by the defendants on the plea inter alia, that the decree was inexecutable because of the provisions of the Delhi Land Reforms Act, 1954.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f5",
      "text": "The Subordinate Judge upheld the contention and dismissed the application for execution.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "Mahabir Prasad alone appealed against that order and impleaded Gunwanti Devi and Saroj Devi as party-respondents.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "Saroj Devi died in November, 1962.",
      "type": "procedural",
      "date": "1962-11",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Mahabir Prasad applied that the name of Saroj Devi be struck off from the array of respondents.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "The High Court made an order granting the application subject to all just exceptions.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "The High Court dismissed the appeal holding that because the heirs and legal representatives of Saroj Devi were not brought on the record within the period of limitation prescribed by the Limitation Act the appeal abated in its entirety.",
      "type": "procedural",
      "date": "1965-03-03",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Against that order, this appeal is preferred with certificate granted by the High Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "The decree in favour of Mahabir Prasad, Gunwanti Devi and Saroj Devi was a joint decree.",
      "type": "admitted",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the appeal abates in its entirety because the heirs and legal representatives of Saroj Devi (respondent) were not brought on the record within the period of limitation, given that Mahabir Prasad alone appealed and impleaded the other decree-holders as respondents, and the decree/order proceeds on a ground common to all.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the power under Order 41 Rule 4 CPC can be exercised where one decree-holder appeals, impleads others as respondents, and one respondent dies without heirs being brought on record.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Order 41 r. 4 CPC invests the appellate court with power to reverse or vary the decree in favour of all the plaintiffs even though they had not joined in the appeal if the decree proceeds upon a ground common to all.",
      "supporting_facts": [
        "f12"
      ],
      "legal_basis": "Order 41 r. 4 Code of Civil Procedure"
    },
    {
      "id": "pa2",
      "text": "Mahabir Prasad being one of the heirs of Saroj Devi, there can be no abatement merely because no formal application for showing Mahabir Prasad as an heir and legal representative of Saroj Devi was made.",
      "supporting_facts": [
        "f7",
        "f8"
      ],
      "legal_basis": "Order 22 CPC"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The power under O. 41 r. 4 CPC may be exercised only where there is a decree which proceeds upon a ground common to more persons than one and the appeal is filed by one or more but not all, and other persons interested are not made parties; but where such persons are made parties and one dies without heirs on record, appeal abates entirely.",
      "supporting_facts": [
        "f6",
        "f10"
      ],
      "legal_basis": "Order 41 r. 4 CPC; Rameshwar Prasad v. Shyam Beharilal"
    },
    {
      "id": "ra2",
      "text": "Modifying the order for appellant and surviving respondent would result in inconsistent orders regarding the same decree.",
      "supporting_facts": [
        "f5",
        "f9",
        "f10"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Rameshwar Prasad case is distinguishable because there all plaintiffs appealed jointly and one died without heirs on record; here only one appealed and others impleaded as respondents.",
      "addresses_issue": "i1",
      "key_observation": "In Rameshwar all plaintiffs appealed; here not."
    },
    {
      "id": "cr2",
      "text": "In Ratan Lal Shah v. Firm Lalmandas, appeal by one against joint decree maintainable under O.41 r.4 even if other not served; no distinction where respondent dies without heirs on record.",
      "addresses_issue": "i2",
      "key_observation": "Competence of appellate court not lost merely because jointly interested person impleaded as respondent dies without heirs on record."
    },
    {
      "id": "cr3",
      "text": "Power under Order 41 r. 4 arises when one of many against whom decree made on common ground appeals, and others not impleaded or impleaded as respondents.",
      "addresses_issue": "i2",
      "key_observation": "High Court view cannot be sustained."
    },
    {
      "id": "cr4",
      "text": "Where a party dies and one legal representative already on record in another capacity, only need to describe him as such; no abatement even if other heirs not impleaded.",
      "addresses_issue": "i1",
      "key_observation": "Mahabir Prasad as heir of Saroj Devi."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The appeal does not abate in its entirety; appellate court retains power under Order 41 r. 4 CPC to vary or reverse the decree/order.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "No abatement where one legal representative already on record, even without formal application.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Rameshwar Prasad and Others v. Mls Shyam Beharilal Jagannath and Others",
      "citation": "1964 3 S.C.R. 549",
      "treatment": "distinguished",
      "relevance": "Distinguishable as all plaintiffs jointly appealed there, unlike here where only one appealed and others respondents."
    },
    {
      "case_name": "Ratan Lal Shah v. Firm Lalmandas Chhadammalal",
      "citation": "1970 1 S.C.R. 296",
      "treatment": "followed",
      "relevance": "Appeal by one against joint decree maintainable under O.41 r.4 even if other respondent not served; applies analogously here."
    }
  ],
  "statutes_cited": [
    {
      "name": "Code of Civil Procedure",
      "sections": [
        "Order 41 r. 4",
        "Order 22 r. 3"
      ],
      "relevance": "Order 41 r.4 empowers appellate court to reverse/vary decree for all where one appeals on common ground; applies despite death of respondent without heirs on record."
    },
    {
      "name": "Delhi Land Reforms Act, 1954",
      "sections": [],
      "relevance": "Basis of defendants' resistance to execution, upheld by executing court."
    },
    {
      "name": "Limitation Act",
      "sections": [],
      "relevance": "Period for bringing heirs on record; non-compliance alleged to cause abatement."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "The Supreme Court allowed the appeal, set aside the High Court order dismissing the appeal on grounds of abatement, holding that the appeal does not abate entirely under Order 41 r.4 CPC and alternatively no abatement as Mahabir Prasad was already on record as heir.",
    "relief_granted": "High Court order set aside; appeal remitted implicitly for merits.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "Order 41 r. 4 Code of Civil Procedure invests the appellate court with power to reverse or vary the decree in favour of all the plaintiffs or defendants even though they had not joined in the appeal if the decree proceeds upon a ground common to all the plaintiffs or defendants.",
      "speaker": "court",
      "significance": "Core interpretation enabling appeal to proceed."
    },
    {
      "text": "Competence of the appellate court to pass a decree appropriate to the nature of the dispute in an appeal filed by one of several persons against whom a decree is made on a ground which is common to him and others is not lost merely because of the persons who was jointly interested in the claim has been made a party-respondent and on his death his heirs have not been brought on the record.",
      "speaker": "court",
      "significance": "Key holding distinguishing from precedents."
    }
  ],
  "_case_id": "1971_8",
  "_label": 1,
  "_text_length": 10684,
  "_extracted_at": "2026-02-10T20:14:07.467847"
}