{
  "metadata": {
    "case_name": "Naraindas v. Vallabhdas & Ors.",
    "case_year": 1967,
    "court": "Supreme Court of India",
    "judges": [
      "Khanna, J."
    ],
    "case_number": "Civil Appeal No. 194 of 1967",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Naraindas (appellant) is brother of Vallabhdas (respondent 1) and Durgaprasad (respondent 2), and son of Smt. Sukhrani (respondent 3).",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Arbitration proceedings in 1932 between appellant and respondents 1 to 3 on one side and Pannalal and Smt. Dulari Bahu on the other side, relating to partition of property and maintenance claim by Dulari Bahu.",
      "type": "background",
      "date": "1932",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Award given in 1932 proceedings made rule of court on 13-12-1933: Dulari Bahu to get Rs. 12/- per mensem maintenance from appellant and brothers; charge on house allotted to appellant and respondents 1-3; if unpaid, house to be sold, Rs. 3,000/- deposited in bank, interest to Dulari, principal on her death: Rs. 2,000/- to appellant and brothers, Rs. 1,000/- to Pannalal.",
      "type": "material",
      "date": "1933-12-13",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Maintenance increased to Rs. 30/- per mensem in suit decided on 8-10-1949.",
      "type": "material",
      "date": "1949-10-08",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Appellant and brothers failed to pay maintenance; Dulari Bahu executed claim, got houses at Jabalpur sold by court auction; purchased by Sitaram and Laxminarain (respondents 4 and 5) for Rs. 22,000/-; obtained sale certificate.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Respondents 4 and 5 took proceedings for possession but resisted by respondent No. 1; appellant and brothers claimed deposited amount with respondents 4 and 5.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Agreement dated 8th April 1955 appointing four arbitrators between appellant, brothers, mother vs. respondents 4 and 5: respondents 4 and 5 to have no claim in houses; arbitrators to award amounts payable by parties and maintenance to Dulari Bahu and Sukhrani Bahu.",
      "type": "procedural",
      "date": "1955-04-08",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Arbitrators' award dated 20th October 1956: For Dulari Bahu, Rs. 3,000/- withdrawn from court and deposited with Durgaprasad (respondent 2), liable to pay Rs. 30/- pm maintenance; on her death, Rs. 1,000/- to Pannalal, Rs. 2,000/- to Durgaprasad; charge on house allotted to Durgaprasad; right of residence in a room.",
      "type": "material",
      "date": "1956-10-20",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Objections filed against 1956 award; Additional District Judge, Jabalpur set aside award: affected rights of Dulari Bahu (not party to agreement); reference and award not adjustment, invalid; in excess of agreement.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Madhya Pradesh High Court in Misc. First Appeal No. 60 of 1960 on 27-4-1964 reversed Additional District Judge, held no infirmity, made award rule of court.",
      "type": "procedural",
      "date": "1964-04-27",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Appeal to Supreme Court on certificate from High Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Dulari Bahu died about three years ago (before judgment).",
      "type": "background",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the award is invalid because Dulari Bahu was an interested party not joined in the arbitration agreement.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether an out-of-court reference to arbitration requires all parties to sign the award for it to be made a rule of the court.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether prior litigation regarding the house prevents it from being subject matter of arbitration.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Dulari Bahu was interested party in dispute; not joined in arbitration agreement; reference and award invalid.",
      "supporting_facts": [
        "f2",
        "f3",
        "f5",
        "f7",
        "f8"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Reference out of court; not all parties signed award in token of acceptance; cannot be made rule of court.",
      "supporting_facts": [
        "f7",
        "f8"
      ],
      "legal_basis": "Jugaldas Demodar Modi Co. v. Pursottam Umedbhai Co."
    },
    {
      "id": "pa3",
      "text": "Earlier litigation about house allotted to appellant and brothers prevents it being subject of arbitration.",
      "supporting_facts": [
        "f2",
        "f3"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Dispute referred related to houses sold in auction; Dulari's interest only in maintenance recovery from Rs. 3,000/- deposit per earlier award; her rights intact, not affected; charge preserved; she did not object; died three years ago, question academic.",
      "addresses_issue": "i1",
      "key_observation": "Dulari Bahu did not sign agreement but her rights unaffected; no objection raised by her."
    },
    {
      "id": "cr2",
      "text": "Out-of-court reference valid without suit pending; consent needed only at reference stage, not award; distinguishes cases with pending suits; proviso to s.47 Arbitration Act applies only if suit pending.",
      "addresses_issue": "i2",
      "key_observation": "No suit pending; parties can refer without court intervention; award enforceable without all signing."
    },
    {
      "id": "cr3",
      "text": "Parties agreed to refer dispute; prior litigation on property does not prevent fresh arbitration reference.",
      "addresses_issue": "i3",
      "key_observation": "Agreement to arbitrate overrides prior litigation history."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Award valid; Dulari Bahu's rights not prejudicially affected.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Out-of-court arbitration award enforceable without all parties signing, if no suit pending.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Prior litigation does not bar arbitration on same property if parties agree.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Jugaldas Demodar Modi Co. v. Pursottam Umedbhai Co.",
      "citation": null,
      "treatment": "distinguished",
      "relevance": "Dealt with arbitration during pendency of suit; not applicable here as no suit pending."
    }
  ],
  "statutes_cited": [
    {
      "name": "Arbitration Act, 1940",
      "sections": [
        "47"
      ],
      "relevance": "Proviso allows award as compromise if suit pending and parties consent; not applicable without pending suit."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court dismissed the appeal, upheld Madhya Pradesh High Court judgment making the arbitration award dated 20-10-1956 a rule of the court, finding no infirmity in proceedings or award.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The rights of Dulari Bahu in this respect remained intact and were in no way affected by the award dated 20th October, 1956.",
      "speaker": "court",
      "significance": "Core finding rejecting invalidity due to non-joinder of Dulari Bahu."
    },
    {
      "text": "It is always open to parties to refer a dispute to arbitration without the intervention of the Court.",
      "speaker": "court",
      "significance": "Clarifies validity of out-of-court references absent pending suit."
    }
  ],
  "_case_id": "1971_448",
  "_label": 0,
  "_text_length": 9192,
  "_extracted_at": "2026-02-10T20:16:56.646983"
}