{
  "metadata": {
    "case_name": "Appellant (Sub-Inspector) v. State",
    "case_year": 1969,
    "court": "Supreme Court of India",
    "judges": [
      "Hegde, J."
    ],
    "case_number": "Criminal Appeal No. 3 of 1969",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "In July 1965, there was a dacoity within the limits of Railway Police Station, Nagpur. Several properties belonging to the Railways were stolen.",
      "type": "material",
      "date": "1965-07",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "During the investigation, the Railway Police sought the assistance of the local police. Inspector Khandagale (D.W.1), in charge of the Tehsil police station, directed the appellant, the Sub-Inspector working under him, to assist the Railway Police.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Part of the investigation was carried on by the appellant. Two persons arrested in connection with the dacoity were Ambadas and Deorao. They made certain statements on July 21, 1965.",
      "type": "material",
      "date": "1965-07-21",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "In pursuance of the information given by Deorao, the police in the presence of Panchas recovered certain properties. The concerned panchnama was attested by Pochanna and Abdul Gani.",
      "type": "material",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f5",
      "text": "After investigation, a charge-sheet was filed against several persons including Ambadas and Deorao under Section 395 IPC. The case was committed to the Court of Sessions, Nagpur, and tried as Sessions Trial No. 8 of 1966 before the Additional Sessions Judge, Nagpur.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Trial commenced on June 6, 1966. Pochanna, one Panch witness, examined on June 9, 1966, did not support the prosecution.",
      "type": "procedural",
      "date": "1966-06-09",
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Abdul Gani, the other Panch witness, cited but not present on June 9. On June 10, 1966, one person claiming to be Abdul Gani was examined; he deposed that he attested the panchnama and was present at recoveries.",
      "type": "procedural",
      "date": "1966-06-10",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "On June 11, 1966, the appellant was examined and deposed that the person examined on June 10 was Abdul Gani who attested the panchnama.",
      "type": "procedural",
      "date": "1966-06-11",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Accused discovered the person was not Abdul Gani but Dilawar. Real Abdul Gani had migrated to Rajnandgaon. Counsel Mr. Ingle filed application alleging imposter, named Dilawar s/o Munirsha.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f10",
      "text": "Trial judge recalled the witness on June 14, 1966. Witness confessed he was not Abdul Gani, did not attest panchnama, but was compelled by appellant to depose falsely.",
      "type": "material",
      "date": "1966-06-14",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Trial judge issued notice to appellant to show cause why he should not be prosecuted for perjury and fabricating false evidence. Appellant replied on June 16, 1966, asserting it was real Abdul Gani, denying Dilawar, alleging witness purchased by accused.",
      "type": "procedural",
      "date": "1966-06-16",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Appellant recalled and re-examined, reiterated stand. In cross-examination, admitted knowing the person for over three years.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Accused produced real Abdul Gani, who deposed he attested panchnama. Trial judge compared signatures, found them to tally.",
      "type": "material",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f14",
      "text": "After conclusion of trial, Additional Sessions Judge acquitted all accused and directed prosecution of Dilawar and appellant under Sections 195 and 196 IPC. Filed complaint under Section 479-A CrPC, recording findings that they intentionally gave false evidence and fabricated false evidence, expedient in interests of justice.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f15",
      "text": "Appellant and Dilawar tried, convicted, sentenced to 3 years RI under each count, concurrent. Dilawar did not appeal.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f16",
      "text": "Appellant appealed to Bombay High Court, Nagpur Bench (Criminal Appeal No. 74 of 1968), summarily dismissed by judgment dated September 2, 4, 1968.",
      "type": "procedural",
      "date": "1968-09-02",
      "source": "lower_court"
    },
    {
      "id": "f17",
      "text": "Supreme Court granted special leave, set aside High Court order, remitted for re-admission and disposal according to law.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f18",
      "text": "High Court re-heard and dismissed appeal again.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the requirements of Section 479-A of the Code of Criminal Procedure have been complied with before instituting the complaint from which this appeal arises and if they have not been complied with whether the prosecution is vitiated?",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The complaint is vitiated because after arriving at the findings under Section 479-A and before filing the complaint, the Sessions Judge had not given the appellant an opportunity to show cause why complaint should not be filed.",
      "supporting_facts": [
        "f11",
        "f14"
      ],
      "legal_basis": "Section 479-A CrPC; Dr. B. K. Pal Chaudhry v. The State of Assam; Kuppa Goundan v. M. S. P. Rajesh"
    },
    {
      "id": "pa2",
      "text": "Possibility that appellant innocently thought Dilawar was real Abdul Gani cannot be ruled out.",
      "supporting_facts": [
        "f8",
        "f12"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Explanation given by appellant in dacoity case and his evidence therein are inadmissible in present proceedings.",
      "supporting_facts": [
        "f11",
        "f12"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "So far as merits, little to be said in favour of appellant. Dilawar posed as Abdul Gani, appellant responsible for inducing him. Appellant knew real Abdul Gani well, as per admissions, no mistake possible. Plea of erroneous impression not entertainable.",
      "addresses_issue": "i1",
      "key_observation": "Appellant had no regard for truth."
    },
    {
      "id": "cr2",
      "text": "Admissions by appellant in dacoity case relevant and admissible as substantive evidence.",
      "addresses_issue": "i1",
      "key_observation": "Admission is substantive evidence unless proved incorrect."
    },
    {
      "id": "cr3",
      "text": "Trial judge recorded required findings under Section 479-A: intentionally false evidence and fabricated evidence, expedient for prosecution in interests of justice. Opportunity to show cause before complaint not mandatory for trial court - only if court thinks fit.",
      "addresses_issue": "i1",
      "key_observation": "Mandatory: findings at time of judgment. Discretionary: opportunity before complaint."
    },
    {
      "id": "cr4",
      "text": "Distinction with appellate court under sub-s.5: mandatory opportunity. Trial court sees witness demeanour.",
      "addresses_issue": "i1",
      "key_observation": "Adequate opportunity already given earlier."
    },
    {
      "id": "cr5",
      "text": "Cited precedents support: opportunity not mandatory under s.479A(1). Relied cases distinguished as one appellate complaint, other sub-s.6.",
      "addresses_issue": "i1",
      "key_observation": "Section introduced to eradicate perjury evils efficiently."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Requirements of Section 479-A CrPC complied with; giving opportunity before complaint not mandatory for trial court.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Appellant guilty of intentionally giving false evidence and fabricating false evidence.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Rukmani Bai v. G. R. Govindaswamy Chetty",
      "citation": "1963 M.L.J. 421",
      "treatment": "followed",
      "relevance": "Section 479-A(1) does not mandatorily require opportunity before complaint."
    },
    {
      "case_name": "Rc. Javvaji Uthanna",
      "citation": "A.I.R. 1964 A.P. 368",
      "treatment": "followed",
      "relevance": "Section 479-A(1) does not mandatorily require opportunity before complaint."
    },
    {
      "case_name": "Dr. B. K. Pal Chaudhry v. The State of Assam",
      "citation": "1960 1 S.C.R. 945",
      "treatment": "distinguished",
      "relevance": "Concerned appellate court complaint under ss.1 and 5; requires hearing."
    },
    {
      "case_name": "Kuppa Goundan v. M. S. P. Rajesh",
      "citation": "1966 Supp. S.C.R. 373",
      "treatment": "distinguished",
      "relevance": "Concerned sub-section 6 of Section 479-A."
    }
  ],
  "statutes_cited": [
    {
      "name": "Code of Criminal Procedure",
      "sections": [
        "479-A",
        "476",
        "477",
        "478",
        "479",
        "200"
      ],
      "relevance": "Procedure for complaint against perjury/fabrication of evidence; trial court discretion on opportunity."
    },
    {
      "name": "Indian Penal Code",
      "sections": [
        "195",
        "196",
        "395"
      ],
      "relevance": "Offences of giving false evidence and fabricating false evidence; dacoity charge."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court dismissed the appeal, upholding the High Court's dismissal and the conviction and sentence of the appellant to three years rigorous imprisonment under Sections 195 and 196 IPC, sentences concurrent.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The only substantial question that arises for decision in this appeal by special leave is as to whether the requirements of Section 479-A of the Code of Criminal Procedure have been complied with before instituting the complaint",
      "speaker": "court",
      "significance": "Frames the core legal issue."
    },
    {
      "text": "Giving of an opportunity to the witness to show cause against the contemplated complaint is not mandatory. That step is required to be taken only if the court thinks fit - a matter left to the discretion of the trial court.",
      "speaker": "court",
      "significance": "Key holding on interpretation of Section 479-A(1)."
    },
    {
      "text": "This section was introduced into the Code with the idea of eradicating to the extent possible the evils of perjury and fabrication of false evidence a widespread evil that is corroding our judicial system.",
      "speaker": "court",
      "significance": "Explains legislative intent behind Section 479-A."
    }
  ],
  "_case_id": "1971_571",
  "_label": 0,
  "_text_length": 20773,
  "_extracted_at": "2026-02-10T20:19:27.483443"
}