{
  "metadata": {
    "case_name": "Commissioner of Income-tax, West Bengal v. Kamal Behari Lal Singha & Ors.",
    "case_year": 1968,
    "court": "Supreme Court of India",
    "judges": [
      "Hegde, J."
    ],
    "case_number": "Civil Appeals Nos. 1667 to 1673 of 1968",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appeals from judgment and order dated August 30, 1967 of Calcutta High Court in Income-tax Reference Nos. 3, 6, 7, 8, 9, 10 and 11 of 1964.",
      "type": "procedural",
      "date": "1967-08-30",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Kamal Behari Lal Singha (assessee) was a shareholder in Ukhara Estate Zamindaries Ltd. (company).",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "For assessment year 1950-51 (accounting year 1356 B.S. ending April 13, 1950), assessee received Rs. 13,200 as dividend from company, declared on October 19, 1949.",
      "type": "material",
      "date": "1949-10-19",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Out of Rs. 13,200 dividend, Rs. 8,829 paid out of accumulated capital gains received by company as selamis and land acquisition compensation after March 31, 1948, taken to reserve fund and distributed as dividends.",
      "type": "material",
      "date": "post-1948-03-31",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Remainder of dividends paid out of balance of profit and loss account.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Income-tax Officer held dividend distributed out of capital gains taxable as dividend.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Appellate Assistant Commissioner held Rs. 8,829 not dividend u/s 2(6A) but taxable as income in hands of assessee.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Tribunal confirmed order of Appellate Assistant Commissioner.",
      "type": "procedural",
      "date": null,
      "source": "tribunal"
    },
    {
      "id": "f9",
      "text": "Calcutta High Court disagreed with authorities and Tribunal, answered questions in favour of assessees.",
      "type": "procedural",
      "date": "1967-08-30",
      "source": "high_court"
    },
    {
      "id": "f10",
      "text": "Facts in each appeal similar.",
      "type": "background",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether on the facts and circumstances, Tribunal right in holding distribution to assessee of amount attributable to land acquisition compensation received by Ukhara Estate Zamindaries Ltd. after 31st March, 1948 was receipt of dividend within meaning of Section 2(6A) of Indian Income-tax Act, 1922 in hands of assessee?",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether on the facts and circumstances, Tribunal right in holding receipt by assessee of amount attributable to selamis realised by Ukhara Estate Zamindaries Ltd. for grant of long-term leases after 31st March, 1948 was receipt of income of assessee taxable as income from other sources?",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Dividend distributed out of capital gains taxable as dividend (ITO view); alternatively taxable as income other than dividend (AAC and Tribunal).",
      "supporting_facts": [
        "f4",
        "f6",
        "f7",
        "f8"
      ],
      "legal_basis": "Section 2(6A) of Indian Income-tax Act, 1922"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Receipt of Rs. 8,829 not dividend within meaning of s.2(6A); not taxable as income.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": "Section 2(6A) of Indian Income-tax Act, 1922"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Nature of receipt determined by its character in hands of receiver, not payer. Amount paid out of capital by payer but received as income by receiver is taxable as income of receiver.",
      "addresses_issue": "i1",
      "key_observation": "Fact that amount was capital gains in hands of company not relevant; see what it was in hands of assessee."
    },
    {
      "id": "cr2",
      "text": "First question settled by CIT WB v. Nalin Behari Lall Singha: such receipts not dividends. That case left undecided if taxable as other income.",
      "addresses_issue": "i1",
      "key_observation": "Court refused to go into whether chargeable as other income as not raised before Tribunal or High Court."
    },
    {
      "id": "cr3",
      "text": "To draw line between capital and revenue receipt: consider source and circumstances of receipt. If receiver beneficially entitled to capital, payments out of capital regarded as capital; if right to income only and capital belongs to others, payments out of capital come as income.",
      "addresses_issue": "i2",
      "key_observation": "Quoted Finley J. in Trustees of Will of H.K. Brodie."
    },
    {
      "id": "cr4",
      "text": "Assessees shareholders beneficially entitled to company's capital. Amount (salamis, compensation) capital receipt for company, not earned in business. Assessees had beneficial interest in it when with company; distribution gave each shareholder share of capital they were entitled to.",
      "addresses_issue": "i2",
      "key_observation": "Receipt capital in hands of assessee; fact distributed as dividends does not change nature. Receipt is what it is, not what called."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Distribution of amount from land acquisition compensation and selamis post 31/3/48 not dividend u/s 2(6A); capital receipt in hands of assessee shareholders.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Such receipts not income taxable as income from other sources; capital receipts.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Commissioner of Income-tax, West Bengal v. Nalin Behari Lall Singha",
      "citation": "74 I.T.R. 749",
      "treatment": "followed",
      "relevance": "Settled that similar receipts not dividends u/s 2(6A)."
    },
    {
      "case_name": "Trustees of the Will of H. K. Brodie deceased v. Commissioner Inland Revenue",
      "citation": "17 T.C. 432",
      "treatment": "referred",
      "relevance": "Principles to distinguish capital from revenue receipt based on source, circumstances, and beneficial entitlement."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act, 1922",
      "sections": [
        "Section 2(6A)"
      ],
      "relevance": "Definition of dividend; disputed receipts held not within meaning as capital in hands of receiver."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeals by Commissioner dismissed; High Court decision upheld that disputed amounts not taxable as dividends or income from other sources, being capital receipts in hands of assessee shareholders.",
    "relief_granted": "Assessees not liable to tax on disputed amounts.",
    "costs": "Dismissed with costs - hearing fee one set."
  },
  "key_quotes": [
    {
      "text": "\"A receipt is what it is and not what it is called.\"",
      "speaker": "court",
      "significance": "Core holding on true nature of receipt overriding label as dividend."
    },
    {
      "text": "\"the nature of receipt is determined entirely by its character in the hands of the receiver and the source from which the payment is made has no bearing on the question.\"",
      "speaker": "court",
      "significance": "Principle applied to treat as capital despite company's treatment."
    },
    {
      "text": "\"If the capital belonged to the person receiving the sums--if he or she was beneficially entitled not only to the income but to the capital then ... payments out of capital ... ought to be regarded ... as payments out of capital.\"",
      "speaker": "court",
      "significance": "From Brodie case; applied to shareholders' entitlement."
    }
  ],
  "_case_id": "1971_293",
  "_label": 0,
  "_text_length": 8506,
  "_extracted_at": "2026-02-10T20:15:30.306162"
}