{
  "metadata": {
    "case_name": "Assessee v. Commissioner of Income Tax",
    "case_year": 1968,
    "court": "Supreme Court of India",
    "judges": [
      "Grover, J."
    ],
    "case_number": "Civil Appeal No. 1928 of 1968",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The assessee is a private limited company carrying on the business of manufacture and sale of sugar with two sugar mills one at Maholi Sitapur and the other at Raja-ka-Sahaspur Moradabad. Head office at New Delhi.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "During the accounting period relating to the assessment year 1956-57 sums of Rs. 75,000/- and Rs. 37,500/- were paid by the assessee to the Cane Development Council of the Sugarcane Department of the Government of Uttar Pradesh by way of contribution for road development between the various sugarcane producing centers and the sugar factories of the assessee.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The revenue authorities found that these contributions were intended to be applied for the construction and development of roads between the sugarcane producing centres and the sugar mills and held that these amounts constituted capital expenditure and could not be allowed as an admissible deduction while computing the total income of the assessee.",
      "type": "procedural",
      "date": null,
      "source": "revenue"
    },
    {
      "id": "f4",
      "text": "The Appellate Tribunal upheld the order of the departmental authorities.",
      "type": "procedural",
      "date": null,
      "source": "tribunal"
    },
    {
      "id": "f5",
      "text": "On an application being moved the Tribunal referred two questions of law to the High Court. Concerned with the second question: Whether the sums of Rs. 75,000 and Rs. 37,500 paid to the Road Development Fund set up by the Government of U.P. were rightly disallowed as items of capital expenditure?",
      "type": "procedural",
      "date": null,
      "source": "tribunal"
    },
    {
      "id": "f6",
      "text": "The High Court held that the aforesaid expenditure could not be regarded as revenue expenditure and the answer was returned against the assessee.",
      "type": "procedural",
      "date": "1967-02-17",
      "source": "high_court"
    },
    {
      "id": "f7",
      "text": "The expenditure incurred was for the development of roads and the assessee was under an obligation to make the aforesaid contributions under the provisions of the U. P. Sugarcane Regulation of Supply Purchase Act, 1953.",
      "type": "admitted",
      "date": null,
      "source": "assessee"
    },
    {
      "id": "f8",
      "text": "The roads were originally the property of the government and remained so after the improvement had been made.",
      "type": "admitted",
      "date": null,
      "source": "assessee"
    },
    {
      "id": "f9",
      "text": "The sole reason for which the assessee had made the contribution was that the improved roads would facilitate the transportation of cane from the cane producing centres to the premises of the mills and also the flow of supply to and from the factories of the assessee.",
      "type": "admitted",
      "date": null,
      "source": "assessee"
    },
    {
      "id": "f10",
      "text": "The expenditure was incurred for reasons of commercial expediency and for the benefit of the day to day business of the assessee.",
      "type": "admitted",
      "date": null,
      "source": "assessee"
    },
    {
      "id": "f11",
      "text": "It was admitted on behalf of the assessee that if expenditure had been incurred by it for building roads of its own it would be capital expenditure.",
      "type": "admitted",
      "date": null,
      "source": "assessee"
    },
    {
      "id": "f12",
      "text": "The roads which were constructed and developed were not the property of the assessee nor is it the case of the Revenue that the entire cost of development of those roads was defrayed by the assessee. It only made certain contribution for road development between the various cane producing centres and the mills.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "The apparent object and purpose was to facilitate the running of its motor vehicles or other means employed for transportation of sugarcane to the factory.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "The Tribunal did not give any finding that the roads were to be altogether newly made and that the assessee would get an enduring benefit from these roads.",
      "type": "disputed",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the sums of Rs. 75,000 and Rs. 37,500 paid to the Road Development Fund set up by the Government of U.P. were rightly disallowed as items of capital expenditure?",
      "framed_by": "tribunal"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The expenditure was properly attributable to running the business or working it with a view to produce the profits.",
      "supporting_facts": [
        "f7",
        "f8",
        "f9",
        "f10"
      ],
      "legal_basis": "U. P. Sugarcane Regulation of Supply Purchase Act, 1953; commercial expediency"
    },
    {
      "id": "pa2",
      "text": "The expenditure was incurred for reasons of commercial expediency and for the benefit of the day to day business of the assessee.",
      "supporting_facts": [
        "f2",
        "f9",
        "f13"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The expenditure which was incurred by the assessee was intended for bringing into existence an advantage for the enduring benefit of the business.",
      "supporting_facts": [
        "f2",
        "f3"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "No difference if expenditure was incurred under compulsion or even without compulsion if the roads were built for facilitating transportation and improving the business and the flow of supply to and from the factories of the assessee.",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The general principles governing the determination of the question whether an expenditure is in the nature of capital or revenue expenditure are well known. Where expenditure is incurred while the business is being carried on and not for its extension or for the substantial replacement of its equipment the position would be as follows - If the expenditure is made for acquiring or bringing into existence an asset or advantage for the enduring benefit of the business it is properly attributable to capital and is of the nature of capital expenditure. If on the other hand it is made not for the purpose of bringing into existence any such asset or advantage but for running the business or working it with a view to produce the profits it is a revenue expenditure.",
      "addresses_issue": "i1",
      "key_observation": "Cited Assam Bengal Cement Ltd. v. Commissioner of Income tax, West Bengal"
    },
    {
      "id": "cr2",
      "text": "The Calcutta High Court had occasion to consider an identical question in Commissioner of Income tax, West Bengal v. Hindustan Motors Ltd. There the approach road belonged to the government. It fell into disrepair... The assessee offered to contribute a certain amount for the improvement. The High Court had no difficulty in coming to the conclusion that the money was spent not so much to bring about any asset or advantage of enduring benefit to itself but it was incurred for its efficient and convenient running and therefore it was of revenue nature.",
      "addresses_issue": "i1",
      "key_observation": "Distinction sought by Revenue not sound; criteria from business point of view"
    },
    {
      "id": "cr3",
      "text": "In the present case apart from the element of compulsion the roads which were constructed and developed were not the property of the assessee nor is it the case of the Revenue that the entire cost of development of those roads was defrayed by the assessee... From the business point of view and on a fair appreciation of the whole situation the assessee considered that the development of the road in question would greatly facilitate the transportation of sugarcane. This was essential for the benefit of its business which was of manufacturing sugar in which the main raw material admittedly consisted of sugarcane. These facts would bring it within the second part of the principle mentioned before, namely, that the expenditure was incurred for running the business or working it with a view to produce the profits without the assessee getting any advantage of an enduring benefit to itself.",
      "addresses_issue": "i1",
      "key_observation": "Expenditure for running business, no enduring benefit"
    },
    {
      "id": "cr4",
      "text": "The ratio of the decision in Commissioner of Income tax, West Bengal, v. Royal Calcutta Turf Club would be applicable... the expenditure incurred on running the school must be regarded as having been wholly and exclusively laid out for the purpose of the business of the club. Emphasis was laid on the principle that in order to justify a deduction it must be for reasons of commercial expediency and it must be incurred for the assessee's business.",
      "addresses_issue": "i1",
      "key_observation": "Satisfied expenditure incurred for commercial expediency apart from statutory compulsion"
    },
    {
      "id": "cr5",
      "text": "The development of the roads was necessarily meant for facilitating the carrying on of the assessee's business. Furthermore the Tribunal did not give any finding that the roads were to be altogether newly made and that the assessee would get an enduring benefit from these roads.",
      "addresses_issue": "i1",
      "key_observation": "No finding of new roads or enduring benefit"
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The expenditure in question should have, therefore, been allowed as an admissible deduction.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Assam Bengal Cement Ltd. v. Commissioner of Income tax, West Bengal",
      "citation": "27 I.T.R. 34,45",
      "treatment": "followed",
      "relevance": "General principles on capital vs revenue expenditure"
    },
    {
      "case_name": "Commissioner of Income tax, West Bengal v. Hindustan Motors Ltd.",
      "citation": "68 I.T.R. 301",
      "treatment": "followed",
      "relevance": "Identical question on contribution for government road improvement; held revenue expenditure"
    },
    {
      "case_name": "Commissioner of Income tax, West Bengal v. Royal Calcutta Turf Club",
      "citation": "41 I.T.R. 414",
      "treatment": "followed",
      "relevance": "Expenditure for commercial expediency to run business; applicable ratio"
    }
  ],
  "statutes_cited": [
    {
      "name": "U. P. Sugarcane Regulation of Supply Purchase Act, 1953",
      "sections": [],
      "relevance": "Imposed obligation on assessee to make contributions"
    },
    {
      "name": "Indian Income tax Act 1922",
      "sections": [
        "s. 10(2)(xv)"
      ],
      "relevance": "Deduction for expenditure wholly and exclusively laid out for business"
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "The appeal is allowed and the answer given by the High Court to the question referred is discharged. We would return the answer in the negative and in favour of the assessee.",
    "relief_granted": "Expenditure allowed as admissible deduction",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "If the expenditure is made for acquiring or bringing into existence an asset or advantage for the enduring benefit of the business it is properly attributable to capital and is of the nature of capital expenditure. If on the other hand it is made not for the purpose of bringing into existence any such asset or advantage but for running the business or working it with a view to produce the profits it is a revenue expenditure.",
      "speaker": "court",
      "significance": "Core test for distinguishing capital from revenue expenditure"
    },
    {
      "text": "We are satisfied that in the present case the expenditure was incurred by the assessee for reasons of commercial expediency apart from statutory compulsion to which reference has been made before.",
      "speaker": "court",
      "significance": "Justifies allowance of deduction"
    }
  ],
  "_case_id": "1971_289",
  "_label": 1,
  "_text_length": 9350,
  "_extracted_at": "2026-02-10T20:15:38.752889"
}