{
  "metadata": {
    "case_name": "Abdul Razak v. Abdul Hai & Ors.",
    "case_year": 1967,
    "court": "Supreme Court of India",
    "judges": [
      "Ray, J."
    ],
    "case_number": "Civil Appeal No. 219 of 1967",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Shah Abdul Rahim died on 26 September 1905 leaving four sons Abdul Hai (major, eldest), Ghulam Nooruddin, Abdul Razak (appellant, minor), Ghulam Ghouse Mohiuddin and two daughters Kamarunnissa Begum and Badiunnissa Begum, with large movable and immovable properties.",
      "type": "background",
      "date": "1905-09-26",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "In July 1908, sons and daughters entered into two agreements appointing arbitrators to partition Matrooka properties of Shah Abdul Rahim.",
      "type": "procedural",
      "date": "1908-07",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On 1 August 1908, arbitrators made an award partitioning properties; appellant (minor) represented by brother Ghulam Nooruddin as guardian.",
      "type": "procedural",
      "date": "1908-08-01",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Parties to arbitration: Abdul Hai, Ghulam Nooruddin, Abdul Razak (by Nooruddin), Qamarunnissa Begum, Badiunnissa Begum.",
      "type": "admitted",
      "date": "1908",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Before arbitrators, no dispute framed as issues; plaintiffs marked plan with letter F showing properties attached to Khankah and Dargah (Exhibits B-1 to B-10), relinquished title stating no present or future share.",
      "type": "material",
      "date": "1908",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Abdul Hai stated before arbitrators he was Sajjada Nashin in possession of Dargah and Khankah properties.",
      "type": "disputed",
      "date": "1908",
      "source": "respondent"
    },
    {
      "id": "f7",
      "text": "On 13 August 1908, decree in Darul Khaza Court, Hyderabad confirming award; plaint by Nooruddin, Abdul Razak (by Nooruddin), sisters vs. Abdul Hai as defendant.",
      "type": "procedural",
      "date": "1908-08-13",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Decree recited Syed Shah Nooruddin had Khankah and Dargah; son-in-law Abdur Rahim became Sajjada; after his death Abdul Hai became Sajjada Nashin in control; Abdur Rahim left three adult sons, one minor son, two adult daughters; properties marked F were Khankah/Dargah in possession of Abdul Hai for expenses, not liable to partition.",
      "type": "material",
      "date": "1908-08-13",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Appellant filed suit on 24 July 1941 to set aside 1908 decree, for partition including properties B-1 to B-10 as Matrooka.",
      "type": "procedural",
      "date": "1941-07-24",
      "source": "petitioner"
    },
    {
      "id": "f10",
      "text": "Suit dismissed in 1942; appeal to Hyderabad High Court in 1943; Abdul Hai died 1950, LRs brought on record Feb 1952; appeal remanded by AP HC April 1957 to City Civil Court.",
      "type": "procedural",
      "date": "1942-1957",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "On 18 October 1958, Additional Chief Judge, City Civil Court decreed suit for appellant, cancelled 1908 decree, preliminary decree for partition including B-1 to B-10.",
      "type": "procedural",
      "date": "1958-10-18",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "AP HC on 15 December 1965 set aside trial court decree, dismissed suit.",
      "type": "procedural",
      "date": "1965-12-15",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Trial court held award/decree obtained by fraud; Abdul Hai in full possession of all properties including B-1 to B-10; Exhibit P-8 (13 Aug 1938 letter) Abdul Hai denied waqf, asserted owned/possessed by him, relinquished by relatives; knew not Dargah but represented as such; appellant knew from this letter, suit not barred.",
      "type": "material",
      "date": "1938-08-13",
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "In 1927, Govt of Nizam attached personal and Dargah/Khankah properties; released same year except two villages Debser and Sangvi.",
      "type": "background",
      "date": "1927",
      "source": "court"
    },
    {
      "id": "f15",
      "text": "Abdul Hai in 1927-1928 correspondence asserted B-1 to B-10 not Dargah/Khankah; Nizam firman 11 Nov 1927 to release to Abdul Hai; Ecclesiastical Dept 28 Dec 1927 only two villages Dargah; release 3 Jan 1928 except villages; Govt 5 Jan 1939 no other Dargah properties.",
      "type": "material",
      "date": "1927-1939",
      "source": "court"
    },
    {
      "id": "f16",
      "text": "Appellant discovered in 1938/1941 (1350 Fasli) via Exhibit P-8 and other letter that properties not Dargah/Khankah; demanded partition, Abdul Hai suggested consult lawyer.",
      "type": "material",
      "date": "1938-1941",
      "source": "petitioner"
    },
    {
      "id": "f17",
      "text": "Exhibit A-38: Appellant letter 19 Oct 1927 to Abdul Hai mentioning indebtedness, litigation expenses divided.",
      "type": "disputed",
      "date": "1927-10-19",
      "source": "respondent"
    },
    {
      "id": "f18",
      "text": "No order appointing Nooruddin as guardian in Darul Khaza proceedings; application stated minor under brother's guardianship, but no appointment.",
      "type": "admitted",
      "date": "1908",
      "source": "court"
    },
    {
      "id": "f19",
      "text": "Brother not lawful guardian under Mohammedan Law; legal guardians: father, executor, father's father, etc.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f20",
      "text": "Properties B-1 to B-10 established not Dargah/Khankah but Matrooka.",
      "type": "material",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether arbitration agreement, award and 1908 decree void due to lack of lawful guardian for minor appellant (represented by brother Nooruddin).",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether 1908 decree obtained by fraud of Abdul Hai misrepresenting B-1 to B-10 as Dargah/Khankah properties.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether suit barred by limitation: knowledge of adverse claim/ouster by 1927; or from 1938/1941 discovery; effect of s.18 Limitation Act.",
      "framed_by": "court"
    },
    {
      "id": "i4",
      "text": "Effect of written statement by defendant No.6 in 1958 and omission by No.7.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Award/decree void for lack of lawful guardian for minor; Nooruddin (brother) not lawful guardian under Mohammedan Law.",
      "supporting_facts": [
        "f4",
        "f18",
        "f19"
      ],
      "legal_basis": "Mohammedan Law; Mohd. Amin v. Vakil Ahmed; Imambandi v. Mutsaddi"
    },
    {
      "id": "pa2",
      "text": "Award/decree obtained by fraud: Abdul Hai misrepresented B-1 to B-10 as Dargah/Khankah despite knowing they were Matrooka (evidenced by 1927-38 letters, possession).",
      "supporting_facts": [
        "f5",
        "f6",
        "f13",
        "f15",
        "f16"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Knowledge/discovery in 1938/1941 via Exhibit P-8; suit within time from fraud discovery; no ouster in 1927.",
      "supporting_facts": [
        "f16",
        "f17"
      ],
      "legal_basis": "Limitation Act 1908 s.18, Art.144"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "No fraud in obtaining decree; Nooruddin accepted as guardian by court.",
      "supporting_facts": [
        "f18"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Appellant knew of adverse claim by 1927 (attachment/release, Exhibit A-38); suit barred by limitation; decree not nullity, suit within 3 years of majority.",
      "supporting_facts": [
        "f14",
        "f17"
      ],
      "legal_basis": "Limitation Act"
    },
    {
      "id": "ra3",
      "text": "Decree not by fraud; properties treated as Dargah; adverse possession since 1927.",
      "supporting_facts": [
        "f14",
        "f15"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Arbitration agreement, award, decree void ab initio due to lack of legal guardian for minor; brother not lawful guardian under Mohammedan Law; no court appointment; conflict of interest.",
      "addresses_issue": "i1",
      "key_observation": "Void not only qua minor but all parties per precedent."
    },
    {
      "id": "cr2",
      "text": "Fraud established: Abdul Hai knew/concealed true Matrooka nature of B-1 to B-10, misrepresented as Dargah/Khankah to arbitrators/court; confirmed by 1927-38 govt proceedings he concealed from co-heirs.",
      "addresses_issue": "i2",
      "key_observation": "Active concealment; no contest indicates misled parties."
    },
    {
      "id": "cr3",
      "text": "No knowledge/ouster by 1927; appellant unaware of 1927 claims (not confronted with letters); discovery 1938/1941; s.18 Limitation Act applies as fraud kept from knowledge; possession by co-owner not adverse without ouster.",
      "addresses_issue": "i3",
      "key_observation": "Time from fraud knowledge; no clear/definite knowledge earlier."
    },
    {
      "id": "cr4",
      "text": "Properties Matrooka, not Dargah; basis of award/decree wiped out; re-open partition; no partial partition under Mohammedan Law.",
      "addresses_issue": "i4",
      "key_observation": "Heirs tenants-in-common; shares definite."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Arbitration agreement, award and 1908 decree void for lack of legal guardian.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Decree set aside on ground of fraud; properties B-1 to B-10 Matrooka liable to partition.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h3",
      "text": "Suit not barred by limitation; time runs from 1938/1941 discovery per s.18 Limitation Act; no ouster.",
      "resolves_issue": "i3",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Mohd. Amin Ors. v. Vakil Ahmed Ors.",
      "citation": "1952 S.C.R. 1133",
      "treatment": "followed",
      "relevance": "Brother not legal guardian; deed void qua minor and all parties."
    },
    {
      "case_name": "Imambandi v. Mutsaddi",
      "citation": "45 I.A. 73",
      "treatment": "followed",
      "relevance": "Legal guardians under Mohammedan Law defined."
    },
    {
      "case_name": "Birth v. Birch",
      "citation": "1902 Probate Division 131",
      "treatment": "followed",
      "relevance": "Set aside judgment if new facts show probable success."
    },
    {
      "case_name": "Rolfe v. Gregory",
      "citation": "1864 4 DeG. J. & S. 576",
      "treatment": "followed",
      "relevance": "Fraud remedy not barred by time if ignorance without fault."
    },
    {
      "case_name": "Biman Chandra Datta v. Promotha Nath Ghose",
      "citation": "I.L.R. 49 Cal. 886",
      "treatment": "referred",
      "relevance": "s.18 Limitation Act for fraud concealment."
    },
    {
      "case_name": "Rahim Bux v. Turner",
      "citation": "20 I.A. 1",
      "treatment": "followed",
      "relevance": "Burden on fraudster to show clear knowledge."
    },
    {
      "case_name": "Monsharam Chakrabarty v. Gonesh Chandra Chakrabarty",
      "citation": "17 C.W.N. 521",
      "treatment": "referred",
      "relevance": "Partition cause perpetually recurring."
    }
  ],
  "statutes_cited": [
    {
      "name": "Limitation Act, 1908",
      "sections": [
        "Section 18",
        "Article 144"
      ],
      "relevance": "Time from knowledge of fraud; for co-owners, from ouster."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; High Court judgment set aside; trial court judgment and decree restored, cancelling 1908 decree and granting preliminary partition decree including B-1 to B-10 as Matrooka properties.",
    "relief_granted": "Cancellation of 1908 decree; preliminary decree for partition of Matrooka properties including Exhibits B-1 to B-10.",
    "costs": "Appellant entitled to costs of Supreme Court."
  },
  "key_quotes": [
    {
      "text": "The brother is not a lawful guardian under the Mohammedan Law. The legal guardians are the father, the executor appointed by the father's will...",
      "speaker": "court",
      "significance": "Basis for voiding arbitration/decree."
    },
    {
      "text": "Possession by one co-owner is not by itself adverse to other co-owners. Possession by one co-owner is presumed to be the possession of all the co-owners unless...",
      "speaker": "court",
      "significance": "No ouster/adverse possession established."
    },
    {
      "text": "when the remedy is given on the ground of fraud, it is governed by this important principle, that the right of the party defrauded is not affected by lapse of time...",
      "speaker": "court",
      "significance": "Limits limitation for fraud (citing Rolfe v. Gregory)."
    }
  ],
  "_case_id": "1971_84",
  "_label": 1,
  "_text_length": 30487,
  "_extracted_at": "2026-02-10T20:14:22.610174"
}