{
  "metadata": {
    "case_name": "Kumari N. Vasundara v. State of Mysore",
    "case_year": 1970,
    "court": "Supreme Court of India",
    "judges": [
      "Dua, J."
    ],
    "case_number": "Writ Petition No. 606 of 1970",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Petitioner Kumari N. Vasundara passed the Pre-University Examination of the Bangalore University with physics, chemistry and biology as optional subjects securing 78 marks in these subjects.",
      "type": "admitted",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f2",
      "text": "Petitioner applied for admission to the Pre-Professional B.Sc. Part 1 Course leading to M.B.B.S. in the Government Medical Colleges.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "Selection Committee interviewed petitioner on September 14, 1970, and rejected her application on the ground that she had not resided in the State of Mysore for a period of ten years prior to the date of her application as required by r. 3 of the Selection Rules.",
      "type": "procedural",
      "date": "1970-09-14",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "But for the condition requiring residence in Mysore State for a period of ten years prior to the date of her application, petitioner was otherwise eligible for admission under the Selection Rules in all other respects.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Selection Rules framed by State of Mysore on July 4, 1970.",
      "type": "background",
      "date": "1970-07-04",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Rule 3: To be eligible to apply, candidate must be domiciled and resident in the State of Mysore for not less than ten years at any time prior to the date of the application for a seat, with provisos for certain categories including children of Central/Mysore Government employees.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Number of candidates desirous of medical education is very much larger than the number of seats available in medical colleges.",
      "type": "background",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Constitutional validity of r. 3 of the Rules for Selection of candidates for admission to the Pre-Professional B.Sc. Part 1 Course leading to M.B.B.S. in the Government Medical Colleges and for certain seats in the private Medical Colleges in the State of Mysore.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Impugned rule violates Art. 14 by creating artificial classification between Indian citizens domiciled in Mysore who resided there for ten years or more and those who resided less, imposing unreasonable 10-year residence condition in addition to domicile.",
      "supporting_facts": [
        "f1",
        "f3",
        "f4"
      ],
      "legal_basis": "Art. 14"
    },
    {
      "id": "pa2",
      "text": "Period of ten years is arbitrary, unreasonable, without rational nexus to object of selecting best talent or meritorious students; students normally pass Pre-University at 16-17 years, depriving children of domiciled citizens temporarily residing elsewhere.",
      "supporting_facts": [
        "f1"
      ],
      "legal_basis": "Art. 14"
    },
    {
      "id": "pa3",
      "text": "If all states frame similar rules, children of mobile families would be unable to get admission anywhere.",
      "supporting_facts": [],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Rule selects students more likely to serve as doctors in the State after passing out; State entitled to determine sources of selection.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "Chitra Ghosh v. Union of India; K. Shivashankar v. University of Mysore"
    },
    {
      "id": "ra2",
      "text": "Counter-affidavit discloses purpose of serving interests of residents by providing medical aid.",
      "supporting_facts": [],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Classification based on residence does not violate Art. 14 if reasonable nexus to object; distinguished Minor P. Rajendran (district-wise allocation lacks nexus to securing best talent); followed Chitra Ghosh (State may classify sources reasonably for medical education).",
      "addresses_issue": "i1",
      "key_observation": "Object is to secure best talent likely to serve State; territorial classification valid if rational nexus."
    },
    {
      "id": "cr2",
      "text": "In D.P. Joshi, 'domicile' interpreted as residence with intent; here r.3 uses 'domicile' to convey intention to reside, 10-year period not shown unreasonable.",
      "addresses_issue": "i1",
      "key_observation": "Rule aims to impart education to those likely to serve Mysore inhabitants."
    },
    {
      "id": "cr3",
      "text": "Hardships possible but do not invalidate rule; redress for policy issues elsewhere.",
      "addresses_issue": "i1",
      "key_observation": "Proper classification for limited seats to provide medical aid to State's people."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Rule 3 constitutionally valid under Art. 14; 10-year residence condition reasonable with nexus to selecting candidates likely to serve State.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Minor P. Rajendran v. State of Madras",
      "citation": "1968 2 S.C.R. 786",
      "treatment": "distinguished",
      "relevance": "Struck down district-wise allocation for lacking nexus to securing best talent for medical colleges."
    },
    {
      "case_name": "Chitra Ghosh v. Union of India",
      "citation": "1970 1 S.C.R. 413",
      "treatment": "followed",
      "relevance": "State may classify sources reasonably (territorial etc.) for medical admissions; courts not to interfere if rational nexus."
    },
    {
      "case_name": "K. Shivashankar v. University of Mysore",
      "citation": "1970 1 Mys.L.J. 475",
      "treatment": "referred",
      "relevance": "Supports validity of selection rules."
    },
    {
      "case_name": "D. P. Joshi v. State of Madhya Bharat",
      "citation": "1955 1 S.C.R. 1215",
      "treatment": "followed",
      "relevance": "'Domicile' in rules means residence with intent; upheld residence-based classification for exemptions."
    }
  ],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 14",
        "Art. 32"
      ],
      "relevance": "Art. 14 for equality challenge; Art. 32 for writ petition."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Court upheld the constitutional validity of r. 3 of the Selection Rules, finding no violation of Art. 14, as the classification has rational nexus to selecting students likely to serve the State.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The object of selection can only be to secure the best possible material for admission to colleges subject to the provision for socially and educationally backward classes.",
      "speaker": "court",
      "significance": "Defines proper object of medical admissions from Minor P. Rajendran."
    },
    {
      "text": "If the sources are properly classified whether on territorial, geographical or other reasonable basis it is not for the courts to interfere with the manner and method of making the classification.",
      "speaker": "court",
      "significance": "Limits judicial interference in reasonable classifications from Chitra Ghosh."
    },
    {
      "text": "The impugned rule has not been shown by the petitioner to suffer from the vice of unreasonableness.",
      "speaker": "court",
      "significance": "Court's conclusion on validity of 10-year residence requirement."
    }
  ],
  "_case_id": "1971_191",
  "_label": 0,
  "_text_length": 18650,
  "_extracted_at": "2026-02-10T20:14:54.159508"
}