{
  "metadata": {
    "case_name": "Assessee v. Commissioner of Income Tax",
    "case_year": 1967,
    "court": "Supreme Court of India",
    "judges": [
      "Grover, J."
    ],
    "case_number": "Civil Appeal No. 1850 of 1967",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The assessee was assessed in the status of an individual. He derived income from house properties and from the business of a registered partnership firm H. Ganguly Co.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The assessee had six houses one of which was 24, Mohanlal Street, Calcutta and the other at Janganbari in the city of Banaras.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On March 19, 1953 the assessee created a trust in respect of these two houses.",
      "type": "material",
      "date": "1953-03-19",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "It was provided in the trust deed that the trustees shall pay a sum of Rs. 200/- per month to the settlor for life for his own absolute use and benefit out of the income of the trust estate remaining after payment of taxes, rents etc. In other words he himself was one of the beneficiaries.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The total annual income from these properties came to over Rs. 19,000. Out of this the assessee, who was the settlor, was entitled to Rs. 2,400/- annually.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The Income tax Officer held that the income from the aforesaid two properties was assessable in the hands of the assessee inasmuch as he had retained a portion of the income from the trust properties for himself. The trust had, therefore, become revocable under the provisions of s. 16(1)(c) of the Income tax Act, 1922.",
      "type": "procedural",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f7",
      "text": "The Appellate Assistant Commissioner on appeal affirmed the view taken by the Income tax Officer.",
      "type": "procedural",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f8",
      "text": "The Appellate Tribunal found that the assessee had irrevocably parted with the aforesaid two properties and the same had got vested in the trust. It was held that s. 16(1)(c) would become applicable only if the settlor preserved to himself the entire income arising from the settled properties; if only a portion had been reserved by the settlor it would not make the settlement revocable. According to the Tribunal only the amount of Rs. 2,400/- which had actually been received by the assessee under the terms of the trust deed could be included in his income.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Calcutta High Court in Income-tax Reference No. 102 of 1962 dated September 30, 1966 answered the question against the assessee and in favour of the Revenue.",
      "type": "procedural",
      "date": "1966-09-30",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "The trust created was a genuine one.",
      "type": "admitted",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether on the facts and in the circumstances of the case, the entire or any part of the income from the house properties concerned could be included in the total income of the assessee by virtue of the provisions of s. 16(1)(c) of the Income tax Act, 1922 read with the first proviso thereto?",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The assessee had irrevocably parted with the aforesaid two properties and the same had got vested in the trust. s. 16(1)(c) would become applicable only if the settlor preserved to himself the entire income arising from the settled properties; if only a portion had been reserved by the settlor it would not make the settlement revocable. Only the amount of Rs. 2,400/- which had actually been received by the assessee under the terms of the trust deed could be included in his income.",
      "supporting_facts": [
        "f3",
        "f4",
        "f5",
        "f8",
        "f10"
      ],
      "legal_basis": "s. 16(1)(c) Income tax Act 1922 and third proviso"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "In order to be revocable under the first proviso to s. 16(1)(c) it is sufficient if the settlement, disposition or transfer contains a provision for retransfer of a part of the income to the settlor, disposer or transferor. It is not necessary that there must be a provision for the retransfer of the entire income. The word 'income' includes any part of the income unless there is anything repugnant in the context. The third proviso to s. 16(1)(c) did not explain the first proviso but was a kind of rider or exception to it. The true meaning and scope of the first proviso was that the settlement was revocable in its entirety thus attracting the substantive clause of s. 16(1)(c).",
      "supporting_facts": [
        "f4",
        "f5",
        "f9"
      ],
      "legal_basis": "s. 16(1)(c) Income tax Act 1922 first proviso"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The scheme of s. 16(1)(c): first stage is revocable transfer of assets, income deemed settlor's. First proviso deems revocable if contains provision for retransfer of income/assets or right to reassume power. If deemed revocable, then third proviso considered: does not apply if not revocable for >6 years or lifetime and settlor derives no direct/indirect benefit.",
      "addresses_issue": "i1",
      "key_observation": "First proviso deems settlement revocable if part income retransferable, but third proviso excludes income to third persons from settlor's assessment if conditions met."
    },
    {
      "id": "cr2",
      "text": "The third proviso does not operate to exclude the income which the settlor receives as a beneficiary from liability to income tax; it merely excludes that part of the income given to another person if conditions fulfilled. If settlor reserved part as beneficiary, third proviso still applies to other parts.",
      "addresses_issue": "i1",
      "key_observation": "Provisos 1 and 2 explanatory; third proviso operates on deemed revocable settlements."
    },
    {
      "id": "cr3",
      "text": "Effect of third proviso: portion of income settled on third person assessed in their hands, not settlor's, if no power to revoke for >6 years or lifetime of donee. Thus settlement as whole not within mischief if revocability only to part income.",
      "addresses_issue": "i1",
      "key_observation": "Only income accruing/received by settlor includible."
    },
    {
      "id": "cr4",
      "text": "Significant change in Income tax Act 1961 s.63 expressly mentions 'whole or any part' indicating prior Act did not cover part differently.",
      "addresses_issue": "i1",
      "key_observation": "Under 1922 Act, part reservation does not make entire revocable for tax."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Since the trust fulfilled the conditions laid down in the third proviso only that part of the income which accrued or was received by the settlor could be assessed as his income. The income accruing to the other beneficiaries could not be included in the total income of the assessee.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Ramji Keshavji v. Commissioner of Income tax Bombay",
      "citation": "13 I.T.R. 105",
      "treatment": "followed",
      "relevance": "Considered scheme of s.16(1)(c) and provisos; approved by Supreme Court."
    },
    {
      "case_name": "C.I.T. Patna v. Rani Bhuvaneshwari Kuer",
      "citation": "1964 7 SCR 920",
      "treatment": "followed",
      "relevance": "Approved view on third proviso excluding income to others even if settlor beneficiary on part; fully covers present point."
    },
    {
      "case_name": "C.I.T. Calcutta v. Jitendranath Mallick",
      "citation": null,
      "treatment": "referred",
      "relevance": "Settlement as whole not within mischief of s.16(1)(c) if revocability relates only to part of income."
    }
  ],
  "statutes_cited": [
    {
      "name": "Income tax Act, 1922",
      "sections": [
        "s. 16(1)(c)",
        "first proviso to s.16(1)(c)",
        "second proviso to s.16(1)(c)",
        "third proviso to s.16(1)(c)"
      ],
      "relevance": "Determines if trust income includible in settlor's total income; third proviso limits to settlor's share if conditions met."
    },
    {
      "name": "Income tax Act, 1961",
      "sections": [
        "s. 63"
      ],
      "relevance": "Change in language expressly including 'whole or any part' indicates 1922 Act treated part differently."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "The appeal is consequently allowed and the judgment of the High Court is set aside. Only the part of income received by the settlor under the trust is includible in his total income; income to other beneficiaries is not.",
    "relief_granted": "High Court judgment set aside; only Rs. 2,400/- portion taxable to assessee.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"The third proviso to s. 16(1)(c) does not operate to exclude the income which the settlor receives as a beneficiary, from liability to income tax it merely excludes that part of the income which is under the deed of settlement given to another person from liability to tax in the hands of the settlor, if the conditions prescribed by the third proviso are fulfilled.\"",
      "speaker": "court",
      "significance": "Clarifies scope of third proviso even when settlor is partial beneficiary."
    },
    {
      "text": "\"Thus the settlement as a whole will not come within the mischief of s. 16(1)(c) if the revocability relates only to a part of the income.\"",
      "speaker": "court",
      "significance": "Core holding rejecting High Court's view of entire income taxable."
    }
  ],
  "_case_id": "1971_352",
  "_label": 1,
  "_text_length": 12221,
  "_extracted_at": "2026-02-10T20:16:22.730924"
}