{
  "metadata": {
    "case_name": "Appellant (Decree-Holder) v. Legal Heirs of Sardar Mujibul Rahman Khan (Judgment-Debtor)",
    "case_year": 1967,
    "court": "Supreme Court of India",
    "judges": [
      "Ray, J."
    ],
    "case_number": "Civil Appeal No. 1007 of 1967",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "On 4 October, 1939 the appellant obtained a decree under the U. P. Encumbered Estates Act, 1934 against Sardar Mujibul Rahman Khan for the sum of Rs. 1,31,040-1-0 with costs and future interest at 3 1/2 p.a. on the basis of a secured debt.",
      "type": "background",
      "date": "1939-10-04",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Sardar Mujibul Rahman Khan the judgment debtor died on 24 April, 1949.",
      "type": "background",
      "date": "1949-04-24",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Judgment debtor's sons were brought on record on 21 April, 1953.",
      "type": "procedural",
      "date": "1953-04-21",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Judgment debtor's sons applied for reduction of the decretal amount under section 4 of the U. P. Zamindars Debt Reduction Act, 1952 on 24/25 August, 1955.",
      "type": "procedural",
      "date": "1955-08-24",
      "source": "respondent"
    },
    {
      "id": "f5",
      "text": "Special Judge, Kheri rejected the application on 18 February, 1957 holding that unless and until the decree charged the mortgaged property no reduction of debt could be ordered under the U. P. Zamindars Debt Reduction Act, 1952 and that the decree was not one such.",
      "type": "procedural",
      "date": "1957-02-18",
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "Appeal against Special Judge's order heard on 27 November, 1962 by Full Bench of Allahabad High Court, upholding Special Judge and dismissing appeal treated as revision.",
      "type": "procedural",
      "date": "1962-11-27",
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "U. P. Zamindars Debt Reduction Amendment Act, XX of 1962 received assent of President on 27 November 1962, published in Gazette on 4 December 1962 and came into force on that date.",
      "type": "background",
      "date": "1962-11-27",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Judgment debtor filed application for review against High Court order dated 27 November 1962 on 20 February 1963.",
      "type": "procedural",
      "date": "1963-02-20",
      "source": "respondent"
    },
    {
      "id": "f9",
      "text": "Allahabad High Court by majority accepted review application, set aside Special Judge's order rejecting application under section 4 of 1952 Act and remanded case to Special Judge for disposal in accordance with 1952 Act as amended by Act 20 of 1962.",
      "type": "procedural",
      "date": "1963-04-30",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Appeal to Supreme Court by certificate from Allahabad High Court judgment dated 30 April 1963; leave granted on 21 February 1966.",
      "type": "procedural",
      "date": "1966-02-21",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether section 4 of the U. P. Zamindars Debt Reduction Act, 1952 could be invoked by the judgment debtor.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the High Court could accede to the application of the judgment debtor for review.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "When the High Court decided the matter, the High Court applied the law as it stood and a subsequent change of law could not be a ground for review.",
      "supporting_facts": [
        "f6",
        "f9"
      ],
      "legal_basis": "Order 47 Code of Civil Procedure; Rajah Kotagiri Venkata Subbamma Rao v. Rajah Vellanki Venkatrama Rao"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Application for review based on amendment to section 4 of 1952 Act deleting words 'charged under the decree'; counsel brought to notice of High Court that Act was going to be amended and awaited assent.",
      "supporting_facts": [
        "f7",
        "f8"
      ],
      "legal_basis": "U. P. Zamindars Debt Reduction Amendment Act, 1962"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Amendment Act 20 of 1962 deleted words 'charged under the decree' from section 4(2) and (3) of 1952 Act effective as from 25 May 1953; deeming provision makes amendment retrospective as if always in force.",
      "addresses_issue": "i1",
      "key_observation": "Decree relates to secured debt, mortgaged property consists of estate acquired under U. P. Zamindari Abolition Act 1950; tests satisfied for application under section 4."
    },
    {
      "id": "cr2",
      "text": "Review justified as error apparent on face of record: law applied by High Court on 27 November 1962 was not the applicable law due to retrospective deeming provision; not subsequent law but law always in force from 1953.",
      "addresses_issue": "i2",
      "key_observation": "Section 4 confers power notwithstanding Code of Civil Procedure; substance of application decisive, not form."
    },
    {
      "id": "cr3",
      "text": "Statutory fiction per State of Bombay v. Pandurang: full effect to deeming provision, carry to logical conclusion; words 'charged under the decree' deemed never there.",
      "addresses_issue": "i1",
      "key_observation": "Amendment to confer relief to mortgaged property within contemplation of Act."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Section 4 of 1952 Act applicable to decree as amended retrospectively; court shall proceed to reduce debt where mortgaged property consists exclusively/partly of estate acquired under U. P. Zamindari Abolition Act.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "High Court right to accept review and remand; error on face of record due to non-application of correct law.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Bannu Mal Ors. v. Bashir Ahmad Khan Ors.",
      "citation": "1962 A. L. J. R. 88",
      "treatment": "referred",
      "relevance": "High Court held court powerless to reduce debts after decree unless mortgaged property charged under decree; reason for amendment."
    },
    {
      "case_name": "State of Bombay v. Pandurang Vinayak Chaphalkar Ors.",
      "citation": "1953 S.C.R. 773",
      "treatment": "followed",
      "relevance": "Effect of deeming clause: full effect to statutory fiction, carry to logical conclusion."
    },
    {
      "case_name": "East End Dwellings Co. Ltd. v. Finsbury Borough Council",
      "citation": "1952 A.C. 109",
      "treatment": "referred",
      "relevance": "Quoted on statutory fiction: imagine consequences flowing from putative state of affairs."
    },
    {
      "case_name": "Rajah Kotagiri Venkata Subbamma Rao v. Rajah Vellanki Venkatrama Rao",
      "citation": "27 I. A. 197",
      "treatment": "distinguished",
      "relevance": "Review not authorised on ground of subsequent event; distinguished as not subsequent law but always existing."
    }
  ],
  "statutes_cited": [
    {
      "name": "U. P. Encumbered Estates Act, 1934",
      "sections": [],
      "relevance": "Basis of original decree obtained by appellant."
    },
    {
      "name": "U. P. Zamindars Debt Reduction Act, 1952",
      "sections": [
        "Section 4"
      ],
      "relevance": "Powers to reduce debts after passing of decree; applies to decrees relating to secured debts where mortgaged property consists of acquired estate."
    },
    {
      "name": "U. P. Zamindars Debt Reduction Amendment Act, 1962 (Act XX of 1962)",
      "sections": [
        "Section 2"
      ],
      "relevance": "Deleted 'charged under the decree' from section 4(2),(3) of 1952 Act; retrospective from 25 May 1953."
    },
    {
      "name": "U. P. Zamindari Abolition and Land Reforms Act, 1950",
      "sections": [],
      "relevance": "Acquisition of estate relevant for application of section 4 of 1952 Act."
    },
    {
      "name": "Code of Civil Procedure, 1908",
      "sections": [
        "Order 47"
      ],
      "relevance": "Principles of review; section 4 of 1952 Act notwithstanding CPC."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal dismissed upholding High Court's acceptance of review application and remand to Special Judge for disposal under section 4 of U. P. Zamindars Debt Reduction Act, 1952 as amended.",
    "relief_granted": "Remand to Special Judge for reduction of debt in accordance with amended Act.",
    "costs": "Each party will pay and bear their own costs."
  },
  "key_quotes": [
    {
      "text": "\"The Amendment Act therefore provided that the amendment took effect as if the Amendment Act had been in force on all material dates.\"",
      "speaker": "court",
      "significance": "Explains retrospective effect of deeming provision."
    },
    {
      "text": "\"When a statute enacts that something shall be deemed to have been done, which in fact and truth was not done, the court is entitled to ascertain for what purposes and between what persons the statutory fiction is to be resorted to and full effect must be given to the statutory fiction and it should be carried to its logical conclusion.\"",
      "speaker": "court",
      "significance": "Core reasoning on application of deeming clause from State of Bombay case."
    },
    {
      "text": "\"If you are bidden to treat an imaginary state of affairs as real, you must surely, unless prohibited from doing so, also imagine as real the consequences and incidents which, if the putative state of affairs had in fact existed, must inevitably have flowed from or accompanied it.\"",
      "speaker": "court",
      "significance": "Quote reinforcing full effect to statutory fiction."
    }
  ],
  "_case_id": "1971_193",
  "_label": 0,
  "_text_length": 13599,
  "_extracted_at": "2026-02-10T20:15:38.215429"
}