{
  "metadata": {
    "case_name": "State v. Major J. S. Prosad & Ors.",
    "case_year": 1970,
    "court": "Supreme Court of India",
    "judges": [
      "Ray, J."
    ],
    "case_number": "Criminal Appeals Nos. 158 to 160 of 1970",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Special Case No. 16 of 1964 pending before Special Judge, Gauhati: Major J. S. Prosad, N. Ananthapadamanabhiah and Motiur Rahman charged under section 120B IPC read with sections 5(2), 5(1)(c) and 5(1)(d) of Prevention of Corruption Act, 1947 and section 467/471 IPC.",
      "type": "procedural",
      "date": "1964",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Special Case No. 16A of 1964: Charges framed against S. Chatterjee and Motiur Rehman under section 120B IPC read with sections 5(2), 5(1)(c) and 5(1)(d) of Prevention of Corruption Act and sections 467 and 471 IPC.",
      "type": "procedural",
      "date": "1964",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Appellants filed three separate criminal revision petitions in High Court of Assam and Nagaland: Criminal Revision Applications Nos. 53, 62 and 71 of 1968.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "High Court judgment and order dated 31 March 1969 by Division Bench (C.J. and Goswami, J.) and third Judge Sen, J.",
      "type": "procedural",
      "date": "1969-03-31",
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "Investigation carried out by Inspector of Police under section 5(2) of Prevention of Corruption Act pursuant to order of Magistrate of the First Class at Delhi.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Offences investigated by Delhi Special Police Establishment; offences related to areas including Gauhati, Assam and possibly NEFA.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "High Court quashed proceedings before Special Judge.",
      "type": "procedural",
      "date": "1969-03-31",
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the Special Judge at Gauhati had jurisdiction to try offences investigated by Delhi Special Police Establishment as Delhi Special Police Establishment Act not extended to NEFA.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether consent of Government of Assam obtained under section 6 of Delhi Special Police Establishment Act for investigation.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether Magistrate at Delhi applied his mind to allow investigation by Inspector of Police under section 5(2) of Prevention of Corruption Act.",
      "framed_by": "petitioner"
    },
    {
      "id": "i4",
      "text": "Whether sanction under section 196A CrPC required before court took cognizance.",
      "framed_by": "petitioner"
    },
    {
      "id": "i5",
      "text": "Whether Magistrate at Delhi had jurisdiction to accord sanction to Inspector of Delhi Special Police Establishment to investigate in Assam.",
      "framed_by": "respondent"
    },
    {
      "id": "i6",
      "text": "Whether third Judge in High Court could consider new contention not raised before Division Bench under section 429 CrPC.",
      "framed_by": "respondent"
    },
    {
      "id": "i7",
      "text": "Whether Magistrate at Delhi competent to authorise investigation under section 5A of Prevention of Corruption Act, 1947 for offences in Assam.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Special Judge at Gauhati had no jurisdiction as Delhi Special Police Establishment Act not extended to NEFA.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": "Delhi Special Police Establishment Act"
    },
    {
      "id": "pa2",
      "text": "No consent of Government of Assam under section 6 of Delhi Special Police Establishment Act.",
      "supporting_facts": [
        "f5",
        "f6"
      ],
      "legal_basis": "Section 6, Delhi Special Police Establishment Act"
    },
    {
      "id": "pa3",
      "text": "Magistrate at Delhi did not apply mind and mechanically permitted investigation by Inspector under section 5(2) Prevention of Corruption Act.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": "Section 5(2), Prevention of Corruption Act"
    },
    {
      "id": "pa4",
      "text": "No sanction under section 196A CrPC before cognizance taken.",
      "supporting_facts": [
        "f1",
        "f2"
      ],
      "legal_basis": "Section 196A, Code of Criminal Procedure"
    },
    {
      "id": "pa5",
      "text": "Under section 5A Prevention of Corruption Act, any Magistrate of first class can order investigation by officer below specified rank; no territorial limit for first class Magistrate.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": "Section 5A, Prevention of Corruption Act; Section 5 CrPC"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Under section 429 CrPC, third Judge can deal with entire case, including new contention on jurisdiction of Delhi Magistrate.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": "Section 429, Code of Criminal Procedure"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "High Court Division Bench unanimously rejected contentions on jurisdiction of Special Judge and consent under DSPE Act.",
      "addresses_issue": "i1",
      "key_observation": "First two contentions rejected."
    },
    {
      "id": "cr2",
      "text": "Division Bench divided on whether Magistrate applied mind and whether s.196A sanction necessary; third Judge Sen J held Delhi Magistrate lacked jurisdiction and did not apply mind.",
      "addresses_issue": "i3",
      "key_observation": "Proceedings quashed."
    },
    {
      "id": "cr3",
      "text": "Third Judge empowered under s.429 CrPC to deal with whole case; follows Hethubha v. State of Gujarat.",
      "addresses_issue": "i6",
      "key_observation": "New contention properly raised."
    },
    {
      "id": "cr4",
      "text": "Section 5A Prevention of Corruption Act requires order from Presidency Magistrate (for presidency towns) or Magistrate first class (for their district); Magistrates have territorial jurisdiction under CrPC ss.6,10,11,12,13,32.",
      "addresses_issue": "i7",
      "key_observation": "Delhi Magistrate not competent for Assam cases."
    },
    {
      "id": "cr5",
      "text": "Magistrate orders investigation for cases he can inquire into or try; s.5A protects against frivolous prosecution within local jurisdiction.",
      "addresses_issue": "i7",
      "key_observation": "Order of Delhi Magistrate invalid."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Magistrate at Delhi not competent to authorise investigation of cases in State of Assam under section 5A Prevention of Corruption Act.",
      "resolves_issue": "i7",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "High Court rightly quashed proceedings as investigation invalid.",
      "resolves_issue": "i5",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Hethubha Ors. v. State of Gujarat",
      "citation": "Cr. A. No. 100 of 1967 dt. 13-3-1970 (unreported)",
      "treatment": "followed",
      "relevance": "Third Judge under s.429 CrPC can deal with whole case."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "120B",
        "467",
        "471",
        "161",
        "165",
        "165A"
      ],
      "relevance": "Charges framed under these sections."
    },
    {
      "name": "Prevention of Corruption Act, 1947",
      "sections": [
        "5(2)",
        "5(1)(c)",
        "5(1)(d)",
        "5A"
      ],
      "relevance": "Regulates investigation by police below certain ranks; requires Magistrate order; key to competency issue."
    },
    {
      "name": "Code of Criminal Procedure, 1898",
      "sections": [
        "5",
        "6",
        "10",
        "11",
        "12",
        "13",
        "18",
        "32",
        "196A",
        "429"
      ],
      "relevance": "Territorial jurisdiction of Magistrates; sanction for cognizance; procedure for difference of opinion in High Court."
    },
    {
      "name": "Delhi Special Police Establishment Act",
      "sections": [
        "6"
      ],
      "relevance": "Consent required for investigation outside Union territories or railway areas."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court dismissed the appeals by certificate against High Court order dated 31 March 1969 quashing proceedings in Special Cases Nos. 16 and 16A of 1964 before Special Judge Gauhati, holding that the Magistrate at Delhi lacked territorial jurisdiction to authorise investigation by Inspector of Delhi Special Police Establishment for offences in Assam, rendering the investigation invalid.",
    "relief_granted": "None; upheld quashing of proceedings.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "A Magistrate does not exercise jurisdiction throughout the length and breadth of India for purposes of Code of Criminal Procedure or of Prevention of Corruption Act.",
      "speaker": "court",
      "significance": "Core reasoning on territorial jurisdiction of Magistrates under s.5A PC Act."
    },
    {
      "text": "The order of investigation made by the Magistrate at Delhi for investigation of cases in the State of Assam was not a valid and competent order within the powers of the Magistrate at Delhi.",
      "speaker": "court",
      "significance": "Key holding invalidating the investigation."
    }
  ],
  "_case_id": "1971_199",
  "_label": 0,
  "_text_length": 11866,
  "_extracted_at": "2026-02-10T20:15:36.114210"
}