{
  "metadata": {
    "case_name": "State of Madhya Pradesh v. Respondent (Mineral Concession Holder)",
    "case_year": 1968,
    "court": "Supreme Court of India",
    "judges": [
      "Grover, J."
    ],
    "case_number": "Civil Appeal No. 2272 of 1968",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Respondent held mineral concessions for extracting manganese ore in mining areas in districts of Balaghat, Chhindwara, Bhandara and Nagpur in erstwhile State of Madhya Pradesh.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Material period: October 1, 1953 to December 26, 1958, split into (1) October 1, 1953 to October 31, 1956 (Nagpur and Bhandara part of Madhya Pradesh) and (2) November 1, 1956 to December 26, 1958 (Nagpur and Bhandara included in new State of Maharashtra).",
      "type": "material",
      "date": "1953-10-01 to 1958-12-26",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Under S. 4 of Central Provinces Berar Sales Tax Act 1947, dealer liable to pay tax on sales if gross turnover exceeded limit in S. 4(5); required to register under S. 8.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Appellant alleged respondent effected sales of manganese ore from mines during periods without registering as dealer despite turnover exceeding limit.",
      "type": "disputed",
      "date": "1953-10-01 to 1958-12-26",
      "source": "appellant"
    },
    {
      "id": "f5",
      "text": "Notices issued by Sales Tax Officer, Chhindwara, calling upon respondent to register and show cause why assessed under S. 11(5) of Act 1947.",
      "type": "procedural",
      "date": null,
      "source": "appellant"
    },
    {
      "id": "f6",
      "text": "Towards end of 1958, respondent applied for registration to Sales Tax Officer, Chhindwara Circle (jurisdiction over Balaghat and Chhindwara); registration certificate granted December 27, 1958.",
      "type": "procedural",
      "date": "1958-12-27",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Sales Tax Officer issued notice under ss. 17, 18, 19 of Madhya Pradesh General Sales Tax Act 1958; assessed respondent for October 1, 1953 to December 26, 1958 at Rs. 31,580.42 tax plus Rs. 5,000 penalty.",
      "type": "procedural",
      "date": "1960-04-23",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Respondent appealed to Appellate Assistant Commissioner of Sales Tax; appeal not admitted due to non-deposit of tax and penalty under s. 38(3) of Act 1958 or s. 22 of Act 1947.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Respondent appealed to Board of Revenue without depositing tax; appeal not admitted.",
      "type": "procedural",
      "date": "1961-01-23",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Respondent filed writ petition under Art. 226 on March 28, 1966 challenging assessment order dated April 23, 1960 and appellate authorities' orders.",
      "type": "procedural",
      "date": "1966-03-28",
      "source": "respondent"
    },
    {
      "id": "f11",
      "text": "Madhya Pradesh High Court judgment dated September 12, 1967 quashed assessment order holding Sales Tax Officer Balaghat lacked jurisdiction over sales from Nagpur and Bhandara districts post-reorganisation under s. 78 States Reorganisation Act 1956; composite order quashed entirely.",
      "type": "procedural",
      "date": "1967-09-12",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "High Court held notices issued by sales tax authorities were within limitation.",
      "type": "admitted",
      "date": null,
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether under s. 78 States Reorganisation Act 1956, right to recover arrears of sales tax belongs to successor State where property/mines situated or where place of assessment included; specifically, whether 'arrears' includes taxes due but unassessed/quantified.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether Sales Tax Officer Balaghat/Chhindwara had jurisdiction to assess sales from Nagpur/Bhandara districts post-November 1, 1956.",
      "framed_by": "respondent"
    },
    {
      "id": "i3",
      "text": "Whether sales for export outside India includible in taxable turnover.",
      "framed_by": "respondent"
    },
    {
      "id": "i4",
      "text": "Whether Sales Tax Officer had power to assess under s. 18(6) Act 1958 for period prior to April 1, 1959 when Act 1947 applied.",
      "framed_by": "respondent"
    },
    {
      "id": "i5",
      "text": "Whether assessments barred by time.",
      "framed_by": "respondent"
    },
    {
      "id": "i6",
      "text": "Whether appellate authorities erred in not admitting appeals due to non-deposit of tax.",
      "framed_by": "respondent"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Expression 'right to recover arrears of any tax or duty' in s. 78 States Reorganisation Act covers not only assessed tax but also taxes which became due but remained to be assessed.",
      "supporting_facts": [
        "f2",
        "f11"
      ],
      "legal_basis": "Section 78 States Reorganisation Act 1956"
    },
    {
      "id": "pa2",
      "text": "Place of assessment is Katangjhiri in Balaghat district, included in Madhya Pradesh successor State.",
      "supporting_facts": [
        "f6",
        "f7"
      ],
      "legal_basis": "Section 78 States Reorganisation Act 1956"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Sales Tax Officer Balaghat/Chhindwara had no jurisdiction to assess sales tax on sales from Nagpur/Bhandara districts post-reorganisation as they formed part of Maharashtra; no separate turnover determined, so entire composite assessment order void.",
      "supporting_facts": [
        "f2",
        "f11"
      ],
      "legal_basis": "Section 78 States Reorganisation Act 1956"
    },
    {
      "id": "ra2",
      "text": "'Arrears' in s. 78 refers only to tax quantified after assessment; before assessment completed and final amount determined, no arrears exist.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "Section 78 States Reorganisation Act 1956"
    },
    {
      "id": "ra3",
      "text": "Registration certificate granted in 1958 showed place of business at Katangjhiri but had no relation to Nagpur/Bhandara districts no longer in Madhya Pradesh.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": null
    },
    {
      "id": "ra4",
      "text": "Sales Tax Officer had no jurisdiction/power to include export sales in taxable turnover; no power under s. 18(6) Act 1958 for pre-April 1, 1959 period; assessments time-barred.",
      "supporting_facts": [
        "f4",
        "f7"
      ],
      "legal_basis": "Act 1958 s.18(6); Act 1947"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "High Court's narrow meaning of 'arrears' in s. 78 incorrect; arrears means that which is behind in payment or remains unpaid though due, as per dictionaries; taxes become due on sales/purchases, liability independent of assessment.",
      "addresses_issue": "i1",
      "key_observation": "'Arrears' includes dues or what has become due by way of tax, does not depend on assessment or quantification."
    },
    {
      "id": "cr2",
      "text": "Part VII States Reorganisation Act apportions assets/liabilities; ss. 78 and 83 confer right/liability on successor State where place of assessment included; not covered by residuary s. 91.",
      "addresses_issue": "i1",
      "key_observation": "Place of assessment determines successor State entitlement."
    },
    {
      "id": "cr3",
      "text": "High Court erred in holding no jurisdiction for Nagpur/Bhandara sales; right to recover belongs to Madhya Pradesh as place of assessment in its territory.",
      "addresses_issue": "i2",
      "key_observation": "Liability arose on sales pre- and post-reorganisation, arrears vest with assessment place State."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "'Arrears of any tax or duty' in s. 78 States Reorganisation Act 1956 includes taxes due but unassessed; right to recover vests with successor State where place of assessment situated.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Sales Tax Officer Balaghat had jurisdiction to assess sales from all districts as place of assessment in Madhya Pradesh.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Kedarnath Jute Mfg. Co. Ltd. v. Commissioner of Income tax, Central Calcutta",
      "citation": null,
      "treatment": "followed",
      "relevance": "Tax liability arises independent of assessment proceedings."
    }
  ],
  "statutes_cited": [
    {
      "name": "Central Provinces Berar Sales Tax Act 1947",
      "sections": [
        "S. 4",
        "S. 4(5)",
        "S. 8",
        "S. 11(5)",
        "S. 22"
      ],
      "relevance": "Liability to register and pay tax on sales exceeding turnover limit; assessment for non-registration."
    },
    {
      "name": "Madhya Pradesh General Sales Tax Act 1958",
      "sections": [
        "S. 17",
        "S. 18",
        "S. 18(6)",
        "S. 19",
        "S. 38(3)"
      ],
      "relevance": "Assessment notices, power to assess prior periods, appeal deposit requirement."
    },
    {
      "name": "States Reorganisation Act 1956",
      "sections": [
        "S. 78",
        "S. 76",
        "S. 77",
        "S. 83",
        "S. 91",
        "Part VII"
      ],
      "relevance": "Apportionment of arrears of taxes to successor State where place of assessment included."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 226"
      ],
      "relevance": "Writ petition challenging assessment orders."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Supreme Court allowed the appeal by certificate from Madhya Pradesh High Court, reversing the High Court's quashing of the assessment order on interpretation of s. 78 States Reorganisation Act; held arrears include unassessed dues vesting with State of place of assessment.",
    "relief_granted": "Assessment order upheld; High Court judgment set aside.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "'Arrears should be given their proper meaning as understood in the ordinary sense of that word... that which is behind in payment or which remains unpaid though due.'",
      "speaker": "court",
      "significance": "Defines 'arrears' broadly to include unassessed tax dues."
    },
    {
      "text": "The liability for payment of tax is independent of the assessment. See Kedarnath Jute Mfg. Co. Ltd. v. Commissioner of Income tax.",
      "speaker": "court",
      "significance": "Establishes tax liability arises on taxable event, not quantification."
    },
    {
      "text": "Before the assessment proceedings are completed and the final amount due is determined it cannot be said that any particular amount of tax is due against the assessee.",
      "speaker": "lower_court",
      "significance": "High Court's view on arrears, rejected by Supreme Court."
    }
  ],
  "_case_id": "1971_597",
  "_label": 1,
  "_text_length": 11550,
  "_extracted_at": "2026-02-10T20:19:28.522192"
}