{
  "metadata": {
    "case_name": "Union of India v. Capt. S. K. Rao",
    "case_year": 1967,
    "court": "Supreme Court of India",
    "judges": [
      "Sikri, C.J.",
      "Mr. Justice Roy"
    ],
    "case_number": "Civil Appeal No. 1653 of 1967",
    "date_of_judgment": "1971-11-19"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Rao was a commissioned officer in the Indian Army attached to the Army Ordnance Corps Training Centre, Secunderabad.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On April 4, 1958, Rao allegedly committed acts of gross misconduct: Knowing Kumari Prakash as the daughter of a brother Officer, Rao assisted her in going away from her parents protection and planning to run away with a sepoy; by threatening to cause harm to Kumari Prakash's parents, intimidated her to visit his house where he took her in his scooter to the unit lines of 51 1 1 Gurkha Rifles where he arranged her meeting with a sepoy of the unit; acquiesced in the girl being met by the sepoy later at a tea shop nearby where she received a present of a sari and blouse from the sepoy in his presence; thus actively abetted in the attempt of brother officer's daughter to elope with a sepoy; then took Kumari Prakash to a hotel Saidya Lodge in Hyderabad and got a room to themselves by impersonating and giving a false identity as Mr. Mrs. Prakash.",
      "type": "disputed",
      "date": "1958-04-04",
      "source": "prosecution"
    },
    {
      "id": "f3",
      "text": "An inquiry into the matter was made by Court of Inquiry.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The Chief of the Army Staff, after going through the proceedings of the Court of Inquiry, considered that the conduct of Capt. Rao was most unbecoming of an officer. As he was of opinion that trial of the officer by a General Court Martial was inexpedient, he ordered administrative action to be taken under r. 14 of the Army Rules, 1954.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "By memorandum dated September 4, 1958, Rao was called upon to submit his explanation by way of defence regarding the allegations against him.",
      "type": "procedural",
      "date": "1958-09-04",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The explanation of Rao was placed before the Central Government. The Central Government found it to be unsatisfactory.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "On April 9, 1959, the Central Government directed removal from service of Capt. S. K. Rao under r. 14 of the Army Rules, 1954.",
      "type": "material",
      "date": "1959-04-09",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Capt. Rao filed a petition under Art. 226 of the Constitution for quashing the order of removal from service on the ground, inter alia, that r. 14 of the Army Rules, 1954, was ultra vires the Army Act, 1950.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f9",
      "text": "In the petition Rao gave a somewhat different version: he did not assist Kumari Prakash to go away from her parents house.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f10",
      "text": "Delhi High Court judgment and order dated February 23, 1967 in C.W. No. 403-D of 1959.",
      "type": "procedural",
      "date": "1967-02-23",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "This is an appeal by the Union of India by way of special leave.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "At the hearing of the petition the only point which was urged was the validity of r. 14 of the Army Rules, 1954.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether r. 14 of the Army Rules, 1954 is ultra vires the Army Act, 1950.",
      "framed_by": "respondent"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Rule 14 is intra vires as framed under s. 191 of Army Act; s.19 allows Central Government to dismiss or remove subject to Act and rules; s.191(2)(a) specifically provides for rules on removal; s.19 and s.45 are mutually exclusive; court-martial not necessary for removal under s.19 read with r.14.",
      "supporting_facts": [
        "f3",
        "f4",
        "f5",
        "f6",
        "f7"
      ],
      "legal_basis": "Army Act ss.18,19,45,191; Army Rules r.14"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "r. 14 of the Army Rules, 1954, was ultra vires the Army Act, 1950, as the Army Act contained specific provisions for punishment for unbecoming conduct, viz. s. 45; to give power to the Central Government to remove an officer without being tried and convicted by court-martial was in derogation of s. 45.",
      "supporting_facts": [
        "f2",
        "f9"
      ],
      "legal_basis": "Army Act s.45"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Section 19 itself suggests that there should be rules, and subject to the provisions of the Act and such rules, the Central Government may dismiss or remove from the service any person subject to the Army Act. Section 191(2)(a) specifically gives power to make a rule providing for the removal from the service of persons subject to the Act. Rule 14 is such a rule and therefore not ultra vires.",
      "addresses_issue": "i1",
      "key_observation": "The power under s. 19 is an independent power. Although s. 19 uses the words 'subject to the provisions of this Act', it speaks of removal of a person from the service. Section 45 provides that on conviction by court-martial an officer is liable to be cashiered. For removal under s.19 read with r.14, a court-martial is not necessary. The two sections 19 and 45 are mutually exclusive."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "r. 14 of the Army Rules, 1954, is not ultra vires the Army Act.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Army Act, 1950",
      "sections": [
        "s.18",
        "s.19",
        "ss.34 to 70",
        "s.45",
        "s.191"
      ],
      "relevance": "s.18: persons hold office during pleasure of President; s.19: Central Govt may dismiss/remove subject to Act/rules; s.45: unbecoming conduct punishable on court-martial conviction; s.191: power to make rules including for removal."
    },
    {
      "name": "Army Rules, 1954",
      "sections": [
        "r.14"
      ],
      "relevance": "Provides for administrative removal of officer for misconduct without court-martial if retention undesirable, after giving explanation."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art.226"
      ],
      "relevance": "Basis for writ petition filed by Rao."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed holding r.14 intra vires; case will not go back to High Court for disposal on merits on other questions raised by respondent.",
    "relief_granted": "Order of Delhi High Court quashed on the point of validity of r.14",
    "costs": "without any order as to costs"
  },
  "key_quotes": [
    {
      "text": "The two sections 19 and 45 of the Act are, therefore, mutually exclusive.",
      "speaker": "court",
      "significance": "Crux of reasoning why r.14 is valid and independent of court-martial requirement."
    },
    {
      "text": "Rule 14 is such a rule it is, therefore, not ultra vires.",
      "speaker": "court",
      "significance": "Direct holding on the main issue."
    }
  ],
  "_case_id": "1971_478",
  "_label": 1,
  "_text_length": 8651,
  "_extracted_at": "2026-02-10T20:16:51.707670"
}