{
  "metadata": {
    "case_name": "Appellant v. Basdeo Mahto & Ors.",
    "case_year": 1968,
    "court": "Supreme Court of India",
    "judges": [
      "Ray, J."
    ],
    "case_number": "Criminal Appeal No. 53 of 1968",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Land in village Hatma, Ranchi, Bihar recorded in names of Karma Ahir and Faizu Ahir.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Appellant is grandson of Karma Ahir.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Respondent Basdeo Mahto and brother Sahdeo Mahto claimed land as sons of Faizu Ahir by his second wife.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f4",
      "text": "Dispute led to proceeding under section 144 CrPC between respondents and appellant.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "In showing cause, appellant described Basdeo Mahto and Sahdeo Mahto as illegitimate sons of Faizu Ahir born of concubine.",
      "type": "material",
      "date": "November 1965",
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "Complainant's brother-in-law present in court of Sub-Divisional Officer when appellant's lawyer submitted that respondent and brother were illegitimate sons born of concubine.",
      "type": "material",
      "date": "November 1965",
      "source": "prosecution"
    },
    {
      "id": "f7",
      "text": "Complainant obtained certified copy of written statement filed by appellant and filed complaint.",
      "type": "procedural",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f8",
      "text": "Faizu Ahir married Mst. Sauni, a widow, in Sagai form more than 40 years ago according to custom prevalent among Yadav community; she lived with him as wedded wife and was treated as such by community; respondent and brother born long after marriage and legitimate sons.",
      "type": "admitted",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f9",
      "text": "Appellant pleaded not guilty; defence that statements in written statement were true and had to disclose as respondents dishonestly claimed property to which they had no right.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f10",
      "text": "Findings of fact: Faizu Ahir married Sauni in Sagai form; respondent was legitimate son of Faizu Ahir.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Appellant convicted under section 500 IPC by Judicial Magistrate First Class, Ranchi; sentenced to fine of Rs. 500, in default simple imprisonment for three months.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Appeal upheld by First Additional Judicial Commissioner, Ranchi on 31 July 1967.",
      "type": "procedural",
      "date": "1967-07-31",
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Appellant relied on certified copy of deposition of respondent in case No. GR. 775/65 where respondent said he did not know if Faizu Ahir kept concubine and if he was son of concubine.",
      "type": "material",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f14",
      "text": "Patna High Court dismissed criminal revision on 30 October 1967.",
      "type": "procedural",
      "date": "1967-10-30",
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the imputation made by appellant falls under Ninth Exception to section 499 IPC, i.e., made in good faith for protection of interests of person making it or public good.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Statements made in written statement were true; had to disclose fact as respondents dishonestly claimed property to which they had no right.",
      "supporting_facts": [
        "f5",
        "f9"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Respondent did not categorically deny in deposition in GR 775/65 that Faizu Ahir kept concubine and he was son of concubine; therefore appellant did not act out of malice.",
      "supporting_facts": [
        "f13"
      ],
      "legal_basis": "Ninth Exception to section 499 IPC"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Faizu Ahir married Sauni in Sagai form per Yadav custom; lived as wife; sons legitimate; statements false and defamatory made to humiliate.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": "Section 500 IPC"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "No evidence that appellant made any enquiry before imputation or acted with due care and attention; mere belief not enough; must show rational basis, enquiry, care, and objective satisfaction.",
      "addresses_issue": "i1",
      "key_observation": "Appellant failed to establish good faith under Ninth Exception."
    },
    {
      "id": "cr2",
      "text": "Appellant related to respondent; no enquiry made; respondent's deposition in GR 775/65 sufficient denial as he stated Puran and Jitu were step-brothers.",
      "addresses_issue": "i1",
      "key_observation": "Answer 'did not know' does not mean acceptance."
    },
    {
      "id": "cr3",
      "text": "Imputation not for protection of interest; s.144 CrPC proceeding about possession, not title; cannot hurl defamatory invectives to resist possession and claim protection of interest.",
      "addresses_issue": "i1",
      "key_observation": "Protection requires communication on subject where maker and recipient have corresponding interest or duty."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Ingredients of Ninth Exception to s.499 IPC not satisfied: no good faith due to lack of enquiry, care, attention; not for protection of interest.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Harbhajan Singh v. State of Punjab",
      "citation": "1965 3 S.C.R. 235",
      "treatment": "followed",
      "relevance": "Good faith requires due care and attention; simple belief not enough; must show rational basis, enquiry."
    },
    {
      "case_name": "Chaman Lal v. State of Punjab",
      "citation": "A.I.R. 1970 S.C. 1372",
      "treatment": "followed",
      "relevance": "Tests for good faith: circumstances, malice, enquiry, care, caution, preponderance of probability."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "Section 499 (Ninth Exception)",
        "Section 500"
      ],
      "relevance": "Defines defamation and exception for good faith imputation for protection of interest or public good; punishment for defamation."
    },
    {
      "name": "Criminal Procedure Code",
      "sections": [
        "Section 144"
      ],
      "relevance": "Proceeding regarding possession of land; not justifying defamatory statements."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court dismissed the appeal by special leave, upheld conviction under s.500 IPC and sentence; affirmed High Court dismissal of revision and Judicial Commissioner's order upholding Magistrate's judgment.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "Good faith is a question of fact. So is protection of the interest of the person making it. Public good is also a question of fact.",
      "speaker": "court",
      "significance": "Defines scope of Ninth Exception to s.499 IPC."
    },
    {
      "text": "The appellant must show that the belief in his impugned statement had a rational basis and was not just a blind simple belief.",
      "speaker": "court",
      "significance": "Explains requirement of due care for good faith, citing Harbhajan Singh."
    },
    {
      "id": "kq3",
      "text": "Just because a proceeding is pending it will not be open to a person to impute the statements of the nature in the present case.",
      "speaker": "court",
      "significance": "Rejects protection of interest in s.144 proceeding."
    }
  ],
  "_case_id": "1971_190",
  "_label": 0,
  "_text_length": 9864,
  "_extracted_at": "2026-02-10T20:14:55.287415"
}