{
  "metadata": {
    "case_name": "Commissioner of Income-tax, West Bengal v. Coal Shipments P Ltd. (now Heilgers Investment Ltd.)",
    "case_year": 1971,
    "court": "Supreme Court of India",
    "judges": [
      "Khanna, J."
    ],
    "case_number": "Civil Appeals Nos. 1494 to 1498 of 1971",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The respondent was one of the companies which exported coal from India to Burma before the Second World War. Amongst the other exporters were Messrs. Karamchand Thaper Bros. Ltd., Messrs Machell Barry Ltd., Messrs. Andrew Yule Co. Ltd. and Messrs. R. V. Low Co. Ltd.",
      "type": "background",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f2",
      "text": "The shipment of coal to Burma Railways before the war was the subject of open tender.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "After the cessation of hostilities in 1946, it became possible to resume the export of coal to Burma.",
      "type": "background",
      "date": "1946",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "In order to overcome the difficulties in the conduct of the trade following the war, the members of the coal trade in Bengal formed an association styled Coal Exporters and Charters Association. The respondent company as well as Ms. H. V. Low Co. Ltd. were two of the major members of the said association.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "When Ms. H. V. Low Co. learnt of the resumption of coal export to Burma by the respondent in 1946, they also expressed intention to export coal to Burma. Thereupon the two companies came to an understanding and arrived at a mutual arrangement or agreement on the following lines - Ms. H. V. Low Co. Ltd. would not export coal to Burma during the subsistence of the agreement. Ms. H. V. Low Co. Ltd. would assist the respondent in procuring coal for shipment to Burma. The respondent would carry on the coal shipping business and pay Ms. H. V. Low Co. Ltd. Rs. 1/- per ton (subsequently raised to Rs. 1-5- per ton) of coal shipped to Burma.",
      "type": "material",
      "date": "1946",
      "source": "respondent"
    },
    {
      "id": "f6",
      "text": "According to the respondent, the last shipment of coal under the above arrangement was made in June, 1954 after which the arrangement came to an end automatically and the Government of Burma made some other arrangement for its coal requirement.",
      "type": "material",
      "date": "1954-06",
      "source": "respondent"
    },
    {
      "id": "f7",
      "text": "The assessee respondent claimed to have made the following payments to Ms. H. V. Low Co. Ltd. or their nominees in pursuance of the aforesaid agreement during the period of five accounting years from 1st April, 1950 to March 31,1955: 1951-52 Rs. 91,149; 1952-53 Rs. 1,77,898; 1953-54 Rs. 3,03,631; 1954-55 Rs. 2,32,355; 1955-56 Rs. 79,917.",
      "type": "material",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "The amounts mentioned above were taxed in the hands of Ms. H. V. Low Co. Ltd.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "The respondent claimed the payment of the above amounts as admissible business expenditure for the assessment years 1951-52 to 1955-56.",
      "type": "material",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f10",
      "text": "The Income-tax Officer held that the expenditures claimed could not be allowed, as there was no written agreement in proof of the alleged arrangement and it was not possible to say that the payments were made for the purpose of the assessee's business. The Income-tax Officer further held that even assuming that the payments were made to keep off Ms. H. V. Low Co. Ltd. from the Burma trade, they were payments to secure a monopoly and were not, therefore, allowable as revenue expenditure.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "The Appellate Assistant Commissioner on appeal upheld the order of the Income-tax Officer.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "When the matter came up in second appeal before the Income-tax Appellate Tribunal, the Tribunal found that there was some discrepancy in the facts stated on behalf of the assessee and the Revenue. The Tribunal thereupon required the respondent company to swear an affidavit in support of the facts relied upon by it. In pursuance thereof, Sir Walter Michelmore, Director of Managing Agents of the respondent company filed an affidavit. Sir Walter was also examined orally before the Tribunal. The case was thereupon remanded to the Income-tax Officer to verify the facts as stated in the affidavit of Sir Walter and report back to the Tribunal. The Income-tax Officer after making further investigation submitted his report.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "In deciding the appeal, the Tribunal formulated two points: Were the payments made for the purpose of the assessee's trade in terms of the alleged agreement? If the answer to the above question is in the affirmative, did the assessee acquire a monopoly by such payment? Both the questions were answered in favour of the respondent by the Tribunal.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "The Tribunal held that the payments were made in pursuance of the alleged agreement in the interest of the respondent's trade. The version of the respondent about its agreement with Ms. H. V. Low Co. Ltd. was accepted. According to the agreement, Ms. H. V. Low Co. Ltd. agreed to assist the respondent in procuring coal for export to Burma whenever asked to do and further agreed not to export coal to Burma during the subsistence of the arrangement. The agreement was found to have been acted upon and it was held that Ms. H. V. Low Co. Ltd. supplied varying quantities of coal to the respondent for shipment to Burma.",
      "type": "admitted",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f15",
      "text": "The Tribunal further held that the respondent company did not acquire any monopoly rights to carry on Burma trade and the impugned payments were made to carry on the trade in a more facile and profitable manner. The Tribunal found that the arrangement arrived at verbally between the respondent and Ms. H. V. Low Co. Ltd. was a temporary measure liable to be terminated at will and the respondent company did not derive any advantage of an enduring character by such payments. The expenditures in question were, in the opinion of the Tribunal, attributable to revenue and not to capital. As such, they were held to be permissible expenditures under section 10(2)(xv) of the Act.",
      "type": "admitted",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f16",
      "text": "On application filed by the Revenue, the following question was referred to the High Court: Whether on the facts and in the circumstances of the case, the payments made by the assessee to Ms. H. V. Low Co. Ltd. or their nominees were of a capital nature and as such not allowable under section 10(2)(xv) of the Income-tax Act, 1922?",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f17",
      "text": "It was not disputed before the High Court that there was an agreement between the respondent and Ms. H. V. Low Co. Ltd. on terms stated by the respondent and that the payments in question were made under that agreement.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f18",
      "text": "The High Court held that the arrangement entered into by the respondent with Ms. H. V. Low Co. Ltd. was not such as was likely to have an enduring beneficial effect. In the opinion of the High Court, there was no certainty of duration and the arrangement could be terminated or revoked at any time. The consideration of the arrangement, it was observed, was not paid once for all but was related to uncertain shipments to be made. The arrangement, it was further held, did not create any monopoly or bring about any capital advantage to the assessee. The respondent was held entitled to claim the deduction of the expenditures under section 10(2)(xv) of the Act. In the result, the question referred to the Court was answered in the negative and in favour of the assessee.",
      "type": "procedural",
      "date": "1967-11-15",
      "source": "lower_court"
    },
    {
      "id": "f19",
      "text": "Appeals by special leave filed by the Commissioner of Income-tax, West Bengal against the judgment of Calcutta High Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f20",
      "text": "During the pendency of the appeals, the name of the respondent was changed to Heilgers Investment Ltd.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f21",
      "text": "The matter relates to the assessment years 1951-52, 1952-53, 1953-54, 1954-55 and 1955-56, the corresponding accounting years for which ended on 31-3-1951, 31-3-1952, 31-3-1953, 31-3-1954 and 31-3-1955 respectively.",
      "type": "background",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether on the facts and in the circumstances of the case, the payments made by the assessee to Ms. H. V. Low Co. Ltd. or their nominees were of a capital nature and as such not allowable under section 10(2)(xv) of the Income-tax Act, 1922?",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Were the payments made for the purpose of the assessee's trade in terms of the alleged agreement?",
      "framed_by": "lower_court"
    },
    {
      "id": "i3",
      "text": "Did the assessee acquire a monopoly by such payment?",
      "framed_by": "lower_court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The Income-tax Officer held that the expenditures claimed could not be allowed, as there was no written agreement in proof of the alleged arrangement and it was not possible to say that the payments were made for the purpose of the assessee's business. Even assuming that the payments were made to keep off Ms. H. V. Low Co. Ltd. from the Burma trade, they were payments to secure a monopoly and were not allowable as revenue expenditure.",
      "supporting_facts": [
        "f9",
        "f10"
      ],
      "legal_basis": "section 10(2)(xv) of the Indian Income-tax Act, 1922"
    },
    {
      "id": "pa2",
      "text": "Mr. Desai on behalf of the appellant contends that as the payment was made for warding off competition by rival coal exporter, that payment should be held to be a capital expenditure. The fact that there was no certainty of the duration of the arrangement between the respondent and Ms. H. V. Low Co. and the same could be terminated at any time, according to the learned counsel, is wholly immaterial.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Mr. Palkhiwala argues that in order to constitute capital expenditure, the object of the expenditure should be to secure an advantage of enduring nature. When there is no certainty of the duration of the arrangement and the same can be revoked at any time, the advantage cannot be said to be of an enduring character and the expenditure cannot be held to be of a capital nature. Further, as the payment was related to the quantum of coal shipped to Burma in the course of trading activity and was not connected with the capital value of the assets, the payment should be considered to be revenue expenditure.",
      "supporting_facts": [
        "f5",
        "f6",
        "f7"
      ],
      "legal_basis": "section 10(2)(xv) of the Indian Income-tax Act, 1922"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The Tribunal has found that the amounts in question were paid by the respondent to Ms. H. V. Low Co. Ltd. in pursuance of the agreement according to which Ms. H. V. Low Co. Ltd. were to assist the respondent in procuring coal for shipment to Burma and were themselves not to export coal to Burma during the subsistence of the agreement. The above findings of fact are binding. The payments were because of the assistance rendered and for abstaining from exporting. Payment for assistance is revenue. Controversy on whether payment for abstaining is capital or revenue.",
      "addresses_issue": "i1",
      "key_observation": "Findings of fact binding on appellant."
    },
    {
      "id": "cr2",
      "text": "Judicial decisions have laid down broad principles to determine capital vs revenue: once and for all vs recurring; enduring benefit; fixed vs circulating capital. Each case depends on its facts.",
      "addresses_issue": "i1",
      "key_observation": "No test is exhaustive; avoid matching colours."
    },
    {
      "id": "cr3",
      "text": "In Atherton, expenditure made not only once and for all, but with a view to bringing into existence an asset or advantage for enduring benefit is capital.",
      "addresses_issue": "i1",
      "key_observation": "Enduring benefit test."
    },
    {
      "id": "cr4",
      "text": "Arrangement was not for fixed term but could be terminated at any time. Enduring benefit should not be so transitory that it can be terminated at volition of parties.",
      "addresses_issue": "i1",
      "key_observation": "No enduring benefit as terminable at will."
    },
    {
      "id": "cr5",
      "text": "Payments related to actual shipment of coal in course of trading activities, no relation to capital value of assets, not tied to fixed sum.",
      "addresses_issue": "i1",
      "key_observation": "Revenue as linked to trading quantum."
    },
    {
      "id": "cr6",
      "text": "Payment to ward off competition is capital if for length of time, but not if no certainty of duration.",
      "addresses_issue": "i1",
      "key_observation": "Duration matters."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The payments made by the assessee to Ms. H. V. Low Co. Ltd. were revenue expenditure allowable under section 10(2)(xv) of the Income-tax Act, 1922.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Abdul Kayoom v. Commissioner of Income-tax",
      "citation": "44 I.T.R. 68",
      "treatment": "followed",
      "relevance": "No test exhaustive; each case on facts; avoid matching colours."
    },
    {
      "case_name": "Atherton v. British Insulated and Helsby Cables Ltd.",
      "citation": "10 T.C. 155",
      "treatment": "followed",
      "relevance": "Enduring benefit test for capital expenditure."
    },
    {
      "case_name": "Robert Addie and Sons Collieries Limited v. The Commissioners of Inland Revenue",
      "citation": "8 T.C. 671",
      "treatment": "referred",
      "relevance": "Test: part of working expenses or capital outlay for permanent rights."
    },
    {
      "case_name": "Assam Bengal Cement Co. Ltd. v. Commissioner of Income-tax, West Bengal",
      "citation": "27 I.T.R. 34",
      "treatment": "followed",
      "relevance": "'Once and for all' denotes enduring benefit; character by true nature of asset."
    },
    {
      "case_name": "Commissioner of Taxes v. Nchanga Consolidated Copper Mines Ltd.",
      "citation": "58 I.T.R. 241",
      "treatment": "followed",
      "relevance": "Compensation for temporary cessation of production (1 year) is revenue, not enduring."
    },
    {
      "case_name": "Travancore Sugars and Chemicals Ltd. v. Commissioner of Income-tax, Kerala",
      "citation": "62 I.T.R. 566",
      "treatment": "followed",
      "relevance": "Profit share payment indefinite but related to annual profits, not capital value, is revenue."
    },
    {
      "case_name": "Henriksen (Inspector of Taxes) v. Grafton Hotel Ltd.",
      "citation": "11 I.T.R. 10",
      "treatment": "distinguished",
      "relevance": "Monopoly value payments for licence term are capital, despite instalments; different facts."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act, 1922",
      "sections": [
        "66(1)",
        "10(2)(xv)"
      ],
      "relevance": "Reference to High Court under s.66(1); allowability of expenditure as business expense under s.10(2)(xv)"
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeals filed by the Commissioner of Income-tax, West Bengal are dismissed. The payments made to Ms. H. V. Low Co. Ltd. are held to be revenue expenditure allowable under section 10(2)(xv).",
    "relief_granted": "Deduction allowed to assessee-respondent",
    "costs": "Dismissed with costs"
  },
  "key_quotes": [
    {
      "text": "\"But when an expenditure is made, not only once and for all, but with a view to bringing into existence an asset or an advantage for the enduring benefit of a trade... treating such an expenditure as properly attributable not to revenue but to capital.\"",
      "speaker": "court",
      "significance": "Key test from Atherton for distinguishing capital from revenue expenditure."
    },
    {
      "text": "\"Although an enduring benefit need not be of an everlasting character, it should not, at the same time, be so transitory and ephemeral that it can be terminated at any time at the volition of any of the parties.\"",
      "speaker": "court",
      "significance": "Court's holding on why no enduring benefit here."
    },
    {
      "text": "\"The payments were not related to or tied up in any way to any fixed sum agreed between the parties.\"",
      "speaker": "court",
      "significance": "Reason payments linked to shipments are revenue."
    }
  ],
  "_case_id": "1971_426",
  "_label": 0,
  "_text_length": 26206,
  "_extracted_at": "2026-02-10T20:16:20.129844"
}