{
  "metadata": {
    "case_name": "State Bank of Bikaner and Jaipur v. Hari Har Nath Bhargava",
    "case_year": 1966,
    "court": "Supreme Court of India",
    "judges": [
      "Mitter, J."
    ],
    "case_number": "Civil Appeal No. 1923 of 1966",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The respondent was appointed a clerk by the State Bank of Jaipur in 1949.",
      "type": "background",
      "date": "1949",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The respondent was transferred to Kota in the year 1952.",
      "type": "background",
      "date": "1952",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The respondent was entrusted with supervisory work from 6th April, 1954.",
      "type": "disputed",
      "date": "1954-04-06",
      "source": "respondent"
    },
    {
      "id": "f4",
      "text": "The bank executed a power-of-attorney in favour of the respondent on May 31, 1954 in pursuance of a resolution of its Board of Directors passed on 20th May, 1954.",
      "type": "admitted",
      "date": "1954-05-31",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The respondent was transferred from Kota to Jaipur on July 12, 1955.",
      "type": "background",
      "date": "1955-07-12",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "On December 27, 1955 the respondent was posted at Sikar where he had to perform supervisory duties.",
      "type": "material",
      "date": "1955-12-27",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "On January 1, 1956 the respondent was promoted to the cadre of junior officers of the bank.",
      "type": "background",
      "date": "1956-01-01",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Bank of Jaipur amalgamated with Bank of Bikaner to become State Bank of Bikaner and Jaipur, the appellant.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "On March 31, 1964 the respondent filed an application before the Central Government Labour Court, Rajasthan under S. 33-C(2) of the Industrial Disputes Act praying for computation of special allowance under the Sastry Award for discharging supervisory duties from 6th April, 1954 to 1st January, 1956.",
      "type": "procedural",
      "date": "1964-03-31",
      "source": "respondent"
    },
    {
      "id": "f10",
      "text": "The execution of the power of attorney dated May 31, 1954 was admitted but the appellant denied that the duties entrusted to the respondent constituted performance of supervisory nature of work.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f11",
      "text": "Appellant took point that respondent's claim being a stale one should not be entertained.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f12",
      "text": "Appellant amended its written statement in 1965 stating that the respondent was only required to perform the functions enumerated in the power of attorney as and when so directed by the bank, and had been entrusted with supervisory duties from 6th April, 1954 to 12th July, 1955 and thereafter from 27th December, 1955 to 6th January, 1956.",
      "type": "admitted",
      "date": "1965",
      "source": "petitioner"
    },
    {
      "id": "f13",
      "text": "The respondent was examined before the Labour Court where he said that he was the second signatory at Kota during April 1954 to middle of July 1955; at Jaipur there were many signatories above him; at Sikar he was the second officer.",
      "type": "material",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f14",
      "text": "Central Government Labour Court, Rajasthan passed order on February 14, 1966 holding respondent entitled to supervisory allowance under paragraph 164(b)(9) of the Sastry Award even for the period when not actually performing supervisory duties.",
      "type": "procedural",
      "date": "1966-02-14",
      "source": "lower_court"
    },
    {
      "id": "f15",
      "text": "Labour Court allowed supervisory allowance at Rs. 40 p.m. with effect from 6th April, 1954 to 31st December, 1955 with consequential benefits.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f16",
      "text": "Appellant concedes claim for periods 6th April, 1954 to 12th July, 1955 and 27th December, 1955 to 31st December, 1955, but presses appeal for period 13th July, 1955 to 27th December, 1955 as a matter of principle.",
      "type": "admitted",
      "date": null,
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the respondent was entitled to supervisory allowance under paragraph 164(b)(9) of the Sastry Award even for the period when not actually performing supervisory duties, after execution of power of attorney conferring supervisory powers.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Duties entrusted to the respondent did not constitute performance of supervisory nature of work.",
      "supporting_facts": [
        "f10"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Respondent was only required to perform functions in power of attorney as and when directed by the bank.",
      "supporting_facts": [
        "f12"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Respondent's claim is stale and should not be entertained.",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": "S. 33-C(2) Industrial Disputes Act"
    },
    {
      "id": "pa4",
      "text": "Supervisory duties only from 6th April 1954 to 12th July 1955 and 27th Dec 1955 to 6th Jan 1956; contests period 13th July 1955 to 27th Dec 1955.",
      "supporting_facts": [
        "f12",
        "f16"
      ],
      "legal_basis": "Sastry Award"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Discharging supervisory duties from 6th April, 1954 to 1st January, 1956, entitled to special supervisory allowance under Sastry Award.",
      "supporting_facts": [
        "f3",
        "f9",
        "f13"
      ],
      "legal_basis": "S. 33-C(2) Industrial Disputes Act; para 164(b)(9) Sastry Award"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Power of attorney empowered respondent to discharge supervisory functions; authority continues unless countermanded or cancelled.",
      "addresses_issue": "i1",
      "key_observation": "Functions in power of attorney could only be described as supervisory in nature."
    },
    {
      "id": "cr2",
      "text": "Sastry Award para 164(b)(9) provides special allowances for supervisors etc. requiring special skill or responsibility; para 162 suggests lump-sum allowance.",
      "addresses_issue": "i1",
      "key_observation": "Extra payment necessary for posts with special qualifications or skill."
    },
    {
      "id": "cr3",
      "text": "Payment of special allowance called for when employee discharges supervisory duties or accorded status competent to discharge such functions.",
      "addresses_issue": "i1",
      "key_observation": "Once power of attorney executed, management placed him in category with responsibility without further request."
    },
    {
      "id": "cr4",
      "text": "Power of attorney operative at any branch irrespective of capacity; not denuded of powers at Jaipur merely because superior officers present.",
      "addresses_issue": "i1",
      "key_observation": "Not actually called upon does not take away responsibility or status."
    },
    {
      "id": "cr5",
      "text": "Labour Court came to correct conclusion; limitation plea not entertained as not pressed below or in SLP.",
      "addresses_issue": "i1",
      "key_observation": "Appeal pressed only for test case period."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Respondent entitled to supervisory allowance under Sastry Award for period from 6th April 1954 to 31st December 1955 even if not actually performing duties, due to status conferred by power of attorney.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "State Bank of Hyderabad v. V. A. Bhide",
      "citation": "1969 2 L.L.J. 713",
      "treatment": "followed",
      "relevance": "To claim supervisory allowance, must discharge duties similar to supervisors under category 9 of Sastry Award."
    },
    {
      "case_name": "Lloyds Bank Ltd. v. Panna Lal Gupta and others",
      "citation": "1961 1 L.L.J. 18",
      "treatment": "referred",
      "relevance": "Designation not decisive; status determined by nature of duties and functions assigned."
    }
  ],
  "statutes_cited": [
    {
      "name": "Industrial Disputes Act",
      "sections": [
        "S. 33-C(2)"
      ],
      "relevance": "Application filed for computation of special allowance."
    },
    {
      "name": "Sastry Award",
      "sections": [
        "paragraph 164(b)(9)",
        "paragraph 162",
        "paragraph 164"
      ],
      "relevance": "Provides for special supervisory allowance for employees with special qualifications or responsibility like supervisors."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal by special leave against the Labour Court's order dated February 14, 1966 is dismissed, upholding the respondent's entitlement to supervisory allowance at Rs. 40 p.m. from 6th April 1954 to 31st December 1955 with consequential benefits.",
    "relief_granted": "Supervisory allowance upheld as granted by Labour Court.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"before a person can claim the supervisory special allowance, he must establish that he has discharged the duties and functions which are similar to or the same as the duties or functions assigned to supervisors coming under category 9.\"",
      "speaker": "court",
      "significance": "Cites precedent on requirement for supervisory allowance."
    },
    {
      "text": "\"In our view the payment of a special allowance is called for when an employee discharges duties of a supervisory nature or is accorded the status of a person competent to discharge functions of a supervisory character.\"",
      "speaker": "court",
      "significance": "Core holding on entitlement based on status via power of attorney."
    },
    {
      "text": "\"the power of attorney was operative at any branch of the bank irrespective of the capacity which might be occupied by the respondent at a particular point of time.\"",
      "speaker": "court",
      "significance": "Explains continuity of authority across transfers."
    }
  ],
  "_case_id": "1971_339",
  "_label": 0,
  "_text_length": 12108,
  "_extracted_at": "2026-02-10T20:16:21.009201"
}