{
  "metadata": {
    "case_name": "Assessee Company v. Commissioner of Income-tax",
    "case_year": 1968,
    "court": "Supreme Court of India",
    "judges": [
      "Hegde, J."
    ],
    "case_number": "Civil Appeal No. 1585 of 1968",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The assessee is a public limited company incorporated in 1942.",
      "type": "background",
      "date": "1942",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "At the beginning it owned a distillery at Unnao.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "It acquired a refinery in 1943.",
      "type": "background",
      "date": "1943",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "With effect from June 1, 1945, the assessee company obtained on lease the New Sawan Sugar and Gur Refining Co.",
      "type": "background",
      "date": "1945-06-01",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "During the period from January 29, 1946 to April 23, 1946, the assessee company purchased 41,300 shares of the said company for Rs. 12,17,006/-",
      "type": "material",
      "date": "1946-01-29 to 1946-04-23",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "On April 30, 1947 the entire block of shares was sold to Produce Exchange Corporation Ltd. for Rs. 8,46,750/-",
      "type": "material",
      "date": "1947-04-30",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "The transaction resulted in a loss of Rs. 3,70,356/-",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "This loss was treated by the assessee as a trading loss for the assessment year 1948-49 (corresponding to accounting year ending December 31, 1948)",
      "type": "material",
      "date": "1948-1949",
      "source": "assessee"
    },
    {
      "id": "f9",
      "text": "After setting off this loss against the other income of the assessee company, a loss of Rs. 2,27,085/- was carried forward under s. 24(2) of the Income-tax Act, 1922 to the year 1949-50 and later years",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "The assessee claimed to set off this unabsorbed loss pertaining to the share business against its profits in the sugar business for the assessment year 1949-1950",
      "type": "material",
      "date": "1949-1950",
      "source": "assessee"
    },
    {
      "id": "f11",
      "text": "The Income-tax Officer did not permit this set off",
      "type": "procedural",
      "date": null,
      "source": "income_tax_officer"
    },
    {
      "id": "f12",
      "text": "The Appellate Assistant Commissioner confirmed the order of the Income-tax Officer",
      "type": "procedural",
      "date": null,
      "source": "appellate_assistant_commissioner"
    },
    {
      "id": "f13",
      "text": "In a further appeal, the Appellate Tribunal agreed with the conclusion reached by the Income-tax Officer",
      "type": "procedural",
      "date": null,
      "source": "tribunal"
    },
    {
      "id": "f14",
      "text": "At the instance of the High Court, the Appellate Tribunal stated a case under s. 66(2) of the Act on the question: Was there any evidence before the Tribunal on which it could hold that the business in dealing with shares was distinct and separate from the business of sugar manufacturing and distillery?",
      "type": "procedural",
      "date": null,
      "source": "high_court"
    },
    {
      "id": "f15",
      "text": "By its judgment dated April 23, 1963? Wait, July 23, 1963? Text says July 23, 1963, but later April 23? Inconsistent, but High Court answered in affirmative against assessee",
      "type": "procedural",
      "date": "1963-07-23",
      "source": "high_court"
    },
    {
      "id": "f16",
      "text": "Appeal to Supreme Court after certificate under s. 66A(2)",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f17",
      "text": "Appeal heard on February 6, 1969; Court found statement incomplete, directed supplementary statement",
      "type": "procedural",
      "date": "1969-02-06",
      "source": "court"
    },
    {
      "id": "f18",
      "text": "Tribunal submitted supplementary statement: single trading and profit and loss account including sales of spirit, sugar, molasses, stock and shares",
      "type": "admitted",
      "date": null,
      "source": "tribunal"
    },
    {
      "id": "f19",
      "text": "Share transactions and business dealt with by common organisation, though sale of shares was single transaction",
      "type": "admitted",
      "date": null,
      "source": "tribunal"
    },
    {
      "id": "f20",
      "text": "Business of company and share transaction attended as part and parcel of assessee's business",
      "type": "admitted",
      "date": null,
      "source": "tribunal"
    },
    {
      "id": "f21",
      "text": "Common fund utilised for business and purchase of shares; part of overdraft Rs. 6,80,046/- on Dec 31, 1947 discharged from business and share income",
      "type": "admitted",
      "date": "1947-12-31",
      "source": "tribunal"
    },
    {
      "id": "f22",
      "text": "Share transaction work and other business carried on in same place of business",
      "type": "admitted",
      "date": null,
      "source": "tribunal"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the business of the company of dealing in shares and the business of manufacturing sugar and other commodities constitute the same business within the meaning of s. 24(2) of the Indian Income-tax Act, 1922, in force in the year of assessment?",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The assessee claimed to set off the unabsorbed loss from share business against sugar business profits",
      "supporting_facts": [
        "f8",
        "f9",
        "f10"
      ],
      "legal_basis": "s. 24(2) of the Income-tax Act, 1922"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "From facts found, no interconnection, interlacing, interdependence and unity between share transactions and other business; transactions easily separable, no dovetailing",
      "supporting_facts": [
        "f18",
        "f19"
      ],
      "legal_basis": "Commissioner of Income-tax, Madras v. Prithvi Insurance Co. Ltd.; Scales v. George Thompson & Co. Ltd."
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "From facts found by Tribunal, share transaction and other businesses dealt with by common management, common business organization, common administration, common fund and common place of business",
      "addresses_issue": "i1",
      "key_observation": "Facts clearly show interconnection, interlacing, interdependence and unity furnished by common elements"
    },
    {
      "id": "cr2",
      "text": "Objective tests for interconnection etc. are existence of common management, common business organisation, common administration, common fund and common place of business, as laid down in Prithvi Insurance Co. Ltd.",
      "addresses_issue": "i1",
      "key_observation": "This conclusion reiterated in Produce Exchange Corporation Ltd. v. CIT"
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The business of dealing in shares and manufacturing sugar constitute the same business under s. 24(2)",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Commissioner of Income-tax, Madras v. Prithvi Insurance Co. Ltd.",
      "citation": "63 I.T.R. 632",
      "treatment": "followed",
      "relevance": "Laid down tests for determining if two businesses constitute same business: common management, organisation, administration, fund, place of business"
    },
    {
      "case_name": "Scales v. George Thompson & Co. Ltd.",
      "citation": "13 Tax Cases 83",
      "treatment": "referred",
      "relevance": "Rowlatt J. held businesses must not be easily separable and must dovetail; respondent relied on it"
    },
    {
      "case_name": "Produce Exchange Corporation Ltd. v. Commissioner of Income-tax, Central Calcutta",
      "citation": null,
      "treatment": "followed",
      "relevance": "Reiterated Prithvi tests; similar facts of loss in shares set off against other commodities"
    }
  ],
  "statutes_cited": [
    {
      "name": "Income-tax Act, 1922",
      "sections": [
        "s. 24(2)",
        "s. 66(2)",
        "s. 66A(2)"
      ],
      "relevance": "Carry forward and set off of losses if same business; reference to High Court and certificate to SC"
    }
  ],
  "outcome": {
    "disposition": "partially_accepted",
    "summary": "Supreme Court directed Tribunal for supplementary statements, reframed question, applied tests from Prithvi, found common elements constituting same business allowing set off (inferred from reasoning, text incomplete)",
    "relief_granted": "Set off of loss permitted",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"inter-connection, inter-lacing, inter-dependence and unity were furnished by the existence of common management, common business Organisation, common administration, common fund and a common place of business.\"",
      "speaker": "court",
      "significance": "Objective test for same business under s.24(2)"
    },
    {
      "text": "\"From the facts found by the Tribunal, it is clear that the share transaction as well as the other businesses of the company were dealt with by a common management, common business organization, common administration, common fund and common place of business.\"",
      "speaker": "court",
      "significance": "Application of tests to facts in favor of assessee"
    }
  ],
  "_case_id": "1971_23",
  "_label": 1,
  "_text_length": 8636,
  "_extracted_at": "2026-02-10T20:14:11.029956"
}