{
  "metadata": {
    "case_name": "Operators v. State of Andhra Pradesh",
    "case_year": 1968,
    "court": "Supreme Court of India",
    "judges": [
      "Jaganmohan Reddy"
    ],
    "case_number": "Civil Appeal No. 1332 of 1968",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Madras Motor Vehicles Taxation of Passengers and Goods Act XVI of 1952 became applicable to the State of Andhra and subsequently to Andhra Pradesh after reorganisations in 1953 and 1956.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "In 1959, Andhra Pradesh legislature enacted Motor Vehicles Taxation of Passengers and Goods Andhra Pradesh Amendment Act increasing rates for state carriages and goods vehicles.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Under sub-section 2 of Section 1 of the 1959 Amendment Act, Government of Andhra Pradesh appointed 8th May 1959 as date of coming into force.",
      "type": "procedural",
      "date": "1959-05-08",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On 7th May 1959, by G.O. Ms. No. 1077, State Transport Authority directed to fix maximum fares inclusive of leviable tax for state carriages in territories comprised in State of Andhra before 1st November 1956.",
      "type": "procedural",
      "date": "1959-05-07",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "1959 Amendment challenged in batch of Writ Petitions in Andhra Pradesh High Court, which struck it down as unconstitutional.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Legislature passed Act 34 of 1961 validating levy under struck down Act and imposing surcharge from 3rd November 1961.",
      "type": "procedural",
      "date": "1961-11-03",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Operators questioned 1961 Amendment Act claiming they could not collect fares at enhanced rates due to permit conditions precluding fares higher than 7-1/2 pies or 4 NP per passenger per mile; Regional Transport Authorities did not modify condition.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "Andhra Pradesh High Court in Writ Petition No. 201 of 1963 (judgment dated February 3, 1964) negated contention, dismissed Writ Petitions but directed Respondents not entitled to payment or collection of enhanced surcharge for month of May 1959.",
      "type": "procedural",
      "date": "1964-02-03",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Pursuant to G.O. Ms. No. 1077 dated 7th May 1959, Regional Transport Authority by proceedings dated 12th May 1959 called upon Regional Transport Officers to notify operators to collect enhanced fares; officers notified operators.",
      "type": "procedural",
      "date": "1959-05-12",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Appeal to Supreme Court by certificate against High Court judgment.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether enhanced surcharge became operative and payable immediately on coming into force of 1961 Act or necessary to amend conditions of permit dealing with fares leviable by operators before Government could collect enhanced surcharge.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether payment of enhanced tax dependent on operators collecting enhanced fares.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether notification under Section 43(1)(i) Motor Vehicles Act statutorily amends permit conditions by virtue of Section 59(3)(c).",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Unless table of fares altered in accordance with procedure laid down, fares which include taxes cannot be lawfully collected; operators not bound to pay enhanced surcharge due to permit conditions precluding higher fares.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "Madhya Pradesh Transport Co. Private Ltd. v. State of Madhya Pradesh"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Directions in G.O. Ms. No. 1077 dated 7th May 1959 pursuant to which Regional Transport Authority proceedings dated 12th May 1959 notified operators via Regional Transport Officers authorising collection of enhanced fares sufficient as if fare tables amended.",
      "supporting_facts": [
        "f4",
        "f9"
      ],
      "legal_basis": "Sections 43(1)(i), 44(4), 59(3)(c) Motor Vehicles Act, 1939"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Relevant provisions of Motor Vehicles Act support High Court view that notification under Section 43(1)(i) statutorily amends conditions of permit by virtue of Section 59(3)(c); once complied with Sections 43(1)(i) and 44(4), Section 59(3)(c) incorporates maximum fares as notified including tax as condition of permit.",
      "addresses_issue": "i3",
      "key_observation": "No justification for contention that collection of enhanced fares without amending fare table would entail cancellation of permits."
    },
    {
      "id": "cr2",
      "text": "Madhya Pradesh Transport case distinguishable as no notification under Section 43 issued there nor Section 59(3)(c) considered.",
      "addresses_issue": "i1",
      "key_observation": "Constitutionality of enhanced surcharge upheld in Nazeeria Motor Service v. State of Andhra Pradesh."
    },
    {
      "id": "cr3",
      "text": "Appellants' contention unsustainable; unnecessary to consider if payment dependent on collection as view taken rejects premise.",
      "addresses_issue": "i2",
      "key_observation": "Operators liable to pay enhanced surcharge."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Notification issued by Government under Section 43(1)(i) in exercise of powers incorporates maximum fares including tax as condition of permit via Section 59(3)(c).",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Operators bound to pay enhanced surcharge without need for further amendment of fare tables in permits.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Madhya Pradesh Transport Co. Private Ltd. v. State of Madhya Pradesh",
      "citation": "A.I.R. Vol. 49 1962-M.P. 108",
      "treatment": "distinguished",
      "relevance": "Operators relied on it for need to alter fare tables; court distinguished as no Sec 43 notification or Sec 59(3)(c) consideration there."
    },
    {
      "case_name": "Nazeeria Motor Service etc. v. State of Andhra Pradesh & Anr.",
      "citation": "1970 2 S.C.R. 52",
      "treatment": "followed",
      "relevance": "Constitutionality of enhanced surcharge upheld."
    }
  ],
  "statutes_cited": [
    {
      "name": "Madras Motor Vehicles Taxation of Passengers and Goods Act, 1952",
      "sections": [
        "XVI of 1952"
      ],
      "relevance": "Applicable Act; rates increased by amendments; fares inclusive of tax under it."
    },
    {
      "name": "Motor Vehicles Taxation of Passengers and Goods (Andhra Pradesh Amendment) Act, 1959",
      "sections": [
        "Section 1(2)"
      ],
      "relevance": "Increased rates; came into force 8th May 1959; struck down then validated."
    },
    {
      "name": "Act 34 of 1961",
      "sections": [],
      "relevance": "Validating levy and imposing surcharge from 3rd November 1961."
    },
    {
      "name": "Motor Vehicles Act, 1939",
      "sections": [
        "Section 43(1)(i)",
        "Section 44(3), 44(4)",
        "Section 48(3)",
        "Section 59(3)(c)"
      ],
      "relevance": "Government directions to fix fares; effect on permit conditions; maximum fares as condition of permit."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court dismissed the appeal holding appellants' contention unsustainable; notification under Section 43(1)(i) amends permit conditions via Section 59(3)(c), operators liable for enhanced surcharge; distinguished MP case; noted High Court directions on May 1959 but focused on upholding levy.",
    "relief_granted": "None to appellants",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "once a Notification is issued by the Government in exercise of the powers under Section 43(1)(i) the conditions of the permit stand statutorily amended by virtue of Section 59(3)(c).",
      "speaker": "court",
      "significance": "Core holding on statutory amendment of permits."
    },
    {
      "text": "the contention urged by the Appellant is unsustainable.",
      "speaker": "court",
      "significance": "Rejects petitioners' main argument."
    }
  ],
  "_case_id": "1971_242",
  "_label": 0,
  "_text_length": 9783,
  "_extracted_at": "2026-02-10T20:15:34.199221"
}