{
  "metadata": {
    "case_name": "Appellant v. State of Maharashtra (Government of Bombay)",
    "case_year": 1967,
    "court": "Supreme Court of India",
    "judges": [
      "Ray, J."
    ],
    "case_number": "Civil Appeal No. 381 of 1967",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant joined service as Sub-Inspector of Excise in the Excise and Prohibition Department of the Government of Bombay in 1938.",
      "type": "background",
      "date": "1938",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Appellant was selected for transfer to the Bombay City Police Department.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "In 1942, appellant was sent on deputation to the Civil Supplies Department as an Inspector and continued there until February 1955.",
      "type": "background",
      "date": "1942-02-1955",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "By February 1955, appellant had become Rationing Officer, a gazetted post, drawing Rs. 530 p.m. in grade Rs. 350-20-550.",
      "type": "background",
      "date": "02-1955",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "In 1955, decontrol of foodgrains led to abolition of the post; appellant was reverted to Excise Department.",
      "type": "background",
      "date": "1955",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Appellant was promoted to District Inspector in Excise Department in grade Rs. 220-10-.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "In 1957, Government reintroduced foodgrains distribution; appellant sent on deputation to Agriculture and Forests Department as Sub-Inspector under Controller of Foodgrains Distribution, Bombay.",
      "type": "background",
      "date": "1957",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "In 1960, appellant appointed to temporary post of Controller of Foodgrains Distribution, Bombay in grade Rs. 475-25-600-50-750.",
      "type": "background",
      "date": "1960",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "In 1961, appellant drawing Rs. 500 p.m. as Controller.",
      "type": "background",
      "date": "1961",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Appellant married his daughter in December 1961; daughter was Resident Medical Officer in Bombay Municipal Corporation.",
      "type": "background",
      "date": "12-1961",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "In Jan-Mar 1962, Director of Civil Supplies asked appellant (partly in writing, partly orally) if he forced peons to do menial work at daughter's marriage, took cash/gifts from Fair Price Shop-owners, forced staff to contribute cash for marriage. Appellant denied allegations.",
      "type": "disputed",
      "date": "01-1962 to 03-1962",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "In April 1962, Secretary to Government of Maharashtra, Agriculture and Forests Department told appellant there were complaints, 'there could be no smoke without fire', and he would be repatriated to Prohibition and Excise Department.",
      "type": "material",
      "date": "04-1962",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "In April 1962, Minister of Civil Supplies visited appellant's office and said there were complaints.",
      "type": "material",
      "date": "04-1962",
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Appellant requested thorough enquiry into complaints.",
      "type": "procedural",
      "date": "04-1962",
      "source": "petitioner"
    },
    {
      "id": "f15",
      "text": "After Minister's visit, Inspector of Police from Anti-corruption Branch took possession of files of fair price shop-keepers for scrutiny.",
      "type": "procedural",
      "date": "04-1962 after",
      "source": "court"
    },
    {
      "id": "f16",
      "text": "Government of Bombay by resolution dated 8 May 1962 directed repatriation of appellant from deputation to parent Excise and Prohibition Department with immediate effect.",
      "type": "material",
      "date": "1962-05-08",
      "source": "respondent"
    },
    {
      "id": "f17",
      "text": "Appellant asked to hand over charge and posted as Officiating Inspector in Excise Department.",
      "type": "material",
      "date": "05-1962",
      "source": "court"
    },
    {
      "id": "f18",
      "text": "In July 1962, appellant learned Anti-corruption Branch report exonerated him from all charges.",
      "type": "material",
      "date": "07-1962",
      "source": "petitioner"
    },
    {
      "id": "f19",
      "text": "Appellant made representation to Government for reinstatement as Controller; no reply received.",
      "type": "procedural",
      "date": "07-1962 after",
      "source": "petitioner"
    },
    {
      "id": "f20",
      "text": "Appellant filed application under Article 226 impeaching order as punitive reduction in rank violating Article 311.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f21",
      "text": "Single Judge of Bombay High Court on 29 Oct 1963 held order punitive reduction in rank.",
      "type": "procedural",
      "date": "1963-10-29",
      "source": "lower_court"
    },
    {
      "id": "f22",
      "text": "Division Bench of Bombay High Court reversed Single Judge on 30 Jun, 4 and 5 Jul 1966, holding no legal right to post, reversion not punishment.",
      "type": "procedural",
      "date": "1966-06-30, 1966-07-04, 1966-07-05",
      "source": "lower_court"
    },
    {
      "id": "f23",
      "text": "Appeal by special leave to Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the order of the Government of Bombay dated 8 May 1962 repatriating the appellant from the temporary post of Controller of Foodgrains Department to his parent Department of Excise and Prohibition amounted to a reduction in rank in violation of Article 311 of the Constitution.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The resolution was in the nature of punishment by way of reduction in rank in violation of Article 311, taken on false reports without waiting for police investigation to complete.",
      "supporting_facts": [
        "f11",
        "f14",
        "f16",
        "f18",
        "f19",
        "f20"
      ],
      "legal_basis": "Article 311, Article 226"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Appellant had no legal right to the post in Agriculture and Forests Department; reversion not a punishment.",
      "supporting_facts": [
        "f8",
        "f16",
        "f22"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Cited Parshotam Lal Dhingra v. Union of India: Article 311 protects both permanent/temporary servants; reduction from officiating higher rank to substantive lower not punishment if no right to post, but can be if entails forfeiture of pay/allowances, loss of seniority, or passed as penalty. Tests: right to post/rank, or evil consequences.",
      "addresses_issue": "i1",
      "key_observation": "Three propositions from Dhingra case applied."
    },
    {
      "id": "cr2",
      "text": "Cited Sukhbans Singh v. State of Punjab: Probationer has no right to higher post but cannot be punished without Article 311 compliance; on facts, reversion was punitive.",
      "addresses_issue": "i1",
      "key_observation": "Reversion by way of punishment invalid."
    },
    {
      "id": "cr3",
      "text": "Cited Appar Singh v. State of Punjab: Reversion from officiating Class I to substantive Class II punitive where based on enquiry into allegations without proper procedure.",
      "addresses_issue": "i1",
      "key_observation": "Enquiry investigated allegations and recommended punishment."
    },
    {
      "id": "cr4",
      "text": "Preeminent features making reversion punitive: charges of misconduct denied by appellant; threats of repatriation; Minister's visit; police enquiry initiated; appellant asked to wait for investigation but order passed anyway; later exonerated; excellent service record with repeated deputations and promotions.",
      "addresses_issue": "i1",
      "key_observation": "Post temporary but quasi-permanent; not abolished or due to unsuitability; parent dept did not want him back."
    },
    {
      "id": "cr5",
      "text": "Reversion simpliciter not punishment, but must view substance: if genuine service exigency without aspersion on character, ok; here evidence shows punitive.",
      "addresses_issue": "i1",
      "key_observation": "Article 311 attracted; order non-compliant."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Order of reversion was in nature of punishment/reduction in rank without compliance with Article 311, hence invalid.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Parshotam Lal Dhingra v. Union of India",
      "citation": "1958 S.C.R. 828",
      "treatment": "followed",
      "relevance": "Laid down principles on when reversion amounts to reduction in rank/punishment under Article 311."
    },
    {
      "case_name": "Sukhbans Singh v. State of Punjab",
      "citation": "1963 1 S.C.R. 416",
      "treatment": "followed",
      "relevance": "Reversion of probationer punitive if by way of punishment for misconduct without Article 311."
    },
    {
      "case_name": "Appar Singh v. The State of Punjab Ors.",
      "citation": "Civil Appeal No. 15 of 1967 decided on 3-12-1970",
      "treatment": "followed",
      "relevance": "Reversion from officiating higher post punitive where based on enquiry into allegations without proper procedure."
    }
  ],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Article 311",
        "Article 226"
      ],
      "relevance": "Article 311 protection against reduction in rank as punishment without procedure; Article 226 for writ petition."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; Division Bench judgment of Bombay High Court set aside; Single Judge judgment restored. Appellant entitled to costs in Supreme Court.",
    "relief_granted": "Restoration of Single Judge's judgment quashing repatriation order.",
    "costs": "Costs to appellant in this Court."
  },
  "key_quotes": [
    {
      "text": "The only question in this appeal is whether the order of the Government of Bombay dated 8 May, 1962 repatriating the appellant from the temporary post of Controller of Foodgrains Department, Bombay to his parent Department of Excise and Prohibition amounted to a reduction in rank in violation of the provisions contained in Article 311 of the Constitution.",
      "speaker": "court",
      "significance": "Frames the sole issue."
    },
    {
      "text": "In determining whether the reduction is or is not by way of punishment it has to be found out if the order entails or provides for the forfeiture of his pay or allowances or the loss of his seniority in his substantive rank or the stoppage or postponement of his future chances of promotion, or that in truth and reality the Government has passed the order as and by way of penalty.",
      "speaker": "court",
      "significance": "Key test from Dhingra case applied."
    },
    {
      "text": "The most preeminent features which accentuate the order of reversion to be in the nature of punishment in the present case are these.",
      "speaker": "court",
      "significance": "Introduces facts showing punitive intent."
    }
  ],
  "_case_id": "1971_136",
  "_label": 1,
  "_text_length": 13525,
  "_extracted_at": "2026-02-10T20:14:56.541235"
}