{
  "metadata": {
    "case_name": "Jaydip Industries v. Workmen",
    "case_year": 1967,
    "court": "Supreme Court of India",
    "judges": [
      "Mathew, J."
    ],
    "case_number": "Civil Appeal No. 912 of 1967",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The employer is a partnership concern consisting of five partners carrying on the business of manufacturing paper board at its factory situated in Majiwada within the limits of the panchayat of that village.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The partnership was started in the year 1959, on a capital of Rs. 1,50,000/-. The capital has since then been increased and it was Rs. 2 lakhs in 1965.",
      "type": "background",
      "date": "1959",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The number of workmen employed in the concern, at the time of the reference, was about 150.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The workmen were being paid fixed consolidated wages.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Government of Maharashtra referred the industrial dispute between Ms. Jaydip Industries, Thana, and the workmen employed under them to the Industrial Tribunal on December 31, 1965, under section 10(1)(d) of the Industrial Disputes Act, 1947.",
      "type": "procedural",
      "date": "1965-12-31",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The dispute arose out of demands made by the workmen for monthly scales of pay: Unskilled Rs. 150-5.00-200.00; Semi-skilled 175-7.50-250.00; Skilled 225-10.00-325.00; Highly skilled 350-25.00-600.00, consolidated on basis of Bombay Working Class Cost of Living Index Number 480, with DA of ten paise per day for every point rise above 480, effective from 1st February 1965.",
      "type": "material",
      "date": "1965-02-01",
      "source": "respondent"
    },
    {
      "id": "f7",
      "text": "For conversion of present daily rates into monthly rates, the present rate should be multiplied by thirty. The amount should then be fitted in the above grades. If the amount falls short of minimum of Grades demanded the same should be brought up to the minimum. After making adjustment in the above manner adjustment increments at the rate of one for every one year of service or part thereof in excess of six months should be added to the pay.",
      "type": "material",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "Employer contended before the Tribunal, by its written statement dated February 8, 1966, that it has no financial capacity to pay any additional wages, as it has been suffering heavy losses year after year.",
      "type": "disputed",
      "date": "1966-02-08",
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "During the pendency of the disputes before the Tribunal, the Government of Maharashtra fixed the minimum rates of wages for the employees employed in scheduled employments including the paper and paper-board manufacturing industry under section 3 of the Minimum Wages Act, 1948, by notification published in the Maharashtra Government Gazette dated August 4, 1966.",
      "type": "procedural",
      "date": "1966-08-04",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "In implementation of the notification, the wages of the workmen concerned were raised with effect from October, 1966, at the following rates: Unskilled Rs. 90 per month; Semi-skilled Rs. 100 per month; Skilled-B Rs.115 per month; Skilled-A Rs. 130 per month.",
      "type": "material",
      "date": "1966-10-01",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "The Tribunal considered in detail the financial capacity of the employer on the basis of the balance sheets and profit and loss accounts for the years 1960 to 1965 and found that its total loss for those years amounted to Rs. 78,000 and on that basis its annual average loss worked out to Rs. 13,000 and so the concern was not financially stable.",
      "type": "disputed",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "The Tribunal fixed rates of wages: Daily-rated Unskilled Rs. 4.50 (Monthly Rs. 117.00); Semi-skilled Rs. 6.00 (Rs. 156.00); Skilled Rs. 7.50 (Rs. 195.00); Highly-skilled Rs. 9.50 (Rs. 247.00), deemed fixed at Bombay Consumer Price Index figure. For a rise of every ten points in the Index Figure the workmen shall be given an increase in the wages at the rate of seven paise per day. And for a fall of every ten points in the Index Figure there shall be a reduction in the wages at the rate of seven paise per day.",
      "type": "material",
      "date": "1967-03-03",
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "The Tribunal based its fixation on minimum rates in prior awards: Ms. Kondivitta Paper and Board Mills Private Limited, Bombay (Maharashtra Government Gazette, November 14, 1963, page 3750); Bombay Metal Factory (May 27, 1965, page 1963); Ratan Industries, Bombay (June 23, 1966, page 1974).",
      "type": "background",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "The Tribunal held that wages it fixed were the minimum rates of wages for the workmen in question and therefore, the capacity of the employer to pay was irrelevant.",
      "type": "admitted",
      "date": "1967-03-03",
      "source": "lower_court"
    },
    {
      "id": "f15",
      "text": "Award passed by the Industrial Tribunal, Maharashtra, Bombay, on March 3, 1967 in Reference IT No. 1 of 1968.",
      "type": "procedural",
      "date": "1967-03-03",
      "source": "court"
    },
    {
      "id": "f16",
      "text": "The Tribunal considered the rise in the cost of living, particularly the Consumer Price Index for December 1966 and January 1967.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f17",
      "text": "The rates of minimum wages fixed by the Government for the city of Bombay, the town of Thana and the village of Majiwada, where the appellant's factory is situate, are the same.",
      "type": "admitted",
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the Tribunal was right in fixing wages at rates higher than the rates fixed by the Government under section 3 of the Minimum Wages Act, 1948, and whether what was fixed by the Tribunal were minimum wages.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the financial capacity of the employer to pay should have been taken into account when fixing minimum wages higher than those notified by the Government.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether the Tribunal went wrong in taking the minimum rates of wages fixed in various awards for workmen in the city of Bombay as criteria for fixing minimum wages for workmen outside the city.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The Tribunal was wrong in fixing minimum wages at higher rates than those fixed by the Government under section 3 of the Minimum Wages Act without taking into account the financial capacity of the employer to pay.",
      "supporting_facts": [
        "f8",
        "f11"
      ],
      "legal_basis": "Minimum Wages Act, 1948 section 3"
    },
    {
      "id": "pa2",
      "text": "Once the appropriate Government has fixed minimum rates of wages under section 3, it was not open to the Tribunal to fix higher rates as minimum wages; the rates fixed by Tribunal were not minimum wages but fair wages or bordering on fair wages, so financial capacity should have been considered.",
      "supporting_facts": [
        "f9",
        "f10",
        "f12"
      ],
      "legal_basis": "Minimum Wages Act, 1948 section 3"
    },
    {
      "id": "pa3",
      "text": "The employer has its place of business outside the city of Bombay where wages are generally higher, so Tribunal wrong in taking Bombay awards as criteria.",
      "supporting_facts": [
        "f1",
        "f13"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Section 3(2A) of the Minimum Wages Act provides that notwithstanding the fixation or revision of minimum wages by notification during pendency of proceedings before Tribunal under Industrial Disputes Act, such minimum rates shall not apply to those employees during the period the proceeding is pending.",
      "addresses_issue": "i1",
      "key_observation": "Even after fixation of minimum rates by Government under s.3, Industrial Tribunal can fix minimum wages at higher or lower rates if dispute pending at time of fixation."
    },
    {
      "id": "cr2",
      "text": "The Tribunal was not bound by the rates fixed by Government under s.3 and could fix higher rates as minimum wages.",
      "addresses_issue": "i1",
      "key_observation": "Tribunal open to fix minimum wages higher than Government notification."
    },
    {
      "id": "cr3",
      "text": "Minimum wage, as per U. Unichoyi v. State of Kerala, is not bare subsistence but includes preservation of efficiency of worker; capacity of employer irrelevant.",
      "addresses_issue": "i2",
      "key_observation": "Rates fixed by Tribunal were minimum wages, not fair wages; capacity to pay irrelevant."
    },
    {
      "id": "cr4",
      "text": "Tribunal referred to prior awards and rise in cost of living (CPI Dec 1966 and Jan 1967); Government rates for Bombay, Thana, Majiwada same, so no error in using Bombay awards as criteria.",
      "addresses_issue": "i3",
      "key_observation": "No material that Government considered all components of minimum wage; Tribunal justified higher rates."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "In light of s.3(2A) Minimum Wages Act, Tribunal not bound by Government-fixed minimum wages under s.3 and could fix higher minimum wages.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Capacity of employer irrelevant for fixing minimum wages as defined in U. Unichoyi.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Tribunal did not err in using Bombay awards as criteria since Government minimum wages same for Bombay, Thana, Majiwada.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "U. Unichoyi v. State of Kerala",
      "citation": "1962 1 S.C.R. 957",
      "treatment": "followed",
      "relevance": "Explains components of minimum wage: sustenance, maintenance of family, preservation of efficiency; capacity to pay irrelevant."
    },
    {
      "case_name": "Ms. Kondivitta Paper and Board Mills Private Limited, Bombay",
      "citation": "Maharashtra Government Gazette dated November 14, 1963, page 3750",
      "treatment": "referred",
      "relevance": "Minimum rates of wages fixed by Tribunal used as comparable."
    },
    {
      "case_name": "Bombay Metal Factory",
      "citation": "Maharashtra Government Gazette dated May 27, 1965 page 1963",
      "treatment": "referred",
      "relevance": "Minimum rates of wages fixed by Tribunal used as comparable."
    },
    {
      "case_name": "Ratan Industries, Bombay",
      "citation": "Maharashtra Government Gazette dated June 23, 1966 page 1974",
      "treatment": "referred",
      "relevance": "Minimum rates of wages fixed by Tribunal used as comparable."
    }
  ],
  "statutes_cited": [
    {
      "name": "Industrial Disputes Act, 1947",
      "sections": [
        "Section 10(1)(d)"
      ],
      "relevance": "Basis for reference of dispute to Tribunal."
    },
    {
      "name": "Minimum Wages Act, 1948",
      "sections": [
        "Section 3",
        "Section 3(1)(b)",
        "Section 3(2A)"
      ],
      "relevance": "Government fixation of minimum wages; s.3(2A) allows Tribunal to fix different rates during pendency of dispute."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal by special leave against the Tribunal's award fixing minimum wages higher than Government notification upheld; Tribunal's rates confirmed as minimum wages, capacity to pay irrelevant.",
    "relief_granted": "None to appellant; award in favour of workmen upheld.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"the minimum wage can provide not only for the bare sustenance of life but also for the preservation of the efficiency of the worker.\"",
      "speaker": "court",
      "significance": "Defines scope of minimum wage from Unichoyi precedent."
    },
    {
      "text": "\"the Tribunal was not bound by the rates of minimum wages fixed by the Government under section 3 of the Act and that it was open to the Tribunal to fix rates of minimum wages to be paid to the workmen concerned in the disputes at figures higher than those fixed by the Government.\"",
      "speaker": "court",
      "significance": "Core holding on Tribunal's power under s.3(2A)."
    }
  ],
  "_case_id": "1971_525",
  "_label": 0,
  "_text_length": 12751,
  "_extracted_at": "2026-02-10T20:19:24.597231"
}