{
  "metadata": {
    "case_name": "Venugopala Varma Rajah v. Agricultural Income-tax Officer",
    "case_year": 1969,
    "court": "Supreme Court of India",
    "judges": [
      "Hegde, J."
    ],
    "case_number": "Civil Appeal No. 266 of 1969",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant is the present Rajah of the Vengunad Swaroopan in Palghat District, Kerala State and Karnavan of his Tarwad (H.U.F.).",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Predecessor as Karnavan submitted return for assessment year 1959-60 under Kerala Agricultural Income-tax Act showing gross income Rs. 1,21,912/- and net income Rs. 84,065/60 P from properties held under family Karar dated May 29, 1909.",
      "type": "procedural",
      "date": "1959-60",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Agricultural Income-tax Officer included income of properties put in possession of junior members under 1909 Karar, overruling assessee's objection; net income computed as Rs. 2,32,957/- and tax Rs. 1,30,672/35 P imposed.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f4",
      "text": "Appellate Authority excluded income of properties allotted to Rani Group but sustained addition of income from properties allotted to male members.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "Appellate Tribunal rejected assessee's contention and dismissed appeal.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "At instance of assessee, Tribunal stated case under s. 60(1) of the Act to Kerala High Court in Income-tax Referred Case No. 44 of 1966 with three questions of law.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Questions referred: (1) Whether Tribunal's finding that 1909 Karar does not constitute diversion of family income is correct? (2) Whether Tribunal's finding that s.9(1) applies only to diversion of income and not otherwise is correct? (3) Whether Tribunal's finding that s.9(1) not applicable is correct?",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "High Court by judgment dated August 16, 1967 answered Questions 1 and 2 against assessee; did not answer Question 3 as unnecessary.",
      "type": "procedural",
      "date": "1967-08-16",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Appeal to Supreme Court by certificate.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "1909 Karar executed by all 12 living members of family; family is premier land holding family in Malabar with agricultural properties.",
      "type": "background",
      "date": "1909-05-29",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Sch. A properties set apart for maintenance, education, other expenses of female and male members in Kalari Kovilagom (Rani Group); Karnavan to perform marriages and meet expenses; no right to alienate/encumber; members pay govt revenue.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Party No. 2 (second senior most) given 7,000 paras paddy annually; B Sch. lands yielding 3,500 paras made over; Karnavan to give additional 3,500 paras from 1085 Malayalam era and redeem Karukakode Challa Nilam.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "C Sch. properties yielding 4,750 paras allotted to Party No. 3 for maintenance.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "D Sch. properties for maintenance of Party No. 4.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f15",
      "text": "Land-revenue for B, C, D Sch. properties paid by Karnavan.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f16",
      "text": "On death of Party 2 or becoming Karnavan, Party 3 takes B Sch.; Party 4 takes C Sch.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f17",
      "text": "Prohibition on alienation/encumbrance; Karnavan can resume if contravened.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f18",
      "text": "Clause 18: No cutting/selling kuzhikoors or dismantling buildings.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f19",
      "text": "Clause 19: No enhancing munpattom.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f20",
      "text": "Clause 6: Male members in Kalari over 21 leave; Karnavan arranges maintenance (no specifics).",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f21",
      "text": "Karar silent on substantial increase in family members or fate of B,C,D Sch. after death of Parties 2,3,4 (all deceased).",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f22",
      "text": "Joint status not disrupted; arrangement for maintenance only; no absolute rights; properties remain family property; not permanent; no Thavazhi division; Karnavan liability to maintain males >21 except 2,3,4; no devolution specified; Karnavan pays land revenue except A Sch.",
      "type": "disputed",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the income of the properties put in possession of the male members under the Karar of 1909 continues to be the income of the family.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The family Karar of 1909 constitutes a diversion of family income to the various allottees thereunder.",
      "supporting_facts": [
        "f10",
        "f11",
        "f12",
        "f13",
        "f14",
        "f15",
        "f16",
        "f17",
        "f18",
        "f19",
        "f20"
      ],
      "legal_basis": "s. 9(1) of Kerala Agricultural Income-tax Act"
    },
    {
      "id": "pa2",
      "text": "Provisions of s.9(1) applicable only to cases of diversion of income and not otherwise; not applicable to facts.",
      "supporting_facts": [
        "f22"
      ],
      "legal_basis": "s. 9(1) of Kerala Agricultural Income-tax Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "1909 Karar does not constitute diversion of family income; income continues to be family income; s.9(1) applicable.",
      "supporting_facts": [
        "f22"
      ],
      "legal_basis": "s. 9(1) of Kerala Agricultural Income-tax Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Examination of Karar shows joint status not disrupted; arrangement only for maintenance; no absolute right; properties remain family property; not irrevocable settlement; revocable on substantial change in circumstances.",
      "addresses_issue": "i1",
      "key_observation": "Properties allotted under Karar continued to be properties of the family."
    },
    {
      "id": "cr2",
      "text": "Under s.9(1), income from assets remaining property of family deemed family income.",
      "addresses_issue": "i1",
      "key_observation": "Arrangement revocable and benefits family by discharging maintenance obligation."
    },
    {
      "id": "cr3",
      "text": "Test from IT Act s.16(1)(c) cases: If income diverted by overriding charge before reaching assessee, not taxable; if applied to discharge obligation after receipt, taxable.",
      "addresses_issue": "i1",
      "key_observation": "Income reached family and applied to family obligation to maintain juniors."
    },
    {
      "id": "cr4",
      "text": "Income received by family members on behalf of family; legal receipt by family.",
      "addresses_issue": "i1",
      "key_observation": "Not physical receipt but legal concept."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Income from properties put in possession of male members under 1909 Karar continues to be income of the H.U.F. and taxable under s.9(1).",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Raja Bejoy Singh Dudhuria v. Commissioner of Income-tax, Bengal",
      "citation": "1 I.T.R. 135",
      "treatment": "distinguished",
      "relevance": "Overriding charge by court decree diverts income before it becomes assessee's; distinguished as here no such pre-existing charge and parties in joint family."
    },
    {
      "case_name": "P.C. Mullick and anr. Executors v. Commissioner of Income-tax, Bengal",
      "citation": "6 I.T.R. 206",
      "treatment": "followed",
      "relevance": "Payments out of income to discharge obligation after receipt are application, not diversion."
    },
    {
      "case_name": "Commissioner of Income-tax, Bombay City v. Sitaldas Tirathdas",
      "citation": "41 I.T.R. 367",
      "treatment": "followed",
      "relevance": "True test: whether amount never reached assessee as income; diversion before receipt vs. application after."
    },
    {
      "case_name": "Commissioner of Income-tax, Bombay v. Makanji Lalji",
      "citation": "5 I.T.R. 539",
      "treatment": "referred",
      "relevance": "Maintenance to widow of deceased coparcener not deductible from H.U.F. income even if charged by decree."
    }
  ],
  "statutes_cited": [
    {
      "name": "Kerala Agricultural Income-tax Act",
      "sections": [
        "s. 9(1)",
        "s. 60(1)",
        "s. 2(m)"
      ],
      "relevance": "s.9(1) deems income from assets remaining property of settlor/family as family's income; applies to revocable settlements; H.U.F. is 'person'."
    },
    {
      "name": "Indian Income-tax Act, 1922",
      "sections": [
        "s. 16(1)(c)"
      ],
      "relevance": "Similar provision; test of diversion vs. application of income."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court upheld High Court and Tribunal; income from properties allotted to male members under 1909 Karar is income of the H.U.F. and includible in assessee's total agricultural income under s.9(1).",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "the true test is that if the income in question is an income of the assessee, the application of the same being not relevant for determining its assessability, it is assessable in his hands but if it is not his income then it cannot form part of his assessable income.",
      "speaker": "court",
      "significance": "Defines diversion vs. application test."
    },
    {
      "text": "In our opinion, the true test is whether the amount sought to be deducted, in truth, never reached the assessee as his income. Obligations, no doubt, there are in every case, but it is the nature of the obligation which is the decisive fact.",
      "speaker": "court",
      "significance": "Quotes Sitaldas Tirathdas on key test."
    },
    {
      "text": "the decree of the court by charging the appellants whole resources with a specific payment to his step-mother had to that extent diverted his income from him",
      "speaker": "court",
      "significance": "Explains Bejoy Singh diversion."
    }
  ],
  "_case_id": "1971_430",
  "_label": 0,
  "_text_length": 21014,
  "_extracted_at": "2026-02-10T20:16:21.982242"
}