{
  "metadata": {
    "case_name": "Bihar State Board of Religious Trusts v. Mahant of Kamlabari Asthal",
    "case_year": 1967,
    "court": "Supreme Court of India",
    "judges": [
      "Shelat J."
    ],
    "case_number": "Civil Appeal No. 407 of 1967",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The estate known as Kamlabari asthal consists of a temple with Shri Ram, Janki and Laxmanji as presiding deities, buildings and lands.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Gaibi Ramdasji, the founding mahant, received certain lands from the then Maharaja of Darbhanga and other zamindars.",
      "type": "background",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f3",
      "text": "From income of these lands, Gaibi Ramdasji constructed the temple and residential buildings.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Later mahants added to properties by acquisition from income of existing properties.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Respondent is current mahant claiming direct descent from founding mahant Gaibi Ramdasji in line of succession from Guru to Chela.",
      "type": "admitted",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f6",
      "text": "Board tried to enforce Bihar Hindu Religious Trusts Act, 1951 by demanding accounts and particulars from respondent mahant.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "Respondent resisted Board's demand, leading Board to initiate criminal proceedings against respondent.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Respondent filed suit claiming asthal and properties are his personal properties, gifts originally made personally to founding mahant and successors, not religious trusts under S.2(1) of the Act.",
      "type": "material",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f9",
      "text": "Board contended properties are not personal but belong to asthal, public interest shown by public use of temple for darshan, festivals with offerings, feeding sadhus and pilgrims.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f10",
      "text": "Both sides led considerable oral and documentary evidence; oral evidence conflicting on public access, festivals, feeding sadhus.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Respondent did not produce sanads of original grants; Board did not produce Darbhanga Estate records.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Documentary evidence: deeds of gift/nomination by mahants to chelas, sales/purchase/mortgage deeds by mahants, revenue records.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Trial Judge framed issue: Whether temple and properties are personal properties of plaintiff or trust properties under Act 1 of 1951.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "Trial Judge held properties are public religious trust, dismissed suit, relying on mahants being bairagis, sampradaya attracting followers, public dedication presumption, feeding sadhus, festivals, pran pratishtha, deeds describing as asthal properties.",
      "type": "procedural",
      "date": "March 13, 1962",
      "source": "lower_court"
    },
    {
      "id": "f15",
      "text": "Patna High Court on appeal viewed evidence per Supreme Court construction of S.2(1) excluding private trusts, held factors consistent with private religious trust, not public, decreed suit.",
      "type": "procedural",
      "date": "March 13, 1962",
      "source": "lower_court"
    },
    {
      "id": "f16",
      "text": "Temple constructed and deities installed by Gaibi Ramdasji.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f17",
      "text": "Succession to mahantship from guru to chela; public had no voice in selection.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f18",
      "text": "Properties recorded in names of mahants as proprietors, not deities.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f19",
      "text": "Mahants in possession and management; acquired properties in own names, dealt via sales/mortgages without objection.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f20",
      "text": "Mahants were vaishnav bairagis, lifelong celibates.",
      "type": "material",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f21",
      "text": "Sadhus, fakirs, pilgrims fed and sheltered at temple.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f22",
      "text": "Festivals celebrated with public offerings.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f23",
      "text": "Public came for darshan without hindrance.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the temple and properties of Kamlabari asthal are personal properties of the mahant or public religious trusts as defined under S.2(1) of Bihar Hindu Religious Trusts Act, 1951.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Properties belong to asthal, not personal; public interest via unrestricted darshan, festivals with offerings, feeding sadhus/pilgrims; mahants bairagis presuming devotion to asthal; sampradaya propagation; pran pratishtha dedication; deeds describe as asthal properties.",
      "supporting_facts": [
        "f9",
        "f20",
        "f21",
        "f22",
        "f23"
      ],
      "legal_basis": "Bihar Hindu Religious Trusts Act, 1951 S.2(1)"
    },
    {
      "id": "pa2",
      "text": "Adverse inference from mahant's failure to produce sanads.",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Properties are personal, original gifts to founding mahant personally and successors; private endowment, not public trust under S.2(1); succession guru to chela private; properties in mahants' names; no public voice or control.",
      "supporting_facts": [
        "f2",
        "f5",
        "f17",
        "f18",
        "f19"
      ],
      "legal_basis": "Bihar Hindu Religious Trusts Act, 1951 S.2(1); Mahant Ramsaroop Das Ji v. S.P. Sahi"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "S.2(1) covers only public trusts, not private; onus on Board to prove public religious/charitable trust; no adverse inference from missing sanads as Board also couldn't produce records.",
      "addresses_issue": "i1",
      "key_observation": "Private trusts excluded per Mahant Ramsaroop Das Ji v. S.P. Sahi."
    },
    {
      "id": "cr2",
      "text": "Oral evidence unreliable, interested, lacking personal knowledge; no direct evidence of public dedication.",
      "addresses_issue": "i1",
      "key_observation": "Board's witnesses did not depose to explicit dedication."
    },
    {
      "id": "cr3",
      "text": "Mahants celibate, guru-chela descent, feeding sadhus, festivals, public darshan not conclusive of public trust; consistent with private mutt/debutter; public user hazardous inference per precedents.",
      "addresses_issue": "i1",
      "key_observation": "Per Parmanand v. Nihal Chand, descent from guru-chela does not make secular property religious; feeding sadhus part of private worship."
    },
    {
      "id": "cr4",
      "text": "Deeds describing properties as appertaining to asthal mean part of mahant's property, not public trust unless asthal is public.",
      "addresses_issue": "i1",
      "key_observation": "Expression 'appertaining to asthal' not stamping public trust."
    },
    {
      "id": "cr5",
      "text": "Possible private mutt for spiritual family, not public; no evidence of ceremonies like Pratistha/Utsarga proving public dedication; factors like permanent idols, separate construction not conclusive.",
      "addresses_issue": "i1",
      "key_observation": "Distinction between private/public mutt; Puran Atal case inapplicable due to lack of similar evidence."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Properties constitute private religious trust or personal properties, not public religious trust under Bihar Hindu Religious Trusts Act, 1951 S.2(1); Act does not apply.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Mahant Ramsaroop Das Ji v. S. P. Sahi",
      "citation": "1959 Supp. 2 S.C.R. 583",
      "treatment": "followed",
      "relevance": "S.2(1) excludes private religious trusts; only public trusts covered."
    },
    {
      "case_name": "Mahant Ramsaroop Das Ji v. S. P. Sahi",
      "citation": "1955 B.L.J.R. 88",
      "treatment": "reversed",
      "relevance": "High Court decision wrongly included private trusts."
    },
    {
      "case_name": "Parmanand v. Nihal Chand",
      "citation": "1938 I.L.R. 65 I.A. 252",
      "treatment": "followed",
      "relevance": "Celibate mahants, guru-chela descent do not presume religious/public trust; no adverse inference from non-production of sanads."
    },
    {
      "case_name": "Babu Bhagwan Din v. Gir Har Saroop",
      "citation": "67 I.A. 1",
      "treatment": "followed",
      "relevance": "Public user, offerings, mela not enough for public dedication when grant to individual/family; hazardous to infer from user alone."
    },
    {
      "case_name": "Ramsaran Das v. Jai Ram Das",
      "citation": "A.I.R. 1943 Pat. 135",
      "treatment": "referred",
      "relevance": "Feeding sadhus/wayfarers part of private idol worship, not public trust."
    },
    {
      "case_name": "Mahant Puran Atal v. Darshan Das",
      "citation": "1912 I.L.R. 34 All. 468",
      "treatment": "distinguished",
      "relevance": "Declarations and user for specific fakirs supported public trust there; absent here."
    },
    {
      "case_name": "Matam Nadipudi v. Board of Commissioners for Hindu Religious Endowments, Madras",
      "citation": "A.I.R. 1938 Mad. 810",
      "treatment": "referred",
      "relevance": "Recognized private mutts for personal benefit."
    },
    {
      "case_name": "Missir v. Ras",
      "citation": "1949 I.L.R. 28 Pat. 890",
      "treatment": "referred",
      "relevance": "Private mutts exist."
    },
    {
      "case_name": "Deoki Nandan v. Murlidhar",
      "citation": "1956 S.C.R. 756",
      "treatment": "referred",
      "relevance": "Pratistha ceremonies indicate public dedication if proven."
    },
    {
      "case_name": "Sri Thakurji Ramji v. Mathura Prasad",
      "citation": null,
      "treatment": "referred",
      "relevance": "'Appertaining to' means part of principal property."
    }
  ],
  "statutes_cited": [
    {
      "name": "Bihar Hindu Religious Trusts Act, 1951",
      "sections": [
        "S. 2(1)"
      ],
      "relevance": "Defines religious trust as public, excluding private endowments for family idol or Sikh trusts; Act applies only to public trusts."
    },
    {
      "name": "Charitable and Religious Trusts Act, 1920",
      "sections": [],
      "relevance": "Mentioned as similar Act applying to public trusts."
    },
    {
      "name": "Code of Civil Procedure",
      "sections": [
        "S. 92"
      ],
      "relevance": "Public charitable trusts under it."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court upheld Patna High Court decree in favor of respondent mahant, holding properties not public religious trusts under the Act; Board's appeal dismissed.",
    "relief_granted": "Suit decreed for respondent; Act held inapplicable.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "Dedication to the public is not to be readily inferred when it is known that the temple property was acquired by grant to an individual or family.",
      "speaker": "court",
      "significance": "Core principle against presuming public trust from user alone."
    },
    {
      "text": "The mere fact of the public having been freely admitted to that temple cannot mean that courts should readily infer therefrom dedication to the public.",
      "speaker": "court",
      "significance": "Explains why public access does not prove public character."
    },
    {
      "id": "kq3",
      "text": "Provision for the service of the sadhus, occasional guests and wayfarers does not render a trust for an idol into a trust for public purposes.",
      "speaker": "court",
      "significance": "Feeding sadhus consistent with private trust."
    }
  ],
  "_case_id": "1971_87",
  "_label": 0,
  "_text_length": 27145,
  "_extracted_at": "2026-02-10T20:14:17.382688"
}