{
  "metadata": {
    "case_name": "Alloy Steel Project v. Workmen",
    "case_year": 1969,
    "court": "Supreme Court of India",
    "judges": [
      "Bhargava, J."
    ],
    "case_number": "Civil Appeal No. 2128 of 1969",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The appellant, Messrs Alloy Steel Project, is an undertaking owned, controlled and managed by a Government Company, viz., Messrs Hindustan Steel Ltd.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Alloy Steel Project was started in the year 1961 and it went into production in the year 1964-65. No profit was earned at least right up to the year 1967-68.",
      "type": "material",
      "date": "1961",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The workmen claimed bonus at the minimum rate prescribed under the Payment of Bonus Act No. 21 of 1965 in respect of the year 1965-1966 on the plea that this Alloy Steel Project was a part of the Hindustan Steel Ltd. and could not be treated as a new establishment for purposes of section 16 of the Act.",
      "type": "disputed",
      "date": "1965-1966",
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "Hindustan Steel Ltd. was itself an establishment which had been in existence for a long period and had been even earning profits.",
      "type": "admitted",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "The Company resisted the claim on the plea that Alloy Steel Project was a separate establishment in respect of which separate balance-sheets and profit and loss accounts were maintained, so that no bonus was payable until either this Project itself earned profits, or from the sixth accounting year following the year 1964-65.",
      "type": "material",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f6",
      "text": "The dispute could not be resolved amicably and a reference was made under the Industrial Disputes Act, 1947 to the Ninth Industrial Tribunal, West Bengal.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "The Tribunal held that Alloy Steel Project could not be treated as a separate establishment because, under the Act, a Company is itself an establishment, so that all units of a Company like Hindustan Steel Ltd. will constitute one establishment. Directed payment of bonus at the minimum rate of 4 per cent.",
      "type": "procedural",
      "date": "1969-07-19",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Hindustan Steel Ltd. has a number of establishments including Head Office, Rourkela Steel Plant, Bhilai Steel Plant, Durgapur Steel Plant, Coal Washeries Project, Bokaro Steel Project and Alloy Steel Project.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Separate accounts are kept for each separate undertaking. Annual reports for three years indicate separate balance-sheet and profit and loss account for each unit.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Separate bonus calculation is made in respect of each unit and bonus was declared separately in each unit. No bonus declared for Alloy Steel Project due to claim of exemption under section 16.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Consolidated balance-sheet is prepared for the Company in respect of all its units for complying with Companies Act requirements.",
      "type": "background",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether Alloy Steel Project is a separate establishment or part of Hindustan Steel Ltd. for purposes of computation of bonus under the Payment of Bonus Act, 1965, particularly under sections 3 and 16.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the proviso to section 3 applies to treat Alloy Steel Project as a separate establishment given separate balance-sheets and profit and loss accounts.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Applicability of section 16 exemption to newly set up establishments, including new departments or undertakings of existing establishments.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Alloy Steel Project was a separate establishment in respect of which separate balance-sheets and profit and loss accounts were maintained, so that no bonus was payable until either this Project itself earned profits, or from the sixth accounting year following the year 1964-65 when this Project went into production.",
      "supporting_facts": [
        "f2",
        "f5",
        "f9"
      ],
      "legal_basis": "Section 16 of Payment of Bonus Act, 1965; proviso to Section 3"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Alloy Steel Project was a part of Hindustan Steel Ltd. and could not be treated as a new establishment for purposes of section 16; all units constitute one establishment.",
      "supporting_facts": [
        "f1",
        "f3",
        "f4"
      ],
      "legal_basis": "Section 3 of Payment of Bonus Act, 1965"
    },
    {
      "id": "ra2",
      "text": "Proviso to section 3 does not apply to companies; principal part of section 3 applies to treat all departments/undertakings as one establishment; difficulty in allocating paid up capital for separate units under section 6(d) and Third Schedule.",
      "supporting_facts": [
        "f1",
        "f8"
      ],
      "legal_basis": "Sections 3, 6(d), Third Schedule of Payment of Bonus Act, 1965"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The Tribunal committed an error by equating 'establishment' with a 'company'; definitions in section 2(15) and 2(16) show establishment is distinct from a company.",
      "addresses_issue": "i1",
      "key_observation": "An establishment cannot be identified with a company."
    },
    {
      "id": "cr2",
      "text": "Section 3 applies only for computation of bonus; does not affect applicability under section 1(3); separate establishments exist even if under 20 employees in some units.",
      "addresses_issue": "i1",
      "key_observation": "Different departments/undertakings treated as parts only for bonus computation, proviso allows separate treatment if separate accounts maintained."
    },
    {
      "id": "cr3",
      "text": "Separate balance-sheets and profit and loss accounts maintained for Alloy Steel Project; consolidated accounts only for Companies Act compliance.",
      "addresses_issue": "i2",
      "key_observation": "Proviso to section 3 applies; no difficulty in surplus calculation as deductions only if applicable."
    },
    {
      "id": "cr4",
      "text": "Section 16(1) exempts new establishments; applies to new departments/undertakings under section 16(2); proviso to 16(2) not applicable as no consolidated bonus paid to all units.",
      "addresses_issue": "i3",
      "key_observation": "Alloy Steel Project is newly set up, no profits till 1967-68, no bonus for 1965-66."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Alloy Steel Project is a separate establishment newly set up; exempt from bonus payment under section 16(1) for 1965-66.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Proviso to section 3 treats it as separate due to separate accounts.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h3",
      "text": "Section 16 exemption applies even to new undertakings of existing establishments.",
      "resolves_issue": "i3",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Payment of Bonus Act, 1965",
      "sections": [
        "Section 1(3)",
        "Section 2(15)",
        "Section 2(16)",
        "Section 3",
        "Section 6(d)",
        "Section 16",
        "Third Schedule"
      ],
      "relevance": "Defines establishments, treats departments/undertakings for bonus computation, exempts new establishments from bonus for initial years."
    },
    {
      "name": "Companies Act, 1956",
      "sections": [
        "Section 617"
      ],
      "relevance": "Defines Government company; requires consolidated accounts."
    },
    {
      "name": "Industrial Disputes Act, 1947",
      "sections": [],
      "relevance": "Basis for reference to Tribunal."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed, Tribunal's award set aside, reference answered in favour of company; no bonus payable to workmen of Alloy Steel Project for 1965-66.",
    "relief_granted": "Exemption from bonus payment under section 16 confirmed.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"It would be absurd to say that a company is owned, controlled or managed by a Government company or a corporation.\"",
      "speaker": "court",
      "significance": "Distinguishes 'establishment' from 'company' under the Act."
    },
    {
      "text": "\"The Company, Hindustan Steel Ltd., cannot be equated with any one of these units. They are all separate undertakings, departments or branches.\"",
      "speaker": "court",
      "significance": "Establishes separate status of units."
    },
    {
      "id": "kq3",
      "text": "\"No bonus was payable to the workmen of this undertaking for the year 1965-66 in view of the provisions of section 16(1) of the Act.\"",
      "speaker": "court",
      "significance": "Core holding on exemption."
    }
  ],
  "_case_id": "1971_100",
  "_label": 1,
  "_text_length": 20474,
  "_extracted_at": "2026-02-10T20:14:53.820875"
}