{
  "metadata": {
    "case_name": "Assistant Registrar of Companies, West Bengal v. Officers/Directors of Standard Paint Works P Ltd.",
    "case_year": 1968,
    "court": "Supreme Court of India",
    "judges": [
      "Ray, J."
    ],
    "case_number": "Criminal Appeals Nos. 248 to 251 of 1968",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Assistant Registrar of Companies, West Bengal filed complaints before the Chief Presidency Magistrate, Calcutta alleging that certain officers/directors of Standard Paint Works P Ltd. were guilty of offences for non-compliance with provisions contained in the Companies Act, 1956 by reason of default in filing Annual Return of the Company together with the Annual Accounts and Balance Sheet.",
      "type": "material",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f2",
      "text": "Section 210 of the Companies Act requires annual accounts and balance sheet of the company to be filed within the time mentioned in the section. If any person being a director of the company fails to take all reasonable steps to comply with the provisions of section 210, he shall, in respect of each offence, be punishable with imprisonment for a term which may extend to six months, or with fine which may extend to one thousand rupees, or with both.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Complainant prayed for exemption of personal appearance under proviso to section 247 of the Code of Criminal Procedure read with section 621A of the Companies Act.",
      "type": "procedural",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f4",
      "text": "Presidency Magistrate passed orders of acquittal in all the cases on 4 April, 1968.",
      "type": "procedural",
      "date": "1968-04-04",
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "Four petitions of appeal were presented in the High Court on 1 July, 1968 by the learned Advocate authorised by the Vakalatnama executed by the Assistant Registrar of Companies, West Bengal described as the appellant in all the petitions.",
      "type": "procedural",
      "date": "1968-07-01",
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "High Court at Calcutta by judgment dated 13 August, 1968 held that the memorandum of appeals from orders of acquittal were barred by Article 114 of the Limitation Act, 1963.",
      "type": "procedural",
      "date": "1968-08-13",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "No application was made to the High Court in compliance with section 417(3) of the Code of Criminal Procedure for grant of special leave to appeal from the order of acquittal.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the appeals from orders of acquittal were maintainable under section 624B of the Companies Act, 1956, or governed by section 417 of the Code of Criminal Procedure, and whether they were barred by limitation under Article 114 of the Limitation Act, 1963.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The appeals were preferred under section 624B of the Companies Act, 1956.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": "Section 624B of the Companies Act, 1956"
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Section 624B only speaks of the Central Government directing or authorising any person to present an appeal from the order of acquittal. It does not confer any right of appeal from any order passed by a Criminal Court in respect of any offence under the provisions of the Companies Act.",
      "addresses_issue": "i1",
      "key_observation": "The contention on behalf of the appellant that the right of appeal is conferred by section 624B of the Companies Act is unacceptable."
    },
    {
      "id": "cr2",
      "text": "The right to appeal to the High Court in the present cases of acquittal is governed by section 417 of the Code of Criminal Procedure. Appeal is a creature of statute. The right to appeal is governed by the Code of Criminal Procedure.",
      "addresses_issue": "i1",
      "key_observation": "Section 404 of the Code of Criminal Procedure states that no appeal shall lie from any judgment or order of a Criminal Court except as provided for by the Code of Criminal Procedure or by any other law for the time being in force."
    },
    {
      "id": "cr3",
      "text": "Article 114 of the Limitation Act, 1963 requires appeal under sub-section (3) of section 417 of the Code of Criminal Procedure to be filed within 30 days from the date of the grant of special leave. No application for the grant of special leave to appeal from an order of acquittal was made within 60 days from that order of acquittal.",
      "addresses_issue": "i1",
      "key_observation": "The appeals were rightly not entertained by the High Court because first there was no application for grant of special leave under section 417(3) of the Code of Criminal Procedure, secondly, the appeals were incompetent without grant of special leave, and thirdly these were barred by limitation."
    },
    {
      "id": "cr4",
      "text": "Section 624B of the Companies Act empowers the Central Government to present appeals through persons mentioned in that section. Presentation of appeal by the Central Government is a similar provision to section 417(1) of the Code of Criminal Procedure. Section 624B only mentions as to the person through whom appeal is presented.",
      "addresses_issue": "i1",
      "key_observation": "Section 624B is not such a section which can be said to be conferring a right of appeal."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "An appeal under section 417(3) against acquittal is competent only when there is special leave granted by the High Court. On obtaining special leave the appeal is thereafter filed within 30 days of the grant of leave to escape the mischief of the period of limitation under Article 114 of the Limitation Act, 1963.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Companies Act, 1956",
      "sections": [
        "210",
        "247",
        "621A",
        "624B",
        "483"
      ],
      "relevance": "Governs offences for non-filing of returns and accounts; section 624B held not to confer right of appeal from acquittal but only authorizes presentation by certain persons."
    },
    {
      "name": "Code of Criminal Procedure, 1898",
      "sections": [
        "417",
        "404"
      ],
      "relevance": "Governs appeals from acquittal; requires special leave under s.417(3) within 60 days, and appeal within 30 days thereafter."
    },
    {
      "name": "Limitation Act, 1963",
      "sections": [
        "Article 114"
      ],
      "relevance": "Prescribes 30 days limitation for appeal under s.417(3) CrPC from grant of special leave."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeals against the High Court's order holding the memoranda of appeals from acquittal barred by limitation were dismissed, as no special leave under s.417(3) CrPC was obtained, appeals were incompetent, and barred by limitation under Article 114 of Limitation Act, 1963.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The contention on behalf of the appellant that the right of appeal is conferred by section 624B of the Companies Act is unacceptable.",
      "speaker": "court",
      "significance": "Rejects petitioner's main argument on source of right to appeal."
    },
    {
      "text": "Appeal is a creature of statute. The right to appeal is governed by the Code of Criminal Procedure.",
      "speaker": "court",
      "significance": "Core principle applied to deny appeal under Companies Act."
    },
    {
      "text": "The appeals therefore fail and are dismissed.",
      "speaker": "court",
      "significance": "Final disposition of the appeals."
    }
  ],
  "_case_id": "1971_557",
  "_label": 0,
  "_text_length": 6848,
  "_extracted_at": "2026-02-10T20:19:09.786738"
}