{
  "metadata": {
    "case_name": "Food Inspector, Calicut Corporation v. Respondents (Manager and Owner of Tea Stall)",
    "case_year": 1968,
    "court": "Supreme Court of India",
    "judges": [
      "Vaidialingam, J."
    ],
    "case_number": "Criminal Appeal No. 281 of 1968",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "First respondent is Manager and second respondent, his wife, is owner and licensee of tea stall at premises No. 4/777 Customs Road, Calicut.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On November 17, 1965 at about 9.45 A.M., Food Inspector, Calicut Corporation, purchased 600 grams of sugar for 78 paise from first respondent from stock kept in premises for preparation of tea sold to customers.",
      "type": "material",
      "date": "1965-11-17",
      "source": "prosecution"
    },
    {
      "id": "f3",
      "text": "Sugar sampled as per rules in presence of first accused and witnesses; one portion sent to Public Analyst.",
      "type": "procedural",
      "date": "1965-11-17",
      "source": "prosecution"
    },
    {
      "id": "f4",
      "text": "Public Analyst report Ex. P-3 dated December 28, 1965: sample contained saccharin 14.0 mgs per 100 gms equivalent to about seven percent of cane sugar; ash 0.02%; total sugar 96.00% as cane sugar; certified adulterated.",
      "type": "material",
      "date": "1965-12-28",
      "source": "prosecution"
    },
    {
      "id": "f5",
      "text": "Food Inspector filed complaint on March 21, 1966 against both accused in Court of District Magistrate (Judicial), Calicut, alleging offence under S.16(1)(a)(i) PFA Act; referenced prior convictions of first accused.",
      "type": "procedural",
      "date": "1966-03-21",
      "source": "prosecution"
    },
    {
      "id": "f6",
      "text": "Both accused charged under S.16(1)(a)(i) for selling 600 gm adulterated sugar to Food Inspector on November 17, 1965; pleaded not guilty and denied sale.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "District Magistrate findings: sugar is article of food u/s 2(v); purchase and sampling by Food Inspector in compliance with Act; sale as defined; sample adulterated per Analyst; but sugar not kept for sale as such, only for mixing in tea; acquitted both u/s 258 CrPC.",
      "type": "admitted",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "State appealed to Kerala High Court in Criminal Appeal No. 113 of 1968; judgment dated June 26, 1968 confirmed acquittal.",
      "type": "procedural",
      "date": "1968-06-26",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "High Court agreed: sale to Food Inspector under Act; article adulterated; but respondents not selling sugar as such, kept for tea preparation; purchase not under Act for liability.",
      "type": "disputed",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Appellant clarified no desire to convict respondents, only decision on legal point as test case.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f11",
      "text": "On December 12, 1968, Supreme Court directed appellant to deposit Rs.1000 for respondents' costs while granting special leave.",
      "type": "procedural",
      "date": "1968-12-12",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether sale of adulterated article of food (sugar) to Food Inspector for analysis constitutes offence under S.16(1)(a)(i) read with S.7 PFA Act even if accused not dealers in that article as such and kept it only for preparation of tea.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Once there is sale of article of food to Food Inspector for analysis, it is sale under S.2(xiii); no consequence that article not intended to be sold as such; attracts all consequences under Act irrespective of being dealer.",
      "supporting_facts": [
        "f2",
        "f4",
        "f7",
        "f9"
      ],
      "legal_basis": "S.2(xiii), S.7, S.16(1)(a)(i) PFA Act; Mangaldas Raghavji Ruparel v. State of Maharashtra"
    },
    {
      "id": "pa2",
      "text": "Not necessary to establish accused are dealers in article as such when sale to Food Inspector found and article adulterated.",
      "supporting_facts": [
        "f7",
        "f9"
      ],
      "legal_basis": "Municipal Board, Faizabad v. Lal Chand Surajmal; State of Gujarat v. Asandas Kimmatrai; Public Prosecutor v. Palanisami Nadar"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "To make respondents liable, must establish they were dealers in sugar as such; sugar kept only for tea preparation, not for sale; Food Inspector admitted not selling sugar as such.",
      "supporting_facts": [
        "f1",
        "f7",
        "f9"
      ],
      "legal_basis": "S.7, S.16 PFA Act require selling/storing for sale; Food Inspector, Kozhikode v. Punsi Desai; Narain Das v. State; Public Prosecutor v. Kandasamy Reddiar; Re. Govinda Rao"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Sugar is article of food u/s 2(v); sale for analysis is sale u/s 2(xiii); purchase by Food Inspector amounts to sale under Act.",
      "addresses_issue": "i1",
      "key_observation": "Transaction on Nov 17, 1965 is sale under Act; confirmed by both lower courts."
    },
    {
      "id": "cr2",
      "text": "S.7 prohibits selling adulterated food; S.16(1)(a)(i) punishes selling adulterated food; no requirement that accused be dealer as such or article from stock for sale.",
      "addresses_issue": "i1",
      "key_observation": "Food Inspector power u/s 10(1)(a) broad; S.12,14 do not support dealer requirement."
    },
    {
      "id": "cr3",
      "text": "Agree with Municipal Board Faizabad, Public Prosecutor v. Palanisami Nadar: sale to FI of adulterated food article suffices for offence; disagree with contrary views like Re. Govinda Rao for ignoring sale to FI effect.",
      "addresses_issue": "i1",
      "key_observation": "Article need not be from larger quantity for sale; person need not be dealer as such."
    },
    {
      "id": "cr4",
      "text": "Respondents technically guilty as sugar adulterated, sale to FI under Act, contravening S.7 and S.16(1)(a)(i).",
      "addresses_issue": "i1",
      "key_observation": "But as test case, no conviction sought."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Sale to Food Inspector of adulterated article of food constitutes offence u/s 16(1)(a)(i) read with S.7 even if not dealer as such and kept for own use in preparation of other food.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Mangaldas Raghavji Ruparel v. State of Maharashtra",
      "citation": "1965 2 S.C.R. 894",
      "treatment": "followed",
      "relevance": "Sale for analysis specifically included in S.2(xiii) as sale under Act."
    },
    {
      "case_name": "Municipal Board, Faizabad v. Lal Chand Surajmal",
      "citation": "A.I.R. 1964 All. 199",
      "treatment": "followed",
      "relevance": "Sale of adulterated milk from tea shop to FI offence despite not stored for sale as such."
    },
    {
      "case_name": "State of Gujarat v. Asandas Kimmatrai Kevalramanni",
      "citation": "A.I.R. 1964 Guj. 191",
      "treatment": "followed",
      "relevance": "No need accused dealer in dahi or from larger stock for sale; sale to FI of adulterated dahi suffices."
    },
    {
      "case_name": "Public Prosecutor v. Palanisami Nadar",
      "citation": "A.I.R. 1965 Mad. 98",
      "treatment": "followed",
      "relevance": "Sale to FI of adulterated food article makes accused guilty."
    },
    {
      "case_name": "Food Inspector, Kozhikode v. Punsi Desai",
      "citation": "A.I.R. 1959 Kerala 190",
      "treatment": "distinguished",
      "relevance": "Deals with storage for sale; not applicable to sale to FI."
    },
    {
      "case_name": "Narain Das v. State",
      "citation": "A.I.R. 1962 All. 82",
      "treatment": "distinguished",
      "relevance": "Storage for sale issue; distinguished in Municipal Board Faizabad."
    },
    {
      "case_name": "Public Prosecutor v. Kandasamy Reddiar",
      "citation": "A.I.R. 1959 Mad. 333",
      "treatment": "distinguished",
      "relevance": "Milk for own use, not sale to FI effect considered."
    },
    {
      "case_name": "Re. Govinda Rao",
      "citation": "A.I.R. 1960 Andhra Pradesh 366",
      "treatment": "doubted",
      "relevance": "Acquitted hotelier for ghee not for sale as such; ignores sale to FI effect."
    }
  ],
  "statutes_cited": [
    {
      "name": "Prevention of Food Adulteration Act, 1954",
      "sections": [
        "S.2(v)",
        "S.2(xiii)",
        "S.2(i)",
        "S.4(2)",
        "S.7",
        "S.10(1)(a)",
        "S.12",
        "S.14",
        "S.16(1)(a)(i)",
        "S.23(1)"
      ],
      "relevance": "Defines food, sale (includes for analysis), prohibits sale of adulterated food, empowers FI to sample, punishes offence."
    },
    {
      "name": "Prevention of Food Adulteration Rules, 1955",
      "sections": [
        "Rule 5",
        "Appendix B Item A.07.01"
      ],
      "relevance": "Standards for cane sugar; sample non-conforming, hence adulterated."
    },
    {
      "name": "Code of Criminal Procedure",
      "sections": [
        "S.258"
      ],
      "relevance": "District Magistrate acquitted accused under this."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; judgments of Kerala High Court (June 26, 1968) and District Magistrate set aside; held respondents technically guilty but acquittal not disturbed as test case with no conviction sought; respondents entitled to withdraw Rs.1000 deposited for costs and counsel fee, surplus to appellant.",
    "relief_granted": "Legal point decided in favour of appellant; costs to respondents from deposit.",
    "costs": "Rs.1000 deposited by appellant for respondents' costs and counsel fee; surplus refunded to appellant."
  },
  "key_quotes": [
    {
      "text": "'when once the article of food is sold to the Food Inspector for analysis, it is of no consequence that the said article was not intended to be sold as such by the accused'",
      "speaker": "petitioner_counsel",
      "significance": "Core argument of appellant on effect of sale to FI."
    },
    {
      "text": "'the person from whom the article of food has been purchased by the Food Inspector need not be a dealer as such in that article.'",
      "speaker": "court",
      "significance": "Key holding rejecting dealer requirement."
    },
    {
      "text": "'Hence it must be held that the respondents are technically guilty of the offence with which they were charged and they have been wrongly acquitted by the High Court and the District Magistrate.'",
      "speaker": "court",
      "significance": "Court's determination on guilt despite no conviction."
    }
  ],
  "_case_id": "1971_228",
  "_label": 1,
  "_text_length": 23184,
  "_extracted_at": "2026-02-10T20:15:37.207866"
}