{
  "metadata": {
    "case_name": "Appellant v. Respondent",
    "case_year": 1967,
    "court": "Supreme Court of India",
    "judges": [
      "Shah, C.J."
    ],
    "case_number": "Civil Appeal No. 646 of 1967",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "On October 5, 1960 the appellant agreed to do certain construction work for the respondent on the terms and conditions of a written tender.",
      "type": "material",
      "date": "1960-10-05",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Clauses 12 and 13 of the tender provided: In the event of any dispute arising out of this sub-contract, the parties agree to refer to arbitration by two Arbitrators under the Arbitration Act of 1940; the Contract shall be deemed to have been entered into in the City of Bombay and the Courts of law in the City of Bombay alone shall have jurisdiction to adjudicate thereon.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Disputes arose between the parties.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The appellant submitted a petition to the Court of the Subordinate Judge at Varanasi under s. 20 of the Indian Arbitration Act 1940 for filing the agreement and reference to an Arbitrator or Arbitrators appointed by the Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The respondent contended that Civil Courts in Bombay alone had jurisdiction per cl. 13.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f6",
      "text": "The Trial Judge (Subordinate Judge) rejected the contention, observing that cl. 13 has no meaning unless the contract is actually entered into in Bombay, no evidence thereof, entire cause of action arose at Varanasi, and parties could not confer jurisdiction on Bombay Courts by agreement.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Allahabad High Court in Civil Revision No. 721 of 1964, by judgment dated December 1, 1966, set aside the order, declared Bombay Courts had jurisdiction under general law and cl. 13 binding, ordered petition returned for presentation to proper Court.",
      "type": "procedural",
      "date": "1966-12-01",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Appellant appealed to Supreme Court by special leave.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Respondent has principal office in Bombay.",
      "type": "background",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the Courts at Varanasi or only the Courts at Bombay have jurisdiction to entertain the petition under s. 20 of the Arbitration Act given cl. 13 of the agreement.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Condition in cl. 13 that the contract shall be deemed entered into in Bombay has no meaning unless actually entered into there, no evidence thereof.",
      "supporting_facts": [
        "f2",
        "f6"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Entire cause of action arose at Varanasi, parties could not by agreement confer jurisdiction on Bombay Courts which they did not otherwise possess.",
      "supporting_facts": [
        "f4",
        "f6"
      ],
      "legal_basis": "Code of Civil Procedure"
    },
    {
      "id": "pa3",
      "text": "Merely because respondent carries on business in Bombay, Courts there not invested with jurisdiction for filing arbitration agreement.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": "Section 20 CPC; Explanation II refers only to statutory corporation, not company under Companies Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Civil Courts in Bombay alone had jurisdiction per terms contained in cl. 13.",
      "supporting_facts": [
        "f2",
        "f5"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Section 41 of Arbitration Act provides CPC applies to all proceedings before the Court; jurisdiction governed by CPC.",
      "addresses_issue": "i1",
      "key_observation": "Code of Civil Procedure in its entirety applies to proceedings under the Arbitration Act."
    },
    {
      "id": "cr2",
      "text": "By cl. 13, contract expressly stipulated to be deemed entered into in City of Bombay; respondent liable in Bombay per s.20(a) CPC as principal office there.",
      "addresses_issue": "i1",
      "key_observation": "Respondent have their principal office in Bombay and were liable in respect of cause of action arising under the terms of the tender to be sued in Courts at Bombay."
    },
    {
      "id": "cr3",
      "text": "Parties cannot confer jurisdiction on a Court which it does not possess under CPC, but where two or more Courts have jurisdiction, agreement to try in one is not contrary to public policy or s.28 Contract Act.",
      "addresses_issue": "i1",
      "key_observation": "Such an agreement does not contravene s. 28 of the Contract Act."
    },
    {
      "id": "cr4",
      "text": "S.20 CPC: suit where defendant carries on business or cause of action arises; Expl.II: corporation deemed to carry on business at principal office.",
      "addresses_issue": "i1",
      "key_observation": "Respondent Company liable to be sued at Bombay where principal place of business."
    },
    {
      "id": "cr5",
      "text": "'Corporation' in CPC includes company registered under Indian Companies Act, not only statutory corporation; Order 29 deals with suits by/against corporations.",
      "addresses_issue": "i1",
      "key_observation": "The Code of Civil Procedure uses the expression 'corporation' as meaning a legal person and includes a company registered under the Indian Companies Act."
    },
    {
      "id": "cr6",
      "text": "Application under s.20 Arbitration Act could be filed in Bombay Courts per cl.13 and principal office, so agreement binding.",
      "addresses_issue": "i1",
      "key_observation": "The agreement between the parties that the Courts in Bombay alone shall have jurisdiction to try the proceeding relating to arbitration was binding between them."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Courts in Bombay had jurisdiction under general law (CPC s.20) and by virtue of cl.13, which is binding; Varanasi Courts cannot entertain the petition.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Arbitration Act, 1940",
      "sections": [
        "Section 20",
        "Section 41"
      ],
      "relevance": "Governs filing of agreement and reference to arbitration; CPC applies to proceedings"
    },
    {
      "name": "Code of Civil Procedure, 1908",
      "sections": [
        "Section 20",
        "Explanation II",
        "Order 29"
      ],
      "relevance": "Determines jurisdiction: defendant at principal office; applies to arbitration proceedings"
    },
    {
      "name": "Indian Contract Act",
      "sections": [
        "Section 28"
      ],
      "relevance": "Agreement selecting jurisdiction among competent Courts does not contravene"
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court upheld the Allahabad High Court's order setting aside the Subordinate Judge's decision and directing that the petition under s.20 Arbitration Act be returned for presentation to the proper Court in Bombay, as the jurisdiction agreement in cl.13 is binding.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"It is not open to the parties by agreement to confer by their agreement jurisdiction on a Court which it does not possess under the Code. But where two Courts or more have under the Code of Civil Procedure jurisdiction to try a suit or proceeding an agreement between the parties that the dispute between them shall be tried in one of such Courts is not contrary to public policy.\"",
      "speaker": "court",
      "significance": "Core holding on validity of jurisdiction selection clauses"
    },
    {
      "text": "\"The Code of Civil Procedure uses the expression 'corporation' as meaning a legal person and includes a company registered under the Indian Companies Act.\"",
      "speaker": "court",
      "significance": "Interprets 'corporation' in CPC s.20 Expl.II to include private companies"
    }
  ],
  "_case_id": "1971_2",
  "_label": 0,
  "_text_length": 6741,
  "_extracted_at": "2026-02-10T20:14:11.561661"
}