{
  "metadata": {
    "case_name": "Union of India v. Tarachand Gupta Bros.",
    "case_year": 1967,
    "court": "Supreme Court of India",
    "judges": [
      "Shelat, J."
    ],
    "case_number": "Civil Appeal No. 344 of 1967",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Respondents held an import licence dated July 10, 1956 permitting them to import parts and accessories of motor cycles and scooters as per appendix XXVI of the Import Policy Book for July-December 1956, under entry 295.",
      "type": "background",
      "date": "1956-07-10",
      "source": "respondent"
    },
    {
      "id": "f2",
      "text": "Respondents imported certain goods which arrived in two consignments, each containing 17 cases, by two different ships.",
      "type": "material",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f3",
      "text": "Customs authorities held, on examination, that the goods constituted 51 sets of Rixe Mopeds complete except tyres, tubes and saddles in a knocked down condition.",
      "type": "disputed",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Deputy Collector of Customs held enquiry pursuant to two show cause notices and passed order dated November 19, 1957 directing confiscation of the goods with option to pay certain sums in lieu of confiscation and personal penalties.",
      "type": "procedural",
      "date": "1957-11-19",
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "Deputy Collector's order based on classification of goods under entry 294 (motor cycles and scooters) rather than entry 295 (parts and accessories); rejected viewing consignments separately and argument of incompleteness due to absence of tyres, tubes, saddles.",
      "type": "material",
      "date": "1957-11-19",
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "Respondents filed suit in Bombay High Court against the Deputy Collector's order.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f7",
      "text": "Trial Judge held suit time-barred under Art. 14 of Limitation Act, 1908; dismissed suit relying on Secretary of State v. Mask Co.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "In similar matter, Division Bench of Bombay High Court in D.P. Anand v. M/s. M. Thakore Co. held Collector's approach wrong; jurisdiction limited to whether goods were spare parts under entry 295.",
      "type": "background",
      "date": "1960-08-17",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Letters Patent Bench of Bombay High Court reversed Trial Judge on July 8, 1966; held Collector erred on merits, exceeded jurisdiction by lumping consignments, suit under Art. 62 Limitation Act within time.",
      "type": "procedural",
      "date": "1966-07-08",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Appeal to Supreme Court by certificate from High Court judgment.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the Deputy Collector of Customs exceeded his jurisdiction by considering whether parts imported under entry 295, when assembled, constituted motor cycles/scooters in CKD condition under entry 294.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether a suit lies in civil court against the Collector's order, or if it is final under Sea Customs Act, and applicable limitation article.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Sea Customs Act vested authority in Collector to decide whether goods fell within entry 295; decision final subject to appeal/revision; suit lies only if non-compliance with Act or failure of judicial procedure.",
      "supporting_facts": [
        "f4",
        "f5"
      ],
      "legal_basis": "Sea Customs Act s.188; Secretary of State v. Mask Co."
    },
    {
      "id": "pa2",
      "text": "Case of importing Rixe Mopeds in CKD condition by misusing licence; importer doing indirectly what could not do directly.",
      "supporting_facts": [
        "f3",
        "f5"
      ],
      "legal_basis": "Imports and Exports Control Act s.3; Import Control Order cl.3; Girdharilal Bansidhar v. Union of India"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Goods were motor cycle parts authorised under licence/entry 295; two consignments arrived separately on different dates, to be viewed separately; incomplete without tyres, tubes, saddles.",
      "supporting_facts": [
        "f1",
        "f2",
        "f5"
      ],
      "legal_basis": "Entry 295 Import Policy; D.P. Anand v. M/s. M. Thakore Co."
    },
    {
      "id": "ra2",
      "text": "Collector's jurisdiction limited to ascertaining if goods were parts/accessories under entry 295; lumping consignments and considering assembly into CKD vehicles exceeded jurisdiction.",
      "supporting_facts": [
        "f4",
        "f5"
      ],
      "legal_basis": "Sea Customs Act s.167(8)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Entry 294 deals with complete/assembled motor cycles/scooters and CKD for approved manufacturers; remark ii prohibits CKD under entry 294 licence. Entry 295 permits parts/accessories without such restriction.",
      "addresses_issue": "i1",
      "key_observation": "No restriction in entry 295 against importing parts that could assemble into CKD vehicles; absence of tyres/tubes/saddles confirms not CKD."
    },
    {
      "id": "cr2",
      "text": "Collector erred by lumping two consignments and applying entry 294 restriction to entry 295 imports; this inserts non-existent restriction into entry 295, exceeding jurisdiction and non-compliance with statute.",
      "addresses_issue": "i1",
      "key_observation": "Collector's role: check if goods are parts/accessories under entry 295, not if they form CKD vehicles."
    },
    {
      "id": "cr3",
      "text": "Order is nullity as determination considering extraneous factors (entry 294 remark); civil court jurisdiction not excluded; suit under Art. 62 Limitation Act, not time-barred.",
      "addresses_issue": "i2",
      "key_observation": "Exceptions to finality: non-compliance with statute or breach of judicial procedure principles."
    },
    {
      "id": "cr4",
      "text": "Distinguishes Girdharilal Bansidhar (prohibited article components vs. permitted parts); follows D.P. Anand.",
      "addresses_issue": "i1",
      "key_observation": "Not choice between competing entries but misapplication beyond entry 295."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Collector's order exceeded jurisdiction by applying entry 294 restrictions to entry 295 goods; nullity, amenable to suit.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Civil court suit maintainable; not barred by limitation under Art. 14 as order nullity; Art. 62 applies.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Secretary of State v. Mask Co.",
      "citation": "1940 67 I.A. 222",
      "treatment": "followed",
      "relevance": "Suit against statutory tribunal order only for non-compliance with Act or breach of judicial procedure."
    },
    {
      "case_name": "D.P. Anand v. M/s. M. Thakore Co.",
      "citation": "Civil Appeal No. 4 of 1959, decided on August 17, 1960",
      "treatment": "followed",
      "relevance": "Collector's jurisdiction limited to whether goods are spare parts under entry 295; not to check if they form CKD vehicles."
    },
    {
      "case_name": "Girdharilal Bansidhar v. Union of India",
      "citation": "1964 7 S.C.R. 62",
      "treatment": "distinguished",
      "relevance": "High Court not to interfere with classification between entries; importing components of prohibited article is prohibited import."
    },
    {
      "case_name": "Firm Illuri Subbayya Chetty Sons v. Andhra Pradesh",
      "citation": "1964 1 S.C.R. 752",
      "treatment": "followed",
      "relevance": "Erroneous assessment within jurisdiction not non-compliance; finality excludes civil suit."
    },
    {
      "case_name": "Dhulabhai v. Madhya Pradesh",
      "citation": "1968 3 S.C.R. 662",
      "treatment": "referred",
      "relevance": "Finality excludes civil courts if adequate remedy; Mask Co. for non-compliance."
    },
    {
      "case_name": "Panthulu v. Andhra Pradesh",
      "citation": "1970 2 S.C.R. 714",
      "treatment": "followed",
      "relevance": "Determination on irrelevant evidence breaches judicial procedure; outside jurisdiction."
    },
    {
      "case_name": "Anisminic Ltd. v. Foreign Compensation Commission",
      "citation": "1969 1 All E.R. 208",
      "treatment": "referred",
      "relevance": "Tribunal decision null if considers extraneous matters or misconstrues provisions."
    },
    {
      "case_name": "R. v. Fulham, Hammersmith and Kensington Rent Tribunal",
      "citation": "1953 2 All E.R. 4",
      "treatment": "referred",
      "relevance": "Order in excess of jurisdiction is nullity."
    },
    {
      "case_name": "A. Venkata Subba Rao v. Andhra Pradesh",
      "citation": "1965 2 S.C.R. 577",
      "treatment": "followed",
      "relevance": "Nullity suit not requires setting aside; Art. 62 Limitation applies."
    }
  ],
  "statutes_cited": [
    {
      "name": "Imports and Exports (Control) Act, 1947",
      "sections": [
        "Section 3"
      ],
      "relevance": "Central Govt. order prohibits/restricts imports; goods deemed prohibited under Sea Customs Act."
    },
    {
      "name": "Sea Customs Act, 1878",
      "sections": [
        "Section 167(8)",
        "Section 188",
        "Section 191"
      ],
      "relevance": "Confiscation for prohibited imports; orders final subject to revision; jurisdiction exclusion analysis."
    },
    {
      "name": "Imports (Control) Order, 1955",
      "sections": [
        "Clause 3",
        "Clause 3(2)",
        "Schedule I Part IV Entries 294, 295",
        "Schedule I Part V Entry 41"
      ],
      "relevance": "No import without licence; non-conforming goods licence utilized; specific entries for vehicles/parts."
    },
    {
      "name": "Limitation Act, 1908",
      "sections": [
        "Article 14",
        "Article 62"
      ],
      "relevance": "Limitation for suits to set aside orders (Art.14) vs. nullity suits (Art.62)."
    },
    {
      "name": "Madras Estates Land (Reduction of Rent) Act, 1947",
      "sections": [
        "Section 3(2)",
        "Section 8(1)"
      ],
      "relevance": "Illustrates non-compliance by irrelevant evidence."
    },
    {
      "name": "Madras General Sales Tax Act, 1939",
      "sections": [
        "Section 18A"
      ],
      "relevance": "Erroneous assessment within jurisdiction."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court upheld Bombay High Court Division Bench; declared Deputy Collector's order nullity for exceeding jurisdiction by misapplying entries; suit maintainable and within time; appeal dismissed.",
    "relief_granted": "High Court judgment restored; respondents' suit succeeds against customs order.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The only question, therefore, before the Collector was whether the respondents licence covered the goods imported by them, i.e., whether the goods were parts and accessories.",
      "speaker": "court",
      "significance": "Defines scope of Collector's jurisdiction under entry 295."
    },
    {
      "text": "Such an approach would mean that he was inserting in entry 295 a restriction which was not there. That obviously he had no power to do.",
      "speaker": "court",
      "significance": "Explains excess of jurisdiction."
    },
    {
      "text": "A determination, which takes into consideration factors which the officer has no right to take into account, is no determination.",
      "speaker": "court",
      "significance": "Nullity of order considering extraneous factors."
    }
  ],
  "_case_id": "1971_1",
  "_label": 0,
  "_text_length": 39267,
  "_extracted_at": "2026-02-10T20:14:18.987535"
}