{
  "metadata": {
    "case_name": null,
    "case_year": 1968,
    "court": "Supreme Court of India",
    "judges": [
      "Sikri C.J."
    ],
    "case_number": "Civil Appeal No. 7 of 1968",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "On scrutiny of the records for the year of account relevant to the assessment year 1955-56 it has been noticed that the Company did not declare any dividends at its general meeting, even though there were sufficient profits available for doing so and that there were no losses incurred in the earlier years.",
      "type": "material",
      "date": null,
      "source": "income-tax_officer"
    },
    {
      "id": "f2",
      "text": "During the relevant period the Company was one in which the public were not substantially interested in terms of sub-section (9) of section 23A.",
      "type": "material",
      "date": null,
      "source": "income-tax_officer"
    },
    {
      "id": "f3",
      "text": "Income-tax Officer concluded that the provisions of Section 23A are applicable and the Company is liable to pay additional Super-Tax as per provisions of law. Called upon the Company to show cause in writing why an order under section 23A be not passed. Order dated May 13, 1964.",
      "type": "procedural",
      "date": "1964-05-13",
      "source": "income-tax_officer"
    },
    {
      "id": "f4",
      "text": "The appellant company protested that an order under S. 23A would be an order of assessment or reassessment within S. 34 of the Indian Income Tax Act, 1922, and therefore would be barred.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "Application under Art. 226 of the Constitution made by the appellant dismissed by B. C. Mitra, J.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "Appeal from the judgment of B. C. Mitra, J. dismissed by Division Bench of Calcutta High Court (D. N. Sinha, J., and A. K. Mukerjee, J.) following decision in M. M. Parikh v. Navanagar Transport Industries. Judgment dated February 23, 1967 in Appeal No. 195 of 1966.",
      "type": "procedural",
      "date": "1967-02-23",
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "A Bench of five Judges gave special leave.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "A Division Bench of this Court (Hegde and Grover, JJ.) has referred the case to a larger Bench.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether an order under section 23A of the Indian Income-tax Act, 1922, as amended by the Finance Acts of 1955 and 1957, made by the Income-tax Officer directing payment of additional super-tax is an order of assessment within the meaning of s. 34 of the Act, and to such an order the period of limitation prescribed under section 34 does not apply.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The judgment in M. M. Parikh case was clearly erroneous and it should be overruled.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": "Section 34 of Indian Income Tax Act, 1922"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "This Court should decline to review its earlier judgment because it cannot be said that the earlier decision was clearly erroneous.",
      "supporting_facts": [],
      "legal_basis": "Keshav Mills v. Commissioner of Income-tax, Bombay"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Observations in Keshav Mills v. CIT binding: Court must introduce certainty and continuity; hesitate to review unless clearly erroneous with unanimity; consider if patent aspects unnoticed, relevant provisions or precedents not noticed.",
      "addresses_issue": "i1",
      "key_observation": "Mr. Chagla was not able to show any vital point not considered or convince that judgment clearly erroneous."
    },
    {
      "id": "cr2",
      "text": "This point is not likely to arise under the Income-tax Act, 1961, as s. 106 thereof specifically provides a period of limitation regarding orders under s. 104, equivalent to s. 23A.",
      "addresses_issue": "i1",
      "key_observation": "Decline to review the case."
    },
    {
      "id": "cr3",
      "text": "Additional point not noticed earlier: words 'after the expiry of four years from the end of the year in which the income, profits or gains were first assessable' in S. 34(3) not apposite to order under s. 23A, as it does not assess income but levies super tax on portion of undistributed profits already assessed; taxable event is non-distribution following expiry of previous year.",
      "addresses_issue": "i1",
      "key_observation": "Tends to show the case was correctly decided."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "An order under section 23A is not an order of assessment or reassessment within s. 34; period of limitation under s. 34 does not apply.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Decline to review or overrule M. M. Parikh v. Navanagar Transport Industries.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "M. M. Parikh v. Navanagar Transport Industries",
      "citation": "63 I.T.R. 663",
      "treatment": "followed",
      "relevance": "Held that order u/s 23A not assessment u/s 34, limitation not apply; declined to overrule"
    },
    {
      "case_name": "Keshav Mills v. Commissioner of Income-tax, Bombay",
      "citation": "1965 2 S.C.R. 908, 921",
      "treatment": "followed",
      "relevance": "Principles for reviewing earlier decisions of the Court"
    },
    {
      "case_name": "Navanagar Industries Ltd. v. Income-tax Officer, Special Investigation Circle, Ahmedabad",
      "citation": null,
      "treatment": "referred",
      "relevance": "Judgment of High Court of Gujarat appealed from in Parikh case; point not noticed earlier supports correctness"
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act, 1922",
      "sections": [
        "Section 23A",
        "Section 34"
      ],
      "relevance": "Order u/s 23A directing additional super-tax not assessment/reassessment u/s 34 subject to limitation"
    },
    {
      "name": "Income-tax Act, 1961",
      "sections": [
        "Section 104",
        "Section 106"
      ],
      "relevance": "S.104 equivalent to s.23A(1922); s.106 provides limitation for such orders"
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 226"
      ],
      "relevance": "Application under Art.226 dismissed"
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal by special leave against the Calcutta High Court judgment dismissing the appeal from dismissal of writ petition under Art.226 is dismissed. Court declines to review or overrule M.M. Parikh, holding s.23A order not subject to s.34 limitation.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"When this Court decides questions of law, its decisions are, under art. 141, binding on all courts within the territory of India, and so, it must be the constant endeavor and concern of this Court to introduce and maintain an element of certainty and continuity in the interpretation of law in the country.\"",
      "speaker": "court",
      "significance": "From Keshav Mills, guiding principles against frequent review"
    },
    {
      "text": "In our view an order under S. 23A does not assess income, profits or gains as such but what it does is to levy super tax on a certain portion of the undistributed profits and gains.",
      "speaker": "court",
      "significance": "Key reasoning why s.34 limitation not applicable"
    }
  ],
  "_case_id": "1971_649",
  "_label": 0,
  "_text_length": 7076,
  "_extracted_at": "2026-02-10T20:20:00.080957"
}