{
  "metadata": {
    "case_name": "State of Madhya Pradesh v. Chhotabhai Jethabhai Patel",
    "case_year": 1968,
    "court": "Supreme Court of India",
    "judges": [
      "Mitter, J."
    ],
    "case_number": "Civil Appeal No. 684 of 1968",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Chhotabhai Jethabhai Patel, a partnership firm of which the second respondent, Jhaverbhai Bhulabhai Patel is a partner, carried on business as manufacturers of bidis at various places in the State of Madhya Pradesh including Saugor.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The firm took leases for the collection of tendu leaves in the States of Bihar and Maharashtra and actually imported tendu leaves under two railway consignments from Bihar to Saugor.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The firm informed the Divisional Forest Officer about the importation and asked for permission for transport of the leaves and to utilise the said leaves for manufacture of bidis in their factories.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f4",
      "text": "By letter dated July 27, 1965 the Divisional Forest Officer intimated the firm that the imported leaves were not to be moved for bidi manufacture until permission was accorded for so doing.",
      "type": "procedural",
      "date": "1965-07-27",
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "Notwithstanding the above communication and in spite of the fact that they had not moved the imported leaves from their godowns, the Sub Divisional Forest Officer Saugor seized two quantities of such leaves of 9007 bags imported from Garwah Road, Bihar and 256 bags of tendu leaves imported from Bindoumaganj, Bihar.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The Sub Divisional Forest Officer filed a complaint alleging contravention of s. 5 of the Madhya Pradesh Tendu Patta Vyapar Viniyaman Adhiniyam, 1964.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "The respondents filed a petition under Art. 226 of the Constitution before the Madhya Pradesh High Court for the issue of a writ of certiorari quashing the complaint.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "The High Court quashed the proceedings initiated on the complaint filed by the Divisional Forest Officer.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the Madhya Pradesh Tendu Patta Vyapar Viniyaman Adhiniyam, 1964 prohibits the import of tendu leaves from places outside the State or restricts their transport within the State for manufacture of bidis.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether regulation and control of transport of imported tendu leaves is necessary for the successful working of the State monopoly in the trade of tendu leaves.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether the Act or its provisions violate Articles 31, 301 and 304 of the Constitution.",
      "framed_by": "respondent"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Transport of tendu leaves whether grown in the State or outside the State was completely prohibited by s. 5(2) of the Act and regulation and control of transport of such imported leaves was necessary for the successful working of the State monopoly in the trade of tendu leaves envisaged by the Act.",
      "supporting_facts": [
        "f2",
        "f5"
      ],
      "legal_basis": "Section 5(2) of the Madhya Pradesh Tendu Patta Vyapar Viniyaman Adhiniyam, 1964"
    },
    {
      "id": "pa2",
      "text": "The Act did not prohibit the import of tendu leaves and was not therefore violative of Arts. 31, 301 and 304 of the Constitution and the control of movement of tendu leaves after their import from another State was in no way repugnant to Arts. 301 and 304.",
      "supporting_facts": [],
      "legal_basis": "Articles 31, 301, 304 of the Constitution"
    },
    {
      "id": "pa3",
      "text": "The embargo on purchase and transport of tendu leaves by s. 5 was necessary for creation and preservation of the State monopoly in tendu leaves. There was nothing in the Act which showed that tendu leaves mentioned were confined to leaves grown in the State. Unless the State had the power to check the purchase of tendu leaves from outside the State and to restrict the transport thereof within the State, the monopoly would not be effective.",
      "supporting_facts": [],
      "legal_basis": "Section 5 of the Act"
    },
    {
      "id": "pa4",
      "text": "Transport of goods within the State was so essentially integrated with the trade in the goods that the restriction on transport should be upheld in the interest of the State monopoly.",
      "supporting_facts": [],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The Act did not prohibit the import of tendu leaves from places outside the State nor was there any restriction on a manufacturer importing such leaves with the express object of consumption of the same, in his factory for the manufacture of bidis and in any event the Act or the Rules made thereunder did not purport to regulate the transport of tendu leaves imported from places outside the State.",
      "supporting_facts": [
        "f2",
        "f3"
      ],
      "legal_basis": "Madhya Pradesh Tendu Patta Vyapar Viniyaman Adhiniyam, 1964 and Rules"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "All the relevant provisions of the Act and the rules show that the legislature intended that everybody growing leaves within the State should offer the same to it or its agents and the State was bound to purchase every single lot unless unfit. The entire provisions of the Act and the rules are consistent with and aim at the State monopoly in the trade of tendu leaves in case of leaves grown or produced in the State.",
      "addresses_issue": "i1",
      "key_observation": "The legislature never intended that the monopoly should be operative even to the extent of banning import of tendu leaves from outside or stalling the tendu leaves once they found their way into the State from outside."
    },
    {
      "id": "cr2",
      "text": "Transport of tendu leaves purchased outside but consigned to places within the State to be used for the manufacture of bidis is not integrally connected with the State monopoly as envisaged in the Act.",
      "addresses_issue": "i2",
      "key_observation": "Prima facie trade in tendu leaves would consist of dealing in those leaves i.e. their purchase and sale but transport of the leaves once purchased or sold would not prima facie be an organic or integral part of dealing in those leaves."
    },
    {
      "id": "cr3",
      "text": "The Act ought not to be construed so as to ban import of tendu leaves from outside the State or restrict their movement once they were within the State unless clear language was used in that behalf.",
      "addresses_issue": "i1",
      "key_observation": "Where two constructions of a legislative provision are possible one consistent with the constitutionality of the measure impugned and the other offending the same, the Court will lean towards the first."
    },
    {
      "id": "cr4",
      "text": "If s. 5 of the Act or any of its provisions were to be construed as prohibiting the import of tendu leaves into the State or restricting within the State of imported leaves, then the provision would clearly be invalid as violative of Arts. 301 and 304 of the Constitution.",
      "addresses_issue": "i3",
      "key_observation": "Without expressing our views on the subject."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The action of the Forest Officer was not justified as the provisions of the Act apply only to tendu leaves grown within the State and do not regulate import or transport of leaves from outside the State.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "The High Court was correct in quashing the complaint.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Vrajlal Manilal v. M. P. State",
      "citation": "1970 1 S.C.R. 400",
      "treatment": "followed",
      "relevance": "Trade in tendu leaves consists of purchase and sale; transport once purchased not integral. Permit system up to certain stage reasonable but further restrictions unreasonable."
    },
    {
      "case_name": "Akadasi Padhan v. State of Orissa",
      "citation": "1963 Supp. 2 S.C.R. 691",
      "treatment": "followed",
      "relevance": "Law relating to State monopoly protects only essential provisions for creating monopoly under Art. 19(6); subsidiary provisions judged separately."
    }
  ],
  "statutes_cited": [
    {
      "name": "Madhya Pradesh Tendu Patta Vyapar Viniyaman Adhiniyam, 1964",
      "sections": [
        "Section 1",
        "Section 2(h)",
        "Section 3",
        "Section 4",
        "Section 5",
        "Section 7",
        "Section 9",
        "Section 11",
        "Section 12",
        "Section 15",
        "Section 19"
      ],
      "relevance": "Regulates trade in tendu leaves grown in the State by creating monopoly; s.5 restricts purchase and transport to government, officers, agents for leaves grown in units."
    },
    {
      "name": "Rules under the Madhya Pradesh Tendu Patta Vyapar Viniyaman Adhiniyam, 1964",
      "sections": [
        "Rule 4",
        "Rule 9",
        "Form M",
        "Form N"
      ],
      "relevance": "Prescribe types of transport permits for leaves within the State monopoly system."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 226",
        "Article 19(6)",
        "Article 31",
        "Article 301",
        "Article 304",
        "Part XIII"
      ],
      "relevance": "Art.226 for writ petition; Arts.301,304 on freedom of trade; Art.19(6) on monopoly laws; potential violation if extended to imports."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal from the judgment of the Madhya Pradesh High Court quashing the proceedings on the complaint under s.5 of the Act is dismissed, upholding that the Act does not apply to imported tendu leaves from outside the State.",
    "relief_granted": "Proceedings quashed by High Court upheld",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "the legislature never intended that the monopoly should be operative even to the extent of banning import of tendu leaves from outside or stalling the tendu leaves once they found their way into the State from outside.",
      "speaker": "court",
      "significance": "Core holding limiting scope of the Act to in-State grown leaves."
    },
    {
      "text": "Transport of tendu leaves purchased outside but consigned to places within the State to be used for the manufacture of bidis is not integrally connected with the State monopoly as envisaged in the Act.",
      "speaker": "court",
      "significance": "Rejects State's argument on necessity of control over imports for monopoly."
    },
    {
      "text": "Prima facie trade in tendu leaves would consist of dealing in those leaves i.e. their purchase and sale but transport of the leaves once purchased or sold would not prima facie be an organic or integral part of dealing in those leaves.",
      "speaker": "court",
      "significance": "Distinguishes trade from transport, citing precedent."
    }
  ],
  "_case_id": "1971_624",
  "_label": 0,
  "_text_length": 14293,
  "_extracted_at": "2026-02-10T20:19:58.874052"
}