{
  "metadata": {
    "case_name": "Government v. Ram Kishan",
    "case_year": 1966,
    "court": "Supreme Court of India",
    "judges": [
      "Sikri, C.J."
    ],
    "case_number": "Civil Appeal No. 750 of 1966",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Respondent Ram Kishan, Head Constable (Plaintiff), dismissed from service on 3rd September 1957 by Shri D.C. Sharma, Superintendent of Police Central.",
      "type": "material",
      "date": "1957-09-03",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Plaintiff filed suit challenging dismissal order on grounds: (1) Shri D.C. Sharma was not a District Superintendent of Police and therefore not entitled to dismiss; (2) Procedure under Rule 16.38 of Punjab Police Rules not followed.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "On 22nd June 1957, Plaintiff on duty for prevention of crime, received information of gamblers (Harijans) at public place on Rouse Avenue, organised raiding party; gamblers outnumbered police, inflicted injuries.",
      "type": "disputed",
      "date": "1957-06-22",
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "Gamblers approached Harijan member of Corporation and Harijan MP, who telephoned police station before Plaintiff reached to lodge report.",
      "type": "background",
      "date": "1957-06-22",
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "Government version: Plaintiff deputed for checking cycle theft near Employment Exchange, Darya Gunj, not posted at Rouse Avenue; denied gambling information; Plaintiff and constables tried to implicate Mohan Lal, Nathu etc., scuffle occurred.",
      "type": "disputed",
      "date": "1957-06-22",
      "source": "respondent"
    },
    {
      "id": "f6",
      "text": "Sub-Judge dismissed the suit.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Additional District Judge accepted Plaintiff's appeal, granted decree declaring dismissal order dated 3rd September 1957 illegal and ultra vires, and Rs. 1926/10 for pay and allowances.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Government appealed to Punjab High Court (R.S.A. No. 256-D of 1962); Mahajan J. referred to Division Bench as Rule 16.38 contended directory.",
      "type": "procedural",
      "date": "1964-03-04",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "High Court Division Bench (Mehar Singh J.) held Rule 16.38 mandatory per Babu Ram Upadhya case; admitted no reference of information to District Magistrate, no opportunity for DM to decide under sub-rules 1 and 2.",
      "type": "admitted",
      "date": "1964-03-04",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Charge in statement of allegations indicated commission by respondent of criminal offence in connection with official relations with public, as Batto and Foot Constables injured.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Plaintiff not in uniform on 22nd June 1957.",
      "type": "admitted",
      "date": "1957-06-22",
      "source": "respondent"
    },
    {
      "id": "f12",
      "text": "Case under s.324 IPC registered at instance of Harijans against Ram Kishan and others; injury to Mst. Batto with blunt weapon, simple; investigation by Hori Lal then S.I. Daulat Ram.",
      "type": "material",
      "date": "1957-06-22",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "D.W.2 Raghu Nath admitted SP ordered departmental inquiry; no evidence of immediate information to District Magistrate of complaint against Plaintiff or DM decision for police investigation.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Departmental charge: Plaintiff sent for cycle thieves checking per D.D. No.9, left duty, went to Rouse Avenue Harijan Basti searching Sattabaz without uniform, raided Harijans under pretext of gambling without identity, altercation injured constables and Batto, no independent witnesses; charged with gross negligence of duty and misconduct.",
      "type": "material",
      "date": "1957-06-22",
      "source": "respondent"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether Shri D.C. Sharma, not being District Superintendent of Police, was entitled to dismiss the Plaintiff.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether Rule 16.38 of Punjab Police Rules was mandatory and its procedure followed; whether charge fell under sub-rule 1 as commission of criminal offence in connection with official relations with public.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether Rule 16.38 applies only if police officer in uniform or exercising real authority.",
      "framed_by": "respondent"
    },
    {
      "id": "i4",
      "text": "Whether departmental charge was merely negligence or effectively a criminal offence to trigger Rule 16.38.",
      "framed_by": "respondent"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Rule 16.38 directory not mandatory.",
      "supporting_facts": [],
      "legal_basis": "Police Rule 16.38"
    },
    {
      "id": "pa2",
      "text": "First part of Rule 16.38 does not apply as Plaintiff went without uniform; commission of offence only if in uniform.",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": "Police Rule 16.38 sub-rule 1"
    },
    {
      "id": "pa3",
      "text": "Offence by police officer only in exercise of purported authority but real authority.",
      "supporting_facts": [],
      "legal_basis": null
    },
    {
      "id": "pa4",
      "text": "Charge was of negligence, not criminal offence in connection with official relations with public.",
      "supporting_facts": [
        "f14"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Shri D.C. Sharma not District Superintendent of Police, not entitled to dismiss.",
      "supporting_facts": [
        "f1"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Procedure under Rule 16.38 not followed.",
      "supporting_facts": [
        "f9",
        "f13"
      ],
      "legal_basis": "Police Rule 16.38"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Rule 16.38 mandatory per Babu Ram Upadhya case and its language.",
      "addresses_issue": "i2",
      "key_observation": "Admitted no reference to District Magistrate, no opportunity for decision under sub-rules 1 and 2."
    },
    {
      "id": "cr2",
      "text": "Charge indicated commission of criminal offence in connection with official relations with public.",
      "addresses_issue": "i2",
      "key_observation": "Not only Batto injured but Foot Constables."
    },
    {
      "id": "cr3",
      "text": "Rule 16.38 sub-rule 1 applies even without uniform; Plaintiff purporting to exercise police authority.",
      "addresses_issue": "i3",
      "key_observation": "Plain clothes does not mean not acting as police officer."
    },
    {
      "id": "cr4",
      "text": "No force in contentions on uniform or authority.",
      "addresses_issue": "i3",
      "key_observation": "On facts, clear purporting to exercise authority."
    },
    {
      "id": "cr5",
      "text": "Charge of negligence was colourable attempt to avoid Rule 16.38; clear case of criminal offence, mere device to call gross negligence.",
      "addresses_issue": "i4",
      "key_observation": "Summary of allegations shows gross negligence and misconduct."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Rule 16.38 of Punjab Police Rules is mandatory.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Breach of Rule 16.38 sub-rule 1 occurred; no information to District Magistrate.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Rule 16.38 applies despite no uniform; Plaintiff purported to act as police officer.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    },
    {
      "id": "h4",
      "text": "Departmental charge effectively for criminal offence, not mere negligence.",
      "resolves_issue": "i4",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Babu Ram Upadhya",
      "citation": "A.I.R. 1961 S.C. 751",
      "treatment": "followed",
      "relevance": "Rule 16.38 mandatory"
    }
  ],
  "statutes_cited": [
    {
      "name": "Punjab Police Rules",
      "sections": [
        "Rule 16.38",
        "Rule 16.38 sub-rule 1",
        "Rule 16.38 sub-rule 2"
      ],
      "relevance": "Mandatory procedure for departmental inquiry on information of criminal offence by police officer in official relations with public; breached as no reference to District Magistrate"
    },
    {
      "name": "Indian Penal Code",
      "sections": [
        "s. 324"
      ],
      "relevance": "Case registered against Plaintiff for knife injury to Batto"
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Court held breach of mandatory Rule 16.38, charge effectively criminal offence disguised as negligence; reasoning supports upholding lower courts' declaration of dismissal illegal (final order not in text).",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "in view of Babu Ram Upadhyas case this rule must be held to be mandatory, though even otherwise, on the language of the rule itself I am of the opinion that it is a rule mandatory in nature.",
      "speaker": "court",
      "significance": "High Court holding on mandatory nature of Rule 16.38, affirmed by SC"
    },
    {
      "text": "It is a clear case of criminal offence and it was a mere device to call it gross negligence.",
      "speaker": "court",
      "significance": "Rejects Govt's framing of charge as negligence to evade Rule 16.38"
    },
    {
      "text": "even if he was in plain clothes it does number mean that he was number purporting to act as a police officer.",
      "speaker": "court",
      "significance": "Uniform not required for Rule 16.38 applicability"
    }
  ],
  "_case_id": "1971_241",
  "_label": 0,
  "_text_length": 7173,
  "_extracted_at": "2026-02-10T20:15:38.043183"
}