{
  "metadata": {
    "case_name": "Petitioners (Tenants) v. Respondent (Landlord)",
    "case_year": 1971,
    "court": "Supreme Court of India",
    "judges": [
      "Vaidialingam, J."
    ],
    "case_number": "Civil Appeal No. 282 of 1971",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Petitioners took on lease the ground floor portion of property in Ward No. V, Nondh No. 1088 of Surat.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Respondent became owner by purchasing the property from previous owner by registered sale deed dated September 18, 1958.",
      "type": "background",
      "date": "1958-09-18",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Petitioners were tenants prior to purchase and continued as tenants of respondent, using premises for business purposes.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Respondent landlord filed Civil Suit No. 144 of 1967 on February 12, 1967 in Court of Third Joint Civil Judge, Junior Division, Surat for eviction of petitioners.",
      "type": "procedural",
      "date": "1967-02-12",
      "source": "respondent"
    },
    {
      "id": "f5",
      "text": "Landlord alleged petitioners had not paid rent for over six months, not complied with notice under Section 12 of Bombay Rent Act, tenancy terminated by notice dated November 24, 1966.",
      "type": "disputed",
      "date": "1966-11-24",
      "source": "respondent"
    },
    {
      "id": "f6",
      "text": "Eviction sought on grounds: (1) default in payment of rent, (2) premises required for bona fide personal use and occupation.",
      "type": "material",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f7",
      "text": "Petitioners contested suit, denied arrears, pleaded raised dispute re standard rent within time allowed by law, contended landlord's requirement not bona fide.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "Trial court and appellate court (Extra Assistant Judge, Surat) rejected plea of bona fide requirement for personal use.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Both lower courts held petitioners did not raise dispute about standard rent within one month of service of suit notice by application or reply, entitling landlord to possession under Section 12(3)(a) of Bombay Rent Act.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Both lower courts passed order directing eviction of petitioners.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Petitioners filed Civil Revision Application No. 1353 of 1970 before Gujarat High Court challenging eviction orders.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f12",
      "text": "Gujarat High Court summarily rejected Civil Revision Application by order dated December 22, 1970.",
      "type": "procedural",
      "date": "1970-12-22",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Petitioners filed Special Leave Petition No. 342 of 1971 stating appeal raises important question of law re scope of Section 12(3)(a) Bombay Rent Act, direct conflict between Full Bench Bombay High Court and Gujarat High Court.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f14",
      "text": "Bombay High Court Full Bench held Section 12(3)(a) not applicable even if dispute re standard rent raised in written statement.",
      "type": "background",
      "date": "1970-08-17",
      "source": "petitioner"
    },
    {
      "id": "f15",
      "text": "Gujarat High Court held contrary, followed in lower courts and revision.",
      "type": "background",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f16",
      "text": "Supreme Court granted special leave on February 15, 1971, ex parte stay pending notice of motion.",
      "type": "procedural",
      "date": "1971-02-15",
      "source": "court"
    },
    {
      "id": "f17",
      "text": "CMP No. 854 of 1971 filed for stay of Gujarat High Court order.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f18",
      "text": "Respondent filed counter-affidavit seeking revocation of special leave and dissolution of stay, alleging petitioners misled Court re Full Bench Bombay judgment not placed before Gujarat High Court.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f19",
      "text": "Petitioners filed CMP No. 2282 of 1971 to amend CMP 854 prayer for stay of dispossession pending appeal.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f20",
      "text": "Petitioners denied misleading, stated conflict correctly placed, no suppression.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f21",
      "text": "Full Bench Bombay High Court decision: Special Civil Application No. 718/1968 or 781/1968 decided August 17, 1970.",
      "type": "background",
      "date": "1970-08-17",
      "source": "petitioner"
    },
    {
      "id": "f22",
      "text": "Gujarat High Court decision followed by lower courts: Chunilal Shivlal Chimanlal Nagindas, 7 CLR 945.",
      "type": "background",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether petitioners made untrue statements of material facts or suppressed facts to mislead Supreme Court regarding conflict between Bombay High Court Full Bench and Gujarat High Court on scope and applicability of Section 12(3)(a) Bombay Rent Act, warranting revocation of special leave.",
      "framed_by": "respondent"
    },
    {
      "id": "i2",
      "text": "Scope and applicability of Section 12(3)(a) Bombay Rent Act: whether dispute re standard rent raised in written statement (not within one month of suit notice) attracts the provision, given conflict between Bombay High Court Full Bench (holds no) and Gujarat High Court (holds yes).",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Special leave petition correctly states direct conflict between Bombay High Court Full Bench and Gujarat High Court on interpretation of Section 12(3)(a); dispute re standard rent raised in written statement, so per Bombay HC, no eviction under that provision even accepting lower court facts.",
      "supporting_facts": [
        "f9",
        "f13",
        "f14",
        "f15"
      ],
      "legal_basis": "Bombay High Court Full Bench in Special Civil Application No. 718/781 of 1968 decided August 17, 1970"
    },
    {
      "id": "pa2",
      "text": "No misleading of Supreme Court; statements in SLP are legal contentions re conflict, no untrue averments of material facts; Full Bench Bombay judgment not required to be placed before Gujarat HC for raising conflict here.",
      "supporting_facts": [
        "f18",
        "f20"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Petitioners misled Supreme Court by suppressio veri or suggestio falsi; Full Bench Bombay High Court judgment not placed before or cited to Gujarat High Court in revision, giving false impression it was considered; revoke special leave.",
      "supporting_facts": [
        "f12",
        "f18",
        "f21"
      ],
      "legal_basis": "S. R. Shetty v. Phirozeshah Nusserwanji Golabawalla; Hari Narain v. Badri Das; Rajabhai Abdul Rehman Munshi v. Vasudev Dhanjibhai Mody; Sita Bai v. Sonuji Warti; Shankar Madhoji Nemade v. Chisuji Janaji Bhadke"
    },
    {
      "id": "ra2",
      "text": "Petitioners did not take up point of Bombay Full Bench or conflict in Gujarat High Court revision grounds.",
      "supporting_facts": [
        "f11",
        "f12"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Statements in SLP para 2 and grounds 2,3,16 are pure legal contentions re conflict between High Courts; factually correct; no untrue averments of material facts or suppression to mislead; even if impression given that Bombay judgment placed before Gujarat HC, grounds are legal attacks on judgment.",
      "addresses_issue": "i1",
      "key_observation": "Legal contentions re conflict cannot be confused with averments of material facts; party can urge contrary High Court view even if not placed before lower court."
    },
    {
      "id": "cr2",
      "text": "Principles from cited SC cases apply only if untrue statement of material importance or deliberate misleading; not applicable here.",
      "addresses_issue": "i1",
      "key_observation": "No false or untrue averment on material facts made by petitioners."
    },
    {
      "id": "cr3",
      "text": "Rejects prayer to revoke special leave; allows amendment CMP 2282/1971; grants stay of dispossession pending appeal subject to deposit of arrears within one month and monthly rent by 10th succeeding month, with liberty to withdraw; undertaking by counsel to vacate within 3 months if appeal dismissed.",
      "addresses_issue": "i2",
      "key_observation": "Proceeds to hear appeal on merits re Section 12(3)(a) conflict."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "No untrue statements or suppression warranting revocation of special leave; special leave stands.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Stay of dispossession from premises pending disposal of appeal, subject to petitioners depositing arrears within one month and monthly rent by 10th of succeeding month; respondent at liberty to withdraw unconditionally; stay vacated on two consecutive defaults; undertaking to vacate within 3 months if appeal dismissed.",
      "resolves_issue": "i2",
      "in_favor_of": "partial"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "S. R. Shetty v. Phirozeshah Nusserwanji Golabawalla",
      "citation": null,
      "treatment": "referred",
      "relevance": "Special leave revoked for deliberate inflated valuation to mislead."
    },
    {
      "case_name": "Hari Narain v. Badri Das",
      "citation": "1964 2 SCR 203",
      "treatment": "followed",
      "relevance": "Care must be taken not to make inaccurate, untrue or misleading statements in SLP; revoke if betrayed confidence."
    },
    {
      "case_name": "Rajabhai Abdul Rehman Munshi v. Vasudev Dhanjibhai Mody",
      "citation": "1964 3 SCR 480",
      "treatment": "followed",
      "relevance": "Approach Art. 136 with clean hands; revoke if misled by false statements or withholding info."
    },
    {
      "case_name": "Sita Bai v. Sonuji Warti",
      "citation": "C.A. No. 982 of 1965 decided 25-4-1968",
      "treatment": "referred",
      "relevance": "Revoked special leave for untrue statements on matter of importance."
    },
    {
      "case_name": "Shankar Madhoji Nemade v. Chisuji Janaji Bhadke",
      "citation": "C.A. No. 85 of 1967 decided 8-9-1970",
      "treatment": "followed",
      "relevance": "Reiterated principles; no revocation if no untrue averment."
    },
    {
      "case_name": "Chunilal Shivlal Chimanlal Nagindas",
      "citation": "7 CLR 945",
      "treatment": "followed",
      "relevance": "Gujarat High Court view on Section 12(3)(a) followed by lower courts."
    },
    {
      "case_name": "Bombay High Court Full Bench (Special Civil Application No. 718/781 of 1968)",
      "citation": "decided 17th August 1970",
      "treatment": "referred",
      "relevance": "Holds Section 12(3)(a) not applicable if standard rent dispute raised in written statement; in conflict with Gujarat HC."
    }
  ],
  "statutes_cited": [
    {
      "name": "Bombay Rents, Hotel and Lodging House Rates Control Act, 1947 (Act 57 of 1947)",
      "sections": [
        "Section 12",
        "Section 12(3)(a)"
      ],
      "relevance": "Notice under s12; eviction for default if no standard rent dispute within 1 month of suit notice; scope if dispute in written statement."
    }
  ],
  "outcome": {
    "disposition": "partially_accepted",
    "summary": "Prayer to revoke special leave rejected; CMP 2282/1971 allowed amending stay prayer; stay of dispossession granted pending appeal subject to deposit of arrears within one month and monthly rents by 10th succeeding month, withdrawable by respondent unconditionally; stay vacated on two defaults; undertaking to vacate within 3 months if appeal dismissed.",
    "relief_granted": "Stay of eviction/dispossession pending appeal with conditions.",
    "costs": "No order as to costs."
  },
  "key_quotes": [
    {
      "text": "\"It is of utmost importance that in making material statements and setting forth grounds in applications for special leave, care must be taken not to make any statements which are inaccurate, untrue or misleading.\"",
      "speaker": "court",
      "significance": "Principle from Hari Narain v. Badri Das applied to assess misleading."
    },
    {
      "text": "\"A party who approaches this Court invoking the exercise of this overriding discretion of the Court must come with clean hands.\"",
      "speaker": "court",
      "significance": "From Rajabhai case; test for revoking special leave."
    },
    {
      "text": "\"We are of the opinion that none of the statements in the special leave petition relied on by Mr. Shroff can be considered to be untrue or false statements on material facts or matters of importance.\"",
      "speaker": "court",
      "significance": "Court's holding rejecting revocation."
    }
  ],
  "_case_id": "1971_563",
  "_label": 0,
  "_text_length": 22904,
  "_extracted_at": "2026-02-10T20:19:30.381221"
}