{
  "metadata": {
    "case_name": "Four Commissioned Officers of Indian Army v. State",
    "case_year": 1968,
    "court": "Supreme Court of India",
    "judges": [
      "Ray, J."
    ],
    "case_number": "Criminal Appeal No. 241 of 1968",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Offences of conspiracy and corruption against appellants alleged to have been committed in December 1962 and end of 1963.",
      "type": "material",
      "date": "1962-12 to 1963-12",
      "source": "prosecution"
    },
    {
      "id": "f2",
      "text": "Sanction accorded by Central Government on 29 October 1965 under section 197 CrPC and section 6(1)(a) Prevention of Corruption Act.",
      "type": "procedural",
      "date": "1965-10-29",
      "source": "prosecution"
    },
    {
      "id": "f3",
      "text": "Charge-sheet submitted by Special Police Establishment, Jaipur Branch before Special Judge, Jaipur against four appellants and four civilians on 27 January 1966. One civilian turned approver.",
      "type": "procedural",
      "date": "1966-01-27",
      "source": "prosecution"
    },
    {
      "id": "f4",
      "text": "Appellants applied on 13 September 1966 before Special Judge stating they are Commissioned Officers of Indian Army and without complying with section 549 CrPC and Rules thereunder, Special Judge could not proceed.",
      "type": "procedural",
      "date": "1966-09-13",
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "Special Judge rejected application on 10 October 1966 and ordered case to be put up for further proceedings on 16 January 1967.",
      "type": "procedural",
      "date": "1966-10-10",
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "Revision filed in Rajasthan High Court. High Court by order dated 20 December 1966 directed Special Judge to proceed in accordance with Rules 3 and 4 under section 549 CrPC.",
      "type": "procedural",
      "date": "1966-12-20",
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "On 5 March 1966, case adjourned to 4 July 1966 at request of Public Prosecutor to supply copies of documents under section 173 CrPC.",
      "type": "procedural",
      "date": "1966-03-05",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Special Judge on 12 January 1967 gave notice under Rule 4 to Commanding Officer, 123 Infantry Battalion T.A., Jaipur, notifying charges and that charges would be framed after 7 days.",
      "type": "procedural",
      "date": "1967-01-12",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Officer Commanding replied on 16 January 1967 under Rule 5 that appellants would be tried by Court Martial, requested stay of proceedings and immediate delivery of appellants.",
      "type": "procedural",
      "date": "1967-01-16",
      "source": "respondent"
    },
    {
      "id": "f10",
      "text": "State of Rajasthan applied on 17 January 1967 before Special Judge citing section 122 Army Act limitation (3 years from offence, expired end 1966), civilians involved, requested reference to Central Government.",
      "type": "procedural",
      "date": "1967-01-17",
      "source": "respondent"
    },
    {
      "id": "f11",
      "text": "Special Judge on 17 January 1967 held civilians cannot be tried by Court Martial, requested Commanding Officer to refer to Central Government within 7 days, did not deliver appellants.",
      "type": "procedural",
      "date": "1967-01-17",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Officer Commanding wrote on 28 January 1967 that notice under Rule 5 dated 16 January 1967 be treated as cancelled.",
      "type": "procedural",
      "date": "1967-01-28",
      "source": "respondent"
    },
    {
      "id": "f13",
      "text": "Appellants applied on 21 March 1968 before Additional Special Judge that Commanding Officer acted illegally, prayed for handover to army.",
      "type": "procedural",
      "date": "1968-03-21",
      "source": "petitioner"
    },
    {
      "id": "f14",
      "text": "Additional Special Judge on 5 April 1968 held Commanding Officer revised discretion and cancelled earlier notice, directed trial to proceed, no delivery to army.",
      "type": "procedural",
      "date": "1968-04-05",
      "source": "lower_court"
    },
    {
      "id": "f15",
      "text": "Appellants applied to Rajasthan High Court under section 435 r/w 561A CrPC to quash proceedings and direct handover for Court Martial.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f16",
      "text": "Rajasthan High Court by order dated 9 September 1968 dismissed revision, directed Special Judge to conduct trial expeditiously.",
      "type": "procedural",
      "date": "1968-09-09",
      "source": "lower_court"
    },
    {
      "id": "f17",
      "text": "Appeal by special leave to Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the Additional Special Judge, Rajasthan, Jaipur could proceed with the trial of Criminal Case No. 2/68/Spl. Cr. as directed by the order of the High Court.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether after notice under Rule 4 and reply under Rule 5, Special Judge had jurisdiction to entertain State's application on 17 January 1967.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether Officer Commanding had power to cancel intimation dated 16 January 1967 by letter dated 28 January 1967.",
      "framed_by": "petitioner"
    },
    {
      "id": "i4",
      "text": "Relevance of sanction under section 197 CrPC to section 549 CrPC and Rules.",
      "framed_by": "petitioner"
    },
    {
      "id": "i5",
      "text": "Whether case was pending before 30 June 1966 before Special Judge within meaning of section 5(1)(a) Criminal Law Amendment Act 1966, and whether 'charged with and tried for' requires framing of charges.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Special Judge having issued notice on 12 January 1967 under Rule 4 and received reply dated 16 January 1967 from Officer Commanding, had no jurisdiction to deal with State's application on 17 January 1967 and pass order requesting reference to Central Government.",
      "supporting_facts": [
        "f8",
        "f9",
        "f10",
        "f11"
      ],
      "legal_basis": "Rules 4 and 5 of Criminal Courts and Court Martial (Adjustment of Jurisdiction) Rules, 1952"
    },
    {
      "id": "pa2",
      "text": "Officer Commanding had no power to cancel intimation dated 16 January 1967 by subsequent letter dated 28 January 1967.",
      "supporting_facts": [
        "f9",
        "f12"
      ],
      "legal_basis": "Rule 5 of Criminal Courts and Court Martial (Adjustment of Jurisdiction) Rules, 1952"
    },
    {
      "id": "pa3",
      "text": "Sanction for prosecution by Central Government had no relevance to section 549 CrPC read with Rules.",
      "supporting_facts": [
        "f2"
      ],
      "legal_basis": "Section 549 CrPC"
    },
    {
      "id": "pa4",
      "text": "'Charged with and tried for an offence' in section 5(1)(a) Criminal Law Amendment Act 1966 means charges had been actually framed and trial commenced.",
      "supporting_facts": [
        "f3",
        "f7"
      ],
      "legal_basis": "Section 5(1)(a) Criminal Law Amendment Act 1966"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Officer Commanding by letter dated 28 January 1967 cancelled earlier notice dated 16 January 1967, resulting in no Court Martial proceedings.",
      "supporting_facts": [
        "f9",
        "f12"
      ],
      "legal_basis": "Rule 5 of Criminal Courts and Court Martial (Adjustment of Jurisdiction) Rules, 1952"
    },
    {
      "id": "ra2",
      "text": "Special Judge had jurisdiction to try case pending on 30 June 1966 by virtue of Criminal Law Amendment Act 1966.",
      "supporting_facts": [
        "f3",
        "f7"
      ],
      "legal_basis": "Section 5 Criminal Law Amendment Act 1966"
    },
    {
      "id": "ra3",
      "text": "Special Judge justified in ordering on 17 January 1967 request to military authority to refer to Central Government.",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": "Section 126 Army Act; Rule 8 of Rules"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Sections 125 and 126 Army Act ensure no conflict between criminal court and Court Martial. Officer Commanding has discretion under s125; criminal court under s126 may require delivery or reference to Central Government whose order is final.",
      "addresses_issue": "i1",
      "key_observation": "Special Judge justified in requesting reference due to limitation bar u/s122 Army Act and civilians involved."
    },
    {
      "id": "cr2",
      "text": "Rules 3-9 under s549 CrPC detailed: Magistrate gives notice under Rule 4; if CO notifies under Rule 5, stay and deliver; Rule 8 allows Magistrate to require reference to Central Govt if conflict.",
      "addresses_issue": "i1",
      "key_observation": "Special Judge's step on 17 Jan 1967 supported by Rule 8; CO's cancellation under Rule 9 equivalent to opinion for criminal court trial."
    },
    {
      "id": "cr3",
      "text": "Officer Commanding can cancel notice as no allegation of mala fides; expressed opinion appellants to be tried by criminal court.",
      "addresses_issue": "i3",
      "key_observation": "No lack of authority to communicate no Court Martial."
    },
    {
      "id": "cr4",
      "text": "Case pending before 30 Jun 1966: charge-sheet 27 Jan 1966, adjourned 5 Mar 1966 to 4 Jul 1966. 'Pending' means not concluded, court can make order.",
      "addresses_issue": "i5",
      "key_observation": "Fits s5(1)(a) CLA 1966 as appellants charged with civilians; 'charged with' means accusations, not framed charges (contra s5(1)(b))."
    },
    {
      "id": "cr5",
      "text": "Sections 251A-254 CrPC show 'charge' precedes framing; discharge possible if groundless.",
      "addresses_issue": "i5",
      "key_observation": "Confirms no need for framed charges in s5(1)(a)."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Special Judge has jurisdiction to try and dispose of the case; no delivery to army authorities required.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Officer Commanding had power to cancel notice under Rule 5 upon consideration of facts.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Case falls under section 5(1)(a) Criminal Law Amendment Act 1966; to be tried by Special Judge notwithstanding Army Act provisions.",
      "resolves_issue": "i5",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Ram Sarup v. Union of India",
      "citation": "1964 5 S.C.R 931",
      "treatment": "followed",
      "relevance": "Section 125 Army Act not discriminatory; policy guides discretion; final choice with Central Govt on forum."
    },
    {
      "case_name": "Som Datt Datta v. Union of India",
      "citation": "1969 2 S.C.R. 177",
      "treatment": "followed",
      "relevance": "Rule 3 applies post charge-sheet; ss125,126 provide machinery for jurisdiction conflict."
    },
    {
      "case_name": "Joginder Singh v. State of Himachal Pradesh",
      "citation": "Criminal Appeal No.34 of 1969 decided on 30-11-1970",
      "treatment": "followed",
      "relevance": "No exclusion of criminal court jurisdiction; military handover implies decision for criminal trial."
    },
    {
      "case_name": "Major E. Barsay v. State of Bombay",
      "citation": "1962 2 S.C.R. 195",
      "treatment": "referred",
      "relevance": "No exclusion of ordinary criminal courts for offences triable by Court Martial."
    },
    {
      "case_name": "Asgarali Nazarali Singaporawalla v. State of Bombay",
      "citation": "1966 S.C.R. 678",
      "treatment": "followed",
      "relevance": "'Pending' means not concluded; proceedings can be taken until disposal."
    }
  ],
  "statutes_cited": [
    {
      "name": "Army Act, 1950",
      "sections": [
        "125",
        "126",
        "122"
      ],
      "relevance": "Discretion to choose forum (s125); criminal court may require delivery or reference (s126); 3-year limitation for CM (s122)"
    },
    {
      "name": "Code of Criminal Procedure, 1898",
      "sections": [
        "197",
        "549",
        "435",
        "561A",
        "251A",
        "252",
        "253",
        "254",
        "173",
        "113",
        "251",
        "342",
        "213"
      ],
      "relevance": "Sanction for prosecution (s197); Rules for adjustment of jurisdiction (s549); procedures for warrant cases; inherent powers."
    },
    {
      "name": "Criminal Courts and Court Martial (Adjustment of Jurisdiction) Rules, 1952",
      "sections": [
        "3",
        "4",
        "5",
        "6",
        "7",
        "8",
        "9"
      ],
      "relevance": "Procedure for notice, stay, delivery, reference to Central Govt in cases involving military personnel."
    },
    {
      "name": "Prevention of Corruption Act, 1947",
      "sections": [
        "6(1)(a)",
        "5(2)",
        "5(1)(a)",
        "5(1)(d)"
      ],
      "relevance": "Sanction and offences charged."
    },
    {
      "name": "Indian Penal Code, 1860",
      "sections": [
        "120B",
        "161",
        "165A",
        "420",
        "409",
        "467A",
        "304",
        "149",
        "376"
      ],
      "relevance": "Offences charged including conspiracy, corruption, cheating, criminal breach of trust, forgery."
    },
    {
      "name": "Criminal Law Amendment Act, 1966",
      "sections": [
        "5(1)(a)",
        "5(1)(b)"
      ],
      "relevance": "Special Judge to try pending cases involving military personnel and civilians without need for framed charges."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal is dismissed. The Special Judge Rajasthan has jurisdiction to try and dispose of the case as it was pending before 30 June 1966 involving army officers charged with civilians under section 5(1)(a) Criminal Law Amendment Act 1966. Officer Commanding cancelled Court Martial notice, no conflict remains. Directed to proceed with trial.",
    "relief_granted": "None to appellants; trial to proceed before Special Judge.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The order of the Central Government shall be final in cases of reference by the criminal court to the Government.",
      "speaker": "court",
      "significance": "Emphasizes finality of Central Govt decision on forum under s126 Army Act."
    },
    {
      "text": "The word 'pending' will ordinarily mean that the matter is not concluded and the court which has cognizance of it can make an order on the matter in issue.",
      "speaker": "court",
      "significance": "Defines 'pending' for CLA 1966 s5 applicability."
    },
    {
      "text": "The Special Judge therefore has jurisdiction to try and dispose of the case.",
      "speaker": "court",
      "significance": "Core holding on jurisdiction."
    }
  ],
  "_case_id": "1971_142",
  "_label": 0,
  "_text_length": 37312,
  "_extracted_at": "2026-02-10T20:15:10.439820"
}