{
  "metadata": {
    "case_name": "Appellant v. State of Orissa",
    "case_year": 1967,
    "court": "Supreme Court of India",
    "judges": [
      "Mitter, J."
    ],
    "case_number": "Civil Appeal No. 1064 of 1967",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The appellant was born on January 1, 1910.",
      "type": "background",
      "date": "1910-01-01",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The appellant entered the service of the former Indian State of Mayurbhanj in Orissa as an engineer on 1st November 1937.",
      "type": "background",
      "date": "1937-11-01",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The appellant was in the employment of that State up to December 31, 1948.",
      "type": "background",
      "date": "1948-12-31",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On the merger of that State with the Province of Orissa on January 1, 1949 he became an officer of the said Province.",
      "type": "background",
      "date": "1949-01-01",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The age of superannuation of Government employees in Orissa was then 55 years.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "On May 21, 1963 the Government of Orissa passed a resolution raising the age of compulsory retirement for the State Government employees from 55 years to 58 years with effect from 1-12-1962. Notwithstanding anything contained in the preceding paragraph, the appointing authority may require a Government servant to retire after he attains the age of 55 years on three months previous notice in writing without assigning any reason.",
      "type": "material",
      "date": "1963-05-21",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "The resolution also provided that Government servants may after attaining the age of 55 years, voluntarily retire by giving three months notice to the appointing authority. The powers to retire a Government servant under this provision will normally be exercised to weed out unsuitable employees after they have attained the age of 55 years. This provision will be in addition to the provisions already contained in rule 2 in section 1 of the Liberalised Pension Rules.",
      "type": "material",
      "date": "1963-05-21",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "On February 5, 1964 a notification was issued by the Government of Orissa laying down the criteria and procedure: service record of an officer to be scrutinised six months before he was due to attain the age of fifty five years; in any case where Government had reasonable cause to believe that he lacked in integrity it would be appropriate to determine upon his retirement; where an officer's integrity was not in doubt but his physical or mental condition was such as to make him inefficient for further service the same result would follow; an officer whose performance was considered as below average should not be allowed to work after the age of 55.",
      "type": "material",
      "date": "1964-02-05",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "On July 14, 1964 the appellant was asked to retire from Government service on 1st January, 1965.",
      "type": "material",
      "date": "1964-07-14",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "His representation for reconsideration was not accepted.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "He filed a Writ Petition in the High Court on December 21, 1964.",
      "type": "procedural",
      "date": "1964-12-21",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "This was rejected by the High Court on September 19, 1966.",
      "type": "procedural",
      "date": "1966-09-19",
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "The appellant has come up by certificate to this Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "The appellant had not completed 30 years service on January 1, 1965.",
      "type": "admitted",
      "date": "1965-01-01",
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the appellant could be asked to retire on January 1, 1965 at age 55 without having completed 30 years qualifying service, given the resolution of May 21, 1963.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether the order of retirement dated July 14, 1964 cast a stigma on him and as such was violative of the protection given by Art. 311 of the Constitution, having regard to the criteria laid down by the notification dated February 5, 1964.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "As the appellant had not completed 30 years service on January 1, 1965 he could not be asked to retire on that date. The power under paragraph 3 of the resolution of May 21, 1963 to retire after age 55 was in addition to the Liberalised Pension Rules, and could not be used unless 30 years service completed.",
      "supporting_facts": [
        "f6",
        "f7",
        "f9",
        "f14"
      ],
      "legal_basis": "Resolution of May 21, 1963; Liberalised Pension Rules"
    },
    {
      "id": "pa2",
      "text": "Having regard to the criteria laid down by the notification dated February 5, 1964 the order of retirement dated July 14, 1964 cast a stigma on him and as such was violative of Art. 311 of the Constitution.",
      "supporting_facts": [
        "f8",
        "f9"
      ],
      "legal_basis": "Article 311 of the Constitution"
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Before May 21, 1963 an employee would have been due for superannuation at 55 whether 30 years service or not. The resolution raised superannuation to 58 but reserved right to retire at 55 without reason. This was not unilateral; servant not bound to continue beyond 55. Right to retire after 30 years service remained intact and unaffected.",
      "addresses_issue": "i1",
      "key_observation": "The contention cannot be accepted."
    },
    {
      "id": "cr2",
      "text": "Observations in Gurdev Singh Sidhu v. State of Punjab do not help appellant as they apply to unreasonably short service periods before normal superannuation age, not here where retirement at 55 was standard before 1963.",
      "addresses_issue": "i1",
      "key_observation": "Raising age to 58 while reserving right to retire at 55 does not violate Art. 311(2)."
    },
    {
      "id": "cr3",
      "text": "The order of July 14, 1964 did not cast any aspersions or stigma. Government had right under paragraph 3 to retire at 55 without reason. Guidelines in notification of Feb 5, 1964 do not imply lack of integrity in every case.",
      "addresses_issue": "i2",
      "key_observation": "No evil aspersion was cast on the appellant."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The Government could require the appellant to retire at age 55 under the resolution even without 30 years service, as the power was reserved and not linked to the pension rules minimum.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "The retirement order did not cast a stigma or violate Art. 311.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Gurdev Singh Sidhu v. State of Punjab and Another",
      "citation": null,
      "treatment": "referred",
      "relevance": "Distinguished; observations on compulsory retirement rules not applicable as here service period not unreasonably short and 55 was prior normal superannuation age."
    },
    {
      "case_name": "Satish Chandra Anand v. The Union of India",
      "citation": "1963 S.C.R. 655",
      "treatment": "referred",
      "relevance": "Cited in context of validity of compulsory retirement rules."
    },
    {
      "case_name": "Moti Ram Deka etc. v. The General Manager, North East Frontier Railway etc.",
      "citation": "1964 7 S.C.R. 587 at 593",
      "treatment": "referred",
      "relevance": "Dicta on rules of compulsory retirement at early career stage."
    }
  ],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Article 311(2)"
      ],
      "relevance": "Protection against dismissal/removal without opportunity; compulsory retirement at superannuation age or after reasonable qualifying service does not attract it."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal is dismissed. The order requiring the appellant to retire on January 1, 1965 is upheld, with no violation of Article 311 found.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "Government had before the said date an option to ask him to retire if he had completed 30 years qualifying service even though he has not reached the age of fifty five years correspondingly the officer had the right to retire if he wanted to do so before he reached the age mentioned if he had 30 years qualifying service to his credit.",
      "speaker": "court",
      "significance": "Explains pre-1963 rules and why new resolution did not alter them."
    },
    {
      "text": "The fact that by the notification of 5th February 1964 certain guidelines were indicated to the Heads of Departments in considering whether a Government servant should continue in service beyond the age of 55 years, one of the factors for consideration being lack of integrity, did not imply that any officer whose continuance in service was not advised lacked in integrity.",
      "speaker": "court",
      "significance": "Rejects stigma argument."
    }
  ],
  "_case_id": "1971_212",
  "_label": 0,
  "_text_length": 13754,
  "_extracted_at": "2026-02-10T20:15:29.967071"
}