{
  "metadata": {
    "case_name": "Assessee (Public Limited Company) v. Commissioner of Income-tax",
    "case_year": 1967,
    "court": "Supreme Court of India",
    "judges": [
      "Grover, J."
    ],
    "case_number": "Civil Appeal No. 24 of 1967",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The assessee is a public limited company having its registered office at Calcutta. Its principal business consists of manufacturing aluminium ingots, sheets and such other products from aluminium.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "There is another company known by the name of Aluminium Laboratories Limited, Montreal, in Canada, hereinafter called the Montreal Company, which provided the assessee with technical know-how, engineering services etc. regarding development of production of the goods.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "An agreement was entered into on January 31, 1947 between the Montreal Company and the assessee. The agreement provided for payment of a retainer fee on an annual basis. There was no condition or stipulation that the fee would be payable by the assessee without deduction of tax under the provisions of the Act.",
      "type": "material",
      "date": "1947-01-31",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The assessee credited a total fee of Rs. 2,50,808/- in favour of the Montreal Company for a period of seven years between the accounting year ending September 30, 1944 and September 30, 1950.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "In 1951 the Income-tax Officer treated the assessee as being in default under s. 18(7) of the Act in respect of the amount of tax which the assessee was liable to deduct from the payments made to the Montreal Company under the provisions of ss. 18(3A), 18(3B) and 18(3C) of the Act. The amount of tax which was found to be payable by the assessee came to a total sum of Rs. 1,24,199/-.",
      "type": "procedural",
      "date": "1951",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The assessee wrote to the Montreal Company asking for reimbursement of the said amount. The Montreal Company refused to accept the assessee's claim for reimbursement by means of a letter dated August 3, 1954.",
      "type": "material",
      "date": "1954-08-03",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "The assessee wrote off the amount of Rs. 1,24,199/- during the relevant previous year ending on December 31, 1954.",
      "type": "material",
      "date": "1954-12-31",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "The assessee appealed to the Appellate Assistant Commissioner who allowed its claim.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "The department preferred an appeal to the Tribunal which held that the amount in question was neither expenditure incidental to the business nor was it wholly and exclusively laid out for that purpose nor was it claimable as a bad debt in view of the fact that it had not been incurred as a trade debt in the course of the business. The departmental appeal was therefore allowed and the order of the Income-tax Officer was restored.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "The Calcutta High Court in Income-tax Reference No. 90 of 1962 answered the question referred to it under S. 66(1) of the Act in the negative and against the assessee by judgment dated April 27, 1966.",
      "type": "procedural",
      "date": "1966-04-27",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether, on the facts and in the circumstances of the case, the sum of Rs. 1,24,199/- was deductible from the business income of the assessee either under Section 10(1) or 10(2)(xi) or 10(2)(xv) of the Income-tax Act?",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "After the refusal of the Montreal Company in the matter of reimbursement the amount of Rs. 1,24,199/- was written off as a bad and irrecoverable debt. It was deductible under s. 10(2)(xi) of the Act.",
      "supporting_facts": [
        "f6",
        "f7"
      ],
      "legal_basis": "Section 10(2)(xi) of the Income-tax Act, 1922"
    },
    {
      "id": "pa2",
      "text": "The assessee could claim deduction under s. 10(2)(xv) of the Act as the amount had been wholly and exclusively laid out for the purpose of its business.",
      "supporting_facts": [
        "f1",
        "f2",
        "f3",
        "f4"
      ],
      "legal_basis": "Section 10(2)(xv) of the Income-tax Act, 1922"
    },
    {
      "id": "pa3",
      "text": "The assessee could not afford to displease the Montreal Company as it stood greatly in need of the latter's technical assistance.",
      "supporting_facts": [
        "f2",
        "f3"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The amount in question was neither expenditure incidental to the business nor was it wholly and exclusively laid out for that purpose nor was it claimable as a bad debt as it had not been incurred as a trade debt in the course of the business.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": "Sections 10(1), 10(2)(xi), 10(2)(xv) of the Income-tax Act, 1922"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The debt was not incidental to the business because it arose out of non-compliance with the provisions of the Act. The payment which the assessee made to the income-tax authorities and which it failed to recover from the Montreal Company was more a matter of commercial expediency and proceeded out of motives of business relationship.",
      "addresses_issue": "i1",
      "key_observation": "A bad debt under s. 10(2)(xi) must be a trading debt springing directly from the carrying on of business."
    },
    {
      "id": "cr2",
      "text": "It is difficult to understand how a payment made under a statutory obligation because the assessee was in default, could constitute expenditure laid out for the purpose of the assessee's business.",
      "addresses_issue": "i1",
      "key_observation": "The assessee was presumed to know the relevant provisions of the Act; no contractual obligation to pay taxes."
    },
    {
      "id": "cr3",
      "text": "The assessee was bound under sub-section 3-B to deduct the sum chargeable under the provisions of the Act at the time of payment of the retainer fees to the Montreal Company. Under sub-section 7 if the assessee did not deduct the amount of tax as required under the section it was to be deemed to be in default in respect of the tax.",
      "addresses_issue": "i1",
      "key_observation": "Provisions of s. 18(3-B) and s. 18(7) create statutory liability."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The amount of Rs. 1,24,199/- is not deductible under Section 10(2)(xi) as it is not a trading debt incidental to business.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "The amount is not deductible under Section 10(2)(xv) as it is not expenditure wholly and exclusively laid out for the purpose of business.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "A. V. Thomas & Co. Ltd. v. Commissioner of Income-tax",
      "citation": "48 I.T.R. 67",
      "treatment": "followed",
      "relevance": "A debt means something related to business; must be shown as a proper debt to be claimable as bad debt."
    },
    {
      "case_name": "Commissioner of Income-tax, Bombay v. M/s. Pannalal Narotamdas & Co., Bombay",
      "citation": null,
      "treatment": "distinguished",
      "relevance": "Penalty for release of goods considered business expense; point different, no assistance in statutory default cases."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act, 1922",
      "sections": [
        "10(1)",
        "10(2)(xi)",
        "10(2)(xv)",
        "18(3A)",
        "18(3B)",
        "18(3C)",
        "18(7)",
        "66(1)"
      ],
      "relevance": "Governs deductibility of expenditure/bad debt and tax deduction at source for non-residents; assessee in default for non-deduction."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court dismissed the appeal by special leave, upholding the Calcutta High Court's answer that Rs. 1,24,199/- is not deductible under Sections 10(1), 10(2)(xi) or 10(2)(xv).",
    "relief_granted": null,
    "costs": "Dismissed with costs."
  },
  "key_quotes": [
    {
      "text": "\"If every State to which we have to render technical assistance... starts demanding income-tax... no such State could ever receive any technical assistance at all.\"",
      "speaker": "Montreal Company (letter)",
      "significance": "Reason for refusal of reimbursement, highlighting no contractual obligation for tax."
    },
    {
      "text": "The debt was not incidental to the business because it arose out of non-compliance with the provisions of the Act.",
      "speaker": "court",
      "significance": "Core reasoning why not a bad debt under s. 10(2)(xi)."
    },
    {
      "text": "It is difficult to understand how a payment made under a statutory obligation because the assessee was in default, could constitute expenditure laid out for the purpose of the assessee's business.",
      "speaker": "court",
      "significance": "Rejects deductibility under s. 10(2)(xv)."
    }
  ],
  "_case_id": "1971_76",
  "_label": 0,
  "_text_length": 11755,
  "_extracted_at": "2026-02-10T20:14:07.000293"
}