{
  "metadata": {
    "case_name": "Work-charged employees of Hirakud Dam Project v. State of Orissa",
    "case_year": 1966,
    "court": "Supreme Court of India",
    "judges": [
      "Vaidialingam J."
    ],
    "case_number": "Civil Appeal No. 1492 of 1966",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Decision taken to construct three dams across Mahanadi river at Hirakud, Tikerpara and Naraj for flood prevention, electricity generation and irrigation.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Construction of Hirakud Dam entrusted by State of Orissa to Central Waterways, Irrigation and Navigation Commission (C.W.I.N. Commission) as agent.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "C.W.I.N. Commission employed large number of persons in work-charged establishment on scales of remuneration as per Central Public Works Department (CPWD), service conditions governed by CPWD Code.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "After completion of first stage of Hirakud Dam project, State of Orissa took over project from C.W.I.N. Commission with effect from April 1, 1960, and decided to proceed with second stage through its own Public Works Department.",
      "type": "material",
      "date": "1960-04-01",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "State gave option to work-charged employees to continue under State on same pay, allowances and conditions as per CPWD Code; employees agreed and continued.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "State found marked difference in pay, allowances and conditions between Hirakud Dam work-charged personnel and State Public Works Department personnel, leading to complications.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Hirakud Control Board recommended termination of services of Hirakud Dam work-charged personnel with one month's notice with effect from March 31, 1963.",
      "type": "material",
      "date": "1962-12-19",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "State Government terminated services of work-charged personnel with effect from March 31, 1963, by giving one month's notice; offered re-employment on State PWD scales to those who elected.",
      "type": "material",
      "date": "1963-03-31",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Out of 2300 personnel, 1200 left services upon notice; remaining 1100 agreed to re-employment on State PWD scales.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Employees paid amount equal to retrenchment compensation or wages in lieu of notice.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Personnel raised dispute contesting termination; conciliation failed.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Government referred dispute to Industrial Tribunal, Orissa on February 13, 1964, for adjudication on: validity of retrenchment per Control Board decision Dec 19, 1962; entitlement if not valid; entitlement of continuing workers to original conditions; confirmation of workmen with 3+ years service.",
      "type": "procedural",
      "date": "1964-02-13",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Employees' stand before Tribunal: services governed by CPWD Code, entitled to remain till termination of project work; State has no power to terminate before work ends.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f14",
      "text": "State's stand before Tribunal: power under para 11 CPWD Code to terminate with one month's notice or pay in lieu even before work completion.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f15",
      "text": "Industrial Tribunal findings: not retrenchment under Industrial Disputes Act; acceptance of notice/pay/compensation doesn't bar challenge; para 11 doesn't authorize termination before work completion except as punishment (relied on 'dismissed'); termination without jurisdiction, arbitrary, anti-contractual, invalid; project is industry; employees entitled to original conditions, continuity till work completion except punishment.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f16",
      "text": "State challenged Tribunal award in Orissa High Court via O.J.C. No. 58 of 1965 under Articles 226/227.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f17",
      "text": "High Court: agreed with State that para 11 allows termination even during work progress with one month's notice/pay in lieu; other contentions given up.",
      "type": "procedural",
      "date": "1968-04-05",
      "source": "lower_court"
    },
    {
      "id": "f18",
      "text": "Appeal by special leave to Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the State has power to terminate services of work-charged establishment member under paragraph 11 of CPWD Code by giving one month's notice or pay in lieu before completion of work.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Employees entitled to continue till work completion; power to dismiss without notice only for serious misconduct; for other reasons, one month's notice/pay required but no power to terminate simpliciter before work completion.",
      "supporting_facts": [
        "f3",
        "f5",
        "f13"
      ],
      "legal_basis": "Paragraph 11 CPWD Code; 'dismissal' means punishment"
    },
    {
      "id": "pa2",
      "text": "'Dismissal' always interpreted as punitive action, not including termination simpliciter.",
      "supporting_facts": [],
      "legal_basis": "Art. 311 Constitution; Service Rules; Government of India Acts"
    },
    {
      "id": "pa3",
      "text": "Even if power exists, High Court should not interfere as Tribunal found State not bona fide.",
      "supporting_facts": [
        "f15"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Paragraph 11 governs employer-employee relationship; 'dismissal' used loosely to mean termination either as punishment or for any other reason, allowing termination with one month's notice/pay before work completion.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": "Paragraph 11 CPWD Code"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Para 11 treats work-charged as monthly servants; engagement for specific work lasts till work ends (automatic termination); before completion, can dismiss for serious misconduct (no notice) or otherwise than serious misconduct (with notice/pay); resignation requires notice.",
      "addresses_issue": "i1",
      "key_observation": "Terms of engagement to be explained clearly."
    },
    {
      "id": "cr2",
      "text": "'Dismissed' not limited to punishment; used loosely for termination simpliciter or punishment; dictionary meaning is termination of service.",
      "addresses_issue": "i1",
      "key_observation": "CPWD Code framed 1929, pre-1935 Act; context indicates broad meaning."
    },
    {
      "id": "cr3",
      "text": "While 'dismissal' in Art. 311/1935 Act means punishment, para 11 context different; provides for termination before work end symmetrically with employee's resignation right.",
      "addresses_issue": "i1",
      "key_observation": "Incongruous to deny employer similar right."
    },
    {
      "id": "cr4",
      "text": "No Tribunal finding of lack of bona fides; Tribunal only held no power under para 11.",
      "addresses_issue": "i1",
      "key_observation": "High Court correctly interfered on error of law."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "State has power under para 11 CPWD Code to terminate services of work-charged employee before work completion by giving one month's notice or pay in lieu, even simpliciter.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Parshotam Lal Dhingra v. Union of India",
      "citation": "1958 S.C.R. 820",
      "treatment": "referred",
      "relevance": "Dismissal, removal, reduction in rank under 1935 Act/Art. 311 denote major punishments."
    },
    {
      "case_name": "Dr. Bool Chand v. The Chancellor, Kurukshetra University",
      "citation": "1968 1 S.C.R. 434",
      "treatment": "followed",
      "relevance": "'Dismiss' in general clauses/power to appoint implies power to terminate; not limited to punishment pre-1935."
    }
  ],
  "statutes_cited": [
    {
      "name": "Central Public Works Department Code",
      "sections": [
        "Paragraph 11"
      ],
      "relevance": "Governs service conditions of work-charged establishment; allows termination before work completion with notice/pay."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 311",
        "Articles 226 and 227"
      ],
      "relevance": "Art. 311 'dismissal' punitive; contrasted with para 11; High Court writ jurisdiction."
    },
    {
      "name": "Industrial Disputes Act",
      "sections": [],
      "relevance": "Termination not retrenchment under Act."
    },
    {
      "name": "Government of India Act, 1935",
      "sections": [
        "Section 240"
      ],
      "relevance": "Introduced protections making 'dismissal' punitive."
    },
    {
      "name": "Government of India Act, 1919",
      "sections": [
        "Section 96B",
        "Section 45"
      ],
      "relevance": "Statutory recognition of pleasure doctrine with qualifications."
    },
    {
      "name": "Punjab General Clauses Act, 1898",
      "sections": [
        "Section 14"
      ],
      "relevance": "'Dismiss' not limited to punishment."
    },
    {
      "name": "Kurukshetra University Act, 1956",
      "sections": [
        "Schedule I cl. 4 sub-cl. vi"
      ],
      "relevance": "Power to terminate Vice-Chancellor tenure."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court dismissed the appeal, upholding Orissa High Court; held that under para 11 CPWD Code, State has power to terminate work-charged employees' services before project completion with one month's notice or pay in lieu thereof.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "'Members of the temporary and work-charged establishments, who are engaged locally, are on the footing of monthly servants. If they are engaged for a specific work, their engagement lasts only for the period during which the work lasts.'",
      "speaker": "court",
      "significance": "Verbatim para 11 CPWD Code, basis of interpretation."
    },
    {
      "text": "The word dismissed has been used loosely to denote both termination of service for misconduct by way of punishment and also termination of service simpliciter.",
      "speaker": "court",
      "significance": "Core holding on meaning of 'dismissed'."
    },
    {
      "text": "A power to appoint ordinarily implies a power to determine the employment.",
      "speaker": "court",
      "significance": "From Bool Chand precedent, supporting broad termination power."
    }
  ],
  "_case_id": "1971_98",
  "_label": 0,
  "_text_length": 27927,
  "_extracted_at": "2026-02-10T20:14:57.796061"
}