{
  "metadata": {
    "case_name": "Managing Partner, Shree Narayana Transport Company v. Respondents",
    "case_year": 1969,
    "court": "Supreme Court of India",
    "judges": [
      "Jaganmohan Reddy, J."
    ],
    "case_number": "Criminal Appeal No. 12 of 1969",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Respondent 1 was the Agent of Shree Narayana Transport Company at Baliapattom branch and issued nine Way Bills on different dates in favour of the 2nd Respondent, as if the goods were received but in fact no such goods were accepted for transport nor were any such goods dispatched.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "These Way Bills were duly discounted by the second Respondent who drew about Rs. 84,000 against them from his Bank.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Fraud was detected on a check made by the General Manager of Shree Narayana Transport Co., Kozhikode; 1st accused executed an agreement undertaking to make good the loss, after which he was suspended on 10-4-63.",
      "type": "material",
      "date": "1963-04-10",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On the same day a complaint was filed before Baliapattom Police and a case was registered against both Accused 1 and Accused 2.",
      "type": "procedural",
      "date": "1963-04-10",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "After investigation the Sub-Inspector of Police, Baliapattom filed a charge-sheet.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Magistrate committed the accused to stand trial before the Assistant Sessions Court on 15-6-65.",
      "type": "procedural",
      "date": "1965-06-15",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Revision filed in Kerala High Court on 9-7-65 against committal, dismissed on 20-10-66 holding procedure under Sec. 207-A CrPC allows committal without recording evidence of witnesses.",
      "type": "procedural",
      "date": "1966-10-20",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Assistant Sessions Judge ordered splitting up the charges into 8 cases; Revision under Sec. 561-A CrPC dismissed by High Court on 30-10-67.",
      "type": "procedural",
      "date": "1967-10-30",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "State Government passed G.O. Rt. No. 1589/67 Home B dated 22-11-67 directing withdrawal in interest of public policy as no likelihood of successful issue.",
      "type": "procedural",
      "date": "1967-11-22",
      "source": "respondent"
    },
    {
      "id": "f10",
      "text": "Public Prosecutor filed Memo on 30-11-67 under Sec. 494 CrPC for permission to withdraw, permission accorded by Assistant Sessions Judge on 2-12-67.",
      "type": "procedural",
      "date": "1967-12-02",
      "source": "prosecution"
    },
    {
      "id": "f11",
      "text": "Appellant filed Criminal Miscellaneous Petition on 19-2-68 in Kerala High Court against withdrawal order; High Court dismissed holding Public Prosecutor justified.",
      "type": "procedural",
      "date": "1968-02-19",
      "source": "petitioner"
    },
    {
      "id": "f12",
      "text": "Appeal by special leave from High Court judgment dated June 25, 1968.",
      "type": "procedural",
      "date": "1968-06-25",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Memo grounds: offences arose out of contract between accused and complainant; subject matter decided by Subordinate Judge's Court, Calicut in civil suit; case registered 1963, trial not begun; witnesses from Bombay/Calcutta involve heavy expenses; case of civil nature.",
      "type": "disputed",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f14",
      "text": "Before charge-sheet, Public Prosecutor on 8-6-63 opined successful prosecution under 467/420 may not be possible due to company practice, but directed to file charge-sheet.",
      "type": "background",
      "date": "1963-06-08",
      "source": "prosecution"
    },
    {
      "id": "f15",
      "text": "Magistrate in committal negatived contention of normal practice for popularity; prima facie evidence of no goods produced, awareness by R2.",
      "type": "admitted",
      "date": null,
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the Public Prosecutor was justified in applying for withdrawal under Sec. 494 CrPC on directions from State Government without independent application of mind, and whether the grounds disclosed justify the Court's permission.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether permission under Sec. 494 CrPC can be granted on grounds extraneous to interest of administration of justice.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Public Prosecutor must make up his mind independently without reference to State Government to withdraw under Sec. 494 CrPC.",
      "supporting_facts": [
        "f10",
        "f9"
      ],
      "legal_basis": "Section 494 CrPC"
    },
    {
      "id": "pa2",
      "text": "Grounds in Memo insufficient as High Court previously held prima facie case in revisions.",
      "supporting_facts": [
        "f7",
        "f8",
        "f13"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Withdrawal justified as matter civil nature, decided in civil suit, old case (1963), trial not begun, expensive witnesses from far places.",
      "supporting_facts": [
        "f13"
      ],
      "legal_basis": "Section 494 CrPC"
    },
    {
      "id": "ra2",
      "text": "Practice in transport companies; remote chances of conviction.",
      "supporting_facts": [
        "f14",
        "f15"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Sec. 494 empowers Public Prosecutor to seek withdrawal with Court consent; no circumscribed reasons, but implicit in interest of administration of justice; Court must ensure not extraneous or against duty to prosecute.",
      "addresses_issue": "i1",
      "key_observation": "Public Prosecutor in charge, but can consider Govt input; must apply mind."
    },
    {
      "id": "cr2",
      "text": "Grounds flimsy: civil nature does not bar criminal prosecution for forgery/cheating; delay due to revisions by respondents; no material on huge expenses; prima facie case exists from committal order.",
      "addresses_issue": "i2",
      "key_observation": "Acts liable under civil and criminal law; practice contention negatived by Magistrate."
    },
    {
      "id": "cr3",
      "text": "High Court ignored its prior views on prima facie case; withdrawal not justified.",
      "addresses_issue": "i1",
      "key_observation": "Permission subserves justice only if not for ulterior purpose."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Power under Sec. 494 CrPC to be exercised in furtherance of administration of justice, not hindrance; Court not to grant as formality but satisfy on materials that it subserves justice.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Permission not to be granted on extraneous grounds like policy, expediency unconnected to prosecution duty.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Ramanarayan Mor & Anr. v. State of Maharashtra",
      "citation": "1964 5 S.C.R. 1064",
      "treatment": "followed",
      "relevance": "Sec. 207-A CrPC allows committal on police report without recording witness evidence."
    },
    {
      "case_name": "Ranachhodlal v. State of Madhya Pradesh",
      "citation": "1965 2 S.C.R. 283",
      "treatment": "followed",
      "relevance": "Splitting charges proper; prosecution may withdraw others post-conviction under Sec. 240 CrPC."
    },
    {
      "case_name": "State of Bihar v. Ram Nagas Pandey",
      "citation": "1957 S.C.R. 279",
      "treatment": "followed",
      "relevance": "Court must satisfy executive function not improperly exercised; not interfere with normal justice course."
    },
    {
      "case_name": "Devendra Kumar Roy v. Syed Yar Bakht Chaudhury Ors.",
      "citation": "AIR 1939 Calcutta 220",
      "treatment": "referred",
      "relevance": "Permission quashed where sought on insufficient grounds like expense, despite prima facie case."
    },
    {
      "case_name": "The King v. Parmanand Ors.",
      "citation": "AIR 1949 Patna 222",
      "treatment": "referred",
      "relevance": "No justification for executive usurping Court function; interfere if Magistrate permits merely on Govt order."
    },
    {
      "case_name": "Deputy Accountant General, Admn. Office of Accountant General, Kerala Trivandrum v. State of Kerala and Ors.",
      "citation": "AIR 1970 Kerala 153",
      "treatment": "referred",
      "relevance": "Policy opposed to law cannot justify withdrawal; quashed permission."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "467",
        "471",
        "420",
        "109"
      ],
      "relevance": "Offences charged: forgery of valuable securities, cheating, abetment."
    },
    {
      "name": "Criminal Procedure Code",
      "sections": [
        "494",
        "207-A",
        "173",
        "240",
        "561-A",
        "333"
      ],
      "relevance": "Withdrawal from prosecution; committal procedure; splitting charges; inherent powers."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; permission to withdraw granted by Trial Court and confirmed by High Court set aside; directed that trial proceed in accordance with law.",
    "relief_granted": "Trial to proceed",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "it is the duty of the Court also to see in furtherance of justice that the permission is not sought on grounds extraneous to the interest of justice or that offences which are offences against the State go unpunished merely because the Government as a matter of general policy or expediency unconnected with its duty to prosecute offenders under the law, directs the public prosecutor to withdraw",
      "speaker": "court",
      "significance": "Core principle for Sec. 494 CrPC permission."
    },
    {
      "text": "The Court also while considering the request to grant permission under the said Section should not do so as a necessary formality the grant of it for the mere asking.",
      "speaker": "court",
      "significance": "Court's duty to scrutinize withdrawal requests."
    },
    {
      "text": "these grounds are flimsy and do not justify the granting of permission to withdraw from the prosecution.",
      "speaker": "court",
      "significance": "Rejection of specific grounds like civil nature, delay, expense."
    }
  ],
  "_case_id": "1971_459",
  "_label": 1,
  "_text_length": 24566,
  "_extracted_at": "2026-02-10T20:16:54.203201"
}