{
  "metadata": {
    "case_name": "Appellants v. Respondents (University of Poona Vice-Chancellor Election)",
    "case_year": 1971,
    "court": "Supreme Court of India",
    "judges": [
      "Ray, J."
    ],
    "case_number": "Civil Appeal No. 5 of 1971",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "V. Pataskar, the Vice-Chancellor of the University of Poona died on 21 February, 1970.",
      "type": "material",
      "date": "1970-02-21",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The Governor of Bombay, who is the Chancellor of the University, nominated Maha Mahopadhyaya Datto Vaman Potdar to act as the Vice-Chancellor until the date on which another Vice-Chancellor was elected under sub-section (1) of section 11 of the Poona University Act, 1948.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "At the meeting of the Executive Council held on 28 February, 24 March and 18 April, 1970 the Executive Council recommended a panel of three persons: Dr. Balkrishna Pandurang Apte, Principal Narayan Ramchandra Kulkarni and Principal Narhar Govind Suru for election to the office of the Vice-Chancellor.",
      "type": "procedural",
      "date": "1970-02-28",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The said meeting of the Court of the University was convened under notice dated 22 April, 1970 for 9 May, 1970 for election of the Vice-Chancellor from amongst those three persons.",
      "type": "procedural",
      "date": "1970-04-22",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "At the election held on 9 May, 1970 the total number of votes tendered was 149. One of the votes was invalid. The valid votes were 148.",
      "type": "procedural",
      "date": "1970-05-09",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The election was in accordance with section 56 of the Act by the system of proportional representation by means of a single transferable vote by ballot. The result of the ballot papers appeared to be that Dr. Apte secured 58, Principal Kulkarni 37 and Principal Suru 53 first preference votes.",
      "type": "procedural",
      "date": "1970-05-09",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Principal Kulkarni was thus eliminated on the first count on the basis of the lowest number of first preference votes.",
      "type": "procedural",
      "date": "1970-05-09",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "8 of the voters who had given first preference votes to Principal Kulkarni had exercised second preference in favour of either of the remaining two candidates Dr. Apte and Principal Suru. The remaining 29 voters gave 12 second preference votes to Dr. Apte and 17 second preference votes to Principal Suru. This resulted in both the continuing candidates Dr. Apte and Principal Suru each securing 70 votes on the second count.",
      "type": "procedural",
      "date": "1970-05-09",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Dr. Apte was declared elected because in the first count, namely, the count previous to the one in which both obtained equal number of votes, Dr. Apte had a clear majority of 5 votes and therefore Principal Suru was excluded from the election.",
      "type": "procedural",
      "date": "1970-05-09",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "The election of Dr. Apte was challenged in the Bombay High Court in Special Civil Application No. 1583 of 1970.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Bombay High Court by judgment dated 18 and 21 December, 1970 issued a writ of quo warranto declaring that respondent No. 3 Dr. Balkrishna Pandurang Apte is not entitled to act as the Vice-Chancellor of the University of Poona in pursuance of the election held on 9 May, 1970 and further restraining him from acting as the Vice-Chancellor.",
      "type": "procedural",
      "date": "1970-12-18",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "In the month of June, 1969 the Government sanctioned the recommendation of the University for affiliation of four Colleges: N. D. M. V. P. Samajs Arts and Commerce College, Sinnar; V. P. Mandals Arts, Science and Commerce College, Thana; Narhar Balwant Thakur Law College, Nasik; and E. Societys College for Education, Sangamner.",
      "type": "background",
      "date": "1969-06",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "The affiliation was for three years from 1969. In these orders it was stated that the final Government notification would be issued after the University submitted a report to the Government of fulfilling the conditions.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Principals of the four Colleges acted and voted at the election as members of the Court.",
      "type": "disputed",
      "date": "1970-05-09",
      "source": "petitioner"
    },
    {
      "id": "f15",
      "text": "Principal Suru himself made a petition to the Chancellor under section 60 of the Act asking him not to confirm the election.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the tie between Dr. Apte and Principal Suru at the second count was to be resolved by drawing of lots or by reference to the first preference votes under the system of proportional representation by means of a single transferable vote.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether the Principals of four Colleges, viz. N. D. M. V. P. Samajs Arts and Commerce College, Sinnar; V. P. Mandals Arts, Science and Commerce College, Thana; Narhar Balwant Thakur Law College, Nasik; and E. Societys College for Education, Sangamner which had not been duly affiliated at the date of the election had acted and voted invalidly.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether the meeting for the election of the panel of Dr. Apte, Principal Kulkarni and Principal Suru was an invalid meeting and therefore the election was void.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The principle of exclusion in case of tie at second count between two continuing candidates is to exclude the one with lower first preference votes, as per rule 75(3) and (4) of Conduct of Elections Rules 1961, rule 6 Schedule to Presidential and Vice-Presidential Elections Rules 1952, and Statute No. 158 of Poona University.",
      "supporting_facts": [
        "f6",
        "f7",
        "f8",
        "f9"
      ],
      "legal_basis": "Section 56 Poona University Act 1948; Rule 75 Conduct of Elections Rules 1961; Rule 6 Presidential Elections Rules 1952; Statute 158"
    },
    {
      "id": "pa2",
      "text": "The four colleges were affiliated as Government sanctioned in June 1969, and delayed publication does not detract from the sanction.",
      "supporting_facts": [
        "f12",
        "f13",
        "f14"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Tie between two continuing candidates at final count to be resolved by drawing lots, as per ordinary practice in proportional representation for single seat; rule 75(4) applies only where contest continues between three or more.",
      "supporting_facts": [
        "f8",
        "f9"
      ],
      "legal_basis": "Rule 81(3) Conduct of Elections Rules 1961"
    },
    {
      "id": "ra2",
      "text": "Principals of four colleges voted invalidly as not duly affiliated at date of election; notification published after May 1970.",
      "supporting_facts": [
        "f14"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "High Court's interpretation of rule 75(4) erroneous; rule applies to two or more candidates with same value standing lowest, resolved by original first preference votes; rule 81(3) applies to multi-seat elections with one vacancy left.",
      "addresses_issue": "i1",
      "key_observation": "Principle of exclusion by reference to first count votes is recognized in proportional representation system and legislative rules."
    },
    {
      "id": "cr2",
      "text": "Statute No. 158 though not directly applicable furnishes valuable guide; decision by lot not universal, only if statute compels; here rational method by original votes used.",
      "addresses_issue": "i1",
      "key_observation": "Election followed established principle in Hare system for single vacancy."
    },
    {
      "id": "cr3",
      "text": "Government sanction in June 1969 effective; delayed notification does not invalidate.",
      "addresses_issue": "i2",
      "key_observation": "Sanction granted prior to election."
    },
    {
      "id": "cr4",
      "text": "Third contention not pressed.",
      "addresses_issue": "i3",
      "key_observation": "Rejected."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "In proportional representation by single transferable vote for single vacancy, tie at second count between two continuing candidates resolved by excluding candidate with fewer first preference votes.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Votes by principals of four colleges valid as affiliation sanctioned in 1969.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Halsburys Laws of England, Third Edition, Vol. II, Para. 160",
      "citation": "page 85",
      "treatment": "referred",
      "relevance": "Authority has discretion in mode of performing duty if multiple principles available; cannot be commanded to specific way."
    }
  ],
  "statutes_cited": [
    {
      "name": "Poona University Act, 1948",
      "sections": [
        "Section 8",
        "Section 11",
        "Section 12",
        "Section 15",
        "Section 18",
        "Section 56",
        "Section 60"
      ],
      "relevance": "Governs election of Vice-Chancellor by proportional representation single transferable vote; Chancellor decides election disputes finally."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 133(1)(c)"
      ],
      "relevance": "Basis for certificate appeal to Supreme Court."
    },
    {
      "name": "Conduct of Elections Rules, 1961",
      "sections": [
        "Rule 75",
        "Rule 81(3)"
      ],
      "relevance": "Principles for resolving ties in proportional representation counting."
    },
    {
      "name": "Presidential and Vice-Presidential Elections Rules, 1952",
      "sections": [
        "Rule 6 in the Schedule"
      ],
      "relevance": "Principle of exclusion by lowest first preferences in ties."
    },
    {
      "name": "Poona University Statutes",
      "sections": [
        "No. 142 to 165",
        "No. 158"
      ],
      "relevance": "Rules for elections; Statute 158 guides tie resolution though not directly applicable to Vice-Chancellor."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "The Supreme Court accepted the appeal, set aside the Bombay High Court's judgment issuing writ of quo warranto against Dr. Apte, holding the election valid as conducted in accordance with principles of proportional representation by single transferable vote.",
    "relief_granted": "Election of Dr. Apte upheld; High Court writ set aside.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"Dr. Apte was declared elected because in the first count, namely, the count previous to the one in which both obtained equal number of votes, Dr. Apte had a clear majority of 5 votes\"",
      "speaker": "court",
      "significance": "Describes method used to resolve tie."
    },
    {
      "text": "\"The principle of exclusion by lot on the other hand is adhered to only if the Statute has a compelling force to that effect. In the present case there is no such statutory compulsion\"",
      "speaker": "court",
      "significance": "Rejects lot method as default."
    },
    {
      "text": "\"If there are two principles of exclusion and the authority has a discretion in the mode of performing the duty, the authority cannot be commanded to a duty in a specific way\"",
      "speaker": "court",
      "significance": "Upholds discretion in election procedure."
    }
  ],
  "_case_id": "1971_208",
  "_label": 1,
  "_text_length": 23138,
  "_extracted_at": "2026-02-10T20:15:35.747204"
}