{
  "metadata": {
    "case_name": "Commissioner of Agricultural Income-tax v. Chittavurai Tea Estate (Assessee)",
    "case_year": 1970,
    "court": "Supreme Court of India",
    "judges": [
      "Grover, J."
    ],
    "case_number": "Civil Appeals Nos. 1175 and 1178 of 1970",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The assessee is a limited company carrying on business of tea planting. It owns several tea estates in the States of Tamil Nadu, Kerala and Assam. Its head office is in Munnar in the State of Kerala.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "One of the tea estates owned by the assessee is called Chittavurai Tea Estate and comprises 1043 acres of tea plantations. Out of this an area of 1006.60 acres is situate in Kerala and the remaining 36.40 acres, in Tamil Nadu.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "According to the assessee Chittavurai Estate is working as one unit. There is only one factory manufacturing tea grown in the Madras and Kerala portion of the estate. The expenses are incurred for the maintenance of the whole estate as one unit and common accounts are maintained for it, there being no separate account for the Madras portion.",
      "type": "admitted",
      "date": null,
      "source": "assessee"
    },
    {
      "id": "f4",
      "text": "The computation by the Central Income-tax Officer showed a loss for the entire Chittavurai Estate treating it as one unit for the purpose of the Income-tax Act.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "The Agricultural Income-tax Officer took the valuation of the produce from the Madras portion as the gross receipt. He deducted from it the expenditure allowed by the Central Income-tax Officer and recalculated it for the Madras portion on the basis of acreage. That led to a profit from the Madras portion.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "Apportionment of expenditure by treating the whole of Chittavurai Estate as one unit had resulted in a loss for the Madras portion and a profit for the Kerala portion according to the Agricultural Income-tax Officer.",
      "type": "disputed",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "The Madras High Court judgment and order dated December 9, 1964, in Tax Case No. 146 of 1963 and Writ Petitions Nos. 698 to 700 of 1963.",
      "type": "procedural",
      "date": "1964-12-09",
      "source": "high_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the Agricultural Income-tax Officer can disregard the computation of the Central Income-tax Officer treating Chittavurai Tea Estate as one unit and instead compute agricultural income separately for the Madras portion.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Applicability of Section 6 of the Agricultural Income-tax Act and Rules 7 and 8 to tea estates where tea is grown partly in Madras but manufactured outside in Kerala.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Apportionment should be done under Section 6 of the Agricultural Income-tax Act where income from land partly within and partly without the State; reliance on Rules 7 and 8 for computation.",
      "supporting_facts": [
        "f2",
        "f5",
        "f6"
      ],
      "legal_basis": "Agricultural Income-tax Act, Section 6; Rules 7 and 8"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Chittavurai Estate works as one unit with common accounts and expenses; should be assessed as a whole; Central Income-tax Officer's computation showing loss for entire estate should be accepted.",
      "supporting_facts": [
        "f2",
        "f3",
        "f4"
      ],
      "legal_basis": "Indian Income-tax Act, 1922"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Rule 7 applicable only to agricultural income from tea grown and manufactured in the State of Madras; inapplicable here as tea manufactured in Kerala.",
      "addresses_issue": "i2",
      "key_observation": "R. 7 is applicable only to agricultural income from tea grown and manufactured in the State of Madras. It can have no applicability in the present case where even though tea is grown inside that State but it is manufactured in Kerala which is outside that State."
    },
    {
      "id": "cr2",
      "text": "Rule 8 not applicable to tea as tea leaves alone have no value until processed; Rule 7 specifically for tea computation.",
      "addresses_issue": "i2",
      "key_observation": "As regards R. 8 it is a moot point whether the same would be applicable to tea. So far as tea is concerned the tea leaves alone can be the produce but as such they have no value. They become valuable only after they are subjected to a special process."
    },
    {
      "id": "cr3",
      "text": "Chittavurai Estate to be assessed as a whole; Agricultural Income-tax Officer should accept computation of Central Income-tax Officer as per first proviso to Rule 7; High Court found no sufficient reasons to disregard it.",
      "addresses_issue": "i1",
      "key_observation": "The rule that the Agricultural Income-tax Officer should accept the computation of the Central Income-tax Officer furnishes the only satisfactory basis for computation of agricultural income tax in respect of Chittavurai Estate."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Rules 7 and 8 of the Agricultural Income-tax Rules have no applicability to the facts of the case; Agricultural Income-tax Officer must ordinarily accept the computation made by the Central Income-tax Officer for tea estates treated as one unit.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "High Court correctly held that Agricultural Income-tax Officer had not given sufficient reasons for not accepting Central Income-tax Officer's computation.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Anglo-American Direct Tea Trading Co. Ltd. etc. v. Commissioner of Agricultural Income-tax Kerala",
      "citation": null,
      "treatment": "followed",
      "relevance": "Agricultural Income-tax Officer bound to accept computation of income made by Central Income-tax authorities if made prior; principle applied similarly here."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act, 1922",
      "sections": [
        "Section 2(1)"
      ],
      "relevance": "Defines agricultural income; Central Income-tax Officer computed under this Act treating estate as one unit."
    },
    {
      "name": "Madras Agricultural Income-tax Act",
      "sections": [
        "Section 6",
        "Rules 7",
        "Rules 8"
      ],
      "relevance": "Section 6 for income from land partly within/outside State; Rule 7 for tea grown/manufactured in Madras (inapplicable); Rule 8 for split lands (inapplicable to tea)."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeals by the Revenue against the Madras High Court order are dismissed. The High Court's view upheld that the Agricultural Income-tax Officer should accept the Central Income-tax Officer's computation for the Chittavurai Tea Estate as one unit.",
    "relief_granted": "None to appellant; status quo in favor of assessee upheld.",
    "costs": "Dismissed with costs. Hearing fee, one set."
  },
  "key_quotes": [
    {
      "text": "Chittavurai Estate being of tea falls in a special class. It is only a very small area of that estate which is in Madras even though that is more fertile and gives much more yield than the area in Kerala but the unit has to be assessed as a whole.",
      "speaker": "court",
      "significance": "Emphasizes tea estates as special class requiring whole-unit assessment."
    },
    {
      "text": "The appeals fail and are dismissed with costs.",
      "speaker": "court",
      "significance": "Final disposition of the appeals."
    }
  ],
  "_case_id": "1971_444",
  "_label": 0,
  "_text_length": 8793,
  "_extracted_at": "2026-02-10T20:16:48.435899"
}