{
  "metadata": {
    "case_name": "Returned Candidates (Congress) v. Jan Sangh Candidates (Election Petitioners)",
    "case_year": 1971,
    "court": "Supreme Court of India",
    "judges": [
      "Hegde, J."
    ],
    "case_number": "Civil Appeals Nos. 1343 and 1473 of 1971",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "General election to Lok Sabha held in March 1971 in South Delhi Constituency and Delhi-Sadar Constituency.",
      "type": "background",
      "date": "1971-03",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Appellants were successful candidates contesting on behalf of Congress party with symbol cow and calf; declared elected.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Unsuccessful Jan Sangh candidates (election petitioners, respondents here) challenged validity of appellants' election on ground of rigging by ruling party.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f4",
      "text": "Alleged rigging process: Millions of ballot papers chemically treated; Congress symbol mechanically stamped with invisible ink; mark disappears after few days, stamped symbol emerges.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f5",
      "text": "Election Commission instructed Returning Officers to forward substantial ballot papers to Delhi ostensibly for scrutiny but to carry out design; replaced with chemically treated and stamped papers used in election.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f6",
      "text": "Election Commission alterations: Larger interval between polling and counting; mixing ballot papers from various booths and rotating in drums.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f7",
      "text": "At counting: Colour of large number of ballot papers different; stamping uniform at identical spot; stamps uniform in density, bright and fresh; dissimilar to other papers including those for defeated candidates.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "Affidavits of two persons present at counting supporting observations.",
      "type": "material",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f9",
      "text": "Rumours of rigging; landslide victory of ruling party unexpected; huge quantity of unused ballot papers found in Chandigarh godown.",
      "type": "background",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f10",
      "text": "Delhi High Court (Andley J.) permitted inspection of ballot papers by judgments dated September 3, 1971 and August 6, 1971 in I.A. No. 1170/1971 in Election Petition Nos. 1 and 2 of 1971.",
      "type": "procedural",
      "date": "1971-09-03",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "No direct evidence claimed by election petitioners; seek to prove by examination of ballot papers.",
      "type": "admitted",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f12",
      "text": "Attention of Returning Officer/Assistant Returning Officer allegedly invited to strange features at counting, but controversy not resolved at this stage.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether inspection of ballot papers should be permitted in the election petitions challenging the validity of the appellants' election on allegations of rigging.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Allegations are propaganda stunts devoid of truth; scrutiny of ballot papers serious matter; secrecy of ballot utmost importance; inspection only on very good grounds.",
      "supporting_facts": [
        "f2",
        "f11"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "At counting, attention of Returning Officer not invited to strange features; no objection to acceptance of alleged spurious papers.",
      "supporting_facts": [
        "f12"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Petitioners failed to make out case for inspection; allegations not probable.",
      "supporting_facts": [
        "f3",
        "f4"
      ],
      "legal_basis": "Ram Sewak Yadav v. Hussain Kamil Kidwai; Dr. Jagjit Singh v. Giani Kartar Singh; Jitendra Bahadur Singh v. Krishna Behari"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Main ground: Ruling party rigged election through chemical treatment and invisible ink stamping; changes in procedure to facilitate.",
      "supporting_facts": [
        "f4",
        "f5",
        "f6",
        "f7"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Observations at counting support rigging; affidavits filed; circumstances like rumours, victory, unused papers.",
      "supporting_facts": [
        "f7",
        "f8",
        "f9"
      ],
      "legal_basis": null
    },
    {
      "id": "ra3",
      "text": "Only way to prove/disprove is by inspecting ballot papers.",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Unable to comprehend theories but cannot reject without scrutiny; allegations serious, challenge integrity of Election Commission; public interest to expose falsity if propaganda.",
      "addresses_issue": "i1",
      "key_observation": "Confidence in democratic institutions at stake; allow enquiry to build public confidence."
    },
    {
      "id": "cr2",
      "text": "Trial judge held allegations bona fide and serious, calling for investigation; agree.",
      "addresses_issue": "i1",
      "key_observation": "Material facts support investigation."
    },
    {
      "id": "cr3",
      "text": "Inspection allowed if necessary in interests of justice; no rigid rules; must have material facts, bona fide, not vague; secrecy important but justice more so.",
      "addresses_issue": "i1",
      "key_observation": "Overriding test: interests of justice."
    },
    {
      "id": "cr4",
      "text": "Analyzed precedents: Inspection not routine; requires material facts enabling court to consider justice; no fishing enquiry.",
      "addresses_issue": "i1",
      "key_observation": "Allegations here specific and supported."
    },
    {
      "id": "cr5",
      "text": "Allegations provable only by inspection; limit to sample (600 for each returned candidate, 200 for petitioners) for initial check; if needed, further probe with experts, then general inspection maintaining secrecy.",
      "addresses_issue": "i1",
      "key_observation": "No general inspection until satisfactory proof."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Inspection of ballot papers permissible if allegations supported by material facts, bona fide, and necessary in interests of justice; secrecy important but justice overrides, especially for public interest.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Allow limited/sample inspection initially; if warranted, further evidence and possible general inspection.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Ram Sewak Yadav v. Hussain Kamil Kidwai",
      "citation": "1964 6 S.C.R. 238",
      "treatment": "followed",
      "relevance": "Inspection only if necessary in interests of justice; mere production of ballot boxes does not entitle to inspection."
    },
    {
      "case_name": "Dr. Jagjit Singh v. Giani Kartar Singh",
      "citation": "A.I.R. 1966 S.C. 773",
      "treatment": "followed",
      "relevance": "Tribunal can order inspection under s.92 RPA; requires concise material facts; no vague allegations; interests of justice overriding, no fishing; secrecy to be borne in mind."
    },
    {
      "case_name": "Jitendra Bahadur Singh v. Krishna Behari",
      "citation": "1970 1 S.C.R. 852",
      "treatment": "followed",
      "relevance": "Vague/indefinite allegations without material facts do not justify inspection."
    }
  ],
  "statutes_cited": [
    {
      "name": "Representation of the People Act",
      "sections": [
        "Section 92",
        "Section 88(a)"
      ],
      "relevance": "Powers of Tribunal for discovery/inspection; election petition must contain concise statement of material facts."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeals against Delhi High Court order permitting inspection dismissed; directed limited/sample inspection of ballot papers (600 for each returned candidate from different bundles, 200 for petitioners) initially by trial judge with parties; if needed, further evidence/experts then possible general inspection maintaining secrecy.",
    "relief_granted": "Limited inspection of ballot papers as directed.",
    "costs": "No order as to costs."
  },
  "key_quotes": [
    {
      "text": "\"We shall accept nothing and reject nothing except on satisfactory proof.\"",
      "speaker": "court",
      "significance": "Approach to serious allegations of electoral rigging."
    },
    {
      "text": "\"The allegation that our electoral process has been fouled is a very serious allegation... What is more important is the survival of the very democratic institutions.\"",
      "speaker": "court",
      "significance": "Highlights public importance of investigating election integrity."
    },
    {
      "text": "\"Secrecy of ballot is important, but doing justice is undoubtedly more important and it would be more so, if what is in stake is the interests of the society.\"",
      "speaker": "court",
      "significance": "Balancing test for allowing inspection."
    }
  ],
  "_case_id": "1971_434",
  "_label": 0,
  "_text_length": 21402,
  "_extracted_at": "2026-02-10T20:16:13.864144"
}