{
  "metadata": {
    "case_name": "Kishorilal v. Rajaram Singh",
    "case_year": 1969,
    "court": "Supreme Court of India",
    "judges": [
      "Grover, J."
    ],
    "case_number": "Civil Appeals Nos. 2123 and 2237 of 1969",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Bhander Assembly Constituency is a seat reserved for scheduled caste candidate.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Last date for filing nomination papers was January 20, 1967; date of scrutiny was January 21, 1967; poll took place on February 20, 1967; result declared on February 21, 1967.",
      "type": "procedural",
      "date": "1967-01-20",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Returned candidate (Kishorilal, appellant in C.A. No. 2123/69) obtained 24,549 votes; respondent No. 1 (Rajaram Singh) obtained 8,096 votes.",
      "type": "material",
      "date": "1967-02-21",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Election petition filed by Rajaram Singh under s. 81 of Representation of People Act, 1951 challenging election of Kishorilal.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Name of returned candidate entered in electoral roll for Seondha Assembly Constituency No. 2, district Datia, part No. 81, village Bargawan, serial No. 154; permanent resident of that village.",
      "type": "admitted",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "Returned candidate belonged to Jatav caste, which is not a scheduled caste for Datia district.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "Under Constitution (Scheduled Castes) Order 1950 and Scheduled Castes and Scheduled Tribes Lists (Modification) Order 1956, for district Datia: Item 3 - Chamar, Ahirwar, Chamar Mangan, Mochi or Raidas; Jatav not recognised as scheduled caste.",
      "type": "background",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "Returned candidate admitted residence in Bargawan but denied belonging to Jatav caste; claimed to belong to Chamar caste and that Jatav is a sub-caste of Chamar.",
      "type": "admitted",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f9",
      "text": "Pamphlets Exhs. P-16, P-17, P-18 issued by Jatav organizations showing returned candidate as convener or Mantri/Secretary of Jatav Sabha Datia; related to Jatav Sammelans demanding recognition of Jatav as separate caste.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Deputation by Provincial Jatav Sabha to Collector Datia on January 12, 1961, complaining officers not recording Jatav caste; Collector ordered to record Jatav.",
      "type": "material",
      "date": "1961-01-12",
      "source": "petitioner"
    },
    {
      "id": "f11",
      "text": "Resolution Exh. P-60 at Jatav Sammelan Tharet on October 24, 1963, demanding scholarships for Jatav community; seconded by returned candidate.",
      "type": "material",
      "date": "1963-10-24",
      "source": "petitioner"
    },
    {
      "id": "f12",
      "text": "In criminal proceedings 1964, personal bond Exh. P-10 dated May 6, 1964, returned candidate gave caste as Jatav; similar in Exhs. P-55, P-56.",
      "type": "material",
      "date": "1964-05-06",
      "source": "petitioner"
    },
    {
      "id": "f13",
      "text": "High Court found returned candidate belonged to Jatav caste (sub-issue a affirmative); did not possess qualifications for SC seat (sub-issue b); no inquiry into whether Jatav sub-caste of Chamar (sub-issue c); Jatav recorded as SC for Bhander (d affirmative), but not entitled due to residence in Datia (e negative).",
      "type": "procedural",
      "date": "1965-08-29",
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "Returned candidate attended Jatav Sammelans in Bhander tehsil, including Mouza Barchouli.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f15",
      "text": "Revenue records showed ancestors of returned candidate as Chamar, but High Court held rebutted by other evidence.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f16",
      "text": "Memorial Exh. P-57 dated July 17, 1956 by President Jatav Sabha protesting non-recognition of Jatav as separate SC.",
      "type": "background",
      "date": "1956-07-17",
      "source": "petitioner"
    },
    {
      "id": "f17",
      "text": "In Constitution (Scheduled Castes) Order 1950, Jatav not shown in Madhya Pradesh, Madhya Bharat, Vindhya Pradesh; only Chamar etc.",
      "type": "background",
      "date": "1950",
      "source": "court"
    },
    {
      "id": "f18",
      "text": "Scheduled Castes and Scheduled Tribes Orders Amendment Act 1956: Jatav included in Madhya Bharat but not Madhya Pradesh or Vindhya Pradesh.",
      "type": "background",
      "date": "1956-09-25",
      "source": "court"
    },
    {
      "id": "f19",
      "text": "After States Reorganisation, Scheduled Castes and Scheduled Tribes Lists (Modification) Order 1956: Jatav included in some districts (e.g., Bhind) but not Datia (former Vindhya Pradesh).",
      "type": "background",
      "date": "1956",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether respondent No. 1 Shri Kishorilal belongs to the Jatav caste; whether therefore he does not belong to scheduled caste and does not possess necessary qualifications for reserved SC seat in Bhander Assembly Constituency; whether Jatav is sub-caste of Chamar; whether Jatav recorded as SC for Bhander; whether entitled despite being voter in Seondha (Datia).",
      "framed_by": "lower_court"
    },
    {
      "id": "i2",
      "text": "Whether returned candidate was a member of scheduled caste and qualified to stand for reserved seat.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Returned candidate belongs to Jatav caste, not scheduled caste in Datia district; fraudulently concealed Jatav and represented as Chamar.",
      "supporting_facts": [
        "f5",
        "f6",
        "f7"
      ],
      "legal_basis": "Constitution (Scheduled Castes) Order 1950; Scheduled Castes and Scheduled Tribes Lists (Modification) Order 1956"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Belongs to Chamar caste; Jatav is sub-caste of Chamar; even if separate, Jatav recorded as SC for Bhander constituency.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": "s. 5 Representation of People Act, 1951"
    },
    {
      "id": "ra2",
      "text": "Certain section of Chamars in district call themselves Jatav as they gave up shoemaking; all Jatavs in Datia are Chamars; mention of Chamar includes them.",
      "supporting_facts": [],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "High Court rightly relied on pamphlets (P-16,17,18), resolutions (P-60), bonds (P-10,55,56) showing returned candidate as Jatav and office-bearer in Jatav organizations demanding separate recognition.",
      "addresses_issue": "i1",
      "key_observation": "Documents from 1960-1964 consistently show returned candidate as Jatav, not Chamar."
    },
    {
      "id": "cr2",
      "text": "Returned candidate's own evidence confused: claimed Chamar but admitted Jatav sub-caste and organized Jatav Sammelans.",
      "addresses_issue": "i1",
      "key_observation": "No proper foundation laid for case that Chamars wanted to be called Jatavs."
    },
    {
      "id": "cr3",
      "text": "Revenue entries as Chamar have presumptive value only, rebutted by representations for Jatav recognition; Collector directed recording as Jatav.",
      "addresses_issue": "i1",
      "key_observation": "Jatav exists as separate caste in Datia despite not officially recorded as SC."
    },
    {
      "id": "cr4",
      "text": "Jatav recognized as separate caste in statutory orders for Madhya Bharat etc.; cannot be same as Chamar per precedents; no inquiry permissible into sub-caste equivalence under Art. 341.",
      "addresses_issue": "i2",
      "key_observation": "Following Bhaiyalal and Basavalingappa, cannot establish Jatav same as Chamar."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Returned candidate belongs to Jatav caste, separate and distinct from Chamar; Jatav not included as scheduled caste in Datia district per Presidential Order; disqualified to contest reserved SC seat.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "No permissible inquiry whether Jatav is sub-caste or same as Chamar under Art. 341; must strictly follow scheduled castes specified in Orders.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Bhaiyalal v. Harikishan Singh",
      "citation": "1965 2 S.C.R. 877",
      "treatment": "followed",
      "relevance": "President authorised under Art. 341 to specify parts/groups of castes; no inquiry into sub-caste equivalence; Dohar not Chamar."
    },
    {
      "case_name": "Basavalingappa v. Munichinnappa",
      "citation": "1965 1 S.C.R. 316",
      "treatment": "followed",
      "relevance": "Generally not open to lead evidence that one caste is same as or includes another specified in Order."
    }
  ],
  "statutes_cited": [
    {
      "name": "Representation of the People Act, 1951",
      "sections": [
        "s. 81",
        "s. 116A",
        "s. 5"
      ],
      "relevance": "Filing election petition; appeals; qualifications for candidature."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 341"
      ],
      "relevance": "Specification of scheduled castes by President; limits on inquiry into caste status."
    },
    {
      "name": "Constitution (Scheduled Castes) Order 1950",
      "sections": [],
      "relevance": "Lists scheduled castes; Chamar included, Jatav not in relevant areas."
    },
    {
      "name": "Scheduled Castes and Scheduled Tribes Orders Amendment Act, 1956",
      "sections": [],
      "relevance": "Amended lists; Jatav included in some states/areas, not others."
    },
    {
      "name": "Scheduled Castes and Scheduled Tribes Lists (Modification) Order 1956",
      "sections": [],
      "relevance": "Post-reorganisation; Jatav not included in Datia district."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal by returned candidate (C.A. 2123/69) dismissed, upholding High Court finding of disqualification; cross-appeal (C.A. 2237/69) not pressed and dismissed.",
    "relief_granted": "Election of Kishorilal set aside by High Court upheld.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"It is difficult to disagree with the High Court that he had failed to prove that he was a Chamar and not a Jatav.\"",
      "speaker": "court",
      "significance": "Core finding on caste membership."
    },
    {
      "text": "\"Following these two decisions it must be held that the returned candidate, in the present case, was not entitled to establish that Jatav caste was the same as Chamar.\"",
      "speaker": "court",
      "significance": "Application of precedents barring sub-caste inquiry."
    },
    {
      "text": "\"I am a Chamar. I am not a Jatav. As a Jatav Chamar I did not organise any Sammelan...\"",
      "speaker": "returned_candidate",
      "significance": "Illustrates confusion in returned candidate's testimony."
    }
  ],
  "_case_id": "1971_615",
  "_label": 0,
  "_text_length": 31356,
  "_extracted_at": "2026-02-10T20:19:24.331182"
}