{
  "metadata": {
    "case_name": "Legal Representatives of Late Karam Chand Thapar v. Commissioner of Income-Tax",
    "case_year": 1970,
    "court": "Supreme Court of India",
    "judges": [
      "Hegde, J."
    ],
    "case_number": "Civil Appeals Nos. 1374 and 2146 to 2149 of 1970",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Late Karam Chand Thapar made certain cash gifts to his wife Smt. Mohini Thapar.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "From out of those gifts, she purchased certain shares and the balance amount she invested.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The shares earned dividends and the investments yielded interest.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The interest realised and the dividends earned were included in the income of Karam Chand Thapar for assessment years 1949-50, 1950-51, 1951-52, 1952-53 and 1953-54.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The assessee objected to the inclusion of that amount in his income.",
      "type": "procedural",
      "date": null,
      "source": "assessee"
    },
    {
      "id": "f6",
      "text": "Income-tax Officer held that dividends and interest were liable to be included in the income of the assessee.",
      "type": "procedural",
      "date": null,
      "source": "income_tax_officer"
    },
    {
      "id": "f7",
      "text": "Appellate Assistant Commissioner upheld the decision of the Income-tax Officer.",
      "type": "procedural",
      "date": null,
      "source": "appellate_assistant_commissioner"
    },
    {
      "id": "f8",
      "text": "Tribunal upheld the order of the Assistant Commissioner.",
      "type": "procedural",
      "date": null,
      "source": "tribunal"
    },
    {
      "id": "f9",
      "text": "At the instance of the assessee, questions were referred to Calcutta High Court under section 66(1) of the Indian Income-tax Act, 1922, for assessment year 1949-50 and similar for others.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "High Court answered the questions in favour of the revenue on July 30, 1963 and February 11, 1965.",
      "type": "procedural",
      "date": "1963-07-30",
      "source": "calcutta_high_court"
    },
    {
      "id": "f11",
      "text": "Appeals filed by legal representatives of Late Karam Chand Thapar by certificate.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "For assessment year 1949-50, income of Rs. 21,225 derived from deposits and shares held by assessee's wife.",
      "type": "material",
      "date": null,
      "source": "high_court_reference"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether on the facts and circumstances of the case, the income of Rs. 21,225 derived from deposits and shares held by the assessee's wife, Smt. Mohini Devi Thapar was income from assets directly or indirectly transferred by the assessee to his wife within the meaning of Section 16(3)(a)(iii) of the Income-tax Act.",
      "framed_by": "high_court"
    },
    {
      "id": "i2",
      "text": "Similar questions for other assessment years 1950-51 to 1953-54.",
      "framed_by": "high_court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "There is no nexus between the income earned and the transfer of the assets. Before an income can come within section 16(3)(a)(iii), it must be an income directly arising from the assets transferred.",
      "supporting_facts": [
        "f1",
        "f2",
        "f3"
      ],
      "legal_basis": "Section 16(3)(a)(iii) of the Income-tax Act; Commissioner of Income-Tax, West Bengal III v. Prem Bhai Parakh"
    },
    {
      "id": "pa2",
      "text": "Only such income which can be said to have directly sprung from the assets transferred can come within the scope of section 16(3)(a)(iii).",
      "supporting_facts": [
        "f2",
        "f3"
      ],
      "legal_basis": "Section 16(3)(a)(iii)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The incomes realised either as dividends from shares or as interest from deposits are income indirectly received in respect of the transfer of cash directly made.",
      "supporting_facts": [
        "f1",
        "f2",
        "f3",
        "f4"
      ],
      "legal_basis": "Section 16(3)(a)(iii)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The contention of the revenue appears to be sound. That position clearly emerges from the plain language of the section.",
      "addresses_issue": "i1",
      "key_observation": "The net cast by section 16(3)(a)(iii) includes not merely the income that arises directly from the assets transferred but also that arises indirectly from the assets transferred."
    },
    {
      "id": "cr2",
      "text": "The income that can be brought to tax under section 16(3)(a)(iii) must have a nexus with the assets transferred directly or indirectly. In this case the income concerned has a nexus with the assets transferred.",
      "addresses_issue": "i1",
      "key_observation": "Income has proximate connection with the transfer of the assets made by the assessee."
    },
    {
      "id": "cr3",
      "text": "Distinguished Prem Bhai Parakh case: There the connection between the gifts and the income was remote; here it is proximate.",
      "addresses_issue": "i1",
      "key_observation": "Ratio of Prem Bhai Parakh inapplicable as here income has proximate connection."
    },
    {
      "id": "cr4",
      "text": "Section 16(3) must receive strict construction. Before income can be held to come within section 16(3), it must be proved to have arisen directly or indirectly from a transfer of assets; connection must be proximate.",
      "addresses_issue": "i1",
      "key_observation": "Citing Keshavlal Lallubhai Patel."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The department was entitled to include the dividends and interest in question in computing the taxable income of the assessee under Section 16(3)(a)(iii).",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Commissioner of Income-Tax, West Bengal III v. Prem Bhai Parakh and others",
      "citation": "1970 77 I.T.R. p. 27",
      "treatment": "distinguished",
      "relevance": "Connection between gifts and minors' partnership income was remote; inapplicable here where nexus is proximate."
    },
    {
      "case_name": "Commissioner of Income-tax v. Keshavlal Lallubhai Patel",
      "citation": "1965 55 I.T.R.",
      "treatment": "followed",
      "relevance": "Section 16(3) must receive strict construction; connection between transfer and income must be proximate."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act, 1922",
      "sections": [
        "Section 16(3)(a)(iii)",
        "Section 66(1)"
      ],
      "relevance": "Inclusion of wife's income arising directly or indirectly from assets transferred by husband without adequate consideration; reference to High Court."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "All appeals fail and are dismissed. High Court's decision upheld that dividends and interest earned by assessee's wife from gifted cash invested in shares and deposits are includible in assessee's income under Section 16(3)(a)(iii).",
    "relief_granted": null,
    "costs": "Costs one set."
  },
  "key_quotes": [
    {
      "text": "\"The net cast by section 16(3)(a)(iii) includes not merely the income that arises directly from the assets transferred but also that arises indirectly from the assets transferred.\"",
      "speaker": "court",
      "significance": "Interprets scope of 'directly or indirectly' in Section 16(3)(a)(iii)."
    },
    {
      "text": "\"The connection between the transfer of assets and the income must be proximate. The income in question must arise as a result of the transfer and not in some manner connected with it.\"",
      "speaker": "court",
      "significance": "Key test for applicability of Section 16(3), distinguishing Prem Bhai case."
    },
    {
      "text": "\"Section 16(3) of the Act created an artificial income. That section must receive strict construction.\"",
      "speaker": "court",
      "significance": "Principle of strict construction applied."
    }
  ],
  "_case_id": "1971_386",
  "_label": 0,
  "_text_length": 7715,
  "_extracted_at": "2026-02-10T20:16:10.008491"
}