{
  "metadata": {
    "case_name": "Co-operative Society registered under Bombay Act v. Respondent Member",
    "case_year": 1967,
    "court": "Supreme Court of India",
    "judges": [
      "Khanna, J."
    ],
    "case_number": "Civil Appeal No. 1312 of 1967",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The appellant is a Co-operative Society registered in Bombay under the Bombay Co-operative Societies Act, 1925. The Head Office of the appellant is in Bombay and it has a branch in Mangalore.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "As the objects of the appellant were not confined to one State, it was governed by Multi-Unit Co-operative Societies Act of 1942 (Central Act).",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The appellant made a claim under section 54 of the Bombay Act in respect of a transaction which took place in Mangalore against the respondent who is a resident of Kasaragod, and was a member of the appellant society. Both Mangalore and Kasaragod were at the relevant time in Madras Presidency.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The Deputy Registrar of Co-operative Societies, Bombay gave an award regarding that claim.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The award was sought to be executed as a decree in the Court of Subordinate Judge, Kasaragod.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "An objection to the execution of the decree was raised by the respondent on the ground that the Deputy Registrar of Co-operative Societies, Bombay had no jurisdiction to pass the award and the same could not be executed as a decree in the Courts in Kerala.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f7",
      "text": "This objection was upheld by the Subordinate Judge and he dismissed the execution application.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "On appeal, the decision of the learned Subordinate Judge was affirmed by the Kerala High Court in Appeal Suit No.804 of 1969 by judgment dated October 22, 1962.",
      "type": "procedural",
      "date": "1962-10-22",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "It was not disputed before the High Court that the appellant was governed by the provisions of the Central Act.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "The respondent did not appear before the Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the Deputy Registrar of Co-operative Societies, Bombay had jurisdiction to pass the award under section 54 of the Bombay Act in respect of a dispute arising from a transaction at the Mangalore branch against a member resident in Kasaragod, given that the society is governed by the Central Act.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the expression 'control' in sub-section (1) of section 2 of the Central Act includes the adjudication of disputes between the society and its members.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The passing of an award came within the expression 'control' occurring in sub-section (1) of section 2 of the Central Act. As the appellant was registered in Bombay, it is the Bombay Act which governs the appellant society for purposes of registration, control and dissolution, and adjudication of a claim by the society against its members falls under 'control'.",
      "supporting_facts": [
        "f1",
        "f2",
        "f3"
      ],
      "legal_basis": "Multi-Unit Co-operative Societies Act, 1942, section 2(1); Bombay Co-operative Societies Act, 1925, section 54"
    },
    {
      "id": "pa2",
      "text": "There was no inherent lack of jurisdiction in the Deputy Registrar appointed under the Bombay Act for adjudicating upon the dispute; at best, it was a case of lack of territorial jurisdiction.",
      "supporting_facts": [
        "f4",
        "f5"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The Deputy Registrar of Co-operative Societies, Bombay had no jurisdiction to pass the award and the same could not be executed as a decree in the Courts in Kerala.",
      "supporting_facts": [
        "f3",
        "f5"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Plain perusal of sub-section (1) of section 2 of the Central Act makes it manifest that if the objects of a co-operative society registered in State A extend to State B, the Society shall be deemed to be registered in State B under the law in force in State B relating to co-operative societies. Despite this deemed registration in State B for purposes of registration, control and dissolution, the society shall be subject to the law relating to co-operative societies in force in State A.",
      "addresses_issue": "i1",
      "key_observation": "Deemed registration in Madras Presidency under Madras Co-operative Societies Act, 1932."
    },
    {
      "id": "cr2",
      "text": "The word 'control' is synonymous with superintendence, management or authority to direct, restrict or regulate. Control is exercised by a superior authority in exercise of its supervisory power. Adjudication of disputes is a judicial or quasi-judicial function and it would be unduly straining the meaning of the word 'control' to hold that it also covers the adjudication of disputes between a co-operative society and its members. There is a clear distinction between jurisdiction to decide a dispute which is a judicial power and the exercise of control which is an administrative power.",
      "addresses_issue": "i2",
      "key_observation": "'Control' does not comprehend adjudication of disputes."
    },
    {
      "id": "cr3",
      "text": "A dispute between the appellant and the respondent in respect of its dealings relating to its Mangalore branch would normally have to be adjudicated upon by the Registrar appointed under the Madras Act. The fact that for the purpose of control, the appellant society was governed by the Bombay Act would not justify a departure from the normal rule.",
      "addresses_issue": "i1",
      "key_observation": "Dispute arising from Mangalore branch falls under Madras Act."
    },
    {
      "id": "cr4",
      "text": "There was inherent lack of jurisdiction in the Registrar appointed under the Bombay Act for dealing with the dispute arising out of the dealings of the Mangalore branch of the appellant society with the respondent.",
      "addresses_issue": "i1",
      "key_observation": "Not mere territorial jurisdiction issue."
    },
    {
      "id": "cr5",
      "text": "The case of Panchshila Industrial Co-operative Societies (Mult Unit) v. The Gurgaon Central Co-operative Bank Ltd., Gurgaon is distinguished as the question involved was entirely different.",
      "addresses_issue": "i1",
      "key_observation": "No assistance to appellant from that precedent."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The word 'control' in section 2(1) of the Central Act does not include adjudication of disputes, which is a judicial function distinct from administrative control.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Deputy Registrar of Co-operative Societies, Bombay lacked inherent jurisdiction to pass the award under Bombay Act for a dispute from Mangalore branch dealings; such disputes fall under Madras Co-operative Societies Act, 1932.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Panchshila Industrial Co-operative Societies (Mult Unit) v. The Gurgaon Central Co-operative Bank Ltd., Gurgaon",
      "citation": null,
      "treatment": "distinguished",
      "relevance": "Dispute fell within section 55 of Punjab Co-operative Societies Act unaffected by Central Act; different question from present case."
    }
  ],
  "statutes_cited": [
    {
      "name": "Bombay Co-operative Societies Act, 1925",
      "sections": [
        "Section 54"
      ],
      "relevance": "Provision under which appellant made claim and award was passed; held inapplicable due to lack of jurisdiction."
    },
    {
      "name": "Multi-Unit Co-operative Societies Act, 1942",
      "sections": [
        "Section 2(1)",
        "Section 2(2)",
        "Section 2(3)",
        "Section 1(3)"
      ],
      "relevance": "Governs multi-unit society; 'control' does not include dispute adjudication; deemed registration in other states but subject to registration state's law for specified purposes."
    },
    {
      "name": "Madras Co-operative Societies Act, 1932",
      "sections": [
        "Section 51",
        "Section 2(f)",
        "Section 2(g)"
      ],
      "relevance": "Applicable for disputes touching business of registered/deemed registered society in Madras Presidency; Registrar there has jurisdiction."
    },
    {
      "name": "Co-operative Societies Act, 1912",
      "sections": [],
      "relevance": "Referenced for societies incorporated before Central Act."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court dismissed the appeal by special leave against the Kerala High Court judgment affirming the Subordinate Judge's dismissal of execution of the award, holding that the Deputy Registrar, Bombay lacked jurisdiction.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The word 'control' is synonymous with superintendence, management or authority to direct, restrict or regulate. Control is exercised by a superior authority in exercise of its supervisory power.",
      "speaker": "court",
      "significance": "Defines scope of 'control' excluding dispute adjudication."
    },
    {
      "text": "There is a clear distinction between jurisdiction to decide a dispute which is a judicial power and the exercise of control which is an administrative power and it would be wrong to treat the two as identical or equate one with the other.",
      "speaker": "court",
      "significance": "Core reasoning rejecting appellant's contention."
    },
    {
      "id": "kq3",
      "text": "We find ourselves unable to accede to this contention because we are of the opinion that there was inherent lack of jurisdiction in the Registrar appointed under the Bombay Act for dealing with the dispute arising out of the dealings of the Mangalore branch.",
      "speaker": "court",
      "significance": "Concludes on jurisdiction defect."
    }
  ],
  "_case_id": "1971_446",
  "_label": 0,
  "_text_length": 11704,
  "_extracted_at": "2026-02-10T20:16:49.959084"
}