{
  "metadata": {
    "case_name": "Appellants v. Respondents",
    "case_year": 1965,
    "court": "Supreme Court of India",
    "judges": [
      "Grover, J."
    ],
    "case_number": "Civil Appeals Nos. 1001 to 1003 of 1965",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Five different suits were filed against certain defendants on the foot of five different pronotes.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "All the five suits were heard together and were decreed by the trial judge.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f3",
      "text": "In respect of two suits the valuation being low the appeals were preferred before the District Judge and in three suits the appeals were filed in the High Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The High Court dismissed the appeals vide judgment and decree dated December 22, 1961 in First Appeals Nos. 82, 83 and 84 of 1958.",
      "type": "procedural",
      "date": "1961-12-22",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The learned subordinate judge had found that the suit transactions were genuine and execution on behalf of the firm as well as the passing of consideration had been proved.",
      "type": "admitted",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "The contesting defendants were joint with their uncle Manilal in 1949 and that they were the partners of the firm Surajmal Manilal being members of a trading family, and therefore they were liable to the extent of the assets of the joint family in their hands.",
      "type": "material",
      "date": "1949",
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "The assessment orders were produced not by the contesting defendants but by the son of Manilal who was the assessee.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the assessment orders are admissible in evidence when produced by the assessee himself, despite the bar under Section 54 of the Income Tax Act, 1922.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Reliance placed on assessment orders to decide whether the contesting defendants were the partners of firm Surajmal Manilal.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "Charu Chandra Kundu v. Gurupada Ghosh"
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Section 54 of the Income Tax Act, 1922 creates a complete bar to production by officials of the Income Tax Department and obliges them to treat records as confidential, but if produced by the assessee waiving privilege, admissible.",
      "addresses_issue": "i1",
      "key_observation": "Overwhelming weight of authority that assessment orders can be produced by the assessee or his representative-in-interest."
    },
    {
      "id": "cr2",
      "text": "Distinguished Charu Chandra Kundu v. Gurupada Ghosh as it involved directing Commissioner to produce records, not production by assessee himself.",
      "addresses_issue": "i1",
      "key_observation": "Prohibition under s.54 absolute when requiring public servant to produce, not obliterated by waiver in that context."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Assessment orders can be produced and admitted in evidence by the assessee or his representative-in-interest.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Mythili Ammal v. Janaki Ammal",
      "citation": "7 I.T.R. 657",
      "treatment": "referred",
      "relevance": "Statements in income tax returns not admissible against maker or others, nor by secondary evidence."
    },
    {
      "case_name": "Promatha Nath Pramanick v. Nirode Chandra Ghose",
      "citation": "7 I.T.R. 570",
      "treatment": "referred",
      "relevance": "Startling if joint assessee permitted use of confidential assessment order against co-assessee."
    },
    {
      "case_name": "Rama Rao v. Venkataramayya",
      "citation": "8 I.T.R. 450",
      "treatment": "followed",
      "relevance": "Return confidential to third parties but maker can have copy for own purposes and produce in court."
    },
    {
      "case_name": "Emperor v. Osman Chotani",
      "citation": "1942 10 I.T.R. 429",
      "treatment": "followed",
      "relevance": "Assessment orders producible by assessee or representative-in-interest."
    },
    {
      "case_name": "Suraj Narain v. Seth Jhabhu Lal",
      "citation": "1945 13 I.T.R. 13",
      "treatment": "followed",
      "relevance": "Assessment orders producible by assessee or representative-in-interest."
    },
    {
      "case_name": "Buchibai v. Nagpur University",
      "citation": "1947 15 I.T.R. 150",
      "treatment": "followed",
      "relevance": "Assessment orders producible by assessee or representative-in-interest."
    },
    {
      "case_name": "Charu Chandra Kundu v. Gurupada Ghosh",
      "citation": "1962 2 S.C.R. 833",
      "treatment": "distinguished",
      "relevance": "Prohibition absolute when court directs public servant to produce; not applicable to assessee production."
    }
  ],
  "statutes_cited": [
    {
      "name": "Income Tax Act, 1922",
      "sections": [
        "Section 54"
      ],
      "relevance": "Creates confidentiality bar for public servants but allows production by assessee waiving privilege."
    },
    {
      "name": "Indian Evidence Act, 1872",
      "sections": [
        "Section 64"
      ],
      "relevance": "Secondary evidence of income returns not admissible per some High Courts."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeals challenging the Orissa High Court's dismissal of appeals against the trial court's decree on pronotes are dismissed, upholding the admissibility of assessment orders produced by the assessee.",
    "relief_granted": null,
    "costs": "Dismissed with costs. One hearing fee."
  },
  "key_quotes": [
    {
      "text": "\"the law laid down by these cases on the admissibility of evidence of assessment orders produced by an assessee or his representative-in-interest is unexceptionable.\"",
      "speaker": "court",
      "significance": "Core holding on admissibility."
    },
    {
      "text": "\"There is an overwhelming weight of authority in favour of the view that assessment orders could be produced by the assessee or his representative-in-interest\"",
      "speaker": "court",
      "significance": "Summarizes judicial consensus."
    }
  ],
  "_case_id": "1971_36",
  "_label": 0,
  "_text_length": 6988,
  "_extracted_at": "2026-02-10T20:14:12.191198"
}