{
  "metadata": {
    "case_name": "Assessee Firm v. Commissioner of Income-tax",
    "case_year": 1968,
    "court": "Supreme Court of India",
    "judges": [
      "Hegde, J."
    ],
    "case_number": "Civil Appeal No. 1947 of 1968",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The assessee is a firm constituted under an instrument of partnership dated April 30, 1947. The shares of the partners in profit and loss are: L. Khanjan Lal--/4/-, L. Lalloo Ram--/2/-, L. Dwarka Prasad--/2/-, L. Ram Lal--/2/-, L. Sewak Ram--/4/-, Smt. Jagrani Devi--/2/-. First group (Khanjan Lal and sons) has 10/- share, second group (Sewak Ram and mother) has 6/- share.",
      "type": "background",
      "date": "1947-04-30",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The assessee firm was registered for the assessment year 1947-48.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On July 12, 1949, the partners applied to the Income-tax Officer for renewal of registration for assessment year 1948-49, signed by all partners, appending a certificate that profits of the previous year were divided or credited as shown.",
      "type": "procedural",
      "date": "1949-07-12",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On November 5, 1949, the partnership was dissolved under a deed dated November 9, 1949. One clause provides: 'But if an amount which was not entered in the books at the time of settlement is found then only that person will be accountable for it through whom the money was received or paid. None of the parties will have any objection to it.'",
      "type": "material",
      "date": "1949-11-05",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "On October 5, 1950, the first four partners made a disclosure statement to the Income-tax Officer that the firm had earned Rs. 15,000/- by way of profits outside the books, and those profits had been divided between the partners.",
      "type": "material",
      "date": "1950-10-05",
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "On December 9, 1950, Sewak Ram stated on oath before the Income-tax Officer that he and his mother Jagrani Devi were not given full share of the profits earned by the firm in the previous year. The entire profits earned were not recorded in the books, and the first four partners had given to him and his mother only their shares of those profits which were recorded in the books. He sought to withdraw the application for registration because all profits had not been divided according to shares. Unrecorded profits amounted to Rs. 1,13,571/-",
      "type": "disputed",
      "date": "1950-12-09",
      "source": "respondent"
    },
    {
      "id": "f7",
      "text": "From the statements, the firm was trying to evade tax on a portion of profits by not bringing them into books.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "On March 31, 1951, Sewak Ram sued the first four partners for rendition of accounts, estimating his share of unentered profits at Rs. 50,000/-. The suit was compromised, and Sewak Ram withdrew it, stating he was not entitled to any more amount from the defendants.",
      "type": "procedural",
      "date": "1951-03-31",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "On March 15, 1952, Sewak Ram and Jagrani Devi applied to the Income-tax Officer withdrawing their signatures on the renewal application, stating profits were not distributed according to the deed, and no certificate under rule 4(1) of IT Rules 1922 was granted on the partnership deed.",
      "type": "procedural",
      "date": "1952-03-15",
      "source": "respondent"
    },
    {
      "id": "f10",
      "text": "Income-tax Officer concluded firm earned considerable black market profits not distributed per deed, application withdrawn, refused renewal, taxed as association of persons.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Appellate Assistant Commissioner upheld ITO.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Income-tax Appellate Tribunal: Both members found substantial unentered profits not distributed per deed. Judicial member: no renewal. Accountant member: book profits distributed suffices. President agreed with Judicial member.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Tribunal referred question to High Court under s.66(1): 'Whether the assessee firm which had distributed its book profits amongst the partners according to the Instrument of Partnership but which had not distributed the profits earned by it in the black market amongst the six partners in accordance with the Instrument of Partnership was entitled for renewal of registration for the assessment year 1948-49?' High Court answered in favour of Department.",
      "type": "procedural",
      "date": "1964-01-21",
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "Appeal to Supreme Court by certificate. Question of withdrawal of application not before SC.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the assessee firm which had distributed its book profits amongst the partners according to the Instrument of Partnership but which had not distributed the profits earned by it in the black market amongst the six partners in accordance with the Instrument of Partnership was entitled for renewal of registration for the assessment year 1948-49?",
      "framed_by": "lower_court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Sought to assail correctness of Tribunal findings that book profits distributed but black profits not, on ground not supported by evidence.",
      "supporting_facts": [],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Relied on HC decisions: D Costa Brothers (household expenses), Sat Ram Gian Chand (internal division), NSS Chokkalingam (salary to partners), Mandanlal (interest on capital), St Josephs (profits to reserve).",
      "supporting_facts": [],
      "legal_basis": "Various High Court precedents"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Application for renewal did not comply with para 3 of rule 6 as certificate false; unentered profits not divided/credited.",
      "supporting_facts": [
        "f6",
        "f7",
        "f9",
        "f12"
      ],
      "legal_basis": "s.26A, rule 6 para 3, rule 6A of IT Rules 1922"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Bound by Tribunal findings that book profits distributed but black profits not divided per deed. Certificate in renewal application must certify all profits divided/credited as shown; false certificate as substantial profits not divided.",
      "addresses_issue": "i1",
      "key_observation": "Purpose of rule 6: ensure all profits divided so partners taxed, as registered firm not taxable."
    },
    {
      "id": "cr2",
      "text": "Conditions for registration/renewal under s.26A and rules: application in prescribed form verified manner, genuine firm per deed. ITO bound if complied.",
      "addresses_issue": "i1",
      "key_observation": "Application non-compliant with para 3 rule 6."
    },
    {
      "id": "cr3",
      "text": "Distinguished relied precedents: no issue of undistributed/unentered profits in those cases.",
      "addresses_issue": "i1",
      "key_observation": "Those cases irrelevant as profits fully divided."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Application for renewal did not comply with conditions in para 3 of rule 6; ITO justified in refusing renewal.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Agarwal Co. v. Commissioner of Income-tax, U.P.",
      "citation": "77 I.T.R. 10",
      "treatment": "followed",
      "relevance": "Conditions for registration under s.26A and rules; ITO bound if fulfilled."
    },
    {
      "case_name": "Commissioner of Income-tax v. D Costa Brothers",
      "citation": "49 I.T.R. 181",
      "treatment": "distinguished",
      "relevance": "Household expenses debited; no issue of undistributed profits."
    },
    {
      "case_name": "Commissioner of Income-tax v. Sat Ram Gian Chand",
      "citation": "42 I.T.R. 543",
      "treatment": "distinguished",
      "relevance": "Profit division internal; no relevance to non-division."
    },
    {
      "case_name": "N. S. S. Chokkalingam Chettiar & Co. v. C.I.T. Madras",
      "citation": "60 I.T.R. 671",
      "treatment": "distinguished",
      "relevance": "Salary to partners deducted before division; genuine firm."
    },
    {
      "case_name": "C.I.T., M.P. v. Mandanlal Chhagan Lal",
      "citation": "50 I.T.R. 477",
      "treatment": "distinguished",
      "relevance": "Interest on capital before division; no non-division."
    },
    {
      "case_name": "St. Josephs Provisions Store v. C.I.T., Kerala",
      "citation": null,
      "treatment": "distinguished",
      "relevance": "Profits credited to reserve showing shares; fully divided."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act, 1922",
      "sections": [
        "Section 26A",
        "Section 66(1)",
        "Section 5A(7)"
      ],
      "relevance": "Application and renewal of registration; reference to High Court."
    },
    {
      "name": "Income-tax Rules, 1922",
      "sections": [
        "Rule 6 para 3",
        "Rule 6A",
        "Rule 4(1)"
      ],
      "relevance": "Certificate requirements for renewal; form and satisfaction for grant/refusal."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court upheld High Court and Tribunal; refused renewal of registration for 1948-49 as application non-compliant with rule 6 para 3 due to false certificate on undistributed black profits; taxed as association of persons.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"the certificate contemplated by rule 6 is not a mere formality. It has a definite purpose.\"",
      "speaker": "court",
      "significance": "Explains rationale for requiring true certificate on profit division."
    },
    {
      "text": "\"If a portion of the profits earned by the firm was not actually divided amongst the partners or credited to their accounts, then the only course open to the Income-tax Officer was not to register that firm\"",
      "speaker": "court",
      "significance": "Core holding on consequence of non-division."
    }
  ],
  "_case_id": "1971_292",
  "_label": 0,
  "_text_length": 17806,
  "_extracted_at": "2026-02-10T20:15:38.229829"
}