{
  "metadata": {
    "case_name": "Appellant v. Odyuo",
    "case_year": 1970,
    "court": "Supreme Court of India",
    "judges": [
      "Ray, J."
    ],
    "case_number": "Civil Appeal No. 1792 of 1970",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appeal under s. 116A of the Representation of the People Act, 1951 from judgment and order dated July 17, 1970 of the Assam and Nagaland High Court in Election Petition No. 1 of 1969 dismissing the appellant's election petition.",
      "type": "procedural",
      "date": "1970-07-17",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The appellant, respondent No. 1 Odyuo and respondents No. 2 and 3 were candidates at 37-Wokha Constituency at the election held in February 1969 for constituting a new Legislative Assembly of Nagaland.",
      "type": "background",
      "date": "1969-02",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Respondent Odyuo declared elected with 1517 votes, appellant obtained 1485 votes, margin of 32 votes.",
      "type": "material",
      "date": "1969-02",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Appellant challenged election of respondent Odyuo on grounds: result materially affected by improper reception of 348 votes cast for Odyuo by personnel of 12th Battalion Assam Rifles posted at Wokha and wives of some, who under s.20(3) of 1950 Act were not eligible to be enrolled in Wokha electoral roll.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "Majority of 348 voters were not citizens of India, votes void; excluding them or majority, appellant had majority of valid votes.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "Personnel of 12th Battalion Assam Rifles registered as service electors in last part of electoral roll for 37-Wokha Constituency.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Personnel resided at Wokha 10 years prior to preparation of electoral rolls and at time of preparation.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Service personnel made statements under s.20(5) 1950 Act that but for service qualification they would have been ordinarily resident at Wokha; wives residing with them; submitted prescribed forms to Registration Officer.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Electoral Registration Officer accepted statements as correct and registered them.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Appellant alleged 37 of 348 service electors not Indian citizens (35 Nepali, 2 Sikkimese); out of remaining except 69, rest not citizens; per application dated 4 October 1969.",
      "type": "disputed",
      "date": "1969-10-04",
      "source": "petitioner"
    },
    {
      "id": "f11",
      "text": "Appellant's evidence: not clear if service electors citizens; heard from Record Officer at Shillong many not citizens (hearsay).",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f12",
      "text": "PW6 Dhrubajyoti Lahiri: Long Roll (Exhibits 17,18) no column for nationality; prepared Exhibit 19 list; home addresses some Nepal; called Nepali in common parlance; but service personnel filled forms declaring Indian citizens; Lahiri asked and they said Indian citizens.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f13",
      "text": "Electoral Registration Officer satisfied with declarations of Indian citizenship.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Service personnel statements (Exhibit 6 series, A series) declared Indian citizens, verified by Record Officer.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f15",
      "text": "No objection taken at any stage to names on citizenship ground; no notice or opportunity to service personnel; none examined.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f16",
      "text": "High Court: directions for preparation checked forms, sorted by constituency.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether personnel of 12th Battalion Assam Rifles whose names registered as service electors in last part of electoral roll for 37-Wokha would, but for service qualification, have been ordinarily resident of Wokha under s.20(3) 1950 Act.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether any electors registered as service electors in last part of electoral roll were not Indian citizens.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Electoral Registration Officer had no jurisdiction to register 12th Battalion personnel as voters in Wokha as under s.20(3) 1950 Act service personnel deemed ordinarily resident where they would have been but for service qualification; cannot register where posted/stationed.",
      "supporting_facts": [
        "f4",
        "f6"
      ],
      "legal_basis": "Section 20(3) Representation of the People Act, 1950"
    },
    {
      "id": "pa2",
      "text": "Service personnel not ordinarily resident in Wokha in eye of law; not eligible; Registration Officer acted on orders of Chief Electoral Officer without discretion.",
      "supporting_facts": [
        "f4",
        "f7"
      ],
      "legal_basis": "Section 20(3),(5),(6),(8) 1950 Act; Rule 7 Registration of Electors Rules, 1960"
    },
    {
      "id": "pa3",
      "text": "Majority of 348 service electors not Indian citizens; votes void; materially affected result.",
      "supporting_facts": [
        "f5",
        "f10",
        "f11",
        "f12"
      ],
      "legal_basis": "Article 326 Constitution; Sections 16,62 Representation of the People Act 1951; Section 100(1)(d)(iii) 1951 Act; Section 16 1950 Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Service personnel indisputably had service qualification; made statements under s.20(5) accepted absent contrary evidence; chose Wokha as ordinary residence.",
      "supporting_facts": [
        "f8",
        "f9",
        "f13",
        "f14"
      ],
      "legal_basis": "Section 20(5),(6) 1950 Act"
    },
    {
      "id": "ra2",
      "text": "Declarations of citizenship verified; no evidence to contrary; no objections or opportunity given.",
      "supporting_facts": [
        "f14",
        "f15"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Finality of electoral roll cannot be challenged in election validity proceeding; civil court no jurisdiction to adjudicate entitlement to register or ERO actions under ss.14-24,30 1950 Act.",
      "addresses_issue": "i1",
      "key_observation": "Electoral roll final per precedents."
    },
    {
      "id": "cr2",
      "text": "Service personnel statements under s.20(5) accepted as correct absent contrary evidence; they resided long at Wokha, stated ordinarily resident there but for service qual; fiction allows home or service place registration.",
      "addresses_issue": "i1",
      "key_observation": "ERO within jurisdiction; statutory fiction does not restrict to home town."
    },
    {
      "id": "cr3",
      "text": "Registration process followed directions; declarations checked, verified, sorted; statutory authority decision unchallenged on record.",
      "addresses_issue": "i1",
      "key_observation": "No evidence of mechanical action."
    },
    {
      "id": "cr4",
      "text": "No substantive evidence non-citizenship; appellant's evidence hearsay/uncorroborated; PW6 evidence unreliable (no nationality column, common parlance, but declarations of citizenship); overwhelming evidence of declarations as citizens.",
      "addresses_issue": "i2",
      "key_observation": "Allegations unsubstantiated."
    },
    {
      "id": "cr5",
      "text": "Lack of ERO power could ground improper reception under s.100(1)(d)(iii) 1951 Act, but here no such lack.",
      "addresses_issue": "i1",
      "key_observation": "Per Baidyanath precedent, but inapplicable."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Civil court has no jurisdiction to question validity of service electors' registration in electoral roll of Wokha Constituency.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "No evidence to displace statements under s.20(5); service personnel validly registered at Wokha.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "No evidence service personnel not Indian citizens; declarations accepted.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "B. M. Ramaswamy v. B. M. Krishnamurthy Ors.",
      "citation": "1963 3 S.C.R. 479",
      "treatment": "followed",
      "relevance": "Finality of electoral roll cannot be challenged in election validity proceeding."
    },
    {
      "case_name": "Kabul Singh v. Kundan Singh Ors.",
      "citation": "1970 1 S.C.R. 845",
      "treatment": "followed",
      "relevance": "Effect of s.30 1950 Act: complete code for electoral rolls; no civil court jurisdiction over registration questions."
    },
    {
      "case_name": "Baidyanath Panjiar v. Sitaram Mahto Ors.",
      "citation": "1970 1 S.C.R. 839",
      "treatment": "followed",
      "relevance": "Lack of ERO power to register in violation of statutes grounds improper reception under s.100(1)(d)(iii) 1951 Act."
    }
  ],
  "statutes_cited": [
    {
      "name": "Representation of the People Act, 1950",
      "sections": [
        "16",
        "20(3)",
        "20(5)",
        "20(6)",
        "20(8)",
        "30"
      ],
      "relevance": "Defines ordinarily resident for service personnel; statements accepted absent contrary evidence; finality of rolls; disqualifies non-citizens."
    },
    {
      "name": "Representation of the People Act, 1951",
      "sections": [
        "62",
        "100(1)(d)(iii)",
        "116A"
      ],
      "relevance": "Prohibits non-qualified voting; improper/void votes ground to avoid election; appeal provision."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "326"
      ],
      "relevance": "Confers voting rights on citizens."
    },
    {
      "name": "Registration of Electors Rules, 1960",
      "sections": [
        "7"
      ],
      "relevance": "Prescribed forms for service declarations."
    },
    {
      "name": "Army Act, 1950",
      "sections": [],
      "relevance": "Applicable to Assam Rifles personnel as service qualification."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court dismissed the appeal, upholding the High Court's dismissal of the election petition, finding no merit in challenges to service electors' registration or citizenship, as electoral roll final and no evidence to contrary.",
    "relief_granted": "None",
    "costs": "Appeal dismissed with costs."
  },
  "key_quotes": [
    {
      "text": "This Court in B. M. Ramaswamy v. B. M. Krishnamurthy Ors. held that the finality of the electoral roll cannot be challenged in a proceeding impeaching the validity of the election.",
      "speaker": "court",
      "significance": "Establishes core principle barring challenge to rolls in election petitions."
    },
    {
      "text": "The effect of section 20(5) of the 1950 Act is that statement of a member having service qualification is to be accepted as correct in the absence of evidence to the contrary.",
      "speaker": "court",
      "significance": "Key statutory interpretation upholding registration."
    },
    {
      "text": "There is no evidence to substantiate the allegation which was made that members of the service personnel were not Indian citizens.",
      "speaker": "court",
      "significance": "Rejects citizenship challenge for lack of proof."
    }
  ],
  "_case_id": "1971_581",
  "_label": 0,
  "_text_length": 15563,
  "_extracted_at": "2026-02-10T20:19:27.945372"
}