{
  "metadata": {
    "case_name": "Union of India v. Ram Kishan",
    "case_year": 1967,
    "court": "Supreme Court of India",
    "judges": [
      "Sikri, C.J."
    ],
    "case_number": "Civil Appeal No. 571 of 1967",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Respondent Ram Kishan, a Foot Constable, filed a suit in the Court of Sub-Judge 1st Class, Delhi, challenging his dismissal from service by order dated 25th October, 1960 passed by Shri M. K. Saxena, Superintendent of Police Traffic, Delhi.",
      "type": "material",
      "date": "1960-10-25",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Plaintiff alleged dismissal order was bad and illegal: (1) Shri M. K. Saxena was not a District Superintendent of Police; (2) Mandatory provisions of Punjab Police Rule 16.38 violated as no information given to District Magistrate, who never decided whether preliminary investigation by police or selected Magistrate 1st Class; sub-Rule 2 of Rule 16.38 not observed.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "Learned Sub-Judge decreed the suit, gave declaration that dismissal was void, and passed decree for Rs. 1151/- in favour of Foot Constable.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f4",
      "text": "Issues framed included: (1) Whether Superintendent of Police Traffic competent to pass impugned order; (2) Whether provisions of Rules 16.38 and 16.24 of Punjab Police Rules complied with by defendant, if not to what effect.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "Sub-Judge held issue No. 1 against Government, order of dismissal vitiated; on issue No. 2, complete compliance of Rule 16.24; necessary permission of District Magistrate obtained vide Ex. P.9A for Rule 16.38.",
      "type": "admitted",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "Government filed appeal to Additional District Judge, which was dismissed.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Government filed Regular Second Appeal No. 28-D of 1966 before Punjab High Court, Circuit Bench at Delhi; Mehar Singh, J. following Division Bench decision dated March 4, 1964 held Mr. M. K. Saxena not competent to dismiss plaintiff; no leave for Letters Patent Appeal.",
      "type": "procedural",
      "date": "1966-10-12",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Government obtained special leave, appeal before Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Permission relied on by Government: MEMO referring memorandum No. 4425/T dated 8th February, 1960 - 'I agree to departmental action being taken against F.C. Ram Kishan No. 4494.'",
      "type": "admitted",
      "date": "1960-02-08",
      "source": "respondent"
    },
    {
      "id": "f10",
      "text": "No immediate information given to District Magistrate of complaint against plaintiff; District Magistrate did not decide whether investigation by police or Magistrate 1st Class.",
      "type": "disputed",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the Superintendent of Police Traffic, Delhi (Shri M. K. Saxena) was competent to pass the impugned dismissal order.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the provisions of Punjab Police Rules 16.38 and 16.24 were complied with, and if not, to what effect.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Necessary permission of District Magistrate for departmental action obtained vide Ex. P.9A; complete compliance with Rule 16.24.",
      "supporting_facts": [
        "f5",
        "f9"
      ],
      "legal_basis": "Punjab Police Rule 16.38; Ex. P.9A"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Superintendent of Police Traffic not competent as not District Superintendent of Police; provisions of Rule 16.38 violated - no information to District Magistrate, no decision on investigation.",
      "supporting_facts": [
        "f2"
      ],
      "legal_basis": "Punjab Police Rule 16.38"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "First issue concluded against plaintiff by Union of India v. Jagjit Singh.",
      "addresses_issue": "i1",
      "key_observation": "Competence of SP Traffic upheld per precedent."
    },
    {
      "id": "cr2",
      "text": "Provisions of Rule 16.38 not complied with: no immediate information to District Magistrate of complaint; DM did not decide on investigation by police or Magistrate; permission under sub-Rule 2 purportedly given but first part of Rule not complied with, vitiating inquiry.",
      "addresses_issue": "i2",
      "key_observation": "Even assuming directory, no substantial compliance; similar to Delhi Admn. v. Chanan Shah where sanction without informing DM of prior inquiry held invalid."
    },
    {
      "id": "cr3",
      "text": "District Magistrate gave sanction without recording reasons or applying mind to requirements of Rule 16.38.",
      "addresses_issue": "i2",
      "key_observation": "Departmental action invalid."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "SP Traffic competent to dismiss per Union of India v. Jagjit Singh.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Departmental inquiry vitiated due to non-compliance with Rule 16.38(1); order of dismissal illegal.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Union of India v. Jagjit Singh",
      "citation": "1970 1 S.C.R. 163, 168",
      "treatment": "followed",
      "relevance": "Concluded first issue against plaintiff on competence of SP Traffic."
    },
    {
      "case_name": "Delhi Admn. v. Chanan Shah",
      "citation": "1969 3 S.C.R. 658",
      "treatment": "followed",
      "relevance": "No substantial compliance with Rule 16.38 even if directory; sanction without proper information invalidates departmental action."
    },
    {
      "case_name": "Division Bench decision of Punjab High Court",
      "citation": "dated March 4, 1964",
      "treatment": "referred",
      "relevance": "Followed by High Court on incompetence of SP Traffic."
    }
  ],
  "statutes_cited": [
    {
      "name": "Punjab Police Rules",
      "sections": [
        "16.38",
        "16.24"
      ],
      "relevance": "Rule 16.38 mandatory in first part - requires immediate info to DM and decision on investigation; non-compliance vitiates inquiry; Rule 16.24 procedure to be followed if departmental."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal dismissed as departmental inquiry vitiated by non-compliance with Punjab Police Rule 16.38, though SP Traffic held competent per precedent.",
    "relief_granted": "Dismissal order declared illegal (upholding lower courts on this ground)",
    "costs": "Dismiss with costs"
  },
  "key_quotes": [
    {
      "text": "\"It is not necessary to decide... whether the provisions of Rule 16.38... are mandatory or directory. Even assuming that the rule is directory we find that there has been no substantial compliance with its provisions.\"",
      "speaker": "court",
      "significance": "From Delhi Admn. v. Chanan Shah, applied to hold non-compliance here."
    },
    {
      "text": "\"In the present case no immediate information was given to the District Magistrate... nor did the District Magistrate decide whether the investigation... by a police officer, or made over to a selected magistrate... the departmental inquiry is vitiated.\"",
      "speaker": "court",
      "significance": "Core holding on Rule 16.38 violation."
    },
    {
      "text": "\"I agree to departmental action being taken against F. C. Ram Kishan No. 4494.\"",
      "speaker": "court",
      "significance": "DM's memo relied on by Government, held insufficient without compliance with Rule 16.38(1)."
    }
  ],
  "_case_id": "1971_578",
  "_label": 0,
  "_text_length": 6542,
  "_extracted_at": "2026-02-10T20:19:22.816030"
}