{
  "metadata": {
    "case_name": "Panchshila Industrial Cooperative Society Multi Unit v. Gurgaon Central Cooperative Bank Ltd.",
    "case_year": 1970,
    "court": "Supreme Court of India",
    "judges": [
      "Sikri, C.J."
    ],
    "case_number": "Civil Appeal No. 2293 of 1970",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The respondent Bank approached the Registrar of Cooperative Societies Haryana for resolving a dispute between the Bank and one of its members, the appellant.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The Registrar by his order dated February 17, 1968, in exercise of the powers vested in him under S. 56 of the Punjab Co-operative Societies Act, 1961, referred the dispute to the Deputy Registrar Cooperative Societies Rohtak for decision.",
      "type": "procedural",
      "date": "1968-02-17",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The arbitrator (Deputy Registrar of Cooperative Societies Rohtak) gave the award on October 7, 1969, directing that the appellant do pay to the respondent in all Rs. 16,05,658 - 20 together with interest at the rate of six and a half per cent per annum until the realisation of the principal amount viz. Rs. 11,52,535 00.",
      "type": "procedural",
      "date": "1969-10-07",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The appellant filed an appeal against this award before the Central Registrar of Cooperative Societies New Delhi (Appeal No. CR/1/70).",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The Central Registrar dismissed the appeal by order dated May 4, 1970, holding that he was the appropriate appellate authority against the award.",
      "type": "procedural",
      "date": "1970-05-04",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The appellant was registered in December 1955 under the Punjab Cooperative Societies Act, 1955, and by virtue of the States Reorganisation Act, 1956, and S. 5A of the Multi-Unit Co-operative Societies Act, 1942, the appellant has become a multi-unit cooperative society.",
      "type": "background",
      "date": "1955-12",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "The respondent Bank is a cooperative society governed by the provisions of the Punjab Co-operative Societies Act 1961.",
      "type": "background",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the Central Registrar was the appropriate authority on the facts of this case to hear the appeal against the award.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The Central Registrar was not the appropriate appellate authority because the appellant has become a multi-unit cooperative society by virtue of the States Reorganisation Act, 1956, and S. 5A of the Multi-Unit Co-operative Societies Act, 1942, and has ceased to be governed by the provisions of the Punjab Co-operative Societies Act.",
      "supporting_facts": [
        "f6",
        "f7"
      ],
      "legal_basis": "Multi-Unit Co-operative Societies Act, 1942 S.5A; States Reorganisation Act, 1956"
    },
    {
      "id": "pa2",
      "text": "The Central Registrar should not have dismissed the appeal but returned the memorandum of appeal for presentation to the proper authority.",
      "supporting_facts": [
        "f4",
        "f5"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The dispute between the respondent Bank and the appellant fell within S. 55 of the Punjab Co-operative Societies Act, 1961, and was properly referred to arbitration under that section.",
      "addresses_issue": "i1",
      "key_observation": "There is no doubt that the dispute between the respondent Bank and the appellant fell within S. 55 and was properly referred to arbitration under that section."
    },
    {
      "id": "cr2",
      "text": "By virtue of the States Reorganisation Act, 1956, and S. 5A of the Multi-Unit Co-operative Societies Act, 1942, the appellant has become a multi-unit cooperative society but that Act has no impact on S. 55 of the Punjab Co-operative Societies Act, 1961, as the appellant remains a member of the respondent Bank, which is governed by the Punjab Act.",
      "addresses_issue": "i1",
      "key_observation": "There is nothing in the provisions of the Multi-Unit Co-operative Societies Act to indicate that a multi-unit cooperative society cannot be a member of a cooperative society governed by the Punjab Act of 1961."
    },
    {
      "id": "cr3",
      "text": "An appeal against the award lies under S. 68 of the Punjab Co-operative Societies Act, 1961, to the Government if the decision or order was made by the Registrar, and to the Registrar if made by any other person; thus, the Central Registrar had no jurisdiction to hear the appeal.",
      "addresses_issue": "i1",
      "key_observation": "It is quite clear therefore, that the Central Registrar had no jurisdiction to hear the appeal."
    },
    {
      "id": "cr4",
      "text": "There is no statutory provision enabling the Central Registrar to return the appeal for presentation to the proper authority; if an appeal is filed before the appropriate authority under the Punjab Act, that authority will consider S. 14 of the Limitation Act, 1963 read with S. 29(2).",
      "addresses_issue": "i1",
      "key_observation": "There is no statutory provision enabling the Central Registrar to do so."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The Central Registrar had no jurisdiction to hear the appeal against the award passed by the Deputy Registrar under the Punjab Co-operative Societies Act, 1961.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Punjab Co-operative Societies Act, 1961",
      "sections": [
        "55(1)",
        "55(2)",
        "55(3)",
        "56",
        "68"
      ],
      "relevance": "Governs disputes between member and society (S.55), reference to arbitration (S.56), and appeals (S.68); applies to the dispute and award."
    },
    {
      "name": "Multi-Unit Co-operative Societies Act, 1942",
      "sections": [
        "5A"
      ],
      "relevance": "Made appellant a multi-unit society but does not impact S.55 of Punjab Act as appellant remains member of respondent society."
    },
    {
      "name": "States Reorganisation Act, 1956",
      "sections": [],
      "relevance": "Contributed to appellant becoming multi-unit cooperative society."
    },
    {
      "name": "Limitation Act, 1963",
      "sections": [
        "14",
        "29(2)"
      ],
      "relevance": "Appropriate authority may consider for excluding time spent pursuing appeal before wrong forum."
    },
    {
      "name": "Punjab Cooperative Societies Act, 1955",
      "sections": [],
      "relevance": "Appellant originally registered under this Act."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal by special leave against the order of the Central Registrar dismissing the appeal against the arbitrator's award is dismissed, confirming that the Central Registrar lacked jurisdiction; appropriate authority under Punjab Act may consider Limitation Act provisions if appeal refiled.",
    "relief_granted": null,
    "costs": "dismissed with costs"
  },
  "key_quotes": [
    {
      "text": "The only question which arises before us is whether the Central Registrar was the appropriate authority on the facts of this case.",
      "speaker": "court",
      "significance": "States the sole issue for decision."
    },
    {
      "text": "It is quite clear therefore, that the Central Registrar had no jurisdiction to hear the appeal.",
      "speaker": "court",
      "key_observation": "Core holding on jurisdiction."
    },
    {
      "text": "In the result the appeal fails and is dismissed with costs.",
      "speaker": "court",
      "significance": "Final disposition of the appeal."
    }
  ],
  "_case_id": "1971_589",
  "_label": 0,
  "_text_length": 5556,
  "_extracted_at": "2026-02-10T20:19:13.105022"
}