{
  "metadata": {
    "case_name": "Legal Representatives of Chiranji Lal Khaitan v. Respondent No. 1",
    "case_year": 1966,
    "court": "Supreme Court of India",
    "judges": [
      "Hegde, J."
    ],
    "case_number": "Civil Appeal No. 1973 of 1966",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The plaintiff was the owner of the suit property described in Sch. III, a vacant plot.",
      "type": "background",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f2",
      "text": "The plaintiff leased out the property orally to the defendant in June 1943 on a monthly rental of Rs. 20/- for the purpose of carrying on his motor business.",
      "type": "material",
      "date": "1943-06",
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "In 1947, without the plaintiff's knowledge, the defendant constructed several structures on the land.",
      "type": "disputed",
      "date": "1947",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "In 1948, the plaintiff asked the defendant to remove those structures but the defendant did not comply.",
      "type": "material",
      "date": "1948",
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "In September 1948, the plaintiff served a notice to quit on the defendant determining the tenancy with effect from 1st November 1948 under s.106 of the Transfer of Property Act.",
      "type": "procedural",
      "date": "1948-09",
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "The plaintiff instituted the suit on January 3, 1949 in the court of Munsif at Purulia. At the time, the suit property was within the limits of the State of Bihar.",
      "type": "procedural",
      "date": "1949-01-03",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "The trial court decreed the suit in May 1952 as prayed for, directing the defendant to deliver vacant possession after removing the structures.",
      "type": "procedural",
      "date": "1952-05",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "The first appellate court affirmed the trial court's decree on July 11, 1952.",
      "type": "procedural",
      "date": "1952-07-11",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "In 1956, border areas of Bihar including the suit property were transferred to West Bengal effective November 1, 1956.",
      "type": "background",
      "date": "1956-11-01",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "The defendant filed a second appeal in High Court of Patna on September 7, 1956, admitted on September 10, 1956.",
      "type": "procedural",
      "date": "1956-09-07",
      "source": "respondent"
    },
    {
      "id": "f11",
      "text": "The second appeal was transferred to Calcutta High Court under Bihar and West Bengal Transfer of Territories Act, 1956.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "West Bengal Transferred Territories Assimilation of Laws Act, 1958 came into force on July 1, 1959.",
      "type": "background",
      "date": "1959-07-01",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Calcutta High Court heard the second appeal on August 10, 1965 and dismissed the suit.",
      "type": "procedural",
      "date": "1965-08-10",
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "All courts below concurrently found no reliable evidence that structures were put up with consent or knowledge of plaintiff; equitable estoppel not established.",
      "type": "admitted",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the suit for ejectment is liable to be dismissed for non-compliance with s.9(1)(b)(iii) of the West Bengal Non-agricultural Tenancy Act, 1949 read with s.88 thereof, given the notice to quit was issued under s.106 TPA before the 1949 Act was extended to the transferred territories.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the plaintiff's claim is barred by equitable estoppel.",
      "framed_by": "respondent"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "S.9 of the 1949 Act is not applicable; notice to quit under s.106 TPA was valid at the time given and suit validly instituted; provisions of 1949 Act and 1958 Act do not render the suit unmaintainable.",
      "supporting_facts": [
        "f5",
        "f6",
        "f12"
      ],
      "legal_basis": "S.106 Transfer of Property Act; S.3 West Bengal Transferred Territories Assimilation of Laws Act, 1958"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Plaintiff's claim barred by equitable estoppel.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Suit liable to be dismissed under s.9 read with s.80 (s.88) of West Bengal Non-agricultural Tenancy Act, 1949 for failure to give six months notice.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": "S.9(1)(b)(iii) and S.88 West Bengal Non-agricultural Tenancy Act, 1949"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Equitable estoppel not established as no reliable evidence structures put up with consent or knowledge of plaintiff; findings of fact not to be reviewed.",
      "addresses_issue": "i2",
      "key_observation": "Defendant failed to establish plea of equitable estoppel."
    },
    {
      "id": "cr2",
      "text": "1949 Act extended to transferred territories by 1958 Act; s.3(2) of 1958 Act saves previous operation of repealed laws and acts duly done thereunder, including quit notice under s.106 TPA; thus notice valid and not testable under 1949 Act.",
      "addresses_issue": "i1",
      "key_observation": "Quit notice given under s.106 TPA is protected by proviso to s.3(2) of 1958 Act."
    },
    {
      "id": "cr3",
      "text": "No liability to pay compensation for structures as termination not under s.9(1)(b)(iii) of 1949 Act.",
      "addresses_issue": "i1",
      "key_observation": "Proviso to s.9(1)(b)(iii) imposes compensation only when termination under that clause."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "S.9(1)(b)(iii) of 1949 Act does not apply retrospectively to invalidate prior valid notice under TPA due to savings clause in s.3 of 1958 Act.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "No equitable estoppel applies.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Transfer of Property Act",
      "sections": [
        "Section 106"
      ],
      "relevance": "Governing provision for notice to quit at time of institution of suit; act duly done thereunder protected."
    },
    {
      "name": "Bihar and West Bengal (Transfer of Territories) Act, 1956",
      "sections": [
        "Part VII"
      ],
      "relevance": "Provided for continuance of existing laws in transferred territories until otherwise provided; basis for transfer of appeal."
    },
    {
      "name": "West Bengal Transferred Territories (Assimilation of Laws) Act, 1958",
      "sections": [
        "Section 2(b)",
        "Section 3"
      ],
      "relevance": "Extended 1949 Act to transferred territories but saved previous operation of repealed laws and acts done thereunder."
    },
    {
      "name": "West Bengal Non-Agricultural Tenancy Act, 1949",
      "sections": [
        "Section 9(1)(b)(iii)",
        "Section 88"
      ],
      "relevance": "Requires six months notice for ejectment in certain tenancies; s.88 applies to pending proceedings; held inapplicable due to savings in 1958 Act."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; judgment and decree of Calcutta High Court set aside; decree of trial court affirmed by first appellate court restored; defendant directed to deliver vacant possession after removing structures, no compensation required.",
    "relief_granted": "Ejectment and vacant possession of suit plot after removal of structures by defendant.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"acts duly done under the repealed laws are protected. Hence the quit notice given under S. 106 of the Transfer of Property Act by the plaintiff was an act duly done under a repealed law. That act is protected.\"",
      "speaker": "court",
      "significance": "Core reasoning on savings clause protecting prior notice."
    },
    {
      "text": "\"That interpretation also advances public interest. Otherwise all ejectment suits which had been instituted before the transfer of territories had been effected would automatically fail.\"",
      "speaker": "court",
      "significance": "Explains policy rationale against retrospective invalidation."
    }
  ],
  "_case_id": "1971_344",
  "_label": 1,
  "_text_length": 12305,
  "_extracted_at": "2026-02-10T20:16:16.789939"
}