{
  "metadata": {
    "case_name": "Assessee (Appellant) v. Respondents (Revenue)",
    "case_year": 1967,
    "court": "Supreme Court of India",
    "judges": [
      "Grover, J."
    ],
    "case_number": "Civil Appeal No. 1477 of 1967",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The assessee was at all material times a shareholder of a number of companies engaged in the business of managing Hotels. He had also been a Director and Managing Director of various companies.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The assessee came to own a large block of shares of Spencers Hotel Limited and became its Managing Director. He was in charge of the management thereof at the material time.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The assessee purchased interest in Associated Hotels of India Limited in association with M. S. Oberoi.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "In 1944, M. S. Oberoi purchased from the assessee his share holding in the Associated Hotels of India Limited for an amount of Rs.20,657,05/13/0.",
      "type": "material",
      "date": "1944",
      "source": "assessee"
    },
    {
      "id": "f5",
      "text": "In or about 1949, the holding in Hotels 1938 Limited was purchased by M. S. Oberoi.",
      "type": "material",
      "date": "1949",
      "source": "assessee"
    },
    {
      "id": "f6",
      "text": "The assessee filed returns of his income in respect of the relevant assessment years and during the assessment for the year 1945-46, disclosed to the Income-tax Officer, District II, Calcutta that he had received the aforesaid amount for the sale of the shares of the Associated Hotels. The amount was held to be a capital receipt on which no income tax was payable.",
      "type": "admitted",
      "date": "1945-46",
      "source": "assessee"
    },
    {
      "id": "f7",
      "text": "During subsequent years, the assessee continued to show in his returns the interest received on the amount of Rs. 20,657,05/13/0.",
      "type": "admitted",
      "date": null,
      "source": "assessee"
    },
    {
      "id": "f8",
      "text": "The case of M. S. Oberoi was referred to the Investigation Commission set up under the Taxation on Income (Investigation Commission) Act, 1947.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "The assessee was served a notice by the Commission on or about 18th August, 1951 under section 5(4) of the aforesaid Act, in respect of the assessment year 1940-41.",
      "type": "procedural",
      "date": "1951-08-18",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "In March, 1953, the assessee filed a Writ Petition in the Punjab High Court (Circuit Bench Delhi) to quash the proceedings before the Commission. The Solicitor General gave an undertaking that all proceedings against the assessee would be dropped, upon which the rule was discharged.",
      "type": "procedural",
      "date": "1953-03",
      "source": "assessee"
    },
    {
      "id": "f11",
      "text": "Income-tax Officer, District II, Calcutta issued seven notices dated 5th November, 1954 to the assessee under S. 34(1-A) of the Income Tax Act, 1922 in respect of assessment years 1940-41 to 1946-47 alleging that the appellant had partly escaped assessment.",
      "type": "procedural",
      "date": "1954-11-05",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Assessee objected that in the absence of any material on record, the Income Tax Officer had no jurisdiction to issue notice under 34(1-A). ITO proceeded to make assessments for 1942-43, 1943-44, 1944-45 and 1945-46.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f13",
      "text": "Assessee filed appeal to the Appellate Assistant Commissioner of Income Tax who remanded the case to the ITO to submit a report on various matters, including fresh material to treat Rs. 20,00,000/- previously capital as income.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "In 1961, assessee filed petition under Art. 226 in Calcutta High Court challenging the order of the Appellate Assistant Commissioner. Writ dismissed on 6th October, 1966.",
      "type": "procedural",
      "date": "1966-10-06",
      "source": "court"
    },
    {
      "id": "f15",
      "text": "In clause (v) of Para 22 of the Writ Petition, assessee stated that ITO had no material constituting reason to believe income escaped; only material was disclosed receipt of Rs.22 lakhs treated as capital.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f16",
      "text": "High Court sustained preliminary objection that assessee could not pursue Art.226 writ as he had appealed to AAC; also held preconditions under S.34(1-A) satisfied.",
      "type": "procedural",
      "date": "1966-10-06",
      "source": "lower_court"
    },
    {
      "id": "f17",
      "text": "Impugned notices under S.34(1-A) stated ITO had reason to believe income escaped; issued after satisfaction of Central Board of Revenue.",
      "type": "material",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f18",
      "text": "Reasons recorded: ITO believed assessee with Oberois made secret profits not offered; received Rs.22 lakhs from Oberois, part representing escaped income.",
      "type": "disputed",
      "date": null,
      "source": "revenue"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the Income Tax Officer had jurisdiction to issue notices under S.34(1-A) of the Income Tax Act, 1922, i.e., whether preconditions were satisfied: reason to believe that income escaped assessment amounting to or likely to amount to one lakh rupees or more, with recorded reasons and CBR satisfaction.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether assessee could invoke Art.226 writ after pursuing statutory appeal remedy.",
      "framed_by": "respondent"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "No material before ITO for reason to believe income escaped; receipt of Rs.22 lakhs disclosed in 1945-46 and treated as capital receipt.",
      "supporting_facts": [
        "f6",
        "f15"
      ],
      "legal_basis": "S.34(1-A) Income Tax Act 1922"
    },
    {
      "id": "pa2",
      "text": "Undertaking by Solicitor General to drop proceedings before Investigation Commission.",
      "supporting_facts": [
        "f10"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "ITO had no jurisdiction without material; AAC remanded for fresh material which was lacking.",
      "supporting_facts": [
        "f12",
        "f13"
      ],
      "legal_basis": "S.34(1-A)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Preliminary objection: Assessee pursued appeals to AAC, cannot invoke Art.226.",
      "supporting_facts": [
        "f13",
        "f14"
      ],
      "legal_basis": "Art.226 Constitution"
    },
    {
      "id": "ra2",
      "text": "Preconditions under S.34(1-A) satisfied; ITO had reasons recorded and CBR sanction; materials from Investigation Commission.",
      "supporting_facts": [
        "f17",
        "f18"
      ],
      "legal_basis": "S.34(1-A)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "High Court erred in deciding merits after sustaining preliminary objection on alternative remedy.",
      "addresses_issue": "i2",
      "key_observation": "But since HC decided on S.34(1-A), SC examines it as binding on lower authorities."
    },
    {
      "id": "cr2",
      "text": "Notices stated reason to believe and CBR satisfaction; reasons in Form B: mere belief assessee with Oberois made secret profits, received Rs.22 lakhs part income escaped – no material facts stated.",
      "addresses_issue": "i1",
      "key_observation": "Reasons fail statute requirements; 'reason to believe' must be honest/reasonable on grounds, not suspicion."
    },
    {
      "id": "cr3",
      "text": "Applied Chhugamal Rajpal: vague references insufficient; no specific material for belief income escaped.",
      "addresses_issue": "i1",
      "key_observation": "Self-contradictory 'beliefs' as reasons; ITO acted without jurisdiction."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Requirements of S.34(1-A) not satisfied; notices wholly illegal and invalid.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Chhugamal Rajpal v. S.P. Chaliha and Others",
      "citation": "1971 79 I.T.R. 603",
      "treatment": "followed",
      "relevance": "Similar facts; held vague reasons in report insufficient for 'reason to believe' under analogous S.148 IT Act 1961."
    }
  ],
  "statutes_cited": [
    {
      "name": "Income Tax Act, 1922",
      "sections": [
        "S.34(1-A)"
      ],
      "relevance": "Preconditions for issuing notice on escapement of income >=1 lakh: ITO reason to believe, recorded reasons, CBR satisfaction."
    },
    {
      "name": "Taxation on Income (Investigation Commission) Act, 1947",
      "sections": [
        "S.5(4)"
      ],
      "relevance": "Notice served on assessee leading to writ and undertaking."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art.226"
      ],
      "relevance": "Writ petition challenging jurisdiction; preliminary objection on alternative remedy."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; judgment of Calcutta High Court set aside; notices under S.34(1-A) declared illegal and invalid for lack of valid reason to believe income escaped assessment.",
    "relief_granted": "Quashing of proceedings pursuant to invalid notices",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "'reason to believe suggest that the belief must be that of an honest and reasonable person based upon reasonable grounds and that the Income Tax Officer may act on direct or circumstantial evidence but not on mere suspicion, gossip or rumour.'",
      "speaker": "court",
      "significance": "Defines threshold for jurisdiction under S.34(1-A)"
    },
    {
      "text": "The two reasons...hopelessly fail to satisfy the requirements of the statute.",
      "speaker": "court",
      "significance": "Rejects ITO's recorded reasons as inadequate."
    }
  ],
  "_case_id": "1971_287",
  "_label": 1,
  "_text_length": 14578,
  "_extracted_at": "2026-02-10T20:15:35.820191"
}