{
  "metadata": {
    "case_name": "Basudev Hazra v. State",
    "case_year": 1968,
    "court": "Supreme Court of India",
    "judges": [
      "Dua, J."
    ],
    "case_number": "Criminal Appeal No. 171 of 1968",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant Basudev Hazra was leaseholder of tolls at public ferry Sadar Ghat on river Damodar, lease period August 14, 1963 to August 13, 1966 (Ex. 2).",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On November 30, 1964, Matiar Rahman Mandal filed complaint against appellant before Sadar Sub-Divisional Officer (Judicial), Burdwan, alleging appellant illegally realised 20 nP. per cart from cultivators driving carts across dry bed of river.",
      "type": "material",
      "date": "1964-11-30",
      "source": "complainant"
    },
    {
      "id": "f3",
      "text": "Matter reported to S.D.O. who directed enquiry, infuriating appellant.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On November 29, 1964, appellant realised double toll amount; on protest and refusal by complainant, threatened with violence.",
      "type": "material",
      "date": "1964-11-29",
      "source": "complainant"
    },
    {
      "id": "f5",
      "text": "Magistrate convicted appellant under ss. 23 and 24 of Bengal Ferries Act, 1885; sentenced to fine Rs. 10/- under s.23 (SI 10 days default) and Rs. 20/- under s.24 (SI 20 days default).",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "Appellant challenged conviction on revision before Sessions Judge; Additional Sessions Judge, Burdwan referred to Calcutta High Court recommending acquittal.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Appellant's defence: complainant's party used landing stage and path constructed/repaired by him, liable to pay usual toll.",
      "type": "disputed",
      "date": null,
      "source": "appellant"
    },
    {
      "id": "f8",
      "text": "Complainant's case: Did not use facilities provided by lessee, used own path; lessee demanded toll despite this.",
      "type": "disputed",
      "date": null,
      "source": "complainant"
    },
    {
      "id": "f9",
      "text": "Trial Magistrate found: (i) appellant realised toll in excess of scheduled 20 ps. per cart, including from persons not using ferry; (ii) complainant did not avail ferry, crossed sandy bed, but 40 ps. per cart realised.",
      "type": "admitted",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Calcutta High Court on September 13, 1967: Accepted reference for acquittal under s.23; rejected for s.24, upheld conviction as realisation of 40 ps. fell within s.24.",
      "type": "procedural",
      "date": "1967-09-13",
      "source": "high_court"
    },
    {
      "id": "f11",
      "text": "Appellant secured special leave to appeal under Art. 136 of Constitution.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Evidence showed appellant delayed prosecution witnesses without due cause in crossing river.",
      "type": "material",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether realisation of 40 ps. per cart from persons not using the ferry (crossing dry/sandy bed) falls within mischief of s.24 of Bengal Ferries Act, 1885, which penalises taking more than lawful toll.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Realisation of 40 ps. per cart from those who do not use the ferry cannot as a matter of law fall within s.24; unless someone actually uses ferry, charges realised even if demanded as toll do not attract s.24.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": "Section 24 Bengal Ferries Act; s.5 definition of ferry; possibly extortion under IPC"
    },
    {
      "id": "pa2",
      "text": "Pathway and landing stage belonged to lessee, entitled to collect toll.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "S.24 does not speak only of taking excess toll from those using ferry; covers illegal demand under pretext of toll when not legally claimable; protects against harassment by lessee in privileged position.",
      "addresses_issue": "i1",
      "key_observation": "Whether person obliged to pay toll or not immaterial if demanded/received as toll pretext when not due; attracts s.24 to suppress mischief."
    },
    {
      "id": "cr2",
      "text": "S.5 definition of ferry not exhaustive, does not control interpretation of s.24.",
      "addresses_issue": "i1",
      "key_observation": "S.24 designed to protect crossing persons from excess demands and delays."
    },
    {
      "id": "cr3",
      "text": "Whether case of extortion under IPC irrelevant; if covered by s.24, punishable thereunder; IPC liability does not exclude s.24.",
      "addresses_issue": "i1",
      "key_observation": "Appellant's defence supports that amount demanded as toll, unlawful demand."
    },
    {
      "id": "cr4",
      "text": "Excluding such cases would restrict s.24 effectiveness, defeat object; no grave miscarriage of justice warranting Art.136 interference.",
      "addresses_issue": "i1",
      "key_observation": "Evidence supports findings; appeal lacks merit."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "S.24 Bengal Ferries Act applies to demanding/receiving more than lawful toll or under pretext of toll when not legally due, even from non-users of ferry.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Bengal Ferries Act, 1885",
      "sections": [
        "s.23",
        "s.24",
        "s.5"
      ],
      "relevance": "S.24 penalises lessee taking more than lawful toll or delaying without cause; conviction under s.24 upheld, s.23 acquitted."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 136"
      ],
      "relevance": "Special leave granted; discretionary power exercised sparingly, no interference as no miscarriage of justice."
    },
    {
      "name": "Indian Penal Code",
      "sections": [],
      "relevance": "Mentioned re extortion, but irrelevant as s.24 applies independently."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal against High Court upholding conviction under s.24 Bengal Ferries Act dismissed; conviction and sentence stand; no interference under Art.136.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"Every such lessee or other person as aforesaid asking or taking more than the lawful toll... shall be punished with fine which may extend to one hundred rupees.\"",
      "speaker": "court",
      "significance": "Text of s.24, central to interpretation."
    },
    {
      "text": "\"This section seems to have been designed... to protect the persons crossing the river against harassment and abuse of the privileged position which the lessee... occupies.\"",
      "speaker": "court",
      "significance": "Explains purpose and broad scope of s.24."
    },
    {
      "text": "\"Art. 136... confers a discretionary power on this Court to be exercised sparingly... where grave miscarriage of justice has resulted.\"",
      "speaker": "court",
      "significance": "Justifies dismissal of appeal."
    }
  ],
  "_case_id": "1971_56",
  "_label": 0,
  "_text_length": 9368,
  "_extracted_at": "2026-02-10T20:14:04.870640"
}