{
  "metadata": {
    "case_name": "Regional Provident Fund Commissioner, Andhra Pradesh v. T. S. Hariharan, Proprietor, New Cochin Cafe, Ongole",
    "case_year": 1971,
    "court": "Supreme Court of India",
    "judges": [
      "Dua, J."
    ],
    "case_number": "Civil Appeal No. 1128 of 1967",
    "date_of_judgment": "1971-01-20"
  },
  "facts": [
    {
      "id": "f1",
      "text": "New Cochin Cafe, treated as a hotel, started in Ongole town on November 20, 1956.",
      "type": "background",
      "date": "1956-11-20",
      "source": "respondent"
    },
    {
      "id": "f2",
      "text": "Respondent usually employed only 18 or 19 persons.",
      "type": "admitted",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f3",
      "text": "In 1961, total failure of rains in Ongole region; respondent employed two or three persons on contract basis for supplying water to the hotel from June to September 1961.",
      "type": "material",
      "date": "1961-06 to 1961-09",
      "source": "respondent"
    },
    {
      "id": "f4",
      "text": "Writ Petition No. 907 of 1963 filed by respondent in Andhra Pradesh High Court praying for writ of mandamus directing appellant to forbear from enforcing Employees Provident Funds Act, 1952 and Scheme.",
      "type": "procedural",
      "date": "1963-08",
      "source": "respondent"
    },
    {
      "id": "f5",
      "text": "Andhra Pradesh High Court dismissed writ petition on September 1, 1964, expressing view that clauses (a) and (b) of sub-section (3) of Section 1 do not cover casual labour.",
      "type": "procedural",
      "date": "1964-09-01",
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "Certificate under Article 133(1)(b) granted by Andhra Pradesh High Court on February 25, 1965.",
      "type": "procedural",
      "date": "1965-02-25",
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Notice sent by appellant to respondent in 1962 stating provisions of the Act applicable to his establishment.",
      "type": "procedural",
      "date": "1962",
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "Respondent did not appear in Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether clauses (a) and (b) of sub-section (3) of Section 1 of the Employees Provident Funds Act, 1952 cover casual labour or employment for short periods in determining if an establishment employs twenty or more persons.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Clauses (a) and (b) of sub-section (3) of Section 1 cover casual labour; employment of twenty persons even for a day or fraction thereof satisfies the numerical strength requirement.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": "Section 1(3)(a) and (b); unreported judgment of Madras High Court; Messrs East India Industries Madras v. Regional P.F. Commissioner (1964) 1 LLJ 441"
    },
    {
      "id": "pa2",
      "text": "High Court's view that Act inapplicable to establishments not employing 20 or more persons for one year is erroneous and binding on appellant.",
      "supporting_facts": [],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Respondent employs a few persons every year regularly from June to September for supplying water due to failure of rains, constituting regular employment.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Casual labour falls outside scope of Section 1(3); establishments employing less than twenty excluding casual labourers not covered.",
      "supporting_facts": [
        "f2",
        "f3"
      ],
      "legal_basis": "Section 1(3); Section 19-A"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Act intended for establishments with sufficient financial stability to afford regular contributions; employment must reflect normal regular requirements, financial capacity and stability, not casual or short-term due to emergencies.",
      "addresses_issue": "i1",
      "key_observation": "Number of persons employed determined by general requirements for regular work with commercial nexus to financial capacity; casual/short-term employment not counted."
    },
    {
      "id": "cr2",
      "text": "Section 1(5) requires continuity even if numbers fall below 20 unless below 15 for one year; supports need for long-term stability.",
      "addresses_issue": "i1",
      "key_observation": "Extreme views (any short period or full one year continuous) unacceptable."
    },
    {
      "id": "cr3",
      "text": "In present case, no finding that water supply employment is regular feature; High Court's general approach correct except for 'one year' observation.",
      "addresses_issue": "i1",
      "key_observation": "Question to be decided on peculiar facts of each case."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Employment under Section 1(3)(a) and (b) means employment in regular course of business, excluding casual labour or short-term employment due to passing necessity or temporary emergency.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Messrs East India Industries Madras v. Regional P.F. Commissioner",
      "citation": "(1964) 1 LLJ 441",
      "treatment": "referred",
      "relevance": "Appellant relied on it to support that short-term employment counts towards threshold."
    }
  ],
  "statutes_cited": [
    {
      "name": "Employees Provident Funds Act, 1952",
      "sections": [
        "Section 1(3)(a)",
        "Section 1(3)(b)",
        "Section 1(4)",
        "Section 1(5)",
        "Section 2(f)",
        "Section 5",
        "Section 6",
        "Section 14",
        "Section 16",
        "Section 17",
        "Section 19-A"
      ],
      "relevance": "Determines applicability to establishments employing 20 or more persons; excludes casual/short-term; requires financial stability for regular contributions."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 133(1)(b)"
      ],
      "relevance": "Basis for certificate granting appeal to Supreme Court."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal dismissed ex parte with clarification that Section 1(3)(a) and (b) do not cover casual or short-term employment; High Court to examine applicability excluding casual labour.",
    "relief_granted": "Clarification of legal position; writ petition dismissal upheld.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "the number of persons to be considered to have been employed by an establishment for the purpose of this Act has to be determined by taking into account the general requirements of the establishment for its regular work which should also have a commercial nexus with its general financial capacity and stability.",
      "speaker": "court",
      "significance": "Core holding on interpreting 'employment' under Section 1(3)."
    },
    {
      "text": "employment of a few persons on account of some emergency or for a very short period necessitated by some abnormal contingency which is not a regular feature of the business of the establishment... would not be covered by this definition.",
      "speaker": "court",
      "significance": "Defines exclusion of casual/short-term labour."
    },
    {
      "text": "It is not necessary for us to labour this point any further as we feel that the provisions of the Act are inapplicable to establishments which do not employ twenty or more persons, to work therein for a period of one year.",
      "speaker": "lower_court",
      "significance": "High Court observation corrected by Supreme Court."
    }
  ],
  "_case_id": "1971_192",
  "_label": 0,
  "_text_length": 19178,
  "_extracted_at": "2026-02-10T20:15:29.381591"
}