{
  "metadata": {
    "case_name": "Revenue v. Assessee (Spinning Mill)",
    "case_year": 1972,
    "court": "Supreme Court of India",
    "judges": [
      "Grover, J."
    ],
    "case_number": "Civil Appeals Nos. 1454 of 1969 and 148 of 1971",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The assessee is a spinning mill manufacturing company on yarn [cotton yarn].",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "For the assessment year 1960-61, the assessing authority included in the taxable turnover certain amounts representing the sale value of foodgrains and groceries sold in the fair price shop run by the mills and the amount realised by sale of articles of food in the canteen run for its employees.",
      "type": "material",
      "date": "1960-61",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The assessee filed an appeal questioning its liability to pay tax on these items. The appellate authority dismissed that appeal.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The assessee filed a further appeal to the Sales Tax Appellate Tribunal which allowed the appeal and directed that the turnover in question be deleted.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The Revenue went up in revision to the High Court of Madras. A division bench dismissed the revision.",
      "type": "procedural",
      "date": "1967-04-06 and 1969-01-22",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The Appellate Tribunal found that the fair price shop and the canteen were run exclusively for the benefit of the employees and there was no profit motive in running the same.",
      "type": "admitted",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "The High Court found that the assessee had not been carrying on business in the fair price shop as there was no article in the articles of association empowering it to carry on business in fair price shop; the shop was opened only to provide an amenity to its workmen.",
      "type": "disputed",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "These appeals by special leave from judgments of the Madras High Court involve a common question.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the turnover of the sales by the fair price shop and the canteen could be included in the taxable turnover according to the definition of business as it stood in the original Madras General Sales Tax Act, 1959.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether Section 2 of the Madras General Sales Tax Second Amendment Act, 1964, which substituted the new definition of business, has retrospective effect through the language of Section 9.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The turnover of the sales by the fair price shop and the canteen could be included in the taxable turnover according to the definition of business as it stood in the original Act.",
      "supporting_facts": [
        "f2"
      ],
      "legal_basis": "Section 2(d), (g), (n) of Madras General Sales Tax Act, 1959"
    },
    {
      "id": "pa2",
      "text": "Section 2 of the Second Amendment Act 1964 substituted the new definition of business with retrospective effect. This result flows from the language of Section 9 although Section 2 has no such language.",
      "supporting_facts": [
        "f2",
        "f5"
      ],
      "legal_basis": "Section 9 of Madras General Sales Tax Second Amendment Act, 1964"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The activity of running the fair price shop and canteen is not business as there is no profit motive and no commercial character; it is only an amenity for employees.",
      "supporting_facts": [
        "f6",
        "f7"
      ],
      "legal_basis": "Section 2(d) of Madras General Sales Tax Act, 1959; Articles of Association"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The primary requisite of business as defined by the Act is a trade or commerce or adventure in the nature of trade or commerce. Presence or absence of profit is not material but the activity must be of a commercial character in the course of trade or commerce.",
      "addresses_issue": "i1",
      "key_observation": "The assessee had not been carrying on business in the fair price shop."
    },
    {
      "id": "cr2",
      "text": "Section 9 by itself would not make the definition of business as substituted in Section 2 retrospective.",
      "addresses_issue": "i2",
      "key_observation": "No usual words that it should be deemed to have always been substituted nor any other language to show retrospective amendment of the substantive provision."
    },
    {
      "id": "cr3",
      "text": "Validation of tax declared illegal may be done only if grounds of illegality are removed, e.g., by reenacting retrospectively a valid provision. None of these methods adopted here.",
      "addresses_issue": "i2",
      "key_observation": "Legislature cannot declare a court judgment ineffective."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Sales in fair price shop and canteen do not constitute 'business' under original Section 2(d) of the 1959 Act as no commercial activity.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "The substituted definition of 'business' in Section 2 of the 1964 Amendment Act does not apply retrospectively; Section 9 does not achieve this.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "State of Tamil Nadu & Another v. M. Rayappa Gounder etc.",
      "citation": null,
      "treatment": "followed",
      "relevance": "Section 7 of Madras Entertainment Tax Amendment Act 1966 similar to Section 9; legislature cannot make court judgment ineffective; validation requires removing grounds of invalidity."
    },
    {
      "case_name": "Shri Prithvi Cotton Mills Ltd. v. Broach Borough Municipality & Ors.",
      "citation": null,
      "treatment": "referred",
      "relevance": "Validation by providing jurisdiction or reenacting retrospectively; legislature can give meaning to law binding on courts."
    }
  ],
  "statutes_cited": [
    {
      "name": "Madras General Sales Tax Act, 1959",
      "sections": [
        "Section 2(d)",
        "Section 2(g)",
        "Section 2(n)"
      ],
      "relevance": "Definitions of 'business', 'dealer', 'sale'; business requires commercial character regardless of profit."
    },
    {
      "name": "Madras General Sales Tax Second Amendment Act, 1964",
      "sections": [
        "Section 2",
        "Section 9"
      ],
      "relevance": "Substituted definition of 'business' including incidental transactions; Section 9 validates levy regardless of profit motive but does not make amendment retrospective."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court upheld the Madras High Court's dismissal of the Revenue's revisions, holding that the sales in the fair price shop and canteen were not 'business' under the original Act and the 1964 amendment does not apply retrospectively via Section 9. Appeals by Revenue dismissed.",
    "relief_granted": "Turnover of fair price shop and canteen sales excluded from taxable turnover.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "'business includes any trade, commerce or manufacture or any adventure or concern in the nature of trade, commerce or manufacture whether or not any profit accrues...'",
      "speaker": "court",
      "significance": "Original definition under Section 2(d); profit not material but commercial character required."
    },
    {
      "text": "Section 9 by itself would make the definition of business as substituted in s. 2 retrospective? We are unable to agree.",
      "speaker": "court",
      "significance": "Rejects Revenue's contention on retrospectivity."
    },
    {
      "text": "The principle... is that validation of tax which has been declared to be illegal may be done only if the grounds of illegality or invalidity are capable of being removed and are in fact removed.",
      "speaker": "court",
      "significance": "Limits legislative validation power."
    }
  ],
  "_case_id": "1971_477",
  "_label": 0,
  "_text_length": 9264,
  "_extracted_at": "2026-02-10T20:16:48.992295"
}