{
  "metadata": {
    "case_name": "Federation of Indian Chambers of Commerce and Industry v. R. K. Mittal",
    "case_year": 1967,
    "court": "Supreme Court of India",
    "judges": [
      "Jaganmohan Reddy, J."
    ],
    "case_number": "Civil Appeal No. 244 of 1967",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "In February 1965, the 20th Congress of International Chamber of Commerce was held in Delhi; Indian National Committee formed; respondent R. K. Mittal and other workmen loaned to it by Federation.",
      "type": "background",
      "date": "1965-02",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Respondent worked for about 40 days but paid overtime for only 7 days; claimed overtime for remainder as other workmen paid similarly.",
      "type": "material",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f3",
      "text": "Respondent issued lawyer's notice to Federation, Indian National Committee, and International Chamber of Commerce, Paris, demanding Rs. 600/-; no replies received.",
      "type": "material",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f4",
      "text": "Second notice threatening suit; ICC Paris telegram to Federation; Federation replied it would deal with it but claim not settled.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "Respondent filed suit for arrears; Federation viewed notices as misconduct bringing disrepute; served chargesheet.",
      "type": "material",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "Domestic enquiry held; respondent held guilty; Secretary terminated services instead of dismissal.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "Respondent raised industrial dispute; referred to Labour Court, Delhi on whether termination illegal and unjustified; issues framed.",
      "type": "procedural",
      "date": "1966-11-22",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Suit withdrawn after reference.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f9",
      "text": "Labour Court overruled preliminary objection that Federation not industry; held charge not proved, termination illegal, victimisation, punishment severe.",
      "type": "admitted",
      "date": "1966-11-22",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Federation organises exhibitions (1961, 1965 profits Rs.40 lakhs, Rs.22 lakhs), publishes fortnightly Review, commercial arbitrations, liaison services, etc.",
      "type": "background",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f11",
      "text": "Respondent consulted lawyers who advised claiming against all three bodies; denied mala fide; expressed regrets, appealed to Secretary General, no acknowledgement.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f12",
      "text": "Respondent served Federation for 12 years without complaint.",
      "type": "background",
      "date": null,
      "source": "respondent"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the Federation is an industry under Section 2(j) of the Industrial Disputes Act, 1947",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether the termination of services of R. K. Mittal is illegal and unjustified and if so, what directions necessary",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether domestic enquiry fair and findings supported; whether punishment proportionate or victimisation",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Federation not an industry as activities non-commercial, charitable, object of general public utility, no profit motive, promotes trade/commerce for community",
      "supporting_facts": [
        "f10"
      ],
      "legal_basis": "Section 2(j) ID Act; precedents like Gymkhana Club, Safdarjung Hospital"
    },
    {
      "id": "pa2",
      "text": "Respondent's notices to ICC brought disrepute, constituted misconduct; enquiry fair, findings supported; termination lenient",
      "supporting_facts": [
        "f3",
        "f5",
        "f6"
      ],
      "legal_basis": "Principles of natural justice"
    },
    {
      "id": "pa3",
      "text": "Grievance unjustified, no discrimination; complaints to harass management",
      "supporting_facts": [
        "f2"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Federation's activities (exhibitions with profits, publications, arbitrations, liaison services) make it an industry",
      "supporting_facts": [
        "f10"
      ],
      "legal_basis": "Section 2(j) ID Act; nature of activity test"
    },
    {
      "id": "ra2",
      "text": "Employed by Indian National Committee for Congress; legal advice to notice all three; no mala fide or intent to defame; apologised",
      "supporting_facts": [
        "f1",
        "f3",
        "f11"
      ],
      "legal_basis": null
    },
    {
      "id": "ra3",
      "text": "Punishment of discharge disproportionate for small matter; victimisation",
      "supporting_facts": [
        "f12"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Analysed precedents: Hospital Mazdoor Sabha extended but limited by Gymkhana Club, Safdarjung Hospital; industry requires systematic activity akin to trade/business producing material goods/services via employer-employee cooperation; profit motive not essential",
      "addresses_issue": "i1",
      "key_observation": "Charitable object does not exclude if activities commercial/industrial"
    },
    {
      "id": "cr2",
      "text": "Federation's objects (promote trade, exhibitions with profits, arbitrations, publications, liaison, representations to govt) are systematic business activities rendering material services to business community",
      "addresses_issue": "i1",
      "key_observation": "Federation is an industry under Sec 2(j)"
    },
    {
      "id": "cr3",
      "text": "Misconduct not established; respondent acted per legal advice on dues from Congress committee, not Federation alone; apology tendered; effect on prestige insufficient for guilt",
      "addresses_issue": "i2",
      "key_observation": "Charge not proved"
    },
    {
      "id": "cr4",
      "text": "Punishment disproportionate for 12-year employee; no standing orders; open to Tribunal to find victimisation",
      "addresses_issue": "i3",
      "key_observation": "Termination unjustified"
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Federation is an industry within Section 2(j) of Industrial Disputes Act",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Domestic enquiry findings not justified; termination illegal, unjustified, disproportionate, amounts to victimisation",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "State of Bombay v. Hospital Mazdoor Sabha",
      "citation": "1960 2 S.C.R. 866",
      "treatment": "followed | distinguished",
      "relevance": "Hospital as industry if analogous to trade/business; profit motive not essential; test of private citizen activity"
    },
    {
      "case_name": "Secretary, Madras Gymkhana Club Employees Union v. Management of Gymkhana Club",
      "citation": "1968 1 S.C.R. 742",
      "treatment": "followed",
      "relevance": "Criteria for industry: trade/business/undertaking producing material goods/services; members club not industry"
    },
    {
      "case_name": "Management of Safdarjung Hospital v. Kuldip Singh Sethi",
      "citation": "1971 1 S.C.R. 177",
      "treatment": "followed",
      "relevance": "Industry requires employer-employee cooperation in economic activity analogous to trade; govt/charitable hospitals not industry unless commercial"
    },
    {
      "case_name": "Cricket Club of India Ltd. v. Bombay Labour Union",
      "citation": "1969 1 S.C.R. 600",
      "treatment": "followed",
      "relevance": "Members club promoting sports not industry despite incidental income"
    },
    {
      "case_name": "Ahmedabad Textile Industry's Research Association v. State of Bombay",
      "citation": "1961 2 S.C.R. 480",
      "treatment": "referred",
      "relevance": "Research association tests applied"
    },
    {
      "case_name": "Bombay Panjrapole v. Workmen",
      "citation": "Civil Appeal No. 1331 of 1966 (16-8-71)",
      "treatment": "followed",
      "relevance": "Charitable pinjrapole with commercial milk sales is industry"
    }
  ],
  "statutes_cited": [
    {
      "name": "Industrial Disputes Act, 1947",
      "sections": [
        "Section 2(g)",
        "Section 2(j)",
        "Section 2(k)",
        "Section 2(s)",
        "Section 10(1)"
      ],
      "relevance": "Definitions of industry, employer, industrial dispute, workman; reference for adjudication"
    },
    {
      "name": "Income-tax Act, 1922",
      "sections": [
        "Section 4(3)(i)"
      ],
      "relevance": "Charitable purposes exemption distinguished; object vs activity test inapplicable to ID Act"
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal against Labour Court award directing reinstatement of R.K. Mittal with full back wages and continuity of service dismissed; Federation held to be industry; termination held illegal, unjustified and disproportionate.",
    "relief_granted": "Reinstatement with full back wages and continuity of service upheld",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"There can in our view be no doubt that the Federation is an industry within the meaning of Sec. 2(j) of the Act.\"",
      "speaker": "court",
      "significance": "Core holding on industry status"
    },
    {
      "text": "\"the punishment of discharge ... was far in excess of what he deserved--even if he was considered to be guilty of any misconduct.\"",
      "speaker": "court",
      "significance": "Justifies upholding reinstatement"
    },
    {
      "text": "\"Industry has thus been accepted to mean only trade and business, manufacture, or undertaking analogous to trade or business for the production of material goods or wealth and material services.\"",
      "speaker": "court",
      "significance": "Defines test for industry from Safdarjung Hospital"
    }
  ],
  "_case_id": "1971_613",
  "_label": 0,
  "_text_length": 70353,
  "_extracted_at": "2026-02-10T20:19:21.792695"
}