{
  "metadata": {
    "case_name": "State of Madras v. Cement Allocation Coordinating Organization",
    "case_year": 1968,
    "court": "Supreme Court of India",
    "judges": [
      "Hegde, J."
    ],
    "case_number": "Civil Appeal No. 2300 of 1968",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appeal by certificate arises from judgment and order dated October 18, 1967 of Madras High Court in Writ Petition No. 637 of 1967.",
      "type": "procedural",
      "date": "1967-10-18",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Petitioner before High Court is Ms. Cement Allocation Coordinating Organization, selling agent of Dalmia Cement Bharat Ltd., hereinafter referred to as the assessee.",
      "type": "background",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "On February 28, 1967, Deputy Commercial Tax Officer, Lalgudi wrote to assessee to show cause why turnover relating to price of packing materials used in packing cement sold should not be included in taxable turnover.",
      "type": "procedural",
      "date": "1967-02-28",
      "source": "lower_court"
    },
    {
      "id": "f4",
      "text": "Assessee moved Madras High Court under Article 226 to direct assessing authority not to include that turnover in taxable turnover.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "In Writ Petition, assessee averred it was functioning as agent of Dalmia Cement Bharat Ltd., rights same as principal; packing charges separately shown in bills issued to buyers.",
      "type": "admitted",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "Plea that assessee was agent of Dalmia Cement Bharat Ltd. during relevant period not denied in return filed by State of Tamil Nadu.",
      "type": "admitted",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f7",
      "text": "Assessee shown packing charges separately in bills issued to purchasers of cement not denied.",
      "type": "admitted",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "High Court allowed petition without costs, held assessee entitled to deduct packing charges from total turnover if principals entitled had they sold directly; left open for assessing authority to examine after fresh notice whether principal disentitled.",
      "type": "material",
      "date": "1967-10-18",
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether assessee as agent entitled to deduct turnover relating to packing charges under Rule 6(c) of Rules under Madras General Sales Tax Act, 1959, if principal would be entitled.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether agent of principal who is dealer under Act entitled to same rights as principal under Act.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Assessee functioning as agent of Dalmia Cement Bharat Ltd., rights same as principal; packing charges separately shown in bills; entitled to deduct under Rule 6(c).",
      "supporting_facts": [
        "f2",
        "f5"
      ],
      "legal_basis": "Rule 6(c) of Rules under Madras General Sales Tax Act, 1959"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Turnover relating to price of packing materials used in packing cement sold should be included in assessee's taxable turnover.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": "Section 3, Madras General Sales Tax Act, 1959"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Agent represents principal, exercises same rights as principal would; agent steps into shoes of principal, entitled to same exemptions unless otherwise provided in Act.",
      "addresses_issue": "i2",
      "key_observation": "Agent considered dealer to enforce Act provisions but not converted into principal for all purposes."
    },
    {
      "id": "cr2",
      "text": "Whether principal entitled to exemption left open by High Court; to be decided per facts; department must establish turnover taxable, consider if parties intended to sell/buy packing materials separately.",
      "addresses_issue": "i1",
      "key_observation": "Follows approach in Hyderabad Deccan Cigarette Factory case: no express contracts for packing; consider if packing mere vehicle of transport or separate bargain."
    },
    {
      "id": "cr3",
      "text": "Assessee entitled to claim exemption if principal could claim it had sold cement itself.",
      "addresses_issue": "i1",
      "key_observation": "Agrees with High Court view."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Agent entitled to same deductions/exemptions as principal under Rule 6(c) for packing charges separately charged.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Assessee entitled to exemption in respect of packing charges if principal could have claimed it.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Hyderabad Deccan Cigarette Factory v. State of Andhra Pradesh",
      "citation": "STC 17 p. 624",
      "treatment": "followed",
      "relevance": "Department must establish taxable turnover; consider if parties intended separate sale of packing materials or mere transport vehicle."
    }
  ],
  "statutes_cited": [
    {
      "name": "Madras General Sales Tax Act, 1959",
      "sections": [
        "Section 3",
        "Section 2(g)",
        "Rule 6(c)"
      ],
      "relevance": "Tax on taxable turnover of dealer including commission agent; deduct packing charges if separately specified and charged."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 226"
      ],
      "relevance": "Basis for writ petition."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal dismissed; Supreme Court agreed with High Court that assessee as agent entitled to deduct packing charges if principal would be entitled, leaving question open for assessing authority after fresh notice.",
    "relief_granted": "Upholds High Court order allowing writ petition without costs.",
    "costs": "No costs mentioned."
  },
  "key_quotes": [
    {
      "text": "\"the agent must be held to represent his principal while dealing with the goods of his principal he merely steps into the shoes of his principal. He is entitled to the same exemptions as his principal would have got had he dealt with the concerned goods himself.\"",
      "speaker": "court",
      "significance": "Core holding on agent's rights mirroring principal's."
    },
    {
      "text": "\"The question for decision by us lies within a narrow compass and that question is whether the assessee is entitled to claim exemption in respect of packing charges if his principal could have claimed it had it sold the cement itself. On that question, we agree with the view taken by the High Court.\"",
      "speaker": "court",
      "significance": "Summarizes final agreement with High Court."
    }
  ],
  "_case_id": "1971_402",
  "_label": 0,
  "_text_length": 9012,
  "_extracted_at": "2026-02-10T20:16:10.251700"
}