{
  "metadata": {
    "case_name": "State v. Swami Satyananda",
    "case_year": 1966,
    "court": "Supreme Court of India",
    "judges": [
      "Mitter, J."
    ],
    "case_number": "Civil Appeal No. 496 of 1966",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "In 1820 the Nizam of Hyderabad granted a jagir to his Prime Minister Nawab Salar Jung I consisting of many villages in Raichur district including Madlapur on the bank of Tungabhadra river.",
      "type": "background",
      "date": "1820",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "In 1930 Nawab Salar Jung III granted an island in Madlapur village comprising S. Nos. 154, 312 and 313 with a hillock of granite rising to 250 ft. measuring Ac. 290-00 to Swami Nijananda, predecessor-in-interest of respondent Swami Satyananda.",
      "type": "material",
      "date": "1930",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The patta Ex.49 for S.Nos. 312 and 313 contains remarks indicating the land was for cultivation or grazing, with Paramboke S.No.254 (Bolurguddi) Ac.290-00 unsurveyed; portions given to applicant Ac.183-33 guntas assessed Rs.46, remainder Ac.106-20 guntas as Paramboke S.No.154; Government right over fruit-bearing trees reserved.",
      "type": "material",
      "date": "1331 Fasli",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Ex.50 proforma No.8 Takavi statement for Paramboke patta granted 7th Mehar 1336 F. for unsurveyed Paramboke No.154 Ac.106-20 guntas.",
      "type": "material",
      "date": "1336 F",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Letter from Settlement Department states land unfit for cultivation, useful for grazing cattle, tamarind trees belong to Government.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "February 3, 1946: Entire area covered by grant to Swami Nijananda notified for acquisition under Hyderabad Land Acquisition Act for Tungabhadra Project to gather granite for dam construction.",
      "type": "procedural",
      "date": "1946-02-03",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "June 16, 1947: Final notification of acquisition.",
      "type": "procedural",
      "date": "1947-06-16",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "July 24, 1950: Land Acquisition Officer award Rs.31,260-8-0 total compensation, disallowing claim for granite hillock as not covered by grant to Swami Nijananda. Respondent claimed Rs.29,91,600; claims also by Nawab Salar Jung III but jagirs abolished.",
      "type": "procedural",
      "date": "1950-07-24",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "District Judge on reference enhanced compensation to Rs.48,892 exclusive of statutory allowance and interest; found rock within patta land but no quarry rights based on Farmans Exs.A-21,A-22, Section 2(d) Mines Act, Section 3 Hyderabad Land Revenue Act.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Mysore High Court Regular Appeal No.75/1956 judgment August 10, 1964: Held District Judge assumed jagir included minerals; Farmans did not affect subsisting rights; granite not a mineral; no consideration of original grant terms; set aside District Judge on quarry rights.",
      "type": "procedural",
      "date": "1964-08-10",
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the respondent was entitled to sub-soil rights by virtue of the pattas granted by Nawab Salar Jung III and consequently to compensation for acquisition of granite hillock.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the quarry/granite hillock was within the patta land.",
      "framed_by": "lower_court"
    },
    {
      "id": "i3",
      "text": "Whether granite is a mineral.",
      "framed_by": "court"
    },
    {
      "id": "i4",
      "text": "Whether the jagir grant to Nawab Salar Jung I included mining rights and whether patta conferred same.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Respondent must prove grant of mineral/quarry rights from Nizam to Salar Jung and co-extensive rights in patta; no presumption; patta Ex.49 shows purpose cultivation/grazing, trees reserved, no mining implied; granite is mineral.",
      "supporting_facts": [
        "f3",
        "f4",
        "f5"
      ],
      "legal_basis": "Privy Council cases on no implication of sub-soil rights; State of Andhra Pradesh v. Duvvuru Balarami Reddy"
    },
    {
      "id": "pa2",
      "text": "Advocate-General contention (first time in High Court): Original jagir grant to Nawab Salar Jung did not include right to granite in hillock.",
      "supporting_facts": [
        "f1"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Pattas conferred sub-soil rights equivalent to jagirdar's; granite hillock covered; entitled to compensation Rs.29,91,600.",
      "supporting_facts": [
        "f2",
        "f9"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "No need to consider Farmans Exs.A-21,A-22 or Section 63 Hyderabad Land Revenue Act; burden on respondent to prove mineral rights granted; no presumption Nizam parted with mineral rights or jagirdar did.",
      "addresses_issue": "i1",
      "key_observation": "No scope for presumption of mineral rights transfer."
    },
    {
      "id": "cr2",
      "text": "Patta Ex.49,50 and letters show contemplation was cultivation or grazing cattle; grantor reserved fruit trees; unrealistic to imply mining rights.",
      "addresses_issue": "i4",
      "key_observation": "Purpose surface use only, excludes sub-soil by implication."
    },
    {
      "id": "cr3",
      "text": "Principle from Privy Council cases: sub-soil rights not conveyed by implication in surface grants; applies beyond zamindari, depends on grant purpose.",
      "addresses_issue": "i1",
      "key_observation": "If lease for surface user, sub-soil not included absent express grant."
    },
    {
      "id": "cr4",
      "text": "Granite is a mineral per mining/commercial meaning; Halsbury and Attorney General v. Welsh Granite Co.",
      "addresses_issue": "i3",
      "key_observation": "Granite included in minerals."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Pattas did not confer sub-soil/mining/quarry rights; claim to compensation for granite hillock negatived.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Granite is a mineral.",
      "resolves_issue": "i3",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Hari Narayan Singh v. Sriram Chakravarti",
      "citation": "37 I.A. 136",
      "treatment": "followed",
      "relevance": "Zamindar presumed owner of underground rights absent evidence parted with them."
    },
    {
      "case_name": "Durga Prasad Singh v. Braja Nath Bose",
      "citation": "39 I.A. 133",
      "treatment": "followed",
      "relevance": "No proprietary right in minerals to tenure-holder absent evidence zamindar parted with them."
    },
    {
      "case_name": "Girdhari Singh v. Megh Lai Pandey",
      "citation": "44 I.A. 246",
      "treatment": "followed",
      "relevance": "Mokarari lease does not include minerals absent express/implied grant; 'with all rights' insufficient."
    },
    {
      "case_name": "Sashi Bhushan Misra v. Jyoti Prasahad Singh Deo",
      "citation": "44 I.A. 46",
      "treatment": "referred",
      "relevance": "Minerals not part of tenure grant absent express evidence."
    },
    {
      "case_name": "Govinda Narayan Singh v. Sham Lai Singh",
      "citation": "58 I.A. 125",
      "treatment": "followed",
      "relevance": "Burden on claimant to prove against zamindar."
    },
    {
      "case_name": "Bejoy Singh Dudhoria v. Surendra Narayan Singh",
      "citation": "I.L.R. 61 Calcutta 1",
      "treatment": "followed",
      "relevance": "Patni lease with restrictions implies no soil excavation rights."
    },
    {
      "case_name": "State of Andhra Pradesh v. Duvvuru Balarami Reddy",
      "citation": "1963 1 S.C.R. 173",
      "treatment": "followed",
      "relevance": "Sub-soil rights pass only if conferred expressly or inferred; shrotriemdars no mineral rights."
    },
    {
      "case_name": "Attorney General v. Welsh Granite Co.",
      "citation": null,
      "treatment": "referred",
      "relevance": "Granite is a mineral."
    }
  ],
  "statutes_cited": [
    {
      "name": "Hyderabad Land Acquisition Act",
      "sections": [],
      "relevance": "Governed acquisition proceedings, notifications, award."
    },
    {
      "name": "Hyderabad Land Revenue Act, 1907",
      "sections": [
        "Section 3",
        "Section 63"
      ],
      "relevance": "District Judge relied on; court held unnecessary to consider as no sub-soil rights granted."
    },
    {
      "name": "Mines Act",
      "sections": [
        "Section 2(d)"
      ],
      "relevance": "District Judge relied on for no quarry rights."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; decree of High Court regarding minerals in land or quarry rights set aside; judgment and order of District Judge on that point restored; claim to compensation on basis of sub-soil rights to hillock negatived.",
    "relief_granted": "None to respondent for sub-soil rights",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "Nobody at that time had any thought or idea of the land being put to any other use or any mining or quarrying rights being exercised therein.",
      "speaker": "court",
      "significance": "Interprets intent of patta grant as surface use only."
    },
    {
      "text": "It would be wholly unrealistic to construe the grant as conferring mining rights by implication simply because of the fact that there was no mention of it.",
      "speaker": "court",
      "significance": "Rejects implication of sub-soil rights."
    },
    {
      "text": "the title of the zamindar raja to the village Petena as part of his zamindari before the arrival of the Goswamis on the scene being established as it has been, he must be presumed to be the owner of the underground rights thereto appertaining in the absence of evidence that he ever parted with them",
      "speaker": "court",
      "significance": "From Hari Narayan; burden and presumption against sub-soil transfer."
    },
    {
      "text": "unless there be by the terms of the lease an express or plainly implied grant of those rights, they remain reserved to the zamindar as part of the zamindari.",
      "speaker": "court",
      "significance": "Principle from Girdhari Singh on mineral rights reservation."
    }
  ],
  "_case_id": "1971_148",
  "_label": 1,
  "_text_length": 22515,
  "_extracted_at": "2026-02-10T20:15:05.883499"
}