{
  "metadata": {
    "case_name": "Plaintiffs v. Defendant No. 1",
    "case_year": 1971,
    "court": "Supreme Court of India",
    "judges": [
      "Sikri, C.J."
    ],
    "case_number": "Civil Appeal No. 74 of 1971",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Plaintiffs (landlords) leased plot of land on Mount Road, Madras, to defendant No. 1 under duly registered lease deed dated November 17, 1938, for 15 years 3 months from March 1, 1939, at rent of Rs. 560 per month, with option for renewal for further 10 years from March 1, 1954 at enhanced rent of Rs. 630 per month.",
      "type": "material",
      "date": "1938-11-17",
      "source": "petitioner"
    },
    {
      "id": "f2",
      "text": "Lease contained clauses requiring lessee to erect theatre with offices, outbuildings (bazars, restaurants, motor and dynamo sheds), fences, drains, sewers for films and drama, expending not less than Rs. 50,000; liberty to put up other buildings.",
      "type": "material",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "Covenants: No entrance from General Peters Road without police permission; comply with statutes, bylaws; indemnify lessors; pay assessments except property tax and quit rent; no nuisance; no petrol pump without permission; no compound wall on south, only iron railings up to 3 feet.",
      "type": "material",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "Clause 4(d): At expiration or sooner determination, lessors option to buy buildings at Rs. 50,000 irrespective of cost, minus 3% depreciation per annum from March 1, 1939; if not exercised within week, lessee to remove buildings and restore land.",
      "type": "material",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "Defendant No. 1 constructed theatre in accordance with stipulations and used for exhibition of cinema films.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Defendant No. 1 exercised renewal option for 10 years from March 1, 1954, continuing in possession till expiration with February 1964.",
      "type": "admitted",
      "date": "1954-03-01",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Plaintiffs exercised option to buy buildings by letter dated February 27, 1964, tendered Rs. 50,000 by cheque without deducting depreciation, stating they waived strict rights as buildings maintained.",
      "type": "material",
      "date": "1964-02-27",
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "Defendant No. 1 refused Rs. 50,000, contended plaintiffs not entitled to enforce clause 4(d) due to Madras City Tenants Protection Act, 1921 as amended in 1955.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f9",
      "text": "Plaintiffs filed suit; trial judge (Kunhamed Kutti, J.) decreed on February 20, 1967; Division Bench (Veeraswami, C.J. and Gokulakrishnan, J.) dismissed appeal on June 17, 1970.",
      "type": "procedural",
      "date": "1967-02-20",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Plaintiffs applied for amendment of plaint on April 15, 1964, adding prayer for possession from March 1, 1964 and mesne profits from August 4, 1968 at Rs. 12,000 per month.",
      "type": "procedural",
      "date": "1964-04-15",
      "source": "petitioner"
    },
    {
      "id": "f11",
      "text": "No evidence as to what other buildings defendant put up beyond theatre.",
      "type": "background",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the plaintiffs were entitled to enforce clause 4(d) of the lease deed in view of the Madras City Tenants Protection Act, 1921, as amended by the Amending Act of 1955.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Clauses in lease deed amount to stipulations as to erection of buildings, so proviso to Section 12 of the Act applies, allowing enforcement of option to purchase at Rs. 50,000 minus depreciation.",
      "supporting_facts": [
        "f2",
        "f3",
        "f4",
        "f7"
      ],
      "legal_basis": "Proviso to Section 12, Madras City Tenants Protection Act, 1921; Mylapore Hindu Permanent Fund Ltd. v. K. S. Subramania Iyer"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Plaintiffs not entitled to claim rights under clause 4(d) due to the Act; distinguished Mylapore case as defendant entitled to put up buildings beyond Rs. 50,000 value.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": "Madras City Tenants Protection Act, 1921 as amended 1955"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Case covered by Mylapore Hindu Permanent Fund Ltd. v. K. S. Subramania Iyer; clauses amount to stipulations as to erection of buildings, proviso to S.12 applies; not contracting out of statutory rights but satisfying legislation by allowing building to stand and paying compensation.",
      "addresses_issue": "i1",
      "key_observation": "Decision in Vajranani case misunderstood; rights under Act do not directly relate to covenants on erection of buildings."
    },
    {
      "id": "cr2",
      "text": "Defendant required to erect specific theatre etc. costing not less than Rs. 50,000 for quality; no evidence of other buildings; Act protects tenants who built hoping not to be evicted if paying fair rent, but exempts express stipulations on erections.",
      "addresses_issue": "i1",
      "key_observation": "Clauses ensure proper construction; proviso exempts registered stipulations re buildings erected after contract date."
    },
    {
      "id": "cr3",
      "text": "Allowed amendment for possession from 1-3-1964 and mesne profits from 4-8-1968; mesne profits limited to 3 years prior, no prejudice to defendant.",
      "addresses_issue": "i1",
      "key_observation": "Mesne profits for use and occupation."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Lease clauses are stipulations as to erection of buildings; proviso to S.12 of Madras City Tenants Protection Act, 1921 applies; plaintiffs entitled to enforce option under clause 4(d).",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "N. Vajranani Naidu v. New Theatre Carnatic Talkies",
      "citation": "1964 6 S.C.R. 1015",
      "treatment": "referred",
      "relevance": "Construes Madras City Tenants Protection Act; misunderstood by High Court."
    },
    {
      "case_name": "Mylapore Hindu Permanent Fund Ltd. v. K. S. Subramania Iyer",
      "citation": "A.I.R. 1970 S.C. 1683",
      "treatment": "followed",
      "relevance": "Covers case; clauses as stipulations re erection; proviso to S.12 applies; not contracting out of Act."
    }
  ],
  "statutes_cited": [
    {
      "name": "Madras City Tenants Protection Act, 1921",
      "sections": [
        "Section 12 (proviso)"
      ],
      "relevance": "Exempts registered stipulations as to erection of buildings from tenant protections; applies to allow enforcement of purchase option."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; judgments of Single Judge and Division Bench of Madras High Court set aside; suit decreed in terms of amended prayers (a) and (b): possession of site, buildings from 1-3-1964; mesne profits from 4-8-1968 at Rs.12,000/month till delivery. Remitted to Trial Judge for mesne profits determination. Possession within 6 months. Parties bear own costs throughout.",
    "relief_granted": "Possession of demised plot and superstructures; mesne profits from August 4, 1968.",
    "costs": "Parties to bear their own costs throughout."
  },
  "key_quotes": [
    {
      "text": "\"Therefore, in our opinion, the decision in Vajrananis case supra has been misunderstood by the learned Judges of the Letters Patent Bench and the said decision is not authority for the proposition that the stipulation contained in the lease deed before us cannot come within the proviso to section.\"",
      "speaker": "court",
      "significance": "Clarifies misinterpretation of prior precedent on S.12 proviso."
    },
    {
      "text": "\"It must be remembered that the Madras City Tenants Protection Act, 1921, was passed in 1922 to give protection to certain classes of tenants who had constructed buildings on others lands in the hope that they would not be evicted so long as they paid a fair rent for the land.\"",
      "speaker": "court",
      "significance": "Explains purpose of Act and scope of proviso exemption."
    }
  ],
  "_case_id": "1971_313",
  "_label": 1,
  "_text_length": 11705,
  "_extracted_at": "2026-02-10T20:16:10.403219"
}