{
  "metadata": {
    "case_name": "Management (Appellant) v. Workmen (Respondents Nos. 2 to 24)",
    "case_year": 1966,
    "court": "Supreme Court of India",
    "judges": [
      "Jaganmohan Reddy, J"
    ],
    "case_number": "Civil Appeal No. 1071 of 1966",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Reference No. 150 of 1958 pending before Labour Court in respect of industrial dispute between appellant (management) and its workmen relating to bonus, casual leave and sick leave etc.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Management suspended six workmen on charges of misconduct for refusing to operate some machines.",
      "type": "background",
      "date": null,
      "source": "appellant"
    },
    {
      "id": "f3",
      "text": "Shri Darshan Singh, Helper of Blowing Machine, refused on 25-1-59 to work machine in absence of Shri Daulat Ram, Machineman, and was suspended same day.",
      "type": "material",
      "date": "1959-01-25",
      "source": "appellant"
    },
    {
      "id": "f4",
      "text": "Workmen went to one of partners of appellant, demanded cancellation of suspension order against Darshan Singh and his reinstatement as Helper.",
      "type": "material",
      "date": "1959-01-25",
      "source": "appellant"
    },
    {
      "id": "f5",
      "text": "Management not agreeable to reinstate Darshan Singh, workers went on lightning strike.",
      "type": "material",
      "date": "1959-01-25",
      "source": "appellant"
    },
    {
      "id": "f6",
      "text": "Conciliation efforts by Labour Officer (MW 2), Labour Inspector (MW 4) and management failed; Respondents 2 to 24 along with others did not report for duty despite management's willingness to employ them.",
      "type": "material",
      "date": null,
      "source": "appellant"
    },
    {
      "id": "f7",
      "text": "Charge-sheets served on workmen towards end of January; replies given.",
      "type": "procedural",
      "date": null,
      "source": "appellant"
    },
    {
      "id": "f8",
      "text": "Notices sent to Respondents 2 to 15 and 17 to 24 asking to resume work by specified dates; when they did not, further notices asking to show cause why names should not be struck off, to reply by certain date.",
      "type": "procedural",
      "date": null,
      "source": "appellant"
    },
    {
      "id": "f9",
      "text": "Notice to Respondent 16 (Surat Singh) on 4-3-59: absent since 13-2-59 without leave, resume by 6-3-59, explain by 8-3-59 why name not struck off.",
      "type": "procedural",
      "date": "1959-03-04",
      "source": "appellant"
    },
    {
      "id": "f10",
      "text": "None of Respondents 2 to 24 acknowledged notices or sent replies.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Management by letters dated 23-2-59, 4-3-59, 17-3-59 informed Respondents they were no longer interested in employment, names struck off from muster rolls.",
      "type": "material",
      "date": null,
      "source": "appellant"
    },
    {
      "id": "f12",
      "text": "From 25-1-59 till names struck off, Respondents sat outside Mill gate; despite persuasion by Labour Officer and management, did not join duty; management employed others to keep mill going.",
      "type": "material",
      "date": null,
      "source": "appellant"
    },
    {
      "id": "f13",
      "text": "Workmen who wanted to join duty were permitted and services entertained.",
      "type": "material",
      "date": null,
      "source": "appellant"
    },
    {
      "id": "f14",
      "text": "Strike fizzled out after striking workmen failed to get rations; they abandoned service.",
      "type": "disputed",
      "date": null,
      "source": "appellant"
    },
    {
      "id": "f15",
      "text": "Demand notice on behalf of workmen served on management on 19-3-59; conciliation commenced.",
      "type": "procedural",
      "date": "1959-03-19",
      "source": "court"
    },
    {
      "id": "f16",
      "text": "Conciliation Officer reported management willing to employ workmen, but Respondents not willing till suspended workmen allowed to resume.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f17",
      "text": "Matter referred to Labour Court Jullundur on 26-8-59 under Sec. 10 Industrial Disputes Act to determine if termination of 31 workmen justified; 8 had resumed duties, no longer interested.",
      "type": "procedural",
      "date": "1959-08-26",
      "source": "court"
    },
    {
      "id": "f18",
      "text": "Labour Court Award 31-10-61 published 8-12-61: rejected claim - illegal strike, no termination intended, management always prepared to take back but workers insisted on suspended workmen, adamant, no alternative but terminate and take fresh hands, no evidence workmen requested to resume and turned down.",
      "type": "procedural",
      "date": "1961-10-31",
      "source": "lower_court"
    },
    {
      "id": "f19",
      "text": "Writ Petition by Respondents in Punjab High Court; Single Bench 6-12-64: no abandonment, management terminated services, remanded to Labour Court.",
      "type": "procedural",
      "date": "1964-12-06",
      "source": "lower_court"
    },
    {
      "id": "f20",
      "text": "Management's Letters Patent Appeal dismissed as withdrawn.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f21",
      "text": "Labour Court on remand Award 10-9-65 published 1-10-65: no lock-out substantiated, strike illegal due to pending Ref 150/1958, termination not res integra per HC, alternatively invalid without enquiry; directed reinstatement Respondents 2-24; for Surat Singh (16) no standing orders, not justified for absence; no wages 25-1-59 to 17-3-59, half back wages 18-3-59 to enforceability, full thereafter.",
      "type": "procedural",
      "date": "1965-09-10",
      "source": "lower_court"
    },
    {
      "id": "f22",
      "text": "No standing orders applicable to appellant conceded.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f23",
      "text": "Undisputed: Respondents struck on 25-1-59; strike illegal under Chapter V ID Act due to pending reference; Labour Officers/management persuaded to join, post 19-3-59 conciliation but conditioned on suspended workmen; notices to join then show cause; no reply, continued strike till struck off 23-2-59/4-3-59/17-3-59; no domestic enquiry.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f24",
      "text": "Charge-sheets alleged intimidation, slogan mongering, inciting; denied by workmen; management dropped charges, persuaded to join.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f25",
      "text": "Example correspondence to Amar Nath: 5-2-59 notice illegal strike, resume by 8-2-59 or fresh hands; no claim to reinstatement; could apply as new entrant.",
      "type": "material",
      "date": "1959-02-05",
      "source": "appellant"
    },
    {
      "id": "f26",
      "text": "21-2-59: show cause why not struck off, reply by 25-2-59; chance to join as new.",
      "type": "material",
      "date": "1959-02-21",
      "source": "appellant"
    },
    {
      "id": "f27",
      "text": "4-3-59: continued absence, no show cause per 21-2-59, struck off w.e.f. 4-3-59 for abandonment/illegal strike.",
      "type": "material",
      "date": "1959-03-04",
      "source": "appellant"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the termination of employment of the Respondents in the circumstances of the case without an enquiry was justified.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether for termination of services of workmen on illegal strike, a domestic enquiry into misconduct is obligatory.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Management took every possible step to get workmen back but they were adamant in continuing strike; no alternative but terminate and take fresh hands to keep factory going.",
      "supporting_facts": [
        "f6",
        "f12",
        "f23"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Charge-sheets served alleging intimidation etc., but dropped and persuaded to join; persistent refusal despite notices constitutes misconduct justifying termination.",
      "supporting_facts": [
        "f7",
        "f24",
        "f25",
        "f26",
        "f27"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Management can justify termination before Tribunal even without domestic enquiry by proving misconduct on evidence.",
      "supporting_facts": [
        "f23"
      ],
      "legal_basis": "Industrial Disputes Act; precedents like Punjab National Bank, Motipur Sugar Factory"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Earlier letters charged incitement etc. but management gave go-by; terminated for peaceful strike; notices object to employ afresh depriving past benefits.",
      "supporting_facts": [
        "f24",
        "f25"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Strike weapon for redress does not end employer-employee relation; even for violence/incitement, cannot terminate without enquiry into misconduct.",
      "supporting_facts": [
        "f5",
        "f23"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Merely going on strike (even illegal) does not justify termination; if misconduct alleged, must enquire with specific charges and opportunity to defend.",
      "addresses_issue": "i1",
      "key_observation": "Even illegal strike does not per se justify termination without enquiry into misconduct."
    },
    {
      "id": "cr2",
      "text": "No standing orders, but domestic enquiry still required for misconduct; however, management can justify before Tribunal by evidence proving misconduct, less stringent than court.",
      "addresses_issue": "i2",
      "key_observation": "Tribunal can adjudicate merits if no enquiry or invalid enquiry."
    },
    {
      "id": "cr3",
      "text": "Persistent obdurate refusal to join duty despite persuasions, notices, opportunities over a month constitutes misconduct justifying termination.",
      "addresses_issue": "i1",
      "key_observation": "No need for overt acts like violence in every case; refusal here proved misconduct."
    },
    {
      "id": "cr4",
      "text": "Management proved misconduct; stand reasonable; nothing more could do.",
      "addresses_issue": "i1",
      "key_observation": "No pretext to deprive benefits; notices allowed joining by date or as new entrants."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Termination without domestic enquiry invalid if based on misconduct, but management can prove misconduct before Tribunal to justify.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Persistent refusal to resume duty despite opportunities constitutes misconduct justifying termination.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h3",
      "text": "Termination of Respondents 2-24 justified; no reinstatement. For Surat Singh (16), termination invalid due to no standing orders.",
      "resolves_issue": "i1",
      "in_favor_of": "partial"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Express Newspapers (P) Ltd. v. Michael Mark & Anr.",
      "citation": "1963 3 S.C.R. 405",
      "treatment": "followed",
      "relevance": "Even illegal strike requires domestic enquiry for termination; no abandonment by absence on strike."
    },
    {
      "case_name": "India General Navigation & Railway Co. Ltd. v. Their Workmen",
      "citation": "1960 2 S.C.R. 1",
      "treatment": "followed",
      "relevance": "Mere participation in illegal strike without more does not justify dismissal; opportunity to explain conduct needed; Tribunal not appeal on evidence sufficiency."
    },
    {
      "case_name": "Punjab National Bank Ltd. v. Its Workmen",
      "citation": "1960 S.C.R. 806",
      "treatment": "followed",
      "relevance": "No enquiry, but justified termination before Tribunal for illegal strike; no difference Sec.10 vs 33A."
    },
    {
      "case_name": "Workmen of Motipur Sugar Factory (P) Ltd. v. Motipur Sugar Factory",
      "citation": "1965 3 S.C.R. 588",
      "treatment": "followed",
      "relevance": "No enquiry, but Tribunal can try merits; discharge justified if misconduct (go-slow) proved."
    },
    {
      "case_name": "Hindustan General Electrical Corporation Ltd. v. Bishwanath Prasad & Anr.",
      "citation": "Civil Appeal No. 2167 of 1966",
      "treatment": "followed",
      "relevance": "Even no enquiry/Sec.33 contravention, Tribunal adjudicates if properly dismissed under Sec.10."
    }
  ],
  "statutes_cited": [
    {
      "name": "Industrial Disputes Act, 1947",
      "sections": [
        "Sec. 10",
        "Chapter V",
        "Sec. 23",
        "Sec. 24",
        "Sec. 33",
        "Sec. 33A"
      ],
      "relevance": "Reference under Sec.10; strike illegal under Chapter V/Sec.23(b)/24(1) due to pending proceedings; justification before Tribunal even if Sec.33 contravened."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed except for Respondent No.16 (Surat Singh); termination of services of Respondents 2-24 justified as misconduct proved before Tribunal despite no domestic enquiry; Labour Court Award directing their reinstatement set aside; Award for Surat Singh maintained due to no standing orders.",
    "relief_granted": "None to Respondents 2-24; reinstatement maintained for Respondent 16.",
    "costs": "No order as to costs."
  },
  "key_quotes": [
    {
      "text": "The short question for our consideration is whether the termination of employment of the Respondents in the circumstances of the case without an enquiry was justified.",
      "speaker": "court",
      "significance": "Frames the core legal issue."
    },
    {
      "text": "merely because workmen go on strike it does not justify the management, in terminating their services. In any case if allegations of misconduct have been made against them those allegations have to be enquired into",
      "speaker": "court",
      "significance": "Principle: strike (even illegal) requires enquiry for misconduct-based termination."
    },
    {
      "text": "persistent and obdurate refusal by the workmen to join duty notwithstanding the fact that the management has done everything possible to persuade them ... would constitute misconduct and justify the termination",
      "speaker": "court",
      "significance": "Defines misconduct sufficient here without overt violence."
    }
  ],
  "_case_id": "1971_641",
  "_label": 1,
  "_text_length": 27182,
  "_extracted_at": "2026-02-10T20:20:17.591779"
}