{
  "metadata": {
    "case_name": "Deputy Commissioner of Commercial Taxes v. Hindustan Aeronautics Ltd.",
    "case_year": 1968,
    "court": "Supreme Court of India",
    "judges": [
      "Sikri, C.J."
    ],
    "case_number": "Civil Appeal No. 710 of 1968",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Commercial Tax Officer by assessment order dated March 28, 1964, for assessment year 1958-59, included turnover in respect of supply of railway coaches models 407, 408 and 411 to Railway Board.",
      "type": "procedural",
      "date": "1958-59",
      "source": "lower_court"
    },
    {
      "id": "f2",
      "text": "Sales Tax Officer rejected assessee's contention that no sale involved, only works contract, relying on McKenzie Ltd. v. State of Bombay and Jiwan Singh v. State of Punjab.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f3",
      "text": "Deputy Commissioner of Commercial Taxes confirmed the order in appeal.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f4",
      "text": "Commissioner of Commercial Taxes in revision confirmed, observing contracts for manufacture and supply of railway coaches; under-frames remain property of Railway Board but supplied free of cost; no typical works contract conditions; materials hypothecated for advances.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "Assessee appealed to Mysore High Court under s.24 of Mysore Sales Tax Act read with s.9 of Central Sales Tax Act.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "High Court directed Commercial Tax Officer to report on advances drawn, materials used without advances, and materials not specifically procured.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Commercial Tax Officer reported: assessee purchased materials, sent invoices, received 90% advance after inspection; running account maintained; no materials without advance used; materials kept separately in dedicated shed with separate registers.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "High Court allowed assessee's appeal, set aside inclusion of turnover for coaches models 407, 408, 411.",
      "type": "procedural",
      "date": "1967-03-01",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "On February 3, 1955, Ministry of Railways wrote to Hindustan Aircraft Ltd. booking capacity for 180 coaches:  Third Class B.G. model 407, Military M type model 408.",
      "type": "background",
      "date": "1955-02-03",
      "source": "respondent"
    },
    {
      "id": "f10",
      "text": "Railway Board placed order dated May 4, 1957 for manufacture and supply of 180 Broad Gauge Class III Coaches model 407; price provisional Rs. 94,731 per coach without wheels, axles, underframes.",
      "type": "material",
      "date": "1957-05-04",
      "source": "respondent"
    },
    {
      "id": "f11",
      "text": "Wheelsets and underframes supplied free of cost f.o.r. assessee's works siding.",
      "type": "material",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f12",
      "text": "Advance payments: 90% of material value on receipt and certificate from inspecting authority.",
      "type": "material",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f13",
      "text": "Final payment on delivery after certification by Chief Administrative Officer, Integral Coach Factory, Perambur.",
      "type": "material",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f14",
      "text": "Inspection by C.M.E. Southern Railway before despatch.",
      "type": "material",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f15",
      "text": "Standing Indemnity Bond: Assessee holds stores and articles (materials for which advances made) as property of President of India in trust; responsible for custody; open to inspection.",
      "type": "material",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f16",
      "text": "Sample invoice Oct 15, 1956: For materials Rs. 2,60,374; 90% advance Rs. 2,34,517 requested.",
      "type": "material",
      "date": "1956-10-15",
      "source": "respondent"
    },
    {
      "id": "f17",
      "text": "For model 411, wheelsets and underframes not supplied free but otherwise similar terms.",
      "type": "material",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the delivery by the assessee to the Railway Board of railway coaches models 407, 408 and 411 is liable to sales tax under the Central Sales Tax Act, or is it a works contract.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Contracts specifically for manufacture and supply of railway coaches; under-frames remain property of Railway Board but order is for manufacture and supply; payment referred to as price; no typical works contract conditions like inspection during execution; advances are part payment, materials hypothecated.",
      "supporting_facts": [
        "f4",
        "f10"
      ],
      "legal_basis": "McKenzie Ltd. v. State of Bombay (13 S.T.C. 602); Jiwan Singh v. State of Punjab (14 S.T.C. 957)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "No sale involved; pure works contract as materials become property of Railway before use per indemnity bond; underframes supplied free; separate accounting and storage.",
      "supporting_facts": [
        "f7",
        "f11",
        "f12",
        "f15"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Answer depends on construction of contract terms and surrounding circumstances; salient features: capacity booked for construction; 90% advance on materials which become Railway property per indemnity bond before use; no other materials used; underframes free for 407/408; thus pure works contract, no sale of coaches when all materials belong to Railways.",
      "addresses_issue": "i1",
      "key_observation": "When all material used belongs to Railways, difference between coach price and material cost is only for services rendered."
    },
    {
      "id": "cr2",
      "text": "For model 411, no essential difference despite no free underframes.",
      "addresses_issue": "i1",
      "key_observation": "In line with State of Gujarat v. Kailash Engineering Co."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Transaction is a pure works contract, not a sale within meaning of Central Sales Tax Act.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "McKenzie Ltd. v. State of Bombay",
      "citation": "13 S.T.C. 602",
      "treatment": "referred",
      "relevance": "Relied on by tax authorities to hold sale involved"
    },
    {
      "case_name": "Jiwan Singh v. State of Punjab",
      "citation": "14 S.T.C. 957",
      "treatment": "referred",
      "relevance": "Relied on by tax authorities to hold sale involved"
    },
    {
      "case_name": "State of Gujarat v. Kailash Engineering Co.",
      "citation": null,
      "treatment": "followed",
      "relevance": "Close to facts; supports works contract"
    },
    {
      "case_name": "McKenzies v. State of Maharashtra",
      "citation": "16 S.T.C. 518",
      "treatment": "referred",
      "relevance": "Mentioned in context of cases referred"
    },
    {
      "case_name": "Patnaik Co. v. State of Orissa",
      "citation": "1965 2 S.C.R. 782",
      "treatment": "referred",
      "relevance": "Mentioned in context of cases referred"
    }
  ],
  "statutes_cited": [
    {
      "name": "Central Sales Tax Act",
      "sections": [
        "s. 9"
      ],
      "relevance": "Liability to sales tax on inter-state sale"
    },
    {
      "name": "Mysore Sales Tax Act",
      "sections": [
        "s. 24"
      ],
      "relevance": "Appeal to High Court"
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court upheld Mysore High Court's decision setting aside the inclusion of turnover relating to construction of railway coaches models 407, 408 and 411, holding it a works contract not liable to sales tax.",
    "relief_granted": "No sales tax on supply of coaches",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"the Hindustan Aircraft Ltd. hereby undertake to hold at their works at Bangalore for and on behalf of the President of the Union of India, and as his property in trust for him the Stores and articles\"",
      "speaker": "court",
      "significance": "Establishes materials become Railway property before use"
    },
    {
      "text": "\"it is a pure works contract. We are unable to agree that when all the material used in the construction of a coach belongs to the Railways there can be any sale of the coach itself.\"",
      "speaker": "court",
      "significance": "Core holding distinguishing works contract from sale"
    }
  ],
  "_case_id": "1971_513",
  "_label": 0,
  "_text_length": 16930,
  "_extracted_at": "2026-02-10T20:16:54.888509"
}