{
  "metadata": {
    "case_name": "Appellant (Assessee) v. Respondent (Commercial Tax Authorities)",
    "case_year": 1967,
    "court": "Supreme Court of India",
    "judges": [
      "Jaganmohan Reddy, J."
    ],
    "case_number": "Civil Appeal No. 1175 of 1967",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appeal by certificate against judgment and order dated September 30, 1966 of Mysore High Court in S.T.R.P. No. 58 of 1965, dismissing revision petition against order of Mysore Sales Tax Appellate Tribunal confirming assessment order of Commercial Tax Officer and appellate order of Deputy Commissioner of Commercial Taxes.",
      "type": "procedural",
      "date": "1966-09-30",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "For assessment year 1959-60, appellants declared total turnover of Rs. 13,04,097/- in respect of purchase of safety matches and claimed exemption on entire turnover as subsequent sale from dealers in State of Mysore.",
      "type": "material",
      "date": "1959-60",
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "Sale of matches taxable under sec. 5(3)(a) of Mysore Sales Tax Act, 1957 on first or earliest of successive dealers in State of Mysore.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Appellant purchases matches from Sales Depots of National Match Works, Lakshmi Match Works and Palaniappa Match Industries at Devangere, claimed as first sellers liable to tax; appellant as second dealer not liable.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "Modus operandi: Appellant places orders with Sales Depots at Devangere (registered dealers); Depots forward orders to Head Offices at Sivakasi and instruct despatch direct to appellant at Devangere; matches despatched by lorry to appellant.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Sales Depots send detailed invoices to appellant for matches despatched by factories.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Appellant gives credit to value of matches after deducting octroi, lorry freight and incidental charges; remits value direct to factory by draft and telegraphic transfer at request of sales office.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Assessing authority held transactions as inter-State sales u/s 3(a) Central Sales Tax Act; appellant first dealer in matches in Mysore State, liable to pay Sales Tax; assessed accordingly.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Appeal to Deputy Commissioner of Commercial Taxes dismissed.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Further appeal to Mysore Sales Tax Appellate Tribunal dismissed.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Facts as found not disputed by parties.",
      "type": "admitted",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether on the facts and circumstances, assessee's turnover in respect of safety matches is liable to tax, or exempt on ground that sales effected are not first sales in the State.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Appellant purchases matches from Sales Depots at Devangere who are first sellers; appellant is second dealer not liable to tax.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": "Sec. 5(3)(a) Mysore Sales Tax Act, 1957"
    },
    {
      "id": "pa2",
      "text": "Relies on despatch advice, delivery notes and invoices issued in name of assessee showing Sales Tax charged, indicating sale by manufacturer at Sivakasi first to Sales Depots, then appellant purchased from Depots; not first purchaser in Mysore.",
      "supporting_facts": [
        "f5",
        "f6"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Cites Ram Narain Sons v. Assistant Commissioner of Sales Tax for contention that similar circumstances make sale to depots first, sale to assessee second, not assessable.",
      "supporting_facts": [],
      "legal_basis": "Ram Narain Sons v. Assistant Commissioner of Sales Tax, (1955) 2 SCR 483"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Transactions are inter-State sales u/s 3(a) Central Sales Tax Act; appellant is first dealer in Mysore State liable to tax.",
      "supporting_facts": [
        "f5",
        "f7",
        "f8"
      ],
      "legal_basis": "Sec. 3(a) Central Sales Tax Act; Sec. 5(3)(a) Mysore Sales Tax Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "On facts, sales made by factories direct to appellant; sales price sent directly to factories at Sivakasi; orders routed through Sales Depot does not make it sale to Depot.",
      "addresses_issue": "i1",
      "key_observation": "No sale between manufacturer and its own Sales Depot conceivable."
    },
    {
      "id": "cr2",
      "text": "Invoices showing Sales Tax charged by Depot not urged before authorities or High Court; no finding thereon.",
      "addresses_issue": "i1",
      "key_observation": "Facts found not disputed."
    },
    {
      "id": "cr3",
      "text": "Under Act, first sale in State exigible to tax; sale defined in sec. 2(t); Explanation 3 deems sale/purchase in State if goods within State at time of contract (specific goods) or appropriation (unascertained goods).",
      "addresses_issue": "i1",
      "key_observation": "Transactions are first sales in favour of appellant within Mysore."
    },
    {
      "id": "cr4",
      "text": "Ram Narain Sons not applicable: there Court considered different issues under MP Act and Art. 286; facts involved sales through depots/agents in other states, held sales effected there, not assisting appellant.",
      "addresses_issue": "i1",
      "key_observation": "High Court correctly did not rely on it due to different statutory context."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Assessee's transactions are first sales in Mysore State under Mysore Sales Tax Act; liable to tax.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Ram Narain Sons v. Assistant Commissioner of Sales Tax",
      "citation": "1955 2 SCR 483",
      "treatment": "distinguished",
      "relevance": "Cited by appellant for similar depot transactions being second sale; Court holds inapplicable due to different statutory definition and facts under MP Act and Art. 286."
    }
  ],
  "statutes_cited": [
    {
      "name": "Mysore Sales Tax Act, 1957",
      "sections": [
        "Sec. 5(3)(a)",
        "Sec. 2(t)",
        "Explanation 3 to Sec. 2(t)"
      ],
      "relevance": "Tax on first sale in State; definition of sale and place of sale determining transactions as first sales in Mysore."
    },
    {
      "name": "Central Sales Tax Act",
      "sections": [
        "Sec. 3(a)"
      ],
      "relevance": "Classified transactions as inter-State sales, making assessee first dealer in State."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 286(1)(a)",
        "Proviso to Article 286(2)"
      ],
      "relevance": "Mentioned in context of cited precedent regarding inter-State sales restrictions."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court dismisses the appeal, upholding the orders of Sales Tax authorities, Tribunal and High Court; confirms assessee liable to tax on turnover as first sales in Mysore State.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "It is also inconceivable that there can be a sale between the manufacturer and its Sales Depot.",
      "speaker": "court",
      "significance": "Rejects notion of prior sale to depot."
    },
    {
      "text": "The sale or purchase of goods shall be deemed... to have taken place in the State wherever the contract... if the goods are within the State.",
      "speaker": "court",
      "significance": "Applies definition to hold sales occur in Mysore."
    },
    {
      "id": "kq3",
      "text": "We are unable to appreciate how this case really assists the appellants.",
      "speaker": "court",
      "significance": "Dismisses reliance on Ram Narain Sons."
    }
  ],
  "_case_id": "1971_449",
  "_label": 0,
  "_text_length": 8657,
  "_extracted_at": "2026-02-10T20:16:56.049228"
}