{
  "metadata": {
    "case_name": "Andhra Bank Ltd. v. Veeramachaneni Gangadhara Rao",
    "case_year": 1966,
    "court": "Supreme Court of India",
    "judges": [
      "Hegde, J"
    ],
    "case_number": "Civil Appeal No. 786 of 1966",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Defendants 1 to 3 were partners of Aid Co. Ltd. (defendant No. 6), managing agents of Godavari Sugars Refiners Ltd. (defendant No. 5). First defendant was Managing Director of Aid Co. Ltd.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On January 29, 1952, first defendant applied on behalf of Godavari Sugars to Andhra Bank for loan of three to four lakhs under key loan and cash credit, guaranteed by defendants 1 to 3 personally (Ex. A-3).",
      "type": "material",
      "date": "1952-01-29",
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "Managing Director sanctioned Rs. 50,000 tentatively on April 24, 1952, before Board sanction. Pronote and cash credit agreement executed by defendants 1 to 3.",
      "type": "material",
      "date": "1952-04-24",
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "Defendant 1 drew Rs. 20,100 on April 25, 1952 and Rs. 9,000 on April 26, 1952, deposited Rs. 8,100 on April 25, leaving Rs. 21,000 due.",
      "type": "material",
      "date": "1952-04-25",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Board sanctioned loan up to Rs. 1,25,000 on April 26, 1952.",
      "type": "material",
      "date": "1952-04-26",
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "Provisional liquidator appointed for Godavari Sugars by Madras High Court on April 18, 1952 on creditors' petition, without objection from defendants 1 to 3. Not disclosed to Bank.",
      "type": "material",
      "date": "1952-04-18",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Bank's claim as pledgee over goods rejected by High Court; Bank incurred Rs. 1548-10-6 expenses.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Appellant (defendant 4) and defendant 1 are divided brothers with separate businesses in Masulipatam and Madras.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "On October 15, 1952, appellant applied for secured overdraft of Rs. 50,000 for business, offering title deeds of sites worth Rs. 1 lakh at Vijayawada (Ex. A-67).",
      "type": "material",
      "date": "1952-10-15",
      "source": "respondent"
    },
    {
      "id": "f10",
      "text": "Board sanctioned Rs. 25,000 on January 11, 1953, secured by mortgage by deposit of title deeds.",
      "type": "material",
      "date": "1953-01-11",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Title deeds Ex. A-7 and A-8 deposited on January 15, 1953 at Masulipatam branch with memorandum Ex. A-6 signed by defendants 1, 4 and another.",
      "type": "disputed",
      "date": "1953-01-15",
      "source": "petitioner"
    },
    {
      "id": "f12",
      "text": "Ex. A-6 is printed form, incomplete as unnecessary words not struck out; intended to record prior agreement.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "No reference to appellant as surety or his property as security in loan docs for Godavari Sugars (Ex. A-3, A-71).",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Equitable mortgage not shown in Bank's books as security for Godavari loans.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f15",
      "text": "PW3 (Managing Director) evidence: Loan to appellant sanctioned on deposit of title deeds to secure Rs. 25,000; refrained from criminal action on assurances.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f16",
      "text": "Appellant cleared Rs. 25,000 loan; pronote returned.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f17",
      "text": "Godavari loans at Bhimavaram branch; appellant's at Masulipatam branch.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f18",
      "text": "Appellant requested renewal of overdraft in 1954; Bank delayed, pressured for settlement of brother's dues (Ex. A-25).",
      "type": "material",
      "date": "1954-09-20",
      "source": "respondent"
    },
    {
      "id": "f19",
      "text": "Appellant withdrew application, demanded return of title deeds; Bank claimed they secure def1 dues (lawyer notice Ex. A-18, April 5, 1954).",
      "type": "procedural",
      "date": "1954-04-05",
      "source": "petitioner"
    },
    {
      "id": "f20",
      "text": "Suit decreed against all defendants by trial court, affirmed by High Court on basis of Ex. A-6; decree against others final.",
      "type": "procedural",
      "date": "1964-06-09",
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether Ex. A-7 and A-8 were deposited with the Bank to secure the debts due from defendant No. 1 (Godavari Sugars loans) or only the appellant's Rs. 25,000 loan.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether Ex. A-6 constitutes a contract of mortgage requiring registration under s.17 Registration Act, or a mere memorandum evidencing prior deposit.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Defendants 1 and 4 requested Bank to refrain from legal action post High Court rejection; deposited Ex. A-7, A-8 on 15-1-1953 creating equitable mortgage for all sums due from defendants 1 and 4 (plaint para 9); Ex. A-6 wide language covers suit debts.",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "PW3: Appellant and def1 requested loan Rs.25k with title deeds as additional security for Godavari commitments; Bank refrained from action.",
      "supporting_facts": [
        "f15"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Appellant had nothing to do with suit transactions; title deeds deposited only to secure his own Rs.25,000 overdraft under Ex. A-67; no request to refrain from action against def 1-3.",
      "supporting_facts": [
        "f9",
        "f10",
        "f16",
        "f19"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Ex. A-6 incomplete printed form, unnecessary words not struck; mere memo for his loan.",
      "supporting_facts": [
        "f12"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "No documentary or reliable oral evidence supports plaint para 9; no mention in correspondence or accounts linking deposit to suit debts.",
      "addresses_issue": "i1",
      "key_observation": "Separate branches, separate securities; Godavari loans on personal guarantee and pledge of goods only."
    },
    {
      "id": "cr2",
      "text": "Ex. A-6 incomplete (words not struck), no term about securing def1 debt in consideration of forbearance; recitals show it records prior agreement, not contract itself.",
      "addresses_issue": "i2",
      "key_observation": "If contract, requires registration u/s 17 Reg Act, inadmissible unregistered; if mere memo, recitals' correctness examinable u/ss 91-92 Evidence Act, but evidence shows only for appellant's loan."
    },
    {
      "id": "cr3",
      "text": "PW3 evidence inconsistent with plaint, makes new case; deposit per Board resolution for appellant's loan only.",
      "addresses_issue": "i1",
      "key_observation": "Overall evidence and probabilities: deposit not for suit debts."
    },
    {
      "id": "cr4",
      "text": "Cited precedents: If written bargain, it alone governs security (Rachpal Maharaj, Pranjivandas); deposit with intent implies contract, but written reduces to silence implications unless mere evidential memo.",
      "addresses_issue": "i2",
      "key_observation": "Whichever view, plaintiff's case fails."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Ex. A-7 and A-8 not deposited to secure debts due from defendant No. 1; decree against appellant unsustainable.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Ex. A-6 incomplete, not contract; if contract, inadmissible unregistered; if memo, does not support securing suit debts.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Rachpal Maharaj v. Bhagwandas Daruka",
      "citation": "1950 S.C.R. 548",
      "treatment": "followed",
      "relevance": "If parties reduce deposit contract to writing, document requires registration u/s 17 Reg Act if creates interest in immovable property."
    },
    {
      "case_name": "Pranjivandas Mehta v. Chan Ma Phee",
      "citation": "43 I.A. 123",
      "treatment": "followed",
      "relevance": "Written bargain accompanying deposit alone determines scope of security."
    },
    {
      "case_name": "Shaw v. Foster",
      "citation": "1872 L.R. 5 H.L. 321",
      "treatment": "referred",
      "relevance": "Deposit with written charge: terms of document govern, excluding implications."
    },
    {
      "case_name": "Subrmonian v. Lutchman",
      "citation": "51 I.A. 77",
      "treatment": "followed",
      "relevance": "If memorandum is contract repository, requires registration."
    },
    {
      "case_name": "Kedarnath Dutt v. Shamloll Khettry",
      "citation": "It Ben. L.R. O.C.J. 405",
      "treatment": "referred",
      "relevance": "Oral proof cannot substitute written contract evidence."
    }
  ],
  "statutes_cited": [
    {
      "name": "Registration Act, 1908",
      "sections": [
        "Section 17"
      ],
      "relevance": "Unregistered document purporting as mortgage contract inadmissible if creates interest in immovable property worth Rs.100+."
    },
    {
      "name": "Evidence Act",
      "sections": [
        "Section 91",
        "Section 92"
      ],
      "relevance": "If mere memorandum, recitals examinable without inhibition by these sections."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; decree against appellant (4th defendant) set aside as title deeds Ex. A-7 and A-8 not deposited to secure suit debts due from defendant 1/Godavari Sugars.",
    "relief_granted": "Decree against appellant not sustainable; appeal allowed.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "Whichever view is taken the plaintiffs case must fail. On an overall consideration of the evidence and probabilities of the case it was established that Exbs. A-7 and A-8 were not deposited with the Bank to secure the debts due from defendant No. 1 to the Bank.",
      "speaker": "court",
      "significance": "Core holding reversing decree against appellant."
    },
    {
      "text": "The language of Ex. A-6 was undoubtedly wide and if it governed the agreement between the parties then there could be no doubt that the suit debts were also secured by the deposit of title deeds A-7 and A-8. But Ex. A-6 could not be considered a contract...",
      "speaker": "court",
      "significance": "Explains why broad language in Ex. A-6 does not bind."
    },
    {
      "text": "If that document was considered as a contract of mortgage between the Bank and the depositors, the same not having been registered it was inadmissible in evidence.",
      "speaker": "court",
      "significance": "Legal consequence of treating Ex. A-6 as contract."
    }
  ],
  "_case_id": "1971_146",
  "_label": 1,
  "_text_length": 32078,
  "_extracted_at": "2026-02-10T20:15:05.747049"
}