{
  "metadata": {
    "case_name": "Appellant (Rice Mill Lessees) v. Respondents 1 and 2 (Lessors)",
    "case_year": 1966,
    "court": "Supreme Court of India",
    "judges": [
      "Mitter, J."
    ],
    "case_number": "Civil Appeals Nos. 2537 of 1966",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Rice mill in Bhimavaram, West Godavari District, formerly owned by appellant along with respondents 3, 4 and 5. Built on site with area of Ac. 1-75 by N. Raju who obtained lease from guardian of respondents 1 and 2, executed on 21st December 1941, to expire on 17th July 1956.",
      "type": "background",
      "date": "1941-12-21",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Appellant and respondents 3, 4 and 5 were successors-in-interest of the leasehold rights.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Respondents 1 and 2 served notice of ejectment on lessees to quit site and deliver possession on expiry of lease.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f4",
      "text": "Negotiations for new lease; respondents 1 and 2 demanded enhanced rent; agreement arrived on January 6, 1957 between appellant and respondent 5 for themselves and on behalf of 3 and 4, and respondents 1 and 2, for new lease for 30 years commencing January 1, 1957, rent Rs. 540/- per annum payable every two months.",
      "type": "disputed",
      "date": "1957-01-06",
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "Agreement gave option to lessors to purchase rice mill at price fixed by President of Rice Mills Association; if not exercised, lessees entitled to remove structures. Lessees to continue in possession; deed of lease to be executed and registered soon. Written on two stamp papers of Rs. 0-12-0 each, signed and delivered to respondent 1.",
      "type": "disputed",
      "date": "1957-01-06",
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "Appellant effected improvements costing Rs. 30,000 and purchased shares of respondents 3 and 4; respondent 5 sold share to respondent 6 in September 1965.",
      "type": "material",
      "date": "1965-09",
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "On March 12, 1957, respondents 1 and 2 instituted O.S. No. 81 of 1957 in Court of District Munsif, Bhimavaram against appellant, respondents 3,4,5 and others for possession after removing rice mill and structures, claiming entitlement post old lease expiry.",
      "type": "procedural",
      "date": "1957-03-12",
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "On April 4, 1957, respondents 1 and 2 instituted O.S. No. 100 of 1957 claiming damages from appellant and respondent 5 for failure to deliver site from Jan 1, 1957, at Rs. 50/- per day for 94 days (Rs. 4,700); stated separate suit for future mesne profits.",
      "type": "procedural",
      "date": "1957-04-04",
      "source": "respondent"
    },
    {
      "id": "f9",
      "text": "On April 5, 1958, appellant and respondent 5 instituted O.S. No. 92 of 1958 against respondents 1-4 for specific performance of agreement to lease, directing execution of lease deed.",
      "type": "procedural",
      "date": "1958-04-05",
      "source": "petitioner"
    },
    {
      "id": "f10",
      "text": "In O.S. 92/1958, respondents 1 and 2 denied execution of agreement; in other suits, appellant and resp 5 pleaded agreement in defence.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f11",
      "text": "Respondents 1 and 2 did not produce original agreement; appellant led oral evidence to prove execution.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Munsif held oral evidence inadmissible but recorded it; found agreement not proved; dismissed O.S. 92/1958; decreed O.S. 81/1957 for possession by July 9, 1960; decreed O.S. 100/1957 for Rs. 117-2-10.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Subordinate Judge, Narsapur, on appeal: set aside Munsif's decrees; decreed specific performance in O.S. 92/1958 directing lease from Jan 1, 1957; accepted oral evidence, held defendants suppressed agreement depriving chance to make good stamp deficiency; conditions of s.27A Specific Relief Act fulfilled.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "High Court in Second Appeals: oral evidence inadmissible under Stamp Act ss.35,36 even if objection raised late; reversed Subordinate Judge.",
      "type": "procedural",
      "date": "1966-09-22",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "whether reception of secondary evidence of a written agreement to grant a lease is barred by the provisions of ss. 35 and 36 of the Indian Stamp Act.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Admissibility of secondary evidence (oral or written) decided by Indian Evidence Act; original insufficiently stamped suppressed by defendants, so secondary evidence under s.65 Evidence Act allowable; Stamp Act no bar if party pays penalty under s.35 proviso (a); s.36 exception applies similarly to oral evidence recorded without objection.",
      "supporting_facts": [
        "f5",
        "f11",
        "f13"
      ],
      "legal_basis": "Indian Evidence Act ss.65, 59, 61-65, 91; Indian Stamp Act ss.35, 36"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Denied execution of agreement; objected to admissibility of oral evidence as secondary evidence of insufficiently stamped document.",
      "supporting_facts": [
        "f10"
      ],
      "legal_basis": "Indian Stamp Act ss.35, 36"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Evidence Act allows secondary evidence under specified conditions, but Stamp Act ss.35,36 bar admission of unstamped/insufficiently stamped instruments and secondary evidence thereof; proviso (a) to s.35 applies only to original instrument produced in court; s.36 applies only to original admitted without objection, not secondary evidence.",
      "addresses_issue": "i1",
      "key_observation": "Allowing secondary evidence would tantamount to acting upon unstamped instrument, barred by s.35."
    },
    {
      "id": "cr2",
      "text": "Cited precedents consistently hold secondary evidence (oral or copy) inadmissible for insufficiently stamped documents, regardless of non-production reason (suppression, loss, destruction).",
      "addresses_issue": "i1",
      "key_observation": "Privy Council in Raja of Bobbili and other High Court decisions followed."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Reception of secondary evidence (oral accounts or copies) of contents of unstamped or insufficiently stamped document is barred by s.35 Stamp Act; s.36 does not extend to secondary evidence.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Raja of Bobbili v. Inuganti China Sitaramaswami Garu",
      "citation": "23 Madras 49",
      "treatment": "followed",
      "relevance": "Secondary evidence (copy) of insufficiently stamped original inadmissible even on payment of penalty; Stamp Act deals only with originals."
    },
    {
      "case_name": "State of Bihar v. Karam Chand Thapar Bros Ltd.",
      "citation": "1962 1 S.C.R. 827",
      "treatment": "followed",
      "relevance": "Law on copies vs originals under Stamp Act well-settled; copy cannot be validated."
    },
    {
      "case_name": "Thaji Beebi v. Tirumalappa Pillai",
      "citation": "30 Madras 336",
      "treatment": "followed",
      "relevance": "Oral evidence of unstamped document cannot be acted upon to connect possession to its terms."
    },
    {
      "case_name": "Chidambaram v. Meyyappan",
      "citation": "A.I.R. 1946 Madras 298",
      "treatment": "followed",
      "relevance": "Destruction of original does not allow copy on penalty payment."
    },
    {
      "case_name": "Maung Po Htoo v. Ma Ma Gyi",
      "citation": "I.L.R. 4 Rangoon 363",
      "treatment": "distinguished",
      "relevance": "Erroneously extended s.36 to secondary evidence; incorrect interpretation."
    },
    {
      "case_name": "Satyavati v. Pallayya",
      "citation": "A.I.R. 1937 Madras 431",
      "treatment": "doubted",
      "relevance": "Dictum that s.35 applies to wrongly admitted secondary evidence not good law."
    },
    {
      "case_name": "Ponnuswami v. Kailasam",
      "citation": "A.I.R. 1947 Madras 422",
      "treatment": "distinguished",
      "relevance": "Does not support secondary evidence treated as original."
    },
    {
      "case_name": "Alimana Sahiba v. Subbarayudu",
      "citation": "A.I.R. 1932 Madras 693",
      "treatment": "distinguished",
      "relevance": "Admission of execution does not require proof if admitted; not authority for secondary evidence."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Stamp Act",
      "sections": [
        "35",
        "36",
        "33"
      ],
      "relevance": "Bars admission and acting upon unstamped/insufficiently stamped instruments and secondary evidence thereof; proviso (a) s.35 only for originals produced."
    },
    {
      "name": "Indian Evidence Act",
      "sections": [
        "59",
        "61",
        "62",
        "63",
        "64",
        "65",
        "91"
      ],
      "relevance": "Regulates primary/secondary evidence but subject to Stamp Act bar on admissibility."
    },
    {
      "name": "Specific Relief Act",
      "sections": [
        "27A"
      ],
      "relevance": "Conditions for specific performance of agreement to lease fulfilled per lower court, but irrelevant due to evidence inadmissibility."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal challenging High Court's ruling on inadmissibility of secondary evidence dismissed; High Court upheld Munsif's decrees effectively restored.",
    "relief_granted": null,
    "costs": "Dismissed with costs."
  },
  "key_quotes": [
    {
      "text": "No instrument chargeable with duty shall be admitted in evidence for any purpose... unless such instrument is duly stamped.",
      "speaker": "court",
      "significance": "Core bar under s.35 Stamp Act extended to secondary evidence."
    },
    {
      "text": "The second limb of it which relates to acting upon the instrument will obviously shut out any secondary evidence of such instrument.",
      "speaker": "court",
      "significance": "Explains why secondary evidence is barred."
    },
    {
      "text": "These clauses throughout deal with, and exclusively refer to, the admission as evidence of original documents which... were not stamped at all, or were insufficiently stamped.",
      "speaker": "court",
      "significance": "Quoting Privy Council to affirm originals only."
    }
  ],
  "_case_id": "1971_15",
  "_label": 0,
  "_text_length": 34060,
  "_extracted_at": "2026-02-10T20:14:19.237034"
}