{
  "metadata": {
    "case_name": "Civil Appeals Nos. 1674 and 1675 of 1969",
    "case_year": 1969,
    "court": "Supreme Court of India",
    "judges": [
      "Jaganmohan Reddy"
    ],
    "case_number": "Civil Appeals Nos. 1674 and 1675 of 1969",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant was Office Superintendent of the Board constituted under the West Bengal Secondary Education Act 37 of 1950.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Appellant promoted as Assistant Secretary on 12-7-1952.",
      "type": "procedural",
      "date": "1952-07-12",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Appellant promoted as Deputy Secretary on 18-6-1956.",
      "type": "procedural",
      "date": "1956-06-18",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Appellant appointed as Secretary on probation on 1st/8th August 1962 by the Administrator under West Bengal Secondary Education Temporary Provisions Act 24 of 1954.",
      "type": "procedural",
      "date": "1962-08-01",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Appellant confirmed as Secretary on 1-8-1963 by order dated 24th August 1963.",
      "type": "procedural",
      "date": "1963-08-01",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "West Bengal Board of Secondary Education Act 5 of 1963 passed on 20th February 1963, came into force on 1-1-1964.",
      "type": "background",
      "date": "1963-02-20",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Before 1-1-1964, regulations made on 12-12-1963 under 1950 Act, Rule 4 similar to 1951 regulations allowing Board to dispense with services of Secretary with 3 months notice or pay.",
      "type": "background",
      "date": "1963-12-12",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "West Bengal Board of Secondary Education Appointment of Secretary Rules 1963 made and published under 1963 Act, Rule 8 empowers State Government to dispense with services of Secretary on three months notice or pay in lieu, or discharge/dismiss without for misconduct.",
      "type": "background",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Appellant continued in office till 25th November 1966 when services dispensed with immediate effect on payment of 3 months salary in lieu of notice.",
      "type": "material",
      "date": "1966-11-25",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Government appointed respondent 6 - D. Mazumdar temporarily as Secretary for period not exceeding 6 months from date he takes charge.",
      "type": "procedural",
      "date": "1966-11-25",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "1963 Act by Sec. 46(1) repealed 1950 Act and 1954 Temporary Provisions Act; Sec. 46(2) provided all officers and persons in employment of previous Board continue in service of Board until provision is made.",
      "type": "background",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Appeals by certificate under Art. 132 Constitution against Calcutta High Court judgment dated July 23, 1968 in Appeal from Original Order Nos. 185 and 186 of 1967; consolidated by Supreme Court order dated 25-8-1969.",
      "type": "procedural",
      "date": "1968-07-23",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether under the provisions of the West Bengal Board of Secondary Education Act 5 of 1963 read with Rule 8 of the West Bengal Board of Secondary Education Appointment of Secretary Rules, the appellant could be discharged from the service of the Board by the State Government.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The rule under which the appellant's services have been dispensed with has no application to the case of a person who continues in service under Sec. 46(2)(c) of the 1963 Act.",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": "West Bengal Board of Secondary Education Act 5 of 1963, Sec. 46(2)(c)"
    },
    {
      "id": "pa2",
      "text": "Being an employee of the Board, his services could only be terminated by the Board and not by the State Government.",
      "supporting_facts": [
        "f1",
        "f4",
        "f5",
        "f11"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Sec. 46(2)(c) envisages that till some other employment is found for all those persons who were in employment of the Board before commencement of 1963 Act, they cannot be discharged.",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": "West Bengal Board of Secondary Education Act 5 of 1963, Sec. 46(2)(c)"
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "1963 Act constituted an entirely new Board; Sec. 16 provides Secretary appointed by State Govt., not Board; terms for Secretary prescribed by rules under Sec. 45(2)(f).",
      "addresses_issue": "i1",
      "key_observation": "Board has no power to appoint Secretary; appellant had no right to post as such."
    },
    {
      "id": "cr2",
      "text": "Sec. 46(2)(c) merely continues employees of previous Board till other arrangements made, i.e., till Secretary appointed by Govt. under Sec. 16.",
      "addresses_issue": "i1",
      "key_observation": "Appointment of new Secretary traceable to Sec. 16; old rules repealed, new Board has no power to appoint Secretary."
    },
    {
      "id": "cr3",
      "text": "State of Assam v. Kripanath Sharma distinguished as provisions not in pari materia; there teachers deemed employees of new Board, and termination by unauthorized person.",
      "addresses_issue": "i1",
      "key_observation": "Does not help appellant."
    },
    {
      "id": "cr4",
      "text": "Point on Bidyut Kr. Biswas not raised before High Court, not permitted before Supreme Court.",
      "addresses_issue": "i1",
      "key_observation": "No views expressed."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "State Government had power under Rule 8 to dispense with appellant's services; appeals lack merit.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "State of Assam v. Kripanath Sharma Ors.",
      "citation": "1967 1 S.C.R. 499",
      "treatment": "distinguished",
      "relevance": "Provisions not in pari materia; teachers deemed employees of new Board, termination invalid as by unauthorized person."
    },
    {
      "case_name": "Bidyut Kr. Biswas Ors. V. West Bengal Board of Secondary Education Ors.",
      "citation": "C.W.N. Vol. 73 1968-69 417",
      "treatment": "referred",
      "relevance": "Dealt with Sec. 46(2)(c); point not raised earlier, not permitted."
    }
  ],
  "statutes_cited": [
    {
      "name": "West Bengal Board of Secondary Education Act 5 of 1963",
      "sections": [
        "Sec. 2(a)",
        "Sec. 3",
        "Sec. 4",
        "Sec. 16",
        "Sec. 45(1)",
        "Sec. 45(2)(f)",
        "Sec. 46(1)",
        "Sec. 46(2)"
      ],
      "relevance": "Constituted new Board; Secretary appointed by State Govt.; rules for terms of Secretary; continued old employees till provisions made."
    },
    {
      "name": "West Bengal Secondary Education Act 37 of 1950",
      "sections": [],
      "relevance": "Original Board constituted; regulations made thereunder repealed."
    },
    {
      "name": "West Bengal Secondary Education Temporary Provisions Act 24 of 1954",
      "sections": [],
      "relevance": "Superseded 1950 Board, vested powers in Administrator who appointed appellant; repealed by 1963 Act."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 132"
      ],
      "relevance": "Certificate for appeal to Supreme Court."
    },
    {
      "name": "West Bengal Board of Secondary Education Appointment of Secretary Rules 1963",
      "sections": [
        "Rule 8"
      ],
      "relevance": "Empowers State Government to dispense with Secretary's services on 3 months notice/pay or without for misconduct."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeals against the Calcutta High Court judgment upholding the termination of the appellant's services as Secretary are dismissed, as the State Government had power under the 1963 Act and Rule 8 to dispense with his services.",
    "relief_granted": null,
    "costs": "without costs"
  },
  "key_quotes": [
    {
      "text": "The short question for determination in these appeals is whether under the provisions of the West Bengal Board of Secondary Education Act 5 of 1963 read with Rule 8 of the West Bengal Board of Secondary Education Appointment of Secretary Rules, the appellant could be discharged from the service of the Board of Education.",
      "speaker": "court",
      "significance": "Frames the core legal issue."
    },
    {
      "text": "It will thus be seen that the 1963 Act constituted an entirely new Board of Secondary Education and after repealing the old Acts it continued the services of the Officers and other persons in the employment of the Board of Education under the old Act until other provision is made.",
      "speaker": "court",
      "significance": "Explains effect of Sec. 46(2)(c)."
    },
    {
      "text": "As we read the provisions, we are clear in our minds and it admits of no doubt that the Board has no power to appoint a Secretary, nor has the appellant a right to the post as such.",
      "speaker": "court",
      "significance": "Key observation rejecting appellant's claim."
    }
  ],
  "_case_id": "1971_165",
  "_label": 0,
  "_text_length": 11024,
  "_extracted_at": "2026-02-10T20:15:03.276560"
}