{
  "metadata": {
    "case_name": "Appellants v. Respondents (Civil Appeals Nos. 2161-A and 2161-B of 1970)",
    "case_year": 1970,
    "court": "Supreme Court of India",
    "judges": [
      "Mitter, J."
    ],
    "case_number": "Civil Appeals Nos. 2161-A and 2161-B of 1970",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "In the Andhra area of the State there are four Medical Colleges run by the Government and the total number of seats available for admission in the first year Integrated M.B.,B.S. course in all the four colleges is 550.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The State Government has been issuing rules every year after the publication of the results of the S.S.C. or S.S.L.C. Board of the University for selection of candidates for admission into the Medical Colleges.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The test prescribed in July 1970 was the first of its kind.",
      "type": "background",
      "date": "1970-07",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Government notification dated July 23, 1970 prescribed Entrance Test for selection of candidates.",
      "type": "material",
      "date": "1970-07-23",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Additional Director of Medical and Health Services issued notification inviting applications on July 31, 1970.",
      "type": "procedural",
      "date": "1970-07-31",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Candidates to file applications by August 14, 1970 and appear at Entrance Test on August 30, 1970 conducted by Director of Medical and Health Services.",
      "type": "procedural",
      "date": "1970-08-14",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Exemption from Entrance Test for candidates with M.Sc. or B.Sc. Degree.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Eligibility: Candidates possessing minimum qualification of H.Sc. Multipurpose, I.S.C., P.U.C., I.H.S.C. or equivalent, having taken Physical sciences and Biological sciences, passed in one attempt, obtained not less than 50% of the marks in Physical and Biological sciences put together.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Entrance Test consisted of four papers of 50 marks each: Physical Sciences (Chemistry and Physics), Biological Sciences (Zoology and Botany), in two sessions of two hours each, partly objective and partly narrative, standard comparable to qualifying examinations.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "5,137 candidates applied, 4,669 accepted, 4,331 actually took the test.",
      "type": "procedural",
      "date": "1970-08-30",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Majority of candidates failed to secure admission due to limited seats.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Several writ petitions filed in Andhra Pradesh High Court challenging validity of Entrance Test and method of selection, including Writ Petition No. 3859 of 1970 filed on August 6, 1970, seeking withdrawal of notification and admission based on public examination marks.",
      "type": "procedural",
      "date": "1970-08-06",
      "source": "petitioner"
    },
    {
      "id": "f13",
      "text": "Learned trial judge dismissed the Writ Petitions.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "In Writ Appeals Nos. 587 and 588 of 1970, appellate Bench took different view, holding State Government could not disregard marks at University examinations or hold test in substitution for qualifying examinations.",
      "type": "procedural",
      "date": "1970-09-18",
      "source": "lower_court"
    },
    {
      "id": "f15",
      "text": "Andhra University constituted under Andhra University Act II of 1926 with powers to prescribe qualifications for admission.",
      "type": "background",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f16",
      "text": "Sri Venkateswara University has similar provisions.",
      "type": "background",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the Entrance Test prescribed under Government notification dated July 23, 1970 for selection of candidates in the four Medical Colleges run by the State in the Andhra area is justified in law.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the Government notification encroaches upon the powers of the Academic Council under the Andhra University Act or substitutes itself for the University in prescribing academic standards.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether holding the Entrance Test constitutes encroachment upon Entry 66 of List I of the Seventh Schedule to the Constitution.",
      "framed_by": "petitioner"
    },
    {
      "id": "i4",
      "text": "Whether the Government order was discriminatory, invalid for want of publication in official gazette, handicapped candidates due to insufficient preparation time, or violated Article 21.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Academic Council of the University is competent to prescribe qualifications for admission into degree courses; Government cannot substitute itself or test academic standards different from University-fixed ones.",
      "supporting_facts": [
        "f15"
      ],
      "legal_basis": "Andhra University Act II of 1926"
    },
    {
      "id": "pa2",
      "text": "Holding Entrance Test and selection disregarding University marks encroaches on Entry 66 List I Seventh Schedule.",
      "supporting_facts": [
        "f4",
        "f9"
      ],
      "legal_basis": "Entry 66, List I, Seventh Schedule to the Constitution"
    },
    {
      "id": "pa3",
      "text": "Government order discriminatory, not published in gazette, insufficient time to prepare, interferes with personal liberty under Art. 21.",
      "supporting_facts": [
        "f5",
        "f6",
        "f10"
      ],
      "legal_basis": "Article 21 of the Constitution"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "State has no power to trench upon powers given to University; test contravenes s.23 of the Act.",
      "supporting_facts": [
        "f15"
      ],
      "legal_basis": "Section 23, Andhra University Act"
    },
    {
      "id": "ra2",
      "text": "Executive cannot usurp law-making power in prescribing test.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": null
    },
    {
      "id": "ra3",
      "text": "Rule affects prejudicially rights conferred on candidates by University Regulations.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": "University Regulations"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Under Art. 162, executive power of State extends to matters legislature can make laws; Government runs colleges, has right and duty to select from applicants; no legislation covering field, so competent to prescribe test.",
      "addresses_issue": "i1",
      "key_observation": "Test supplements eligibility, acts as second hurdle for screening."
    },
    {
      "id": "cr2",
      "text": "Andhra University Act ss.23, 33 prescribe minimum eligibility (50% marks hurdle), not guaranteeing admission; Government can prescribe own test for selection out of eligible candidates.",
      "addresses_issue": "i2",
      "key_observation": "University regulations do not entitle passing qualifying exam to ipso facto admission if seats limited."
    },
    {
      "id": "cr3",
      "text": "Test does not militate against Entry 66 List I; relates to coordination of standards in higher education, not selection test from applicants.",
      "addresses_issue": "i3",
      "key_observation": "No encroachment on central field."
    },
    {
      "id": "cr4",
      "text": "No unfairness in test; questions outside syllabus affect all equally or test broader knowledge; first-time test not invalid; short notice affected all; no gazette publication required; no violation of Art.21 as procedure established by law.",
      "addresses_issue": "i4",
      "key_observation": "Refusal of admission does not affect personal liberty."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Government has right to prescribe Entrance Test as additional screening for selection to limited seats in government-run medical colleges, supplementing University-prescribed minimum eligibility.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Action does not contravene Andhra University Act or Entry 66 List I.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Test valid, no violation of Art.21 or other grounds.",
      "resolves_issue": "i4",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "R. Chitralekha v. State of Mysore",
      "citation": "1964 6 S.C.R. 368",
      "treatment": "followed",
      "relevance": "Government can prescribe selection criteria including interview beyond University minimum qualifications for admission to medical/engineering colleges."
    },
    {
      "case_name": "Rajendran v. State of Madras",
      "citation": "1968 2 S.C.R. 786",
      "treatment": "followed",
      "relevance": "Government entitled to frame rules for admission to its medical colleges subject to University eligibility."
    },
    {
      "case_name": "Chitra Ghosh v. Union of India",
      "citation": "1970 1 S.C.R. 413",
      "treatment": "referred",
      "relevance": "No unqualified right to seat based on higher marks in qualifying exam; government can decide admission sources and criteria."
    },
    {
      "case_name": "Spottswood v. Sharpe",
      "citation": null,
      "treatment": "distinguished",
      "relevance": "Distinguished as not applicable to selection for limited seats."
    }
  ],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Article 162",
        "Article 226",
        "Article 21",
        "Entry 66 List I Seventh Schedule"
      ],
      "relevance": "Art.162 empowers executive to select; Art.226 for writs; Art.21 not violated; Entry 66 not encroached."
    },
    {
      "name": "Andhra University Act, 1926",
      "sections": [
        "Section 23",
        "Section 33"
      ],
      "relevance": "Academic Council powers for courses and eligibility; sets minimum qualifications, not admission guarantee."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "The Supreme Court allowed the appeals, holding the Entrance Test prescribed by the Government valid and justified as a selection mechanism supplementing University eligibility criteria for limited seats in government medical colleges, reversing the Andhra Pradesh High Court judgment.",
    "relief_granted": "None to writ petitioners; Government notification upheld.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The Government which ran the colleges had the right to make a selection out of a large number of candidates and for this purpose they could prescribe a test of their own which was not against any law.",
      "speaker": "court",
      "significance": "Core holding on Government's selection power."
    },
    {
      "text": "Merely because the University had made regulations regarding the admission of students to its degree courses, it did not mean that any one who had passed the qualifying examination such as the P.U.C. or S.S.C. was ipso facto to be entitled to admission.",
      "speaker": "court",
      "significance": "Clarifies no automatic right to admission post-eligibility."
    },
    {
      "text": "We fail to see how refusal of an application to enter a medical college can be said to affect ones personal liberty guaranteed under that article.",
      "speaker": "court",
      "significance": "Rejects Art.21 challenge."
    }
  ],
  "_case_id": "1971_90",
  "_label": 1,
  "_text_length": 26028,
  "_extracted_at": "2026-02-10T20:14:34.442931"
}