{
  "metadata": {
    "case_name": "Appellant (Surety) v. State",
    "case_year": 1968,
    "court": "Supreme Court of India",
    "judges": [
      "Ray, J."
    ],
    "case_number": "Civil Appeal No. 239 of 1968",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Truck No. RJZ-1724 seized by police at Fatehpur Sikri Police Station on allegation of carrying essential commodities to prohibited area in case State v. Sua Lal under Essential Commodities Act.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Kishan Lal Gupta applied for custody of truck before Sub-Divisional Magistrate, Kiraoli Kheragarh.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On 16 December 1963, Sub-Divisional Magistrate Kiraoli Kheragarh ordered delivery of truck on furnishing two sureties of Rs. 10,000 each with personal bond of like amount.",
      "type": "procedural",
      "date": "1963-12-16",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Prosecution filed revision against order; Additional District Magistrate Kheragarh rejected it on 1 January 1964, observing it was for Magistrate to decide temporary custody.",
      "type": "procedural",
      "date": "1964-01-01",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "On 9 January 1964, Sub-Divisional Magistrate Kiraoli-Kheragarh ordered truck given to custody of reliable independent person on two independent sureties of Rs. 20,000 each and personal bond of like amount.",
      "type": "procedural",
      "date": "1964-01-09",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "On 13 January 1964, appellant in court of Sub-Divisional Magistrate Kiraoli Kheragarh declared himself surety for truck, executed bond: 'I do hereby bind myself to produce the said truck whenever ordered by the court to produce the same and in case of my making default therein I bind myself to forfeit to the Government the sum of Rs. 20,000.'",
      "type": "procedural",
      "date": "1964-01-13",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "On 13 January 1964, appellant gave personal bond declaring ownership of property worth Rs. 1,05,000 and would not dispose of it till bond discharged by Sessions Court.",
      "type": "procedural",
      "date": "1964-01-13",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "On 1 May 1965, Sub-Divisional Magistrate Kheragarh gave notice to appellant and Kishan Lal Gupta to produce truck on 10 May 1965 and show cause why surety bond of Rs. 20,000 should not be forfeited.",
      "type": "procedural",
      "date": "1965-05-01",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "On 5 June 1965, Sub-Divisional Magistrate Kheragarh passed order: sureties did not produce truck despite notice, no response; forfeited bond under order dated 10 May 1965, notice to show cause why amount not realised; appellant served but no response; ordered Rs. 20,000 realised as fine.",
      "type": "procedural",
      "date": "1965-06-05",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Appellant filed revision against Magistrate's order before Civil and Sessions Judge, Agra, rejected on 28 January 1966.",
      "type": "procedural",
      "date": "1966-01-28",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Appellant filed revision to Allahabad High Court against Sessions Judge's order; High Court on 17 May 1968 held no explanation for non-production of truck, clear case for recovery of full amount, no justification for reduction; refused to entertain point on jurisdiction as not raised earlier.",
      "type": "procedural",
      "date": "1968-05-17",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Notice dated 1 May 1965 issued by court of Sub-Divisional Magistrate Kiraoli Kheragarh, Agra, signed by Sub-Divisional Magistrate Kheragarh.",
      "type": "background",
      "date": "1965-05-01",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Order dated 5 June 1965 by court of Sub-Divisional Magistrate Kiraoli-Kheragarh, Agra, signed by Sub-Divisional Magistrate Kheragarh.",
      "type": "background",
      "date": "1965-06-05",
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Sessions Judge Agra judgment dated 28 January 1966 stated case pending before Sub-Divisional Magistrate Kheragarh.",
      "type": "background",
      "date": "1966-01-28",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the surety bond executed in the court of Sub-Divisional Magistrate, Kiraoli could be forfeited by the Sub-Divisional Magistrate, Kheragarh, or only by the court in which it was given.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether the appellant was liable for forfeiture of Rs. 20,000 for failure to produce the truck.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Bond executed in court of Sub-Divisional Magistrate, Kiraoli; forfeiture order passed by Sub-Divisional Magistrate, Kheragarh; only the court in which bond given can forfeit it.",
      "supporting_facts": [
        "f6",
        "f9"
      ],
      "legal_basis": "Section 514 Criminal Procedure Code; Ballabhdas Motiram Gupta v. Emperor, AIR 1943 Bom 178"
    },
    {
      "id": "pa2",
      "text": "Prayer for reduction of the amount.",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "No explanation why truck not produced; clear case for full recovery; no justification for reduction.",
      "supporting_facts": [
        "f8",
        "f9",
        "f11"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "High Court rightly refused to entertain jurisdiction plea as not raised before Magistrate or Sessions Judge; plea interlaced with facts (possible transfer, abolition, redistribution of business); records show bonds and notices in court of Sub-Divisional Magistrate Kiraoli-Kheragarh, signed by Kheragarh; Sessions Judge noted pending before Kheragarh.",
      "addresses_issue": "i1",
      "key_observation": "Many probabilities why different Magistrate signed; declined to go into question without earlier raising."
    },
    {
      "id": "cr2",
      "text": "Even on construction of bond without facts: appellant bound to produce truck 'whenever ordered by the court'; no specific court mentioned; undertaking to Magistrate's court; Magistrate exercises jurisdiction over whole district under S.12 CrPC; default leads to forfeiture to Government.",
      "addresses_issue": "i1",
      "key_observation": "Word 'court' means the Magistrate's court which dealt with the case."
    },
    {
      "id": "cr3",
      "text": "Distinguished Bombay case: there bond specified attendance in particular court (Chief Presidency Magistrate) until directed otherwise; here no such limitation.",
      "addresses_issue": "i1",
      "key_observation": "Appellant liable to State for Rs.20,000 on default."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Surety bond can be forfeited by the Magistrate's court dealing with the case, not limited to exact court where executed; appellant liable for Rs.20,000 on failure to produce truck.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Plea of lack of jurisdiction not entertainable at High Court stage without prior raising.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Ballabhdas Motiram Gupta v. Emperor",
      "citation": "A.I.R. 1943 Bom. 178",
      "treatment": "distinguished",
      "relevance": "Bond there specified attendance in particular court until directed otherwise; no breach on transfer; unlike here where bond to produce whenever ordered by 'the court'."
    }
  ],
  "statutes_cited": [
    {
      "name": "Criminal Procedure Code",
      "sections": [
        "Section 514",
        "Section 12"
      ],
      "relevance": "S.514 on forfeiture of bonds; S.12 on Magistrate's jurisdiction over district."
    },
    {
      "name": "Essential Commodities Act",
      "sections": [],
      "relevance": "Context of seizure of truck."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal by special leave dismissed; upheld orders forfeiting surety bond of Rs. 20,000 and directing its realisation from appellant for failure to produce truck.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "'I do hereby bind myself to produce the said truck whenever ordered by the court to produce the same and in case of my making default therein I bind myself to forfeit to the Government the sum of Rs. 20,000.'",
      "speaker": "court",
      "significance": "Exact terms of surety bond showing obligation to 'the court', not specific court."
    },
    {
      "text": "The word court in the bond in the present case will mean the Magistrates court which dealt with the case.",
      "speaker": "court",
      "significance": "Court's construction upholding forfeiture by dealing court."
    }
  ],
  "_case_id": "1971_454",
  "_label": 0,
  "_text_length": 10146,
  "_extracted_at": "2026-02-10T20:16:49.957674"
}