{
  "metadata": {
    "case_name": "Rajendra Ram Doss Jee Varu v. Devendra Doss Jee",
    "case_year": 1971,
    "court": "Supreme Court of India",
    "judges": [
      "MUKHERJEAJ"
    ],
    "case_number": "Civil Appeal No. 407 N of 1971",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Succession to the office of the Mohunt of Sri Swami Hathiramjee Mutt, Tirumalai Tirupati, is regulated by custom: upon the death of a mohunt his senior disciple becomes the next mohunt, subject to the condition that the senior disciple must be a North-Indian Brahmin.",
      "type": "admitted",
      "date": null,
      "source": "both parties"
    },
    {
      "id": "f2",
      "text": "In 1947 Sri Prayagadasjee Varu was the Mohunt of the Mutt and died in 1947.",
      "type": "background",
      "date": "1947",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Upon death of Sri Prayagadasjee Varu in 1947, dispute about succession between Sri Narayanadasjee Varu and Sri Chetandossjee Varu, resolved by Akada Panchayat under terms of Ex. B-8: Sri Narayanadasjee Varu became Mohunt, after him Chetandoss, after Chetandoss a senior disciple of Narayanadasjee Varu.",
      "type": "material",
      "date": "1947",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Narayandasjee Varu died in 1958.",
      "type": "material",
      "date": "1958",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "After death of Narayandasjee Varu in 1958, dispute: Chetandoss claimed under Ex. B-8, Rajendra Ram Doss Jee Varu (appellant) claimed as senior disciple of Narayanadasjee Varu; Rajendra filed suit.",
      "type": "material",
      "date": "1958",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Dispute and suit settled by agreement Ex. B-1 between Chetandoss and Rajendra Ram Doss Jee Varu: Chetandoss to succeed Narayanadasjee Varu, after Chetandoss office to go to Rajendra Ram Doss; recital that Rajendra Ram Doss is a North Indian Hindustani Brahmin and disciple of late Mahant Narayandossjee Varu.",
      "type": "material",
      "date": "1961-07-15",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Chetandoss died on 18 March 1962.",
      "type": "material",
      "date": "1962-03-18",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "After death of Chetandoss, Rajendra Ram Doss claimed mohuntship per Ex. B-8 and Ex. B-1 and as only surviving disciple of Narayanadasjee Varu.",
      "type": "disputed",
      "date": "1962",
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "Devendra Doss Jee (respondent), senior disciple of Chetandoss (minor at time), suit filed by next friend Sri Mukundadas jee Varu for declaration of title to office of mohunt with properties and injunction against Rajendra Ram Doss interfering.",
      "type": "procedural",
      "date": "1962",
      "source": "respondent"
    },
    {
      "id": "f10",
      "text": "At trial, both parties agreed: by immemorial custom senior most disciple succeeds; only North-Indian Brahmin entitled.",
      "type": "admitted",
      "date": null,
      "source": "both parties"
    },
    {
      "id": "f11",
      "text": "Each party contended other not North-Indian Brahmin.",
      "type": "disputed",
      "date": null,
      "source": "both parties"
    },
    {
      "id": "f12",
      "text": "Subordinate Judge held Rajendra Ram Doss was North-Indian Brahmin and entitled as senior disciple of Narayanadossjee Varu; Chetandoss period treated as break in customary rule.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Devendra Doss appealed to Andhra Pradesh High Court; High Court held Narayan Doss (Rajendra) not North-Indian Brahmin, Devendra Doss was, so Devendra succeeds as senior disciple of Chetandoss; declaration and injunction in favour of plaintiff.",
      "type": "procedural",
      "date": "1970-09-21",
      "source": "court"
    },
    {
      "id": "f14",
      "text": "High Court finding: Rajendra Ram Doss not North-Indian Brahmin (South-Indian Iyengar); Devendra Doss North-Indian Brahmin.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f15",
      "text": "Appeal to Supreme Court by certificate.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether Rajendra Ram Doss is a North-Indian Brahmin entitled to succeed.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether Devendra Doss is estopped by recital in Ex. B-1 from denying Rajendra Ram Doss is North-Indian Brahmin.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether period of Chetandoss mohuntship should be ignored as interregnum to restore customary succession from Narayanadasjee Varu to his senior disciple Rajendra Ram Doss.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Customary rule of senior disciple succeeding always prevailed except interregnum of Chetandoss; ignore his period, so Rajendra Ram Doss entitled as senior disciple of Narayanadoss.",
      "supporting_facts": [
        "f1",
        "f3",
        "f4",
        "f5",
        "f6",
        "f7"
      ],
      "legal_basis": "Annasami Pillai and Ors. v. Ramakrishna Mudaliar and Anr., I.L.R. 28 Mad. 219"
    },
    {
      "id": "pa2",
      "text": "Devendra Doss bound by Ex. B-1 (15 July 1961) recognizing Rajendra Ram Doss as North-Indian Brahmin and stipulating he succeeds after Chetandoss; estoppel since claiming through Chetandoss.",
      "supporting_facts": [
        "f6",
        "f14"
      ],
      "legal_basis": "Principle of estoppel from recitals in agreements (Cross on Evidence; Young v. Raincock)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Rajendra Ram Doss not North-Indian Brahmin; Devendra Doss is senior disciple of Chetandoss and entitled by custom.",
      "supporting_facts": [
        "f1",
        "f9",
        "f14"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "High Court finding that Rajendra Ram Doss not North-Indian Brahmin (South-Indian Iyengar) and Devendra Doss is North-Indian Brahmin confirmed after review of evidence; recital in Ex. B-1 suspicious and not conclusive.",
      "addresses_issue": "i1",
      "key_observation": "Entire evidence shows Rajendra Ram Doss not North-Indian Brahmin apart from suspicious recital in Ex. B-1."
    },
    {
      "id": "cr2",
      "text": "No estoppel applies: defendant (Rajendra) did not plead or rely on estoppel, joined issue on fact of Brahmin status, adduced evidence; putting matter at large (Young v. Raincock; Greer v. Kettle).",
      "addresses_issue": "i2",
      "key_observation": "If party entitled to estoppel goes to issue on fact, jury/court may disregard estoppel."
    },
    {
      "id": "cr3",
      "text": "Cannot ignore Chetandoss period completely as interregnum: he was accepted Mohunt; reversion to custom must start from his death, not Narayanadoss; Devendra Doss senior-most disciple of Chetandoss and North-Indian Brahmin; ignoring would break line beyond repair as no other qualified disciple of Narayanadoss.",
      "addresses_issue": "i3",
      "key_observation": "Rule of custom prevails; reestablish by fresh start from Chetandoss death to Devendra Doss."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Devendra Doss entitled to succeed Chetandoss as his senior-most disciple per immemorial custom of Mutt.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Doctrine of estoppel from recital in Ex. B-1 not applicable as issue joined on fact.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Chetandoss period not to be ignored completely; custom reverts from his death to his senior disciple.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Young and Anr. v. Raincock",
      "citation": "18 L.J.C.P. 193",
      "treatment": "followed",
      "relevance": "Recital estoppel not conclusive if party joins issue on fact, putting matter at large."
    },
    {
      "case_name": "Greer v. Kettle (Re Parent Trust Finance Co., Ltd.)",
      "citation": "1937 4 All E.R. 397",
      "treatment": "followed",
      "relevance": "Confirms if estoppel on record but party goes to issue on fact, estoppel disregarded."
    },
    {
      "case_name": "Lainson v. Tremere",
      "citation": "1834 1 A & E 792",
      "treatment": "doubted",
      "relevance": "Not authoritative that recitals always estop parties from proving true facts."
    },
    {
      "case_name": "Annasami Pillai and Ors. v. Ramakrishna Mudaliar and Anr.",
      "citation": "I.L.R. 28 Mad. 219",
      "treatment": "followed",
      "relevance": "Principle to restore customary succession after irregular appointment, but limited here as cannot revert past break fully."
    }
  ],
  "statutes_cited": [],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal dismissed; High Court judgment upheld declaring Devendra Doss entitled to office of Mohunt and granting injunction against Rajendra Ram Doss interfering with Mutt affairs.",
    "relief_granted": "Declaration and injunction in favour of respondent Devendra Doss upheld.",
    "costs": "No orders as to costs."
  },
  "key_quotes": [
    {
      "text": "\"This Court is not generally inclined to set aside or ignore the findings on fact of the High Courts unless they appear to have been manifestly wrong.\"",
      "speaker": "court",
      "significance": "Defers to High Court factual findings on Brahmin status."
    },
    {
      "text": "\"The very description of the defendant in Ex. B-1 as a North-Indian Brahmin when in the context of that document it was really unnecessary to describe him as such makes the recital suspicious.\"",
      "speaker": "court",
      "significance": "Explains why Ex. B-1 recital discounted."
    },
    {
      "text": "\"The only possible way in which the old custom may be reestablished is by making a fresh start from the point of the death of Chetan Doss and that can only be done by allowing Devendra Doss to be the Mohunt.\"",
      "speaker": "court",
      "significance": "Core reasoning for upholding respondent's succession."
    }
  ],
  "_case_id": "1972_456",
  "_label": 0,
  "_text_length": 19036,
  "_extracted_at": "2026-02-10T20:10:20.457671"
}