{
  "metadata": {
    "case_name": "Commissioner of Hindu Religious Endowments, Orissa v. State of Orissa",
    "case_year": 1971,
    "court": "Supreme Court of India",
    "judges": [
      "DWIVEDI, J."
    ],
    "case_number": "Criminal Appeal No. 312 of 1971",
    "date_of_judgment": "1971-07-08"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The appellant is a member of the Superior Judicial Service of the State of Orissa, officiating as District Judge at one time, functioning as Commissioner of Hindu Religious Endowments, Orissa at relevant time.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Office of Commissioner created by Orissa Hindu Religious Endowments Act. In village Sanabagalpur there are two deities.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Additional Assistant Commissioner took action under s.27 of the Act for appointing interim trustee of the deities.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Person in charge of deities objected under s.41 that Act did not apply as deities consecrated under private endowment made by him.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f5",
      "text": "Additional Assistant Commissioner rejected objection by order dated July 26, 1967 without inquiry under s.41, held prima facie public endowment, did not appoint objector as trustee.",
      "type": "procedural",
      "date": "1967-07-26",
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "Objector filed revision under s.9 before the appellant.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "During period between rejection and revision filing, identical issue raised in Bhramarbar Santra and others v. State of Orissa and others, I.L.R. 1970 Cuttack 54, where High Court held Asst. Commissioner cannot appoint interim trustee under s.27 until inquiry under s.41 and finding no hereditary trustee.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "At hearing of revision, Bhramarbar Santra decision cited before appellant.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Appellant made order on 19th January, 1970 dismissing revision: said no evidence of s.41 petition, plea humbug; Asst. Commissioner impliedly decided no hereditary trustee; without final declaration appointment under s.27 possible; Bantala case not applicable; against order moved Supreme Court so sub judice; to establish hereditary trustee need s.41 application, court won't initiate as appears public Siva temple.",
      "type": "procedural",
      "date": "1970-01-19",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Applicant filed writ petition in High Court against appellant's order.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Division Bench issued notice for contempt to appellant for sentence: 'Further, against the order we have moved the Supreme Court, and as such, the matter can be safely deemed to be sub judice.'",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Appellant appeared, said objectionable sentence not basis of decision, distinguished Bhramarbar Santra; under Constitution SC decisions law of land, so when matter before SC point sub judice; proceeding administrative, not contempt.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f13",
      "text": "High Court rejected pleas, held appellant refused to follow Bhramarbar Santra, no bona fides, actuated by bias, conduct mala fide, intentionally avoided following decision by inappropriate grounds; guilty of contempt, admonished in open court, pay Rs.300 costs.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "On date of appellant's order, nothing pending in Supreme Court, only petition in High Court for certificate to appeal from Bhramarbar Santra.",
      "type": "disputed",
      "date": null,
      "source": "court"
    },
    {
      "id": "f15",
      "text": "Appellant has 23 years judicial service, from Munsif to District Judge rank.",
      "type": "background",
      "date": null,
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the appellant is guilty of contempt of court for deliberately and mala fide refusing to follow the binding decision of the Orissa High Court in Bhramarbar Santra by giving wrong and illegitimate reasons.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The sentence found objectionable neither interferes with administration of justice nor scandalises High Court; no decided case in support or against; absence of precedent should not preclude but put court on guard against expanding contempt area.",
      "supporting_facts": [
        "f13"
      ],
      "legal_basis": "17 Corpus Juris Secundum 21"
    },
    {
      "id": "pa2",
      "text": "Revision dismissed after distinguishing from Bhramarbar Santra; under Constitution SC decisions law of land, so when matter before SC via certificate petition, point sub judice; proceeding administrative, not following High Court decision not contempt.",
      "supporting_facts": [
        "f9",
        "f12"
      ],
      "legal_basis": "Constitution"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Solicitor-General stated no decided case either in support or against the argument.",
      "supporting_facts": [],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Contempt is disobedience to court by acting in opposition to authority, justice, dignity; willful disregard of order or conduct bringing authority into disrepute.",
      "addresses_issue": "i1",
      "key_observation": "Absence of precedent does not preclude if comprehended by principles."
    },
    {
      "id": "cr2",
      "text": "Appellant's remark 'Further, against the order we have moved the Supreme Court, and as such the matter can be safely deemed to be sub judice' is wrong factually (only certificate petition pending), use of 'we' shows identification as litigant lacking detachment; with 23 years experience, could not believe binding character disappears on certificate petition.",
      "addresses_issue": "i1",
      "key_observation": "Deliberately avoided following by wrong/illegitimate reasons, mala fide."
    },
    {
      "id": "cr3",
      "text": "Under Art.227, High Court superintendence over courts/tribunals; decisions binding; cannot get away by wrong reasons. Cites East India Commercial: tribunals must conform to law laid down by High Court.",
      "addresses_issue": "i1",
      "key_observation": "Conduct creates confusion, undermines respect for High Court authority."
    },
    {
      "id": "cr4",
      "text": "Deliberate mala fide non-following of binding precedent is contumacious, analogous to disobeying specific order; wider impact on rule of law.",
      "addresses_issue": "i1",
      "key_observation": "Does not stifle bona fide distinguishing."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Deliberate and mala fide conduct of not following binding precedent of High Court constitutes contempt of court.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Bhramarbar Santra and others v. State of Orissa and others",
      "citation": "I.L.R. 1970 Cuttack 54",
      "treatment": "followed",
      "relevance": "Binding precedent holding no interim trustee appointment under s.27 without s.41 inquiry; appellant deliberately refused to follow."
    },
    {
      "case_name": "East India Commercial Co. Ltd. Calcutta and Another v. The Collector of Customs, Calcutta",
      "citation": "1963 3 SCR 338 at 366",
      "treatment": "followed",
      "relevance": "Tribunals under High Court superintendence must conform to law laid down by High Court; otherwise confusion in administration of law."
    }
  ],
  "statutes_cited": [
    {
      "name": "Orissa Hindu Religious Endowments Act",
      "sections": [
        "s.27",
        "s.41",
        "s.9"
      ],
      "relevance": "Governs appointment of interim trustee, objection to applicability, revision; appellant acted as quasi-judicial authority thereunder."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 227",
        "Art. 215",
        "Art. 226"
      ],
      "relevance": "High Court superintendence over courts/tribunals, court of record with contempt powers, writ jurisdiction; decisions binding on subordinates."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court upheld the Orissa High Court's finding of contempt against the appellant for deliberately and mala fide refusing to follow the binding precedent in Bhramarbar Santra by advancing factually wrong and illegitimate reasons.",
    "relief_granted": null,
    "costs": "High Court ordered Rs.300 costs upheld implicitly."
  },
  "key_quotes": [
    {
      "text": "\"The conduct of the contemner far from being bona fide is clearly a mala fide one and he intentionally avoided to follow the decision of this Court by advancing grounds which were most inappropriate.\"",
      "speaker": "lower_court",
      "significance": "High Court's finding of mala fides upheld by Supreme Court."
    },
    {
      "text": "\"Deliberate and malafide conduct of not following the binding precedent of the High Court is contumacious.\"",
      "speaker": "court",
      "significance": "Core holding expanding contempt principles to non-following of precedents."
    },
    {
      "text": "\"It would be anomalous to suggest that a tribunal over which the High Court has superintendence can ignore the law declared by that Court.\"",
      "speaker": "court",
      "significance": "From East India Commercial, justifies binding nature on quasi-judicial authorities."
    }
  ],
  "_case_id": "1972_363",
  "_label": 0,
  "_text_length": 13170,
  "_extracted_at": "2026-02-10T20:09:42.471060"
}