{
  "metadata": {
    "case_name": "Guzdar Kajora Coal Mines Ltd. v. Commissioner of Income Tax",
    "case_year": 1970,
    "court": "Supreme Court of India",
    "judges": [
      "Grover, J."
    ],
    "case_number": "C.A. Nos. 2132 and 2133 of 1970",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Guzdar Kajora Coal Mines Ltd. (assessee) incorporated on July 4, 1945.",
      "type": "background",
      "date": "1945-07-04",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Assessee purchased by deed of conveyance dated April 3, 1946 executed by liquidators of Guzdar Kajora Colliery Co. Ltd. all colliery lands, hereditaments, premises, mines, minerals, powers, privileges, machinery etc., effective from July 1, 1945.",
      "type": "material",
      "date": "1946-04-03",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Consideration Rs. 6 lacs allocated as: machinery, plants, stores etc. Rs. 3,50,000; buildings and structures Rs. 1,50,000; rest of properties Rs. 1,00,000.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Assessee took over business and claimed depreciation for 1946-47 based on its balance sheet valuation as on December 30, 1945, initially allowed by ITO till 1952-53.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "For 1952-53 and 1953-54, assessee contended before AAC and Tribunal that depreciation should be on balance sheet valuation; Tribunal remanded to ITO for inquiry.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "ITO report July 6, 1960: common directors/shareholders; valuations written up for depreciable assets, down for non-depreciable; considered experts A.N. Mitter (Sept 1, 1945) and S.N. Mullick (Oct 19, 1955, Jan 30, 1957, clarification Nov 20, 1959); examined Mullick u/s 37; allocated Rs. 6 lacs including goodwill Rs. 2,56,960, mines Rs. 2,48,323, stores Rs. 60,744, other depreciable Rs. 33,973.",
      "type": "procedural",
      "date": "1960-07-06",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Tribunal dismissed assessee's appeals, noting acquiescence in early years, arbitrary figures in deed, goodwill not clearly included.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Tribunal referred question to High Court: Whether ITO competent to go beyond conveyance and fix valuation.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Calcutta High Court (Sukumar Mitra J., judgment June 22, 1965) answered affirmatively in I.T. Reference No. 36 of 1961.",
      "type": "procedural",
      "date": "1965-06-22",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Some directors and shareholders of both companies were the same and connected in many ways.",
      "type": "background",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether on the facts and circumstances of the case the Income-tax Officer was competent to go beyond the conveyance and fix a valuation of the assets on his own?",
      "framed_by": "tribunal"
    },
    {
      "id": "i2",
      "text": "Whether goodwill was included in the valuation given in the deed of conveyance.",
      "framed_by": "assessee"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Statement of valuation in formal deed of conveyance should be prima facie accepted as correct; no justification to rip up transaction absent fraud, collusion, inflation or false transaction; experts justified valuation.",
      "supporting_facts": [
        "f2",
        "f3"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Goodwill was not included in the valuation in the deed nor intended to be sold.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Circumstances justified going behind deed: common directors/shareholders, arbitrary allocations, written up/down valuations; goodwill calculated based on profits.",
      "supporting_facts": [
        "f6",
        "f10"
      ],
      "legal_basis": "Section 37 of Indian Income-tax Act, 1922"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Original cost to assessee must be ascertained for depreciation u/s 10(2)(vi); deed is prima facie evidence but ITO can go behind if fraud, collusion, inflation/deflation for ulterior purposes.",
      "addresses_issue": "i1",
      "key_observation": "ITO competent to determine actual cost and allocation between depreciable/non-depreciable assets, including whether goodwill included."
    },
    {
      "id": "cr2",
      "text": "No error in Tribunal/High Court findings for the years in question; principles for future: assessee can show actual cost, authorities can investigate.",
      "addresses_issue": "i1",
      "key_observation": "Principles illustrative, not exhaustive."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Income tax authorities can refuse deed price and ascertain actual cost if circumstances show fictitious price, fraud, collusion, inflation/deflation.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Original cost for depreciation is cost to assessee, not previous owner; goodwill inclusion determinable by evidence.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Commissioner of Income tax, Madras v. The Buckingham and Carnatic Co., Ltd., Madras",
      "citation": "1935 I.T.R. 33 (PC)",
      "treatment": "followed",
      "relevance": "Original cost for depreciation is to assessee owning and being assessed, not previous owner."
    },
    {
      "case_name": "Jogta Coal Co. Ltd. v. Commissioner of Income tax West Bengal",
      "citation": "36 I.T.R. 521 (SC)",
      "treatment": "followed",
      "relevance": "Cost for depreciation is to assessee, not seller."
    },
    {
      "case_name": "Pindi Kashmir Transport Co. Ltd. v. Commissioner of Income-tax Lahore",
      "citation": "26 I.T.R. 595",
      "treatment": "followed",
      "relevance": "Authorities can go behind deed if fictitious price or fraud."
    },
    {
      "case_name": "Kalooram Govindram v. Commissioner of Income tax Madhya Pradesh, Nagpur and Bhandara",
      "citation": "57 I.T.R. 335",
      "treatment": "followed",
      "relevance": "Authorities can ascertain actual cost despite deed price if fraud etc."
    },
    {
      "case_name": "S. C. Cambatta Co. P. Ltd. v. Commissioner Excess Profits Tax, Bombay",
      "citation": "41 I.T.R. 500 (SC)",
      "treatment": "referred",
      "relevance": "Explanation of goodwill."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act, 1922",
      "sections": [
        "Section 10(2)(vi)",
        "Section 10(5)",
        "Section 37"
      ],
      "relevance": "Depreciation on original cost to assessee or written down value; aggregate not exceed original cost; power to examine witnesses."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeals against Calcutta High Court judgment upholding Tribunal's decision allowing ITO to go behind deed and fix asset valuations for depreciation dismissed; no interference justified for years in question; broad principles laid for pending assessments.",
    "relief_granted": null,
    "costs": "No order as to costs in this Court."
  },
  "key_quotes": [
    {
      "text": "\"the original cost to the assessee of the asset with regard to which depreciation allowance is claimed has to be ascertained\"",
      "speaker": "court",
      "significance": "Core principle for depreciation computation."
    },
    {
      "text": "\"if circumstances exist showing that a fictitious price has been put on the asset or there is fraud or collusion... it is open to the Income tax authorities to refuse to accept the price mentioned in the deed\"",
      "speaker": "court",
      "significance": "Justifies ITO's competence to investigate valuation."
    },
    {
      "text": "\"It seems to us, the simple truth of the matter is that the figure of Rs. 3,50,000/-, Rs. 1,50,000/- and Rs. 1,00,000/- were arbitrarily put. and there was no clear cut or understandable break up of valuation\"",
      "speaker": "tribunal",
      "significance": "Tribunal's finding on deed allocations."
    }
  ],
  "_case_id": "1972_273",
  "_label": 0,
  "_text_length": 16082,
  "_extracted_at": "2026-02-10T20:08:59.406107"
}