{
  "metadata": {
    "case_name": "N. E. Horo v. Jahan Ara Jaipal Singh",
    "case_year": 1971,
    "court": "Supreme Court of India",
    "judges": [
      "Grover, J."
    ],
    "case_number": "Civil Appeal No. 909 of 1971",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Election Commission issued notification on May 1, 1970 for by-election in 51 Khunti Parliamentary Scheduled Tribe Constituency due to death of late Shri Jaipal Singh.",
      "type": "background",
      "date": "1970-05-01",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Last date for filing nomination papers was May 8, 1970; scrutiny on May 9, 1970.",
      "type": "procedural",
      "date": "1970-05-08",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Respondent Smt. Jahan Ara Jaipal Singh filed two nomination papers claiming to be widow of late Shri Jaipal Singh and member of Munda Scheduled Tribe; filed certificates.",
      "type": "material",
      "date": "1970-05-08",
      "source": "respondent"
    },
    {
      "id": "f4",
      "text": "Theodore Bodra filed objection petition to respondent's nomination papers.",
      "type": "material",
      "date": "1970-05-09",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Returning Officer rejected respondent's nomination papers after hearing arguments; accepted others including appellant Shri N. E. Horo.",
      "type": "material",
      "date": "1970-05-09",
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "Polling took place; appellant Shri Horo declared elected on June 3, 1970.",
      "type": "procedural",
      "date": "1970-06-03",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Respondent filed election petition on July 8, 1970 challenging rejection of her nomination.",
      "type": "procedural",
      "date": "1970-07-08",
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "Respondent averred she was Tamil by birth, married late Shri Jaipal Singh in 1954 according to Munda customs and rituals in presence of Parha Raja, Parha Munda, Parha Pahan, relatives and tribe members at Morabadi, Ranchi.",
      "type": "disputed",
      "date": "1954",
      "source": "respondent"
    },
    {
      "id": "f9",
      "text": "Ceremonies performed: washing of wife's feet by husband's elder sister, feast of male goat meat and Handia, new name Lankashri given by mother-in-law.",
      "type": "disputed",
      "date": "1954",
      "source": "respondent"
    },
    {
      "id": "f10",
      "text": "Appellant denied marriage according to Munda custom, denied acceptance as Munda member, asserted status acquired only by birth.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f11",
      "text": "Lok Sabha dissolved on December 27, 1970; appellant sought dismissal of petition as infructuous, High Court rejected on January 14, 1971.",
      "type": "procedural",
      "date": "1970-12-27",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Patna High Court framed issues including maintainability, whether legally married wife per Munda custom, whether acquired Munda status by marriage and accepted by tribe.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "High Court held factum of marriage not disputed; accepted evidence of marriage per Munda custom and acceptance by tribe; set aside election on May 21, 1971.",
      "type": "material",
      "date": "1971-05-21",
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "Respondent was Christian by religion, divorcee with decree absolute on May 6, 1954; married Jaipal Singh on May 7, 1954.",
      "type": "disputed",
      "date": "1954-05-06",
      "source": "petitioner"
    },
    {
      "id": "f15",
      "text": "Election petition initially impleaded only Horo; later added contesting candidates including Bodra, then deleted Bodra at petitioner's instance.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the election petition was maintainable, particularly regarding joinder of parties under s.82(b) RPA due to allegations against Bodra.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the petitioner (respondent here) was the legally married wife of late Shri Jaipal Singh according to the custom of Munda Tribe prevalent in Chhota Nagpur.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether the petitioner could legally acquire the status of a Munda by virtue of her marriage to late Shri Jaipal Singh and whether she had been accepted as a member of the Munda Tribe by the said Tribe.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Election petition defective and not maintainable as Bodra was necessary party under s.82(b) RPA due to allegations of corrupt practice in para 21; his deletion made petition liable to dismissal under s.86(1).",
      "supporting_facts": [
        "f15"
      ],
      "legal_basis": "Representation of the People Act, 1951 ss.82(b), 86(1), 123(7)"
    },
    {
      "id": "pa2",
      "text": "Respondent's marriage nullity under s.57 Indian Divorce Act 1869 as remarried within 6 months of decree absolute.",
      "supporting_facts": [
        "f14"
      ],
      "legal_basis": "Indian Divorce Act, 1869 s.57"
    },
    {
      "id": "pa3",
      "text": "Munda status acquired only by birth, not by marriage; Mundas endogamous ethnic group; no custom for non-Munda to acquire membership by marriage.",
      "supporting_facts": [
        "f10"
      ],
      "legal_basis": "Books by S.C. Roy, D.N. Mazumdar; V.V. Giri v. D. Suri Dora"
    },
    {
      "id": "pa4",
      "text": "No proof of custom allowing non-Munda wife to be accepted as full member via rituals or panchayat.",
      "supporting_facts": [
        "f10"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Belonged to Munda Scheduled Tribe as widow of Jaipal Singh; married per Munda customs in 1954 with acceptance by tribe, Parha Raja etc.; custom allows non-Munda wife to acquire membership if marriage accepted.",
      "supporting_facts": [
        "f3",
        "f8",
        "f9"
      ],
      "legal_basis": "Munda Customary Law; para 3 of election petition"
    },
    {
      "id": "ra2",
      "text": "Returning Officer illegally rejected nomination influenced by irrelevant aspersions and Bodra.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": "Representation of the People Act, 1951"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "No corrupt practice alleged against Bodra under s.123(7) or (2); para 21 does not allege obtaining assistance for election prospects or interference with electoral right; Bodra not necessary party.",
      "addresses_issue": "i1",
      "key_observation": "Allegations do not constitute corrupt practice; petition maintainable."
    },
    {
      "id": "cr2",
      "text": "Divorce Act point not pleaded, no issue framed, no evidence; cannot be raised first time in Supreme Court; marriage per Munda rites, not Christian.",
      "addresses_issue": "i2",
      "key_observation": "Point not available."
    },
    {
      "id": "cr3",
      "text": "High Court correctly found marriage per Munda custom based on evidence; factum not disputed.",
      "addresses_issue": "i2",
      "key_observation": "Evidence of ceremonies and acceptance credible."
    },
    {
      "id": "cr4",
      "text": "Munda endogamy not rigid; exceptions via panchayat approval, special ceremonies (Niyar); evidence from anthropologists, witnesses proves custom allowing acceptance of non-Munda wife if sanctioned by Parha.",
      "addresses_issue": "i3",
      "key_observation": "Custom dynamic, changing due to social factors; marriage approved, no excommunication."
    },
    {
      "id": "cr5",
      "text": "Even if not 'tribe' by birth, belongs to 'tribal community' per Art.342; wider connotation; analogy to domicile.",
      "addresses_issue": "i3",
      "key_observation": "Scheduled Tribe includes tribal communities; respondent member thereof."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Election petition maintainable; no corrupt practice against Bodra.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Respondent married per Munda custom; acquired membership of Munda tribal community via approved marriage.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Non-Munda can become member of Munda tribal community by marriage sanctioned by Parha panchayat; endogamy not absolute.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "V. V. Giri v. D. Suri Dora",
      "citation": "21 E.L.T.R. 188",
      "treatment": "distinguished",
      "relevance": "Status in Hindu castes/tribes by birth; not applicable to tribal customs allowing marriage-based membership."
    },
    {
      "case_name": "Wilson Reads v. C. S. Booth",
      "citation": "A.I.R. 1958 Assam 128",
      "treatment": "followed",
      "relevance": "Membership of tribe question of fact based on community conduct and acceptance."
    }
  ],
  "statutes_cited": [
    {
      "name": "Representation of the People Act, 1951",
      "sections": [
        "s.116A",
        "s.82(b)",
        "s.86(1)",
        "s.123(2)",
        "s.123(7)",
        "s.33(2)"
      ],
      "relevance": "Appeal provision; joinder of parties; dismissal for non-compliance; definition of corrupt practices; declaration of tribe membership."
    },
    {
      "name": "Indian Divorce Act, 1869",
      "sections": [
        "s.57"
      ],
      "relevance": "Bar on remarriage within 6 months of decree absolute; point not pleaded."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art.330",
        "Art.342(1)"
      ],
      "relevance": "Reservation for Scheduled Tribes; specification of tribes/tribal communities."
    },
    {
      "name": "Scheduled Tribes Order, 1950",
      "sections": [
        "Parts 1 to 12"
      ],
      "relevance": "Munda specified as Scheduled Tribe in Bihar."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal dismissed; High Court judgment upheld setting aside appellant's election due to illegal rejection of respondent's nomination papers; she held member of Munda tribal community.",
    "relief_granted": "Election of Shri N. E. Horo set aside",
    "costs": "Parties to bear their own costs in this Court"
  },
  "key_quotes": [
    {
      "text": "\"A non-Munda merely by virtue of the marriage with a Munda could not ipso facto become a Munda.\"",
      "speaker": "petitioner",
      "significance": "Appellant's contention on tribe membership by birth only."
    },
    {
      "text": "\"The concept of a tribe is bound to undergo changes, when numerous social, economic, educational and other like factors in a progressive country start having their impact.\"",
      "speaker": "court",
      "significance": "Court's recognition of evolving tribal customs."
    },
    {
      "text": "\"It can well be said that the term tribal community has a wider connotation than the expression tribe.\"",
      "speaker": "court",
      "significance": "Basis for holding respondent part of Munda tribal community."
    }
  ],
  "_case_id": "1972_68",
  "_label": 0,
  "_text_length": 43347,
  "_extracted_at": "2026-02-10T20:07:29.083037"
}