{
  "metadata": {
    "case_name": "Appellant v. Respondent",
    "case_year": 1971,
    "court": "Supreme Court of India",
    "judges": [
      "Grover, J."
    ],
    "case_number": "Civil Appeal No. 8N of 1971",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant and respondent are close relations, their mothers being real sisters.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Prior to January 30, 1960, appellant and respondent had sexual relations, resulting in appellant becoming pregnant.",
      "type": "material",
      "date": "1960-01-30",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Respondent, originally Hindu, converted to Christianity and professed Roman Catholic faith.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Appellant, originally Hindu, converted to Christianity and was baptised on January 29, 1960.",
      "type": "background",
      "date": "1960-01-29",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "On January 30, 1960, Father Antoine solemnised the marriage of the parties at the Church of St. Ignatius, Calcutta.",
      "type": "material",
      "date": "1960-01-30",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "First child, a daughter, born to appellant on May 10, 1960.",
      "type": "material",
      "date": "1960-05-10",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Second child, a daughter, born to appellant in October 1961.",
      "type": "material",
      "date": "1961-10",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Appellant left the home of the respondent in 1965.",
      "type": "material",
      "date": "1965",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Matrimonial suit No. 17 of 1966 filed by appellant against respondent in July 1966 on original side of Calcutta High Court for decree declaring marriage null and void, custody of children, alimony, permanent maintenance and other reliefs.",
      "type": "procedural",
      "date": "1966-07",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Suit dismissed by Mr. Justice Ghose (Original Decree No. 115 of 1968).",
      "type": "procedural",
      "date": "1968",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Appeal under Letters Patent dismissed by Division Bench on July 18, 1969.",
      "type": "procedural",
      "date": "1969-07-18",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Appellant alleged duress, intimidation, undue influence for sexual relations, conversion, marriage; appellant minor at marriage, no consent of father/guardian; parties within prohibited degree of consanguinity.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f13",
      "text": "Respondent denied allegations, stated intimate relationship developed naturally, marriage solemnised properly.",
      "type": "admitted",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f14",
      "text": "Trial judge held parties fell in love leading to marriage, no fraud/coercion/undue influence; marriage solemnised by proper priest after dispensation from Roman Catholic Church authorities removing impediment of consanguinity.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f15",
      "text": "Division Bench endorsed trial judge; held s.19 Indian Christian Marriage Act not applicable; under Canon Law, no invalidity for lack of parental consent; dispensation removed consanguinity impediment.",
      "type": "procedural",
      "date": "1969-07-18",
      "source": "lower_court"
    },
    {
      "id": "f16",
      "text": "Appellant was a minor (under 21) at time of marriage, consent of father/guardian not taken.",
      "type": "disputed",
      "date": "1960-01-30",
      "source": "petitioner"
    },
    {
      "id": "f17",
      "text": "Consanguinity between parties is second degree (children of real sisters).",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f18",
      "text": "Dispensation obtained from Roman Catholic Church authorities for consanguinity impediment.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the marriage was invalid and void because the appellant was a minor at the time (under 21 years) and consent of her father or guardian had not been taken.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the parties were within the prohibited degree of consanguinity and therefore under s.19 of the Indian Divorce Act, a decree declaring the marriage null and void ought to have been granted.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Marriage invalid as appellant minor under s.19 Indian Christian Marriage Act, no consent of father taken; s.19 general application to any Christian marriage by priest/Minister.",
      "supporting_facts": [
        "f16"
      ],
      "legal_basis": "Indian Christian Marriage Act, 1872 s.19; s.77"
    },
    {
      "id": "pa2",
      "text": "Parties within prohibited degree of consanguinity (second degree, children of sisters); s.19 Indian Divorce Act ground 2 absolute, no exception for dispensation.",
      "supporting_facts": [
        "f1",
        "f17"
      ],
      "legal_basis": "Indian Divorce Act, 1869 s.19 ground 2"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Intimate relationship developed naturally (fell in love); no fraud, coercion or undue influence; marriage properly solemnised with dispensation for consanguinity.",
      "supporting_facts": [
        "f13",
        "f14",
        "f18"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Marriage solemnized by Father Antoine, category 1 under s.5 Indian Christian Marriage Act (episcopal ordination, Roman Catholic rites); s.19 (Part III) applies only to licensed Ministers (category 3), not to categories 1/2; each Part self-contained; no uniform parental consent requirement above 18 years.",
      "addresses_issue": "i1",
      "key_observation": "Provisions of s.19 not applicable; under Canon Law (minor above 14 for girl), no invalidity for lack of parental consent."
    },
    {
      "id": "cr2",
      "text": "Even if s.19 applied, no provision renders marriage null/void for lack of consent; only penalties; s.77 saves marriage from voidness for irregularities including consent.",
      "addresses_issue": "i1",
      "key_observation": "Lack of consent does not invalidate marriage."
    },
    {
      "id": "cr3",
      "text": "Prohibited degrees not defined in Acts; for Roman Catholics, refer to Canon Law (personal law); second degree consanguinity dispensable (Canon 1052); dispensation by competent authority removes impediment.",
      "addresses_issue": "i2",
      "key_observation": "Post-dispensation, parties not within prohibited degrees under Canon Law."
    },
    {
      "id": "cr4",
      "text": "s.19 Divorce Act ground 2 looks to personal law (Canon Law) at time of solemnization; dispensation renders marriage valid; presumption of validity strong where competent clergyman solemnizes.",
      "addresses_issue": "i2",
      "key_observation": "No decree for nullity under s.19(2)."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Provisions of s.19 Indian Christian Marriage Act not applicable to marriage solemnized under s.5(1); under Canon Law, valid despite minority and no parental consent.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Dispensation under Canon Law removes second degree consanguinity impediment; parties not within prohibited degrees for s.19(2) Indian Divorce Act.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Rev. Father Caussavel v. Rev. Saurez",
      "citation": "T.L.R. 19 Mad. 273",
      "treatment": "followed",
      "relevance": "Part III (s.19) applies only to Ministers licensed under Act."
    },
    {
      "case_name": "V. H. Lopez v. R. J. Lopez",
      "citation": "I.L.R. 12 Cal. 706",
      "treatment": "followed",
      "relevance": "Prohibited degrees per customary law of Church (Roman Catholic); presumption of dispensation and validity where competent clergyman solemnizes."
    },
    {
      "case_name": "H. A. Lucas v. Theodoras Lucas",
      "citation": "I.L.R. 32 Cal. 187",
      "treatment": "followed",
      "relevance": "Husband's capacity under his Church law validates marriage despite impediment under wife's law."
    },
    {
      "case_name": "Peter Philip Saldanha v. Anne Grace Saldanha",
      "citation": "I.L.R. 54 Bom. 288",
      "treatment": "referred",
      "relevance": "s.88 Indian Christian Marriage Act: personal law refers to capacity/impediments, not solemnization form."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Divorce Act, 1869",
      "sections": [
        "Section 18",
        "Section 19"
      ],
      "relevance": "Petition for nullity; grounds including prohibited degrees of consanguinity (ground 2); applied but not attracted post-dispensation."
    },
    {
      "name": "Indian Christian Marriage Act, 1872",
      "sections": [
        "Section 3",
        "Section 5",
        "Section 19",
        "Section 20",
        "Section 21",
        "Section 22",
        "Section 44",
        "Section 60",
        "Section 68",
        "Section 70",
        "Section 71",
        "Section 77",
        "Section 88"
      ],
      "relevance": "Consolidates marriage law for Christians; s.19 consent for minors not applicable; s.77 saves irregularities; scheme by categories of solemnizers."
    },
    {
      "name": "Canon Law (Roman Catholic Church)",
      "sections": [
        "Canon 88",
        "Canon 1067",
        "Canon 1934",
        "Canon 1012",
        "Canon 1020",
        "Canon 1035",
        "Canon 1040",
        "Canon 1076",
        "Canon 1052",
        "Canons 80-86"
      ],
      "relevance": "Governs personal law/capacity for Roman Catholics; defines minors, puberty ages, dispensable impediments like second degree consanguinity."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal by special leave against the Calcutta High Court judgment dismissing the suit for declaration of marriage null and void is dismissed. Marriage held valid under Indian Christian Marriage Act and Canon Law despite appellant's minority and consanguinity, due to inapplicability of s.19 and effect of dispensation.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"Section 19 could not, therefore, be applicable to the marriage of the appellant and the respondent which was solemnized by a person in category 1 of s. 5.\"",
      "speaker": "court",
      "significance": "Core holding on inapplicability of parental consent requirement."
    },
    {
      "text": "\"After dispensation it cannot be said that under the Canon Law any impediment or prohibition exists. The parties will, therefore, not be within the prohibited degree of consanguinity.\"",
      "speaker": "court",
      "significance": "Explains effect of dispensation on s.19 Divorce Act ground."
    },
    {
      "text": "\"the presumption in favour of everything necessary to give validity to such a marriage was one of very exceptional strength\"",
      "speaker": "court",
      "significance": "Strong presumption of validity for Church solemnized marriage (citing Lopez)."
    }
  ],
  "_case_id": "1972_392",
  "_label": 0,
  "_text_length": 29017,
  "_extracted_at": "2026-02-10T20:09:50.573849"
}