{
  "metadata": {
    "case_name": "Direct Recruits (Appellants) v. Promotees (Respondents)",
    "case_year": 1970,
    "court": "Supreme Court of India",
    "judges": [
      "Ray, J."
    ],
    "case_number": "Civil Appeals Nos. 565 and 1470 to 1474 of 1970",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellants are direct recruits appointed to Indian Administrative Service in 1949 and 1950 via competitive examination.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Respondents are promotees initially recruited to executive branch of Bihar State Civil Service and promoted to IAS in 1955 and 1956.",
      "type": "background",
      "date": "1955-1956",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On 3 September 1958, Government of India allotted promotees year 1948 and placed them below junior-most direct recruit of 1948 allotment.",
      "type": "material",
      "date": "1958-09-03",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Direct recruits made representations against 1958 decision.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "On 13 January 1965, State of Bihar forwarded direct recruits' representation to Government of India.",
      "type": "procedural",
      "date": "1965-01-13",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "On 4 January 1966, Government of India took tentative decision to allow direct recruits' representation on ground of wrong facts and interpretation.",
      "type": "procedural",
      "date": "1966-01-04",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "On 14 April 1967, State of Bihar represented to Government of India to reject direct recruits' representation alleging wrong facts.",
      "type": "procedural",
      "date": "1967-04-14",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "On 20 September 1967, Government of India allowed direct recruits' representation, revised promotees' seniority: relevant dates 26 Dec 1955 for some, 1 Feb 1956 for one, 17 Oct 1956 for others; allotted some to 1950 below S.D. Prasad (RR-1950) above P.S. Appu (RR-1951), some to 1952 below K.K. Srivastava (RR-1952) above R.B. Lal (SCS7SR-1952).",
      "type": "material",
      "date": "1967-09-20",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Promotees filed writ petitions in Patna High Court challenging 20 Sep 1967 memorandum principally on ground that Government of India wrong in holding State incompetent for retrospective declaration of posts equivalent to cadre posts.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Patna High Court by judgment dated 7 November 1969 quashed Government of India order dated 20 Sep 1967 and directed promotees to continue holding rank as assigned in 1958.",
      "type": "procedural",
      "date": "1969-11-07",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Ad hoc list prepared in 1954 approved by UPSC on 28 Dec 1954; select list approved by UPSC on 26 Dec 1955.",
      "type": "background",
      "date": "1954-12-28",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Chief Secretary Bihar letter 9 Apr 1958 proposed officiation from 28 Dec 1954 for some promotees; GOI letter 3 Sep 1958 accepted and allotted 1948 year.",
      "type": "background",
      "date": "1958-04-09",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Definition of senior post changed by notification 17 Apr 1967 effective 22 Apr 1967, but appeals governed by prior definition.",
      "type": "background",
      "date": "1967-04-22",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether State Government can make retrospective declaration of a post as equivalent to a senior post under definition in IAS Regulation of Seniority Rules 1954 for purpose of rule 3(3)(b).",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether there was approval by Central Government in consultation with UPSC of promotees' period of officiation prior to inclusion in select list under second proviso to rule 3(3)(b).",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Year of allotment of promotees promoted in 1955-1956 vis-a-vis direct recruits under rule 3(3)(b) of IAS Regulation of Seniority Rules 1954.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Letter dated 9 April 1958 from Chief Secretary Bihar could not amount to declaration of posts as equivalent to senior posts.",
      "supporting_facts": [
        "f12"
      ],
      "legal_basis": "Definition of senior post in Regulation of Seniority Rules 1954"
    },
    {
      "id": "pa2",
      "text": "No retrospective declaration of posts equivalent to senior posts possible.",
      "supporting_facts": [
        "f3",
        "f8"
      ],
      "legal_basis": "Rule 3(3)(b) IAS Regulation of Seniority Rules 1954"
    },
    {
      "id": "pa3",
      "text": "No proper select list; letters dated 9 July 1958 and 3 Sep 1958 do not amount to approval by Central Government in consultation with UPSC of pre-select list officiation.",
      "supporting_facts": [
        "f11",
        "f12"
      ],
      "legal_basis": "Second proviso to rule 3(3)(b)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Government of India wrong in holding State of Bihar incompetent to make retrospective declaration of post equivalent to cadre post.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": "Definition of senior post; rule 3(3)(b)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Explains origin of IAS from 1946 Agreement, All India Services Act 1951, Cadre Rules 1954, Recruitment Rules 1954, Regulation of Seniority Rules 1954, Promotion Regulations 1955, Cadre Strength Regulations 1955.",
      "addresses_issue": "i3",
      "key_observation": "Cadre strength in Bihar: 211 posts, 175 direct, 36 promotion."
    },
    {
      "id": "cr2",
      "text": "Rule 3(3)(b) determines year of allotment for promotees as that of junior-most direct recruit who officiated continuously in senior post earlier than promotee; first proviso for ad hoc where promotee earlier; second proviso deems pre-select list officiation if approved by Central Govt in consultation with UPSC.",
      "addresses_issue": "i3",
      "key_observation": "Senior post includes any post declared equivalent by State Govt."
    },
    {
      "id": "cr3",
      "text": "Cites R. Nim v. UOI and State of Orissa v. Mohapatra on rule 3(3)(b) IPS (identical).",
      "addresses_issue": "i3",
      "key_observation": "Second proviso limits to approved pre-select list officiation."
    },
    {
      "id": "cr4",
      "text": "No specific approval by Central Govt in consultation with UPSC of pre-select list officiation in 1958 letters.",
      "addresses_issue": "i2",
      "key_observation": "Approval must be specific to period prior to select list inclusion."
    },
    {
      "id": "cr5",
      "text": "Retrospective declaration of post as equivalent to senior post is permissible and practical; necessary for workability, strikes balance between direct recruits and promotees with long service; checked by Central Govt/UPSC approval.",
      "addresses_issue": "i1",
      "key_observation": "'Deemed' in rule indicates power for retrospective effect; declaration amounts to recognizing existing fact post-promotion."
    },
    {
      "id": "cr6",
      "text": "1967 amendment to definition and rule obviates need for declaration and pre-select list benefit.",
      "addresses_issue": "i1",
      "key_observation": "Retrospective declaration sound as promotee tried and tested."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "State Government has power to make retrospective declaration that a post is equivalent to a senior post.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "No evidence of specific approval under second proviso for pre-select list officiation; 1958 allotment cannot continue without fresh determination.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h3",
      "text": "Year of allotment to be determined afresh by Central Government in consultation with UPSC.",
      "resolves_issue": "i3",
      "in_favor_of": "partial"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "R. Nim, I.P.S. v. Union of India",
      "citation": "1967 2 S.C.R. 325",
      "treatment": "followed",
      "relevance": "Interpretation of rule 3(3)(b) and second proviso for IPS (identical to IAS)"
    },
    {
      "case_name": "State of Orissa & Anr. v. B. K. Mohapatra",
      "citation": "1970 1 S.C.R. 255",
      "treatment": "followed",
      "relevance": "Interpretation of rule 3(3)(b) for IPS"
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Administrative Service (Regulation of Seniority) Rules, 1954",
      "sections": [
        "Rule 3(3)(b)",
        "Second proviso to Rule 3(3)(b)"
      ],
      "relevance": "Determines seniority of promotees vis-a-vis direct recruits based on continuous officiation in senior post"
    },
    {
      "name": "Indian Administrative Service (Cadre) Rules, 1954",
      "sections": [
        "Definition of cadre post"
      ],
      "relevance": "Defines cadre posts"
    },
    {
      "name": "Indian Administrative Service (Recruitment) Rules, 1954",
      "sections": [
        "Rule 7",
        "Rule 8(1)"
      ],
      "relevance": "Recruitment by competitive exam (direct) and promotion"
    },
    {
      "name": "Indian Administrative Service (Appointment by Promotion) Regulations, 1955",
      "sections": [],
      "relevance": "Conditions for promotion; select list"
    },
    {
      "name": "Indian Administrative Service (Fixation of Cadre Strength) Regulations, 1955",
      "sections": [
        "Item 1 (senior posts)"
      ],
      "relevance": "Specifies senior posts; definition of senior post"
    },
    {
      "name": "All India Services Act, 1951",
      "sections": [
        "Section 3"
      ],
      "relevance": "Power to make rules for recruitment and conditions of service"
    }
  ],
  "outcome": {
    "disposition": "partially_accepted",
    "summary": "Supreme Court upheld High Court quashing of Government of India order dated 20 Sep 1967 (appeals dismissed in that part) as State can make retrospective declarations, but set aside High Court direction for promotees to continue 1958 allotment (appeals allowed); year of allotment to be determined afresh by Central Government in consultation with UPSC.",
    "relief_granted": "Quashing of 20 Sep 1967 order upheld; 1958 allotment not restored; remitted for fresh determination of seniority",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "A retrospective declaration that a post is equivalent to a senior post really amounts to declaration of an existing fact.",
      "speaker": "court",
      "significance": "Justifies permissibility of retrospective declarations"
    },
    {
      "text": "The use of the word 'deemed' in rule 3(3)(b) of the Regulation of Seniority Rules indicates that the Government has the power to make a retrospective declaration.",
      "speaker": "court",
      "significance": "Interprets rule to allow retrospective effect"
    },
    {
      "text": "On the materials in the present appeals we are unable to hold that the Central Government gave any approval in consultation with the Union Public Service Commission within the meaning of rule 3(3)(b).",
      "speaker": "court",
      "significance": "Rejects 1958 approval as specific under second proviso"
    }
  ],
  "_case_id": "1972_527",
  "_label": 1,
  "_text_length": 29181,
  "_extracted_at": "2026-02-10T20:10:23.705618"
}