{
  "metadata": {
    "case_name": "State of Tamil Nadu v. Cement Producers and Selling Agents",
    "case_year": 1969,
    "court": "Supreme Court of India",
    "judges": [
      "HEGDE, J."
    ],
    "case_number": "Civil Appeals Nos. 2184-2195 of 1969, 498 to 502 of 1970, 884 to 885 of 1971",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Producers supplied cement to the State Trading Corporation or its agents in gunny bags in pursuance of directions given by the Government.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Supply of cement itself cannot be considered as sales within the meaning of the Madras General Sales Tax Act, 1959 in view of the Cement Control Order, 1958.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Central Government by order dated March 26, 1959 informed that packing charges for cement for period commencing 1st April to 30th June 1959 will be Rs. 11.54 per ton in new gunny bags.",
      "type": "material",
      "date": "1959-03-26",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Central Government by order dated June 24, 1959 stipulated packing charges for cement for period commencing 1st July to 30th September 1959 at Rs. 11.04 per ton in new gunny bags.",
      "type": "material",
      "date": "1959-06-24",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Central Government by letter dated December 26, 1959 informed State Trading Corporation that it accepted Tariff Commission's recommendations for fixation of packing charges on basis of average of maximum and minimum market price of packing material during preceding 9 months plus Rs. 1.25 per ton for incidental charges.",
      "type": "material",
      "date": "1959-12-26",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Central Government by telegram dated February 17, 1961 fixed charges for packing cement in gunny bags at Rs. 17 per ton for period from 20th February to 31st March 1961 under clause 6(4) of Cement Control Order, 1958.",
      "type": "material",
      "date": "1961-02-17",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Relevant assessment years are 1959-60, 1960-61, 1961-62, 1962-63, and 1963-64.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Selling agents of State Trading Corporation sold cement to consumers in gunny bags.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Price of packing materials was separately charged in the bills issued.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Madras High Court decided both questions in favour of the assessees by judgments dated March 25, 1969 and March 2, 1970.",
      "type": "procedural",
      "date": "1969-03-25",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the producers who supplied cement to the State Trading Corporation or its agents in gunny bags pursuant to Government directions are liable to pay sales-tax on the turnover relating to the price of the gunny bags.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the selling agents of the State Trading Corporation are liable to pay sales tax in respect of the price of the gunny bags in which they sold the cement to consumers.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Interpretation of Rule 6(f) of the rules framed under the Madras General Sales Tax Act, 1959, specifically whether it exempts the cost of packing materials when separately charged.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Central Government under clause 6(4) of Cement Control Order, 1958 could fix only the maximum price of gunny bags and not the actual price, leaving scope for bargaining.",
      "supporting_facts": [
        "f1",
        "f3",
        "f4",
        "f5",
        "f6"
      ],
      "legal_basis": "Cement Control Order, 1958 cl. 6(4)"
    },
    {
      "id": "pa2",
      "text": "Rule 6(f) as it stood till September 1963 merely provided for exemption of service charges for packing and not the cost of packing material.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": "Madras General Sales Tax Act, 1959 Rule 6(f); State of Madras v. K. Damodaran Chettiar Co."
    },
    {
      "id": "pa3",
      "text": "Exemption for packing material not available under Central Sales Tax Act due to 1969 amendments with retrospective effect.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "Central Sales Tax Act (1969 amendments)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Price of gunny bags was wholly controlled by Government orders under Cement Control Order, so supply not a sale.",
      "supporting_facts": [
        "f2",
        "f3",
        "f4",
        "f5",
        "f6"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Rule 6(f) exempts price of packing material as well as labour charges when separately charged.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": "The State of Madras In re"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Government of India fixed the actual price of gunny bags under cl. 6(4) of Cement Control Order, 1958 through various orders, so supply of gunny bags not a sale; contention that only maximum price fixed not raised earlier.",
      "addresses_issue": "i1",
      "key_observation": "Central Government purported to fix the price of gunny bags; its right not disputed in pleadings."
    },
    {
      "id": "cr2",
      "text": "Rule 6(f) till September 1963 exempts charges for packing including both price of packing material and labour; words 'and other such like services' refer to delivery.",
      "addresses_issue": "i3",
      "key_observation": "Subsequent changes clarified the intention; Damodaran Chettiar case incorrectly decided, overlooked earlier decision."
    },
    {
      "id": "cr3",
      "text": "If price of gunny bags wholly controlled, supply cannot be considered sales, as per precedents.",
      "addresses_issue": "i2",
      "key_observation": "Applies same logic to selling agents."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Supplies of gunny bags by producers to State Trading Corporation not sales taxable under Madras General Sales Tax Act.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Selling agents not liable to pay sales tax on price of gunny bags sold with cement to consumers.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Rule 6(f) exempts cost of packing materials when specified and charged separately.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "New India Sugar Mills Ltd. v. Commissioner of Sales Tax, Bihar",
      "citation": "14 S.T.C. 316",
      "treatment": "followed",
      "relevance": "If price wholly controlled, supply not a sale."
    },
    {
      "case_name": "Chittar Mal Narain Das v. Commissioner of Sales Tax, U.P.",
      "citation": "26 S.T.C. 344",
      "treatment": "followed",
      "relevance": "If price wholly controlled, supply not a sale."
    },
    {
      "case_name": "State of Madras v. K. Damodaran Chettiar Co.",
      "citation": "18 S.T.C. 451",
      "treatment": "distinguished",
      "relevance": "Supported view that Rule 6(f) excludes packing material cost, but overlooked earlier decision."
    },
    {
      "case_name": "The State of Madras In re",
      "citation": "7 S.T.C. 355",
      "treatment": "followed",
      "relevance": "Rule identical to Rule 6(f) exempts price of packing material as well."
    }
  ],
  "statutes_cited": [
    {
      "name": "Madras General Sales Tax Act, 1959",
      "sections": [
        "Rule 6(f)"
      ],
      "relevance": "Exempts freight, packing charges (including material and labour), delivery when separately charged."
    },
    {
      "name": "Cement Control Order, 1958",
      "sections": [
        "cl. 6(4)"
      ],
      "relevance": "Government fixed packing charges for gunny bags, making supply not a sale."
    },
    {
      "name": "Central Sales Tax Act",
      "sections": [],
      "relevance": "Mentioned regarding retrospective amendments in 1969, but new contention not considered."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court upheld the Madras High Court's decision in favour of the assessees, holding that neither producers nor selling agents are liable to sales tax on gunny bags as prices were controlled and Rule 6(f) exempts packing material costs when separately charged.",
    "relief_granted": "No sales tax liability on gunny bags turnover",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The material facts are not in dispute.",
      "speaker": "court",
      "significance": "Establishes basis for common questions of law."
    },
    {
      "text": "Therefore all that we have to see is whether the price of the gunny bags in which the cement was supplied to the State Trading Corporation was controlled under cl. 6(4) of the Cement Control Order, 1958.",
      "speaker": "court",
      "significance": "Narrows core issue for producers' transactions."
    },
    {
      "text": "The charges for packing include both the price of the packing material as well as the labour charges relating to packing.",
      "speaker": "court",
      "significance": "Interprets Rule 6(f) to include material costs."
    }
  ],
  "_case_id": "1972_465",
  "_label": 0,
  "_text_length": 9662,
  "_extracted_at": "2026-02-10T20:10:21.002828"
}