{
  "metadata": {
    "case_name": "State of Jammu and Kashmir v. M. S. Farooqi",
    "case_year": 1968,
    "court": "Supreme Court of India",
    "judges": [
      "Sikri, C.J."
    ],
    "case_number": "C.A. No. 1572 of 1968",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "M. S. Farooqi is a member of the Indian Police Service, borne on the Jammu and Kashmir cadre.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On March 12, 1964, an anonymous complaint was received by the Commission set up under the Jammu and Kashmir Government Servants Prevention of Corruption Commission Act, 1962.",
      "type": "material",
      "date": "1964-03-12",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On March 20, 1964, the Commission asked for a report from the Deputy Inspector General of Police.",
      "type": "procedural",
      "date": "1964-03-20",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The Deputy Inspector General of Police Anti Corruption Organisation raised the question of the jurisdiction of the Commission.",
      "type": "disputed",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "The Commission held that the Commission Act was applicable in its entirety to Government servants belonging to Jammu and Kashmir cadre of the All India Services and overruled the objection.",
      "type": "procedural",
      "date": null,
      "source": "commission"
    },
    {
      "id": "f6",
      "text": "The Investigating Agency was directed to continue investigation and submit a report.",
      "type": "procedural",
      "date": null,
      "source": "commission"
    },
    {
      "id": "f7",
      "text": "Farooqi filed Writ Petition No. 130 of 1966 in the Jammu and Kashmir High Court challenging the jurisdiction of the Commission.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "High Court by judgment dated October 31, 1966 allowed the writ petition, restraining the State from proceeding against Farooqi under the Commission Act.",
      "type": "procedural",
      "date": "1966-10-31",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "High Court held that members of All India Services are governed by All India Services Act, 1951 and rules thereunder, and Commission Act not applicable; also hit by Art. 14.",
      "type": "admitted",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "High Court granted certificate, leading to this appeal.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the Jammu and Kashmir Government Servants Prevention of Corruption Commission Act, 1962 applies to members of All India Services serving in the State.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the Commission Act is repugnant to the All India Services Act, 1951 and All India Services (Discipline and Appeal) Rules, 1955.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether the Commission Act is hit by Article 14 due to discrimination between AIS members posted in J&K and elsewhere.",
      "framed_by": "lower_court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The Commission Act is in pith and substance a law in respect of corruption of Government servants of Jammu and Kashmir and only incidentally deals with members of All India Services, valid in entirety.",
      "supporting_facts": [],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Act not discriminatory as all J&K Government servants treated alike; valid classification on territory.",
      "supporting_facts": [],
      "legal_basis": "Art. 14"
    },
    {
      "id": "pa3",
      "text": "Procedure under Commission Act not more prejudicial than under All India Services Act, 1951 and rules.",
      "supporting_facts": [],
      "legal_basis": "All India Services Act, 1951"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Commission Act repugnant to All India Services Act, 1951 and Discipline and Appeal Rules, 1955; must give way under Art. 254.",
      "supporting_facts": [
        "f1",
        "f4"
      ],
      "legal_basis": "All India Services Act, 1951; Discipline and Appeal Rules, 1955; Art. 254"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Art. 254 as applicable to J&K at relevant time provides that State law repugnant to Parliamentary law prevails; Parliament competent under List I Entry 70.",
      "addresses_issue": "i2",
      "key_observation": "No concurrent list applicable; residuary with State but Art. 254 mandates Parliamentary law prevails."
    },
    {
      "id": "cr2",
      "text": "Discipline and Appeal Rules occupy the field of disciplinary action for AIS members; complete code.",
      "addresses_issue": "i2",
      "key_observation": "Commission Act provides additional punishments, suspension, etc., repugnant."
    },
    {
      "id": "cr3",
      "text": "Provisions for investigation for prosecution may be valid but intertwined with disciplinary; whole Act inapplicable to AIS.",
      "addresses_issue": "i1",
      "key_observation": "Read down to exclude AIS members."
    },
    {
      "id": "cr4",
      "text": "Cases interpreting Art. 254 in rest of India not applicable due to different constitutional position in J&K.",
      "addresses_issue": "i2",
      "key_observation": "Clear wording of Art. 254(1) as applied."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Provisions of the Commission Act do not apply to members of the All India Services.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Commission Act repugnant to Discipline and Appeal Rules insofar as it deals with disciplinary punishments for AIS members.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "A. S. Krishna v. State of Madras",
      "citation": "1957 S.C.R. 399",
      "treatment": "referred",
      "relevance": "Interpreting repugnancy under s.107 Govt. of India Act, 1935; requires concurrent list and repugnancy."
    },
    {
      "case_name": "Deep Chand v. State of Uttar Pradesh",
      "citation": "1959 Supp. 2 S.C.R. 841",
      "treatment": "referred",
      "relevance": "Tests for repugnancy: direct conflict, exhaustive code, occupying field."
    },
    {
      "case_name": "Prem Nath Kaul v. State of Jammu and Kashmir",
      "citation": "1959 Supp. 2 S.C.R. 270",
      "treatment": "distinguished",
      "relevance": "Art. 254 inapplicable without concurrent list extension."
    },
    {
      "case_name": "Ch. Tika Ramji v. State of Uttar Pradesh",
      "citation": "1956 S.C.R. 393",
      "treatment": "referred",
      "relevance": "Repugnancy tests; leaves open scope of Art. 254(1)."
    },
    {
      "case_name": "Megh Raj v. Allah Rakhia",
      "citation": "1947 F.C.R. 77",
      "treatment": "distinguished",
      "relevance": "No repugnancy if wholly within provincial list."
    }
  ],
  "statutes_cited": [
    {
      "name": "All India Services Act, 1951",
      "sections": [],
      "relevance": "Governs members of All India Services; Discipline and Appeal Rules made thereunder occupy field of discipline."
    },
    {
      "name": "All India Services (Discipline and Appeal) Rules, 1955",
      "sections": [
        "Rule 3",
        "Rule 4",
        "Rule 5",
        "Rule 6",
        "Rule 7",
        "Rule 8",
        "Rule 9",
        "Rule 20"
      ],
      "relevance": "Complete code for penalties, procedure, inquiry, suspension, appeals for AIS members."
    },
    {
      "name": "Jammu and Kashmir Government Servants Prevention of Corruption Commission Act, 1962",
      "sections": [
        "ss. 3",
        "ss. 4",
        "s. 10",
        "s. 11",
        "s. 12",
        "s. 13",
        "s. 17"
      ],
      "relevance": "Provides for Commission inquiry into corruption; repugnant to AIS Rules for disciplinary matters."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 14",
        "Art. 246",
        "Art. 254",
        "Art. 370"
      ],
      "relevance": "Art. 254(1) as applied to J&K: Parliamentary law prevails over State law; List I Entry 70."
    },
    {
      "name": "Constitution (Application to Jammu and Kashmir) Order, 1954",
      "sections": [],
      "relevance": "Applied certain provisions including List I Entry 70."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal dismissed; provisions of Commission Act held not applicable to All India Services members; no order as to costs as respondent unrepresented.",
    "relief_granted": "High Court order upheld; State restrained from proceeding under Commission Act against Farooqi.",
    "costs": "No order as to costs."
  },
  "key_quotes": [
    {
      "text": "Parliament has occupied the field and given clear indication that this was the only manner in which any disciplinary action should be taken against the members of the All India Service.",
      "speaker": "court",
      "significance": "Core holding on repugnancy and field occupation."
    },
    {
      "text": "From the perusal of the provisions of the two statutory laws... it is impossible to escape from the conclusion that the two cannot go together.",
      "speaker": "court",
      "significance": "Direct finding of repugnancy."
    },
    {
      "text": "We accordingly hold that the provisions of the Commission Act do not apply to the members of the All India Services.",
      "speaker": "court",
      "significance": "Final determination."
    }
  ],
  "_case_id": "1972_121",
  "_label": 0,
  "_text_length": 36922,
  "_extracted_at": "2026-02-10T20:08:16.293545"
}