{
  "metadata": {
    "case_name": "Barsi Borough Municipality & Ors. v. Lokamanya Mills, Barsi Ltd. & Ors.",
    "case_year": 1967,
    "court": "Supreme Court of India",
    "judges": [
      "Mathew, J."
    ],
    "case_number": "Civil Appeals Nos. 1194, 1196, 1197, 1250 of 1967",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Till the year 1947, the appellant-Municipality used to levy house tax on the mills, factories and buildings connected therewith of the respondents in these appeals on the basis of their annual letting value and the annual letting value for this purpose was ascertained in the normal way, that is, by ascertaining the amount at which the buildings might reasonably be expected to let from year to year.",
      "type": "background",
      "date": "1947",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "In 1947, the appellant-Municipality made fresh rules for levy of house tax and rule 2(c) of the new rules ran as follows: '2(c) In the case of mills and factories and buildings connected therewith, house tax on buildings shall be levied at the usual rate on the annual rental value fixed at Rs. 40/- for every 100 square feet or portions thereof for each storey, floor or cellar.'",
      "type": "background",
      "date": "1947",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Under this rule, the annual rental value of all the buildings of mills and factories other than residential buildings was fixed at a uniform rate of Rs. 40/- for every square foot of floor area irrespective of the actual rental value of the premises.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "One of the respondents, namely, Lokamanya Mills, Barsi, Limited, claimed refund of amounts paid by them on the basis that Rule 2(c) was ultra vires the Boroughs Act and they filed 4 suits for the same. Against the decrees dismissing the suits, appeals were preferred to this Court and they were finally disposed of by this Court in Lokamanya Mills, Barsi Ltd. v. Barsi Borough Municipality.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "This Court held that the Municipality could levy a rate on lands and buildings on the basis of their capital or annual letting value and that in framing rule 2(c), the Municipality had adopted a mode of valuation different from the one sanctioned by the Boroughs Act. The Court also observed: 'The vice of the rule lies in an assumed uniformity of return per square foot which structures of different classes which are in their nature not similar, may reasonably fetch if let out to tenants and in the virtual deprivation to the rate-payer of his statutory right to object to the valuation.' Accordingly, the Court allowed the appeals and decreed the suits.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The respondents in these appeals filed writ petitions in the Bombay High Court challenging the validity of the Borough Municipalities Validation of Certain Taxes on Buildings and Lands Act, 1965 (Maharashtra Act No. 111 of 1966), hereinafter called the Validating Act, on the ground that the provisions of the Act violated their fundamental rights under Art. 14 of the Constitution and for restraining the appellants from levying house tax on the mills, factories and buildings connected therewith of the respondents or collecting the same from them.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "A Division Bench of the High Court held that sections 3(b), 4(1), 4(2) and 5 of the Validating Act were invalid as they contravened Art. 14 and granted the prayer for restraining the appellant-Municipality from levying and collecting the tax.",
      "type": "procedural",
      "date": "1966-11-22",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "These appeals, by certificate, are directed against the judgment of the Division Bench dated November 22, 23 and 24, 1966 of the Bombay High Court in Special Civil Applications Nos. 1476 and 1424 of 1966.",
      "type": "procedural",
      "date": "1966-11-22",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "The main objects of the Validating Act were to enable the municipalities governed by the Boroughs Act to levy house tax on mills factories and buildings connected therewith on the basis of rule 2(c) and to validate the levy and collection of the tax with retrospective effect.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Section 3 of the Validating Act brings about certain amendments in the Boroughs Act. In s. 3 of the Boroughs Act, a clause is inserted which lays down that rate on buildings or lands includes any tax imposed on buildings or lands. Another amendment introduced in the Boroughs Act is with reference to Explanation to s. 75. Prior to the amendment, the explanation to s. 75 was as follows: 'In the case of lands the basis of valuation may be either capital or annual letting value.' This explanation was substituted by the Validating Act by an explanation which reads: 'Explanation: For the purposes of a rate on buildings or lands, the basis of valuation may be the annual letting value. the annual value the floor area, in the case of mills, factories buildings and lands connected therewith the capital value in the case of vacant lands.' Both these amendments were given retrospective effect from the commencement of the Boroughs Act.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Sections 4 and 5 of the Validating Act are designed to validate with retrospective effect, the levy and collection of tax notwithstanding the decision of this Court.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Sub-section (1) and (2) of s. 4 provide: [text of s.4(1) and 4(2)]",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "After rule 2(c) was struck down, the Municipality did not frame any rule under the provision of S. 75 of the Boroughs Act for imposing house tax on mills factories or buildings connected therewith. The Validating Act has not also revived or resurrected rule 2(c).",
      "type": "background",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether rule 2(c) was available to the appellant-Municipality for imposing house tax on mills, factories and buildings connected therewith of the respondents",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the rule can be deemed to have been in operation in order that the levy and collection of house tax might be validated with retrospective effect",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The provisions of the Validating Act violated their fundamental rights under Art. 14 of the Constitution",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": "Article 14"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "When the rule was struck down by this Court, the effect was, that the rule could never be deemed to have been passed. Apart from rule 2(c), there was no charging provision similar to rule 2(c) either in the Boroughs Act, or in the Validating Act for levying house tax on mills, factories and buildings connected therewith.",
      "addresses_issue": "i1",
      "key_observation": "There was no charging provision for imposition of house tax on the mills, factories or buildings connected therewith."
    },
    {
      "id": "cr2",
      "text": "All that the explanation to s. 75 substituted by the Validating Act did was to enact that, for imposing house tax, floor area will be the basis of valuation in the case of mills, factories or buildings connected therewith. The consequence is that there could be no levy of house tax on the mills, factories or buildings connected therewith of the respondents nor could any demand be made on the respondents on the basis of any levy.",
      "addresses_issue": "i1",
      "key_observation": "No charging provision existed post-striking down of rule 2(c)."
    },
    {
      "id": "cr3",
      "text": "Section 4 did not resurrect rule 2(c) with retrospective effect in order that it might be said that there was, in the eye of law, a provision for charging house tax on mills, factories or buildings connected therewith so that the tax levied and collected might be validated.",
      "addresses_issue": "i2",
      "key_observation": "Validating Act did not revive rule 2(c)."
    },
    {
      "id": "cr4",
      "text": "Even if s. 4 had resurrected rule 2(c) and said that it shall be deemed to have been passed under the Validating Act with retrospective effect, that might not have cured invalidity on account of its being violative of Art. 14 of the Constitution as it imposed a flat rate on the floor area without making any classification of the area on the basis of income, productivity or age of building, etc. But it is not necessary to pass upon this hypothetical question as s. 4 did not revive or resurrect rule 2(c), much less, give it retrospective operation.",
      "addresses_issue": "i2",
      "key_observation": "No need to decide constitutional validity."
    },
    {
      "id": "cr5",
      "text": "It was not necessary for the High Court to have struck down the provisions of sections 3(b), 4(1), 4(2) and 5 of the Validating Act. When rule 2(c) was held to be inoperative by virtue of the decision of this Court, all the reliefs claimed by the respondents in the writ petitions could have been given to them without striking down these provisions.",
      "addresses_issue": "i1",
      "key_observation": "Reliefs granted without needing to strike down provisions."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The High Court was, therefore, right in restraining the appellant-Municipality from levying house tax on the mills, factories or buildings connected therewith of the respondents and in quashing the demand notice issued.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "We have no occasion to reach the constitutional question as regards the validity of the impugned sections of the Validating Act and we express no opinion upon it.",
      "resolves_issue": "i2",
      "in_favor_of": "partial"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Lokamanya Mills, Barsi Ltd. v. Barsi Borough Municipality",
      "citation": "1962 1 S.C.R. 306",
      "treatment": "followed",
      "relevance": "Held rule 2(c) ultra vires as it adopted mode of valuation different from sanctioned by Boroughs Act; rule struck down."
    }
  ],
  "statutes_cited": [
    {
      "name": "Borough Municipalities Validation of Certain Taxes on Buildings and Lands Act, 1965 (Maharashtra Act No. 111 of 1966)",
      "sections": [
        "Section 3",
        "Section 3(b)",
        "Section 4",
        "Section 4(1)",
        "Section 4(2)",
        "Section 5"
      ],
      "relevance": "Challenged as violating Art. 14; amendments to Boroughs Act and validation of past levies held not to resurrect rule 2(c) or create charging provision."
    },
    {
      "name": "Bombay Municipal Boroughs Act (Boroughs Act)",
      "sections": [
        "Section 3",
        "Section 75",
        "Section 78",
        "Explanation to Section 75"
      ],
      "relevance": "Authorized levy on annual letting value or capital value; rule 2(c) ultra vires; amendments via Validating Act allowed floor area basis but no charging provision."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 14"
      ],
      "relevance": "Ground for challenging Validating Act; court avoided deciding validity."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court dismissed the appeals filed by the Municipalities against the Bombay High Court's judgment restraining levy and collection of house tax on mills, factories etc., holding no charging provision existed post-striking down of rule 2(c), without deciding constitutional validity of Validating Act provisions.",
    "relief_granted": "High Court order upheld: restraining levy/collection and quashing demand notices.",
    "costs": "no order as to costs"
  },
  "key_quotes": [
    {
      "text": "The vice of the rule lies in an assumed uniformity of return per square foot which structures of different classes which are in their nature not similar, may reasonably fetch if let out to tenants and in the virtual deprivation to the rate-payer of his statutory right to object to the valuation.",
      "speaker": "court",
      "significance": "Reason for striking down rule 2(c) in prior case."
    },
    {
      "text": "It is a wise tradition with Courts not to decide a constitutional question if the case can be disposed of on other grounds.",
      "speaker": "court",
      "significance": "Basis for avoiding Art. 14 validity decision."
    }
  ],
  "_case_id": "1972_400",
  "_label": 0,
  "_text_length": 11761,
  "_extracted_at": "2026-02-10T20:09:42.438497"
}