{
  "metadata": {
    "case_name": "Appellant v. State of Mysore",
    "case_year": 1971,
    "court": "Supreme Court of India",
    "judges": [
      "MUKHERJEA, J."
    ],
    "case_number": "Civil Appeal No. 2262 of 1971",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant was an officer of the old State of Mysore.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "After the States Reorganisation Act of 1956, appellant entered service of the new State of Mysore constituted under that Act.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "It is admitted that the appellant was entitled to the benefits of the service rules which obtained before his transfer to the new State of Mysore, specifically the Mysore Services Regulations as they stood on 1 November 1956.",
      "type": "admitted",
      "date": "1956-11-01",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Dispute on superannuation age: according to appellant, 60 years; according to respondent, 55 years.",
      "type": "disputed",
      "date": null,
      "source": "petitioner | respondent"
    },
    {
      "id": "f5",
      "text": "Two versions of pre-1956 Mysore Services Regulations: Seventh Edition published in 1945 (Art. 305) and Eighth Edition published in 1953 (Art. 294).",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "High Court of Mysore disposed of several writ petitions including Writ Petition No. 6201 of 1969 by judgment and order dated November 25, 1969.",
      "type": "procedural",
      "date": "1969-11-25",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Common question before High Court was superannuation age under relevant regulations.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Parties to instant case agreed that conditions of service are those contained in the Eighth Edition.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Appellant is not a Railway officer and does not claim benefit of Rule 2046 of Indian Railway Fundamental Rules.",
      "type": "material",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "What is the superannuation age of the appellant under the Mysore Services Regulations as they stood on 1 November 1956, specifically interpreting Art. 305 of Seventh Edition and Art. 294 of Eighth Edition?",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The latest decision of this Court in Union of India v. R. V. Sadasiva Murthy is the correct decision to be followed in interpreting Art. 294 of the Eighth Edition as well as Art. 305 of the Seventh Edition, supporting 60 years as age of superannuation.",
      "supporting_facts": [
        "f5",
        "f6"
      ],
      "legal_basis": "Union of India v. R. V. Sadasiva Murthy; Art. 305 Seventh Edition clause c"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Age of superannuation is 55 years under Art. 294 of Eighth Edition.",
      "supporting_facts": [
        "f3",
        "f5"
      ],
      "legal_basis": "Art. 294 Eighth Edition; Al. Narasimhachar v. State of Mysore; State of Mysore v. Padmanabhacharya"
    },
    {
      "id": "ra2",
      "text": "Art. 305 of Seventh Edition and Art. 428 read together do not make 60 years normal age; clause c omitted in Eighth Edition.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": "Art. 305 and 428 Seventh Edition"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Two earlier decisions (Narasimhachar and Padmanabhacharya) more apposite as they interpret Eighth Edition Art. 294(a), directly applicable since parties agree Eighth Edition governs.",
      "addresses_issue": "i1",
      "key_observation": "Eighth Edition applies per parties' common ground."
    },
    {
      "id": "cr2",
      "text": "Sadasiva Murthy case distinguishable: appellant there was railway servant qualifying under Rule 2046 Indian Railway Fundamental Rules for retention till 60; instant appellant not railway officer.",
      "addresses_issue": "i1",
      "key_observation": "Sadasiva supported on different ground (railway rules), not applicable here."
    },
    {
      "id": "cr3",
      "text": "Art. 294 Eighth Edition clear: Government servant in superior or inferior service attaining 55 may be required to retire unless Government considers efficient and permits retention; no option for officer, discretion with Government, no compulsion to extend.",
      "addresses_issue": "i1",
      "key_observation": "Language of Art. 294(a) gives clear discretion to retire at 55."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Under Art. 294 of Eighth Edition of Mysore Services Regulations, age of superannuation is 55 years; Government has discretion to require retirement at 55 or retain if efficient.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Al. Narasimhachar v. State of Mysore",
      "citation": "1960 1 S.C.R. 981",
      "treatment": "followed",
      "relevance": "Interpreted Art. 294(a) Eighth Edition; age of retirement 55 years, Art. 297 complementary allowing option if retained."
    },
    {
      "case_name": "State of Mysore v. Padmanabhacharya",
      "citation": "1966 1 S.C.R. 994",
      "treatment": "followed",
      "relevance": "Interpreted Art. 294(a) Eighth Edition post-1955 amendment; normal age 55 unless extended for fitness, special for trained teachers to 58."
    },
    {
      "case_name": "Union of India v. R. V. Sadasiva Murthy",
      "citation": "Civil Appeals Nos. 476 to 478 of 1969, judgment 15 July 1969",
      "treatment": "distinguished",
      "relevance": "Interpreted Art. 305 Seventh Edition supporting 60 years but on ground of railway servant under Rule 2046; not applicable to non-railway officer under Eighth Edition."
    }
  ],
  "statutes_cited": [
    {
      "name": "States Reorganisation Act, 1956",
      "sections": [],
      "relevance": "Constituted new State of Mysore; appellant transferred to its service, entitled to pre-transfer rules."
    },
    {
      "name": "Mysore Services Regulations",
      "sections": [
        "Art. 294 (Eighth Edition)",
        "Art. 305 (Seventh Edition)",
        "Art. 428 (Seventh Edition)",
        "Art. 297"
      ],
      "relevance": "Governing superannuation age; interpreted to fix 55 as age unless extended."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 309"
      ],
      "relevance": "Mentioned in Padmanabhacharya case regarding notification validating retirements."
    },
    {
      "name": "Indian Railway Fundamental Rules",
      "sections": [
        "Rule 2046",
        "Rule 2047"
      ],
      "relevance": "Applied in Sadasiva Murthy to retain certain servants till 60; not applicable here."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal by special leave is dismissed as there is no merit; superannuation age is 55 years under Art. 294 of Eighth Edition of Mysore Services Regulations.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "Art. 294 does not leave any room for doubt on this point. The discretion to retire an officer whether of the superior service or of the inferior service at 55 years has been given in clear unmistakable language to Government.",
      "speaker": "court",
      "significance": "Core holding on interpretation of Art. 294 fixing 55 as superannuation age."
    },
    {
      "text": "All officers attaining that age may be required to retire. It is clear that the officers themselves have no option in the matter. If Government decides to retire them, they must go out.",
      "speaker": "court",
      "significance": "Emphasizes no option for employee, full discretion with Government."
    }
  ],
  "_case_id": "1972_588",
  "_label": 0,
  "_text_length": 14852,
  "_extracted_at": "2026-02-10T20:11:02.908500"
}