{
  "metadata": {
    "case_name": "Commissioner of Sales Tax, Uttar Pradesh v. Respondent (Dealer)",
    "case_year": 1969,
    "court": "Supreme Court of India",
    "judges": [
      "Dua, J."
    ],
    "case_number": "Civil Appeal No. 2088 of 1969",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The dealer carries on the business, inter alia, of selling food colours and syrup essences.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The dealer also carries on the business of petroleum jelly but not concerned with that item in this appeal nor with the sales of imported scents and perfumes which were separately shown in the statement filed by the dealer during the assessment proceedings for the year 1960-61.",
      "type": "background",
      "date": "1960-61",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "For the assessment year 1960-61, the Sales Tax Officer taxed food colours and syrup essences imported by the dealer from outside Uttar Pradesh under s. 3A of U.P. Sales Tax Act, 1948 treating them as imported colours and perfumes. The figures of the dealer's trading account were accepted by the Sales Tax Officer.",
      "type": "procedural",
      "date": "1960-61",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The dealer claimed food colours and syrup essences being unclassified goods were taxable under s. 3 and not under s. 3A of the Act.",
      "type": "disputed",
      "date": "1960-61",
      "source": "dealer"
    },
    {
      "id": "f5",
      "text": "The dealer unsuccessfully appealed against the order of the Sales Tax Officer to the Assistant Commissioner (Judicial) II Sales Tax, Kanpur.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Further revision to the Court of the Judge (Revisions) Sales Tax, Lucknow also failed.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "For the assessment year 1957-58 the Appellate Authority had, in disagreement with the assessing officer, held food colours and essences of syrup to be unclassified items and had granted the relief claimed by the dealer.",
      "type": "procedural",
      "date": "1957-58",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Against the decision of the Appellate Authority for 1957-58 the Department preferred a revision to the Court of the Judge (Revision), Sales Tax.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Both revisions (Department for 1957-58 and dealer for 1960-61) were heard together and disposed of by common order dated November 19, 1965.",
      "type": "procedural",
      "date": "1965-11-19",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "The dealer's application for reference was allowed and the Judge (Revisions) Sales Tax referred the question to the Allahabad High Court.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Allahabad High Court judgment and order dated April 3, 1969 answered the question in the negative in favour of the dealer and against the Commissioner.",
      "type": "procedural",
      "date": "1969-04-03",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "There is no dispute about the turnover. The dealer claims that on imported food colours and syrup essences the rate of tax should be 2 nP. per rupee as unclassified goods under S. 3, whereas according to the Commissioner the tax should be 6 nP. per rupee under s. 3A of the Act.",
      "type": "disputed",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the food colours and essence are under the circumstances items to be taxed under section 3A within Notification No. ST-905/X dated March 31, 1956?",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The words 'dyes and colours' in entry 10 of the List in the Notification and the words 'scents and perfumes' in entry 37 are unqualified and there being no limitation discernible on their plain and general meaning, they must be held to be wide enough to cover food colours and syrup essences.",
      "supporting_facts": [
        "f3",
        "f12"
      ],
      "legal_basis": "Random House Dictionary; Encyclopedia Britannica; Corpus Juris Secundum; Commissioner of Sales Tax U.P. v. Indian Herbs Research Supply Co. (perfume includes dhoop and dhoop batti)"
    },
    {
      "id": "pa2",
      "text": "Rule 23 of Prevention of Food Adulteration Rules, 1955 postulates addition of colouring matter to an article of food when permitted, suggesting 'colour' in entry 10 includes edible colour.",
      "supporting_facts": [],
      "legal_basis": "Prevention of Food Adulteration Rules, 1955 r.23"
    },
    {
      "id": "pa3",
      "text": "Goods under s.3A are luxury goods and food colours and syrup essences are normally used by comparatively richer class.",
      "supporting_facts": [],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Food colours are edible articles. The expression 'dyes and colours and compositions thereof' does not relate to items of food but only to colouring and dyeing material i.e., material for colour washing or colour painting or dyeing of fabrics.",
      "supporting_facts": [
        "f1",
        "f4"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Essence is a flavoring material and its function is to add flavor to the food i.e., to make it more palatable. It appeals to the tongue or to the palate. By 'scents and perfumes' is meant articles of perfumery.",
      "supporting_facts": [
        "f1",
        "f4"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Words 'dyes and colours' in entry 10 and 'scents and perfumes' in entry 37 have to be construed in their own context and in the sense as ordinarily understood by people usually conversant with and dealing in such goods. Similarly, food colours and syrup essences to be construed in the sense in which they are popularly understood by those who deal in them and who purchase and use them.",
      "addresses_issue": "i1",
      "key_observation": "Popular commercial sense, not dictionary meanings."
    },
    {
      "id": "cr2",
      "text": "Cited precedents: Kishan Chand Chellaram (artificial silk); Sarin Chemical Laboratory (tooth powder as toilet requisite); Ramvatar Budhiprasad (betel leaves not vegetable); Commissioner of Sales Tax, P. Indore v. Jaswant Singh Charan Singh (coal includes charcoal); Sales Tax Commissioner U.P. v. Ladha Singh Mal Singh (power-loom cloth not mill cloth).",
      "addresses_issue": "i1",
      "key_observation": "Interpret in common parlance by dealers and consumers."
    },
    {
      "id": "cr3",
      "text": "Food colours and syrup essences are edible goods whereas dyes/colours/compositions and scents/perfumes prima facie not edible. List scheme excludes edibles except specified ones like salt, sugar, banaspati.",
      "addresses_issue": "i1",
      "key_observation": "Entries 10 and 37 not intended to extend to edible colours and essences."
    },
    {
      "id": "cr4",
      "text": "Random House Dictionary not safe guide. Indian Herbs distinguished as context-specific.",
      "addresses_issue": "i1",
      "key_observation": "Not persuaded to interfere with High Court view."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Food colours and syrup essences do not fall within entries 10 ('Dyes and colours and compositions thereof') and 37 ('Scents and perfumes') of Notification No. ST-905/X dated March 31, 1956, and are taxable under s.3 as unclassified goods, not under s.3A.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Commissioner of Sales Tax U.P. v. Indian Herbs Research Supply Co.",
      "citation": "1970 25 S.T.C. 151",
      "treatment": "followed",
      "relevance": "Word 'perfume' held to include dhoop and dhoop batti, but distinguished here on context."
    },
    {
      "case_name": "Kishan Chand Chellaram v. Joint Commercial Tax Officer, Chintradripet",
      "citation": "1968 21 S.T.C. 367",
      "treatment": "referred",
      "relevance": "Meaning of words by persons dealing in and utilising such goods; popular meaning prevails over scientific."
    },
    {
      "case_name": "Sarin Chemical Laboratory v. Commissioner of Sales Tax",
      "citation": "1970 26 S.T.C. 339",
      "treatment": "followed",
      "relevance": "Tooth powder as toilet requisite; names of articles construed in common parlance."
    },
    {
      "case_name": "Ramvatar Budhiprasad v. Assistant Sales Tax Officer Okola",
      "citation": "1961 12 S.T.C. 286",
      "treatment": "referred",
      "relevance": "Betel leaves not vegetable; common parlance."
    },
    {
      "case_name": "Commissioner of Sales Tax, P. Indore v. Jaswant Singh Charan Singh",
      "citation": "1967 19 S.T.C. 469",
      "treatment": "followed",
      "relevance": "'Coal' includes charcoal in commercial sense and common parlance."
    },
    {
      "case_name": "Sales Tax Commissioner U.P. v. Ladha Singh Mal Singh",
      "citation": "1971 28 S.T.C. 325",
      "treatment": "referred",
      "relevance": "Power-loom cloth not 'cloth manufactured by mills' in popular language."
    }
  ],
  "statutes_cited": [
    {
      "name": "U.P. Sales Tax Act, 1948",
      "sections": [
        "Section 3",
        "Section 3A"
      ],
      "relevance": "S.3 provides general liability to tax; S.3A for single point taxation on specified goods at higher rate via notification."
    },
    {
      "name": "Prevention of Food Adulteration Act, 1954",
      "sections": [
        "Sections 4 and 23"
      ],
      "relevance": "Rules 1955 r.23 on permitted colouring matter in food; argued but rejected as supporting broad meaning of colour."
    },
    {
      "name": "Notification No. ST-905/X",
      "sections": [
        "dated March 31, 1956 (effective April 1, 1956)"
      ],
      "relevance": "Declares single point taxation at 1 anna per rupee on listed goods including item 10 'Dyes and colours and compositions thereof' and item 37 'Scents and perfumes'; imported goods at point of sale by importer."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal by the Commissioner of Sales Tax against the Allahabad High Court judgment holding that food colours and syrup essences are not taxable under s.3A per the notification but under s.3 as unclassified goods is dismissed.",
    "relief_granted": "None to petitioner; High Court decision upheld in favour of dealer.",
    "costs": "Dismissed with costs."
  },
  "key_quotes": [
    {
      "text": "'Food colours are edible, articles. The expression dyes and colours and compositions thereof does not relate to item of food but only to colouring and dyeing material i.e., material for colour washing or colour painting or dyeing of fabrics.'",
      "speaker": "court",
      "significance": "High Court reasoning adopted by Supreme Court distinguishing edible from non-edible colours."
    },
    {
      "text": "The words dyes and colours used in entry 10 and the words scents and perfumes used in entry 37 have to be construed in their own context and in the sense, as ordinarily understood and attributed to these words by people usually conversant with and dealing in such goods.",
      "speaker": "court",
      "significance": "Core principle of interpretation applied: popular commercial sense."
    },
    {
      "text": "A sales tax statute, being one levying a tax on goods must, in the absence of a technical term or a term of science or art, be presumed to have used an ordinary term according to the meaning ascribed to it in common parlance.",
      "speaker": "court",
      "significance": "From cited precedent; reinforces popular meaning test."
    }
  ],
  "_case_id": "1972_454",
  "_label": 0,
  "_text_length": 18250,
  "_extracted_at": "2026-02-10T20:10:20.623455"
}