{
  "metadata": {
    "case_name": "Appellant v. Respondent",
    "case_year": 1972,
    "court": "Supreme Court of India",
    "judges": [
      "Mathew, J."
    ],
    "case_number": "Civil Appeal No. 665 N of 1972",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Respondent filed a suit in forma pauperis on April 29, 1962, against the appellant and his wife for recovery of damages to the tune of Rs. 7,48,000/- for malicious prosecution.",
      "type": "background",
      "date": "1962-04-29",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Notice of the petition to sue in forma pauperis was given to the State Government and the appellant under Order 33, Rule 6 of the Civil Procedure Code. Both the Government and the appellant filed objections stating that the respondent is not a pauper.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Appellant filed an application for discovery of documents from the respondent for proving that the respondent is not a pauper.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "Civil Judge, Saharanpur passed an order on February 23, 1970, directing the respondent to discover on affidavit the documents relating to the bank accounts of the respondent (pass books, cheque books, counterfoils, etc.), from March 1, 1963, to the date of filing the affidavit of discovery, as also the documents in respect of the properties held by him and the personal accounts maintained by him. The respondent was to file the affidavit of discovery on March 8, 1970. No extension of time will be allowed.",
      "type": "procedural",
      "date": "1970-02-23",
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "Respondent did not file the affidavit in pursuance to the order.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "On March 31, 1970, respondent moved an application stating that he wants to file a revision against the order dated February 23, 1970, before the High Court and that two months time may be allowed for the purpose.",
      "type": "procedural",
      "date": "1970-03-31",
      "source": "respondent"
    },
    {
      "id": "f7",
      "text": "Court rejected the application for time on April 4, 1970, on the ground that the application for permission to sue in forma pauperis was pending for the last seven years and that the respondent had ample time for filing the revision if he was diligent.",
      "type": "procedural",
      "date": "1970-04-04",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Respondent's counsel then moved another application on the same day stating that the respondent wants to adduce evidence and that since he had not come to Court in the expectation that his earlier application dated March 31, 1970, for adjournment would be allowed, the case may be adjourned. This application was also rejected.",
      "type": "procedural",
      "date": "1970-04-04",
      "source": "respondent"
    },
    {
      "id": "f9",
      "text": "As counsel for the respondent reported no instructions and as there was no evidence to show that the respondent was a pauper, the Court dismissed the application for permission to sue in forma pauperis and directed the respondent to pay the court fee within 15 days.",
      "type": "procedural",
      "date": "1970-04-04",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Respondent challenged the order directing discovery of documents passed on February 23, 1970, and that dismissing his application for permission to sue in forma pauperis passed on April 4, 1970, in revision before the High Court (Civil Revision No. 680 of 1970).",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f11",
      "text": "High Court of Allahabad by judgment and order dated August 27, 1971 allowed the revision, set aside the order for discovery as well as the order dismissing the application for permission to sue in forma pauperis.",
      "type": "procedural",
      "date": "1971-08-27",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "High Court on August 26, 1971 directed the respondent to delete the name of the wife of the appellant from the array of parties.",
      "type": "procedural",
      "date": "1971-08-26",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the procedure for discovery of documents under Order 11 CPC is applicable to proceedings under Order 33 CPC for permission to sue in forma pauperis.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the trial court acted illegally or with material irregularity in ordering discovery of documents without specifying them or considering necessity, relevancy, and privilege.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether the enquiry under Order 33 Rules 6 and 7 is exclusively between the applicant and the State Government, excluding private parties like the defendant from seeking discovery.",
      "framed_by": "court"
    },
    {
      "id": "i4",
      "text": "Whether the High Court had jurisdiction under Section 115 CPC to interfere with the trial court's orders on discovery and dismissal of the pauper application.",
      "framed_by": "court"
    },
    {
      "id": "i5",
      "text": "Whether the trial court erred in rejecting adjournment and dismissing the pauper application.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Procedure for discovery of documents under Order 11 Rule 12 CPC applies to proceedings under Order 33 as the suit commences from presentation of pauper application (citing Vijay Pratap Singh v. Dukh Haran Nath Singh). No reason why discovery should not apply if other provisions like Order 1 Rule 10, Order 9, Order 39 apply.",
      "supporting_facts": [
        "f1",
        "f2"
      ],
      "legal_basis": "Order 33 CPC; Order 11 Rule 12 CPC; Vijay Pratap Singh v. Dukh Haran Nath Singh"
    },
    {
      "id": "pa2",
      "text": "Application for discovery did not need to specify documents; party entitled to general discovery relating to matters in question. Documents relevant to pauperism.",
      "supporting_facts": [
        "f3",
        "f4"
      ],
      "legal_basis": "Order 11 Rule 12 CPC"
    },
    {
      "id": "pa3",
      "text": "Stage for claiming privilege not reached; arises after affidavit of discovery.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": "Order 11 Rule 13 CPC"
    },
    {
      "id": "pa4",
      "text": "Defendant has vital interest in pauper enquiry as it affects immunity from litigation without court fee; entitled to participate and use discovery (Order 33 Rule 6, Rule 9).",
      "supporting_facts": [
        "f2",
        "f9"
      ],
      "legal_basis": "Order 33 Rule 6, Rule 9 CPC"
    },
    {
      "id": "pa5",
      "text": "High Court lacked jurisdiction under S.115 CPC to interfere as no jurisdictional error or material irregularity by trial court; limited revisional jurisdiction.",
      "supporting_facts": [
        "f7",
        "f9",
        "f11"
      ],
      "legal_basis": "Section 115 CPC; precedents like Rajah Amir Hassan Khan v. Sheo Baksh Singh"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Procedure for discovery of documents is not permissible in proceedings under Order 33 and it is not salutary to adopt even if permissible.",
      "supporting_facts": [
        "f3",
        "f4"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Suit commences from presentation of pauper application under Order 33 (Vijay Pratap Singh); Order 11 Rule 12 applies; no reason to exclude discovery when other Orders apply.",
      "addresses_issue": "i1",
      "key_observation": "Discovery permissible in Order 33 proceedings."
    },
    {
      "id": "cr2",
      "text": "No need to specify documents in application; general order for classes of documents valid if relevant to matter in question; documents need not be admissible, sufficient if throw light.",
      "addresses_issue": "i2",
      "key_observation": "Bank accounts, properties, personal accounts relevant to means/pauperism."
    },
    {
      "id": "cr3",
      "text": "Privilege claim arises after affidavit; not at discovery order stage.",
      "addresses_issue": "i2",
      "key_observation": "High Court erred on privilege."
    },
    {
      "id": "cr4",
      "text": "Opposite party (defendant) vitally interested in pauper enquiry under Order 33 Rule 6/9; entitled to discovery.",
      "addresses_issue": "i3",
      "key_observation": "Not exclusive to applicant and State."
    },
    {
      "id": "cr5",
      "text": "Trial court had jurisdiction; no illegal exercise or material irregularity; High Court exceeded S.115 jurisdiction as no jurisdictional error.",
      "addresses_issue": "i4",
      "key_observation": "Revisional interference limited; errors of fact/law not correctable unless jurisdictional."
    },
    {
      "id": "cr6",
      "text": "Rejection of adjournment and dismissal not jurisdictional error or denial of natural justice; pauper application pending 7 years.",
      "addresses_issue": "i5",
      "key_observation": "No material irregularity."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Discovery under Order 11 CPC applies to Order 33 proceedings; trial court's discovery order valid.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "High Court erred in setting aside discovery order; no jurisdictional error by trial court.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h3",
      "text": "Defendant entitled to participate in pauper enquiry and seek discovery.",
      "resolves_issue": "i3",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h4",
      "text": "High Court lacked jurisdiction under S.115 to interfere.",
      "resolves_issue": "i4",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Vijay Pratap Singh v. Dukh Haran Nath Singh",
      "citation": "1962 S.C.R. Supp. 2,675",
      "treatment": "followed",
      "relevance": "Suit commences from pauper application presentation; Order 11 applies."
    },
    {
      "case_name": "Rajah Amir Hassan Khan v. Sheo Baksh Singh",
      "citation": "1884 L.R. 11 I.A. 237",
      "treatment": "referred",
      "relevance": "Limits of S.115/622 CPC revisional jurisdiction."
    },
    {
      "case_name": "Balakrishna Udayar v. Vasudeva Aiyar",
      "citation": "1917 L.R. 44 I.A. 261, 267",
      "treatment": "referred",
      "relevance": "S.115 applies to jurisdiction, irregular/illegal exercise."
    },
    {
      "case_name": "N. S. Venkatagiri Ayyangar v. Hindu Religious Endowments Board, Madras",
      "citation": "1948-49 L.R. 76 I.A. 67",
      "treatment": "referred",
      "relevance": "Three matters for S.115 interference."
    },
    {
      "case_name": "Manindra Land and Building Corporation Ltd. v. Bhutnath Banerjee",
      "citation": "A.I.R. 1964 S.C. 1336",
      "treatment": "referred",
      "relevance": "Distinction between jurisdictional errors and others under S.115."
    },
    {
      "case_name": "Vora Abbashhai Alimahomed v. Haji Gulamnabi Haji Safibhai",
      "citation": "A.I.R. 1964 S.C. 1341",
      "treatment": "referred",
      "relevance": "Distinction between jurisdictional errors and others under S.115."
    },
    {
      "case_name": "Pandurang Dhoni Chougute v. Maruti Hari Jadhav",
      "citation": "1956 1 S.C.R. 102",
      "treatment": "followed",
      "relevance": "S.115 not for correcting non-jurisdictional errors of fact/law."
    },
    {
      "case_name": "Anisminic Ltd. v. Foreign Compensation Commission",
      "citation": "1969 2 A.C. 147",
      "treatment": "referred",
      "relevance": "Expanded concept of jurisdictional error."
    },
    {
      "case_name": "R. v. Bolton",
      "citation": "1841 1 Q.B. 66",
      "treatment": "referred",
      "relevance": "Jurisdiction at commencement."
    }
  ],
  "statutes_cited": [
    {
      "name": "Code of Civil Procedure, 1908",
      "sections": [
        "Order 33 Rule 6",
        "Order 33 Rule 7",
        "Order 33 Rule 9",
        "Order 11 Rule 12",
        "Order 11 Rule 13",
        "Order 11 Rule 21",
        "Order 1 Rule 10",
        "Order 9",
        "Order 39",
        "Section 115"
      ],
      "relevance": "Governs pauper suits, discovery, and revisional jurisdiction; discovery applicable to pauper proceedings."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Supreme Court allowed the appeal by special leave, set aside the High Court's order dated August 27, 1971 allowing the revision, restored the trial court's orders on discovery and dismissal of pauper application. No order as to costs. High Court's order dated August 26, 1971 on deleting appellant's wife unaffected.",
    "relief_granted": "Restoration of trial court orders directing discovery and dismissing pauper application.",
    "costs": "No order as to costs"
  },
  "key_quotes": [
    {
      "text": "this Court has held that the suit commences from the moment an application for permission to sue in forma pauperis as required by Order 33 is presented. If that be so, the provisions of rule 12 of Order 11 relating to discovery would in terms apply",
      "speaker": "court",
      "significance": "Establishes applicability of discovery to pauper proceedings."
    },
    {
      "text": "An immunity from a litigation unless the requisite court fee is paid by the plaintiff is a valuable right for the defendant.",
      "speaker": "court",
      "significance": "Highlights defendant's interest in pauper enquiry."
    },
    {
      "text": "The jurisdiction of the High Court under section 115 of the C.P.C. is a limited one.",
      "speaker": "court",
      "significance": "Limits High Court's revisional interference."
    }
  ],
  "_case_id": "1972_281",
  "_label": 1,
  "_text_length": 23516,
  "_extracted_at": "2026-02-10T20:09:06.212461"
}