{
  "metadata": {
    "case_name": "Inspector under Minimum Wages Act v. Chittapore Stone Quarrying Company Pvt. Ltd.",
    "case_year": 1968,
    "court": "Supreme Court of India",
    "judges": [
      "Palekar J.",
      "Vaidialingam J.",
      "Mathew J."
    ],
    "case_number": "Civil Appeal No. 40 of 1968",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Notification issued by Appropriate Government under Minimum Wages Act, 1948 fixing minimum wages for those employed in stone breaking or stone crushing in Gulbarga District.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Respondent No. 1, Chittapore Stone Quarrying Company Pvt. Ltd., engaged in quarrying Shahabad stone in Chittapur, District Gulbarga.",
      "type": "background",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f3",
      "text": "Activity description: Earth (overburden) removed by manual labour; thick limestone layers removed incidentally; main operation is baring thin limestone layers and cutting them into regular sizes for flooring stones. No stone breaking or stone crushing operations carried on.",
      "type": "admitted",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f4",
      "text": "Appellant Inspector viewed respondent No. 1's activity as stone breaking and stone crushing, initiated proceedings before Munsif Magistrate, Chittapur (respondent No. 3) for breach of Minimum Wages Act and rules.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "Respondent No. 1 filed Writ Petition No. 1860 of 1965 in Mysore High Court seeking quashing of proceedings, alleging Minimum Wages Act does not apply as activity is mining limestone slabs, not stone breaking or stone-crushing.",
      "type": "procedural",
      "date": "1965",
      "source": "respondent"
    },
    {
      "id": "f6",
      "text": "Mysore High Court by judgment and order dated July 25, 1967 held process involves breaking and crushing but substance approximates mineral, not really stone; quashed proceedings.",
      "type": "procedural",
      "date": "1967-07-25",
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Appeal to Supreme Court by certificate granted by High Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether quarrying of Shahabad stone is an activity which could be properly described as stone breaking or stone crushing mentioned in item 8, Part I of the Schedule to the Minimum Wages Act, 1948.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Respondent No. 1 engaged in stone-breaking and stone-crushing in Gulbarga District where notification fixing minimum wages applies; liable to pay minimum wages to employees.",
      "supporting_facts": [
        "f1",
        "f2",
        "f4"
      ],
      "legal_basis": "Minimum Wages Act, 1948, Schedule Part I Item 8; Section 2(g)"
    },
    {
      "id": "pa2",
      "text": "Quarrying Shahabad stone involves stone-breaking or stone-crushing; distinction between cutting with sharp instrument and breaking with hammer is metaphysical and not rational under purposive approach of the Act.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": "Ray Limestone & Co. v. Sub-Divisional Officer Ranchi; State of Maharashtra v. Mohanlal Devichand Shah"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Activity is quarrying/mining thin limestone layers cut into regular sizes (dimensional slabs), not stone breaking or stone-crushing; involves no blasting or crushing into irregular fragments.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": "Minimum Wages Act, 1948, Schedule Part I Item 8"
    },
    {
      "id": "ra2",
      "text": "Shahabad stone is stratified limestone for dimension stone (flooring), distinct from non-stratified limestone broken/crushed into fragments; stone-breaking/crushing refers to quarry operations on common rock.",
      "supporting_facts": [
        "f2",
        "f3"
      ],
      "legal_basis": "Madhya Pradesh Mineral Industry Association v. Regional Labour Commissioner"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Stone-breaking and stone-crushing in common parlance refers to commercial activity where stone (common rock) is broken/crushed to fragments by mechanical means for profit; futile to explore semantics of 'stone' as mineral or otherwise.",
      "addresses_issue": "i1",
      "key_observation": "Shahabad stone quarrying is stratified dimension stone, distinct from non-stratified rock broken into irregular fragments."
    },
    {
      "id": "cr2",
      "text": "Common rocks commercially exploited: igneous (granite), sedimentary (limestone); stratified vs non-stratified; non-stratified yields to breaking/crushing, stratified to skillful removal for slabs; Shahabad is stratified limestone.",
      "addresses_issue": "i1",
      "key_observation": "Stone-breaking/crushing relates to non-stratified limestone into fragments for construction/cement; not applicable to stratified dimension stone."
    },
    {
      "id": "cr3",
      "text": "Dissent (Mathew J.): Shahabad stone is limestone (sedimentary rock); no distinction between stratified/non-stratified for 'stone' in Item 8; quarrying involves stone-breaking; main operation, not incidental.",
      "addresses_issue": "i1",
      "key_observation": "Employment in quarrying Shahabad stone falls within Item 8 as quarry operations involve extraction by cutting/blasting."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Quarrying Shahabad stone (stratified limestone for dimension slabs) is not employment in stone-breaking or stone-crushing under Item 8, Part I of Schedule to Minimum Wages Act, 1948.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Madhya Pradesh Mineral Industry Association v. Regional Labour Commissioner Jabalpur",
      "citation": "1960 3 S.C.R. 476",
      "treatment": "followed",
      "relevance": "Stone-breaking/crushing refers to piece of rock in quarry operations, excludes manganese; popular parlance sense."
    },
    {
      "case_name": "Ray Limestone & Co. v. Sub-Divisional Officer Ranchi",
      "citation": "A.I.R. 1968 Patna 39",
      "treatment": "distinguished",
      "relevance": "Quarrying limestone involves stone-breaking/crushing, but distinguished as not applying to stratified dimension stone."
    },
    {
      "case_name": "State of Maharashtra v. Mohanlal Devichand Shah",
      "citation": "1965 3 S.C.R. 461",
      "treatment": "referred",
      "relevance": "Entry 8 refers to quarry operations involving stone-breaking/crushing."
    }
  ],
  "statutes_cited": [
    {
      "name": "Minimum Wages Act, 1948",
      "sections": [
        "Section 2(g)",
        "Schedule Part I Item 8"
      ],
      "relevance": "Defines scheduled employment; fixes minimum wages for stone-breaking or stone-crushing; does not apply to Shahabad stone quarrying."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal dismissed in accordance with majority judgment; High Court order quashing proceedings upheld; appellant to pay costs of respondent No. 1.",
    "relief_granted": "Proceedings before Munsif Magistrate quashed.",
    "costs": "Appellant shall pay the costs of respondent No. 1."
  },
  "key_quotes": [
    {
      "text": "\"It appears to us that it will be a futile exercise in semantics to try to explore what the content of a stone is-whether it is a mineral or not...\"",
      "speaker": "court",
      "significance": "Rejects overly technical interpretation of 'stone' in favor of commercial parlance."
    },
    {
      "text": "\"Stone-breaking and stone-crushing in relation to limestone is, therefore, that activity in which non-stratified limestone... is broken or crushed into irregular fragments or sizes.\"",
      "speaker": "court",
      "significance": "Defines scope of scheduled employment, distinguishing stratified quarrying."
    },
    {
      "text": "\"Employment in quarrying operation for extraction of Shahabad stone is employment within the ambit of item 8 of Part I of the Schedule.\"",
      "speaker": "court",
      "significance": "Dissenting view that quarrying falls under Item 8."
    }
  ],
  "_case_id": "1972_218",
  "_label": 0,
  "_text_length": 17565,
  "_extracted_at": "2026-02-10T20:08:13.906486"
}