{
  "metadata": {
    "case_name": "Kanu Biswas v. State of West Bengal",
    "case_year": 1972,
    "court": "Supreme Court of India",
    "judges": [
      "Khanna, J."
    ],
    "case_number": "Writ Petition No. 46 of 1972",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Order of detention made by District Magistrate 24-Parganas on November 13, 1971 under section 3 of the Maintenance of Internal Security Act, 1971 (Act 26 of 1971) with a view to preventing petitioner from acting in any manner prejudicial to the maintenance of public order.",
      "type": "procedural",
      "date": "1971-11-13",
      "source": "lower_court"
    },
    {
      "id": "f2",
      "text": "Petitioner arrested in pursuance of detention order on November 14, 1971 and served the same day with the order as well as grounds of detention together with vernacular translation thereof.",
      "type": "procedural",
      "date": "1971-11-14",
      "source": "lower_court"
    },
    {
      "id": "f3",
      "text": "District Magistrate sent report to State Government on November 18, 1971 about passing of detention order along with grounds and other particulars.",
      "type": "procedural",
      "date": "1971-11-18",
      "source": "lower_court"
    },
    {
      "id": "f4",
      "text": "State Government approved detention order on November 24, 1971 and sent necessary report to Central Government on that day.",
      "type": "procedural",
      "date": "1971-11-24",
      "source": "respondent"
    },
    {
      "id": "f5",
      "text": "State Government placed case before Advisory Board on December 13, 1971.",
      "type": "procedural",
      "date": "1971-12-13",
      "source": "respondent"
    },
    {
      "id": "f6",
      "text": "State Government received representation from petitioner on December 12, 1971; considered and rejected it on January 11, 1972; thereafter forwarded to Advisory Board.",
      "type": "procedural",
      "date": "1971-12-12",
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "Advisory Board, after considering material including petitioner's representation and hearing petitioner in person, sent report on January 14, 1972 opining sufficient cause for detention.",
      "type": "procedural",
      "date": "1972-01-14",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "State Government confirmed order of detention on February 2, 1972 and communication sent to petitioner.",
      "type": "procedural",
      "date": "1972-02-02",
      "source": "respondent"
    },
    {
      "id": "f9",
      "text": "On 26-9-71 at about 18.30 hours while Baidyanath Bandopadhya of Champapukur, P.S. Basirhat, District 24-Parganas along with his wife were travelling in a 3rd class compartment of Up Basirhat local train from Barasat, petitioner along with associates attacked him and his wife with open knives between Champapukur RS and Basirhat RS and robbed them of Wrist Watch, Gold Ornaments, Cash valued at Rs. 725/- by putting them in fear of death. By such activities created terror and panic among travelling passengers and public order was disturbed thereby.",
      "type": "material",
      "date": "1971-09-26",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "On 4-11-71 at about 21.40 hours, petitioner and associates armed with bombs, daggers, knives and iron rods etc. attacked police on the platform at Belighata railway station with a view to take their lives and to intimidate the public; charged two bombs which exploded with terrible sound endangering on-duty police. Such action created panic and confusion among passengers.",
      "type": "material",
      "date": "1971-11-04",
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the particular acts on account of which the order for detention was made were germane to the maintenance of public order and as such the order could validly be made for preventing petitioner from acting in a manner prejudicial to the maintenance of public order.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The particular acts on account of which the order for the detention of the petitioner has been made were not germane to the maintenance of public order and, as such, the order for his detention could not be validly made for preventing him from acting in a manner prejudicial to the maintenance of public order.",
      "supporting_facts": [
        "f9",
        "f10"
      ],
      "legal_basis": "Sudhir Kumar Saha v. Commissioner of Police, Calcutta"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The incidents affected public order and not merely law and order.",
      "supporting_facts": [
        "f9",
        "f10"
      ],
      "legal_basis": "Arun Ghosh v. State of West Bengal; Nagendra Nath Mondal v. State of West Bengal"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Each one of the above two incidents of September 26, 1971 and November 4, 1971, in our opinion, affected public order and not merely law and order.",
      "addresses_issue": "i1",
      "key_observation": "Distinction between public order and law and order: public order is even tempo of life of community; test is degree of disturbance and effect upon community."
    },
    {
      "id": "cr2",
      "text": "When two passengers are robbed at the point of knife while travelling in a third class compartment of a running train, the act affects not only the passengers deprived of valuables but also other passengers who watch in fear; bound to be consequent terror and panic amongst travelling public.",
      "addresses_issue": "i1",
      "key_observation": "Act adversely affects even tempo of life of community and causes general disturbance of public tranquility."
    },
    {
      "id": "cr3",
      "text": "Attack directed against police party on platform of railway station by exploding bombs bound to create panic and confusion among passengers at railway station.",
      "addresses_issue": "i1",
      "key_observation": "Past activities of petitioner showed propensity to disturb public order."
    },
    {
      "id": "cr4",
      "text": "Sudhir Kumar Saha distinguished; facts akin to Tapan Kumar Mukherjee where robbery in train with dagger created terror; Nandlal Roy and S.K. Kedar upheld similar activities as prejudicial to public order.",
      "addresses_issue": "i1",
      "key_observation": "Incidents interlinked and germane to public order."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "In the light of what has been observed above, we have no doubt that each one of the incidents of September 26, 1971 and November 4, 1971 was prejudicial to the maintenance of public order.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "The past activities of the petitioner as revealed in the grounds of detention showed a propensity to disturb public order.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Dr. Ram Manohar Lohia v. State of Bihar",
      "citation": "1966 1 S.C.R. 709",
      "treatment": "followed",
      "relevance": "Distinction between law and order, public order, security of State; concentric circles; contravention must affect community at large to affect public order."
    },
    {
      "case_name": "Arun Ghosh v. State of West Bengal",
      "citation": "1970 3 S.C.R. 288",
      "treatment": "followed",
      "relevance": "Public order is even tempo of community life; degree of disturbance determines law/order vs public order; stabbing example vs communal tension."
    },
    {
      "case_name": "Nagendra Nath Mondal v. State of West Bengal",
      "citation": "1972 I S.C.R. 498",
      "treatment": "followed",
      "relevance": "Principle on test for law/order vs public order followed."
    },
    {
      "case_name": "Nandlal Roy etc. v. State of West Bengal",
      "citation": "WP No. 15 of 1972, decided on March 11, 1972",
      "treatment": "followed",
      "relevance": "Theft from wagon, throwing bombs on RPF creating panic upheld as public order disturbance."
    },
    {
      "case_name": "Sudhir Kumar Saha v. Commissioner of Police, Calcutta",
      "citation": "1970 3 S.C.R. 360",
      "treatment": "distinguished",
      "relevance": "Attacks with knife/bombs on specific localities not interlinked, not prejudicial to public order."
    },
    {
      "case_name": "Tapan Kumar Mukherjee and Ors. v. State of West Bengal",
      "citation": null,
      "treatment": "followed",
      "relevance": "Robbery in running train at dagger point created terror among passengers, disturbance of public order; bomb on shop caused panic."
    },
    {
      "case_name": "S. K. Kedar v. State of West Bengal",
      "citation": "WP No. 35 of 1972 decided on May 2, 1972",
      "treatment": "followed",
      "relevance": "Removing railway material, charging bombs/ballast on RPF; prejudicial to public order."
    }
  ],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Article 32"
      ],
      "relevance": "Petition through jail for writ of habeas corpus."
    },
    {
      "name": "Maintenance of Internal Security Act, 1971",
      "sections": [
        "Section 3"
      ],
      "relevance": "Order of detention to prevent acting prejudicial to maintenance of public order."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The court upheld the detention order finding the incidents prejudicial to public order, distinguishing relevant precedents and following others; detention valid.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "Public order is the even tempo of the life of the community taking the country as a whole or even a specified locality. Disturbance of public order is to be distinguished from acts directed against individuals which do not disturb the society to the extent of causing a general disturbance of public tranquility.",
      "speaker": "court",
      "significance": "Defines public order from Arun Ghosh, central to reasoning."
    },
    {
      "text": "The test to be adopted in determining whether an act affects law and order or public order... is: Does it lead to disturbance of the current of life of the community so as to amount to a disturbance of the public order, or does it affect merely an individual leaving the tranquility of the society undisturbed?",
      "speaker": "court",
      "significance": "Key test applied to facts."
    },
    {
      "id": "h1",
      "text": "Each one of the incidents of September 26, 1971 and November 4, 1971 was prejudicial to the maintenance of public order.",
      "speaker": "court",
      "significance": "Core holding upholding detention."
    }
  ],
  "_case_id": "1972_241",
  "_label": 0,
  "_text_length": 12683,
  "_extracted_at": "2026-02-10T20:09:05.429070"
}