{
  "metadata": {
    "case_name": "Ramesh Chandra J. Thakkar v. Parmanand Jhaveri & Anr.",
    "case_year": 1972,
    "court": "Supreme Court of India",
    "judges": [
      "KHANNA, J."
    ],
    "case_number": "Criminal Appeal No. 88 of 1972",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Parmanand Jhaveri (respondent No. 1) filed two complaints before the Court of the Presidency Magistrate Girgaum against Ramesh Chandra J. Thakkar (appellant) and B. K. Shah alleging offences under section 420 IPC and section 13 of the Maharashtra Ownership of Flats Regulation of the Promotion of Construction, Sale, Management and Transfer Act, 1963.",
      "type": "material",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f2",
      "text": "In one complaint, accused agreed to sell two flats to complainant; in the second, agreement to transfer a third flat. Agreements entered on February 11, 1967; possession to be delivered by December 31, 1967.",
      "type": "material",
      "date": "1967-02-11",
      "source": "respondent"
    },
    {
      "id": "f3",
      "text": "Accused received Rs. 28,000 from complainant but failed to deliver possession of the flats.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f4",
      "text": "B. K. Shah could not be traced; cases proceeded only against appellant.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Charges framed against appellant on April 2, 1970: Failed to make full and true disclosure of nature of title to land; failed to get written agreements registered under Indian Registration Act; induced complainant to part with Rs. 28,000 on false representation, punishable under sections 3 and 4 r/w 13-14 Maharashtra Act and section 420 IPC.",
      "type": "procedural",
      "date": "1970-04-02",
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "On April 30, 1970, after some evidence, parties entered agreement whereby accused undertook to do certain things within period; complainant did not wish to proceed; case compounded and accused acquitted.",
      "type": "procedural",
      "date": "1970-04-30",
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "On August 17, 1970, respondent No. 1 filed application stating appellant failed to fulfill undertaking to deliver possession or pay back amount; prayed for action for contempt of court.",
      "type": "procedural",
      "date": "1970-08-17",
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "Trial magistrate on January 25, 1971 held appellant guilty of contempt for going back on undertaking; directed papers sent to High Court.",
      "type": "procedural",
      "date": "1971-01-25",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Bombay High Court Division Bench held not fit for contempt action but set aside acquittal order suo motu after notice to appellant; directed trial magistrate to proceed from stage where complainant was persuaded not to press complaints. Judgment dated January 24, 1972.",
      "type": "procedural",
      "date": "1972-01-24",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the High Court could set aside the trial magistrate's order of acquittal based on compounding of offences under section 420 IPC and section 13 of Maharashtra Act, where section 13 offence is non-compoundable.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether permission to compound section 420 IPC could be severed from non-compoundable section 13 offence.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Even if acquittal for section 13 Maharashtra Act could be set aside as non-compoundable, High Court should not have interfered with acquittal for section 420 IPC, which is compoundable with court permission.",
      "supporting_facts": [
        "f5",
        "f6"
      ],
      "legal_basis": "Section 345 CrPC"
    },
    {
      "id": "pa2",
      "text": "Permission to compound section 420 IPC was granted and should be upheld separately.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "No specific arguments detailed beyond support for High Court order.",
      "supporting_facts": [],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Offence under section 13 Maharashtra Act is non-compoundable; acquittal based on compounding invalid. High Court can set aside such acquittal in revision.",
      "addresses_issue": "i1",
      "key_observation": "Acquittal based on compounding of non-compoundable offence liable to be set aside."
    },
    {
      "id": "cr2",
      "text": "Section 420 IPC compoundable only with permission; no order granting permission brought to notice. Even if granted, indivisible permission for both offences invalid due to non-compoundable section 13; cannot sever.",
      "addresses_issue": "i2",
      "key_observation": "Permission cannot be severed; invalid in entirety."
    },
    {
      "id": "cr3",
      "text": "High Court can act suo motu in revision under section 439 CrPC if order fit for interference.",
      "addresses_issue": "i1",
      "key_observation": "Revisional jurisdiction exercisable suo motu."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "High Court rightly set aside acquittal as based on invalid compounding of non-compoundable offence under section 13 Maharashtra Act.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Permission to compound cannot be severed; acquittal set aside for both offences.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "K. Chinnaswamy Reddy v. State of Andhra Pradesh",
      "citation": "1963 3 S.C.R. 412",
      "treatment": "followed",
      "relevance": "High Court can interfere with acquittal in revision where based on invalid compounding."
    },
    {
      "case_name": "State of Kerala v. Narayani Amma Kamala Devi",
      "citation": "1962 Supp. 3 S.C.R. 943",
      "treatment": "followed",
      "relevance": "High Court revisional jurisdiction exercisable suo motu."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Penal Code, 1860",
      "sections": [
        "Section 420"
      ],
      "relevance": "Compoundable with court permission; involved in charges."
    },
    {
      "name": "Maharashtra Ownership of Flats (Regulation of the Promotion of Construction, Sale, Management and Transfer) Act, 1963",
      "sections": [
        "Section 3(2)(a)",
        "Section 4",
        "Section 13"
      ],
      "relevance": "Promoter obligations for disclosure and registered agreements; offence under s.13 non-compoundable."
    },
    {
      "name": "Code of Criminal Procedure, 1898",
      "sections": [
        "Section 345(7)",
        "Section 439",
        "Section 4(o)"
      ],
      "relevance": "Limits on compounding; revisional powers of High Court."
    },
    {
      "name": "Indian Registration Act, 1908",
      "sections": [],
      "relevance": "Required registration of agreements for flats."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court dismissed the appeal against Bombay High Court order setting aside acquittal and directing trial magistrate to proceed with the cases from the stage of compounding.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "As the said offence was not compoundable with or without the permission of the court, the order of the trial magistrate in acquitting the accused because of the composition of the offences cannot be said to be in accordance with law.",
      "speaker": "court",
      "significance": "Core reason for upholding High Court interference."
    },
    {
      "text": "It is not permissible in such an event to sever the permission into two parts and to uphold it so far as the offence under section 420 IPC is concerned and hold it to be invalid in respect of the offence under section 13 of the Maharashtra Act.",
      "speaker": "court",
      "significance": "Rejects petitioner's severance argument."
    }
  ],
  "_case_id": "1972_433",
  "_label": 0,
  "_text_length": 13584,
  "_extracted_at": "2026-02-10T20:10:10.939584"
}