{
  "metadata": {
    "case_name": "Mohd. Subrati alias Mohd. Karim v. State of West Bengal",
    "case_year": 1972,
    "court": "Supreme Court of India",
    "judges": [
      "DUA, J."
    ],
    "case_number": "Writ Petition No. 307 of 1972",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Petitioner Mohd. Subrati alias Mohd. Karim detained in Burdwan Jail pursuant to order dated February 9, 1972 by District Magistrate, Burdwan under s.3(1) read with s.3(2) of Maintenance of Internal Security Act, 1971.",
      "type": "procedural",
      "date": "1972-02-09",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "District Magistrate satisfied that detention necessary to prevent petitioner from acting in manner prejudicial to maintenance of supplies and services essential to community.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f3",
      "text": "Grounds of detention served on petitioner at time of arrest on February 11, 1972.",
      "type": "procedural",
      "date": "1972-02-11",
      "source": "respondent"
    },
    {
      "id": "f4",
      "text": "On 6-1-72 at about 03.30 hrs. petitioner along with associates Teka Bahadur and Ganesh Das committed theft of electric copper wire about 1500 ft. at Hatgarui near Sen-Releigh Water Pump, P.S. Asansol, Dist. Burdwan, disrupting water and electric supply for about 8 hours.",
      "type": "disputed",
      "date": "1972-01-06",
      "source": "prosecution"
    },
    {
      "id": "f5",
      "text": "On 12-1-72 at about 04.00 hrs. petitioner along with associates Teka Bahadur and Ganesh Das committed theft of electric copper wire about 3000 ft. from electric poles at C Block, Sen Releigh Housing Colony, P.S. Asansol, Dist. Burdwan; when challenged by inhabitants, hurled bombs towards them, disrupting electric supply for more than 12 hours.",
      "type": "disputed",
      "date": "1972-01-12",
      "source": "prosecution"
    },
    {
      "id": "f6",
      "text": "Fact of detention order reported to State Government on February 9, 1972; approved by State on February 21, 1972; report to Central Government same day.",
      "type": "procedural",
      "date": "1972-02-09",
      "source": "respondent"
    },
    {
      "id": "f7",
      "text": "Petitioner produced before and heard by Advisory Board on April 10, 1972; Board gave decision same day.",
      "type": "procedural",
      "date": "1972-04-10",
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "Petitioner's representation received by State Government on March 16, 1972; considered on March 22, 1972; detention confirmed on May 5, 1972 and communicated same day.",
      "type": "procedural",
      "date": "1972-03-16",
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "Two cases under s.379 IPC registered at Asansol PS: Case No.16 dated 6th January 1972 and Case No.20 dated 12th January 1972; witnesses under s.161 CrPC reluctant to depose due to fear; Investigating Officer submitted final report suspecting petitioner and associates.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f10",
      "text": "Counter-affidavit incorrectly stated State approval on February 18, 1972; actually drafted February 19, signed February 21, 1972.",
      "type": "background",
      "date": "1972-02-21",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the order of detention is mala fide and liable to be quashed because criminal cases under s.379 IPC failed due to witness reluctance, and criminal trial is the only course open to the State.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Order of detention is mala fide because two cases for theft of copper wires under s.379 IPC were registered but witnesses reluctant to depose for fear of life; Investigating Officer submitted final report suspecting petitioner; criminal trial only course, detention incompetent if trial fails.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Preventive detention under the Act is distinct from criminal trial; failure of prosecution does not render detention mala fide; grounds relevant to maintenance of supplies essential to community.",
      "supporting_facts": [
        "f4",
        "f5"
      ],
      "legal_basis": "Maintenance of Internal Security Act, 1971 s.3"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Act provides for preventive detention to prevent prejudicial acts; distinct from punishment for offences; existing laws inadequate, hence need for preventive detention even if criminal conviction not possible.",
      "addresses_issue": "i1",
      "key_observation": "Detention order cannot be challenged merely because person liable to be tried for offences or proceedings under CrPC could be initiated."
    },
    {
      "id": "cr2",
      "text": "Jurisdiction under Act based on subjective satisfaction for future prevention; not barred by unsuccessful judicial trial; precedents confirm failure to prosecute does not make detention mala fide.",
      "addresses_issue": "i1",
      "key_observation": "Past activities relevant for detention even if not provable in court."
    },
    {
      "id": "cr3",
      "text": "Grounds clear, relevant, germane: theft of copper wires disrupted essential supplies; hurling bombs when challenged; falls within s.3 for preventing prejudicial acts to supplies/services.",
      "addresses_issue": "i1",
      "key_observation": "Conduct prejudicial to maintenance of supplies and services essential to community."
    },
    {
      "id": "cr4",
      "text": "Personal liberty not absolute; subject to reasonable restrictions for society; State must place all facts truly in counter-affidavit.",
      "addresses_issue": "i1",
      "key_observation": "Incorrect date in counter-affidavit noted, but does not vitiate detention."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Preventive detention under Maintenance of Internal Security Act, 1971 is for preventing future prejudicial acts and distinct from criminal prosecution; failure of criminal cases due to witness fear does not render detention mala fide.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Sahib Singh Dugal v. Union of India",
      "citation": "1966 1 S.C.R. 313",
      "treatment": "followed",
      "relevance": "Dropping criminal proceedings due to insufficient evidence does not make detention mala fide; past activities justify detention."
    },
    {
      "case_name": "Mohd. Salim Khan v. C.C. Bose",
      "citation": "1972 2 S.C.C. 607",
      "treatment": "followed",
      "relevance": "Similar view on distinction between trial and preventive detention."
    },
    {
      "case_name": "Borjahan Gorey v. State of West Bengal",
      "citation": "1972 2 S.C.C. 550",
      "treatment": "followed",
      "relevance": "Preventive detention invocable even if evidence insufficient for judicial proof but raises suspicion of repetition."
    },
    {
      "case_name": "Arun Kumar v. State of West Bengal",
      "citation": "A.I.R. 1972 S.C. 1858",
      "treatment": "referred",
      "relevance": "Personal liberty not absolute."
    },
    {
      "case_name": "Sasti Chowdhary v. State of West Bengal",
      "citation": "A.I.R. 1972 S.C. 1668",
      "treatment": "referred",
      "relevance": "Personal liberty not absolute."
    }
  ],
  "statutes_cited": [
    {
      "name": "Maintenance of Internal Security Act, 1971",
      "sections": [
        "s.3(1)",
        "s.3(2)",
        "s.3(3)"
      ],
      "relevance": "Empowers detention to prevent acts prejudicial to maintenance of supplies and services essential to community."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 32"
      ],
      "relevance": "Basis for writ petition of habeas corpus."
    },
    {
      "name": "Indian Penal Code",
      "sections": [
        "s.379"
      ],
      "relevance": "Theft cases registered against petitioner."
    },
    {
      "name": "Code of Criminal Procedure",
      "sections": [
        "s.161"
      ],
      "relevance": "Witnesses examined but reluctant to depose."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Writ petition for habeas corpus challenging detention order dismissed; detention held valid and not mala fide; court corrected incorrect approval date in counter-affidavit but found no vitiation.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"The detention order in such a case cannot be challenged on the ground that the person ordered to be detained was liable to be tried for the commission of the offence or offences...\"",
      "speaker": "court",
      "significance": "Core holding distinguishing preventive detention from criminal trial."
    },
    {
      "text": "\"It may not be possible to obtain a conviction for a particular offence but the authorities may still be justified in ordering detention of a person in view of his past activities...\"",
      "speaker": "court",
      "significance": "From Sahib Singh Dugal, rejecting mala fides argument."
    },
    {
      "text": "\"The right to personal liberty of an individual is jealously protected by our Constitution but this liberty is not absolute...\"",
      "speaker": "court",
      "significance": "Balances individual liberty with societal interests."
    }
  ],
  "_case_id": "1972_452",
  "_label": 0,
  "_text_length": 16673,
  "_extracted_at": "2026-02-10T20:10:14.988347"
}