{
  "metadata": {
    "case_name": "Commissioner of Income Tax v. Assessee",
    "case_year": 1969,
    "court": "Supreme Court of India",
    "judges": [
      "Hegde, J."
    ],
    "case_number": "Civil Appeal No. 2016 of 1969",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The assessee respondent was a member of a Hindu undivided family which carried on money lending business in India and abroad. In the course of such money lending business, properties were taken over in settlement of debts as and when occasion arose.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The family was disrupted on March 28, 1939. The assessee received some shares in some companies, properties and gardens and certain other items in Malaya.",
      "type": "material",
      "date": "1939-03-28",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Even after the partition the assessee continued the money lending business in Malaya.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "During the war, in general with others, the assessee suffered damages to these properties on account of Japanese bombing. This loss occurred on account of bombing in December, 1941, a date falling within the accounting period ending on April 12, 1942, relevant for the assessment year 1942-43. The loss was Rs. 1,93,750/- and was a loss of stock-in-trade.",
      "type": "material",
      "date": "1941-12",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "This loss was claimed as a business loss.",
      "type": "procedural",
      "date": null,
      "source": "assessee"
    },
    {
      "id": "f6",
      "text": "The Income Tax Officer rejected that claim.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "The Appellate Assistant Commissioner affirmed the order of the Income Tax Officer.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "The assessee did not succeed before the Tribunal. The Tribunal rejected the claim of the assessee on the sole ground that bombing, which caused the loss, was not incidental to the business of the assessee. The Tribunal held that the loss in question was a loss of stock-in-trade. That finding of the Tribunal has not been challenged.",
      "type": "procedural",
      "date": null,
      "source": "tribunal"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "whether on the facts and in the circumstances of the case, the loss of Rs. 1,93,750/- was an allowable deduction under section 10 of the Income-tax Act?",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "the loss in question cannot be given deduction to, as a business loss, in computing the net income of the assessee under section 10(1). According to the department that was not a loss incidental to the business carried on by the assessee.",
      "supporting_facts": [
        "f4",
        "f8"
      ],
      "legal_basis": "Section 10(1) of the Indian Income Tax, 1922"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The loss was a business loss allowable under section 10.",
      "supporting_facts": [
        "f1",
        "f2",
        "f3",
        "f4"
      ],
      "legal_basis": "Section 10 of the Income-tax Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "It is established that the assessee was carrying on business in Malaya when the war was going on. Malaya was within the war zone and, therefore, there was every possibility of that area being bombed. If the assessee had earned any profits out of his business during the war, the department undoubtedly would have considered those profits as assessable income. It is strange that when loss had occurred in such a situation the department should contend that the loss in question was not a business loss. In our opinion, taking into consideration the facts and circumstances of the case, the loss occurred must be held to be a loss incidental to the business carried on by the assessee in Malaya during the war.",
      "addresses_issue": "i1",
      "key_observation": "Loss incidental to business as symmetric to profits in war zone."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The loss must be held to be a loss incidental to the business carried on by the assessee in Malaya during the war and allowable as a deduction under section 10(1).",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Pohoomal Bros. v. Commissioner of Income-Tax, Bombay City",
      "citation": "34 I.T.R. 64",
      "treatment": "followed",
      "relevance": "Facts similar; losses from destruction of stock-in-trade by enemy invasion held trading losses."
    },
    {
      "case_name": "Commissioner of Income Tax, U.P. v. Nainital Bank Ltd.",
      "citation": "55 I.T.R. 707",
      "treatment": "referred",
      "relevance": "Cited Pohoomal Bros. with approval."
    },
    {
      "case_name": "Green v. J. Gliksten",
      "citation": "14 Tax Cases 364",
      "treatment": "referred",
      "relevance": "Insurance receipt for destroyed stock is trading receipt; conversely, loss is trading loss."
    },
    {
      "case_name": "London Investment and Mortgage Co., Ltd. v. Inland Revenue Commissioners",
      "citation": "1957 1 All England Reports 377",
      "treatment": "referred",
      "relevance": "Compensation for war damage to stock-in-trade is trading receipt; conversely, loss by enemy action is trading loss."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income Tax, 1922",
      "sections": [
        "Section 10(1)",
        "Section 66(1)"
      ],
      "relevance": "Loss claimed as allowable deduction under section 10(1); reference under section 66(1)."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Court agreed with the conclusions reached by the High Court that the loss was incidental to business and allowable as deduction under section 10(1). The appeal was dismissed with costs.",
    "relief_granted": "Loss of Rs. 1,93,750/- held allowable as business loss deduction.",
    "costs": "Dismissed with costs"
  },
  "key_quotes": [
    {
      "text": "If the assessee had earned any profits out of his business during the war, the department undoubtedly would have considered those profits as assessable income. It is strange that when loss had occurred in such a situation the department should contend that the loss in question was not a business loss.",
      "speaker": "court",
      "significance": "Highlights symmetry between profits and losses in war zone for tax purposes."
    },
    {
      "text": "taking into consideration the facts and circumstances of the case, the loss occurred must be held to be a loss incidental to the business carried in by the assessee in Malaya during the war.",
      "speaker": "court",
      "significance": "Core holding on allowability of the loss."
    }
  ],
  "_case_id": "1972_372",
  "_label": 0,
  "_text_length": 7697,
  "_extracted_at": "2026-02-10T20:09:49.742787"
}