{
  "metadata": {
    "case_name": "Writ Petition No. 270 of 1972",
    "case_year": 1972,
    "court": "Supreme Court of India",
    "judges": [
      "RAY, J."
    ],
    "case_number": "Writ Petition No. 270 of 1972",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Petitioner is a citizen of India and permanent resident of the State of Jammu & Kashmir.",
      "type": "background",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f2",
      "text": "On 2 June 1970, petitioner made an application to the District Magistrate, Jammu for permission to start a weekly paper in English from Jammu and gave a list of 11 names in order of preference, with first preference Blitzkrieg.",
      "type": "procedural",
      "date": "1970-06-02",
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "On 9 February 1971, petitioner made a declaration under section 5 of the Act giving particulars of the newspaper, title Blitzkrieg, language English, periodicity weekly.",
      "type": "procedural",
      "date": "1971-02-09",
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "On 23 April 1971, petitioner made a second declaration due to changes: day of publication shifted from Saturday to Tuesday, and name of printing press changed.",
      "type": "procedural",
      "date": "1971-04-23",
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "District Magistrate authenticated the declaration under section 6 of the Act.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "First issue of petitioner's weekly paper published on 20 March 1971.",
      "type": "material",
      "date": "1971-03-20",
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "In July 1971, petitioner served with notice dated 7 July 1971 asking to show cause by 8 August 1971 why declaration dated 23 April 1971 should not be cancelled as title Blitzkrieg similar to Blitz published from Bombay.",
      "type": "procedural",
      "date": "1971-07-07",
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "On 16 July 1971, petitioner learned from notice dated 13 July 1971 served on Keeper of Printing Press that declaration cancelled by order dated 8 July 1971.",
      "type": "procedural",
      "date": "1971-07-16",
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "Petitioner alleges District Magistrate's displeasure with petitioner.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f10",
      "text": "District Magistrate cancelled declaration on 8 July 1971 before show cause date of 8 August 1971.",
      "type": "procedural",
      "date": "1971-07-08",
      "source": "petitioner"
    },
    {
      "id": "f11",
      "text": "In affidavit, District Magistrate alleged typing error in notice date (8 August instead of 8 July?), withdrew notice by order dated 8 November 1971 and served fresh notice to show cause by 20 November 1971.",
      "type": "procedural",
      "date": "1971-11-08",
      "source": "respondent"
    },
    {
      "id": "f12",
      "text": "Petitioner obtained rule on 2 August 1971.",
      "type": "procedural",
      "date": "1971-08-02",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "During pendency, District Magistrate issued another notice dated 9 November 1971 asking petitioner to show cause why declaration should not be cancelled.",
      "type": "procedural",
      "date": "1971-11-09",
      "source": "respondent"
    },
    {
      "id": "f14",
      "text": "District Magistrate stated title Blitzkrieg inadvertently cleared.",
      "type": "admitted",
      "date": null,
      "source": "respondent"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the order dated 8 July 1971 cancelling petitioner's declaration under section 8B of the Press Registration of Books Act 1867 is valid, particularly as no opportunity to show cause was given and titles Blitzkrieg and Blitz are different.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the cancellation violates petitioner's fundamental right to carry on occupation, trade or business.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Order dated 8 July 1971 is violative of fundamental rights to carry on occupation, trade or business; cancellation hasty without opportunity despite one month's time given; titles Blitz and Blitzkrieg are different.",
      "supporting_facts": [
        "f9",
        "f10",
        "f14"
      ],
      "legal_basis": "Article 19(1)(g) of Constitution; section 8B of Press Registration of Books Act 1867"
    },
    {
      "id": "pa2",
      "text": "District Magistrate acted due to displeasure with petitioner.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Title Blitzkrieg is same as or similar to Blitz published from Bombay, justifying cancellation under section 8B; date in notice was typing error.",
      "supporting_facts": [
        "f7",
        "f11",
        "f14"
      ],
      "legal_basis": "Section 8B of Press Registration of Books Act 1867"
    },
    {
      "id": "ra2",
      "text": "Petitioner has right of appeal under section 8C; no fundamental right infringed.",
      "supporting_facts": [],
      "legal_basis": "Section 8C of Press Registration of Books Act 1867"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Cancellation under section 8B requires notice, opportunity to show cause, enquiry, hearing; here no opportunity given despite notice providing time till 8 August, order passed on 8 July; typing error explanation shows haste.",
      "addresses_issue": "i1",
      "key_observation": "No opportunity was given to the petitioner."
    },
    {
      "id": "cr2",
      "text": "Titles Blitzkrieg and Blitz are different; petitioner gave Blitzkrieg as first preference out of 11, authenticated by Magistrate; inadvertent clearance not a ground for cancellation.",
      "addresses_issue": "i1",
      "key_observation": "Blitz and Blitzkrieg were different titles."
    },
    {
      "id": "cr3",
      "text": "Cancellation infringes petitioner's fundamental right to carry on occupation of editor and business of publishing newspaper.",
      "addresses_issue": "i2",
      "key_observation": "The petitioners fundamental right to carry on the occupation of editor of newspaper as well as business of publishing a newspaper is infringed by the illegal act."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Order of District Magistrate dated 8 July 1971 cancelling declaration is quashed as wrongful, hasty, without opportunity.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Notice dated 9 November 1971 also quashed.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Press Registration of Books Act 1867",
      "sections": [
        "Section 5",
        "Section 6",
        "Section 8B",
        "Section 8C"
      ],
      "relevance": "Declaration requirements, authentication, grounds and procedure for cancellation of declaration"
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 32"
      ],
      "relevance": "Original jurisdiction for enforcement of fundamental rights"
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "The Supreme Court quashed the District Magistrate's order dated 8 July 1971 cancelling the petitioner's declaration and the subsequent notice dated 9 November 1971, holding the cancellation wrongful, hasty and without opportunity, infringing fundamental rights.",
    "relief_granted": "Quashing of cancellation order dated 8 July 1971 and notice dated 9 November 1971",
    "costs": "No order as to costs"
  },
  "key_quotes": [
    {
      "text": "The cancellation was wrongful. It was hasty. No opportunity was given to the petitioner.",
      "speaker": "court",
      "significance": "Core finding on procedural violation under section 8B"
    },
    {
      "text": "Blitz and Blitzkrieg were different titles. So they are.",
      "speaker": "court",
      "significance": "Rejects similarity ground for cancellation"
    },
    {
      "text": "The petitioners fundamental right to carry on the occupation of editor of newspaper as well as business of publishing a newspaper is infringed by the illegal act.",
      "speaker": "court",
      "significance": "Establishes violation of fundamental rights"
    }
  ],
  "_case_id": "1972_482",
  "_label": 1,
  "_text_length": 6251,
  "_extracted_at": "2026-02-10T20:10:15.669392"
}