{
  "metadata": {
    "case_name": "Harish Uppal v. Union of India",
    "case_year": 1972,
    "court": "Supreme Court of India",
    "judges": [
      "ALAGIRISWAMI, J."
    ],
    "case_number": "Writ Petition No. 456 of 1972",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Petitioner was an officer of the Indian Army who served in Bangla Desh. On 11th December, 1971 he was in a place called Hajiganj.",
      "type": "background",
      "date": "1971-12-11",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Petitioner was tried before the Summary General Court Martial on the charge of committing robbery at Hajiganj by causing fear of instant hurt to the Custodian of the United Bank Ltd., of certain properties belonging to the Bank and also the personal property of the Manager of the Bank as well as of a Chowkidar of the Bank.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The Court sentenced the petitioner to be cashiered.",
      "type": "procedural",
      "date": "1972-03-09",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Maj-Gen. Hira, General Officer Commanding, 23 Mountain Division, passed an order directing the revision of the sentence.",
      "type": "procedural",
      "date": "1972-05-03",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Petitioner was brought before the same Court Martial, asked whether he wanted to address the Court, replied in the negative.",
      "type": "procedural",
      "date": "1972-05-15",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Court Martial revoked earlier sentence and sentenced petitioner to be cashiered and to suffer rigorous imprisonment for two years.",
      "type": "procedural",
      "date": "1972-05-15",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Brig. D. P. Bhilla, Officiating General Officer Commanding 23 Mountain Division, referred finding and sentence for confirmation to Chief of the Army Staff, who confirmed it.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Petitioner had once been convicted under Army Act Section 41(2) for disobeying a lawful command and severely reprimanded on 13 June 1970.",
      "type": "background",
      "date": "1970-06-13",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Summary General Court Martial convened by Maj-Gen. Hira.",
      "type": "procedural",
      "date": "1972-03-09",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the confirming authority can direct revision of sentence to enhance it indirectly, as power to enhance not conferred.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether Court Martial's verdict should be unfettered and confirming authority should have given hearing before directing revision.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether confirmation can be made only by the officer who convened the Court Martial and not by a different officer.",
      "framed_by": "petitioner"
    },
    {
      "id": "i4",
      "text": "Whether the officer who finally confirmed the sentence should have heard the petitioner.",
      "framed_by": "petitioner"
    },
    {
      "id": "i5",
      "text": "Whether principles of natural justice violated by the order directing revision.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Authority to confirm sentence does not confer power to enhance sentence; cannot achieve indirectly by directing revision.",
      "supporting_facts": [
        "f3",
        "f4",
        "f6"
      ],
      "legal_basis": "Army Act Chapter XII"
    },
    {
      "id": "pa2",
      "text": "Court Martial's verdict should be unfettered; confirming authority should have given hearing to affected party.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Confirmation can be made only by officer who convened Court Martial, not by different officer.",
      "supporting_facts": [
        "f9",
        "f7"
      ],
      "legal_basis": "Army Act Section 157"
    },
    {
      "id": "pa4",
      "text": "Officer who finally confirmed sentence should have heard petitioner; Brig. Bhilla and Chief of Army Staff should have given hearing.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": null
    },
    {
      "id": "pa5",
      "text": "Order directing revision compelled Court Martial to enhance sentence, against natural justice.",
      "supporting_facts": [
        "f4",
        "f6"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Confirming authority can direct revision under Section 160; this implies consideration that original sentence inadequate, consistent with Section 158 allowing mitigation but implying power to revise upwards via court.",
      "addresses_issue": "i1",
      "key_observation": "To object to direction for revision is to object to Section 158 itself."
    },
    {
      "id": "cr2",
      "text": "Reasons given by Maj-Gen. Hira for inadequacy cannot be excepted to; court cannot go into evidence.",
      "addresses_issue": "i1",
      "key_observation": "Under Article 136, no interference with Armed Forces tribunals; under Article 32, only if Article 21 violated, which it was not."
    },
    {
      "id": "cr3",
      "text": "No violation of natural justice; petitioner given opportunity to address court on revision and declined; confirming authority not required to hear before directing revision.",
      "addresses_issue": "i2",
      "key_observation": "Petitioner could have pointed out errors to court martial."
    },
    {
      "id": "cr4",
      "text": "Officer is the authority; different officer can confirm if competent; Brig. Bhilla was officiating GOC same division.",
      "addresses_issue": "i3",
      "key_observation": "Analogy to Article 311; practical necessity if convening officer transferred."
    },
    {
      "id": "cr5",
      "text": "No requirement under Act for confirming authority to hear before confirmation; petitioner could petition under Section 164 but did not.",
      "addresses_issue": "i4",
      "key_observation": "Cannot import CrPC procedures to court martial."
    },
    {
      "id": "cr6",
      "text": "No analogy to Kraipak or Purtabpore; rules of natural justice depend on facts; here procedure followed, discretion left to court martial.",
      "addresses_issue": "i5",
      "key_observation": "Court martial could have reaffirmed original sentence."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Confirming authority's power to direct revision under Section 160 valid and does not violate natural justice.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "No hearing required by confirming authority before directing revision; opportunity given at revision stage sufficient.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Confirmation not limited to convening officer; any competent authority superior can confirm.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    },
    {
      "id": "h4",
      "text": "No hearing required by final confirming authority before confirmation.",
      "resolves_issue": "i4",
      "in_favor_of": "respondent"
    },
    {
      "id": "h5",
      "text": "Principles of natural justice not violated.",
      "resolves_issue": "i5",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "A. K. Kraipak Ors. etc. v. Union of India Ors.",
      "citation": "1970 1 S.C.R. 457",
      "treatment": "referred",
      "relevance": "Rules of natural justice depend on facts and framework; no violation here."
    },
    {
      "case_name": "Purtabpore Co. Ltd. v. Cane Commissioner of Bihar Ors.",
      "citation": "1969 2 S.C.R. 807",
      "treatment": "distinguished",
      "relevance": "Authority must apply mind; here confirming authority did."
    }
  ],
  "statutes_cited": [
    {
      "name": "Army Act",
      "sections": [
        "153",
        "157",
        "158",
        "160",
        "112",
        "69",
        "41(2)",
        "164"
      ],
      "relevance": "Govern confirmation, revision, and procedure for court martial; fully followed."
    },
    {
      "name": "Indian Penal Code",
      "sections": [
        "392"
      ],
      "relevance": "Charge of robbery contrary to this section."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "32",
        "21",
        "136",
        "311"
      ],
      "relevance": "Petition under 32; procedure under 21 followed; no interference under 136 with armed forces tribunals."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Court rejected all contentions of the petitioner, upheld the revision and confirmation of the sentence by the Army authorities, finding no violation of fundamental rights or natural justice.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "Under the provisions of Article 136 of the Constitution this Court cannot grant special leave in respect of any judgment, determination or order passed or made by any court or tribunal constituted by or under any law relating to the Armed Forces.",
      "speaker": "court",
      "significance": "Limits scope of judicial review over court martial."
    },
    {
      "text": "To object to this is to object to the provisions of section 158 itself.",
      "speaker": "court",
      "significance": "Justifies power to direct upward revision via court martial."
    },
    {
      "text": "The punishment of Cashiering, therefore, awarded for the offence appears to be palpably lenient.",
      "speaker": "court",
      "significance": "Quotes confirming authority's reason for revision."
    }
  ],
  "_case_id": "1972_455",
  "_label": 0,
  "_text_length": 20585,
  "_extracted_at": "2026-02-10T20:10:19.815975"
}