{
  "metadata": {
    "case_name": "State of Tamil Nadu v. Publishers of Text-books",
    "case_year": 1971,
    "court": "Supreme Court of India",
    "judges": [
      "Jaganmohan Reddy, J."
    ],
    "case_number": "C.A. No. 557 to 575 of 1971",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "22 Writ Petitions filed in the High Court of Madras by publishers of text-books for Government Schools, District Board and Municipal Council Schools challenging the directions of the Deputy Secretary to Government Education Department contained in his D.O. letter No. 454582/E5/69, Education, dated 12th August 1969, addressed to District Collectors and Local Board authorities that they should intimate to the publishers of the books which are prescribed for the year 1969-70 that after the end of the School year they will no longer be prescribed.",
      "type": "procedural",
      "date": "1969-08-12",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "A Division Bench of the High Court allowed the Writ Petitions by judgment and order dated September 3, 1970.",
      "type": "procedural",
      "date": "1970-09-03",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "19 appeals before Supreme Court by certificate from the High Court decision.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Government of Tamil Nadu intending to publish text-books through the Tamil Nadu Text Books Corporation pursuant to policy to nationalise text-books for schools.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Impugned D.O. letter issued in furtherance of nationalisation policy.",
      "type": "material",
      "date": "1969-08-12",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Writ Petitions raise similar grounds; averments in Writ Petition No. 768/70 adopted as typical.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Under Madras Educational Rules and Text-Book Committee Rules made under Article 162, text-books once approved and selected remain current for three years.",
      "type": "background",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "Cancellation without notice and hearing causes heavy financial loss to publishers.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f9",
      "text": "Madras Education Rules (Rule 58): Consolidated list of text-books authorised published annually; Managers at liberty to select from latest list; text-books not to be changed within three years except with approval; Government reserves right to forbid or prescribe use of any book.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Text-Book Committee Rules issued November 26, 1965: Book approved retains approval for five years; text-books selected only from approved list except Government books; Director retains right to prescribe books not approved by Committee.",
      "type": "admitted",
      "date": "1965-11-26",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the impugned D.O. letter is illegal and void as contrary to Madras Educational Rules and Text-Book Committee Rules made under Article 162.",
      "framed_by": "respondent"
    },
    {
      "id": "i2",
      "text": "Whether the directions violate fundamental rights under Article 19(1)(g) by jeopardising publishers' business.",
      "framed_by": "respondent"
    },
    {
      "id": "i3",
      "text": "Whether policy of nationalisation of text-books is illegal without authority of law under Article 19(6).",
      "framed_by": "respondent"
    },
    {
      "id": "i4",
      "text": "Whether principles of natural justice violated by cancelling prescription without notice and hearing.",
      "framed_by": "respondent"
    },
    {
      "id": "i5",
      "text": "Whether rules confer any enforceable right or representation on publishers that books once prescribed remain for three years.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Madras Education Rules and Text Book Committee Rules are administrative instructions, not conferring any right on publishers; no representation or assurance that books once prescribed will not be changed for three years.",
      "supporting_facts": [
        "f9",
        "f10"
      ],
      "legal_basis": "Article 162"
    },
    {
      "id": "pa2",
      "text": "Rules conceived in public interest to avoid hardship to students, not to safeguard publishers; Government has liberty to change, delete or add to list or prescribe unapproved books.",
      "supporting_facts": [
        "f9",
        "f10"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Impugned letter issued in exercise of power reserved under the rules; no estoppel as no representation made to publishers.",
      "supporting_facts": [
        "f5",
        "f9"
      ],
      "legal_basis": null
    },
    {
      "id": "pa4",
      "text": "High Court adopted contradictory positions; publishers bear risk of unsold books.",
      "supporting_facts": [
        "f1"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Impugned letter contrary to rules under Article 162; violates Article 19(1)(g) by bringing business to standstill.",
      "supporting_facts": [
        "f1",
        "f7",
        "f8"
      ],
      "legal_basis": "Article 19(1)(g), Article 162"
    },
    {
      "id": "ra2",
      "text": "Nationalisation policy illegal without law enabling monopoly under Article 19(6).",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": "Article 19(6)"
    },
    {
      "id": "ra3",
      "text": "Violation of natural justice: cancellation without notice/hearing after three-year prescription period.",
      "supporting_facts": [
        "f7",
        "f8"
      ],
      "legal_basis": null
    },
    {
      "id": "ra4",
      "text": "Rules hold out assurance; Government estopped from resiling; publisher relies on three-year period for business planning.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Rules are administrative instructions for departmental guidance, not conferring rights on publishers; conceived in public interest to protect students from frequent changes.",
      "addresses_issue": "i5",
      "key_observation": "No warrant for concluding rules hold out representation or assurance to publishers."
    },
    {
      "id": "cr2",
      "text": "Government reserves right to forbid or prescribe books; impugned letter within this power.",
      "addresses_issue": "i1",
      "key_observation": "Period of continuance is injunction to school managers, not assurance to publishers."
    },
    {
      "id": "cr3",
      "text": "No estoppel as no representation made to publishers; selection implies fitness, not undertaking to prescribe or guarantee sales.",
      "addresses_issue": "i4",
      "key_observation": "Publishers bear risk of unsold stock."
    },
    {
      "id": "cr4",
      "text": "High Court erred in holding rules bind Government as representation; distinguishes cases like Indo-Afghan where scheme created obligations.",
      "addresses_issue": "i5",
      "key_observation": "Rules do not confer rights or estop Government."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Madras Education Rules and Text Book Committee Rules confer no rights on publishers and do not estop Government from changing prescribed text-books.",
      "resolves_issue": "i5",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Impugned D.O. letter validly issued under reserved powers in rules.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Union of India Ors v. Ms. Indo-Afghan Agencies Ltd.",
      "citation": "1968 2 S.C.R. 366",
      "treatment": "distinguished",
      "relevance": "Scheme created obligations; Government estopped where representation acted upon; not applicable here as no representation."
    },
    {
      "case_name": "Sankaranarayanan, etc. etc. v. The State of Kerala",
      "citation": "1971 2 S.C.R. 361",
      "treatment": "referred",
      "relevance": "Explains Indo-Afghan; no representation in that case."
    },
    {
      "case_name": "Narinderchand Hemraj and Ors. V. Lt. Governor, Union Territory, Himachal Pradesh Ors.",
      "citation": null,
      "treatment": "referred",
      "relevance": "No holding in Indo-Afghan that Government incompetent to change scheme; estoppel only if representation made."
    },
    {
      "case_name": "The State of Assam and Another v. Ajit Kumar Sharma and Others",
      "citation": null,
      "treatment": "followed",
      "relevance": "Rules for grant-in-aid did not entitle writ; analogous to administrative instructions not conferring rights."
    }
  ],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Article 162",
        "Article 19(1)(g)",
        "Article 19(6)",
        "Article 226"
      ],
      "relevance": "Rules traceable to executive power under Art 162; no violation of Art 19(1)(g)/(6); writ under Art 226 not maintainable."
    },
    {
      "name": "Madras Educational Rules",
      "sections": [
        "Rule 58"
      ],
      "relevance": "Administrative instructions; Government reserves power to control text-books."
    },
    {
      "name": "Text-Book Committee Rules",
      "sections": [
        "Rule 2",
        "Rule 30",
        "Rule 32"
      ],
      "relevance": "Administrative; approval for five years but no rights conferred; Director's power to prescribe."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Supreme Court holds that the rules are administrative instructions conceived in public interest, confer no rights on publishers, and do not estop the Government from issuing the impugned letter; High Court decision reversed implicitly through reasoning.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The rules... are in the nature of Departmental instructions and do not confer any right on the publishers. Nor are they... designed to safeguard the interests of the publishers but are conceived in public interest.",
      "speaker": "court",
      "significance": "Core holding rejecting publishers' claim of rights or estoppel."
    },
    {
      "text": "There is no warrant for concluding that the Madras Education Rules and the Text Book Committee Rules hold out any representation or even an assurance to the publishers.",
      "speaker": "court",
      "significance": "Rejects High Court's basis for estoppel."
    }
  ],
  "_case_id": "1972_26",
  "_label": 1,
  "_text_length": 16717,
  "_extracted_at": "2026-02-10T20:07:32.420028"
}