{
  "metadata": {
    "case_name": "Shri Kishun, Ram Bali, Jai Shri and Jattan v. State",
    "case_year": 1968,
    "court": "Supreme Court of India",
    "judges": [
      "Khanna, J."
    ],
    "case_number": "Criminal Appeal No. 273 of 1968",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "On February 13, 1964 about half an hour before sunset Bhagwati PW 3, who is aged about 11, and his sister's son Kolahal were playing guchhi in the Khalihan of Shri Kishun accused.",
      "type": "background",
      "date": "1964-02-13",
      "source": "prosecution"
    },
    {
      "id": "f2",
      "text": "Nandlal, son of Shri Kishun, came there and protested against the playing of the game of guchhi in his Khalihan, Nandlal also threw away in a neighboring field the paisa with which the game was being played. A scuffle then took place between Nandlal and Bhagwati.",
      "type": "background",
      "date": "1964-02-13",
      "source": "prosecution"
    },
    {
      "id": "f3",
      "text": "Seru deceased and Sadaphal PW 2 on coming to know of the aforesaid scuffle went to Shri Kishun's Khalihan and stopped the scuffle. Nandlal then began to weep and went to his house.",
      "type": "background",
      "date": "1964-02-13",
      "source": "prosecution"
    },
    {
      "id": "f4",
      "text": "Seru, Sadaphal, Bhagwati and Kolahal made a search for the paisa which had been thrown away by Nandlal but could not find it. They then left for their houses.",
      "type": "background",
      "date": "1964-02-13",
      "source": "prosecution"
    },
    {
      "id": "f5",
      "text": "When they reached in front of the house of one Suraj Mal, the four accused, who were armed with lathis, accosted them. The accused protested against the beating given to Shri Kishun's son Nandlal and at the same time, belaboured Seru and Sadaphal. Seru on receipt of injuries fell down on the ground and became unconscious.",
      "type": "material",
      "date": "1964-02-13",
      "source": "prosecution"
    },
    {
      "id": "f6",
      "text": "On alarm being raised, Sada Shiva PW 4 and Bajaram PW 5 reached there, whereupon the accused ran away.",
      "type": "material",
      "date": "1964-02-13",
      "source": "prosecution"
    },
    {
      "id": "f7",
      "text": "Sadaphal PW carried Seru on a cot to police station Deoria. On the way Seru was put in a riksha. The party then went to police station Beoria where first information report was lodged by Sadaphal PW at 7.05 p.m. the same evening.",
      "type": "procedural",
      "date": "1964-02-13",
      "source": "prosecution"
    },
    {
      "id": "f8",
      "text": "Seru and Sadaphal were then directed to go to the hospital for medical examination. Seru, however, died on the way.",
      "type": "material",
      "date": "1964-02-13",
      "source": "prosecution"
    },
    {
      "id": "f9",
      "text": "Post mortem examination on the dead body of Seru was performed by Dr. C. D. Agarwal on February 14, 1964. The following five injuries were found on the body of Seru: Contused wound 1X-1/2 bone on top of head with swelling on the forehead. Contused wound I X 1/2 bone, front of right leg middle. Interrupted abrasion 2 X 3/4 front of right leg. Ecchymosis on right upper and lower eye lid 1/2 x 3/4. Swelling on left temporal region 2-1/2 X 2. Death was due to shock and haemorrhage as a result of the head injury.",
      "type": "material",
      "date": "1964-02-14",
      "source": "prosecution"
    },
    {
      "id": "f10",
      "text": "Sadaphal PW on examination by Dr. Nagrath was found to have seven simple injuries caused with blunt weapon like lathi.",
      "type": "material",
      "date": "1964-02-13",
      "source": "prosecution"
    },
    {
      "id": "f11",
      "text": "At the trial the plea of the appellants was that a she buffalo belonging to Seru had trespassed into the field of Shri Kishun accused. Jattan accused caught hold of the she buffalo and was taking it to the cattle pond when Seru and Sadaphal made an effort to snatch the she buffalo. They also assaulted Jattan with lathis. On alarm having been raised by Jattan, Jai Shri reached there and both of them used their lathis in self-defence.",
      "type": "disputed",
      "date": "1964-02-13",
      "source": "petitioner"
    },
    {
      "id": "f12",
      "text": "Evidence was led in defence to show that Jattan accused on being examined on February 18, 1964 was found to have two injuries on his person.",
      "type": "disputed",
      "date": "1964-02-18",
      "source": "petitioner"
    },
    {
      "id": "f13",
      "text": "The High Court in maintaining the conviction of the accused appellants relied upon the evidence of four eye witnesses, Sadaphal PW 2, Bhagwati PW 3, Sada Shiva PW 4 and Rajaram PW 5.",
      "type": "procedural",
      "date": "1967-12-15",
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "The prosecution evidence does not indicate as to which of the accused appellants had given the fatal blow to Seru.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f15",
      "text": "There did not exist any previous enmity between the accused on the one hand and Seru deceased on the other.",
      "type": "admitted",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f16",
      "text": "Ram Bali and Jattan accused are brothers. Likewise, Shri Kishun and Jai Shri accused are brothers and are the nephew of Ram Bali and Jattan.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f17",
      "text": "Shri Kishun, Ram Bali, Jai Shri and Jattan were convicted by learned Sessions Judge Ballia under section 302 read with section 34 Indian Penal Code for causing the death of Seru aged 45 and under section 323 read with section 34 Indian Penal Code for causing injuries to Sadaphal PW 2, and were sentenced to undergo imprisonment for life on the former count and rigorous imprisonment for a period of one year on the latter count. The sentences in the case of each accused were ordered to run concurrently.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f18",
      "text": "On appeal the High Court of Allahabad affirmed the order of the trial court... In the result, the appeal was dismissed.",
      "type": "procedural",
      "date": "1967-12-15",
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "whether the offence disclosed was murder or culpable homicide not amounting to murder or some lesser offence.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "whether the case against the accused falls under section 325 read with section 34 Indian Penal Code and not under section 302 read with section 34 Indian Penal Code.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The case against the accused falls under section 325 read with section 34 Indian Penal Code and not under section 302 read with section 34 Indian Penal Code.",
      "supporting_facts": [
        "f11",
        "f12",
        "f14",
        "f15"
      ],
      "legal_basis": "Section 325/34 IPC"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Supported the judgment of the High Court affirming conviction under section 302/34 IPC.",
      "supporting_facts": [
        "f1",
        "f2",
        "f3",
        "f4",
        "f5",
        "f6",
        "f7",
        "f8",
        "f9",
        "f10",
        "f13"
      ],
      "legal_basis": "Section 302/34 IPC"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "There was no previous enmity between the accused-appellants on the one hand and Seru deceased and Sadaphal PW on the other. The occurrence was the off-shoot of a trifling incident in the nature of a scuffle between two urchins. Nandlal, it appears then went weeping and told his father that he had been beaten by Seru and Sadaphal. The four accused thereupon protested to Seru and Sadaphal for the beating given to Nandlal and also belaboured them with lathis.",
      "addresses_issue": "i1",
      "key_observation": "No previous enmity, sudden fight over child's scuffle."
    },
    {
      "id": "cr2",
      "text": "Five injuries were caused to Seru. Apart from the one injury on the head, which proved fatal, the other injuries were not of a very serious nature. Sadaphal had seven injuries all of which were simple in nature.",
      "addresses_issue": "i1",
      "key_observation": "Injuries mostly not serious except one fatal head injury."
    },
    {
      "id": "cr3",
      "text": "The prosecution evidence, as observed by the High Court, does not indicate as to which one of the accused-appellants inflicted the fatal blow on the head of Seru. As such, none of the accused can be held to be personally liable for the fatal injury. The liability can only be vicarious under section 34 of the Indian Penal Code and, as such, we have to find out as to what was the common intention of the accused in furtherance, of which they caused injuries to Seru and Sadaphal.",
      "addresses_issue": "i1",
      "key_observation": "Unknown who gave fatal blow, so vicarious liability under s.34."
    },
    {
      "id": "cr4",
      "text": "The High Court has arrived at the following finding: 'There could, therefore, be no doubt that the common intention of the appellants was to give a severe beating to Seru and Sadaphal.' The above finding as well as the broad circumstances of the case go to show that the common intention of the accused was to cause grievous injury to the victim.",
      "addresses_issue": "i1",
      "key_observation": "Common intention to give severe beating, i.e., grievous hurt."
    },
    {
      "id": "cr5",
      "text": "The fact that one of them exceeded the bound and gave a fatal blow on the head of the deceased would make him personally liable for the fatal injury, but so far as the other three are concerned, they can be held liable only for the injuries which were caused in furtherance of the common intention and not for the fatal injury. As it is not possible on the material on record to find out as to which one of the accused gave the fatal blow, there is no escape from the conclusion that each one of the four accused can only be guilty of the offence under section 325 read with section 34 Indian Penal Code.",
      "addresses_issue": "i1",
      "key_observation": "Cannot identify fatal blow giver, so all guilty under 325/34 only."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Alter the conviction of each of the accused-appellants from under section 302 read with section 34 Indian Penal Code to that under s. 325 read with s. 34 Indian Penal Code.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Each of them is sentenced to undergo rigorous imprisonment for a period of five years on that count. The sentence of rigorous imprisonment for a period of one year awarded to each of the accused under section 323 read with section 34 Indian Penal Code would run concurrently with the above sentence.",
      "resolves_issue": "i2",
      "in_favor_of": "partial"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "302",
        "34",
        "323",
        "325"
      ],
      "relevance": "Conviction altered from 302/34 to 325/34; 323/34 upheld with concurrent sentence."
    }
  ],
  "outcome": {
    "disposition": "partially_accepted",
    "summary": "The Supreme Court allowed the appeal in part by altering the conviction of the four accused from section 302/34 IPC to section 325/34 IPC, sentencing each to five years' rigorous imprisonment, to run concurrently with the one-year sentence under section 323/34 IPC upheld from the trial court.",
    "relief_granted": "Conviction altered to lesser offence under s.325/34 IPC with reduced sentence of 5 years RI.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"There was no previous enmity between the accused-appellants on the one hand and Seru deceased and Sadaphal PW on the other. The occurrence was the off-shoot of a trifling incident in the nature of a scuffle between two urchins.\"",
      "speaker": "court",
      "significance": "Establishes sudden provocation without premeditation."
    },
    {
      "text": "\"The prosecution evidence... does not indicate as to which one of the accused-appellants inflicted the fatal blow on the head of Seru.\"",
      "speaker": "court",
      "significance": "Basis for vicarious liability only, not personal for murder."
    },
    {
      "text": "\"There could, therefore, be no doubt that the common intention of the appellants was to give a severe beating to Seru and Sadaphal.\"",
      "speaker": "lower_court",
      "significance": "High Court finding adopted to determine common intention as grievous hurt."
    }
  ],
  "_case_id": "1972_277",
  "_label": 1,
  "_text_length": 7923,
  "_extracted_at": "2026-02-10T20:09:07.956790"
}