{
  "metadata": {
    "case_name": "Ishwar Chandra v. Chancellor of Saugar University",
    "case_year": 1971,
    "court": "Supreme Court of India",
    "judges": [
      "Jaganmohan Reddy, J"
    ],
    "case_number": "Civil Appeal No. 243 of 1971",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appointment of Vice-Chancellor of Saugar University made by Chancellor under section 13 of University of Saugar Act, 1946 from panel of not less than three persons recommended by Committee constituted under sub-section (2).",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Committee constituted: G. K. Shinde (Retd. Chief Justice, Chairman, elected by Executive Council), Justice T. P. Naik (elected by Executive Council), Shri C. B. Agarwal (Retd. Judge, Allahabad High Court, nominated by Chancellor Rajmata Vijaya Raje Scindia).",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Meeting fixed at Indore on 4th April 1970; Justice Naik unable to attend; Shinde and Agarwal met and submitted panel.",
      "type": "material",
      "date": "1970-04-04",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Chancellor Rajmata Vijaya Raje Scindia appointed appellant Shri Ishwar Chandra as Vice-Chancellor w.e.f. 22nd June 1970 for five years on 7th April 1970.",
      "type": "material",
      "date": "1970-04-07",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Appellant was acting as Vice-Chancellor at the time of appointment.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "On 9th April 1970, Governor of Madhya Pradesh promulgated Ordinance No. I of 1970 making Governor ex officio Chancellor; Rajmata ceased to be Chancellor.",
      "type": "procedural",
      "date": "1970-04-09",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "On 23rd April 1970, Governor promulgated another Ordinance substituting section 43 and adding section 43A retrospectively.",
      "type": "procedural",
      "date": "1970-04-23",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Section 43: Question of due appointment referred to Chancellor, decision final.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Section 43A: Chancellor may review order of self or predecessor if not in accordance with Act etc., or improper.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "On 20th May 1970, Secretary to Governor wrote to appellant questioning legality of 4th April meeting with only two members present; show cause notice.",
      "type": "procedural",
      "date": "1970-05-20",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Appellant replied on 9th June 1970 (after extension) arguing validity of two-member recommendation, citing authorities and precedent of same Governor as Chancellor of Indore University.",
      "type": "procedural",
      "date": "1970-06-09",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "On 15th June 1970, Chancellor (Governor) cancelled appointment under section 43A as not in accordance with section 13; directed new committee.",
      "type": "material",
      "date": "1970-06-15",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Appellant filed Writ Petition in Madhya Pradesh High Court on 1st July 1970.",
      "type": "procedural",
      "date": "1970-07-01",
      "source": "court"
    },
    {
      "id": "f14",
      "text": "High Court on 3rd July 1970 directed production of correspondence between Chairman and members.",
      "type": "procedural",
      "date": "1970-07-03",
      "source": "court"
    },
    {
      "id": "f15",
      "text": "Appellant produced correspondence with affidavit on 25th July 1970.",
      "type": "procedural",
      "date": "1970-07-25",
      "source": "court"
    },
    {
      "id": "f16",
      "text": "High Court refused rule nisi on 3rd September 1970; rejected leave to appeal on 19th September 1970.",
      "type": "procedural",
      "date": "1970-09-03",
      "source": "court"
    },
    {
      "id": "f17",
      "text": "High Court stated (challenged as incorrect): Chairman first fixed Bhopal; appellant as working VC had access to documents.",
      "type": "disputed",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f18",
      "text": "Correspondence details: Chairman's letters/telegrams from Feb to March 1970 fixing dates/venues; Naik's responses preferring Saugar/Bhopal due to travel issues.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f19",
      "text": "Chairman explained health issues preventing travel to Bhopal; requested Naik to attend Indore or suggest names.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f20",
      "text": "Naik regretted inability to attend Indore on 4th April due to bumpy air travel; declined to suggest names by letter as unfair.",
      "type": "material",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the meeting of the Committee on 4th April 1970 with only two out of three members present was legal and the recommendation valid under section 13 of the Act.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the Chancellor's order cancelling the appointment under section 43A was valid.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether in absence of provision for quorum, presence of majority of members constitutes valid meeting.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Recommendation by two out of three members was valid; cited authorities and precedent of same Governor as Chancellor of Indore University maintaining similar selection.",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "No deliberate exclusion of Justice Naik; sufficient notice given to all members.",
      "supporting_facts": [
        "f18",
        "f19",
        "f20"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Meeting on 4th April 1970 with only two members not legal; recommendations invalid.",
      "supporting_facts": [
        "f10"
      ],
      "legal_basis": "Section 13 of University of Saugar Act, 1946"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "High Court wrongly assumed Chancellor concerned with exclusion attempt rather than mere absence of quorum; correspondence shows no deliberate exclusion, sufficient notice given.",
      "addresses_issue": "i2",
      "key_observation": "Chancellor's order based solely on two members present; no reference to exclusion in notice or order."
    },
    {
      "id": "cr2",
      "text": "In absence of rule/regulation on quorum, presence of majority (two out of three) constitutes valid meeting; well-recognised principle per Halsbury's Laws of England.",
      "addresses_issue": "i3",
      "key_observation": "Meeting legal; if one cannot attend despite notice, does not invalidate others' meeting."
    },
    {
      "id": "cr3",
      "text": "High Court dismissed writ in limine without proper appreciation; delved into correspondence on wrong grounds.",
      "addresses_issue": "i2",
      "key_observation": "Impugned order invalid."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Presence of majority members constitutes quorum and valid meeting where no provision specifies otherwise.",
      "resolves_issue": "i3",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Chancellor's cancellation order invalid; appellant's appointment valid.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h3",
      "text": "High Court's dismissal set aside.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Halsbury's Laws of England, Third Edition, Vol. IX, page 48, Para 95",
      "citation": null,
      "treatment": "referred",
      "relevance": "States that in absence of quorum provision, majority presence constitutes valid meeting."
    },
    {
      "case_name": "Precedent of same Governor as Chancellor of Indore University",
      "citation": null,
      "treatment": "referred",
      "relevance": "Maintained selection by predecessor in similar circumstances with two members."
    }
  ],
  "statutes_cited": [
    {
      "name": "University of Saugar Act, 1946",
      "sections": [
        "Section 13",
        "Section 43",
        "Section 43A"
      ],
      "relevance": "Governs appointment from panel by Committee of three; Chancellor decides validity finally and may review orders."
    },
    {
      "name": "Ordinance No. I of 1970",
      "sections": [
        "Section 2",
        "Section 3"
      ],
      "relevance": "Made Governor ex officio Chancellor; predecessor ceased office."
    },
    {
      "name": "Ordinance of 23rd April 1970",
      "sections": [
        "Section 2",
        "Section 3",
        "Section 4"
      ],
      "relevance": "Substituted section 43, added 43A retrospectively."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Supreme Court allowed the appeal by special leave, set aside the High Court's dismissal of the writ petition and the Chancellor's order cancelling the appointment, holding the two-member committee meeting valid and the appointment proper.",
    "relief_granted": "Appointment of appellant as Vice-Chancellor restored; Chancellor's cancellation quashed.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"If for one reason or the other one of them could not attend, that does not make the meeting of others illegal. In such circumstances, where there is no rule or regulation or any other provision for fixing the quorum, the presence of the majority of the members would constitute it a valid meeting\"",
      "speaker": "court",
      "significance": "Core holding on quorum."
    },
    {
      "text": "\"the impugned Order made by the Chancellor was based entirely on the legality of the meeting where only two out of three members were present\"",
      "speaker": "court",
      "significance": "Identifies basis of Chancellor's decision, rejecting High Court's assumption."
    }
  ],
  "_case_id": "1972_123",
  "_label": 1,
  "_text_length": 18372,
  "_extracted_at": "2026-02-10T20:08:23.499476"
}