{
  "metadata": {
    "case_name": "Sayeed-ur-Rahman v. Managing Committee of Araria Higher Secondary School & Ors.",
    "case_year": 1967,
    "court": "Supreme Court of India",
    "judges": [
      "Dua, J."
    ],
    "case_number": "Civil Appeal No. 1222 of 1967",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant, a teacher of Araria Higher Secondary School, was dismissed from service by the Managing Committee at a meeting held on February 27, 1958 on a charge of misappropriation of school money.",
      "type": "material",
      "date": "1958-02-27",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On appeal by the appellant, the President of the Board of Secondary Education set aside the order of dismissal by order dated April 22, 1960 and directed his reinstatement in service.",
      "type": "procedural",
      "date": "1960-04-22",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "By the same order dated April 22, 1960, direction given that the appellant should be paid full salary, dearness allowance and increment from the date of his suspension till the date of reinstatement after adjusting the amount already paid.",
      "type": "procedural",
      "date": "1960-04-22",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Managing Committee obeyed reinstatement but requested the President of the Board of Secondary Education to review the whole matter especially with regard to the payments for the period of suspension.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f5",
      "text": "President by order dated February 25, 1961 reviewed the matter and modified his earlier order dated April 22, 1960 by providing that the appellant would be entitled only to subsistence allowance for the period of his suspension.",
      "type": "procedural",
      "date": "1961-02-25",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Order dated February 25, 1961 conveyed by Secretary, Board of Secondary Education to District Education Officer in letter No. 2799-100-1 directing Managing Committee to treat period as suspension and pay subsistence allowance.",
      "type": "procedural",
      "date": "1961-02-25",
      "source": "respondent"
    },
    {
      "id": "f7",
      "text": "The order dated February 25, 1961 was made without affording the appellant any hearing.",
      "type": "procedural",
      "date": "1961-02-25",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Appellant made several representations to the President of the Board but reconsideration of the order dated February 25, 1961 was declined.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "Order reiterated by Secretary, Board of Secondary Education to appellant in communication No. 233/4A-97-58 dated January 18, 1964 that appellant entitled only to subsistence allowance during suspension period and order cannot be revised.",
      "type": "procedural",
      "date": "1964-01-18",
      "source": "respondent"
    },
    {
      "id": "f10",
      "text": "Order dated January 18, 1964 made without affording any hearing to the appellant.",
      "type": "procedural",
      "date": "1964-01-18",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Appellant filed application under Arts. 226 and 227 of the Constitution in Patna High Court contending President could not modify earlier order dated April 22, 1960 without giving adequate opportunity of being heard.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f12",
      "text": "Patna High Court dismissed writ petition by order dated September 3, 1965 relying on Liladhar Jha v. Board of Secondary Education holding President as appellate authority had no jurisdiction to order payment of arrears.",
      "type": "procedural",
      "date": "1965-09-03",
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "High Court held order dated April 22, 1960 directing full salary etc. invalid; further held question of no hearing in review order academic as appellant could get no relief.",
      "type": "procedural",
      "date": "1965-09-03",
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "Appeal by special leave to Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the President of the Board of Secondary Education could review and modify his earlier order dated April 22, 1960 without affording the appellant an opportunity of being heard.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether the Patna High Court ought to have declared the review orders invalid despite holding the original order dated April 22, 1960 invalid on jurisdictional grounds per Liladhar Jha.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Jurisdiction of President as appellate authority to direct payment of arrears of salary (per Liladhar Jha).",
      "framed_by": "lower_court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "President could not modify earlier order dated April 22, 1960 without giving adequate opportunity of being heard.",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": "Arts. 226 and 227 of the Constitution; principles of natural justice"
    },
    {
      "id": "pa2",
      "text": "High Court could not decline relief against review order as academic merely because original order held invalid; original order not challenged by petitioner; Managing Committee bound by Board's orders under r.18.",
      "supporting_facts": [
        "f12",
        "f13"
      ],
      "legal_basis": "r.18 of rules; S.5 Bihar High Schools Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Justified impugned order on reasons stated by High Court, relying on Liladhar Jha that President had no jurisdiction to order arrears.",
      "supporting_facts": [
        "f12"
      ],
      "legal_basis": "Liladhar Jha v. Board of Secondary Education"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "High Court ought to have declared invalid the orders dated February 25, 1961 and January 18, 1964 as made without hearing; unfair to deny relief as academic.",
      "addresses_issue": "i1",
      "key_observation": "Appellant entitled to quashing of review orders; Managing Committee may comply with them unless quashed."
    },
    {
      "id": "cr2",
      "text": "Parties relegated to stage prior to February 25, 1961; if Board reconsiders April 22, 1960 order, must afford hearing per natural justice and r.17.",
      "addresses_issue": "i2",
      "key_observation": "Right of hearing fundamental; applies to quasi-judicial authorities."
    },
    {
      "id": "cr3",
      "text": "No opinion on correctness of Liladhar Jha or merits of controversy or competence of review.",
      "addresses_issue": "i3",
      "key_observation": "Order not containing opinion on jurisdictional issue."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Review orders dated February 25, 1961 and January 18, 1964 invalid for lack of hearing; set aside High Court order.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "President must afford hearing if reconsidering April 22, 1960 order; natural justice applies.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Liladhar Jha v. Board of Secondary Education, Patna",
      "citation": "1963 B.L.J.R. 880",
      "treatment": "referred",
      "relevance": "Held President as appellate authority empowered only to direct reinstatement, no jurisdiction for arrears payment."
    }
  ],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Article 226",
        "Article 227"
      ],
      "relevance": "Basis for writ petition in High Court."
    },
    {
      "name": "Bihar High Schools (Control and Regulation of Administration) Act, 1960",
      "sections": [
        "Section 5",
        "Section 6"
      ],
      "relevance": "Managing Committee to obey Board directions; Board orders final."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; Patna High Court order dated September 3, 1965 and Board orders dated February 25, 1961 and January 18, 1964 set aside; parties relegated to pre-review stage; Board to reconsider request with hearing if deemed proper; appellant entitled to costs from contesting respondents.",
    "relief_granted": "Quashing of review orders; remand for fresh consideration with hearing; costs.",
    "costs": "Appellant entitled to costs from contesting respondents."
  },
  "key_quotes": [
    {
      "text": "It was incumbent on the High Court to declare as invalid, the order of the President of the Board of Secondary Education dated February 25, 1961 reviewing the earlier order dated April 22, 1960, without affording to the appellant any opportunity of being heard.",
      "speaker": "court",
      "significance": "Core holding on violation of natural justice."
    },
    {
      "text": "This unwritten right of hearing is fundamental to a just decision by any authority which decides a controversial issue affecting the rights of the rival contestants.",
      "speaker": "court",
      "significance": "Emphasizes principles of natural justice in quasi-judicial proceedings."
    }
  ],
  "_case_id": "1972_448",
  "_label": 1,
  "_text_length": 15663,
  "_extracted_at": "2026-02-10T20:10:20.114110"
}