{
  "metadata": {
    "case_name": "Appellant v. Respondents",
    "case_year": 1968,
    "court": "Supreme Court of India",
    "judges": [
      "Raj, J."
    ],
    "case_number": "Civil Appeal No. 2137 of 1968",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant filed shipping bill in triplicate on 26 July 1966 before Joint Chief Controller of Imports and Exports, Panaji, Goa for 10,160 metric tonnes of iron ore.",
      "type": "procedural",
      "date": "1966-07-26",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Export licence granted to appellant on 28 July 1966.",
      "type": "procedural",
      "date": "1966-07-28",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On 30 July 1966, agents of S.S. Ardenode applied to Assistant Collector of Customs, Marmagao for entry outwards to load iron ore; granted same day.",
      "type": "procedural",
      "date": "1966-07-30",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On 1 August 1966, appellant presented shipping bills dated 26 July 1966 to Customs authorities under section 50 of Customs Act 1962, with declaration as to truth of contents.",
      "type": "procedural",
      "date": "1966-08-01",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "On 1 August 1966, Customs authorities endorsed shipping bill: rotation No. 730, 'Let export after examination if necessary', E.F.No. 3/1/8/1966.",
      "type": "procedural",
      "date": "1966-08-01",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "On 2 August 1966, Customs authorities made further endorsements on shipping bill: 'PI as usual', 'checked des Inspected the lot-2-barges-checli des', 'Pd in full'.",
      "type": "procedural",
      "date": "1966-08-02",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "On 2 August 1966, Ministry of Commerce issued notification under section 4-A of Indian Tariff Act 1934 amending second schedule, introducing item 28 'lumpy iron ore' at Rs. 10 per tonne export duty.",
      "type": "material",
      "date": "1966-08-02",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "S.S. Ardenode arrived at Marmagao at 23.20 hours on 2 August 1966.",
      "type": "procedural",
      "date": "1966-08-02",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Vessel arrived at Marmagao Inner Harbour on 3 August 1966 at 07.50 hours; commenced loading cargo on 3 August 1966.",
      "type": "procedural",
      "date": "1966-08-03",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "9804.40 metric tonnes of iron ore shipped on S.S. Ardenode on 3 August 1966.",
      "type": "material",
      "date": "1966-08-03",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "On 28 January 1967, Customs authorities issued notice to appellant under section 28 of Customs Act notifying liability for export duty Rs. 98044 at Rs. 10 per metric tonne.",
      "type": "procedural",
      "date": "1967-01-28",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "On 19 April 1967, Customs authorities held appellant liable for duty, deeming shipping bill presented on 3 August 1966 per section 16(1) Customs Act.",
      "type": "procedural",
      "date": "1967-04-19",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Appellant filed Writ Petition No. 9 of 1967 under Article 226 before Judicial Commissioner, Goa, Daman and Diu, Panaji; upheld Customs order on 5 April 1968.",
      "type": "procedural",
      "date": "1968-04-05",
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Appeal by certificate to Supreme Court.",
      "type": "procedural",
      "date": "1968-04-05",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether shipment and export of iron ore by appellant became liable to export duty introduced by notification on 2 August 1966, having regard to provisions of section 16 of Customs Act 1962.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Shipping bill presented on 1 August 1966 and entry outwards granted prior to 2 August 1966; notification under section 4-A Indian Tariff Act 1934 not applicable; no duty payable per section 16 Customs Act.",
      "supporting_facts": [
        "f4",
        "f5",
        "f3"
      ],
      "legal_basis": "Section 16 Customs Act 1962; Section 4-A Indian Tariff Act 1934"
    },
    {
      "id": "pa2",
      "text": "Impeached vires of the notification.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Shipping bill deemed presented on date of vessel arrival (3 August 1966) as presented before entry outwards; liable for duty effective 2 August 1966.",
      "supporting_facts": [
        "f8",
        "f9",
        "f12"
      ],
      "legal_basis": "Section 16(1) Customs Act 1962"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Under section 16(1)(a) Customs Act, rate of duty applicable on date shipping bill presented under section 50; proviso: if presented before entry outwards, deemed presented on date of entry outwards.",
      "addresses_issue": "i1",
      "key_observation": "Entry outwards granted on 30 July/1 August 1966, prior to 2 August 1966 notification; shipping bill not deemed presented on arrival date."
    },
    {
      "id": "cr2",
      "text": "Sections 50 and 51 deal with entry and clearance for export; endorsements on 1 and 2 August permitted export; goods described as free.",
      "addresses_issue": "i1",
      "key_observation": "No provision in 1962 Act to deem presentation on vessel arrival date unlike 1878 Act."
    },
    {
      "id": "cr3",
      "text": "Customs authorities acted without jurisdiction by holding date of entry outwards as vessel arrival date.",
      "addresses_issue": "i1",
      "key_observation": "Order of entry outwards made prior to notification date."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Export not liable to duty introduced on 2 August 1966; appellant entitled to cancellation of notice dated 28 January 1967.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Customs Act, 1962",
      "sections": [
        "Section 16",
        "Section 28",
        "Section 39",
        "Section 50",
        "Section 51"
      ],
      "relevance": "Determines date for rate of duty, entry and clearance of export goods; shipping bill deemed presented on date of entry outwards if prior."
    },
    {
      "name": "Indian Tariff Act, 1934",
      "sections": [
        "Section 4-A"
      ],
      "relevance": "Power to amend schedule introducing export duty on iron ore effective 2 August 1966."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 226"
      ],
      "relevance": "Basis for writ petition challenging Customs order."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; judgment of Judicial Commissioner dated 5 April 1968 set aside; writ issued quashing notice dated 28 January 1967 and order of Assistant Collector dated 19 April 1967; respondents restrained from proceeding pursuant to notice.",
    "relief_granted": "Cancellation of demand for export duty Rs. 98044; quashing of notice and order.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The rate of duty and tariff valuation, if any, applicable to any export goods, shall be the rate and valuation in force- (a) in the case of goods entered for export under section 50, on the date on which a shipping bill... is presented...",
      "speaker": "court",
      "significance": "Quotes section 16 Customs Act central to determination of applicable duty date."
    },
    {
      "text": "For the foregoing reasons the appellant is entitled to an order cancelling the notice dated 28 January, 1967...",
      "speaker": "court",
      "significance": "Concludes in favour of appellant, resolving the controversy."
    }
  ],
  "_case_id": "1972_131",
  "_label": 1,
  "_text_length": 12757,
  "_extracted_at": "2026-02-10T20:08:19.039024"
}