{
  "metadata": {
    "case_name": "Excise Authorities v. Voltas Ltd.",
    "case_year": 1972,
    "court": "Supreme Court of India",
    "judges": [
      "Mathew, J."
    ],
    "case_number": "Civil Appeal No. 47 of 1972",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Voltas Ltd. is a company registered under the Companies Act carrying on business of manufacturing air conditioners, water coolers and component parts thereof.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Voltas organises sales from head office at Bombay and branch offices at Calcutta, Delhi, Madras, Bangalore, Cochin and Lucknow.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "From offices, Voltas effects direct sales to consumers at list prices, which come to about 90 to 95 per cent of its production during the relevant period.",
      "type": "admitted",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f4",
      "text": "Voltas sells articles to wholesale dealers from different parts of the country in pursuance of agreements containing terms similar to Exhibit A, providing that dealers sell at list prices fixed by Voltas, Voltas sells at list prices less 22 per cent discount, no discount on accessories, dealers give service to units sold in their territory.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Excise duty on ad valorem value imposed on air conditioners, water coolers and parts from March 1, 1961.",
      "type": "background",
      "date": "1961-03-01",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Voltas' case: list price after deducting 22 per cent discount to wholesale dealers constitutes wholesale cash price; accepted by excise authorities, assessments made up to end of 1962 on that basis.",
      "type": "admitted",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f7",
      "text": "In April 1964, Superintendent of Central Excise intimated that excise duty would be assessed on retail price basis, not wholesale cash price.",
      "type": "procedural",
      "date": "1964-04",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Superintendent passed three orders dated September 5, 1964 and one dated September 10, 1964, assessing Voltas to excise duty on list prices for sales to consumers for period January 1, 1963 to December 31, 1963.",
      "type": "procedural",
      "date": "1964-09-05",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Demand notice dated October 8, 1964 served on Voltas for Rs. 27,57,177.19.",
      "type": "procedural",
      "date": "1964-10-08",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Voltas filed appeal against orders; dismissed by 1st appellant on May 2, 1967.",
      "type": "procedural",
      "date": "1967-05-02",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Voltas filed writ petition before Bombay High Court challenging appellate order of May 2, 1967 and Assistant Collector's orders for 1962, 1964, 1965, 1966, and demand notice.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f12",
      "text": "Bombay High Court allowed the writ petition by judgment and order dated August 14, 17, 1970.",
      "type": "procedural",
      "date": "1970-08-14",
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Appeal to Supreme Court by certificate against High Court order.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the respondent was liable to be charged with excise duty on the basis of the price of retail sales made by it directly to the consumers from its head office and branch offices under clause (b) of s. 4 or whether it was liable to be charged on the basis of the price payable by the wholesale dealers, after deducting the 22 per cent discounts under clause (a) of s. 4 of the Central Excises and Salt Act 1944.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Agreements with wholesale dealers conferred certain extra-commercial advantages, so sales to them were not to independent purchasers but to favoured ones, and price charged would not represent wholesale cash price under s. 4(a).",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": "Section 4(a) of Central Excises and Salt Act 1944"
    },
    {
      "id": "pa2",
      "text": "S. 4(a) visualizes a wholesale market at place of manufacture where articles of like kind and quality are sold or could be sold to any wholesale purchaser; no such market existed as sales confined to favoured buyers.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": "Section 4(a)"
    },
    {
      "id": "pa3",
      "text": "\"Articles of a like kind and quality\" suggests goods other than those under assessment; disregard price fetched by the goods themselves.",
      "supporting_facts": [],
      "legal_basis": "Section 4(a)"
    },
    {
      "id": "pa4",
      "text": "Preponderance of High Court authority requires purchasers to be independent for wholesale sales.",
      "supporting_facts": [],
      "legal_basis": "National Tobacco Co. of India Ltd. v. Collector of Central Excise; Union of India v. Vengunta Suryaprakasa Rao; Amco Batteries P Ltd. v. Assistant Collector; Collector of Central Excise v. Shankarlal Agarwalla; Frizair Corporation v. Collector of Central Excise"
    },
    {
      "id": "pa5",
      "text": "22 per cent discount not trade discount; no evidence it was trade discount per Explanation to s.4.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": "Explanation to Section 4"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "List price after deducting 22 per cent discount allowed to wholesale dealers constitutes the wholesale cash price for ascertaining real value.",
      "supporting_facts": [
        "f4",
        "f6"
      ],
      "legal_basis": "Section 4(a)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "For wholesale market to exist, not necessary physical market or sales to independent buyers; potentiality of articles being sold wholesale suffices; sales to dealers under agreements conferring commercial advantages still wholesale sales.",
      "addresses_issue": "i1",
      "key_observation": "Sale to wholesale dealers did not cease to be wholesale merely because of agreements or exclusivity."
    },
    {
      "id": "cr2",
      "text": "Application of s.4(a) does not depend on sales of further articles of like kind; actual wholesale cash price of goods themselves suffices.",
      "addresses_issue": "i1",
      "key_observation": "Goods under assessment may be considered as members of their own class."
    },
    {
      "id": "cr3",
      "text": "Ford Motor Company case supports that sales to authorised dealers under agreements at discount is wholesale cash price under similar provision.",
      "addresses_issue": "i1",
      "key_observation": "Obligations like service do not render price less than wholesale cash price."
    },
    {
      "id": "cr4",
      "text": "High Court decisions requiring independent purchasers incorrect if agreements at arms length in usual course of business.",
      "addresses_issue": "i1",
      "key_observation": "Wholesale cash price based on arms length transactions; favoured buyer only if extra-commercial considerations."
    },
    {
      "id": "cr5",
      "text": "Quantum of wholesale sales irrelevant; 90-95% direct sales does not affect wholesale price of rest if arms length.",
      "addresses_issue": "i1",
      "key_observation": "Even few wholesale sales qualify under s.4(a)."
    },
    {
      "id": "cr6",
      "text": "Wholesale cash price means price paid by retail traders on wholesale purchase; essence is wholesale not retail sale.",
      "addresses_issue": "i1",
      "key_observation": "Cites Vacuum Oil: sales direct to consumers invoke s.4(b)."
    },
    {
      "id": "cr7",
      "text": "Excise on manufacturing cost plus profit, excludes post-manufacturing costs; price for delivery at factory gate.",
      "addresses_issue": "i1",
      "key_observation": "Cash price eliminates credit, transport charges."
    },
    {
      "id": "cr8",
      "text": "No contention before High Court that 22% discount not trade discount; argument proceeded on volume of sales, not discount nature.",
      "addresses_issue": "i1",
      "key_observation": "Trade discount is percentage deduction from list price."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Price for articles sold to wholesale dealers less 22% discount represents wholesale cash price under s.4(a); excise duty chargeable thereon.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Agreements at arms length in ordinary course constitute wholesale sales even with commercial advantages.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "22% discount is trade discount per Explanation to s.4.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Ford Motor Company of India Limited v. Secretary of State for India in Council",
      "citation": "65 Indian Appeals 32",
      "treatment": "followed",
      "relevance": "Sales to authorised dealers at discount under agreements is wholesale cash price under similar provision; obligations like service do not affect."
    },
    {
      "case_name": "Vacuum Oil Company v. Secretary of State for India in Council",
      "citation": "59 Indian Appeals 258",
      "treatment": "followed",
      "relevance": "Wholesale cash price means price to retail traders on wholesale purchase; direct consumer sales invoke alternative clause."
    },
    {
      "case_name": "National Tobacco Co. of India Ltd. v. Collector of Central Excise",
      "citation": "A.I.R. 1961 Calcutta 477",
      "treatment": "distinguished",
      "relevance": "Held sales to stockists not wholesale market if not to any purchaser; court disagrees if arms length."
    },
    {
      "case_name": "Union of India v. Vengunta Suryaprakasa Rao",
      "citation": "A.I.R. 1967 Andhra Pradesh 281",
      "treatment": "distinguished",
      "relevance": "Sales to distributors under agreements not wholesale cash price; misappreciates Ford Motor."
    },
    {
      "case_name": "Amco Batteries P Ltd. Bangalore v. Assistant Collector, Central Excise",
      "citation": "A.T.R. 1963 Mysore 216",
      "treatment": "distinguished",
      "relevance": "Wholesale market requires sales to independent buyers without restriction."
    },
    {
      "case_name": "Collector of Central Excise v. Shankarlal Agarwalla",
      "citation": "A.I.R. 1968 Calcutta 154",
      "treatment": "distinguished",
      "relevance": "Wholesale market habitual sales to anybody wishing purchase."
    },
    {
      "case_name": "Frizair Corporation v. Collector of Central Excise",
      "citation": "1969 II Andhra Weekly Reporter 57",
      "treatment": "distinguished",
      "relevance": "Sale to favoured buyer not wholesale market."
    },
    {
      "case_name": "Union of India v. Delhi Cloth and General Mills",
      "citation": "1963 Supp. 1 S.C.R. 586",
      "treatment": "referred",
      "relevance": "Excise tax on production and manufacture of goods."
    }
  ],
  "statutes_cited": [
    {
      "name": "Central Excises and Salt Act 1944",
      "sections": [
        "Section 4",
        "Section 4(a)",
        "Section 4(b)"
      ],
      "relevance": "Defines value for duty as wholesale cash price under (a) or alternative under (b); no abatement except trade discount and duty."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court upheld the Bombay High Court's order allowing the writ petition, holding that the price at which Voltas sold to wholesale dealers less 22% discount was the wholesale cash price under Section 4(a), and excise duty was chargeable thereon, not on retail prices to consumers.",
    "relief_granted": "Writ petition allowed as per High Court; assessments on wholesale price basis upheld.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"A wholesale market does not always mean that there should be an actual place where articles are sold and bought on a wholesale basis. These words can also mean the potentiality of the articles being sold on a wholesale basis.\"",
      "speaker": "court",
      "significance": "Defines 'wholesale market' broadly, rejecting need for physical market or independent buyers."
    },
    {
      "text": "\"If a manufacturer were to enter into agreements with dealers for wholesale sales of the articles manufactured on certain terms and conditions, it would not follow from that alone that the price for those sales would not be the wholesale cash price for the purpose of s. 4(a) of the Act if the agreements were made at arms length and in the usual course of business.\"",
      "speaker": "court",
      "significance": "Key holding on arms length agreements qualifying as wholesale cash price."
    },
    {
      "text": "\"Excise is a tax on the production and manufacture of goods.\"",
      "speaker": "court",
      "significance": "Explains basis for excluding post-manufacturing costs from assessable value."
    }
  ],
  "_case_id": "1972_603",
  "_label": 0,
  "_text_length": 23120,
  "_extracted_at": "2026-02-10T20:11:03.934558"
}