{
  "metadata": {
    "case_name": "Appellant (Lecturer) v. Managing Committee of Jai Narain College",
    "case_year": 1972,
    "court": "Supreme Court of India",
    "judges": [
      "Mathew, J."
    ],
    "case_number": "C.A. No. 2 of 1972",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The appellant joined the service of the college as lecturer in 1946.",
      "type": "background",
      "date": "1946",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The appellant was promoted to the post of Head of the Department of Zoology in 1959.",
      "type": "background",
      "date": "1959",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On the basis of certain complaints against him received by the Manager of the College, charges were framed against him and his explanation was called for.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The appellant submitted an explanation to the charges.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The explanation was found not to be satisfactory and the Managing Committee passed a resolution on 12-11-1967 for removal of the appellant from service.",
      "type": "material",
      "date": "1967-11-12",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The appellant filed a writ petition before the High Court of Allahabad, Lucknow Bench, challenging the validity of the resolution dated 12-11-1967 terminating his services.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "A learned single judge of the High Court found that in terminating the services, the Managing Committee acted in violation of principles of natural justice, quashed the resolution and allowed the writ petition.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "The Managing Committee appealed against the single judge's order in Special Appeal No. 1074 of 1968.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "A Division Bench of the Allahabad High Court found that the relationship between the College and the appellant was that of master and servant, that even if terminated in breach of audi alteram partem rule, remedy was suit for damages not writ under Article 226, and that no principle of natural justice was violated as opportunity to submit explanation was given; set aside single judge order and dismissed writ petition on April 13, 1970.",
      "type": "procedural",
      "date": "1970-04-13",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Appeal preferred by special leave to Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "The appellant had entered into an agreement when employed; Clause 5 provided that during probation or thereafter, services could be dispensed with without notice if Managing Committee satisfied of misconduct etc., provided opportunity given to give explanation before decision.",
      "type": "admitted",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the appellant had a statutory status or the relationship was pure master-servant, such that writ under Article 226 lies against termination of services.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether services were terminated in violation of principles of natural justice or relevant statutes/ordinances under Lucknow University Act, 1920.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether Statutes 151, 152, 153 framed under Lucknow University Act, 1920 confer statutory force independent of the contract.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The appellant had a statutory status, services terminated in violation of provisions of statutes under Lucknow University Act, 1920; High Court wrong in concluding no writ/certiorari lies.",
      "supporting_facts": [
        "f6",
        "f10"
      ],
      "legal_basis": "Lucknow University Act, 1920; Statutes 151,152,153; Article 226"
    },
    {
      "id": "pa2",
      "text": "The appellant was not given a reasonable opportunity of defending himself against the charges.",
      "supporting_facts": [
        "f3",
        "f4",
        "f5"
      ],
      "legal_basis": "Principles of natural justice"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Relationship between College and appellant was master-servant; even if breach of audi alteram partem, remedy is suit for damages, not writ under Article 226.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "No principle of natural justice violated as appellant given opportunity of submitting explanation to charges.",
      "supporting_facts": [
        "f3",
        "f4"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "In pure master-servant cases, no specific performance of contract of service; termination effective even if wrongful, remedy damages; does not depend on hearing servant.",
      "addresses_issue": "i1",
      "key_observation": "Courts do not ordinarily enforce specific performance of contracts of service."
    },
    {
      "id": "cr2",
      "text": "Where statutory restriction on dismissal or element of public employment/office/status, procedural requirements may apply; but here no such element.",
      "addresses_issue": "i1",
      "key_observation": "No element of public employment, nothing in nature of office or status capable of protection."
    },
    {
      "id": "cr3",
      "text": "Statutes 151 etc. under Lucknow University Act require terms incorporated in contract; have no proprio vigore force of law unless embodied in agreement; breach is contractual, not statutory.",
      "addresses_issue": "i3",
      "key_observation": "Terms in Statute 151 become conditions only by incorporation in contract; no independent legal force."
    },
    {
      "id": "cr4",
      "text": "Clause 5 of contract provides opportunity to explain, which was given; no mandatory statutory procedure violated.",
      "addresses_issue": "i2",
      "key_observation": "Opportunity given as per contract."
    },
    {
      "id": "cr5",
      "text": "Distinguishes Prabhakar case as there College Code had independent force of law; here statutes do not.",
      "addresses_issue": "i3",
      "key_observation": "No third exception in S.R. Tewari applies as no breach of mandatory statutory obligation by statutory body."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Relationship is pure contract of master-servant; no writ lies under Article 226 to quash termination even if in breach of contract; remedy is suit for damages.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Statutes 151,152,153 do not confer statutory status or independent procedural rights; terms effective only via contract.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Executive Committee of U.P. State Warehousing Corporation Ltd. v. Chandra Kiran Tyagi",
      "citation": "1970 2 S.C.R 250",
      "treatment": "followed",
      "relevance": "Courts do not enforce specific performance of service contracts absent special circumstances."
    },
    {
      "case_name": "Indian Airlines Corporation v. Sukhdeo Rai",
      "citation": "A.I.R. 1971 S.C. 1828",
      "treatment": "followed",
      "relevance": "No declaration that service contract subsists in absence of special circumstances."
    },
    {
      "case_name": "Ridge v. Baldwin",
      "citation": "1965 Weekly Law Reports, Vol 1, 79",
      "treatment": "followed",
      "relevance": "In pure master-servant, termination valid even without hearing; remedy damages."
    },
    {
      "case_name": "Vidyodaya University v. Silva",
      "citation": "1964 3 All E.R. 865",
      "treatment": "followed",
      "relevance": "University teacher under statute holds ordinary contract, no right to hearing."
    },
    {
      "case_name": "Malloch v. Aberdeen Corporation",
      "citation": "1971 1 W.L.R. 1578",
      "treatment": "referred",
      "relevance": "If public element/office/status, natural justice may apply; distinguishes as no such here."
    },
    {
      "case_name": "S. R. Tewari v. District Board, Agra",
      "citation": "1964 3 S.C.R. 55",
      "treatment": "followed",
      "relevance": "Exceptions to no-declaration rule: public servant under Art 311, industrial law, statutory body breaching mandatory obligation."
    },
    {
      "case_name": "Prabhakar Ramakrishna Jodh v. A. Pande",
      "citation": "1965 2 S.C.R. 713",
      "treatment": "distinguished",
      "relevance": "College Code had force of law independent of contract; here statutes do not."
    }
  ],
  "statutes_cited": [
    {
      "name": "Lucknow University Act, 1920",
      "sections": [
        "Statutes 151",
        "Statute 152",
        "Statute 153"
      ],
      "relevance": "Govern appointment/termination terms for teachers in associated colleges; terms must be in contract, no independent force."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 226",
        "Article 311"
      ],
      "relevance": "Writ jurisdiction; protection for public servants."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court upheld the Division Bench's dismissal of the writ petition, holding that the termination was under a pure contract of service without statutory status or violation attracting writ remedy; appellant's remedy lies in suit for damages.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"It is well settled that, when there is a purported termination of a contract of service, a declaration that the contract of service still subsisted would not be made in the absence of special circumstances.\"",
      "speaker": "court",
      "significance": "Core principle applied to deny reinstatement."
    },
    {
      "text": "\"One may accept that if there are relationships in which all requirements of the observance of rules of natural justice are excluded... these must be confined to what have been called pure master and servant cases.\"",
      "speaker": "court",
      "significance": "From Malloch, explaining when natural justice applies."
    },
    {
      "text": "\"The terms and conditions of service mentioned in Statute 151 have proprio vigore no force of law. They become terms and conditions of service only by virtue of their being incorporated in the contract.\"",
      "speaker": "court",
      "significance": "Distinguishes from Prabhakar; key to holding."
    }
  ],
  "_case_id": "1972_10",
  "_label": 0,
  "_text_length": 18930,
  "_extracted_at": "2026-02-10T20:06:53.044751"
}