{
  "metadata": {
    "case_name": "Jugal Kishore v. State",
    "case_year": 1969,
    "court": "Supreme Court of India",
    "judges": [
      "Khanna, J."
    ],
    "case_number": "Criminal Appeal No. 46 of 1969",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant and five others from village Mandil, District Gaya, tried before Additional Sessions Judge Gaya for offences under sections 147, 148, 307, 323, 307 read with section 149 IPC and section 25 Arms Act.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Appellant Jugal Kishore convicted under section 326 read with section 149 IPC and sentenced to 5 years RI; also under section 148 IPC to 2 years RI, to run concurrently.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f3",
      "text": "Patna High Court, by judgment dated January 22, 1968, in Criminal Appeal No. 116 of 1966, acquitted two accused, maintained appellant's conviction under 326/149 and 148 IPC, reduced sentence under 326/149 to 3 years RI, maintained 148 sentence.",
      "type": "procedural",
      "date": "1968-01-22",
      "source": "lower_court"
    },
    {
      "id": "f4",
      "text": "Post High Court judgment, application made for appellant to be dealt under Probation of Offenders Act as below 21 years at trial conviction; rejected by High Court order dated December 12, 1968, as offence punishable with life imprisonment.",
      "type": "procedural",
      "date": "1968-12-12",
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "High Court certified case fit for Supreme Court appeal under Article 134(1)(c) Constitution, involving applicability of Probation of Offenders Act.",
      "type": "procedural",
      "date": "1968-12-10",
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "On October 14, 1964 at about 10 a.m., while Madho Saran getting field No. 1678 ploughed by Rakshya Mahto, appellant and Raghu questioned Madho for cutting ridge between 1678 and appellant's field 1719.",
      "type": "background",
      "date": "1964-10-14",
      "source": "prosecution"
    },
    {
      "id": "f7",
      "text": "Madho Saran narrated to brother Sadho Saran; they with others came out, met accused party of about 30 persons near barrage.",
      "type": "material",
      "date": "1964-10-14",
      "source": "prosecution"
    },
    {
      "id": "f8",
      "text": "Hira Lal (armed with gun) fired shot hitting Sadho Saran on head; Sadho fell, other accused including appellant (armed with garasa) caused further injuries to Sadho and companions with sharp-edged and blunt weapons.",
      "type": "disputed",
      "date": "1964-10-14",
      "source": "prosecution"
    },
    {
      "id": "f9",
      "text": "Injured taken to Jehanabad Hospital; doctor informed police, Sub-Inspector recorded Madho Saran's statement; Nand Kishore (one of accused) lodged report at police station.",
      "type": "material",
      "date": "1964-10-14",
      "source": "prosecution"
    },
    {
      "id": "f10",
      "text": "Appellant stated age 19 years under Section 342 CrPC; argued on assumption appellant less than 21 at trial conviction.",
      "type": "admitted",
      "date": null,
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether appellant, less than 21 years on date of trial court conviction for offence under section 326 read with section 149 IPC, can claim benefit of section 6 Probation of Offenders Act, 1958.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Offence under section 326/149 IPC punishable not only with imprisonment for life but also with imprisonment up to 10 years; thus benefit of section 6 Probation Act invocable.",
      "supporting_facts": [
        "f10",
        "f2"
      ],
      "legal_basis": "Section 6 Probation of Offenders Act, 1958; Section 326 read with 149 IPC"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Offence punishable with imprisonment for life; provisions of Probation of Offenders Act cannot be invoked.",
      "supporting_facts": [
        "f2",
        "f3",
        "f4"
      ],
      "legal_basis": "Section 6 Probation of Offenders Act, 1958; Section 326 read with 149 IPC"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Section 6(1) applies to persons under 21 found guilty of offence punishable with imprisonment but not with imprisonment for life; plain reading excludes offences punishable with life imprisonment even if lesser term also possible.",
      "addresses_issue": "i1",
      "key_observation": "Imprisonment for life can be awarded under 326/149 IPC; ignoring 'but not with imprisonment for life' would make words otiose."
    },
    {
      "id": "cr2",
      "text": "Policy of Act: prevent youthful offenders associating with hardened criminals; but excludes very serious offences punishable with life imprisonment.",
      "addresses_issue": "i1",
      "key_observation": "Offences like 326/149 or 409 IPC not eligible even if lesser punishment possible."
    },
    {
      "id": "cr3",
      "text": "Som Nath Puri v. State of Rajasthan followed: section 409 IPC (punishable with life or up to 10 years) excludes section 4 Probation Act.",
      "addresses_issue": "i1",
      "key_observation": "Similar exclusion under section 6."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Appellant not entitled to benefit of section 6 Probation of Offenders Act as convicted of offence under section 326/149 IPC punishable with imprisonment for life.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Som Nath Puri v. State of Rajasthan",
      "citation": null,
      "treatment": "followed",
      "relevance": "Conviction under section 409 IPC (punishable with life or up to 10 years) excludes Probation Act section 4; analogous to section 6."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "147",
        "148",
        "307",
        "323",
        "326",
        "149"
      ],
      "relevance": "Offences for which accused tried and convicted; 326/149 punishable with life imprisonment."
    },
    {
      "name": "Probation of Offenders Act, 1958",
      "sections": [
        "3",
        "4",
        "6",
        "18"
      ],
      "relevance": "Section 6 excludes offenders under 21 guilty of offences punishable with life imprisonment; object to reform youthful offenders except serious cases."
    },
    {
      "name": "Arms Act",
      "sections": [
        "25"
      ],
      "relevance": "One of offences tried."
    },
    {
      "name": "Code of Criminal Procedure",
      "sections": [
        "342"
      ],
      "relevance": "Appellant's statement on age."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "134(1)(c)"
      ],
      "relevance": "Basis for appeal certificate."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal dismissed; appellant not entitled to Probation of Offenders Act benefit as offence under section 326/149 IPC punishable with life imprisonment.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"When any person under twenty-one years of age is found guilty of having committed an offence punishable with imprisonment but not with imprisonment for life...\"",
      "speaker": "court",
      "significance": "Direct quote of section 6(1) Probation Act central to interpretation."
    },
    {
      "text": "\"Plain reading of section 6 makes it manifest that it deals with persons under twenty-one years of age who are found guilty of having committed an offence punishable with imprisonment but not with imprisonment for life.\"",
      "speaker": "court",
      "significance": "Court's key interpretation rejecting appellant's contention."
    },
    {
      "text": "\"As the offence of criminal breach of trust under section 409, I.P.C. is punishable with imprisonment for life, the High Court... was right because the provisions of section 4 are only applicable to a case of a person found guilty of having committed an offence not punishable with death or imprisonment for life.\"",
      "speaker": "court",
      "significance": "Quote from Som Nath Puri precedent applied analogously."
    }
  ],
  "_case_id": "1972_312",
  "_label": 0,
  "_text_length": 11337,
  "_extracted_at": "2026-02-10T20:09:03.066682"
}