{
  "metadata": {
    "case_name": "Smt. Prabhawati Devi v. Dr. Pritam Kaur",
    "case_year": 1971,
    "court": "Supreme Court of India",
    "judges": [
      "Hegde, J."
    ],
    "case_number": "Civil Appeal No. 1813 of 1971",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The appellant is a tenant occupying premises belonging to the respondent.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The respondent applied to the District Magistrate, Dehradun (Rent Controller), under S. 3 of the U.P. Temporary Control of Rent and Eviction Act, 1947 for permission to sue the appellant for eviction.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Permission was granted by the Rent Controller.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Appellant filed revision to the Commissioner, Meerut Division, who affirmed the Rent Controller's order on March 30, 1965 in revision No. 13.",
      "type": "procedural",
      "date": "1965-03-30",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Appellant filed revision to the State Government on April 2, 1965; State Government passed stay order pending consideration.",
      "type": "procedural",
      "date": "1965-04-02",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Appellant sent copy of revision petition to Minister for Irrigation, who forwarded it noting appellant is very old tenant.",
      "type": "procedural",
      "date": "1965-04-02",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "State Government allowed the revision on June 14, 1966, revoking permission under S.3, stating expedient in ends of justice.",
      "type": "procedural",
      "date": "1966-06-14",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Respondent filed writ under Art. 226 before Allahabad High Court challenging State Government order.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "High Court allowed petition on February 28, 1967, quashed State Government order dated 14-6-1966, directed rehearing under S.7-F according to law, with costs.",
      "type": "procedural",
      "date": "1967-02-28",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "On February 29, 1967 (next day), respondent filed suit for eviction of appellant.",
      "type": "procedural",
      "date": "1967-02-29",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Ramesh Puri wrote letter on May 16, 1966 to Minister for Food and Civil Supplies recommending appellant's case.",
      "type": "background",
      "date": "1966-05-16",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "State Government dismissed revision as infructuous due to institution of civil suit, relying on High Court decision.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Appellant filed writ petition before Allahabad High Court challenging State Government dismissal; High Court dismissed, holding stay lapsed and revision infructuous.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Appeal by special leave to Supreme Court from High Court judgment dated February 5, 1971 in Special Appeal No. 1116 of 1969.",
      "type": "procedural",
      "date": "1971-02-05",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the revision petition before the State Government became infructuous upon institution of the eviction suit filed by respondent immediately after High Court directed rehearing.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the stay order passed by State Government revived upon High Court setting aside its order and directing rehearing.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "High Court order setting aside State Government order and directing rehearing revived the interim stay order; suit was premature and cannot frustrate High Court direction.",
      "supporting_facts": [
        "f9",
        "f10"
      ],
      "legal_basis": "Bankim Chandra v. Chandi Prasad (Patna HC); Tavvale Veeraswami v. Pulim Ramanna (Madras HC); Saranatha Aiyangar v. Muthiah Mooppanar (Madras HC); Sushila Bali Dasi v. Guest Keen Williams Ltd. (Calcutta HC)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Revision petition became infructuous upon institution of suit for eviction, as per High Court decisions; State Government competent to dismiss on that ground.",
      "supporting_facts": [
        "f10",
        "f12"
      ],
      "legal_basis": "Bhagwan Das v. Paras Nath; Mohammad Ismail v. Nanney Lal"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "No party can frustrate court decision by trickery; High Court order required State Government to decide afresh on permission, precluding respondent from filing suit till then; suit premature and does not bar State Government from proceeding.",
      "addresses_issue": "i1",
      "key_observation": "Respondent cannot obstruct implementation of direction given at her instance."
    },
    {
      "id": "cr2",
      "text": "Powers under Act exercised judicially; criticized multi-tier executive process causing prolonged litigation; noted extraneous influences like ministerial notes.",
      "addresses_issue": "i1",
      "key_observation": "State Government order lacked reasons, influenced by irrelevant considerations."
    },
    {
      "id": "cr3",
      "text": "No need to decide revival of stay, as appeal succeeds on broader ground of prematurity.",
      "addresses_issue": "i2",
      "key_observation": "High Court direction implies no suit till revision disposed."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Suit filed by respondent was premature and does not render revision infructuous; State Government must dispose of revision according to law.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Shri Bhagwan v. Ramachand",
      "citation": "1965 3 S.C.R. 218",
      "treatment": "followed",
      "relevance": "Powers under Act are judicial"
    },
    {
      "case_name": "Bhagwan Das v. Paras Nath",
      "citation": "1969 2 S.C.R. 297",
      "treatment": "referred",
      "relevance": "Suit after permission not affected by later S.7-F order"
    },
    {
      "case_name": "Mohammad Ismail v. Nanney Lal",
      "citation": "1969 3 S.C.R. 894",
      "treatment": "referred",
      "relevance": "Suit after permission not affected by later S.7-F order"
    }
  ],
  "statutes_cited": [
    {
      "name": "U.P. Temporary Control of Rent and Eviction Act, 1947",
      "sections": [
        "Section 3",
        "Section 7-E",
        "Section 7-F"
      ],
      "relevance": "Permission for eviction required; revision to Commissioner and State Government"
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 226"
      ],
      "relevance": "Writ petition challenging State Government order"
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; High Court order dismissing writ and State Government order dismissing revision set aside; State Government directed to restore and dispose revision within four months; respondent may seek stay of suit proceedings.",
    "relief_granted": "Restoration and expeditious disposal of revision petition; liberty to stay suit.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"No party to a litigation can be permitted to frustrate the decision rendered by having recourse to trickery.\"",
      "speaker": "court",
      "significance": "Core holding on prematurity of suit"
    },
    {
      "text": "\"The true effect of the order made by the High Court in the writ petition was that the question whether the respondent should be permitted to file a suit for ejectment of the appellant or not must be gone into and decided afresh by the State Government.\"",
      "speaker": "court",
      "significance": "Explains implication of High Court direction"
    },
    {
      "text": "\"One would search this order in vain for the reason that persuaded the State Government to allow the revision petition. Not a single reason is given.\"",
      "speaker": "court",
      "significance": "Critique of State Government order lacking reasons"
    }
  ],
  "_case_id": "1972_165",
  "_label": 1,
  "_text_length": 18148,
  "_extracted_at": "2026-02-10T20:08:15.599122"
}