{
  "metadata": {
    "case_name": "Jagmohan Singh v. State",
    "case_year": 1971,
    "court": "Supreme Court of India",
    "judges": [
      "PALEKAR, J."
    ],
    "case_number": "Criminal Appeal No. 173 of 1971",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Some six or seven years before the present offence, one Shivraj Singh, father of Jagbir Singh, a cousin of the appellant, was murdered. The deceased Chhotey Singh was charged for that murder but was eventually acquitted by the High Court.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "As a result of that murder, there was ill-feeling between Chhotey Singh, on the one hand, and the appellant and Jagbir Singh, on the other.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "A day earlier, there was a quarrel between Jagmohan Singh and Jagbir Singh, on the one hand, and Chhotey Singh, on the other, on the question of a right to irrigate their fields. However, the dispute was settled by persons who reached the spot at the time and nothing untoward happened.",
      "type": "material",
      "date": "1969-09-09",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Chhotey Singh was murdered on September 10, 1969 at about 5.00 P.M. The appellant armed with a country made pistol and Jagbir Singh armed with a lathi concealed themselves in a bajra field and emerged from the same as Chhotey Singh passed by to go to his field for fetching fodder. The appellant asked Chhotey Singh to stop so that the matter between them could be settled once for all. Chhotey Singh tried to run away but he was chased by the appellant and shot in the back. Chhotey Singh fell down after running some distance and died.",
      "type": "material",
      "date": "1969-09-10",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The appellant Jagmohan Singh has been convicted under section 302 IPC for the murder of one Chhotey Singh and sentenced to death by the learned Sessions Judge, Shahjahanpur.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "The conviction and the sentence are confirmed by the Allahabad High Court.",
      "type": "procedural",
      "date": "1971-02-26",
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Coming to this Court by special leave, special leave was granted limited to the question of sentence only.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether this Court should interfere with the sentence of death imposed by the Trial Court and confirmed by the High Court.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Constitutional impermissibility of the death sentence for murder: (1) Puts an end to all fundamental rights under Article 19(1)(a) to (g); (2) Discretion unguided, abdication of legislative function; (3) Violates Article 14; (4) No procedure under Article 21 for sentencing.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The death sentence puts an end to all fundamental rights guaranteed under clauses (a) to (g) of sub-clause (1) of Article 19 and, therefore, the law with regard to capital sentence is unreasonable and not in the interest of the general public.",
      "supporting_facts": [],
      "legal_basis": "Article 19"
    },
    {
      "id": "pa2",
      "text": "The discretion invested in the Judges to impose capital punishment is not based on any standards or policy required by the Legislature for imposing capital punishment in preference to imprisonment for life. This was a stark abdication of essential legislative function, and therefore section 302 IPC is vitiated by the vice of excessive delegation of essential legislative function.",
      "supporting_facts": [],
      "legal_basis": "Section 302 IPC"
    },
    {
      "id": "pa3",
      "text": "The uncontrolled and unguided discretion in the Judges to impose capital punishment or imprisonment for life is hit by Article 14 of the Constitution because two persons found guilty of murder on similar facts are liable to be treated differently.",
      "supporting_facts": [],
      "legal_basis": "Article 14"
    },
    {
      "id": "pa4",
      "text": "The provisions of the law do not provide a procedure for trial of factors and circumstances crucial for making the choice between the capital penalty and imprisonment for life. The trial under the Criminal Procedure Code is limited to the question of guilt. In the absence of any procedure established by law in the matter of sentence, the protection given by Article 21 is violated.",
      "supporting_facts": [],
      "legal_basis": "Article 21, CrPC"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "There are no extenuating circumstances; the murder was premeditated, motivated by ill-feelings nurtured for years, appellant lay in wait armed with a gun, chased and shot the victim in the back.",
      "supporting_facts": [
        "f2",
        "f3",
        "f4"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "This Court normally does not interfere with the discretion exercised by the High Court on the question of sentence unless the High Court has disregarded recognised principles in imposing the sentence and there has been a failure of justice.",
      "addresses_issue": "i1",
      "key_observation": "No breach of principles; offence premeditated, no immediate provocation."
    },
    {
      "id": "cr2",
      "text": "Article 19 does not directly deal with freedom to live; assuming right to live basic, s.302 IPC passes test of reasonableness and public interest, considering judicial discretion, procedural safeguards, constitutional provisions recognizing death penalty (Arts 72, 134, 21), Law Commission Report.",
      "addresses_issue": "i2",
      "key_observation": "Capital punishment retained valid in Indian conditions."
    },
    {
      "id": "cr3",
      "text": "No abdication; policy of criminal law fixes maximum for worst cases, leaves wide discretion to judge to balance aggravating/mitigating circumstances; impossible to lay standards for infinite variety of cases.",
      "addresses_issue": "i2",
      "key_observation": "Discretion judicially exercised, correctable on appeal."
    },
    {
      "id": "cr4",
      "text": "No violation of Art 14; facts/circumstances differ in each case; judicial discretion not arbitrary, reviewable.",
      "addresses_issue": "i2",
      "key_observation": "Art 14 not invoked for judicial discretion."
    },
    {
      "id": "cr5",
      "text": "Procedure under CrPC established by law; trial covers guilt and sentence factors; accused opportunity to bring mitigating circumstances; sentencing follows conviction per ss.306(2), 309(2) CrPC.",
      "addresses_issue": "i2",
      "key_observation": "All relevant facts before court during trial."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "No interference with death sentence; High Court exercised discretion properly.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Death sentence for murder under s.302 IPC constitutionally valid; does not violate Arts 14,19,21; judicial discretion proper.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Ram Narain and others v. The State of U.P.",
      "citation": null,
      "treatment": "followed",
      "relevance": "Court normally does not interfere with High Court's discretion on sentence unless disregard of principles."
    },
    {
      "case_name": "State of Madras v. G. Row",
      "citation": "1952 S.C.R. 597",
      "treatment": "referred",
      "relevance": "Test of reasonableness applied to individual statutes, considering nature of right, purpose, etc."
    },
    {
      "case_name": "Furman v. State of Georgia",
      "citation": "Nos. 69-5003, 619-5030 and 69-5031 decided on June 29, 1972",
      "treatment": "distinguished",
      "relevance": "US Supreme Court set aside sentences but majority not outlawing capital punishment per se."
    },
    {
      "case_name": "McGautha v. California",
      "citation": "United States Supreme Court report Lawyers Edition, 28, 713",
      "treatment": "followed",
      "relevance": "Jury discretion in capital sentencing constitutional; impossible to channel with standards."
    },
    {
      "case_name": "Budhan Choudhry and others v. The State of Bihar",
      "citation": "1955 S.C.R. 1045",
      "treatment": "followed",
      "relevance": "Art 14 not for uniformity in judicial discretion; depends on facts."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Penal Code, 1860",
      "sections": [
        "302",
        "300",
        "303",
        "121",
        "397",
        "396",
        "409"
      ],
      "relevance": "Punishment for murder: death or life imprisonment; policy of maximum for worst cases, judicial discretion."
    },
    {
      "name": "Code of Criminal Procedure, 1898",
      "sections": [
        "367(5)",
        "374",
        "378",
        "306(2)",
        "309(2)",
        "401",
        "402",
        "562"
      ],
      "relevance": "Discretion in sentencing; confirmation of death sentence by High Court; procedural safeguards."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "19",
        "14",
        "21",
        "72",
        "134"
      ],
      "relevance": "Death penalty permissible if by procedure established by law; no violation; recognition of capital punishment."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal against the death sentence is dismissed. The Supreme Court upholds the conviction and sentence under s.302 IPC by Sessions Judge and Allahabad High Court, rejects constitutional challenges to death penalty, finding it valid and discretion properly exercised.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "Deprivation of life is constitutionally permissible if that is done according to procedure established by law.",
      "speaker": "court",
      "significance": "Interprets Article 21, upholding death penalty."
    },
    {
      "text": "India cannot risk the experiment of abolition of capital punishment.",
      "speaker": "court",
      "significance": "Quotes Law Commission Report 35th, justifying retention in Indian context."
    },
    {
      "text": "Discretionary judgment on the facts of each case is the only way in which they can be equitably distinguished.",
      "speaker": "court",
      "significance": "Affirms judicial discretion in sentencing, citing Royal Commission."
    }
  ],
  "_case_id": "1972_424",
  "_label": 0,
  "_text_length": 52708,
  "_extracted_at": "2026-02-10T20:09:49.302600"
}