{
  "metadata": {
    "case_name": "Bhagwan Kaur v. Maharaj Krishan Sharma and Shanti Devi",
    "case_year": 1969,
    "court": "Supreme Court of India",
    "judges": [
      "KHANNA, J."
    ],
    "case_number": "Criminal Appeal No. 235 of 1969",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Shanti Devi (deceased), daughter of PW 5 Dayal Das (Sub Inspector CID Delhi), married Maharaj Krishan Sharma (accused, science teacher) on February 20, 1963.",
      "type": "background",
      "date": "1963-02-20",
      "source": "prosecution"
    },
    {
      "id": "f2",
      "text": "Accused dissatisfied with dowry brought by deceased; relations strained; deceased complained of ill-treatment by accused Maharaj Krishan and his mother Shanti Devi; deceased occasionally stayed at father's house but returned.",
      "type": "background",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f3",
      "text": "Deceased lodged police report against accused for ill-treatment.",
      "type": "background",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f4",
      "text": "In May 1964, Maharaj Krishan obtained writing from deceased stating she wanted divorce.",
      "type": "background",
      "date": "1964-05",
      "source": "prosecution"
    },
    {
      "id": "f5",
      "text": "Maharaj Krishan ran private college at residence C/96, New Rajinder Nagar, New Delhi; on January 13, 1965, peon Hanuman Singh (PW?) purchased one quart of 98.9% sulphuric acid from Lajpat Rai (PW 10) for the college.",
      "type": "material",
      "date": "1965-01-13",
      "source": "prosecution"
    },
    {
      "id": "f6",
      "text": "Towards end of June 1965, Maharaj Krishan sent message via deceased to father-in-law for money to go to UK with employment voucher; mother-in-law Bhagwan Kaur (PW 1) refused.",
      "type": "background",
      "date": "1965-06",
      "source": "prosecution"
    },
    {
      "id": "f7",
      "text": "On July 21, 1965, deceased telephoned mother Bhagwan Kaur that husband beating her for money to go abroad; parents visited, accused demanded money, parents refused.",
      "type": "background",
      "date": "1965-07-21",
      "source": "prosecution"
    },
    {
      "id": "f8",
      "text": "On July 23, 1965 around noon, deceased went to neighbour Sushila Devi (PW 9), asked her to come; Sushila found deceased on carpet crying, froth from mouth, burning sensation on feet and sofa, deceased said 'Radhaswami' twice then unconscious; Maharaj Krishan present, calling doctor.",
      "type": "material",
      "date": "1965-07-23",
      "source": "prosecution"
    },
    {
      "id": "f9",
      "text": "Dr. Tilak Rai Chadha (PW 30, homeopathic physician, family doctor) received call around 2 pm from Maharaj Krishan urging immediate visit; accused said deceased took something, he just came from school; saw saliva/acid from mouth, acid on carpet; advised hospital, called police.",
      "type": "material",
      "date": "1965-07-23",
      "source": "prosecution"
    },
    {
      "id": "f10",
      "text": "Deceased semi-conscious, tongue charred, taken by taxi to Willingdon Hospital with Dr. Chadha, Maharaj Krishan, Head Constable Sita Ram (PW 29); doctor said unfit for statement.",
      "type": "material",
      "date": "1965-07-23",
      "source": "prosecution"
    },
    {
      "id": "f11",
      "text": "ASI Hem Raj (PW 33) went to house then hospital; met upset Maharaj Krishan.",
      "type": "procedural",
      "date": "1965-07-23",
      "source": "prosecution"
    },
    {
      "id": "f12",
      "text": "Around 4:30 pm, Dayal Das (PW 5) informed by phone, went with wife Bhagwan Kaur (PW 1); saw burns on face/chest; Keshava Nand and wife Kamla (PW 2) also arrived.",
      "type": "material",
      "date": "1965-07-23",
      "source": "prosecution"
    },
    {
      "id": "f13",
      "text": "Around 11 pm, deceased to female ward; Bhagwan Kaur with her, Kamla in verandah; midnight, deceased conscious, gestured to write; Bhagwan Kaur got paper/pen from doctor's room; deceased wrote PW 1/A (dying declaration in Hindi, signed), said accused put acid on tongue.",
      "type": "disputed",
      "date": "1965-07-23",
      "source": "prosecution"
    },
    {
      "id": "f14",
      "text": "PW 1/A contents: 'I am in senses now. A quarrel took place at my house yesterday and my husband asked me that he had no connections with me and that I should go to my parents. I did not go. Thereupon my husband caught hold of my hand forcibly and my mother-in-law put some drug in my mouth forcibly with her hands, some of which got into my mouth and some scattered on the ground.' Signed variously.",
      "type": "material",
      "date": "1965-07-23",
      "source": "prosecution"
    },
    {
      "id": "f15",
      "text": "Bhagwan Kaur became unconscious, regained at 5 am; deceased died 10:45 am.",
      "type": "material",
      "date": "1965-07-24",
      "source": "prosecution"
    },
    {
      "id": "f16",
      "text": "ASI Hem Raj prepared inquest PW 5/J; accused stated suicide: quarrels, deceased childless, on July 23 accused mentioned UK trip, deceased dissuaded, went out, cries heard, pointed to acid bottle in almirah, said she took it.",
      "type": "disputed",
      "date": "1965-07-23",
      "source": "respondent"
    },
    {
      "id": "f17",
      "text": "At 2:45 pm, Bhagwan Kaur gave statement PW 1/B mentioning dying declaration and oral statement; handed PW 1/A; new inquest PW 5/D; case registered 3:25 pm.",
      "type": "procedural",
      "date": "1965-07-23",
      "source": "prosecution"
    },
    {
      "id": "f18",
      "text": "Post mortem by Dr. R.L. Handa on July 25, 1965: death due to corrosive poisoning by acid; burns on lips, chin, forehead, cheek, chest; internal corrosion of mouth, tongue, food pipe, stomach (charred, 3 perforations, empty, friable), duodenum; acid in peritoneal cavity; quantity half to one ounce; could not be forced by another.",
      "type": "material",
      "date": "1965-07-25",
      "source": "court"
    },
    {
      "id": "f19",
      "text": "Handwriting expert Dr. S.K. Sharma: PW 1/A similar to admitted writings of deceased.",
      "type": "material",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f20",
      "text": "Police report Feb 17, 1966: suicide, cancel case; Magistrate agreed.",
      "type": "procedural",
      "date": "1966-02-17",
      "source": "lower_court"
    },
    {
      "id": "f21",
      "text": "Bhagwan Kaur complaint June 1, 1966 under IPC 302/34; trial: accused denied murder, claimed suicide; no defense evidence.",
      "type": "procedural",
      "date": "1966-06-01",
      "source": "prosecution"
    },
    {
      "id": "f22",
      "text": "Trial court (Additional Sessions Judge): convicted accused under 302/34 based on PW 1/A; rejected oral dying declaration.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f23",
      "text": "Delhi High Court appeal: acquitted accused giving benefit of doubt; circumstances point to suicide; dying declaration unreliable.",
      "type": "procedural",
      "date": "1969-01-31",
      "source": "lower_court"
    },
    {
      "id": "f24",
      "text": "Supreme Court appeal by special leave by Bhagwan Kaur.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the death of Shanti Devi was homicidal (caused by accused forcibly pouring sulphuric acid into her mouth) or suicidal (self-ingestion of acid).",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Accused caused death by forcibly pouring sulphuric acid; strained relations, dowry demands, prior ill-treatment; dying declaration PW 1/A written by deceased implicates husband holding hand, mother-in-law pouring drug/acid; oral dying declaration to Bhagwan Kaur and Kamla; handwriting expert confirms.",
      "supporting_facts": [
        "f2",
        "f3",
        "f4",
        "f6",
        "f7",
        "f13",
        "f14",
        "f19"
      ],
      "legal_basis": "Section 302 read with section 34 Indian Penal Code"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Deceased committed suicide by swallowing sulphuric acid herself; petty quarrels but patched up; on July 23, after discussion on UK trip, deceased took acid from almirah bottle; no forcible administration.",
      "supporting_facts": [
        "f16",
        "f24"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "High Court properly appreciated evidence; no glaring infirmity; circumstances point to suicide: medical evidence (Dr. Handa - quantity of acid too much to force, no struggle injuries, rare for homicide); accused conduct (called neighbour, doctor, police, took to hospital) inconsistent with guilt; dying declaration PW 1/A full of infirmities (unusual phrasing, meticulous signatures, firm hand inconsistent with condition, delay in disclosure); oral dying declaration rejected; accused version from earliest stage; handwriting expert evidence frail.",
      "addresses_issue": "i1",
      "key_observation": "Various circumstances irresistibly point to suicide, not homicide."
    },
    {
      "id": "cr2",
      "text": "Medical jurisprudence texts support acid ingestion suicidal, rarely homicidal unless victim helpless.",
      "addresses_issue": "i1",
      "key_observation": "Opinion of Dr. Handa in consonance with standard texts."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Death of Shanti Devi due to corrosive acid poisoning by suicide, not homicide by accused.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Evidence of handwriting expert is frail and indecisive, yields to positive evidence.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Sri Sri Kishore Chandra Singh Deo v. Babu Ganesh Prasad Bhagat Ors.",
      "citation": "A.I.R. 1954 S.C. 316",
      "treatment": "followed",
      "relevance": "Conclusions from handwriting comparison indecisive, yield to positive evidence; courts wary of over-relying on handwriting experts."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "302",
        "34"
      ],
      "relevance": "Charged for murder with common intention; case hinges on proof of homicidal act."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court dismissed the appeal against acquittal by Delhi High Court, holding that circumstances point to suicide by deceased ingesting sulphuric acid, not murder by accused; no merit in appeal.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"the various circumstances of the case irresistibly point to the conclusion that the deceased committed suicide by taking sulphuric acid.\"",
      "speaker": "court",
      "significance": "Final conclusion upholding acquittal."
    },
    {
      "text": "\"This Court in an appeal under article 136 of the Constitution does not normally reappraise evidence unless it finds some glaring infirmity... No such infirmity has been brought to our notice.\"",
      "speaker": "court",
      "significance": "Limits scope of SC review in acquittal appeals."
    },
    {
      "id": "kq3",
      "text": "\"the quantity of acid which was found in the stomach of the deceased was so much that it could not be poured by someone else.\"",
      "speaker": "court",
      "significance": "Key medical observation supporting suicide."
    }
  ],
  "_case_id": "1972_571",
  "_label": 0,
  "_text_length": 27523,
  "_extracted_at": "2026-02-10T20:11:06.371640"
}