{
  "metadata": {
    "case_name": "Manager of Arun Mills Ltd. v. State",
    "case_year": 1970,
    "court": "Supreme Court of India",
    "judges": [
      "Mathew, J."
    ],
    "case_number": "Cr. A. No. 91 of 1970",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Chandrakant Jethalal was a worker in the factory of which the appellant was the Manager.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On February 27, 1968, the worker while cleaning the clip stentering machine with a rag near the delivery-side slipped when the machine was in motion, and while trying to save himself, his right hand was trapped into the bevel gears of the stentering machine.",
      "type": "material",
      "date": "1968-02-27",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The bevel gears were at a height of three feet from the ground floor and are dangerous parts of the stentering machine and were not safe by position and construction.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "As a result of the injury his fingers had to be amputated.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Inspector of Factories received a report from the concerned authority on February 28, 1968.",
      "type": "procedural",
      "date": "1968-02-28",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The Inspector visited the factory on July 30, 1968 and made an enquiry into the accident.",
      "type": "procedural",
      "date": "1968-07-30",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Thereafter the Inspector filed the complaint on September 20, 1968 for an offence punishable under s.92 of the Factories Act, 1948.",
      "type": "procedural",
      "date": "1968-09-20",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Chief City Magistrate, Ahmedabad, dismissed the complaint on the ground that the prosecution was barred by time under s.106 of the Act.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Gujarat High Court in Cr. R.A. No. 244 of 1969 dated August 25, 1969 set aside the Magistrate's order, holding that the Inspector got knowledge of the commission of the offence only on the date of the enquiry.",
      "type": "procedural",
      "date": "1969-08-25",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "The report was in Form No. 21 under Rule 103 of the Act. Column 9(a): 'While cleaning the clip stenter machine with a rag in his right hand near the bevel gears the rag and the right palm slipped inside the gear and crushed the whole palm with five fingers.' Column 9(b)(i): 'bevel gear of clip stenter driving the chain.' Column 9(b)(ii): 'mechanical.' Column 9(c): 'cleaning the clip stenter machine.'",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Inspector stated in evidence that the report did not convey to him any knowledge as regards the commission of the offence.",
      "type": "admitted",
      "date": null,
      "source": "prosecution"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the facts mentioned in the report were sufficient to convey the knowledge of the commission of an offence under the Act.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the offence committed, if any, is one under clause (iv)(c) of sub-section (1) of Section 21 of the Act.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The prosecution was barred by time in view of s.106 of the Act as the report conveyed knowledge of the commission of an offence on February 28, 1968.",
      "supporting_facts": [
        "f5",
        "f10"
      ],
      "legal_basis": "Section 106, Factories Act, 1948"
    },
    {
      "id": "pa2",
      "text": "The Inspector should have enquired into the accident with reasonable promptness after receiving the report and cannot postpone the starting point of limitation by delaying the inquiry.",
      "supporting_facts": [
        "f5",
        "f6"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The Inspector did not get any knowledge of the commission of an offence under the Act from the report, and got the knowledge only on the date of the enquiry on July 30, 1968.",
      "supporting_facts": [
        "f5",
        "f6",
        "f10",
        "f11"
      ],
      "legal_basis": "Section 106, Factories Act, 1948"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "A plain reading of section 21(1)(iv)(c) indicates that every dangerous part of any other machinery shall be securely fenced unless they are in such position or of such construction as to be safe to every person employed in the factory as they would be if they were securely fenced.",
      "addresses_issue": "i2",
      "key_observation": "The report did not state that the dangerous parts were not in such position or construction as to be safe, nor that they were not securely fenced or kept in position."
    },
    {
      "id": "cr2",
      "text": "The statements in the report only indicated that an accident took place while cleaning near the bevel gears which were dangerous parts moved by mechanical power, but did not reveal all necessary elements constituting the offence under s.21(1)(iv)(c).",
      "addresses_issue": "i1",
      "key_observation": "It would be difficult for anyone reading the report to conclude that an offence under s.21(1)(iv)(c) has been committed."
    },
    {
      "id": "cr3",
      "text": "Inspector's evidence that the report did not convey knowledge of the offence, read with the report, leads to the conclusion that knowledge was acquired only on July 30, 1968.",
      "addresses_issue": "i1",
      "key_observation": "Accept the finding of the High Court."
    },
    {
      "id": "cr4",
      "text": "No provision in the Act or rules obliges the Inspector to conduct an inquiry within any specified period after receipt of the report.",
      "addresses_issue": "i1",
      "key_observation": "Questions of equity and hardship are out of place in interpreting limitation provisions; starting point is date of knowledge of commission of offence."
    },
    {
      "id": "cr5",
      "text": "Knowledge of accident is not the same as knowledge of offence; delay in inquiry, however irregular, does not affect limitation under s.106.",
      "addresses_issue": "i1",
      "key_observation": "Cannot read s.106 to make the date on which Inspector ought to have acquired knowledge the starting point."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The report did not convey knowledge of the commission of an offence to the Inspector; knowledge acquired only on July 30, 1968; complaint filed within time under s.106.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Section 106 makes the date of knowledge of the commission of the offence the starting point of limitation; no deemed knowledge based on diligence or prompt inquiry.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Nagendra Nath v. Suresh Chandra",
      "citation": "1932, 60 Cal. 16 PC",
      "treatment": "referred",
      "relevance": "Questions of equity and hardship out of place in interpreting limitation provisions."
    },
    {
      "case_name": "Magbul Ahmed v. Pratap Narain",
      "citation": "1935, 57 All. 242 PC",
      "treatment": "referred",
      "relevance": "Questions of equity and hardship out of place in interpreting limitation provisions."
    },
    {
      "case_name": "State v. Keshavlal",
      "citation": "A.I.R. 1958 Bombay 243",
      "treatment": "followed",
      "relevance": "Knowledge of accident not same as knowledge of offence; delay in inquiry does not affect limitation; cannot deem knowledge from date Inspector ought to have known."
    }
  ],
  "statutes_cited": [
    {
      "name": "Factories Act, 1948",
      "sections": [
        "Section 92",
        "Section 106",
        "Section 21(1)(iv)(c)"
      ],
      "relevance": "Offence under s.92 read with s.21(1)(iv)(c) for failure to fence dangerous parts; s.106 bars cognizance unless complaint within 3 months of Inspector's knowledge of offence."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court dismissed the appeal by special leave, upholding the Gujarat High Court's order setting aside the Magistrate's dismissal of the complaint, holding that the complaint was filed within time under s.106 as the Inspector acquired knowledge of the offence only on July 30, 1968.",
    "relief_granted": "Prosecution to proceed",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"It is only in the jurisprudence of Humpty Dumpty that we can equate the date on which the alleged offence came to the knowledge of an Inspector with the date on which the alleged offence ought to have come to his knowledge.\"",
      "speaker": "court",
      "significance": "Rejects argument of deemed knowledge based on prompt inquiry."
    },
    {
      "text": "\"Knowledge of an accident is not the same thing as the knowledge of an offence, that is of a breach which is made penal.\"",
      "speaker": "court",
      "significance": "Distinguishes between accident report and knowledge of offence."
    }
  ],
  "_case_id": "1972_427",
  "_label": 0,
  "_text_length": 12633,
  "_extracted_at": "2026-02-10T20:10:20.007914"
}