{
  "metadata": {
    "case_name": "Sales Tax Officer v. M/s Utteswar Rice Mills",
    "case_year": 1969,
    "court": "Supreme Court of India",
    "judges": [
      "KHANNA, J."
    ],
    "case_number": "Civil Appeals Nos. 1190 and 1191 of 1969",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The respondent in appeal No. 1190 is a dealer registered under the Orissa Sales Tax Act, 1947. The matter relates to the assessment for 1963-64. The date of the order of assessment is not on file but it was made sometime in the later part of 1964.",
      "type": "background",
      "date": "1963-64",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On March 30, 1967 the Sales Tax Officer, Intelligence Wing, Vigilance, Berhampur made a search of the business premises of the respondent and seized several account books.",
      "type": "material",
      "date": "1967-03-30",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On the following day, further search was made and some additional account books were taken into possession.",
      "type": "material",
      "date": "1967-03-31",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Later on March 31, 1967 the Sales Tax Officer issued a notice under section 12(8) of the Act to the respondent stating: 'Whereas I have reason to believe that your turnover for the quarter ending 1963-64 on which Sales Tax was payable under the Orissa Sales Tax Act, 1947 has escaped assessment has been under assessed.' Required submission of return in Form IV, attendance on 11-5-67 at 11 A.M., produce accounts, show cause why penalty not exceeding one and a half times under s.12(5).",
      "type": "procedural",
      "date": "1967-03-31",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The notice was received by an employee of the respondent.",
      "type": "procedural",
      "date": "1967-03-31",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Appearance was thereafter put in on behalf of the respondent before the Sales Tax Officer and a copy of the old return which had been earlier filed in accordance with section 11 of the Act was again filed.",
      "type": "procedural",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "According to the respondent, appearance was put in on its behalf on several occasions with a view to know the reason for the issue of the above notice, but the respondent was not informed of that reason.",
      "type": "disputed",
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "The Sales Tax Officer recorded the statements of a number of witnesses behind the back of the respondent with the intention of making reassessment under section 12 of the Act.",
      "type": "procedural",
      "source": "respondent"
    },
    {
      "id": "f9",
      "text": "Request was made on behalf of the respondent to the Sales Tax Officer for being furnished with copies of those statements so that the respondent might be in a position to know the reason for the issue of the notice. Copies were not supplied and the application was rejected.",
      "type": "procedural",
      "source": "respondent"
    },
    {
      "id": "f10",
      "text": "The Sales Tax Officer mentioned that the question of grant of copies would be considered if the statements were used against the respondent.",
      "type": "procedural",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "The respondent filed a revision petition against the order rejecting the application for copies, but the revision petition was dismissed.",
      "type": "procedural",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "The respondent filed petition under articles 226 and 227 of the Constitution in the Orissa High Court on December 26, 1967 (O.J.C. Nos 464 and 463 of 1967).",
      "type": "procedural",
      "date": "1967-12-26",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "The High Court accepted the writ petition on June 24, 1968 on the ground that the Sales Tax Officer had not indicated any reason for issuing notice under section 12(8), relying on B. Patnaik Mines P Ltd. v. N. K. Mohanty.",
      "type": "procedural",
      "date": "1968-06-24",
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "Affidavit of Shri Prakash Chandra Mohanty, successor Sales Tax Officer, states that the notice was issued after information about certain clandestine dealings of the respondent, and seized documents disclosed prima facie material of failure to disclose entire turnover. Details recorded in case file available to High Court.",
      "type": "admitted",
      "source": "appellant"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether notice issued under section 12(8) of the Orissa Sales Tax Act, 1947 should be quashed on the ground that it does not mention the reasons for the issue of the notice.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the existence of a reason that the turnover has escaped assessment or been under-assessed is a condition precedent to the issue of notice under section 12(8).",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "It is not essential to give the reasons in the notice issued under section 12(8). The impugned notice cannot be quashed for non-mention of the reasons.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": "Section 12(8) of Orissa Sales Tax Act, 1947; Rule 23 and Form VI of Orissa Sales Tax Rules, 1947"
    },
    {
      "id": "pa2",
      "text": "Penalty question arises only at reassessment stage, where opportunity to show cause would be given.",
      "supporting_facts": [],
      "legal_basis": "Section 12(8) Orissa Sales Tax Act"
    },
    {
      "id": "pa3",
      "text": "Material existed for belief: information about clandestine dealings, seized documents showing failure to disclose turnover.",
      "supporting_facts": [
        "f2",
        "f3",
        "f14"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Failure of the Sales Tax Officer to mention the reasons which led to the issue of the impugned notice vitiates the notice.",
      "supporting_facts": [
        "f4",
        "f7"
      ],
      "legal_basis": "B. Patnaik Mines P Ltd. v. N. K. Mohanty, Sales Tax Officer, I.L.R. 1967 Cuttack 446"
    },
    {
      "id": "ra2",
      "text": "Sales Tax Officer had no jurisdiction to issue notice for fishing enquiry without indicating reason for alleged under-assessment.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": "Section 12(8) Orissa Sales Tax Act"
    },
    {
      "id": "ra3",
      "text": "Combined notice calling for return and show cause for penalty is premature and invalid.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": "Section 12(8) and Form VI"
    },
    {
      "id": "ra4",
      "text": "No reason shown to exist for belief that turnover escaped/under-assessed.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "Section 12(8) Orissa Sales Tax Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Section 12(8) requires the sales tax authority to have reason to believe turnover escaped/under-assessed, but nothing requires mentioning reasons in the notice. Phraseology similar to old s.34 Income Tax Act.",
      "addresses_issue": "i1",
      "key_observation": "No requirement to intimate reasons or nature of escapement in notice; to hold otherwise adds to statute."
    },
    {
      "id": "cr2",
      "text": "Form VI uses 'Whereas I have reason to believe', supporting no need for detailed reasons in notice.",
      "addresses_issue": "i1",
      "key_observation": "Practical approach; unworkable otherwise."
    },
    {
      "id": "cr3",
      "text": "Precedents under IT Act s.34 applicable: no need to communicate reasons before notice; assessee not entitled to copy of reasons.",
      "addresses_issue": "i1",
      "key_observation": "Penalty at reassessment stage with opportunity."
    },
    {
      "id": "cr4",
      "text": "If material to be used against dealer, must be brought to notice and opportunity given before using it.",
      "addresses_issue": "i1",
      "key_observation": "Clarification on future proceedings."
    },
    {
      "id": "cr5",
      "text": "Reason existed: affidavit shows information on clandestine dealings, seized documents prima facie showing non-disclosure; file available.",
      "addresses_issue": "i2",
      "key_observation": "High Court erred in not examining."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Notice under s.12(8) not invalid for not mentioning reasons.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Existence of reason is condition precedent, and it existed here.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h3",
      "text": "High Court view and B. Patnaik Mines case incorrect.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "B. Patnaik Mines P Ltd. v. N. K. Mohanty, Sales Tax Officer",
      "citation": "I.L.R. 1967 Cuttack 446",
      "treatment": "distinguished",
      "relevance": "High Court relied on it to quash notice for no reasons; SC holds incorrect."
    },
    {
      "case_name": "Commissioner of Income Tax, Bengal v. Messrs Mahaltram Ramjidas",
      "citation": "1940 8 I.T.R. 442 (PC)",
      "treatment": "followed",
      "relevance": "Interpreted similar phrasing in old s.34 IT Act; no need for reasons in notice."
    },
    {
      "case_name": "K. S. Rashid and Son v. Income Tax Officer",
      "citation": "1964 52 I.T.R. 355 (SC)",
      "treatment": "followed",
      "relevance": "Assessee not entitled to copy of reasons recorded for s.34 notice."
    },
    {
      "case_name": "S. Narayanappa v. Commissioner of Income Tax, Bangalore",
      "citation": "1967 63 I.T.R. 219 (SC)",
      "treatment": "followed",
      "relevance": "No need to communicate reasons before issuing s.34 notice; pre-notice stage administrative."
    }
  ],
  "statutes_cited": [
    {
      "name": "Orissa Sales Tax Act, 1947",
      "sections": [
        "Section 12(5)",
        "Section 12(8)",
        "Section 11",
        "Section 29"
      ],
      "relevance": "Governs escaped assessment notices, procedure, penalties; no requirement for reasons in notice."
    },
    {
      "name": "Orissa Sales Tax Rules, 1947",
      "sections": [
        "Rule 23",
        "Form VI"
      ],
      "relevance": "Prescribes form of notice which states 'reason to believe' without details."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 226",
        "Article 227"
      ],
      "relevance": "Basis for writ petitions filed by respondents."
    },
    {
      "name": "Indian Income Tax Act, 1922",
      "sections": [
        "Section 34"
      ],
      "relevance": "Similar phrasing; precedents applied analogously."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "The Supreme Court accepted the appeals, set aside the judgment of the Orissa High Court dated June 24, 1968, and dismissed the writ petitions filed by the respondents. Parties to bear their own costs in this Court and High Court.",
    "relief_granted": "Writ petitions quashed; notices upheld.",
    "costs": "Parties to bear their own costs of this Court as well as in the High Court."
  },
  "key_quotes": [
    {
      "text": "\"There is nothing in the language of section 12(8) of the Act which either expressly or by necessary implication postulates the recording of reasons in the notice which is issued to the dealer under the above provision of law.\"",
      "speaker": "court",
      "significance": "Core holding: no statutory requirement for reasons in notice."
    },
    {
      "text": "\"At the same time, we would like to make it clear that if the sales tax officer is in possession of material which he proposes to use against the dealer in proceedings for reassessment, the said officer must before using that material bring it to the notice of the dealer and give him adequate opportunity to explain.\"",
      "speaker": "court",
      "significance": "Safeguard for assessee's rights in proceedings."
    },
    {
      "text": "\"Section 34 is unhappily and even ungrammatically phrased... the person who must make that decision is the Income-tax Officer.\"",
      "speaker": "court",
      "significance": "From PC precedent; applies to similar phrasing in s.12(8)."
    }
  ],
  "_case_id": "1972_381",
  "_label": 1,
  "_text_length": 26274,
  "_extracted_at": "2026-02-10T20:09:52.070211"
}