{
  "metadata": {
    "case_name": "Yeshwant & Ors. v. State of Maharashtra",
    "case_year": 1972,
    "court": "Supreme Court of India",
    "judges": [
      "Beg, J."
    ],
    "case_number": "Criminal Appeals Nos. 175 of 1969 and 90 of 1970",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Sukal and Zingu, while returning from a fishing expedition, were waylaid and attacked by five persons at about 2.30 a.m. on 15-9-1966 at Marartola of Village Kati near an electric lamp post.",
      "type": "material",
      "date": "1966-09-15",
      "source": "prosecution"
    },
    {
      "id": "f2",
      "text": "One assailant armed with an axe killed Sukal; another with a knife stabbed Zingu who escaped.",
      "type": "material",
      "date": "1966-09-15",
      "source": "prosecution"
    },
    {
      "id": "f3",
      "text": "Eye-witnesses: Zingu (PW 8, injured), Babaji (PW 17), Jiwan (PW 18) who came from opposite direction.",
      "type": "material",
      "date": "1966-09-15",
      "source": "prosecution"
    },
    {
      "id": "f4",
      "text": "Zingu extricated himself and fled crying for help, saw Babaji coming with lantern, rushed to Jainarain's house 200 feet away.",
      "type": "material",
      "date": "1966-09-15",
      "source": "prosecution"
    },
    {
      "id": "f5",
      "text": "Dr. Narsing Galole (PW 2) attended Zingu after seeing Sukal unconscious; Zingu named Rupchand held him, Suraj assaulted him; Yashwant and Bhadya Master held Sukal, Tiwari attacked Sukal.",
      "type": "material",
      "date": "1966-09-15",
      "source": "prosecution"
    },
    {
      "id": "f6",
      "text": "FIR lodged by Dr. Galole at 7.05 a.m. on 15-9-1966 named Suraj Koshti, Rupchand Koshti, Police Patil Yeshwantrao Turkar, Maharaj from Gondia; omitted Bhadia Master.",
      "type": "procedural",
      "date": "1966-09-15",
      "source": "prosecution"
    },
    {
      "id": "f7",
      "text": "Chandanlal (PW 12, Sarpanch) heard Zingu say Yeshwant and Suraj held Sukal, Tiwari gave blows; Bhadya Master held him, Rupchand gave blows.",
      "type": "material",
      "date": "1966-09-15",
      "source": "prosecution"
    },
    {
      "id": "f8",
      "text": "Dying declaration of Zingu at 7.30 a.m. before Taluka Magistrate: confused, named Mukadam Patel, Rupchand Patel, Bhadya Master, Suraj, guest from Gondia struck him.",
      "type": "material",
      "date": "1966-09-15",
      "source": "prosecution"
    },
    {
      "id": "f9",
      "text": "Dr. Kale (PW 7) at Gondia Hospital examined Zingu at ~5.30 a.m., noted injuries, recorded Zingu said assaulted by somebody at 2-3 a.m., did not know names; later insertion of 'not' in record.",
      "type": "disputed",
      "date": "1966-09-15",
      "source": "prosecution"
    },
    {
      "id": "f10",
      "text": "Sessions Judge Bhandara acquitted appellants; Bombay High Court (Nagpur Bench) allowed state appeal on 28/29 January 1969, convicted under 302/34 and 307/34 IPC.",
      "type": "procedural",
      "date": "1969-01-28",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Blood-stained clothes recovered from houses of Rupchand, Yeshwant, Bhadu (15-9-1966), Brahmanand (19-9-1966); only Yeshwant's dhoti had human blood group B, not matching victims.",
      "type": "circumstantial",
      "date": "1966-09-15",
      "source": "prosecution"
    },
    {
      "id": "f12",
      "text": "Contusions on Bhadu and Rupchand approximating time of occurrence.",
      "type": "circumstantial",
      "date": "1966-09-15",
      "source": "prosecution"
    },
    {
      "id": "f13",
      "text": "Brahmanand Tiwari: night watchman at Gondia, absent on night of 14-15 Sep 1966 per attendance register; had beard and adhesive tape on neck.",
      "type": "background",
      "date": "1966-09-15",
      "source": "prosecution"
    },
    {
      "id": "f14",
      "text": "Identification parade for Brahmanand flawed: only 5 others, no similar bearded men, he had tape on neck, seen by witnesses before parade.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Reliability of eye-witness evidence of Zingu, Babaji, and Jiwan, particularly inconsistencies and Dr. Kale's evidence.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Identity of Brahmanand Tiwari as the axe-wielding assailant on Sukal.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether doubt as to one accused's identity entitles all to acquittal under Section 302/34 IPC.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Zingu gave inconsistent accounts; Dr. Kale's evidence that Zingu did not name assailants demolishes prosecution case.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Inconsistencies in dying declarations and statements; flawed identification of Brahmanand; village factions motivated false implication.",
      "supporting_facts": [
        "f6",
        "f8",
        "f14"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Doubt as to one accused (Brahmanand) requires acquittal of all under 302/34 IPC.",
      "supporting_facts": [
        "f13",
        "f14"
      ],
      "legal_basis": "Krishna Govind Patil v. State of Maharashtra; Jagir Singh v. State of Punjab"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Eye-witnesses consistent; Dr. Kale's record altered deliberately; Babaji and Jiwan natural witnesses with better view.",
      "supporting_facts": [
        "f3",
        "f5",
        "f7"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Election defeat of Harlal (Yeshwant's brother) provides motive.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Dr. Kale's evidence unreliable due to subsequent insertion in different ink; dying declaration shows Zingu's confused state but identified group.",
      "addresses_issue": "i1",
      "key_observation": "Dr. Kale's alteration deliberate, cannot knock bottom out of prosecution case."
    },
    {
      "id": "cr2",
      "text": "Babaji and Jiwan natural witnesses, close enough (25 steps), lantern light, corroborated by Zingu, Dr. Galole, Chandanlal; no motive for false implication.",
      "addresses_issue": "i1",
      "key_observation": "Better position to observe than Zingu attacked from behind."
    },
    {
      "id": "cr3",
      "text": "Identity of Brahmanand doubtful: unknown previously, flawed ID parade, possible confusion with another bearded man.",
      "addresses_issue": "i2",
      "key_observation": "Benefit of doubt to Brahmanand; evidence of identity of strangers deceptive."
    },
    {
      "id": "cr4",
      "text": "Doubt on one does not acquit others known to witnesses; Section 34 applies to remaining four who acted in common intention.",
      "addresses_issue": "i3",
      "key_observation": "Krishna Govind Patil depends on facts; here evidence sustains conviction of four."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Eye-witness evidence of Babaji, Jiwan, Zingu reliable and corroborated; convictions under 302/34 and 307/34 upheld for Yeshwant, Suraj Lal, Rupchand, Bhadu.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Identity of Brahmanand Tiwari not proved beyond doubt; acquitted.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h3",
      "text": "Doubt as to identity of one participant does not necessitate acquittal of others under Section 34 IPC where common intention proved.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Krishna Govind Patil v. State of Maharashtra",
      "citation": "1964 S.C.R. 678",
      "treatment": "distinguished",
      "relevance": "Doubt on three accused did not allow conviction of fourth under 302/34 where evidence insufficient singly; not general principle."
    },
    {
      "case_name": "Jagir Singh v. State of Punjab",
      "citation": "1967 3 S.C.R. 256",
      "treatment": "followed",
      "relevance": "Section 34 for cases where common intention but individual roles hard to prove; helps prosecution."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "302",
        "34",
        "307"
      ],
      "relevance": "Convictions under 302/34 for murder of Sukal; 307/34 for attempt on Zingu; Section 34 applies to common intention."
    }
  ],
  "outcome": {
    "disposition": "partially_accepted",
    "summary": "Appeal of Brahmanand Tiwari allowed, acquitted and released; appeals of other four appellants dismissed, convictions and sentences under 302/34 IPC (life imprisonment for Yeshwant, Suraj Lal, Brahmanand originally but acquitted; wait no: Yeshwant, Suraj Lal, Brahmanand under 302/34; Rupchand, Bhadu under 307/34) maintained for Yeshwant, Suraj Lal, Rupchand, Bhadu.",
    "relief_granted": "Acquittal of Brahmanand Tiwari",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"evidence as to identity, particularly of previously unknown persons, is a deceptive kind of evidence which has led to miscarriages of justice sometimes.\"",
      "speaker": "court",
      "significance": "Justifies giving benefit of doubt to Brahmanand."
    },
    {
      "text": "\"The benefit of this doubt can only go to the appellant Brahmanand Tiwari and not to the other accused persons who were known well to each eye witness.\"",
      "speaker": "court",
      "significance": "Distinguishes doubt on one from others."
    }
  ],
  "_case_id": "1972_231",
  "_label": 0,
  "_text_length": 32935,
  "_extracted_at": "2026-02-10T20:08:25.608429"
}