{
  "metadata": {
    "case_name": "Editors of Dinamani, Hindu and Indian Express v. Respondent (Chairman of Reception Committee of Dravida Kazhagam Conference)",
    "case_year": 1972,
    "court": "Supreme Court of India",
    "judges": [
      "Shelat, J."
    ],
    "case_number": "Criminal Appeal Nos. 18, 53 and 54 of 1972",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Dravida Kazhagam, a party for social reforms with about 4000 members, sponsored and organised a conference held on January 23 and 24, 1971.",
      "type": "background",
      "date": "1971-01-23",
      "source": "respondent"
    },
    {
      "id": "f2",
      "text": "The conference passed a resolution: 'It should not be made an offence for a person's wife to desire another man.' Object was total emancipation of women and equality between men and women.",
      "type": "material",
      "date": "1971-01-24",
      "source": "respondent"
    },
    {
      "id": "f3",
      "text": "About 300 persons staged a black flag demonstration against the procession connected with the conference, which included an alleged obscene tableau depicting Hindu deities and mythological figures. Processionists shouted anti-God slogans.",
      "type": "material",
      "date": "1971-01-24",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "E.V. Ramaswami Naicker, leader of Dravida Kazhagam, presided over the conference, inaugurated by C.D. Naidu.",
      "type": "background",
      "date": "1971-01-24",
      "source": "news_item"
    },
    {
      "id": "f5",
      "text": "Appellants were editors and publishers of daily newspapers Dinamani, Hindu, and Indian Express, printed and published in Madras.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "On January 25 and 26, 1971, the newspapers published a news item captioned 'Demonstration against the Obscene Tableau' stating: 'The Conference passed a resolution requesting the Government to take suitable steps to see that meeting another man's wife is made an offence under the Indian Penal Code.' News item emanated from correspondent's report dated January 24, 1971.",
      "type": "material",
      "date": "1971-01-25",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "News item did not mention respondent or any sponsors of the resolution by name; concerned demonstration, procession, tableau, resolution passed by conference, and E.V. Ramaswami Naicker presiding.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "On January 28, 1971, respondent, signing as chairman of reception committee, called upon editor of Hindu to publish correction: resolution was that it should not be an offence for a person's wife to desire another man, not that meeting another man's wife should be made an offence.",
      "type": "procedural",
      "date": "1971-01-28",
      "source": "respondent"
    },
    {
      "id": "f9",
      "text": "In February 1971, Hindu published the clarification under caption 'Salem Conference Resolutions' along with its own representative's version matching the original publication.",
      "type": "procedural",
      "date": "1971-02",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "On February 1, 1971, respondent's advocates' letter to editor demanded publication of correct text, stating publication was travesty of truth, highly defamatory, tarnishing image of conference.",
      "type": "procedural",
      "date": "1971-02-01",
      "source": "respondent"
    },
    {
      "id": "f11",
      "text": "On February 9, 1971, respondent filed complaints against editors/publishers of three dailies under ss. 500 and 501 IPC before Chief Presidency Magistrate, Madras. Described himself as important member of Dravida Kazhagam, Self-respect Movement, disciple of E.V. Ramaswami Naicker, chairman of reception committee, sponsor/pilot of resolution.",
      "type": "procedural",
      "date": "1971-02-09",
      "source": "respondent"
    },
    {
      "id": "f12",
      "text": "Complaint alleged news item contrary to actual resolution, imputing to sponsors advocacy of adultery, lowering estimation of complainant and party members.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f13",
      "text": "Witness list attached to complaint consisted of Dravida Kazhagam members.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f14",
      "text": "In sworn statement on February 9, 1971, respondent stated conference organised by Dravida Kazhagam passed the resolution; news item motivated, malicious, defamatory of leader, members including himself.",
      "type": "admitted",
      "date": "1971-02-09",
      "source": "respondent"
    },
    {
      "id": "f15",
      "text": "On May 22, 1971, respondent deposed: scrutinised and abridged draft resolution from Pariaswami (Secretary, Trichy branch DK); conference consisted of comrades, sympathisers, 5000 women; selected chairman on Dec 13, 1970; secretaries Pachaimuthu, R. Natesan; president (Pariyar) moved resolution, no opposition, unanimously passed.",
      "type": "admitted",
      "date": "1971-05-22",
      "source": "respondent"
    },
    {
      "id": "f16",
      "text": "Conference had own office, correspondence; separate from DK though organised by it.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f17",
      "text": "Magistrate issued process and proceeded with trial based on complaint and evidence.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f18",
      "text": "Appellants filed applications under s. 561A CrPC in Madras High Court to quash proceedings.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f19",
      "text": "High Court Single Judge dismissed applications on November 2, 1971, holding Dravida Kazhagam identifiable group, respondent active member, chairman, piloted resolution, aggrieved u/s 198 CrPC (referred as 19B erroneously).",
      "type": "procedural",
      "date": "1971-11-02",
      "source": "high_court"
    },
    {
      "id": "f20",
      "text": "Supreme Court granted special leave; appeals heard.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the respondent, the original complainant, was an aggrieved person competent to file complaints under ss. 500 and 501 IPC within the meaning of s. 198 CrPC read with s. 499 Explanation 2 IPC.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Respondent not aggrieved u/s 198 CrPC; filed in capacity as chairman of reception committee, not individually; no reference to him in news item; conference undefined amorphous body, respondent as member cannot complain.",
      "supporting_facts": [
        "f7",
        "f16"
      ],
      "legal_basis": "s. 198 CrPC; s. 499 Expl. 2 IPC"
    },
    {
      "id": "pa2",
      "text": "News item referred to conference, not Dravida Kazhagam; conference separate entity from DK.",
      "supporting_facts": [
        "f6",
        "f16"
      ],
      "legal_basis": "s. 499 Expl. 2 IPC requiring identifiable determinate body"
    },
    {
      "id": "pa3",
      "text": "High Court observations factually incorrect (respondent did not pilot resolution); failed to distinguish conference from DK.",
      "supporting_facts": [
        "f15",
        "f19"
      ],
      "legal_basis": "Knupffer v. London Express Newspaper Ltd."
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "News item distorted resolution, defamed Dravida Kazhagam which organised conference and sponsored resolutions; respondent leading member, chairman reception committee, entitled to complain.",
      "supporting_facts": [
        "f2",
        "f6",
        "f11"
      ],
      "legal_basis": "s. 499 Expl. 2 IPC"
    },
    {
      "id": "ra2",
      "text": "Respondent sponsored/piloted resolution; active member of identifiable group Dravida Kazhagam.",
      "supporting_facts": [
        "f11",
        "f15"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "s. 198 CrPC mandatory; only aggrieved person can complain for defamation; news item neither mentioned respondent nor contained imputation against him individually.",
      "addresses_issue": "i1",
      "key_observation": "Prima facie, complaint unsustainable absent personal reference."
    },
    {
      "id": "cr2",
      "text": "s. 499 Expl. 2 IPC covers imputation concerning company/association/collection of persons, but must be identifiable definite body, not indefinite class.",
      "addresses_issue": "i1",
      "key_observation": "Defamatory words must relate to definite group distinguishable from community."
    },
    {
      "id": "cr3",
      "text": "Conference separate from Dravida Kazhagam (own organisation, office, secretaries); news item referred to conference's resolution, not DK; respondent's letters/complaint targeted conference's image.",
      "addresses_issue": "i1",
      "key_observation": "Cannot identify conference with DK; defamation of conference not of DK."
    },
    {
      "id": "cr4",
      "text": "Conference not determinate identifiable body: composition unknown, attendees included outsiders/5000 women, resolution passed without debate (no opposition deemed approval).",
      "addresses_issue": "i1",
      "key_observation": "Impossible to say all attendees defamed; no individual member can complain."
    },
    {
      "id": "cr5",
      "text": "High Court misdirected: decided on DK identifiability (not referenced in news item), ignored conference's separate entity, factually erred on respondent piloting resolution.",
      "addresses_issue": "i1",
      "key_observation": "High Court judgment based on extraneous issue."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Respondent not aggrieved person u/s 198 CrPC; complaint not competent as conference not definite identifiable body defamed.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Knupffer v. London Express Newspaper Ltd.",
      "citation": "1944 A.C. 116",
      "treatment": "followed",
      "relevance": "Words must be published 'of' the plaintiff; for class, must be definite; too numerous/unascertainable cannot sue individually unless referring to plaintiff."
    },
    {
      "case_name": "Sahib Singh Mehra v. State of U.P.",
      "citation": "1965 2 S.C.R. 823",
      "treatment": "followed",
      "relevance": "Prosecuting staff identifiable group u/s 499 Expl. 2; complaint by members competent."
    },
    {
      "case_name": "Tek Chand v. R. K. Karanjia",
      "citation": "1969 Cr. L.J. 536",
      "treatment": "followed",
      "relevance": "Rashtriya Swayam Sevak Sangh definite identifiable body; member can complain."
    },
    {
      "case_name": "Wahid Ullah Ansari v. Emperor",
      "citation": "A.I.R. 1935 All. 743",
      "treatment": "referred",
      "relevance": "Dictum supporting identifiable body for defamation of class."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Penal Code, 1860",
      "sections": [
        "s. 499",
        "s. 500",
        "s. 501"
      ],
      "relevance": "Defines defamation; Expl. 2 extends to company/association/collection of persons if identifiable; ss. 500/501 offences require aggrieved complainant u/s 198 CrPC."
    },
    {
      "name": "Code of Criminal Procedure, 1898",
      "sections": [
        "s. 198",
        "s. 561A"
      ],
      "relevance": "s. 198: Cognizance of defamation only on complaint by aggrieved person (mandatory); s. 561A: High Court power to quash proceedings."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeals allowed; High Court judgment and order set aside; Magistrate's proceedings quashed on ground that respondent's complaint was not competent as he was not aggrieved person u/s 198 CrPC.",
    "relief_granted": "Proceedings quashed",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"The common question raised in all these appeals is whether the respondent the original complainant was an aggrieved person competent to file the said complaints within the meaning of S. 198 of the Code of Criminal Procedure read with s. 499, Explanation 2 of the Penal Code.\"",
      "speaker": "court",
      "significance": "Frames the principal issue."
    },
    {
      "text": "\"A collection of persons must be an identifiable body so that it is possible to say with definiteness that a group of particular persons, as distinguished from the rest of the community, was defamed.\"",
      "speaker": "court",
      "significance": "Key test for s. 499 Expl. 2 IPC."
    },
    {
      "text": "\"The conference clearly was not an identifiable or a definitive body so that all those who attended it could be said to be its constituents who, if the conference was defamed, would, in their turn, be said to be defamed.\"",
      "speaker": "court",
      "significance": "Decisive finding against respondent's locus standi."
    }
  ],
  "_case_id": "1972_360",
  "_label": 1,
  "_text_length": 30352,
  "_extracted_at": "2026-02-10T20:09:54.715327"
}