{
  "metadata": {
    "case_name": "Sammbhu Nath Jha v. Kedar Prasad & Ors.",
    "case_year": 1969,
    "court": "Supreme Court of India",
    "judges": [
      "Khanna J."
    ],
    "case_number": "Criminal Appeal No. 30 of 1969",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "On January 2, 1966, Lachho Paswan lodged a report with police that while going to Jamui market with brother Dwarka Paswan, Kedar Prasad abused them, exhorted others to assault Dwarka, who was assaulted and killed by Arjun Pandey thrusting a Saif in his chest. Motive: voting against Kedar Prasad in Mukhia election.",
      "type": "material",
      "date": "1966-01-02",
      "source": "prosecution"
    },
    {
      "id": "f2",
      "text": "Police investigated and submitted charge sheet under sections 148 and 302 read with 149 IPC against several persons, but no charge sheet against Kedar Prasad and Arjun Pandey.",
      "type": "procedural",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f3",
      "text": "During commitment proceedings, committing magistrate ordered summons to Kedar Prasad and Arjun Pandey as accused for May 15, 1966.",
      "type": "procedural",
      "date": "1966-05-15",
      "source": "lower_court"
    },
    {
      "id": "f4",
      "text": "Kedar Prasad and Arjun Pandey filed revision against summons order, dismissed by Additional Sessions Judge, Monghyr on May 5, 1967, holding they were rightly summoned.",
      "type": "procedural",
      "date": "1967-05-05",
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "On September 18, 1967, Assistant District Prosecutor filed application in magistrate court to withdraw case against Kedar Prasad and Arjun Pandey on grounds of inexpediency for State and public policy.",
      "type": "procedural",
      "date": "1967-09-18",
      "source": "prosecution"
    },
    {
      "id": "f6",
      "text": "Magistrate dismissed withdrawal application on October 6, 1967, observing it amounted to abuse and improper interference in normal course of justice.",
      "type": "procedural",
      "date": "1967-10-06",
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Two revision petitions filed against October 6, 1967 order: one by State of Bihar, one by Abani Kumar Mandal, admitted by Patna High Court on November 30, 1967.",
      "type": "procedural",
      "date": "1967-11-30",
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "Governor of Bihar notified on March 12, 1968 appointing Commission of Inquiry under section 3 of Commissions of Inquiry Act, 1952, consisting of T.L. Venkatarama Aiyer, to inquire into charges against 14 former Chief Ministers and Ministers, including Hasibur Rahman.",
      "type": "background",
      "date": "1968-03-12",
      "source": "state"
    },
    {
      "id": "f9",
      "text": "Allegation J-4 against Hasibur Rahman: misuse of position to interfere in prosecution of Kedar Prasad Sinha and Arjun Pandey in rioting with murder case, directing withdrawal despite opposition, leading to revision petitions.",
      "type": "material",
      "date": null,
      "source": "commission"
    },
    {
      "id": "f10",
      "text": "Notification with schedule published in Bihar Gazette Extraordinary on March 12, 1968.",
      "type": "procedural",
      "date": "1968-03-12",
      "source": "state"
    },
    {
      "id": "f11",
      "text": "Appellant Sammbhu Nath Jha, a Bihar Minister, gave copy of notification including schedule to press for publication on March 12, 1968.",
      "type": "material",
      "date": "1968-03-12",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Notification and allegation J-4 published in Searchlight, Patna on March 13, 14, 15, 1968.",
      "type": "material",
      "date": "1968-03-13",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "On March 25, 1968, Kedar Prasad and Arjun Pandey filed application in Patna High Court for contempt proceedings against 25 persons including State of Bihar, Ministers, appellant as respondent No.3, Editor and Printer of Searchlight.",
      "type": "procedural",
      "date": "1968-03-25",
      "source": "petitioner"
    },
    {
      "id": "f14",
      "text": "Patna High Court on August 12, 1968 found 22 out of 25 guilty of contempt of technical nature, let off with warning; appellant guilty for handing over material to press.",
      "type": "procedural",
      "date": "1968-08-12",
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether publication of the Government notification under section 3 of Commissions of Inquiry Act, 1952, including allegation J-4, during pendency of criminal revision petitions in High Court, amounts to contempt of court.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Publication was of entire statutory notification required to be published in Official Gazette, which was published there; no selective emphasis; matters in allegation J-4 distinct from revision petitions issue.",
      "supporting_facts": [
        "f8",
        "f10",
        "f11",
        "f12"
      ],
      "legal_basis": "Section 3, Commissions of Inquiry Act, 1952"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "No one appeared on behalf of respondents.",
      "supporting_facts": [],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Law of contempt well-settled: act or writing calculated to interfere with due course of justice is contempt; not mere technical contempt without action unless contumacious.",
      "addresses_issue": "i1",
      "key_observation": "Courts exercise circumspection for technical contempts."
    },
    {
      "id": "cr2",
      "text": "Publication was entire notification mandatorily published in Official Gazette under section 3(1); schedule part of it specifying matters of public importance.",
      "addresses_issue": "i1",
      "key_observation": "Compliance with statutory requirement; object is publicity and authenticity."
    },
    {
      "id": "cr3",
      "text": "Subject of allegation J-4 (misuse by Minister) distinct from revision issue (legality of magistrate's refusal of withdrawal).",
      "addresses_issue": "i1",
      "key_observation": "Overlap does not attract contempt liability."
    },
    {
      "id": "cr4",
      "text": "High Court erred assuming no statutory requirement for Gazette publication of allegations.",
      "addresses_issue": "i1",
      "key_observation": "Notification publication imperative."
    },
    {
      "id": "cr5",
      "text": "Commission inquiry not judicial, different scope from court proceedings; no contempt in statutory inquiry.",
      "addresses_issue": "i1",
      "key_observation": "Cites precedents on non-interference."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Publication of notification does not constitute contempt of court; High Court judgment cannot be sustained.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Reg. v. Gray",
      "citation": "1900 2 Q.B 36",
      "treatment": "followed",
      "relevance": "Any act or writing calculated to bring court into contempt or interfere with justice is contempt."
    },
    {
      "case_name": "E. M. S. Namboodripad v. T. N. Nambiar",
      "citation": "1970 S.C.C. 325",
      "treatment": "followed",
      "relevance": "Courts' right to punish obstructions to justice; inherent power of superior courts."
    },
    {
      "case_name": "Re P. C. Sen",
      "citation": "1969 2 S.C.R. 649",
      "treatment": "followed",
      "relevance": "Contempt by scandalising court, prejudicing parties, misrepresenting proceedings; test is tendency to interfere, not intention; no action for mere technical contempt."
    },
    {
      "case_name": "Debi Prasad Sharma v. The King-Emperor",
      "citation": "I.L.R. 41 Cal. 173 (approx from context)",
      "treatment": "followed",
      "relevance": "Test: whether words calculated to obstruct or interfere with course of justice."
    },
    {
      "case_name": "Legal Remembrancer v. Matilal Ghose",
      "citation": null,
      "treatment": "referred",
      "relevance": "Proceedings for contempt initiated with utmost reserve."
    },
    {
      "case_name": "Jagannath Rao v. State of Orissa",
      "citation": "1968 3 S.C.R.",
      "treatment": "followed",
      "relevance": "Commission inquiry not contempt even if overlapping pending court matters; different scope."
    },
    {
      "case_name": "Shri Ram Krishna Dalmia v. Shri Justice S. R. Tendolkar",
      "citation": "1959 S.C.R. 279",
      "treatment": "referred",
      "relevance": "Commission inquiry not judicial; no usurpation of court functions."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "148",
        "302",
        "149"
      ],
      "relevance": "Offences charged in underlying murder case."
    },
    {
      "name": "Commissions of Inquiry Act, 1952",
      "sections": [
        "3"
      ],
      "relevance": "Mandatory publication of notification in Official Gazette; appointment of Commission."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Supreme Court allowed the appeal by special leave, set aside the Patna High Court judgment finding appellant guilty of technical contempt, holding no contempt committed as publication was statutory requirement.",
    "relief_granted": "Appeal allowed; appellant not guilty of contempt.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The question is not so much of the intention of the contemner as whether it is calculated to interfere with the administration of justice.",
      "speaker": "court",
      "significance": "Defines test for contempt."
    },
    {
      "text": "Ordinarily a court will not initiate proceedings for committal for contempt where there is a mere technical contempt.",
      "speaker": "court",
      "significance": "Judicial restraint for technical contempts."
    },
    {
      "text": "Plain reading of the above sub-section makes it manifest that the notification appointing a Commission of Inquiry must be published in the Official Gazette. It is an imperative requirement.",
      "speaker": "court",
      "significance": "Statutory compliance negates contempt."
    }
  ],
  "_case_id": "1972_15",
  "_label": 1,
  "_text_length": 19659,
  "_extracted_at": "2026-02-10T20:07:25.131692"
}