{
  "metadata": {
    "case_name": "Writ Petition No. 77 of 1972",
    "case_year": 1972,
    "court": "Supreme Court of India",
    "judges": [
      "Shelat, J."
    ],
    "case_number": "Writ Petition No. 77 of 1972",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "District Magistrate, Howrah passed order of detention on June 12, 1971 under sub-s. (1) read with sub-s. (3) of s. 3 of the West Bengal Prevention of Violent Activities Act, 1970, directing petitioner's detention to prevent him from acting in a manner prejudicial to the maintenance of public order.",
      "type": "procedural",
      "date": "1971-06-12",
      "source": "lower_court"
    },
    {
      "id": "f2",
      "text": "Petitioner arrested and detained in Dum Dum Central Jail on June 13, 1971.",
      "type": "procedural",
      "date": "1971-06-13",
      "source": "lower_court"
    },
    {
      "id": "f3",
      "text": "Ground 1: On 17-8-70 at about 02.00 hours, petitioner and associates attacked members of R.G. Party near Jatadhari Park by hurling bombs, hurled more when chased, disturbed public order.",
      "type": "material",
      "date": "1970-08-17",
      "source": "detention_order"
    },
    {
      "id": "f4",
      "text": "Ground 2: On 10-4-71 at about 16.00 hours, petitioner and associates armed with sword assaulted Basudeb Laha near Jatadhari Park causing injuries, terrorised public by brandishing sword.",
      "type": "disputed",
      "date": "1971-04-10",
      "source": "detention_order"
    },
    {
      "id": "f5",
      "text": "Ground 3: On 1-5-71 at 15.00 hours, petitioner and associates armed with bombs and deadly weapons demanded money from Banshi Show, assaulted him when refused, terrorised locals by throwing bombs causing panic.",
      "type": "material",
      "date": "1971-05-01",
      "source": "detention_order"
    },
    {
      "id": "f6",
      "text": "Grounds 1 and 3 undisputed as falling under cl. (d) of s. 3(2) being offences under Explosive Substances Act, 1908 and disturbing public order.",
      "type": "admitted",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether ground No. 2 (assault with sword) constitutes an offence under cl. (d) of s. 3(2) of the West Bengal Prevention of Violent Activities Act, 1970, as it is punishable under s. 324 IPC (not qualifying) or under Arms Act, 1959.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether 1923 notification under s. 15 of Indian Arms Act, 1878 continues in force under Arms Act, 1959 via General Clauses Act ss. 6 and 24.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Activities in ground No. 2 constitute offence under s. 324 IPC, punishable with less than 7 years imprisonment, not falling under cl. (d) of s. 3(2), rendering it extraneous and detention order invalid.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": "West Bengal Prevention of Violent Activities Act, 1970 s. 3(2)(d); IPC s. 324"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Offence in ground No. 2 falls under Arms Act, 1959 as sword is 'arms', possession/carrying without licence prohibited by s. 4 notification continuing from 1923.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": "Arms Act, 1959 ss. 2(1)(c), 4, 25(1)(b); General Clauses Act ss. 6, 24"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Sword is 'arms' under s. 2(1)(c) Arms Act, 1959. S. 4 empowers notification regulating possession/carrying of arms other than firearms. 1923 notification under repealed Arms Act 1878 s. 15 continues and deemed enacted under 1959 Act via General Clauses Act ss. 6(b) and 24.",
      "addresses_issue": "i2",
      "key_observation": "No contrary intention in 1959 Act; provisions identical to repealed Act."
    },
    {
      "id": "cr2",
      "text": "Possession/carrying sword without licence punishable under s. 25(1)(b) Arms Act, 1959, thus ground 2 covered by cl. (d) s. 3(2). Contention has no substance; detention valid.",
      "addresses_issue": "i1",
      "key_observation": "Offence post-1959 Act commencement, notification in force."
    },
    {
      "id": "cr3",
      "text": "Follows Chief Inspector of Mines v. Lala Karam Chand Thapar: regulations under repealed Act continue under re-enacted Act.",
      "addresses_issue": "i2",
      "key_observation": "Continuity of force even for pre-commencement breaches."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Ground No. 2 falls under cl. (d) s. 3(2) as offence under Arms Act, 1959; 1923 notification continues via General Clauses Act.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Impugned detention order valid.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Chief Inspector of Mines v. Lala Karam Chand Thapar",
      "citation": null,
      "treatment": "followed",
      "relevance": "Construction of s. 24 General Clauses Act: notifications/regulations under repealed Act continue under re-enacted Act."
    }
  ],
  "statutes_cited": [
    {
      "name": "West Bengal Prevention of Violent Activities Act, 1970",
      "sections": [
        "s. 3(1)",
        "s. 3(2)(d)",
        "s. 3(3)"
      ],
      "relevance": "Authorises detention to prevent prejudicial acts; cl. (d) covers offences under Arms Act/Explosives Act disturbing public order."
    },
    {
      "name": "Arms Act, 1959",
      "sections": [
        "s. 2(1)(c)",
        "s. 3",
        "s. 4",
        "s. 25(1)(b)",
        "s. 46"
      ],
      "relevance": "Defines arms (sword); prohibits unlicensed possession/carrying via notification; repeals 1878 Act saving prior notifications."
    },
    {
      "name": "Indian Arms Act, 1878",
      "sections": [
        "s. 15"
      ],
      "relevance": "Issued 1923 notification regulating arms; repealed but notification continues."
    },
    {
      "name": "Explosive Substances Act, 1908",
      "sections": [],
      "relevance": "Grounds 1 and 3 offences thereunder disturbing public order."
    },
    {
      "name": "Indian Penal Code",
      "sections": [
        "s. 324"
      ],
      "relevance": "Petitioner's contention: ground 2 offence thereunder, not qualifying under cl. (d)."
    },
    {
      "name": "General Clauses Act, 1897",
      "sections": [
        "s. 6(b)",
        "s. 24"
      ],
      "relevance": "Saves operation of repealed enactments and deems notifications under re-enacted provisions."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 32",
        "Art. 20(3)"
      ],
      "relevance": "Writ petition under Art. 32; Art. 20(3) referenced in precedent."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Court held petitioner's contention without substance, ground No. 2 covered under Arms Act via continuing 1923 notification; detention order valid.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The contention in our view has no substance as the offence alleged in ground No. 2 would fall under cl. (d) of s. 3(2) of the Act inasmuch as it will be one, punishable under the Arms Act, LIV of 1959.",
      "speaker": "court",
      "significance": "Rejects petitioner's main argument."
    },
    {
      "text": "The combined effect of ss. 6 and 24 of the General Clauses Act is that the said notification of 1923 issued under s. 15 of the Act of 1878 not only continued to operate but has to be deemed to have been enacted under the new Act.",
      "speaker": "court",
      "significance": "Key holding on continuity of notification."
    }
  ],
  "_case_id": "1972_245",
  "_label": 0,
  "_text_length": 10699,
  "_extracted_at": "2026-02-10T20:09:00.553093"
}