{
  "metadata": {
    "case_name": "Controller of Estate Duty v. Respondents (Sons of Hajee Mahomed Hussain Sait)",
    "case_year": 1968,
    "court": "Supreme Court of India",
    "judges": [
      "Shelat, J."
    ],
    "case_number": "C.A. No. 1354 of 1968",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Hajee Mahomed Hussain Sait, father of the two respondents, died at Bangalore on March 22, 1955, leaving properties comprising shares and securities valued at Rs. 25,778/-, immovable properties at Bangalore valued at Rs. 5,42,500/- and at Madras valued at Rs. 6,10,100/-, total value Rs. 12,23,794/-.",
      "type": "material",
      "date": "1955-03-22",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The deceased and respondents belonged to Cutchi Memon sect amongst Muslims, originally Hindus from Sind, converted to Islam 400-500 years ago, migrated to Cutch, then to Bombay, Madras and other places.",
      "type": "background",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f3",
      "text": "Respondents claimed properties were joint family under Hindu customary law retained post-conversion, son has right by birth, devolves by survivorship; only deceased's one-third share passed on death, assessable under Estate Duty Act.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f4",
      "text": "Deputy Controller rejected contentions and evidence, assessed duty on entire estate at Rs. 2,05,996.41 P.",
      "type": "procedural",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f5",
      "text": "Respondents' appeals rejected by Central Board of Revenue on December 30, 1961.",
      "type": "procedural",
      "date": "1961-12-30",
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "High Court of Mysore, on reference under s.64 Estate Duty Act in T.R.C. No. 1 of 1965, answered negatively: entire property not chargeable to estate duty, judgment dated February 3, 1967.",
      "type": "procedural",
      "date": "1967-02-03",
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Evidence produced: O.P. No. 47 of 1909, O.P. 188 of 1927, O.P. 79 of 1928, O.P. 1 of 1930 (Madras High Court petitions and orders); Civil Revision Petition No. 1727 of 1930; Judgments in Siddick Hajee Aboo Bucker Sait v. Ebrahim Hajee Abuo Bucker Sait (AIR 1921 Mad 571), Abdul Sattar Ismail v. Abdul Hamid Sait (AIR 1944 Mad 504).",
      "type": "admitted",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "High Court issued letters of administration to respondents after they paid succession duty on one-third share.",
      "type": "admitted",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f9",
      "text": "Respondents' family settled in Madras first, shifted partly to Bangalore between 1928 and 1930.",
      "type": "background",
      "date": "1928-1930",
      "source": "respondent"
    },
    {
      "id": "f10",
      "text": "Partition deed of 1906 between Hussain Hajece Ouseph Sait and his two sons recited that Hajee Hussain Sait and his six brothers formed joint family governed by Hindu law.",
      "type": "admitted",
      "date": "1906",
      "source": "respondent"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether on the facts and circumstances, the entire property held by the deceased valued at Rs. 12,23,794/- was chargeable to estate duty, or only one-third as joint family property devolving by survivorship under Hindu customary law applicable to Cutchi Memons.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether Cutchi Memons are governed by Hindu law concept of joint family, son's right by birth, and survivorship, or only Hindu law of succession/inheritance to self-acquired property.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether subsequent legislation (Shariat Act 1937, Cutchi Memons Act 1938, Mysore Cutchi Memons Act 1943) altered the position.",
      "framed_by": "petitioner"
    },
    {
      "id": "i4",
      "text": "Whether Mysore High Court should prefer Bombay High Court view over Madras High Court view.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Concept of joint family does not apply to Cutchi Memons; son does not acquire interest by birth in property inherited by father from ancestors.",
      "supporting_facts": [
        "f2"
      ],
      "legal_basis": "Mahomedan law applies unless custom proved"
    },
    {
      "id": "pa2",
      "text": "In any case, no scope for such contention after Shariat Act 1937 and Cutchi Memons Act 1938.",
      "supporting_facts": [],
      "legal_basis": "Muslim Personal Law (Shariat) Application Act, XXVI of 1937; Cutchi Memons Act, X of 1938"
    },
    {
      "id": "pa3",
      "text": "High Court of Mysore should prefer Bombay High Court view (Hindu law limited to succession/inheritance) followed by old Mysore High Court in Elia Sait v. Dharavva.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": "Precedents from Bombay High Court"
    },
    {
      "id": "pa4",
      "text": "Findings of Board of Revenue binding on High Court.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Cutchi Memons retained Hindu law as customary law including joint family property, son's right by birth, devolution by survivorship; neither Cutchi Memons Act 1920, Shariat Act 1937 nor Cutchi Memons Act 1938 applied.",
      "supporting_facts": [
        "f2",
        "f3",
        "f7",
        "f8",
        "f9",
        "f10"
      ],
      "legal_basis": "Customary law evidenced by Madras High Court proceedings and judgments"
    },
    {
      "id": "ra2",
      "text": "As settled first in Madras then Bangalore, prefer Madras view over Bombay view.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": "S. Haji Aboo Bucker Sait v. Ebrahim Hajee Aboo Bucker Sait (AIR 1921 Mad 571)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Mahomedan law applies to converts by religion, but in mass conversions like Khojas/Cutchi Memons, they retain parts of original Hindu personal law per habits/traditions unless renounced.",
      "addresses_issue": "i2",
      "key_observation": "Principle from Fidahusein v. Monghibai: converts retain personal law unless consciously adopt another."
    },
    {
      "id": "cr2",
      "text": "Bombay High Court initially applied Hindu law broadly to Khojas/Cutchi Memons including joint family/survivorship, but later (Beaman J. onwards) limited to succession/inheritance of self-acquired property.",
      "addresses_issue": "i2",
      "key_observation": "Later Bombay view: Haji Oosman v. Haroon Salah Mahomed settled law for Bombay."
    },
    {
      "id": "cr3",
      "text": "Madras High Court applied full Hindu law including joint family/survivorship to Cutchi Memons settled there, supported by records of past cases and consistent treatment.",
      "addresses_issue": "i2",
      "key_observation": "S. Haji Aboo Bucker Sait v. Ebrahim (AIR 1921 Mad 571) and subsequent approvals."
    },
    {
      "id": "cr4",
      "text": "Customary law depends on settlement surroundings: Cutchi Memons in Madras (among Hindus) retained full Hindu law; no need to prefer Bombay over Madras view to avoid upsetting titles.",
      "addresses_issue": "i4",
      "key_observation": "Analogy from Mombasa Memons (adopted Mahomedan law among Muslims) and Halai Memons."
    },
    {
      "id": "cr5",
      "text": "Old Mysore decision in Elia Sait v. Dharavva preferred Bombay view without reasoning or evidence, not binding.",
      "addresses_issue": "i4",
      "key_observation": "Not a well-considered judgment."
    },
    {
      "id": "cr6",
      "text": "Cutchi Memons Act 1920 enabling, no declaration made. Cutchi Memons Act 1938 and Mysore 1943 have savings clauses for pre-commencement rights; sons' birth rights (pre-1938/1948) saved, no 'passing' on death under s.3 Estate Duty Act.",
      "addresses_issue": "i3",
      "key_observation": "Rights acquired by birth before Acts protected by s.3."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Cutchi Memons settled in Madras regulated property/succession/inheritance by Hindu law including joint family, birth right, survivorship.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Only deceased's undivided one-third share passed on death, chargeable to estate duty; entire property not chargeable.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Subsequent Acts do not affect pre-existing birth rights due to savings provisions.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Fidahusein v. Monghibai",
      "citation": "1936 38 Bom. L.R. 397",
      "treatment": "followed",
      "relevance": "Mass converts retain original personal law per habits unless renounced."
    },
    {
      "case_name": "Hirbae v. Sonabae (Khoja and Memon cases)",
      "citation": "Perrys Oriental Cases, 110 (1853)",
      "treatment": "referred",
      "relevance": "Cutchi Memons/Khojas retained Hindu law of succession excluding females."
    },
    {
      "case_name": "Gangbai v. Thavar Mulla",
      "citation": "1866 Bom. H.C.R. 276",
      "treatment": "followed",
      "relevance": "Khojas governed by Hindu customs of inheritance."
    },
    {
      "case_name": "S. Haji Aboo Bucker Sait v. Ebrahim Hajee Aboo Bucker Sait",
      "citation": "AIR 1921 Mad 571",
      "treatment": "followed",
      "relevance": "Madras view: Full Hindu law including joint family/survivorship for Cutchi Memons in Madras."
    },
    {
      "case_name": "Abdul Sattar Ismail v. Abdul Hamid Sait",
      "citation": "AIR 1944 Mad 504",
      "treatment": "followed",
      "relevance": "Approved distinction between self-acquired and joint family property."
    },
    {
      "case_name": "Haji Oosman v. Haroon Salah Mahomed",
      "citation": "1923 I.L.R. 47 Bom. 369",
      "treatment": "distinguished",
      "relevance": "Bombay view limits Hindu law to succession/inheritance of self-acquired property."
    },
    {
      "case_name": "Elia Sait v. Dharavva",
      "citation": "10 Mys. L.J. 33",
      "treatment": "doubted",
      "relevance": "Preferred Bombay view without reasoning; not binding."
    },
    {
      "case_name": "Abdulrahim Haji Ismail Mithu v. Halimabai",
      "citation": "1915-1916 L.R. 43 I.A. 35",
      "treatment": "followed",
      "relevance": "Custom changes with settlement surroundings (Mombasa Memons adopted Mahomedan law)."
    },
    {
      "case_name": "Khatubai v. Mahomed Haji Abu",
      "citation": "1922 L.R. 50 I.A. 108",
      "treatment": "followed",
      "relevance": "Halai Memons followed Hindu law in Porbandar (Hindus) but Mahomedan in Bombay (Muslims)."
    }
  ],
  "statutes_cited": [
    {
      "name": "Estate Duty Act, XXXIV of 1953",
      "sections": [
        "s. 3",
        "s. 64"
      ],
      "relevance": "Whether properties 'passed' on death; reference question."
    },
    {
      "name": "Cutchi Memons Act, XLVI of 1920",
      "sections": [
        "s. 2"
      ],
      "relevance": "Enabling Act for opting into Mahomedan law; no declaration made."
    },
    {
      "name": "Muslim Personal Law (Shariat) Application Act, XXVI of 1937",
      "sections": [
        "s. 2"
      ],
      "relevance": "Applies to intestate succession; not pressed by appellant."
    },
    {
      "name": "Cutchi Memons Act, X of 1938",
      "sections": [
        "s. 2",
        "s. 3"
      ],
      "relevance": "Mandatory Mahomedan law for succession/inheritance post-1938, but s.3 saves pre-existing rights."
    },
    {
      "name": "Mysore Cutchi Memons Act, 1 of 1943",
      "sections": [
        "s. 2",
        "s. 3"
      ],
      "relevance": "Extended to Bangalore Civil Station 1948; saves pre-commencement rights/liabilities."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court upheld the Mysore High Court's answer that the entire property was not chargeable to estate duty, as the properties devolved by survivorship under Hindu customary law applicable to Cutchi Memons in Madras/Bangalore, with sons having pre-existing birth rights saved by legislation; only one-third assessable.",
    "relief_granted": "Appeal dismissed",
    "costs": "Dismissed with costs"
  },
  "key_quotes": [
    {
      "text": "\"A Hindu convert residing in India is governed by his personal law unless he renounces the old law and accepts the new one...\"",
      "speaker": "court",
      "significance": "Principle for mass converts retaining original law."
    },
    {
      "text": "\"the Cutchi Memons on their conversion were so enamoured of the Hindu Law of inheritance that they adopted it, but were so dissatisfied with the laws of the joint family that they discarded the rules as to coparcenary\"",
      "speaker": "court",
      "significance": "Rejecting limited application; full Hindu law including joint family."
    },
    {
      "text": "\"the accountable persons, having been born long before 1948, had already acquired a right by birth in the property held by their father, a right expressly saved by S. 3 of the Act.\"",
      "speaker": "court",
      "significance": "Pre-existing rights not affected by 1938/1943 Acts."
    }
  ],
  "_case_id": "1972_217",
  "_label": 0,
  "_text_length": 42001,
  "_extracted_at": "2026-02-10T20:08:26.708261"
}