{
  "metadata": {
    "case_name": "Trustees of Gordhandas Govindram Family Trust v. Commissioner of Wealth-tax",
    "case_year": 1969,
    "court": "Supreme Court of India",
    "judges": [
      "HEGDE, J."
    ],
    "case_number": "Civil Appeals Nos. 2382-2383 of 1969",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Govindram Gordhandas Seksaria, Ramnath Gordhandas Seksaria, Makhanlal Gordhandas Seksaria and Bholaram Gordhandas Seksaria constituted a Trust on June 11, 1941 in respect of a sum of Rs. 11 lacs. That Trust was known as Gordhandas Govindram Family Trust.",
      "type": "background",
      "date": "1941-06-11",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Clause 2 of the Trust deed says that it was created for giving help or relief to such poor Vaishaya Hindoos or other Hindoos as the trustees may consider deserving of help in the manner and to the extent hereinafter specified and subject to the conditions and directions stated in the next following clauses and or for the charitable object or objects hereinafter mentioned.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Clause 3(a) of the Trust deed provides that the conditions and directions to be observed and followed by the Trustees in the execution of the Trusts herein declared as follows: Poor Vaishaya Hindoos who are members of Seksaria families shall be preferred to poor Vaishaya Hindoos of Navalgadh village belonging to that family.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Sub-clauses (b) to (q) of clause 3 provide for the payment of maintenance and marriage expenses of the poor male or female descendants of Seksaria family.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Sub-clauses (r) to (u) of clause 3: Rs. 5/- per month may be paid as and by way of maintenance of any poor male Vaishaya Hindoo who may be deserving of help. Rs. 5/- per month may be paid as and by way of maintenance to any poor unmarried female Vaishaya Hindoo or a poor Vaishaya Hindoo widow who may be deserving of help. Rs. 500/- may be expended or given for the purpose of meeting the expenses of marriage of any poor female Vaishaya Hindoo who may be deserving of help. [Repeated for another].",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "If the income of the Trust Estate is not sufficient to carry out the charities specified in sub-clauses (a) to (u) above the charity specified in an earlier sub-clause shall be given priority over a charity specified in a later sub-clause.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Charity provided was primarily for the benefit of the members of the family of Seksaria, no doubt including both male and female descendants. The amounts provided for the payment of maintenance and marriage expenses for the poor members of the Seksaria family is bound to take away a substantial part of the income of the trust, if not the whole of it.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "The Trust is known as Gordhandas Govindram Family Trust. That is a clear pointer. That shows that the Trust was primarily intended for the benefit of the family of Gordhandas Govindram.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "These appeals relate to the Wealth Tax assessment of the appellant assessee for the assessment years 1957-58 and 1958-59, the relevant valuation date being December 31, 1956 and December 31, 1957.",
      "type": "procedural",
      "date": "1956-12-31",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "They arise from a reference under s. 27 of the Wealth Tax Act, 1957 to the Bombay High Court in Wealth Tax Reference No. 1. The judgment and order dated 14th and 15th February 1968 of the Bombay High Court.",
      "type": "procedural",
      "date": "1968-02-14",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "The High Court has answered both these questions in favour of the Department and against the assessees.",
      "type": "procedural",
      "date": "1968-02-15",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "The character of the Trust in question came to be considered by the Bombay High Court in Trustees of Gordhandas Govindram Family Charity Trust v. Commissioner of Income-tax (Central), Bombay, under sec. 4(3)(i) of the Indian Income-tax Act.",
      "type": "background",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether on a true construction of the indenture of trust dated 11-6-1941 the trustees of the Trust constitute an assessable unit under the provisions of the Wealth-tax Act?",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the property held by the trustees under the indenture of trust dated 11-6-1941 is held for any public purpose of a charitable or religious nature in India within the meaning of Sec. 5(1)(i) of the Wealth-tax Act?",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The Wealth-tax Act does not provide for levy of any tax on Trusts. Trustees cannot be considered either individual or as Hindu Undivided Families or Companies. They could have been charged as an association of persons. But that body is not assessable under the Act. Hence, the trustees are not chargeable under the Act.",
      "supporting_facts": [
        "f1",
        "f9"
      ],
      "legal_basis": "Sections 3 of Wealth-tax Act"
    },
    {
      "id": "pa2",
      "text": "There is a lacuna in the charging section and, therefore, the trustees of a Trust cannot be taxed under the Act.",
      "supporting_facts": [
        "f1"
      ],
      "legal_basis": "Section 3 of Wealth-tax Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Sections 5(1)(i) as well as s. 21 proceed on the basis that a Trust property is also liable to be taxed under the Act.",
      "supporting_facts": [],
      "legal_basis": "Sections 5(1)(i), 21 of Wealth-tax Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Section 3 is the charging section: Subject to the other provisions contained in this Act, there shall be charged for every assessment year commencing on and from the first day of April, 1957, a tax (hereinafter referred to as wealth-tax) in respect of the net wealth on the corresponding valuation date of every individual, Hindu undivided family and company at the rate or rates specified in the Schedule.",
      "addresses_issue": "i1",
      "key_observation": "Sec. 3 of the Act does bring within its scope an individual which expression in view of the Central General Clauses Act includes individuals as well."
    },
    {
      "id": "cr2",
      "text": "Section 21: In the case of assets chargeable to tax under this Act which are held by a Trustee appointed under a Trust deed by a duly executed instrument in writing, whether testamentary or otherwise, the wealth-tax shall be levied upon and recoverable from the trustee in the like manner and to the same extent as it would be leviable upon and recoverable from the persons on whose behalf the assets are held.",
      "addresses_issue": "i1",
      "key_observation": "Trustees can be assessed to wealth-tax in respect of the trust property of which they are trustees."
    },
    {
      "id": "cr3",
      "text": "The trustees of the trust constitute an assessable unit under the provisions of the Act.",
      "addresses_issue": "i1",
      "key_observation": "Joint trustees could be assessed as individuals under the Act."
    },
    {
      "id": "cr4",
      "text": "The trust in question was created primarily for the benefit of the members of the family of Gordhandas Govindram Seksaria. That is clear from the title given to the Trust as well as from the various provisions. Charity under that deed begins with the family of Gordhandas Govindram and possibly ends with it. Charity in favour of the Vaishaya Hindoos other than the members of the family of Gordhandas Govindram is not only marginal, but also quite tenuous.",
      "addresses_issue": "i2",
      "key_observation": "It is not possible to hold that the Trust in question is a Trust for any public purpose. It is clearly a private Trust."
    },
    {
      "id": "cr5",
      "text": "The character of the Trust was considered by Bombay High Court in Trustees of Gordhandas Govindram Family Charity Trust v. Commissioner of Income-tax: it was not a trust for charitable purpose within the meaning of Indian Income-tax Act, 1922. Primary purpose of the settlor was to benefit the members of his family and remotely and indirectly to benefit the general public.",
      "addresses_issue": "i2",
      "key_observation": "Agree with that conclusion."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The trustees of the trust constitute an assessable unit under the provisions of the Wealth-tax Act.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "The property held by the trustees under the indenture of trust dated 11-6-1941 is not held for any public purpose of a charitable or religious nature in India within the meaning of Sec. 5(1)(i) of the Wealth-tax Act. It is a private Trust.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Commissioner of Wealth-tax, Bihar and Orissa v. Kripashankar Dayashanker Worah",
      "citation": "(1971) 81 I.T.R. 763",
      "treatment": "followed",
      "relevance": "Trustees can be assessed under the Act as Sec. 21 provides for assessing trustees who hold property on behalf of others."
    },
    {
      "case_name": "Commissioner of Income-tax, Madhya Pradesh and Bhopal v. Sodra Devi",
      "citation": "32 I.T.R. 615",
      "treatment": "followed",
      "relevance": "The word assessee is wide enough to cover not only an individual but also a Hindu undivided family, company and local authority and every firm and other association of persons."
    },
    {
      "case_name": "V. Vnugopala Ravi Varma Rajah v. Union of India",
      "citation": "74 I.T.R. 49",
      "treatment": "followed",
      "relevance": "Under s. 3 of Expenditure-tax Act mentioning only individuals or HUF, Mappilla Marumakkattayam Family could be assessed as an individual."
    },
    {
      "case_name": "Subashini Karuri v. Wealth-tax Officer, Calcutta",
      "citation": "46 I.T.R. 953",
      "treatment": "followed",
      "relevance": "Joint trustees could be assessed as individuals under the Act."
    },
    {
      "case_name": "Abhay L. Khatau v. Commissioner of Wealth-tax, Bombay",
      "citation": "57 I.T.R. 202",
      "treatment": "followed",
      "relevance": "Similar view that trustees could be assessed."
    },
    {
      "case_name": "Trustees of Gordhandas Govindram Family Charity Trust v. Commissioner of Income-tax (Central), Bombay",
      "citation": "21 I.T.R. 231",
      "treatment": "followed",
      "relevance": "Trust not for charitable purpose; primary purpose to benefit family members."
    }
  ],
  "statutes_cited": [
    {
      "name": "Wealth-tax Act, 1957",
      "sections": [
        "Section 3",
        "Section 5(1)(i)",
        "Section 21",
        "Section 27"
      ],
      "relevance": "Charging section (3), exemption for charitable trusts (5(1)(i)), assessment of trustees (21), reference to High Court (27). Trustees assessable; trust not charitable."
    },
    {
      "name": "Indian Income-tax Act, 1922",
      "sections": [
        "Section 4(3)(i)"
      ],
      "relevance": "Trust not charitable under this Act as per prior Bombay HC decision."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court agreed with the Bombay High Court, answering both questions in favour of the Department and against the assessee. Trustees constitute an assessable unit and the trust is private, not for public charitable purpose.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "A reading of the Trust deed as a whole clearly goes to prove that the charity under that deed begins with the family of Gordhandas Govindram and possibly ends with it.",
      "speaker": "court",
      "significance": "Core reasoning on why trust is private, not public charitable."
    },
    {
      "text": "We, accordingly, agree with the High Court and hold that the trustees of the trust, with which we are concerned in these appeals, constitute an assessable unit under the provisions of the Act.",
      "speaker": "court",
      "significance": "Holding on first issue: trustees assessable."
    }
  ],
  "_case_id": "1972_453",
  "_label": 0,
  "_text_length": 11830,
  "_extracted_at": "2026-02-10T20:10:23.847766"
}