{
  "metadata": {
    "case_name": "Appellant Company v. Revenue",
    "case_year": 1969,
    "court": "Supreme Court of India",
    "judges": [
      "Khanna, J."
    ],
    "case_number": "C.A. No. 342 of 1969",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The appellant is a private limited company and Kailash Nath Agarwal is one of its directors.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "As per agreement dated July 31, 1956 the appellant was appointed with effect from April 1, 1955 the sole selling agent of the Kanpur Cotton Mills for the sale of yarn and cloth manufactured by the said mills. The Kanpur Cotton Mills is owned by the British India Corporation (BIC).",
      "type": "material",
      "date": "1956-07-31",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Prior to the appellant's appointment Sharma Co., a partnership firm, was functioning as the sole selling agent of the Kanpur Cotton Mills.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The amount due by Sharma Co. to the Kanpur Cotton Mills as on March 21, 1955 was Rs. 8,39,350/15/6 inclusive of interest.",
      "type": "material",
      "date": "1955-03-21",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "On March 23, 1955 a letter was addressed on behalf of Sharma Co. to the Managing Director of BIC stating that an agreement had been entered into with Kailash Nath Agarwal whereby Sharma Co. had agreed to give up the sole selling agency of the Kanpur Cotton Mills. The Managing Director of BIC was requested to appoint Kailash Nath Agarwal or any firm or company formed by him for this purpose as the sole selling agent in place of Sharma Co. Reference was also made in that letter to an agreement between Sharma Co. and Kailash Nath Agarwal in the following words: 'As you will notice from the agreement with Sri Kailash Nath Agarwal we are entitled to receive one seventh of the commission due to the new selling agency or to a sum of Rs. 50,000/- per annum whichever is greater, till your dues with interest are fully liquidated. We do hereby authorise you to retain this amount thus becoming due to us out of the commission payable to the agency and adjust the same to our firms account with the Corporation.'",
      "type": "material",
      "date": "1955-03-23",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "On the same day, i.e. March 23, 1955 Kailash Nath Agarwal addressed a letter to the Managing Director of BIC informing him of the agreement with Sharma Co. and requesting for the grant of sole selling agency to the appellant. The letter concluded as follows: 'I hereby authorise you in case you are pleased to grant your sole selling agency to my said firm to retain one-seventh of our commission for adjustment in the account of M/s. Sharma Co. with minimum of Rs. 50,000/- per annum till your dues against them are cleared with interest.'",
      "type": "material",
      "date": "1955-03-23",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "The Managing Director of BIC later on that day, i.e. March 23, 1955 addressed a letter to Sharma Co. accepting its resignation from the sole selling agency of the Kanpur Cotton Mills and about the appointment of Kailash Nath Agarwal or his nominee as the sole selling agent in succession to Sharma Co. In regard to the liquidation of dues from Sharma Co. the Managing Director of BIC wrote: 'As agreed between Shri Kailash Nath Agarwal and yourselves we shall deduct one seventh of the commission or Rs. 50,000/- whichever is greater out of the commission earned by the new sole selling agents and credit the same to your account with us till our dues against you standing today at Rs. 8,39,350/15/6 are completely liquidated with interest thereon at 6%.'",
      "type": "material",
      "date": "1955-03-23",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "On July 31, 1956 an indenture was executed by BIC and the appellant relating to the appointment of the appellant as the sole selling agent of the Kanpur Cotton Mills for the sale of yarn, cloth and cotton manufactures with effect from April 1, 1955. In this indenture the appellant ratified the agreement entered into by Kailash Nath Agarwal with Sharma Co. on March 23, 1955 and authorised BIC to give effect to the said agreement generally and in particular to retain an amount equal to one-seventh of the trade discount of 1-3/4 due to the sole selling agents with a minimum of Rs. 50,000 per annum so that the amount payable to the sole selling agents shall be the amount payable at the rate of 1 1/4 minus the aforesaid amount retained by the corporation as payable to M/s Sharma Co.",
      "type": "material",
      "date": "1956-07-31",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Clauses 12 and 13 of the indenture: Clause 12: That in the event of the dissolution of M/s Sharma Co. before the complete repayment of their liability the sole selling agents agree that the corporation may continue to retain an amount equal to one-seventh of the trade discount of 1 3/4 or 50,000/- whichever is greater and adjust it towards such dues of M/s Sharma Co. as may then be standing. Clause 13: That the authority given above to the corporation to retain and adjust a part of the trade discount towards the outstanding against M/s Sharma Co. will not be revocable and will be binding on the sole selling agents, their successor, or assigns only so long as they act as the corporations sole selling agents and will be deemed to be a condition on which the sole selling agency has been granted to the agents. The agents will have no claim whatsoever to any such amounts retained out of their normal trade discount and adjusted in the account of M/s Sharma Co. as if the amount so retained was not payable to them.",
      "type": "material",
      "date": "1956-07-31",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "The matter relates to the assessment year 1956-57.",
      "type": "procedural",
      "date": "1956-57",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "During the year under reference, the commission as per terms of the indenture dated July 31, 1956 payable to the appellant amounted to Rs. 2,06,283. Out of this amount, Rs. 43,333 were retained by BIC under the contract for adjustment against the outstanding dues of Sharma Co. in accordance with the terms of the indenture.",
      "type": "material",
      "date": "1956-57",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "In its statement of account the appellant credited the full amount of commission of Rs. 2,06,283 to its profit and loss account. The sum of Rs. 43,333 was, however, shown as a deduction therefrom.",
      "type": "material",
      "date": "1956-57",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "During the assessment proceedings, the Income Tax Officer disallowed the above deduction.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "The order of the Income Tax Officer in this respect was upheld by the Appellate Assistant Commissioner in appeal as well as by the Income Tax Appellate Tribunal in second appeal.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f15",
      "text": "On application filed by the appellant, the Tribunal referred the questions reproduced earlier to the High Court under section 66(1) of the Indian Income Tax Act, 1922.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f16",
      "text": "The High Court answered the two questions against the appellant and in favour of revenue vide judgment dated February 16, 1966 in Misc. Case No. 434 of 1962.",
      "type": "procedural",
      "date": "1966-02-16",
      "source": "court"
    },
    {
      "id": "f17",
      "text": "Appeal by certificate granted by the Allahabad High Court under Article 133 of the Constitution of India.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether on the facts and on a true and proper interpretation of the agreement dated 31-7-1956, between the British India Corporation and the appellant company, the letters of Sri Kailash Nath Agarwal, the letters of Managing Directors, the sum of Rs. 43,333/- retained by the British India Corporation and adjusted by it to the credit of Sharma Co. was the assessable income of the appellant company?",
      "framed_by": "tribunal"
    },
    {
      "id": "i2",
      "text": "Whether on the facts and circumstances of the case, the sum of Rs. 43,333/- represented an expenditure under section 10?",
      "framed_by": "tribunal"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The amount of Rs. 43,333 was a permissible deduction and the High Court was in error in deciding this matter against the appellant. Clause 13 of the indenture provides that the appellant could make no claim to the amount of Rs. 43,333 which had been retained by BIC.",
      "supporting_facts": [
        "f9",
        "f12"
      ],
      "legal_basis": "Clause 13 of indenture dated 31-7-1956"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The judgment of the High Court should be upheld.",
      "supporting_facts": [],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "In March 1955 an amount of Rs. 8,39,350/15/6 was due to BIC from the firm Sharma Co. who was the previous sole selling agent. As a result of agreement between the appellant, BIC and Sharma Co. the appellant undertook to discharge the liability of Sharma Co. in lieu of being appointed the sole selling agent. The appellant got the sole selling agency in consideration of its agreeing to pay Rs. 8,39,350/15/6.",
      "addresses_issue": "i1",
      "key_observation": "The appellant undertook to discharge Sharma Co.'s liability for the agency."
    },
    {
      "id": "cr2",
      "text": "If the amount had been paid in lump sum it would constitute capital expenditure as it was for acquiring an asset or advantage for enduring benefit. The fact that paid in instalments through deductions does not make difference. The character depends on purpose, not quantum or manner.",
      "addresses_issue": "i2",
      "key_observation": "Payment for acquiring capital asset remains capital even if instalments."
    },
    {
      "id": "cr3",
      "text": "Cites Assam Bengal Cement: expenditure for asset/enduring benefit is capital; for running business is revenue. Aim and object determine character.",
      "addresses_issue": "i2",
      "key_observation": "Nature of expenditure based on object."
    },
    {
      "id": "cr4",
      "text": "Cites P.H. Divecha: large/periodic not decisive; name not determinative; periodicity may be convenience.",
      "addresses_issue": "i2",
      "key_observation": "Principles settled."
    },
    {
      "id": "cr5",
      "text": "Clause 13 makes no material difference; amount deducted pursuant to agreement to acquire agency right, which is capital asset. Liability undertaken for acquiring sole selling agency right.",
      "addresses_issue": "i2",
      "key_observation": "Application of income to discharge capital liability."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The sum of Rs. 43,333/- retained is not deductible as revenue expenditure under section 10; it is capital expenditure for acquiring the sole selling agency.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "The sum of Rs. 43,333/- is assessable income of the appellant as it was not payable to them.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Assam Bengal Cement Co. Ltd. v. Commissioner of Income Tax, West Bengal",
      "citation": "1955 27 I.T.R. 34",
      "treatment": "followed",
      "relevance": "Expenditure for acquiring asset or enduring benefit is capital; for running business is revenue."
    },
    {
      "case_name": "P. H. Divecha (Deceased) and After Him His Legal Representatives and Another v. Commissioner of Income Tax, Bombay City",
      "citation": "1963 48 I.T.R. 222",
      "treatment": "followed",
      "relevance": "Large/periodic payments not decisive; periodicity may be convenience; name indicative but not determinative."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income Tax Act, 1922",
      "sections": [
        "Section 66(1)",
        "Section 10"
      ],
      "relevance": "Reference of questions under s66(1); whether expenditure deductible under s10."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 133"
      ],
      "relevance": "Certificate for appeal to Supreme Court."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court upheld the judgment of the Allahabad High Court answering the referred questions against the appellant and in favour of revenue. There is no force in the appellant's contention and the High Court judgment is upheld.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The answer to the question as to whether the money paid is a revenue-expenditure or capital expenditure depends not so much upon the fact as to whether the amount paid is large or small or whether it has been paid in lump sum or by instalments, as it does upon the purpose for which the payment has been made.",
      "speaker": "court",
      "significance": "Core principle distinguishing capital from revenue expenditure."
    },
    {
      "text": "If the expenditure is made for acquiring or bringing into existence an asset or advantage for the enduring benefit of the business it is properly attributable to capital and is of the nature of capital expenditure.",
      "speaker": "court",
      "significance": "Test from Assam Bengal Cement applied to facts."
    },
    {
      "text": "The agents will have no claim whatsoever to any such amounts retained out of their normal trade discount and adjusted in the account of M/s Sharma Co. as if the amount so retained was not payable to them.",
      "speaker": "court",
      "significance": "Quotes clause 13, but holds it does not change capital nature."
    }
  ],
  "_case_id": "1972_316",
  "_label": 0,
  "_text_length": 13038,
  "_extracted_at": "2026-02-10T20:09:14.071325"
}