{
  "metadata": {
    "case_name": "M.S. Oberoi v. Commissioner of Income Tax",
    "case_year": 1969,
    "court": "Supreme Court of India",
    "judges": [
      "KHANNA, J."
    ],
    "case_number": "Civil Appeals Nos. 2492 and 2493 of 1969",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The matter relates to assessment years 1953-54 and 1954-55, the corresponding previous years for which ended on March 31, 1953 and March 31, 1954 respectively.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The appellant- assessee is the Managing Director of Messrs Hotels 1938 Ltd. and other associated companies controlling a number of hotels in India.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "For the assessment years 1953-54 and 1954-55, the appellant showed incomes of Rs. 66,694 and Rs. 87,570 as the gross dividend derived by him from shares held by him in Associated Hotels of India Ltd. (109,606 shares), Northern India Caterers Ltd. (20 shares), Oberoi Hotels Ltd. (10 shares).",
      "type": "admitted",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "The Income Tax Officer found that besides the above mentioned shares, the appellants wife (Smt. I.D. Oberoi) and two sons (Mr. P.R.S. Oberoi and Mr. T.R. Oberoi) held shares of Associated Hotels of India Ltd. and Northern India Caterers Ltd. and included the gross dividend of those shares in the total income of the assessee: Rs. 56,586 for 1953-54 and Rs. 39,542 for 1954-55.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "In the order relating to assessment year 1953-54, the Income Tax Officer observed: 'Besides the income shown from the above mentioned shares... other income from dividends which are held by Benamidars of the assessee have also to be assessed in the hands of the assessee. It is seen from the past records that the following shares standing in the names of the assessee wife Sm. I. D. Oberoi and the assessees two sons... do in fact belong to the assessee and are his own investments. The facts have also been admitted by the assessee before the department in the past years.'",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "Details of shares and dividends included for 1953-54: Smt. I.D. Oberoi - 15,886 shares Associated Hotels Rs. 3,971, 30 shares Northern India Caterers Rs. 15,273; Mr. T.R. Oberoi - 50 shares Northern India Caterers Rs. 25,454, 6,823 shares Associated Hotels Rs. 1,706; Mr. P.R.S. Oberoi - 20 shares Northern India Caterers Rs. 10,182; Total Rs. 56,586.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "For 1954-55: Smt. I.D. Oberoi - 15,886 shares Associated Hotels Rs. 3,177, 30 shares Northern India Caterers Rs. 10,500; Shri T.R. Oberoi - 50 shares Northern India Caterers Rs. 17,500, 6,823 shares Associated Hotels Rs. 1,365; Shri P.R.S. Oberoi - 20 shares Northern India Caterers Rs. 7,000; Total Rs. 39,542.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Appellate Assistant Commissioner upheld ITO, noting that the stand of the assessee had been negatived earlier for 1952-53 by order dated November 24, 1959.",
      "type": "procedural",
      "date": "1959-11-24",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Income Tax Investigation Commission found: Sri M. S. Oberoi owned 78,650 ordinary shares in his own name, 15,885 shares in name of wife Sm. Iswarani Debi, 6823 shares in name of Sri T. R. Oberoi, 5,000 shares in name of daughter Sm. Rajarani Kapoor out of total 200,000 as on 31-3-47.",
      "type": "material",
      "date": "1947-03-31",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Assessee's letter to Commission: 'In preparing the statement of wealth, I have taken into account all the assets of which I and other members of my family are possessed... All the money that was evaded is invested mainly in the shares of Associated Hotels of India Ltd.' Suppressed income determined at Rs. 16,62,211, shares acquired out of it.",
      "type": "admitted",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f11",
      "text": "Tribunal in second appeal directed exclusion of Rs. 56,586 and Rs. 39,542, holding registered holders assessable; noted Commission considered only Associated Hotels shares, not Northern India Caterers.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "High Court answered question in negative in favour of revenue: shares purchased benami by assessee, burden on assessee not discharged; real owner assessable even if registered holders are wife/sons.",
      "type": "procedural",
      "date": "1969-11-25",
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether on the facts and in the circumstances of the case, the Tribunal was justified in excluding from the assessable income of the assessee for the assessment years 1953-54 and 1954-55 the sums of Rs. 56,586 and Rs. 39,542 which were the amounts of dividend received by the assessees wife and two sons from shares acquired out of the profits of the assessee?",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The High Court was in error in interfering with the finding of the Tribunal that the wife and the two sons of the assessee, who were the registered holders of the shares in question, could only be assessed for the dividend income from those shares.",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": "Howrah Trading Co. v. Commissioner of Income Tax"
    },
    {
      "id": "pa2",
      "text": "Income Tax Investigation Commission had considered only the shares of the Associated Hotels of India, but the bulk of dividend included was from Northern India Caterers Ltd.",
      "supporting_facts": [
        "f9",
        "f11"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "No such admission had been made by assessee that shares belong to him.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Shares standing in names of wife and sons belong to assessee, held benami, as per past records and admission by assessee; income to be included in assessee's hands.",
      "supporting_facts": [
        "f5",
        "f9",
        "f10"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Stand of assessee negatived earlier for 1952-53.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The question referred assumes shares acquired out of profits of assessee; ITO order shows admission by assessee in past that shares belong to him; ample material to justify inference assessee real owner, held benami.",
      "addresses_issue": "i1",
      "key_observation": "Although normally for department to show apparent not real, here ample material including admission."
    },
    {
      "id": "cr2",
      "text": "Tribunal erred in relying on Howrah Trading Co., which was considered in Kishanchand Lunidasing Bajaj v. CIT: company recognizes registered shareholder but for tax, dividend accrues to real owner; grossing up not limited to registered holder.",
      "addresses_issue": "i1",
      "key_observation": "Tribunal excluded on legally untenable ground."
    },
    {
      "id": "cr3",
      "text": "Once found assessee real owner and purchased benami, ownership presumed to continue unless shown otherwise; no such evidence by assessee.",
      "addresses_issue": "i1",
      "key_observation": "Tribunal's approach erroneous."
    },
    {
      "id": "cr4",
      "text": "Finding on benami is question of fact if based on evidence, but Tribunal did not deal with whether purchase was benami.",
      "addresses_issue": "i1",
      "key_observation": "Meenakshi Mills v. CIT."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The real owner could be assessed on the dividend income even though his wife and sons were the registered holders of the shares.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Tribunal not justified in excluding the dividends; High Court correct in answering question in negative.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Howrah Trading Co. v. Commissioner of Income Tax",
      "citation": "1966 60 I.T.R. 500",
      "treatment": "distinguished",
      "relevance": "Tribunal relied on it to hold registered holder alone assessable; SC held not applicable as per later larger bench."
    },
    {
      "case_name": "Kishanchand Lunidasing Bajaj v. Commissioner of Income Tax",
      "citation": null,
      "treatment": "followed",
      "relevance": "Company recognizes registered shareholder but tax on real owner; HUF assessable on dividends from shares in karta's name."
    },
    {
      "case_name": "Meenakshi Mills v. Commissioner of Income Tax",
      "citation": null,
      "treatment": "referred",
      "relevance": "Tribunal finding on benami is fact if based on evidence, binding in reference."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income Tax Act, 1922",
      "sections": [
        "Section 66(1)",
        "Section 18(5)",
        "Section 16(2)"
      ],
      "relevance": "Reference under 66(1); dividend income and grossing up under 18(5) and 16(2) for registered vs real owner."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court dismissed the assessee's appeals by special leave against the Calcutta High Court judgment, upholding the inclusion of dividends from shares held benami by wife and sons in the assessee's income for 1953-54 and 1954-55.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "'It is seen from the past records that the following shares standing in the names of the assessee wife... do in fact belong to the assessee and are his own investments. The facts have also been admitted by the assessee before the department in the past years.'",
      "speaker": "lower_court",
      "significance": "ITO's observation on admission, unchallenged, key to benami finding."
    },
    {
      "text": "'All the money that was evaded is invested mainly in the shares of Associated Hotels of India Ltd.'",
      "speaker": "petitioner",
      "significance": "Assessee's admission to Commission on source of investments."
    },
    {
      "text": "'Once it was found that the assessee was the real owner of the shares and they had been purchased benami in the name of his wife and two sons, it would be presumed that the ownership of the shares continued to remain vested in the assessee.'",
      "speaker": "court",
      "significance": "Core holding on presumption of continued ownership."
    }
  ],
  "_case_id": "1972_457",
  "_label": 0,
  "_text_length": 13794,
  "_extracted_at": "2026-02-10T20:10:24.227213"
}