{
  "metadata": {
    "case_name": "Sasti alias Satish Chowdhary v. State of West Bengal",
    "case_year": 1972,
    "court": "Supreme Court of India",
    "judges": [
      "Khanna, J."
    ],
    "case_number": "Writ Petition No. 37 of 1972",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Petition under Article 32 for writ of habeas corpus by Sasti alias Satish Chowdhary detained under section 3 of Maintenance of Internal Security Act, 1971.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Detention order passed by District Magistrate Howrah on September 8, 1971 to prevent petitioner from acting prejudicial to maintenance of supplies and services essential to community.",
      "type": "material",
      "date": "1971-09-08",
      "source": "respondent"
    },
    {
      "id": "f3",
      "text": "Petitioner found absconding after order, arrested on November 23, 1971 and served with detention order, grounds and vernacular translation on same day.",
      "type": "procedural",
      "date": "1971-11-23",
      "source": "respondent"
    },
    {
      "id": "f4",
      "text": "District Magistrate sent report to State Government on September 8, 1971 with grounds and particulars; approved by State on September 10, 1971.",
      "type": "procedural",
      "date": "1971-09-08",
      "source": "respondent"
    },
    {
      "id": "f5",
      "text": "State Government sent report to Central Government on September 10, 1971 regarding necessity of order.",
      "type": "procedural",
      "date": "1971-09-10",
      "source": "respondent"
    },
    {
      "id": "f6",
      "text": "Petitioner's representation received by State Government on December 10, 1971, rejected on December 21, 1971.",
      "type": "procedural",
      "date": "1971-12-10",
      "source": "respondent"
    },
    {
      "id": "f7",
      "text": "Case placed before Advisory Board on December 22, 1971 with representation; Board heard petitioner in person and reported on January 28, 1972 that there was sufficient cause for detention.",
      "type": "procedural",
      "date": "1971-12-22",
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "State Government confirmed detention order on February 11, 1972 and communicated to petitioner.",
      "type": "procedural",
      "date": "1972-02-11",
      "source": "respondent"
    },
    {
      "id": "f9",
      "text": "On 9.7.71 at about 23.30 hrs., petitioner and associates Sk. Nazam, Kesta Adhikary, Bablu Das, Kachi Chakravarty and 3/4 others found committing theft of overhead electric wires near Zanana Latrine of Lawrence Co. at Chakkashi by darwans; petitioner and two associates arrested at spot with stolen copper wire, causing complete dislocation of electric supplies.",
      "type": "material",
      "date": "1971-07-09",
      "source": "grounds_of_detention"
    },
    {
      "id": "f10",
      "text": "Affidavit filed by Shri Dipak Kumar Rudra, District Magistrate, in opposition.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether detention order can be made if the act attributed constitutes an offence under Indian Penal Code, or petitioner should only be tried in court.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether the ground of detention is germane to object under section 3(1)(a)(iii) of MISA.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "As the act attributed to petitioner in grounds of detention constituted an offence under Indian Penal Code, petitioner could only be tried in court of law and no order for detention could be made.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": "Indian Penal Code"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Detention order valid as grounds germane to preventing acts prejudicial to maintenance of supplies and services; affidavit by District Magistrate.",
      "supporting_facts": [
        "f2",
        "f9"
      ],
      "legal_basis": "Section 3, Maintenance of Internal Security Act, 1971"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Detaining authority can pass detention order if grounds germane to object, even if act constitutes IPC offence; no legal bar, as detention may be justified where insufficient evidence for conviction under Evidence Act.",
      "addresses_issue": "i1",
      "key_observation": "Fact that act constitutes offence does not prevent detention if relevant and germane."
    },
    {
      "id": "cr2",
      "text": "Incident of theft of electric wires causing complete dislocation of supplies is germane to section 3(1)(a)(iii) MISA.",
      "addresses_issue": "i2",
      "key_observation": "Ground relevant to preventing prejudice to essential supplies/services."
    },
    {
      "id": "cr3",
      "text": "Even if prosecuted and discharged, detention valid if based on incident; cites Mohd. Salim Khan and Sahib Singh Duggal.",
      "addresses_issue": "i1",
      "key_observation": "Discharge in criminal case does not make detention incompetent."
    },
    {
      "id": "cr4",
      "text": "Distinction between public order and law/order one of degree; act here affects supplies essential to community.",
      "addresses_issue": "i2",
      "key_observation": "Theft causing dislocation affects public interest beyond individual crime."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Detention order valid even if based on act constituting IPC offence, provided germane to detention object.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Ground of theft of electric wires causing supply dislocation germane under section 3(1)(a)(iii) MISA.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Mohd. Salim Khan v. Shri C. C. Bose",
      "citation": "Writ Petition No. 435 of 1971, decided on April 25, 1972",
      "treatment": "followed",
      "relevance": "Discharge in criminal case does not invalidate detention based on same incident."
    },
    {
      "case_name": "Sahib Singh Duggal v. Union of India",
      "citation": "1966 1 S.C.R. 313",
      "treatment": "relied upon",
      "relevance": "Supports validity of detention despite criminal proceedings."
    },
    {
      "case_name": "Pushkar Mukherjee v. State of West Bengal",
      "citation": "1969 2 S.C.R. 635",
      "treatment": "referred",
      "relevance": "Distinction between public order and law/order; analogy to public vs private crimes."
    },
    {
      "case_name": "Arjun Ghosh v. State of West Bengal",
      "citation": null,
      "treatment": "followed",
      "relevance": "Distinction between law/order and public order is one of degree and reach upon society."
    }
  ],
  "statutes_cited": [
    {
      "name": "Maintenance of Internal Security Act, 1971",
      "sections": [
        "Section 3(1)",
        "Section 3(2)",
        "Section 3(1)(a)(iii)"
      ],
      "relevance": "Authorizes detention to prevent acts prejudicial to maintenance of supplies/services essential to community."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 32"
      ],
      "relevance": "Basis for writ petition of habeas corpus."
    },
    {
      "name": "Indian Penal Code",
      "sections": [],
      "relevance": "Act of theft constitutes offence, but does not bar detention."
    },
    {
      "name": "Indian Evidence Act",
      "sections": [],
      "relevance": "Detention possible even without sufficient admissible evidence for conviction."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Court dismissed the petition, upholding the validity of the detention order under MISA as the grounds were germane to preventing prejudice to essential supplies and services, despite constituting an IPC offence.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"It is always open to the detaining authority to pass an order for the detention of a person if the grounds of detention are germane to the object for which a detention order can legally be made.\"",
      "speaker": "court",
      "significance": "Core holding rejecting petitioner's main contention."
    },
    {
      "text": "\"The fact that the particular act of the detenu which provides the reason for the making of the detention order constitutes an offence under the Indian Penal Code would not prevent the detaining authority from passing the order for detention.\"",
      "speaker": "court",
      "significance": "Clarifies no legal bar to preventive detention for penal acts."
    },
    {
      "text": "\"The above ground of detention, in our opinion, was germane to the object for which a detention order can be made under section 3(1)(a)(iii) of the Act.\"",
      "speaker": "court",
      "significance": "Validates specific ground based on incident."
    }
  ],
  "_case_id": "1972_257",
  "_label": 0,
  "_text_length": 8682,
  "_extracted_at": "2026-02-10T20:08:59.329959"
}