{
  "metadata": {
    "case_name": "Commissioner of Wealth Tax v. Assessee (Jain Undivided Family)",
    "case_year": 1971,
    "court": "Supreme Court of India",
    "judges": [
      "Grover, J."
    ],
    "case_number": "Civil Appeals Nos. 1090 of 1971 and 1686 of 1968",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "For the assessment year 1957-58, the valuation date being 31-12-1956, the Wealth Tax Officer assessed the family assets of the assessee in the status of a Hindu undivided family.",
      "type": "material",
      "date": "1957-58",
      "source": "lower_court"
    },
    {
      "id": "f2",
      "text": "On appeal to the Appellate Assistant Commissioner, contentions raised included: (i) upon the description of the assessee in the notice of demand the assessment should be deemed to have been made in the status of an association of persons which was not a unit on which tax could be levied under the Act; (ii) even if the assessee was to be treated as a Hindu undivided family, the imposition of wealth tax on such family was ultra vires the Constitution.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "The Appellate Tribunal held that the assessee followed the Jain religion and since the unit chargeable to wealth tax under s. 3 of the Act was either individual or Hindu undivided family or company, none of the units covered the case of the assessee which was a Jain family. Jains were not Hindus, therefore, the expression Hindu undivided family in s. 3 did not cover the case of a Jain family. The Tribunal set aside the assessment on this ground alone.",
      "type": "disputed",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f4",
      "text": "The Commissioner of Wealth tax filed an application under s. 27(1) of the Act praying that the question of law arising out of the order of the Tribunal be referred to the High Court.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f5",
      "text": "At the time of the hearing of that application it was suggested on behalf of the assessee that further questions arising out of the order of the Tribunal should also be referred.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "The Tribunal referred the following questions: (1) Whether, the assessee, a Jain undivided family, was not a Hindu undivided family within the meaning of s. 3 of the Wealth tax Act, 1957, and as such the Tribunal was right in setting aside the assessment made on the assessee? (2) Whether levy of Wealth tax on Hindu undivided family or joint family governed under Mitakshra school of Hindu law was beyond the legislative competence of Parliament and ultra vires the Constitution of India? (3) Whether the Wealth Tax Act in so far as it purports to levy Wealth tax on Hindu undivided families is void and inoperative as it offends Article 14 of the Constitution of India?",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "The High Court held that Jains not being Hindus in the generally accepted sense, a Jain undivided family could not be a Hindu undivided family although the incidence of a Jain family and a Hindu family may be the same or largely the same. Members must be Hindus to form HUF. Answer to first question returned in affirmative in favour of assessee. Other two questions not pressed.",
      "type": "background",
      "date": "1967-08-25",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Indisputably ever since income tax laws have been in force no distinction has ever been made between a Jain undivided family and a Hindu undivided family and a Jain family has always been assessed as a Hindu undivided family. Even in the forms prescribed for making returns of Income tax no such differentiation or distinction has ever been made.",
      "type": "admitted",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether a Jain undivided family is included in the expression Hindu undivided family within s. 3 of the Wealth Tax Act 1957?",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether levy of Wealth tax on Hindu undivided family or joint family governed under Mitakshra school of Hindu law was beyond the legislative competence of Parliament and ultra vires the Constitution of India?",
      "framed_by": "tribunal"
    },
    {
      "id": "i3",
      "text": "Whether the Wealth Tax Act in so far as it purports to levy Wealth tax on Hindu undivided families is void and inoperative as it offends Article 14 of the Constitution of India?",
      "framed_by": "tribunal"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Upon the description of the assessee in the notice of demand the assessment should be deemed to have been made in the status of an association of persons which was not a unit on which tax could be levied under the Act.",
      "supporting_facts": [
        "f2"
      ],
      "legal_basis": "Wealth Tax Act 1957"
    },
    {
      "id": "pa2",
      "text": "Even if the assessee was to be treated as a Hindu undivided family, the imposition of wealth tax on such family was ultra vires the Constitution.",
      "supporting_facts": [
        "f2"
      ],
      "legal_basis": "Constitution of India"
    },
    {
      "id": "pa3",
      "text": "Jains are governed by Hindu law and thus Jain undivided family falls within Hindu undivided family under s.3.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": "s.3 Wealth Tax Act; historical judicial and legislative practice"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Jains were not Hindus and therefore the expression Hindu undivided family in s. 3 did not cover the case of a Jain family.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": "s.3 Wealth Tax Act 1957"
    },
    {
      "id": "ra2",
      "text": "Jains not being Hindus in the generally accepted sense, a Jain undivided family could not be a Hindu undivided family although the incidence may be the same.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "s.3 Wealth Tax Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Under s. 3 of the Act it is the Hindu undivided family which is one of the assessable entities. It should be distinguished from a Hindu coparcenary which is narrower. Hindu joint family consists of all persons lineally descended from a common ancestor, and includes their wives and unmarried daughters.",
      "addresses_issue": "i1",
      "key_observation": "Hindu undivided family is a wider expression than coparcenary."
    },
    {
      "id": "cr2",
      "text": "The expression Hindu undivided family in Income tax statutes has reference not to one school of Hindu law only but to all schools.",
      "addresses_issue": "i1",
      "key_observation": "Includes all schools, not limited to Mitakshara."
    },
    {
      "id": "cr3",
      "text": "In Nathu Sao v. Commissioner of Income tax, held that ordinarily Hindu Law applied to Jains and expression Hindu undivided family was wider, including widowed mother and aunt.",
      "addresses_issue": "i1",
      "key_observation": "Jain family treated as HUF."
    },
    {
      "id": "cr4",
      "text": "No distinction ever made in practice between Jain UDF and HUF in tax laws.",
      "addresses_issue": "i1",
      "key_observation": "Consistent assessment practice."
    },
    {
      "id": "cr5",
      "text": "Although Hindu law applies to Jains except varied by custom, Jains do not become Hindus like Khojas etc. But Hinduism does not include converts or dissenters with divergent usages.",
      "addresses_issue": "i1",
      "key_observation": "Distinguishes from converts."
    },
    {
      "id": "cr6",
      "text": "P.F. Pinto distinguished: Christians not HUF even if governed by Hindu law for succession.",
      "addresses_issue": "i1",
      "key_observation": "But Jains different."
    },
    {
      "id": "cr7",
      "text": "Real question: whether Hindu in HUF means (i) profess Hindu religion or (ii) to whom Hindu law applies or (iii) regarded as HUF by judicial decisions and legislative practice.",
      "addresses_issue": "i1",
      "key_observation": "Third sense applies."
    },
    {
      "id": "cr8",
      "text": "Modern trend against view that Jains are Hindu dissenters; Jainism parallel creed, independent law, but courts applied Hindu law due to concealment of Shastras.",
      "addresses_issue": "i1",
      "key_observation": "Historical application of Hindu law."
    },
    {
      "id": "cr9",
      "text": "Post-1926 enactments and codifications apply to Jains; too late to contend Jains not Hindus for law purposes.",
      "addresses_issue": "i1",
      "key_observation": "Legislative recognition."
    },
    {
      "id": "cr10",
      "text": "In various statutes, Hindu includes Jains unless separately mentioned ex-abundanti cautela.",
      "addresses_issue": "i1",
      "key_observation": "Legislative practice."
    },
    {
      "id": "cr11",
      "text": "New Hindu codifications (Marriage, Succession etc. 1955-56) include Jains by term Hindu; Jain UDF governed by same incidents as HUF.",
      "addresses_issue": "i1",
      "key_observation": "HUF legal expression includes Jain UDF."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The expression Hindu undivided family will certainly include the Jain undivided family. The latter class of family is not known to law apart from Hindu undivided family.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Banarsi Dass v. Wealth Tax Officer, Special Circle, Meerut",
      "citation": "56 I.T.R. 224",
      "treatment": "referred",
      "relevance": "Other questions not pressed in view of this decision."
    },
    {
      "case_name": "Nathu Sao v. Commissioner of Income tax C.P. Berar",
      "citation": "2 I.T.R. 463",
      "treatment": "followed",
      "relevance": "Identical question under Income tax; Jain family is HUF including widows."
    },
    {
      "case_name": "P. F. Pinto v. Commissioner of wealth Tax, Mysore",
      "citation": "65 I.T.R. 123",
      "treatment": "distinguished",
      "relevance": "Christian family not HUF even if governed by Hindu law for succession."
    },
    {
      "case_name": "Kalyani Vithal Das v. Commissioner of Income tax",
      "citation": null,
      "treatment": "followed",
      "relevance": "HUF refers to all schools of Hindu law."
    },
    {
      "case_name": "Bhagwandas Tejmal v. Rajmal",
      "citation": "10 Bom. HCR 241",
      "treatment": "referred",
      "relevance": "Jains regarded as sect of Hindus."
    },
    {
      "case_name": "Sheokuarbai v. Jeoraj",
      "citation": "L.R. 64 I.A. 28",
      "treatment": "referred",
      "relevance": "Jains of Hindu origin, dissenters."
    },
    {
      "case_name": "Bobbaradi Gateppa v. Bobbaladi Eramma",
      "citation": "A.I.R. 1927 Mad. 228",
      "treatment": "referred",
      "relevance": "Modern research shows Jains not dissenters."
    },
    {
      "case_name": "Panna Lal v. Sitabai",
      "citation": "I.L.R. 1954 Nagpur 30",
      "treatment": "followed",
      "relevance": "Too late to contend Jains not Hindus for law; legislative practice."
    },
    {
      "case_name": "Kamawati v. Digbijai Singh",
      "citation": "A.I.R. 1922 P.C. 14",
      "treatment": "referred",
      "relevance": "Hindu convert to Christianity not Hindu under Succession Act."
    },
    {
      "case_name": "Bachebi v. Makhan Lal",
      "citation": "I.L.R. 3 All. 55",
      "treatment": "followed",
      "relevance": "Hindu in Succession Act includes Jain."
    },
    {
      "case_name": "Bhagwan Koer v. J. C. Bose",
      "citation": "I.L.R. 31 Cal. 11",
      "treatment": "followed",
      "relevance": "Sikh is Hindu under Probate Act."
    },
    {
      "case_name": "Ambalal v. Keshav Bandhochand Gujar",
      "citation": "I.L.R. 1941 Bom. 250",
      "treatment": "followed",
      "relevance": "Jains governed by Hindu Law of Inheritance Amendment Act 1929."
    }
  ],
  "statutes_cited": [
    {
      "name": "Wealth Tax Act 1957",
      "sections": [
        "s. 3",
        "s. 2(c)",
        "s. 20",
        "s. 27(1)"
      ],
      "relevance": "Charge of wealth tax on individual, HUF, company; assessee definition; assessment after partition; reference to High Court."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 14",
        "Article 25"
      ],
      "relevance": "Equality; freedom of religion; questions on ultra vires and discrimination not pressed."
    },
    {
      "name": "Hindu Marriage Act 1955",
      "sections": [],
      "relevance": "Codification applying to Jains as Hindus."
    },
    {
      "name": "Hindu Succession Act 1956",
      "sections": [],
      "relevance": "Codification applying to Jains as Hindus."
    },
    {
      "name": "Hindu Minority and Guardianship Act 1956",
      "sections": [],
      "relevance": "Codification applying to Jains as Hindus."
    },
    {
      "name": "Hindu Adoption and Maintenance Act 1956",
      "sections": [],
      "relevance": "Codification applying to Jains as Hindus."
    },
    {
      "name": "Hindu Women's Rights to Property Act 1937",
      "sections": [],
      "relevance": "Applied to Jains."
    },
    {
      "name": "Indian Succession Act 1865",
      "sections": [
        "s. 331"
      ],
      "relevance": "Does not apply to Hindus including Jains."
    },
    {
      "name": "Hindu Law of Inheritance (Amendment) Act 1929",
      "sections": [],
      "relevance": "Applies to Jains."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "The appeal is allowed, the question referred is answered in favour of the Revenue and against the assessee. There will be no order as to costs in this Court. The appeal by Certificate CA 1686/68 being defective for want of reasons is hereby dismissed.",
    "relief_granted": "Assessment on Jain UDF as HUF upheld; Tribunal's order set aside implicitly.",
    "costs": "No order as to costs in this Court."
  },
  "key_quotes": [
    {
      "text": "\"The expression Hindu undivided family Will certainly include the Jain undivided family. The latter class of family is not known to law.\"",
      "speaker": "court",
      "significance": "Core holding that Jain UDF is HUF under Wealth Tax Act."
    },
    {
      "text": "\"Indisputably ever since income tax laws have been in force no distinction has ever been made between a Jain undivided family and a Hindu undivided family.\"",
      "speaker": "court",
      "significance": "Highlights consistent historical practice supporting inclusion."
    },
    {
      "text": "\"It is too late in the day to contend that Jains are not included in the term Hindus for the purposes of law.\"",
      "speaker": "court",
      "significance": "From Panna Lal, affirming judicial consensus."
    }
  ],
  "_case_id": "1972_30",
  "_label": 1,
  "_text_length": 22802,
  "_extracted_at": "2026-02-10T20:07:31.076178"
}