{
  "metadata": {
    "case_name": "Union of India v. Katrella Metal Corporation",
    "case_year": 1971,
    "court": "Supreme Court of India",
    "judges": [
      "Dua, J."
    ],
    "case_number": "Civil Appeal No. 1053 of 1971",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "On December 7, 1968 Lala Manickchand, proprietor of Messrs Katrella Metal Corporation, Madras, submitted an application, as a new unit, for the licensing period 1968-69 for the grant of an import licence for Rs. 9,900 for importing stainless steel as an actual user for manufacturing hospital requisites.",
      "type": "material",
      "date": "1968-12-07",
      "source": "respondent"
    },
    {
      "id": "f2",
      "text": "Registration certificate dated December 31, 1968 issued to the respondent as a small scale industry by the Additional Assistant Director of Industries Commerce, District Madras North, certifying it as engaged in the manufacture of Hospital and Surgical Instruments, Trays, Mugs, Basins and Household Utensils out of Stainless steel.",
      "type": "background",
      "date": "1968-12-31",
      "source": "lower_court"
    },
    {
      "id": "f3",
      "text": "According to Import Trade Control Policy 1968-69 industries engaged in the manufacture of medical and surgical equipment and appliances were included in the list of priority industries at sl. number 39 of Appendix I.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On January 30, 1969 Licensing Instruction No. 4/69 issued requiring scrutiny of applications for Stainless Steel Sheets, plates and strips from newcomer units, calling for data on registration, power, machinery, end products etc.",
      "type": "procedural",
      "date": "1969-01-30",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "On May 2, 1969 the respondent stated in a letter that hospital requisites such as surgical bowls, spittoons and trays were intended to be manufactured.",
      "type": "material",
      "date": "1969-05-02",
      "source": "respondent"
    },
    {
      "id": "f6",
      "text": "On May 19, 1969 Chief Controller issued General Licensing Instruction No. 29/69 clarifying that not all hospital equipment is priority under medical and surgical, e.g. lotion bowls, kidney trays etc. are non-priority.",
      "type": "procedural",
      "date": "1969-05-19",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "On May 29, 1969 Chief Controller issued General Licensing Instruction No. 31/69 providing list of end-products treated as priority under medical and surgical.",
      "type": "procedural",
      "date": "1969-05-29",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "On October 31, 1969 the Director of Industries, Madras, confirmed the Essentiality Certificate already issued to the respondent, noting machinery installed and power supply action taken.",
      "type": "procedural",
      "date": "1969-10-31",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "On February 23, 1970 Director of Industries wrote to Deputy Assistant Iron Steel Controller recommending respondent as PRIORITY INDUSTRY for import of stainless steel sheets for 1968-69 based on assurance to manufacture only Surgical Equipment like Sterilisers, Operation Tables, Auto-Claves etc.",
      "type": "material",
      "date": "1970-02-23",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Respondent filed writ petition No. 933 of 1970 on March 30, 1970 praying for mandamus directing Licensing Authority to consider applications for import licence.",
      "type": "procedural",
      "date": "1970-03-30",
      "source": "respondent"
    },
    {
      "id": "f11",
      "text": "Firms factory had been manufacturing various items since 1962 by purchasing raw material from local market with annual turnover of about 8 to 10 lacs.",
      "type": "background",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f12",
      "text": "On September 1, 1970 learned single Judge allowed writ petition directing Licensing Authority to consider applications within six months applying policy of 1968-69 or 1969-70 as per dates.",
      "type": "procedural",
      "date": "1970-09-01",
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "On March 25, 1971 Madras High Court Division Bench dismissed Writ Appeal No. 120 of 1971 extending time by three months.",
      "type": "procedural",
      "date": "1971-03-25",
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "In counter-affidavit, para 10 stated applications for non-priority end-products kept pending until examination complete; later instructions to consider in terms of 1970-71 policy.",
      "type": "admitted",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f15",
      "text": "Under 1970-71 policy, stainless steel sheets canalised for non-priority industries through Minerals and Metals Trading Corporation.",
      "type": "background",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "whether the application for the import licence in question should be considered in accordance with the policy in force when the licence is granted or when the application is made.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Licensing authority may decline licence on considerations like foreign exchange availability, State interest, canalisation; no absolute right merely on sponsoring recommendation; consider under policy at time of grant including monetary ceiling, indigenous availability etc. per para 91 Handbook.",
      "supporting_facts": [
        "f3",
        "f14",
        "f15"
      ],
      "legal_basis": "s.3(1)(a) Imports & Exports Control Act 1947; cl.6(1)(a) Imports Control Order 1955; para 91 Chapter IV Import Trade Control Handbook 1968; Glass Chatons Importers and Users Association v. Union of India (1961) 1 SCR 862"
    },
    {
      "id": "pa2",
      "text": "No undue delay or laches by department; respondent's application lacked specific end-use initially, included non-priority items; large number of newcomers required scrutiny.",
      "supporting_facts": [
        "f1",
        "f2",
        "f4",
        "f5",
        "f6"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Canalisation policy from April 1, 1970 applies; offers to consider under 1970-71 policy.",
      "supporting_facts": [
        "f15"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Applications to be considered in terms of policy at time of application per r.7(2) Chapter II Handbook 1968; sponsoring recommendation binding; assurance given for priority surgical equipment before canalisation.",
      "supporting_facts": [
        "f1",
        "f9"
      ],
      "legal_basis": "r.7(2) Chapter II, r.80, r.81(c) Import Trade Control Handbook 1968; r.82(2) para 53 Red Book 1968-69"
    },
    {
      "id": "ra2",
      "text": "Delay not attributable to respondent; other similar applicants granted licences; discriminatory if not granted.",
      "supporting_facts": [
        "f11",
        "f12"
      ],
      "legal_basis": "Sha Maggajee Saremall Bros v. Joint Chief Controller of Imports and Exports AIR 1966 Mad 309"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "No undue delay, laches or dilatoriness by Department; application included non-priority items initially, required scrutiny due to many newcomers and sensitive item; kept pending reasonably until examination.",
      "addresses_issue": "i1",
      "key_observation": "History of correspondence shows relevant reasons for not disposing during 1968-69."
    },
    {
      "id": "cr2",
      "text": "No absolute vested right to licence under policy at application time; authority better placed at grant time with overall picture; imports controlled considering economy, foreign exchange etc.",
      "addresses_issue": "i1",
      "key_observation": "Supreme consideration is over-all economy of the country."
    },
    {
      "id": "cr3",
      "text": "No prima facie case of mala fides or arbitrariness; not pressed in High Court; undertaking to consider under 1970-71 policy.",
      "addresses_issue": "i1",
      "key_observation": "No case made out for mandamus under 1968-69 policy."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Application for import licence to be considered in accordance with import policy at time of consideration/grant, not necessarily at time of application.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "No mandamus to consider under 1968-69 policy; respondent's application to be considered under 1970-71 policy without avoidable delay.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Glass Chatons Importers and Users Association v. Union of India",
      "citation": "1961 1 SCR 862",
      "treatment": "followed",
      "relevance": "Canalisation through agencies in public interest; import policy part of economic policy."
    },
    {
      "case_name": "Sha Maggajee Saremall Bros v. Joint Chief Controller of Imports and Exports",
      "citation": "AIR 1966 Mad 309",
      "treatment": "distinguished",
      "relevance": "Deals with transfer of quota rights in existing firm; not applicable to new units."
    },
    {
      "case_name": "Municipal Corporation for Greater Bombay v. Advance Builders (India) Pvt. Ltd.",
      "citation": "C.A. No. 1121 of 1970 decided on 25th August, 1971",
      "treatment": "referred",
      "relevance": "Mandamus for statutory duty not discretionary."
    }
  ],
  "statutes_cited": [
    {
      "name": "Imports and Exports (Control) Act, 1947",
      "sections": [
        "Section 3(1)(a)"
      ],
      "relevance": "Empowers Central Government to control imports."
    },
    {
      "name": "Imports Control Order, 1955",
      "sections": [
        "Clause 6(1)(a)"
      ],
      "relevance": "Power to refuse licence if no foreign exchange, prejudicial to State, or canalised."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; High Court order set aside; directed that respondent's application be considered in accordance with the import policy for 1970-71 without avoidable delay.",
    "relief_granted": "Direction to consider application under 1970-71 policy",
    "costs": "No order as to costs"
  },
  "key_quotes": [
    {
      "text": "the question canvassed at the bar is a very narrow one, namely, whether the application for the import licence in question should be considered in accordance with the policy in force when the licence is granted or when the application is made.",
      "speaker": "court",
      "significance": "Frames the core legal issue."
    },
    {
      "text": "an applicant has no absolute vested right to an import licence in terms of the policy in force at the time of his application because from the very nature of things at the time of granting the licence the authority concerned may often be in a better position to have a clearer over-all picture",
      "speaker": "court",
      "significance": "Key holding on no vested right to old policy."
    },
    {
      "text": "In our opinion, no case has been made out on the present record for a mandamus to the Department to consider the respondent's application for import licence in terms of 1968-69 policy.",
      "speaker": "court",
      "significance": "Rejects mandamus; allows appeal."
    }
  ],
  "_case_id": "1972_514",
  "_label": 1,
  "_text_length": 41187,
  "_extracted_at": "2026-02-10T20:10:28.930473"
}