{
  "metadata": {
    "case_name": "Sub-Inspector of Police (Appellant) v. State of West Bengal and Others",
    "case_year": 1967,
    "court": "Supreme Court of India",
    "judges": [
      "Beg, J."
    ],
    "case_number": "C. A. No. 1162 of 1967",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant was a Sub Inspector of Police serving in the Enforcement Branch of the Calcutta Police on 20th May 1951.",
      "type": "background",
      "date": "1951-05-20",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Appellant was ordered by S. Mukherji, Deputy Commissioner of Police, Enforcement Branch, to search a house at 13/2 Sir Guru Das Road, in Kankurgachi Basti.",
      "type": "material",
      "date": "1951-05-20",
      "source": "appellant"
    },
    {
      "id": "f3",
      "text": "Search concluded at 6-30 a.m., and thereafter appellant went to take tea with the permission and or knowledge of his immediate superior Sub Inspector S. Bose.",
      "type": "disputed",
      "date": "1951-05-20",
      "source": "appellant"
    },
    {
      "id": "f4",
      "text": "Appellant was met by Assistant Commissioner of Police Ataur Rahman while returning from tea, at a distance of about one furlong from the place of duty.",
      "type": "disputed",
      "date": "1951-05-20",
      "source": "appellant"
    },
    {
      "id": "f5",
      "text": "Assistant Commissioner charged appellant with dereliction of duties, disobedience of order to remain at post, perfunctory search, disloyalty, and giving away information of proposed searches.",
      "type": "material",
      "date": "1951-05-20",
      "source": "appellant"
    },
    {
      "id": "f6",
      "text": "Appellant was immediately suspended and Ataur Rahman appointed Enquiry Officer.",
      "type": "procedural",
      "date": "1951-05-20",
      "source": "appellant"
    },
    {
      "id": "f7",
      "text": "Alleged violations of Police Regulations in Bengal: charges not made clear, no opportunity to defend or cross-examine witnesses.",
      "type": "disputed",
      "date": null,
      "source": "appellant"
    },
    {
      "id": "f8",
      "text": "Proceeding result of bias and ill-will of Deputy Commissioner S. Mukherji due to appellant's proceedings against antisocial elements friendly with Mukherji.",
      "type": "disputed",
      "date": null,
      "source": "appellant"
    },
    {
      "id": "f9",
      "text": "Appellant harassed by false criminal proceedings under Essential Supplies Act and Section 124-A I.P.C. in October 1951 due to grudge.",
      "type": "disputed",
      "date": "1951-10",
      "source": "appellant"
    },
    {
      "id": "f10",
      "text": "Appellant served with show cause notices at two stages, produced evidence considered relevant; permission for other evidence and cross-examination of some witnesses denied; five prosecution witnesses cross-examined; seven defence witnesses examined.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Dismissed from Police Force by Deputy Commissioner S. Mukherji on 1-8-1951.",
      "type": "material",
      "date": "1951-08-01",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Appeal to Inspector General of Police dismissed on 27-10-1951.",
      "type": "procedural",
      "date": "1951-10-27",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Memorial submitted to Govt. of West Bengal.",
      "type": "procedural",
      "date": null,
      "source": "appellant"
    },
    {
      "id": "f14",
      "text": "Appellant went to Andaman Islands in November 1952 fearing harassment.",
      "type": "background",
      "date": "1952-11",
      "source": "appellant"
    },
    {
      "id": "f15",
      "text": "Writ petition under Article 226 filed on 9th September 1953.",
      "type": "procedural",
      "date": "1953-09-09",
      "source": "court"
    },
    {
      "id": "f16",
      "text": "Single Judge of Calcutta High Court dismissed petition on 11-9-1957 on grounds of inordinate delay and objection to jurisdiction not raised earlier; also held on merits no violation of Art 311(1), no mala fides.",
      "type": "procedural",
      "date": "1957-09-11",
      "source": "lower_court"
    },
    {
      "id": "f17",
      "text": "Division Bench dismissed appeal principally on ground of inordinate delay, despite noting possible violation of natural justice.",
      "type": "procedural",
      "date": "1963-05-14",
      "source": "lower_court"
    },
    {
      "id": "f18",
      "text": "Certificate under Article 133(1)(c) obtained for appeal to Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether there was inordinate delay in filing the writ petition under Article 226 precluding discretionary relief.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether Deputy Commissioner of Police had power to dismiss appellant, being lower than appointing authority, violating Article 311(1).",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether departmental enquiry violated natural justice: denial of opportunity to adduce evidence, cross-examine, bias/mala fides of Deputy Commissioner.",
      "framed_by": "petitioner"
    },
    {
      "id": "i4",
      "text": "Whether disputed questions of fact could be decided in Article 226 proceedings.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Went for tea with permission; charged unfairly by Ataur Rahman; violations of Police Regulations; bias and ill-will by S. Mukherji; false criminal proceedings; no clear charges, no opportunity to defend/cross-examine.",
      "supporting_facts": [
        "f3",
        "f4",
        "f5",
        "f7",
        "f8",
        "f9"
      ],
      "legal_basis": "Police Regulations in Bengal; Article 311"
    },
    {
      "id": "pa2",
      "text": "Deputy Commissioner lower than appointing authority (Principal of Police Training School).",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": "Article 311(1)"
    },
    {
      "id": "pa3",
      "text": "Delay explained by fleeing to Andaman fearing harassment; writ within 3 years, analogous to limitation for suit.",
      "supporting_facts": [
        "f14",
        "f15"
      ],
      "legal_basis": "State of Madhya Pradesh v. Bhailal Ors.; Article 226"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Enquiry fair and impartial; show cause notices served; evidence produced and considered; no grudge or ill-will.",
      "supporting_facts": [
        "f10"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Deputy Commissioner same grade as appointing authority; dismissal confirmed by Inspector General.",
      "supporting_facts": [
        "f11",
        "f12"
      ],
      "legal_basis": "Article 311(1)"
    },
    {
      "id": "ra3",
      "text": "Inordinate unexplained delay; disputed facts not for writ jurisdiction.",
      "supporting_facts": [
        "f15",
        "f16",
        "f17"
      ],
      "legal_basis": "Article 226 discretion; laches"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Delay in filing writ (from 1951 dismissal to 1953 petition) inordinate and unexplained; fleeing to Andaman not credible; delay defeats discretionary relief under Article 226 even if within suit limitation.",
      "addresses_issue": "i1",
      "key_observation": "Reliance on Bhailal case: delay measured against suit limitation but not inflexible; public interest in promptness for public servants."
    },
    {
      "id": "cr2",
      "text": "Disputed facts (bias, opportunity, mala fides) not to be decided on affidavits in Article 226; better for civil suit per T.R. Varma.",
      "addresses_issue": "i4",
      "key_observation": "Deputy Commissioner not complainant; Ataur Rahman was enquiring officer."
    },
    {
      "id": "cr3",
      "text": "No violation of Article 311(1); Deputy Commissioner same status as appointing authority, confirmed by higher authority.",
      "addresses_issue": "i2",
      "key_observation": "Objection not raised earlier."
    },
    {
      "id": "cr4",
      "text": "High Courts rightly consider delay, nature of controversy in exercising Article 226 discretion.",
      "addresses_issue": "i1",
      "key_observation": "Quashing dismissal would allow fresh proceedings; suit for damages more appropriate."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Inordinate delay defeats right to discretionary relief under Article 226.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Disputed questions of fact regarding departmental proceedings not to be decided in writ jurisdiction.",
      "resolves_issue": "i4",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Dismissal not vitiated by lack of power under Article 311(1) or bias.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "State of Madhya Pradesh v. Bhailal Ors",
      "citation": "1964 S.C.R. 261",
      "treatment": "followed",
      "relevance": "Delay in Article 226 measured against suit limitation but discretionary; not inflexible rule."
    },
    {
      "case_name": "Union of India v. T. R. Varma",
      "citation": "1958 S.C.R. 499",
      "treatment": "followed",
      "relevance": "Courts do not decide disputed facts on affidavits in Article 226 proceedings."
    },
    {
      "case_name": "Chandra Bhushan Anr. v. Deputy Director of Consolidation Regional U.P. Ors.",
      "citation": "1967 2 S.C.R. 286",
      "treatment": "distinguished",
      "relevance": "Short delay condoned; not applicable to inordinate unexplained delay here."
    },
    {
      "case_name": "Rabindra Nath Bose Ors. v. Union of India Ors.",
      "citation": "1970 2 S.C.R. 697",
      "treatment": "referred",
      "relevance": "No relief under Article 32 for inordinate delay without explanation."
    }
  ],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Article 133",
        "Article 226",
        "Article 311",
        "Article 32"
      ],
      "relevance": "Appeal certificate; writ jurisdiction discretion and delay; dismissal power; original jurisdiction delay."
    },
    {
      "name": "Police Regulations in Bengal",
      "sections": [],
      "relevance": "Alleged violations in enquiry procedure."
    },
    {
      "name": "Essential Supplies Act",
      "sections": [],
      "relevance": "False proceedings alleged against appellant."
    },
    {
      "name": "Indian Penal Code",
      "sections": [
        "Section 124-A"
      ],
      "relevance": "False proceedings alleged against appellant."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court dismissed the appeal, upholding the Calcutta High Court's dismissal of the writ petition on grounds of inordinate and unexplained delay defeating discretionary relief under Article 226, and disputed facts unsuitable for writ jurisdiction. Appellant advised to seek civil suit if desired.",
    "relief_granted": "None",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"the maximum period fixed by the legislature as the time within which the relief by a suit in a civil Court must be brought may ordinarily be taken to be a reasonable standard by which delay in seeking remedy under Article 226 can be measured.\"",
      "speaker": "court",
      "significance": "From Bhailal case, cited to assess delay."
    },
    {
      "text": "\"it is not the practice of Courts to decide such disputed questions of fact in proceedings under Article 226 of the Constitution.\"",
      "speaker": "court",
      "significance": "Rule from T.R. Varma justifying dismissal on facts dispute."
    },
    {
      "text": "\"If the appellant before us had been able to give a satisfactory explanation as to why he could not move the Court within a few weeks after June 1952, we would have felt disposed to allow the appeal.\"",
      "speaker": "lower_court",
      "significance": "Division Bench on delay being fatal despite procedural issues."
    }
  ],
  "_case_id": "1972_548",
  "_label": 0,
  "_text_length": 20194,
  "_extracted_at": "2026-02-10T20:11:08.533236"
}