{
  "metadata": {
    "case_name": "Legal Representatives of Ram Cheej Pandey v. Lachhman Singh and Ors.",
    "case_year": 1967,
    "court": "Supreme Court of India",
    "judges": [
      "KHANNA, J."
    ],
    "case_number": "Civil Appeal No. 1308 of 1967",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "On January 16, 1923 Ganga Prasad Rai, father of Lachhman Singh plaintiff-respondent No. 7, executed a mortgage deed in respect of land in dispute for Rs. 600 in favour of Ram Cheej Pandey and put him in possession thereof as a mortgagee.",
      "type": "material",
      "date": "1923-01-16",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Ganga Prasad Rai at the time of the mortgage was the occupancy tenant of the land in dispute.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Ram Cheej Pandey is dead and the appellants are his legal representatives, impleaded as defendants.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Plaintiff-respondents No. 1 to 6 along with Lachhman Singh (plaintiff No. 7) filed suit for possession on January 6, 1955 against Ram Cheej Pandey and others alleging Lachhman Singh transferred all his rights in the land with consent and permission of the Zamindar to plaintiffs 1 to 6, making them occupancy tenants.",
      "type": "procedural",
      "date": "1955-01-06",
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "Plaintiffs 1 to 6 claimed to have acquired Bhumidari rights by depositing ten times the amount of the land revenue.",
      "type": "material",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "Plaintiffs alleged right to redeem from mortgagee, who refused, so deposited amount in court; plaintiff No. 7 joined to avoid dispute.",
      "type": "material",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "Rai Narain Pandey (son of Ram Cheej), two minor sons of Raj Narain impleaded as defendants as members of joint Hindu family in possession.",
      "type": "background",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "Suit contested by Raj Narain Pandey, who admitted mortgage but denied plaintiffs 1-6 right to redeem and claimed suit barred by limitation due to adverse possession over 12 years.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f9",
      "text": "Trial court found suit not barred by time but plaintiffs had no right to sue; suit dismissed.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "First appellate court (Additional Civil Judge Ballia): plaintiffs 1-6 not successors of plaintiff 7; defendants became trespassers after mortgage; suit barred by time; appeal dismissed.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Allahabad High Court in second appeal: In 1946 plaintiffs 1-6 acquired same rights as vested in plaintiff 7 before surrender via agreement with Zamindar; mortgagee of occupancy holding by possession over 12 years does not extinguish mortgagor's redemption right; plaintiffs entitled to redeem; suit not barred; decree for possession to plaintiffs, defendants entitled to withdraw deposit; dated December 7, 1966.",
      "type": "procedural",
      "date": "1966-12-07",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Compromise decree dated January 4, 1946/February 2, 1945 in prior suit by plaintiffs 1-6 against landlords and Lachhman Singh accepted plaintiffs 1-6 as occupancy tenants.",
      "type": "background",
      "date": "1946-01-04",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Sanad dated October 5, 1949 declaring plaintiffs 1-6 as Bhumidars of the land.",
      "type": "material",
      "date": "1949-10-05",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether plaintiff-respondents 1 to 6 were entitled to sue for possession of the land on payment of the mortgage money.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the suit was barred by limitation.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether the suit was maintainable in a civil court or only in revenue court.",
      "framed_by": "appellant"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Plaintiff-respondents 1 to 6 were not entitled to sue for possession on payment of mortgage money.",
      "supporting_facts": [
        "f1",
        "f2",
        "f12"
      ],
      "legal_basis": "U.P. Tenancy Act 1939 sections 33(1), 44(1) (transfer of occupancy interest void); surrender by Lachhman Singh extinguished rights including mortgage."
    },
    {
      "id": "pa2",
      "text": "Suit barred by limitation: after surrender, defendants trespassers; suit under section 180 U.P. Tenancy Act within 2 years (Fourth Schedule item 18(2)(b)); adverse possession over 12 years.",
      "supporting_facts": [
        "f11",
        "f12"
      ],
      "legal_basis": "U.P. Tenancy Act 1939 section 180, Fourth Schedule; Limitation Act (12 years adverse possession)"
    },
    {
      "id": "pa3",
      "text": "Plaintiff-respondents 1-6 not successors of Lachhman Singh; cannot redeem mortgage created by him.",
      "supporting_facts": [
        "f4",
        "f12"
      ],
      "legal_basis": null
    },
    {
      "id": "pa4",
      "text": "Suit not maintainable in civil court, only revenue court.",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": "U.P. Tenancy Act 1939"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Plaintiffs entitled to redeem; suit not barred by time; correctness of High Court view.",
      "supporting_facts": [
        "f4",
        "f5",
        "f11",
        "f12",
        "f13"
      ],
      "legal_basis": "Full Bench decisions: Ghassu v. Babu Ram; Mahabal Singh v. Ram Raj"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Mortgage of occupancy holding void but mortgagor cannot recover without paying; mortgagee possession over 12 years prescribes only mortgagee rights, not extinguish redemption right; analogous to mortgagor-mortgagee; successor entitled to redeem on payment.",
      "addresses_issue": "i1",
      "key_observation": "Five propositions from Ghassu (followed in Mahabal Singh Full Bench)"
    },
    {
      "id": "cr2",
      "text": "Plaintiffs 1-6 acquired same rights as Lachhman had before surrender via 1946 compromise decree with Zamindar; became occupancy tenants then Bhumidars; entitled to redeem under TPA sec 91(a).",
      "addresses_issue": "i1",
      "key_observation": "Successors of original mortgagor can redeem; same land."
    },
    {
      "id": "cr3",
      "text": "Not barred by limitation; follows Full Bench decisions; no extinction of redemption right.",
      "addresses_issue": "i2",
      "key_observation": "Adhere to High Court view on local statute over years (stare decisis); Brownsea Haven cited."
    },
    {
      "id": "cr4",
      "text": "Suit maintainable in civil court per Mahabal Singh Full Bench; no such plea earlier.",
      "addresses_issue": "i3",
      "key_observation": "No cogent ground to disturb."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Usufructuary mortgagee of occupancy holding by possession over 12 years prescribes only mortgagee rights; mortgagor/successor can redeem by payment.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Suit not barred by limitation; successors (occupancy tenants/Bhumidars) entitled to redeem under TPA sec 91(a).",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Suit maintainable in civil court.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Ghassu and Anr. v. Babu Ram and Anr.",
      "citation": "A.I.R. 1931 Allahabad 25",
      "treatment": "followed",
      "relevance": "Three-judge bench laying down five propositions on void mortgage of occupancy holding, redemption rights."
    },
    {
      "case_name": "Mahabal Singh and Anr. v. Ram Raj and Ors.",
      "citation": "A.I.R. 1950 Allahabad 604",
      "treatment": "followed",
      "relevance": "Five-judge Full Bench approving Ghassu propositions; suit maintainable in civil court."
    },
    {
      "case_name": "Brownsea Haven Properties v. Poole Corpn.",
      "citation": "1958 Ch. 574 (C.A.)",
      "treatment": "referred",
      "relevance": "Stare decisis: long-standing High Court decisions on local law not to be disturbed."
    }
  ],
  "statutes_cited": [
    {
      "name": "U.P. Tenancy Act, 1939",
      "sections": [
        "33(1)",
        "44(1)",
        "45(c)",
        "62",
        "180",
        "Fourth Schedule item No. 18 Group B subclause (2)(b)"
      ],
      "relevance": "Occupancy tenancy non-transferable (void); surrender; ejectment of unauthorized occupant (2 yr limitation); applied but not to bar redemption suit."
    },
    {
      "name": "Transfer of Property Act",
      "sections": [
        "91(a)"
      ],
      "relevance": "Any person with interest in mortgaged property (other than mortgagee) may redeem."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal dismissed with costs; High Court decree upheld awarding possession of land to plaintiff-respondents on redemption; defendants-appellants entitled to withdraw deposited mortgage amount.",
    "relief_granted": "Possession to plaintiff-respondents; defendants withdraw mortgage amount deposit",
    "costs": "Appeal dismissed with costs"
  },
  "key_quotes": [
    {
      "text": "That a mortgagee of an occupancy holding by remaining in possession for over 12 years does not extinguish the rights of the mortgagor to redeem him and by such possession the mortgagee only prescribes for mortgagee rights.",
      "speaker": "court",
      "significance": "Core holding from Ghassu Full Bench propositions adopted by Supreme Court."
    },
    {
      "text": "In the matter of the interpretation of a local statute, the view taken by the High Court over a number of years should normally be adhered to and not disturbed.",
      "speaker": "court",
      "significance": "Application of stare decisis to uphold High Court precedents."
    },
    {
      "id": "kq3",
      "text": "The case of the plaintiffs, who were the occupancy tenants and Bhumidars of the land in dispute, is clearly covered by clause (a) of section 91 of the Transfer of Property Act.",
      "speaker": "court",
      "significance": "Basis for plaintiffs' right to redeem as successors."
    }
  ],
  "_case_id": "1972_419",
  "_label": 0,
  "_text_length": 15709,
  "_extracted_at": "2026-02-10T20:09:50.524799"
}