{
  "metadata": {
    "case_name": "Regional Transport Authority & Ors. v. Kamath & Ors.",
    "case_year": 1970,
    "court": "Supreme Court of India",
    "judges": [
      "Ray, J."
    ],
    "case_number": "Civil Appeals Nos. 1084, 1091 of 1967 and 1081 of 1970",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "On 8 April 1963, Regional Transport Authority, South Kanara issued notification under Section 57(2) inviting applications from public carrier permit holders in South Kanara District to operate in Maharashtra under reciprocal agreement; 28 vacancies, 39 applications.",
      "type": "material",
      "date": "1963-04-08",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Respondent Kamath (Civil Appeal No. 1084/1967) applied for permit; rejected by RTA Mangalore; appeal rejected by State Transport Appellate Tribunal.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f3",
      "text": "Inter-State Transport Commission issued directions under Section 63A(2)(c) to RTAs laying down order of preference for grant of permits: (1) Co-operative Society (50% members unrelated, 75% employees, main business transport); (2) Other Transport Co-ops; (3) Limited company/registered firm; (4) Others.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "RTAs followed ISTC directions in grant of permits.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Kamath filed WP No. 442/1964 under Article 226 in Mysore High Court challenging RTA decision as vitiated by ISTC directions infringing RTA jurisdiction; High Court allowed WP on 9 June 1966.",
      "type": "procedural",
      "date": "1966-06-09",
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "On 20 September 1963, RTA Belgaum invited applications under Section 57(2) for variation of permits including three new inter-state routes to Maharashtra; 25 applications; Respondent Jaknur (Civil Appeal No. 1091/1967) rejected.",
      "type": "material",
      "date": "1963-09-20",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "ISTC issued directions on 3 October 1963 same as above for Belgaum case; Jaknur filed WP challenging on similar grounds; High Court allowed on 10 December 1964.",
      "type": "procedural",
      "date": "1963-10-03",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "On 26 September 1963, RTA called applications for inter-signature by Kerala STA for Mysore-Kerala routes under inter-state agreement; Respondent Hegde (Civil Appeal No. 1081/1970) applied, rejected on ground unable to command facilities to public.",
      "type": "material",
      "date": "1963-09-26",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Hegde filed WP challenging on grounds of ISTC directions; High Court allowed on 19 July 1966.",
      "type": "procedural",
      "date": "1966-07-19",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Appeals to Supreme Court by certificate from Mysore High Court judgments.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the Inter-State Transport Commission was competent under Section 63A(2)(c) of the Motor Vehicles Act, 1939 to issue directions to State/Regional Transport Authorities laying down order of preference in grant of permits.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Under Section 63A(2)(c), ISTC competent to issue directions regarding grant of permits; indicating order of preference amounts to laying down criteria to be applied.",
      "supporting_facts": [
        "f3",
        "f4"
      ],
      "legal_basis": "Section 63A(2)(c) of Motor Vehicles Act, 1939"
    },
    {
      "id": "pa2",
      "text": "Reasoning in B. Rajagopala Naidu does not apply as Section 63A(2)(c) speaks only of 'directions' not 'orders and directions'; Section 63A confers separate powers including directions on grant of permits.",
      "supporting_facts": [],
      "legal_basis": "Section 63A(2)(c); B. Rajagopala Naidu v. State Transport Appellate Tribunal"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "ISTC directions invaded, infringed and impinged on authority and quasi-judicial jurisdiction of Transport Authorities for grant of permits; decisions vitiated.",
      "supporting_facts": [
        "f3",
        "f4",
        "f5",
        "f7",
        "f9"
      ],
      "legal_basis": "Quasi-judicial functions under Motor Vehicles Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Section 63A(2)(c) empowers ISTC to issue directions of executive and administrative nature only; cannot entrench on quasi-judicial functions of RTAs in grant of permits.",
      "addresses_issue": "i1",
      "key_observation": "Directions laying down order of preference fetter judicial discretion of RTAs; similar to Section 43A in Naidu case."
    },
    {
      "id": "cr2",
      "text": "No power to make rules; delegation of legislative power not inferred; Section 63A(4) indicates directions are administrative as authorities 'guided' by them.",
      "addresses_issue": "i1",
      "key_observation": "Act structure preserves quasi-judicial area for RTAs; Section 55 gives limited preference to co-ops 'as far as may be'."
    },
    {
      "id": "cr3",
      "text": "RTAs discharge quasi-judicial functions in assessing rival claims for permits; decisions cannot be clogged by preference directions.",
      "addresses_issue": "i1",
      "key_observation": "High Court correct in holding directions encroach on quasi-judicial jurisdiction."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Power under Section 63A(2)(c) limited to executive/administrative directions; no power to issue directions fettering quasi-judicial discretion of RTAs in grant of permits.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "B. Rajagopala Naidu v. State Transport Appellate Tribunal Ors.",
      "citation": "(1964) 7 SCR 1",
      "treatment": "followed",
      "relevance": "Construed Section 43A; government directions cannot cover quasi-judicial matters like permit grants; applied analogous reasoning to Section 63A(2)(c)."
    }
  ],
  "statutes_cited": [
    {
      "name": "Motor Vehicles Act, 1939",
      "sections": [
        "Section 45",
        "Section 55",
        "Section 57(2)",
        "Section 63",
        "Section 63A(2)(c)",
        "Section 63A(4)",
        "Section 133(1)"
      ],
      "relevance": "Governs permit grants, inter-state permits, ISTC functions, directions; RTAs exercise quasi-judicial powers under these."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 226"
      ],
      "relevance": "Basis for writ petitions challenging RTA decisions."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court upheld High Court orders quashing ISTC directions; appeals fail as ISTC lacked power to issue directions fettering RTAs' quasi-judicial functions in permit grants.",
    "relief_granted": "High Court orders quashing directions upheld; no appearance by respondents.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The power of the Inter-State Transport Commission under section 63A(2)(c) of the Act to issue directions is referable only to directions of executive and administrative nature.",
      "speaker": "court",
      "significance": "Core holding limiting scope of ISTC powers."
    },
    {
      "text": "It is...essential to fundamentals of fair-play in the administration of law that the decision of these Transport Authorities in the matter of grant of permits should not be clogged by directions indicating the order of preference.",
      "speaker": "court",
      "significance": "Emphasizes protection of quasi-judicial discretion."
    }
  ],
  "_case_id": "1972_331",
  "_label": 0,
  "_text_length": 15742,
  "_extracted_at": "2026-02-10T20:09:02.257367"
}