{
  "metadata": {
    "case_name": "Plaintiffs-Appellants v. Defendants-Respondent",
    "case_year": 1967,
    "court": "Supreme Court of India",
    "judges": [
      "Mitter, J."
    ],
    "case_number": "C.A. No. 1051 of 1967",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Plaintiffs-appellants are manufacturers of biscuits and confectionery and owners of registered trade marks including the word 'Gluco' on half pound biscuit packets and wrapper No. 9184 registered on 7th December 1942 under Trade Marks Act 1940.",
      "type": "background",
      "date": "1942-12-07",
      "source": "petitioner"
    },
    {
      "id": "f2",
      "text": "Plaintiffs' wrapper is buff colour depicting a farm yard with a girl in the centre carrying a pail of water, cows and hens around her, background of farmyard house and trees; used for Parle Gluco Biscuits.",
      "type": "material",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "Plaintiffs have been selling biscuits extensively under the trade mark for many years, acquiring great reputation and goodwill.",
      "type": "background",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "In March 1961, plaintiffs discovered defendants manufacturing, selling and offering for sale biscuits in a wrapper deceptively similar to plaintiffs' registered trade mark.",
      "type": "material",
      "date": "1961-03",
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "Plaintiffs sent lawyer's notice to defendants who persisted, leading to suit for injunction restraining infringement.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "Defendants pleaded ignorance of registration, denied deceptive similarity or infringement; claimed differences in design: girl supporting bundle of hay on head, carrying sickle and bundle of food, unlike cows and hens, different buildings, distinct words.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f7",
      "text": "Trial court examined wrappers and packets, found greater dissimilarities than similarities, unlikely passing off, no chance of fraud, ordinary purchaser would refuse; dismissed suit.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Mysore High Court in Regular First Appeal No. 170 of 1963 on July 5, 1966 confirmed dismissal; noted general get up similar but distinguishing features noticeable even from distance, biscuits for upper classes, purchasers ask specifically for Parle, differences in girl (pail vs hay-bundle), calves vs cow, etc.; broad features not deceptively similar.",
      "type": "procedural",
      "date": "1966-07-05",
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the defendants' wrapper is deceptively similar to the plaintiffs' registered trade mark so as to constitute infringement under the Trade Marks Act 1940 and Trade and Merchandise Marks Act 1958.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Defendants' wrapper is deceptively similar to registered trade mark; act constitutes infringement of trade mark rights.",
      "supporting_facts": [
        "f1",
        "f2",
        "f3",
        "f4"
      ],
      "legal_basis": "Trade Marks Act 1940; registration gives exclusive right"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Ignorance of registration; wrapper not deceptively similar; significant differences in design of girl, animals, buildings, words.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Lower courts erred; action is for infringement (statutory), not passing off; no need for evidence of actual deception if marks visually/phonetically similar or essential features adopted.",
      "addresses_issue": "i1",
      "key_observation": "In infringement, get-up/packing differences may not save if essential features copied."
    },
    {
      "id": "cr2",
      "text": "Deceptive similarity: broad/essential features considered, not side-by-side minor details; marks remembered by general impression.",
      "addresses_issue": "i1",
      "key_observation": "Packets same size, colour scheme almost same, design close resemblance: girl with arm raised carrying something, cow/calves, hens/chickens, farm house, fence; 'Gluco/Glucose Biscuits' similar."
    },
    {
      "id": "cr3",
      "text": "Ordinary purchaser not Sherlock Holmes; likely to mistake one for other if seen separately.",
      "addresses_issue": "i1",
      "key_observation": "Defendants' wrapper deceptively similar to plaintiffs' registered mark."
    },
    {
      "id": "cr4",
      "text": "Concurrent finding of fact not binding if arrived without proper consideration of law.",
      "addresses_issue": "i1",
      "key_observation": "Supreme Court duty to set aside."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Defendant infringed registered trade mark of plaintiff.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Suit decreed; injunction restraining defendant from selling or using biscuits in wrappers similar in appearance to registered trade mark.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Durga Dutt v. Navaratna Laboratories",
      "citation": "1965 1 S.C.R. 737",
      "treatment": "followed",
      "relevance": "Distinguishes infringement (statutory, use of TM essential, likelihood of deception from similarity alone) from passing off (common law, actual deceit); no further evidence needed if close imitation."
    }
  ],
  "statutes_cited": [
    {
      "name": "Trade Marks Act 1940",
      "sections": [
        "S. 21(1)"
      ],
      "relevance": "Exclusive right to use TM; infringed if mark identical or nearly resembling likely to deceive/confuse."
    },
    {
      "name": "Trade and Merchandise Marks Act 1958",
      "sections": [
        "S. 136(2)",
        "S. 28(1)",
        "S. 29(1)",
        "S. 2(d)"
      ],
      "relevance": "Continuance of 1940 registrations; exclusive right; infringement if deceptively similar (defined as nearly resembling likely to deceive/confuse)."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; lower courts' dismissal set aside; held defendant infringed registered trade mark; suit decreed with injunction restraining use of similar wrappers; appellants entitled to costs throughout.",
    "relief_granted": "Injunction restraining defendant-respondent from selling or using in any manner whatsoever biscuits in wrappers similar in appearance to the registered trade mark of the plaintiffs.",
    "costs": "Appellants entitled to costs throughout."
  },
  "key_quotes": [
    {
      "text": "The use, by the defendant of the trade mark of the plaintiff is not essential in an action for passing off, but is the sine qua non in the case of an action for infringement.",
      "speaker": "court",
      "significance": "Distinguishes infringement from passing off, central to reversing lower courts."
    },
    {
      "text": "Marks are remembered rather by general impressions or by some significant detail than by any photographic recollection of the whole.",
      "speaker": "court",
      "significance": "Explains test for deceptive similarity."
    },
    {
      "text": "After all, an ordinary purchaser is not gifted with the powers of observation of a Sherlock Holmes.",
      "speaker": "court",
      "significance": "Justifies finding of likelihood of deception by average buyer."
    }
  ],
  "_case_id": "1972_0",
  "_label": 1,
  "_text_length": 14849,
  "_extracted_at": "2026-02-10T20:06:44.491714"
}