{
  "metadata": {
    "case_name": "Writ Petition No. 39 of 1972",
    "case_year": 1972,
    "court": "Supreme Court of India",
    "judges": [
      "Shelat, J."
    ],
    "case_number": "Writ Petition No. 39 of 1972",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "District Magistrate, Burdwan, passed order on July 14, 1971 directing petitioner's detention under sub-sec. 1 read with sub-sec. 3 of sec. 3 of the West Bengal Prevention of Violent Activities Act (President's Act XIX of 1970) to prevent acting in any manner prejudicial to maintenance of public order.",
      "type": "procedural",
      "date": "1971-07-14",
      "source": "lower_court"
    },
    {
      "id": "f2",
      "text": "Petitioner arrested on August 6, 1971 and furnished grounds of detention as required by the Act.",
      "type": "procedural",
      "date": "1971-08-06",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On 7-2-71 at 13-30 hours, petitioner and associates went to house of Shri Bibhuti Bhusan Ghosh of Ranchi Dhowrah, PS Kulti, asked him to rub out anti-naxalite slogans on wall of his house, refused, threatened to kill him, terrorised common public preventing normal avocations, disturbed public order.",
      "type": "material",
      "date": "1971-02-07",
      "source": "detention grounds"
    },
    {
      "id": "f4",
      "text": "Government of West Bengal and authorities took all consequential steps: reporting to and obtaining Government's approval, reporting to Central Government, disposal of petitioner's representation, referring to Advisory Board, obtaining its opinion, all within prescribed times.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "State Government passed order of confirmation and continuance of detention beyond three months on October 28, 1971.",
      "type": "procedural",
      "date": "1971-10-28",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the first ground in the grounds of detention was irrelevant and vitiated the entire order.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether there was undue delay in confirmation by State Government of detention order and continuance after expiry of three months.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "First ground in grounds of detention irrelevant as threat to kill Bibhuti Bhusan Ghosh did not amount to acting prejudicial to maintenance of public order as defined in sec. 3(2)(d) of the Act.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": "Sec. 3(2)(d) of West Bengal Prevention of Violent Activities Act"
    },
    {
      "id": "pa2",
      "text": "Undue delay in confirmation by State Government; order must be passed as soon as possible, not delayed until expiry of three months from arrest.",
      "supporting_facts": [
        "f2",
        "f5"
      ],
      "legal_basis": "Deb Sadhan Roy v. West Bengal"
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Threat to kill under first ground is offence under sec. 506 IPC punishable up to seven years; cl. (d) of sec. 3(2) includes such offence if disturbs or likely to disturb public order; allegation that it terrorised public and disturbed public order satisfies requirement.",
      "addresses_issue": "i1",
      "key_observation": "Ground No. 1 not extraneous or irrelevant to objects in sec. 3 of the Act."
    },
    {
      "id": "cr2",
      "text": "Confirmation order passed on Oct 28, 1971 within three months from arrest on Aug 6, 1971; precedents hold confirmation must be within three months from detention date, not affected if passed before expiry.",
      "addresses_issue": "i2",
      "key_observation": "Legality not affected if confirmation within three months."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "First ground of detention relevant and valid under sec. 3(2)(d) as offence under IPC sec. 506 disturbing public order.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "No undue delay in confirmation as passed within three months from arrest; detention legal.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Deb Sadhan Roy v. West Bengal",
      "citation": "1972 1 S.C.C. 308",
      "treatment": "followed",
      "relevance": "Confirmation must be within three months from detention; failure beyond makes illegal, but within is valid."
    },
    {
      "case_name": "Ujjal Mandal v. West Bengal",
      "citation": null,
      "treatment": "followed",
      "relevance": "State Govt power to continue detention beyond three months on Advisory Board opinion, exercisable within three months from detention."
    }
  ],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Article 32"
      ],
      "relevance": "Basis for writ petition enforcing fundamental rights."
    },
    {
      "name": "West Bengal Prevention of Violent Activities Act (President's Act XIX of 1970)",
      "sections": [
        "Section 3(1)",
        "Section 3(2)(d)",
        "Section 3(3)"
      ],
      "relevance": "Authority for detention order to prevent prejudicial acts; defines prejudicial to public order."
    },
    {
      "name": "Indian Penal Code",
      "sections": [
        "Section 506"
      ],
      "relevance": "Threat to cause death punishable up to seven years, falls under sec. 3(2)(d)."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Court rejected both contentions of petitioner that first ground irrelevant and undue delay in confirmation; upheld validity of detention order and continued detention.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"That on 7-2-71 at 13-30 hours you and your associates had been to the house of Shri Bibhuti Bhusan Ghosh... threatened to kill him. Your such act terrorised the common public... disturbed public order.\"",
      "speaker": "detention grounds",
      "significance": "Text of first ground held relevant and sufficient."
    },
    {
      "text": "\"failure to confirm or extend the period within three months would result in the detention becoming illegal, the moment the three months period elapsed without any such confirmation.\"",
      "speaker": "court",
      "significance": "From Deb Sadhan Roy, clarifies timing rule applied here."
    },
    {
      "text": "\"Unless that power is exercised within the period of three months from the date of detention, the detention after the expiry of that period would be without the authority of the law.\"",
      "speaker": "court",
      "significance": "From Ujjal Mandal, confirms confirmation within time validates detention."
    }
  ],
  "_case_id": "1972_289",
  "_label": 0,
  "_text_length": 7028,
  "_extracted_at": "2026-02-10T20:09:04.355258"
}