{
  "metadata": {
    "case_name": "Writ Petition No. 274 of 1971",
    "case_year": 1971,
    "court": "Supreme Court of India",
    "judges": [
      "Shelat, J."
    ],
    "case_number": "Writ Petition No. 274 of 1971",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "On November 13, 1970 the petitioner together with some others committed theft of traction wire from a wagon lying in Naihati South Yard, and when the railway police and the railway protection force on duty rushed at the spot, the petitioner and his associates threw bombs at them with intent to kill them.",
      "type": "disputed",
      "date": "1970-11-13",
      "source": "detaining_authority"
    },
    {
      "id": "f2",
      "text": "On December 23, 1970, the petitioner and his associates were removing 29 pieces of rail from the same railway yard and when the members of the railway protection force attempted to stop them from doing so, the petitioner and his said associates threw bombs at them with intent to kill them.",
      "type": "disputed",
      "date": "1970-12-23",
      "source": "detaining_authority"
    },
    {
      "id": "f3",
      "text": "On 13-1-71 in between 12.00 and 12.20 hours, you along with your associates being armed with bombs, swords, lathis, etc. entered in a clash with another group with a view to kill them. Your violent activities created a serious panic in the station area and disturbed the public order.",
      "type": "disputed",
      "date": "1971-01-13",
      "source": "detaining_authority"
    },
    {
      "id": "f4",
      "text": "Order of detention dated April 7, 1971 passed against the petitioner under sec. 3(1) and 3 of the West Bengal Prevention of Violent Activities Act, President's Act 19 of 1970 by District Magistrate, 24 Parganas, satisfied that it was necessary to detain the petitioner with a view to prevent him from acting in a manner prejudicial to the maintenance of public order.",
      "type": "procedural",
      "date": "1971-04-07",
      "source": "detaining_authority"
    },
    {
      "id": "f5",
      "text": "Petitioner arrested and detained in jail the next day after detention order.",
      "type": "procedural",
      "date": "1971-04-08",
      "source": "detaining_authority"
    },
    {
      "id": "f6",
      "text": "Petitioner made a representation dated April 29, 1971 to the State Government from Dum Dum Central Jail denying the grounds and maintaining he was a law abiding citizen.",
      "type": "procedural",
      "date": "1971-04-29",
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "Representation and record placed before Advisory Board who heard petitioner in person and reported sufficient cause for detention.",
      "type": "procedural",
      "date": null,
      "source": "advisory_board"
    },
    {
      "id": "f8",
      "text": "Government confirmed the detention order and directed continuation of detention.",
      "type": "procedural",
      "date": null,
      "source": "government"
    },
    {
      "id": "f9",
      "text": "Petitioner arrested in Naihati G.R.P. Case No. 11 dated November 23, 1970 under secs. 148, 379 and 307 of the Penal Code and sec. 6 of the Explosive Substances Act, released on bail by Magistrate, Sealdah; case still pending.",
      "type": "background",
      "date": "1970-11-23",
      "source": "petitioner"
    },
    {
      "id": "f10",
      "text": "In affidavit in reply, State averred that incident of January 13, 1971 took place not in Naihati Railway Station area but at Palta Railway Station.",
      "type": "disputed",
      "date": "1971-01-13",
      "source": "respondent"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the detention order is invalid due to parallel criminal proceedings under CrPC for the incident in ground No. 2 while proceedings are pending, amounting to double jeopardy and lack of court supervision.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether ground No. 3 is vague and uncertain, lacking particulars of locality (station area) and the 'another group', preventing effective representation.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Authorities elected to institute proceedings under CrPC (Naihati G.R.P. Case No. 11 dated Nov 23, 1970), could not take parallel proceedings under the Act while pending, placing petitioner under double jeopardy and conducting investigation without court's supervision/control.",
      "supporting_facts": [
        "f2",
        "f9"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "No case filed by police for incident in ground No. 3, indicating false involvement; local police (Naihati) bound to record in general diary.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Ground No. 3 vague: no place/locality specified (ambiguous 'station area' - Naihati railway or police station?), no details of 'another group', impossible to effectively make representation.",
      "supporting_facts": [
        "f3",
        "f10"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Incident of January 13, 1971 took place at Palta Railway Station, not Naihati.",
      "supporting_facts": [
        "f10"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Ground No. 3 specifies date/time, arms, clash with 'another group', panic in 'station area', but omits locality (Palta vs. Naihati inference from prior grounds) and identity of 'another group', leading to wrong impression by petitioner and preventing effective representation.",
      "addresses_issue": "i2",
      "key_observation": "Omission to mention locality and group renders ground vague/indefinite, disabling petitioner from effectively making representation."
    },
    {
      "id": "cr2",
      "text": "Petitioner's representation and arguments show impression of Naihati area; no particulars prevented correcting representation, e.g., alibi or friendly group.",
      "addresses_issue": "i2",
      "key_observation": "Likelihood of wrong impression in context of first two grounds (Naihati)."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Omission of particulars in ground No. 3 prevents petitioner from effectively making representation, rendering detention invalid.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "West Bengal Prevention of Violent Activities Act, 1970 (President's Act 19 of 1970)",
      "sections": [
        "3(1)",
        "3"
      ],
      "relevance": "Detention order passed under these sections"
    },
    {
      "name": "Code of Criminal Procedure",
      "sections": [],
      "relevance": "Parallel proceedings argued as invalidating detention"
    },
    {
      "name": "Indian Penal Code",
      "sections": [
        "148",
        "379",
        "307"
      ],
      "relevance": "Sections under which criminal case pending"
    },
    {
      "name": "Explosive Substances Act",
      "sections": [
        "6"
      ],
      "relevance": "Section under which criminal case pending"
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 32"
      ],
      "relevance": "Writ petition filed under Article 32 for habeas corpus"
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Petition succeeds and is allowed due to vagueness in ground No. 3 preventing effective representation; detention order invalid; petitioner directed to be released forthwith.",
    "relief_granted": "Released from jail and set at liberty forthwith",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The omission to specify the group with whom the petitioner and his associates came into clash also renders that ground vague and indefinite, resulting once again in disabling the petitioner from effectively making a representation.",
      "speaker": "court",
      "significance": "Core reasoning for invalidating detention"
    },
    {
      "text": "The result of those omissions being to prevent the petitioner from effectively making representation, his detention under the said order must be found to be invalid.",
      "speaker": "court",
      "significance": "Direct holding on invalidity"
    }
  ],
  "_case_id": "1972_99",
  "_label": 1,
  "_text_length": 10766,
  "_extracted_at": "2026-02-10T20:07:17.452102"
}