{
  "metadata": {
    "case_name": "Saklecha v. Jagjiwan Joshi",
    "case_year": 1972,
    "court": "Supreme Court of India",
    "judges": [
      "Ray, J."
    ],
    "case_number": "C.A. No. 2509 of 1969",
    "date_of_judgment": "1972-01-31"
  },
  "facts": [
    {
      "id": "f1",
      "text": "General election held in 1967 for Jawad Constituency, Madhya Pradesh Assembly. Four candidates: appellant (Jan Sangh, successful), respondent Jagjiwan Joshi (Congress), and two others.",
      "type": "background",
      "date": "1967",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Respondent Joshi filed Election Petition Nos. 19 and 19A of 1967 challenging appellant's election alleging corrupt practices.",
      "type": "procedural",
      "date": "1967",
      "source": "respondent"
    },
    {
      "id": "f3",
      "text": "Madhya Pradesh High Court, Indore Bench, by judgment dated 30 September 1969, set aside appellant's election holding guilty of corrupt practices under sections 123(4), 123(3), 123(2) of Representation of the People Act, 1951 based on speeches at Singoli (29 Jan 1967), Athana (9 Feb 1967), Jhatla (12 Feb 1967), and Swamiji of Bhanpura's speeches at Morwan, Singoli, Diken (15 Feb 1967).",
      "type": "procedural",
      "date": "1969-09-30",
      "source": "lower_court"
    },
    {
      "id": "f4",
      "text": "Appeal to Supreme Court under Section 116A of Representation of the People Act, 1951.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Alleged speech at Singoli on 29 Jan 1967: 'The Congress candidate has on payment of Rs. 5000 set up Kajod Dhakad so that the Jan Sangh votes may be split and he might win. If he practises such corruption even then what service can he do to the public later on. You, should not vote for such corrupt men.'",
      "type": "disputed",
      "date": "1967-01-29",
      "source": "respondent"
    },
    {
      "id": "f6",
      "text": "Alleged speech at Athana on 9 Feb 1967: Similar to Singoli plus 'Joshi has set up Kajod Dhakad on payment of Rs. 5000.' and 'Shri Joshi has set up a man to hit me with a knife. Accordingly, if he becomes a legislator the rule of violence goonda gardi would be permanently established. Therefore, the public should not only defeat such bad characters badmash of the Congress but also see that their deposit is forfeited.'",
      "type": "disputed",
      "date": "1967-02-09",
      "source": "respondent"
    },
    {
      "id": "f7",
      "text": "Alleged speech at Jhatla on 12 Feb 1967: 'This Congress candidate gave a knife to Mohammad Kasai and got him to attack me. But I have the strength of the janata janardhan and my life is dedicated to you. It lies with you whether to save such goondas who try to commit murder or to get their deposit forfeited.' and 'The votes shall be cast on the 20th and it is fortunate that it is a sacred day being a Monday gyaras. To give a vote to the cow-killing Congress on that day is equivalent to cutting down one cow and it will be on you to bear the responsibility for this sin.'",
      "type": "disputed",
      "date": "1967-02-12",
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "Swamiji of Bhanpura's alleged speeches on 15 Feb 1967 at Morwan, Singoli, Diken introduced by appellant, appealing on religion, cow protection, threatening divine displeasure for voting Congress.",
      "type": "disputed",
      "date": "1967-02-15",
      "source": "respondent"
    },
    {
      "id": "f9",
      "text": "At Morwan (Swamiji): 'Today the Hindu dharma is being destroyed. Sadhus and sanyasis being shot. The Congress is killing the cow-progeny go-vansh of Bhagwan Gopal. so this time you should cast your invaluable vote for up-rooting that government. You put your seal on the deepak symbol Jan Sangh symbol on the 20th which is Monday gyaras. To vote for the Congress on such a sacred day is to commit the sin of cow-killing.'",
      "type": "disputed",
      "date": "1967-02-15",
      "source": "respondent"
    },
    {
      "id": "f10",
      "text": "At Singoli (Swamiji): 'In the Congress Government sixteen cows are being killed every minute. How long will this cow-killing Congress rule the country? How long will it show in-difference to the feelings of the overwhelming Hindu majority just on the strength of the support of a handful of cow-eating Musalmans If you love the Hindu dharma, if there is Hindu blood in your veins, do not vote for the Congress but uproot it. Form a new Government by putting your seal on the Jan Sangh deepak. Shri Saklecha is your Chief Minister to be. The 20th February as a sacred day being Monday gyras. Do not on such a sacred day vote for the cow-killing Congress and bring yourself to hell narak ke bhagi na bane.'",
      "type": "disputed",
      "date": "1967-02-15",
      "source": "respondent"
    },
    {
      "id": "f11",
      "text": "At Diken (Swamiji): 'There was a yagna for putting an end to the cow killing in this country. Many sadhus and sanyasis have sacrificed their life for this, but the Congress, intoxicated with power has along with cow-killing killed sadhus also. It is the dharma of every Hindu not, to vote for such murderous Congress. The 20th is Monday gyaras and a sacred day. So put your seal on the deepak and make the Jan Sangh successful. The Jan Sangh will put an end to the cow-killing and you will get merit punya and endless bliss akhand sukh.'",
      "type": "disputed",
      "date": "1967-02-15",
      "source": "respondent"
    },
    {
      "id": "f12",
      "text": "Respondent's affidavit in election petition did not disclose sources of information re speeches.",
      "type": "material",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f13",
      "text": "Respondent had written report from Ram Kumar Aggarwal (Congress candidate same constituency) about Athana speech, but neither examined nor produced notes.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f14",
      "text": "High Court accepted evidence of respondent's witnesses (Kishan Lal Teli PW1, Ghisa Dhakad PW2, Laxmi Lal PW5, Chand Mohammad PW6 etc.) for Athana, rejected appellant's.",
      "type": "procedural",
      "date": "1969-09-30",
      "source": "lower_court"
    },
    {
      "id": "f15",
      "text": "Kishan Lal Teli was respondent's polling agent (denied but signatures matched).",
      "type": "disputed",
      "date": null,
      "source": "court"
    },
    {
      "id": "f16",
      "text": "Witnesses for Athana gave identical evidence from memory, attended only that meeting.",
      "type": "disputed",
      "date": null,
      "source": "court"
    },
    {
      "id": "f17",
      "text": "Similar issues with Jhatla witnesses: Daulat Ram Sharma PW12, Kastur Chand Jain PW13 etc., identical speeches, tutored.",
      "type": "disputed",
      "date": "1967-02-12",
      "source": "court"
    },
    {
      "id": "f18",
      "text": "No notes produced for Jhatla, alleged taken by Mohan Lal Ramji Lal not examined.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f19",
      "text": "Singoli 29 Jan witnesses (PW16 Paras Ram etc.) associated with Congress, tutored.",
      "type": "disputed",
      "date": "1967-01-29",
      "source": "court"
    },
    {
      "id": "f20",
      "text": "Swamiji speeches witnesses tutored, e.g. Exhibit R-1/27 purloined brief for Morwan.",
      "type": "disputed",
      "date": "1967-02-15",
      "source": "court"
    },
    {
      "id": "f21",
      "text": "Supreme Court order on 31 Jan 1972 disagreeing with High Court, reasons later.",
      "type": "procedural",
      "date": "1972-01-31",
      "source": "court"
    },
    {
      "id": "f22",
      "text": "Trial in High Court lasted over 180 days.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether appellant guilty of corrupt practice u/s 123(4) RP Act for publishing false statements about respondent bribing Kajod Dhakad Rs.5000 and instigating knife attack in speeches at Singoli (29.1.67), Athana (9.2.67), Jhatla (12.2.67).",
      "framed_by": "respondent"
    },
    {
      "id": "i2",
      "text": "Whether appellant guilty of corrupt practice u/s 123(3) (appeal on religion) and 123(2) (undue influence by threatening divine displeasure) in Jhatla speech re voting on sacred day gyaras equivalent to cow-killing sin.",
      "framed_by": "respondent"
    },
    {
      "id": "i3",
      "text": "Whether Swamiji of Bhanpura's speeches at Morwan, Singoli, Diken (15.2.67) at instance/presence of appellant constitute corrupt practices u/s 123(2),(3) by appeal to religion, cow-killing, divine displeasure/hell for voting Congress.",
      "framed_by": "respondent"
    },
    {
      "id": "i4",
      "text": "Whether non-disclosure of sources of information in election petition affidavit u/s 83 RP Act, Form 25, MP HC Rules, Order 19 CPC fatal defect.",
      "framed_by": "appellant"
    },
    {
      "id": "i5",
      "text": "Reliability of respondent's oral evidence/witnesses re speeches.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Affidavit defective: no disclosure of sources of information re speeches, fatal under s.83 RP Act, Form 25, MP HC Rules, Order 19 CPC; gives notice opportunity to test sources.",
      "supporting_facts": [
        "f12"
      ],
      "legal_basis": "Representation of the People Act s.83,87; Conduct of Election Rules R.94A Form 25; CPC O.19 R.3; MP HC Rules R.7,9"
    },
    {
      "id": "pa2",
      "text": "Respondent's witnesses tutored, interested, partisan (Congress workers, polling agents), gave identical speeches from memory, attended only alleged meeting, no contemporaneous documents/notes produced (e.g. Ram Kumar Aggarwal, Mohan Lal notes).",
      "supporting_facts": [
        "f13",
        "f15",
        "f16",
        "f17",
        "f18",
        "f19",
        "f20"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "No proof of alleged speeches; denial by appellant's witnesses; first information report by Sunder Lal Petlia re Athana incident pending.",
      "supporting_facts": [
        "f14"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Appellant made speeches with false allegations of bribery Rs.5000 to Kajod Dhakad and instigating knife attack by Mohd. Kasai.",
      "supporting_facts": [
        "f5",
        "f6",
        "f7"
      ],
      "legal_basis": "RP Act s.123(4)"
    },
    {
      "id": "ra2",
      "text": "Appellant appealed to religion/threatened divine displeasure in Jhatla speech re voting Congress on gyaras = cow-killing sin.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "RP Act s.123(3),(2)"
    },
    {
      "id": "ra3",
      "text": "Swamiji speeches at appellant's instance/presence appealed to Hindu dharma, cow-killing, sin/hell for Congress vote.",
      "supporting_facts": [
        "f8",
        "f9",
        "f10",
        "f11"
      ],
      "legal_basis": "RP Act s.123(3),(2)"
    },
    {
      "id": "ra4",
      "text": "Witnesses straightforward, impartial; oral evidence reliable.",
      "supporting_facts": [
        "f14"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Affidavit non-disclosure of sources important to test genuineness; though not fatal after full trial, here sources fabricated, no documents produced (e.g. Aggarwal notes).",
      "addresses_issue": "i4",
      "key_observation": "Sources to be set out; non-disclosure allows no test of veracity."
    },
    {
      "id": "cr2",
      "text": "Athana witnesses (Kishan Lal etc.) partisan (polling agent, Congress workers), identical tutored evidence, only attended that meeting, phenomenal memory suspicious; no notes produced.",
      "addresses_issue": "i1",
      "key_observation": "Entire evidence tutored and prompted."
    },
    {
      "id": "cr3",
      "text": "Jhatla witnesses identical, tutored (stayed together, partisan Congress), no notes; casual attendance implausible.",
      "addresses_issue": "i1",
      "key_observation": "Version like cyclostyled copies."
    },
    {
      "id": "cr4",
      "text": "Singoli 29 Jan witnesses Congress associated, tutored, added gloss (sugar tax not alleged).",
      "addresses_issue": "i1",
      "key_observation": "Played parrot."
    },
    {
      "id": "cr5",
      "text": "Swamiji speeches: Morwan 'purloined brief' Exhibit R-1/27 tutored witnesses; identical evidence; no notes produced.",
      "addresses_issue": "i3",
      "key_observation": "Witnesses coached."
    },
    {
      "id": "cr6",
      "text": "Singoli/Diken Swamiji: witnesses partisan, tutored, identical; no production despite undertaking.",
      "addresses_issue": "i3",
      "key_observation": "Appearance of disinterestedness but tutored."
    },
    {
      "id": "cr7",
      "text": "High Court wrong to rely on oral evidence, disbelieve appellant's, comment on pending FIR.",
      "addresses_issue": "i5",
      "key_observation": "No single documentary evidence; all oral tutored."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "No proof of corrupt practices u/s 123(2),(3),(4); respondent's evidence unreliable, tutored.",
      "resolves_issue": "i1",
      "in_favor_of": "appellant"
    },
    {
      "id": "h2",
      "text": "No proof of religious appeal or divine displeasure threat in appellant's or Swamiji's speeches.",
      "resolves_issue": "i2",
      "in_favor_of": "appellant"
    },
    {
      "id": "h3",
      "text": "Affidavit defect requires sources disclosure but not fatal post-trial; here underscores fabrication.",
      "resolves_issue": "i4",
      "in_favor_of": "partial"
    },
    {
      "id": "h4",
      "text": "High Court judgment set aside; election petition dismissed.",
      "resolves_issue": "i5",
      "in_favor_of": "appellant"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "State of Bombay v. Parshottam Jog Naik",
      "citation": "1952 S.C.R. 674",
      "treatment": "followed",
      "relevance": "Sources of information in affidavits must be clearly disclosed."
    },
    {
      "case_name": "Padmabati Dasi v. Rasik Lal Dhar",
      "citation": "I.L.R. 37 Cal. 259",
      "treatment": "endorsed",
      "relevance": "Sources of information should be clearly disclosed."
    },
    {
      "case_name": "Barium Chemicals Ltd. v. Company Law Board",
      "citation": "1966 Supp. S.C.R. 331",
      "treatment": "followed",
      "relevance": "Deprecates slipshod verifications; model on O.19 R.3 CPC."
    },
    {
      "case_name": "A. K. K. Nambiar v. Union of India",
      "citation": "1970 3 S.C.R. 121",
      "treatment": "followed",
      "relevance": "Verification tests genuineness, makes deponent responsible."
    }
  ],
  "statutes_cited": [
    {
      "name": "Representation of the People Act, 1951",
      "sections": [
        "Section 83",
        "Section 87",
        "Section 102",
        "Section 116A",
        "Section 123(2)",
        "Section 123(3)",
        "Section 123(4)"
      ],
      "relevance": "Election petition affidavit requirements; corrupt practices definitions (undue influence, religion appeal, false statements); trial procedure; appeal."
    },
    {
      "name": "Conduct of Election Rules, 1961",
      "sections": [
        "Rule 94A",
        "Form 25"
      ],
      "relevance": "Affidavit form requiring distinction knowledge/information."
    },
    {
      "name": "Code of Civil Procedure, 1908",
      "sections": [
        "Order 19",
        "Section 102"
      ],
      "relevance": "Affidavit verification; High Court rule-making."
    },
    {
      "name": "Madhya Pradesh High Court Rules",
      "sections": [
        "Rule 7",
        "Rule 9"
      ],
      "relevance": "Affidavit must state sources with particularity; apply unless inconsistent."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Supreme Court disagreed with High Court findings, held no corrupt practices proved due to unreliable tutored evidence, set aside High Court judgment dated 30 Sep 1969, dismissed election petition.",
    "relief_granted": "Appellant's election upheld.",
    "costs": "Both parties to pay and bear their own costs."
  },
  "key_quotes": [
    {
      "text": "\"We do not agree with the finding of the High Court and we also hold the appellant to be not guilty of any corrupt practice.\"",
      "speaker": "court",
      "significance": "Order pronouncing disagreement with High Court."
    },
    {
      "text": "\"The entire evidence on behalf of the respondent is tutored and prompted to support the respondent.\"",
      "speaker": "court",
      "significance": "Core finding on reliability of respondent's witnesses."
    },
    {
      "text": "\"The grounds or sources of information are to be set out in the affidavit whether the Code applies or not.\"",
      "speaker": "court",
      "significance": "Ruling on affidavit requirements."
    },
    {
      "text": "\"For the foregoing reasons the judgment of the High Court is set aside. The election petition is dismissed.\"",
      "speaker": "court",
      "significance": "Final disposition."
    }
  ],
  "_case_id": "1972_112",
  "_label": 1,
  "_text_length": 40131,
  "_extracted_at": "2026-02-10T20:07:55.828701"
}