{
  "metadata": {
    "case_name": "Nishi Kanta Mondal v. State of West Bengal",
    "case_year": 1972,
    "court": "Supreme Court of India",
    "judges": [
      "Khanna, J."
    ],
    "case_number": "Writ Petition No. 7 of 1972",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "District Magistrate, 24-Parganas passed detention order No. 352/71 dated 6-7-71 under section 3(1) read with sub-section 3 of section 3 of the West Bengal Prevention of Violent Activities Act, 1970 (President's Act No. 19 of 1970), directing detention of Nishi Kanta Mondal to prevent him from acting in manner prejudicial to maintenance of public order.",
      "type": "procedural",
      "date": "1971-07-06",
      "source": "lower_court"
    },
    {
      "id": "f2",
      "text": "Petitioner arrested on July 8, 1971 and served with detention order and grounds of detention on the same day.",
      "type": "procedural",
      "date": "1971-07-08",
      "source": "respondent"
    },
    {
      "id": "f3",
      "text": "District Magistrate sent report to State Government on July 10, 1971 along with grounds of detention and other particulars.",
      "type": "procedural",
      "date": "1971-07-10",
      "source": "lower_court"
    },
    {
      "id": "f4",
      "text": "State Government approved detention order on July 17, 1971.",
      "type": "procedural",
      "date": "1971-07-17",
      "source": "respondent"
    },
    {
      "id": "f5",
      "text": "Petitioner's representation received by State Government on July 30, 1971, considered and rejected on August 5, 1971.",
      "type": "procedural",
      "date": "1971-07-30",
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "Case placed before Advisory Board on August 6, 1971; representation sent to Board; petitioner given personal hearing; Board submitted report on September 14, 1971 opining sufficient cause for detention.",
      "type": "procedural",
      "date": "1971-08-06",
      "source": "respondent"
    },
    {
      "id": "f7",
      "text": "State Government confirmed detention order on October 5, 1971 and communicated to petitioner.",
      "type": "procedural",
      "date": "1971-10-05",
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "On 12-2-71 at about 02.00 hrs., petitioner and associates armed with bombs and lethal weapons attacked Shri K. K. Naskar, I.A.S., S.D.O., Bongaon and his guard by hurling bombs, causing injuries to guard constable, creating panic and disturbing public order.",
      "type": "disputed",
      "date": "1971-02-12",
      "source": "grounds_of_detention"
    },
    {
      "id": "f9",
      "text": "On 23-2-71 between 10.45 hrs. and 02.15 hrs., Bongaon Police recovered 3 high explosive bombs and explosive materials from possession of petitioner and associates at Subhaspalli, Bongaon.",
      "type": "disputed",
      "date": "1971-02-23",
      "source": "grounds_of_detention"
    },
    {
      "id": "f10",
      "text": "Act enacted by President under section 3 of West Bengal State Legislature Delegation of Powers Act, 1970 pursuant to Proclamation under Article 356 dated 19th March, 1970; Proclamation revoked in beginning of the month of judgment.",
      "type": "background",
      "date": "1970-03-19",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the West Bengal Prevention of Violent Activities Act, 1970 (President's Act No. 19 of 1970) ceased to have effect upon revocation of the Proclamation under Article 356.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether the detention order was not in conformity with section 10 of the Act as it did not specify the date of detention.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether the grounds of detention are germane to the objects for which a person can be ordered to be detained under the Act.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Act enacted by President pursuant to Proclamation under Article 356 dated 19-3-70 which has been revoked; hence Act ceases to have effect and petitioner cannot be detained under it.",
      "supporting_facts": [
        "f10"
      ],
      "legal_basis": "Article 356; West Bengal State Legislature Delegation of Powers Act, 1970"
    },
    {
      "id": "pa2",
      "text": "Detention order not in conformity with section 10 of the Act as it did not specify the date of detention.",
      "supporting_facts": [
        "f1"
      ],
      "legal_basis": "Section 10, West Bengal Prevention of Violent Activities Act, 1970"
    },
    {
      "id": "pa3",
      "text": "Grounds of detention not germane to objects of detention under the Act.",
      "supporting_facts": [
        "f8",
        "f9"
      ],
      "legal_basis": "Section 3, West Bengal Prevention of Violent Activities Act, 1970"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Resisted petition via affidavit of Shri Chandi Charan Bose, Deputy Secretary.",
      "supporting_facts": [],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Act does not cease immediately upon revocation of Proclamation; per clause 2 of Article 357, it continues for one year after Proclamation ceases unless repealed or re-enacted; period not expired and no repeal.",
      "addresses_issue": "i1",
      "key_observation": "Law made under Article 356 remains in force for one year post-Proclamation except as respects things done before."
    },
    {
      "id": "cr2",
      "text": "Section 10 requires State Government to place materials before Advisory Board within 30 days from commencement of detention; no obligation to specify date of commencement in detention order itself, as detention starts upon custody and date uncertain at order stage.",
      "addresses_issue": "i2",
      "key_observation": "Words 'from the date of detention under the order' refer to actual commencement upon custody."
    },
    {
      "id": "cr3",
      "text": "Grounds germane: Incident of 12-2-71 involves hurling bombs at SDO creating panic (offence under Explosive Substances Act disturbing public order); 23-2-71 recovery of bombs from possession shows propensity, prevented disturbance; falls within section 3(2)(d).",
      "addresses_issue": "i3",
      "key_observation": "Sufficient that past conduct reveals tendency to acts in clause (d); preventive even if police action prevents actual disturbance."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "President's Act No. 19 of 1970 continues in force per Article 357(2).",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "No requirement under section 10 to specify date of detention in order.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Grounds of detention germane to section 3(2)(d); detention valid.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "West Bengal Prevention of Violent Activities Act, 1970 (President's Act No. 19 of 1970)",
      "sections": [
        "Section 3",
        "Section 9",
        "Section 10"
      ],
      "relevance": "Detention order under s.3; materials to Advisory Board under s.10; grounds within s.3(2)(d) for acts prejudicial to public order including offences under Explosive Substances Act."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 32",
        "Article 356",
        "Article 357"
      ],
      "relevance": "Writ petition under Art.32; Act made under Proclamation u/Art.356 continues per Art.357(2)."
    },
    {
      "name": "West Bengal State Legislature (Delegation of Powers) Act, 1970",
      "sections": [
        "Section 2",
        "Section 3"
      ],
      "relevance": "Enabled President to enact the detention Act."
    },
    {
      "name": "Explosive Substances Act, 1908",
      "sections": [],
      "relevance": "Offences under this Act disturbing public order fall within s.3(2)(d) of detention Act."
    },
    {
      "name": "Arms Act, 1959",
      "sections": [],
      "relevance": "Mentioned in s.3(2)(d) as offences prejudicial to public order."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The petition for habeas corpus challenging detention under West Bengal Prevention of Violent Activities Act, 1970 fails on all grounds; detention held valid and in accordance with law.",
    "relief_granted": "None",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"any law made in exercise of the power of the Legislature of the State by Parliament or the President... shall, to the extent of the incompetency, cease to have effect on the expiration of a period of one year after the Proclamation has ceased to operate\" - Article 357(2).",
      "speaker": "court",
      "significance": "Core reasoning why Act remains in force post-Proclamation revocation."
    },
    {
      "text": "\"the object of detention is to prevent the detenu from acting in any manner prejudicial... it is sufficient that the detaining authority considers it necessary to detain him in order to prevent him from doing any of the acts mentioned in clause (d)\".",
      "speaker": "court",
      "significance": "Explains why recovery of bombs (preventive) justifies detention even without actual disturbance."
    }
  ],
  "_case_id": "1972_212",
  "_label": 0,
  "_text_length": 15174,
  "_extracted_at": "2026-02-10T20:08:18.267636"
}