{
  "metadata": {
    "case_name": "Appellant v. Sheojanam Prasad",
    "case_year": 1969,
    "court": "Supreme Court of India",
    "judges": [
      "Shelat, Acting C.J."
    ],
    "case_number": "Criminal Appeal No. 181 of 1969",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Sheojanam Prasad was proprietor of a provisions store in Arrah and evolved a formula for manufacturing a scent named BASANT BAHAR.",
      "type": "background",
      "date": null,
      "source": "complainant"
    },
    {
      "id": "f2",
      "text": "BASANT BAHAR scent packed in green cartons and receptacles with picture of a pari (angel) holding a bunch of flowers, inscription 'BASANT BAHAR SCENT KHUSHBUON Ka Badshah', and name of manufacturer 'Basant Bahar Perfumery Co. Shahabad'.",
      "type": "material",
      "date": null,
      "source": "complainant"
    },
    {
      "id": "f3",
      "text": "Sheojanam Prasad applied for registration of the trade mark before Registrar of Trade Marks but application not granted due to technical defects; nonetheless, scent became popular in market as his product.",
      "type": "background",
      "date": null,
      "source": "complainant"
    },
    {
      "id": "f4",
      "text": "Appellant conducted a provisions store in Arrah.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Appellant first put out scent named Pushp Raj, which did not become popular.",
      "type": "material",
      "date": null,
      "source": "trial_magistrate"
    },
    {
      "id": "f6",
      "text": "Appellant then put out his scent under name BASANT BAHAR in cartons and receptacles similar to Sheojanam Prasad's in colour, shape and size, except name of manufacturer 'Basant Bahar Chemical Co. Ltd., Shahabad'; scent was of inferior quality.",
      "type": "material",
      "date": null,
      "source": "trial_magistrate"
    },
    {
      "id": "f7",
      "text": "Sheojanam Prasad filed complaint alleging appellant surreptitiously and fraudulently printed trade mark label of BASANT BAHAR, packed inferior scent in similar receptacles, palmed off as genuine BASANT BAHAR to defraud public, defame complainant and make illegal gain.",
      "type": "material",
      "date": null,
      "source": "complainant"
    },
    {
      "id": "f8",
      "text": "Appellant claimed BASANT BAHAR was his original product, first in market, and Sheojanam Prasad imitated it.",
      "type": "disputed",
      "date": null,
      "source": "appellant"
    },
    {
      "id": "f9",
      "text": "Trial Magistrate found: (1) complainant placed BASANT BAHAR first in market; (2) it enjoyed better market; (3) appellant put inferior scent as BASANT BAHAR, passing off as complainant's; convicted under ss. 482 and 486 IPC, fined Rs. 250/- each count.",
      "type": "procedural",
      "date": null,
      "source": "trial_magistrate"
    },
    {
      "id": "f10",
      "text": "Additional Sessions Judge accepted trial findings but acquitted, holding complaint alleged counterfeiting trade mark, not property mark, and post Trade and Merchandise Marks Act, 1958, no offence under Penal Code.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Sheojanam Prasad appealed to Patna High Court; died on July 22, 1967 pending appeal; son Ashok Kumar applied to be brought on record as legal representative.",
      "type": "procedural",
      "date": "1967-07-22",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "High Court dismissed son's application but proceeded with appeal as State interest, held complaint averred counterfeiting property mark, set aside acquittal, restored conviction and sentence dated April 10, 1969.",
      "type": "procedural",
      "date": "1969-04-10",
      "source": "high_court"
    },
    {
      "id": "f13",
      "text": "Witnesses deposed that scents looked alike from outward appearance, customers bought appellant's believing it complainant's but returned due to inferior quality.",
      "type": "material",
      "date": null,
      "source": "prosecution"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the averments in the complaint and evidence disclose counterfeiting of property mark under ss. 482 and 486 IPC, or only trade mark infringement which is no longer punishable under Penal Code after Trade and Merchandise Marks Act, 1958.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether appeal abated on death of complainant.",
      "framed_by": "high_court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Complaint sets out case of counterfeiting trade mark BASANT BAHAR; post Trade and Merchandise Marks Act, 1958, such counterfeiting no longer offence under Penal Code; unregistered trade mark, no civil remedy even.",
      "supporting_facts": [
        "f7",
        "f9",
        "f10"
      ],
      "legal_basis": "Trade and Merchandise Marks Act, 1958"
    },
    {
      "id": "pa2",
      "text": "High Court wrongly construed complaint as counterfeiting property mark.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Expressions like 'trade mark' in complaint loosely used; substance is counterfeiting property mark denoting ownership.",
      "supporting_facts": [
        "f7",
        "f13"
      ],
      "legal_basis": "ss. 479, 482, 486 IPC"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Trade mark indicates connection in course of trade with proprietor, manufacture or quality of goods; property mark denotes movable property belongs to particular person, concerns ownership.",
      "addresses_issue": "i1",
      "key_observation": "Distinction: trade mark concerns goods, property mark concerns proprietor."
    },
    {
      "id": "cr2",
      "text": "Name BASANT BAHAR with picture of angel, flowers, inscription on packets was property mark denoting scent manufactured and belonging to complainant.",
      "addresses_issue": "i1",
      "key_observation": "Appellant marked his inferior scent similarly to cause belief it belonged to complainant."
    },
    {
      "id": "cr3",
      "text": "Complaint paras 14-15 aver using false mark, selling inferior scent palmed off as complainant's to defraud public; evidence supports; findings of trial court accepted.",
      "addresses_issue": "i1",
      "key_observation": "'Trade mark' loosely used; substance is property mark offence."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Appellant committed offence of using false property mark (s.482 IPC) and selling goods with counterfeit property mark (s.486 IPC).",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "In re Powells Trade Mark",
      "citation": "1893 10 R.P.C. 200",
      "treatment": "referred",
      "relevance": "Trade mark function: indication to purchaser of manufacture, quality, trade source."
    },
    {
      "case_name": "Emperor v. Dahyabhai Chakasha",
      "citation": "1904 6 Bom. L.R. 513",
      "treatment": "followed",
      "relevance": "Property mark denotes ownership even if goods sold; counterfeiting example with gold bars."
    },
    {
      "case_name": "S. K. Pethilingam Pillai v. N. M. Rowther",
      "citation": "A.I.R. 1969 Mad. 94",
      "treatment": "referred",
      "relevance": "Property mark remains even if part of property ceases to be owned."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "482",
        "486",
        "479"
      ],
      "relevance": "s.482: using false property mark; s.486: selling goods with counterfeit property mark; s.479: definition of property mark."
    },
    {
      "name": "Trade and Merchandise Marks Act, 1958",
      "sections": [
        "2(1)(j)"
      ],
      "relevance": "Definition of trade mark; post this Act, trade mark counterfeiting no longer offence under Penal Code."
    },
    {
      "name": "Code of Criminal Procedure",
      "sections": [],
      "relevance": "No provision for legal representative to continue deceased complainant's appeal."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court dismissed the appeal by special leave, upheld Patna High Court judgment restoring trial Magistrate's conviction and sentence under ss. 482 and 486 IPC, as case involved counterfeiting property mark, not trade mark.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The function of a trade mark is to give an indication to the purchaser or a possible purchaser as to the manufacture or quality of the goods, to give an indication to his eye of the trade source from Which the goods come.",
      "speaker": "court",
      "significance": "Defines trade mark per Bowen L.J., distinguishes from property mark."
    },
    {
      "text": "A property mark attached to the movable property of a person remains even if part of such property goes out of his hands and ceases to be his.",
      "speaker": "court",
      "significance": "Explains enduring nature of property mark denoting ownership."
    },
    {
      "text": "Though the complainant used the words trade mark at several places in the complaint it was loosely used as can be seen from paras 14 and 15 of the complaint.",
      "speaker": "court",
      "significance": "Holds complaint substance is property mark counterfeiting despite terminology."
    }
  ],
  "_case_id": "1972_557",
  "_label": 0,
  "_text_length": 16787,
  "_extracted_at": "2026-02-10T20:11:06.271721"
}