{
  "metadata": {
    "case_name": "Bangalore Woollen, Cotton and Silk Mills Ltd. v. Kuppuswamy",
    "case_year": 1967,
    "court": "Supreme Court of India",
    "judges": [
      "Mitter, J."
    ],
    "case_number": "Civil Appeal No. 1851 of 1967",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Dispute referred to Labour Court, Bangalore: whether Management justified in terminating services of five workmen including Kuppuswamy. Reference No. 86 of 1966.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "During proceedings, Binny Mills Labour Association entered settlement with management: reinstated Ramanadha, gave up demand for three others excluding Kuppuswamy. Union withdrew support to Kuppuswamy, who conducted own case.",
      "type": "procedural",
      "date": "1967-06-24",
      "source": "lower_court"
    },
    {
      "id": "f3",
      "text": "Kuppuswamy alleged to have behaved insolently towards Warehouse Master Veeraraghavan on 3rd November 1963 at about 9.15 a.m. by shouting and creating disorderly scene.",
      "type": "material",
      "date": "1963-11-03",
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "Charge sheet issued to Kuppuswamy on 6th November 1963 for misconduct under Standing Order No. 13(ii) i.e. act subversive to discipline.",
      "type": "procedural",
      "date": "1963-11-06",
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "Kuppuswamy submitted written explanation on 8th November 1963.",
      "type": "procedural",
      "date": "1963-11-08",
      "source": "respondent"
    },
    {
      "id": "f6",
      "text": "Domestic enquiry held by Mill Manager on 10th November 1963. Witnesses examined: Veeraraghavan, Allam, Murty. Kuppuswamy did not call witnesses, put limited questions. Veeraraghavan gave statement on past record (absences, prior similar behaviour) without opportunity for Kuppuswamy to cross-examine or explain.",
      "type": "procedural",
      "date": "1963-11-10",
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "Mill Manager terminated Kuppuswamy's services on 10th November 1963, finding charge proved, considering gravity, past conduct (absences, 25 days sick leave in 6 months, prior insolence let off on intercession). Paid one month's wages in lieu of notice.",
      "type": "material",
      "date": "1963-11-10",
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "Labour Court award dated 9th October 1967: accepted finding of guilt on misconduct, but set aside termination as no opportunity to challenge Veeraraghavan's statement on past record or explain it. Ordered reinstatement.",
      "type": "procedural",
      "date": "1967-10-09",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Government previously refused reference twice (1964, 1965) citing old cases/short service/proper enquiry, but referred in 1966.",
      "type": "background",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f10",
      "text": "Kuppuswamy examined himself and witness Shadgopalan; management examined witness; domestic enquiry records admitted by consent before Labour Court.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether Labour Court justified in setting aside termination despite accepting finding of guilt, on ground of no opportunity to challenge past record statement.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether order of reference invalid due to prior refusals by Government.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether proceedings should cease after Union withdrew support for Kuppuswamy.",
      "framed_by": "petitioner"
    },
    {
      "id": "i4",
      "text": "Whether reinstatement justified after long lapse of time (4 years).",
      "framed_by": "petitioner"
    },
    {
      "id": "i5",
      "text": "Whether reinstatement or compensation appropriate given serious misconduct.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Labour Court erred in setting aside dismissal on ground not raised by workman; no request for cross-examination on past record.",
      "supporting_facts": [
        "f6",
        "f7"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Reference invalid as Government previously refused; no material shown for change.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": "Industrial Disputes Act s.10(1)"
    },
    {
      "id": "pa3",
      "text": "Labour Court should not proceed after Union withdrew support.",
      "supporting_facts": [
        "f2"
      ],
      "legal_basis": "Industrial Disputes Act s.2A, s.12(3)"
    },
    {
      "id": "pa4",
      "text": "No reinstatement after long lapse; management made other arrangements.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": null
    },
    {
      "id": "pa5",
      "text": "Reinstatement unjustified for serious breach; award compensation instead.",
      "supporting_facts": [
        "f3",
        "f7"
      ],
      "legal_basis": null
    },
    {
      "id": "pa6",
      "text": "Even if past record issue flawed, dismissal sustainable on proved misconduct alone.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "Railway Board v. Niranjan Singh; State of Orissa v. Bidyabhan Mohapatra"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Filed statement of claim, rejoinder; denied enmity with witnesses; explained loud voice as habit.",
      "supporting_facts": [
        "f5",
        "f6"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Enquiry unfair: no opportunity to cross-examine or explain Veeraraghavan's past record statement despite opportunities given earlier; impression enquiry officer could consider past without say.",
      "addresses_issue": "i1",
      "key_observation": "Cumulative effect of lapses led to termination; solitary misconduct insufficient for dismissal."
    },
    {
      "id": "cr2",
      "text": "Reference valid; no material on prior refusals; Government can refer anytime under s.10(1).",
      "addresses_issue": "i2",
      "key_observation": "Point not canvassable without Government as party."
    },
    {
      "id": "cr3",
      "text": "Dispute remains post-union withdrawal; referred dispute does not cease for one employee.",
      "addresses_issue": "i3",
      "key_observation": "Settlement of others does not affect referred dispute."
    },
    {
      "id": "cr4",
      "text": "Lapse of time no bar to reinstatement absent dislocation proof; normal delays in references.",
      "addresses_issue": "i4",
      "key_observation": "No compelling circumstances of dislocation."
    },
    {
      "id": "cr5",
      "text": "Reinstatement appropriate; no loss of confidence alleged; serious misconduct but justice requires reinstatement.",
      "addresses_issue": "i5",
      "key_observation": "Doubtful if dismissal without past record input."
    },
    {
      "id": "cr6",
      "text": "Distinguished precedents: Delhi Cloth (no demand for expert cross); Railway Board (separate charges); not applicable as cumulative factors key.",
      "addresses_issue": "i1",
      "key_observation": "Prejudice caused by irregularity."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Domestic enquiry violated natural justice by denying opportunity on past record; Labour Court justified in setting aside termination despite guilt on charge.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Reference valid; not invalidated by prior refusals.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Withdrawal of union support does not terminate referred dispute for individual.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    },
    {
      "id": "h4",
      "text": "Reinstatement not barred by time lapse without dislocation.",
      "resolves_issue": "i4",
      "in_favor_of": "respondent"
    },
    {
      "id": "h5",
      "text": "Reinstatement ordered, not compensation; no loss of confidence.",
      "resolves_issue": "i5",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Management of Delhi Cloth General Mills Co. Ltd. v. Kalu Ram",
      "citation": "Civil Appeal No. 195 of 1964 decided on 9th April, 1965",
      "treatment": "distinguished",
      "relevance": "No demand for specific cross-examination; no violation of natural justice if not requested."
    },
    {
      "case_name": "Railway Board v. Niranjan Singh",
      "citation": null,
      "treatment": "distinguished",
      "relevance": "Order sustainable on any substantial ground; but here cumulative, not separate serious charges."
    },
    {
      "case_name": "State of Orissa v. Bidyabhan Mohapatra",
      "citation": "1969 3 S.C.R. 548",
      "treatment": "distinguished",
      "relevance": "Punishment upheld if supported by any finding; inapplicable as cumulative lapses key."
    },
    {
      "case_name": "India Marine Service v. Their Workmen",
      "citation": "1963 1 L.L.J. 122",
      "treatment": "distinguished",
      "relevance": "Dismissal based primarily on one charge, past record secondary."
    },
    {
      "case_name": "Tata Oil Mills Co. v. Its Workmen",
      "citation": "1963 2 L.L.J. 78",
      "treatment": "distinguished",
      "relevance": "No prejudice from not supplying report as points tested."
    },
    {
      "case_name": "Shalimar Works Limited v. Their Workmen",
      "citation": "1960 1 S.C.R. 150",
      "treatment": "distinguished",
      "relevance": "No reinstatement for large numbers after long delay causing dislocation; inapplicable to single workman."
    },
    {
      "case_name": "Hindustan Steels v. A. K. Roy",
      "citation": null,
      "treatment": "referred",
      "relevance": "Discretion for reinstatement or compensation; interfere only if disregard of principles."
    }
  ],
  "statutes_cited": [
    {
      "name": "Industrial Disputes Act",
      "sections": [
        "s.10(1)",
        "s.12(3)",
        "s.2A"
      ],
      "relevance": "Reference at any time if dispute exists; settlement memorandum; individual disputes."
    },
    {
      "name": "Standing Orders",
      "sections": [
        "No. 13(ii)"
      ],
      "relevance": "Misconduct: act subversive to discipline."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 226",
        "Art. 311"
      ],
      "relevance": "Writ against dismissal; enquiry under Art. 311."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal dismissed; Labour Court's award upheld. Termination set aside due to violation of natural justice in domestic enquiry regarding past record without opportunity to respond. Reinstatement of Kuppuswamy ordered.",
    "relief_granted": "Reinstatement",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"the record of the enquiry officer seems to suggest that he was under the impression that he could look into the past record of the delinquent without affording him an opportunity of explanation or testing by cross-examination what was alleged against him.\"",
      "speaker": "court",
      "significance": "Core finding on natural justice violation."
    },
    {
      "text": "\"It was not a case where two separate charges had been framed against the delinquent and they were of such a serious nature that the finding of guilt on any one would warrant the dismissal.\"",
      "speaker": "court",
      "significance": "Explains why punishment not severable from past record."
    },
    {
      "text": "\"Normally it will be months before an order of reference is made by Government and one or two years elapse in almost all cases before the adjudication by an Industrial Tribunal is complete. If mere lapse of time be enough to lead the Industrial Tribunal to hold that there should be no reinstatement of service the power of reinstatement will become obsolete.\"",
      "speaker": "court",
      "significance": "Rejects time lapse argument."
    }
  ],
  "_case_id": "1972_528",
  "_label": 0,
  "_text_length": 31570,
  "_extracted_at": "2026-02-10T20:11:05.598260"
}