{
  "metadata": {
    "case_name": "Hitkarini Sabha, Jabalpur v. Municipal Corporation, Jabalpur & Ors.",
    "case_year": 1967,
    "court": "Supreme Court of India",
    "judges": [
      "Grover, J."
    ],
    "case_number": "Civil Appeals Nos. 702 and 703 of 1967",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Plots Nos. 670, 671 and 735 situate in Madan Mahal Extension area, Jabalpur were acquired by the State Government under the Land Acquisition Act 1894 for constructing the Home Science College. Mainly concerned with Plot No. 670.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On August 31, 1940, a deed of lease executed on behalf of the Municipal Corporation granting a lease free of premium to the Hitkarini Sabha, Jabalpur (appellant) for 10 Acres comprising Plot No. 670 and another strip of 0.621 Acres for 30 years to locate and run Hitkarini City College. Yearly rent Rs. 5 for 10 acres and Re. 1 for strip. Renewal entitled on terms agreed between parties.",
      "type": "material",
      "date": "1940-08-31",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Appellant built a college hostel on the land and used attached ground as playground.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Collector of Jabalpur award dated July 18, 1955 assessed compensation for lands in three plots at As. 0/8/- per sq. ft. Held appellant lessee for term in lease-deed for specific purpose.",
      "type": "procedural",
      "date": "1955-07-18",
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "Apportionment made between appellant and Corporation for Plot No. 670.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "Appellant and Corporation dissatisfied, applied for reference under s. 18 of the Act.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "Additional District Judge held price at 10 As. per sq. ft., appellant and Municipal Corporation entitled to equal compensation for Plot No. 670.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "High Court affirmed price fixed by Additional District Judge at As. 0/8/- per sq. ft. On apportionment, following Dagdulal v. Municipal Committee, Burhar, lease deed executed by Administrator during Corporation supersession ineffective. But tenancy by implication from rent acceptance, on terms in lease deed.",
      "type": "procedural",
      "date": "1960-09-28",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "High Court held renewal clause uncertain and vague, not valid contract under s. 29 Indian Contract Act. Apportionment on actuarial basis 1038:962 between appellant and Corporation.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Lease executed when Municipal Committee superseded; signed by In-Charge and Secretary. Resolution was for license, not lease.",
      "type": "disputed",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether renewal clause in lease deed should be considered for apportionment of compensation between appellant and Corporation.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Quantum of compensation awarded, whether potential value considered.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Since High Court held tenancy continued on terms contained in lease deed, benefit of renewal clause should be given.",
      "supporting_facts": [
        "f2",
        "f8",
        "f9"
      ],
      "legal_basis": "H. V. Rajan v. C. N. Gopal (AIR 1961 Mys. 29)"
    },
    {
      "id": "pa2",
      "text": "Potential value of plot not taken into consideration; special situation due to size, locality, nearness to business centre and Madan Mahal Station.",
      "supporting_facts": [
        "f1",
        "f3"
      ],
      "legal_basis": "Raja Vyricherla Narayana Gajapatiraju v. The Revenue Divisional Officer Vizagapatam (66 I.A. 104)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Lease deed ineffective as executed during supersession of Corporation.",
      "supporting_facts": [
        "f2",
        "f10"
      ],
      "legal_basis": "Dagdulal v. Municipal Committee, Burhar (1960 M.P.L.J. 627)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Lease deed wholly ineffective and void as officer had no power to lease; tenancy by acceptance of rent, but under s. 106 Transfer of Property Act, month to month as not agricultural/manufacturing. Renewal clause cannot be considered for apportionment.",
      "addresses_issue": "i1",
      "key_observation": "No lease for 30 years with renewal could be spelt out from void deed."
    },
    {
      "id": "cr2",
      "text": "Quantum fixed by reference to sales of comparable plots, considering development costs, roads/drains (70,000 sq ft open, Rs. 8500 cost), 80% saleable; 10/ per sq ft generous.",
      "addresses_issue": "i2",
      "key_observation": "High Court took all factors into consideration."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Renewal clause ineffective; tenancy month to month under s. 106 T.P. Act; apportionment not to consider it.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Compensation quantum of 10/ per sq. ft. reasonable, considering comparable sales and development factors.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Dagdulal v. Municipal Committee, Burhar",
      "citation": "1960 M.P.L.J. 627",
      "treatment": "followed",
      "relevance": "Lease by Administrator during supersession ineffective; property vested in State."
    },
    {
      "case_name": "H. V. Rajan v. C. N. Gopal Others",
      "citation": "A.I.R. 1961 Mys. 29",
      "treatment": "referred",
      "relevance": "Renewal clause ordinarily on original terms unless vague; courts reluctant to ignore."
    },
    {
      "case_name": "Ramaswami v. Rajagopala",
      "citation": "I.L.R. 11 Mad. 260",
      "treatment": "followed",
      "relevance": "Lease with rent to be fixed by landlord void for uncertainty."
    },
    {
      "case_name": "Raja Vyricherla Narayana Gajapatiraju v. The Revenue Divisional Officer Vizagapatam",
      "citation": "66 I.A. 104",
      "treatment": "followed",
      "relevance": "Potentialities to be considered in market value."
    }
  ],
  "statutes_cited": [
    {
      "name": "Land Acquisition Act 1894",
      "sections": [
        "s. 18"
      ],
      "relevance": "Reference applications against Collector's award."
    },
    {
      "name": "Transfer of Property Act",
      "sections": [
        "s. 106"
      ],
      "relevance": "Tenancy from month to month where lease void and not for agricultural/manufacturing."
    },
    {
      "name": "Indian Contract Act",
      "sections": [
        "s. 29"
      ],
      "relevance": "Agreement void for uncertainty; renewal clause unenforceable."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeals dismissed. High Court judgment affirmed on quantum of compensation and apportionment; renewal clause not effective as lease deed void, tenancy month to month.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "If the officer who executed the lease deed had no power to lease out the property in question the grant of the lease was wholly null and void.",
      "speaker": "court",
      "significance": "Basis for holding lease ineffective."
    },
    {
      "text": "Under s. 106 of that Act the tenancy, in the present case, could be only from month to month.",
      "speaker": "court",
      "significance": "Determines nature of tenancy post-void lease."
    },
    {
      "text": "We have no manner of doubt that the High Court had taken all the factors into consideration while assessing the value.",
      "speaker": "court",
      "significance": "Affirms quantum calculation."
    }
  ],
  "_case_id": "1972_244",
  "_label": 0,
  "_text_length": 13311,
  "_extracted_at": "2026-02-10T20:09:04.968346"
}