{
  "metadata": {
    "case_name": "Assessee Firm v. Commissioner of Income-tax",
    "case_year": 1969,
    "court": "Supreme Court of India",
    "judges": [
      "HEGDE, J"
    ],
    "case_number": "Civil Appeal No. 20 of 1969",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The assessee is a registered firm of three partners, Madanlal Bagaria, Bajranglal Bagaria and Sohanlal Bagaria, each having a 1/3rd share in the partnership. The partners are brothers. Its business is that of manufacture and sale of aluminum utensils.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Upto the assessment year 1962-63, the firm was making its sales direct to the customers.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "In the assessment year 1963-64 (relevant previous year being 13-4-1963 to 1-4-1964), the assessee claimed to have paid Rs. 31,684/- to Messrs. Eastern Sales Corpn. as selling agency commission and claimed deduction of the same under S. 37 of the Indian Income-tax Act, 1961 as an item of expenditure laid out or expanded wholly and exclusively for the purpose of the business.",
      "type": "material",
      "date": "1963-04-13",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The Income-tax Officer rejected the claim.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The Appellate Assistant Commissioner in appeal allowed the claim, observing that on a careful consideration of the facts and circumstances, the discount should be allowed as a deduction, as having been laid out wholly and exclusively for the purpose of the appellant's business. Noted phenomenal increase in sales after appointment of selling agents, mere fact of partners of selling agents being closely related to partners of assessee firm is of little consequence in absence of proof of collusion, payment against actual service rendered, depositions show selling agency firm contacted customers and improved sales.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "The Department appealed to the Income-tax Appellate Tribunal A Bench, Calcutta, which reversed the AAC order and restored ITO's order.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Tribunal concluded that the selling agency agreement was only a make-believe arrangement, merely a device to minimise the tax liability of the assessee firm and not a genuine business arrangement.",
      "type": "disputed",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Selling agency firm (Eastern Sales Corpn.) had four major partners and two minors entitled to shares: Shiva Kumari Bagaria (wife of Madanlal Bagaria, 1/3rd share); Triveni Devi Bagaria (wife of Bajranglal Bagaria, 1/9th); Kanti Prasad Bagaria (major son of Bajranglal, 1/9th); Nandlal Bagaria (minor son of Bajranglal, 1/9th) – wife and children of Bajranglal entitled to 1/3rd; Banarshi Devi Bagaria (wife of Sohanlal Bagaria, 1/9th); Shyamsunder Bagaria (minor son of Sohanlal, 1/6th) – wife and son of Sohanlal entitled to 1/3rd.",
      "type": "material",
      "date": null,
      "source": "tribunal"
    },
    {
      "id": "f9",
      "text": "Selling agency agreement entered into on March 26, 1962, but partnership deed shows partnership came into existence on April 13, 1962.",
      "type": "material",
      "date": "1962-03-26",
      "source": "tribunal"
    },
    {
      "id": "f10",
      "text": "Out of partners, two were minors who could not have rendered assistance; three partners were ladies who had no prior business experience; only male adult Kanti Prasad Bagaria had 1/9th share and was partner in another manufacturing concern at distant place.",
      "type": "material",
      "date": null,
      "source": "tribunal"
    },
    {
      "id": "f11",
      "text": "Business address of selling agency firm same as assessee firm; no godown of its own, no transport vehicles.",
      "type": "material",
      "date": null,
      "source": "tribunal"
    },
    {
      "id": "f12",
      "text": "Tribunal did not place reliance on oral evidence (depositions of customers and partners) in view of surrounding circumstances.",
      "type": "disputed",
      "date": null,
      "source": "tribunal"
    },
    {
      "id": "f13",
      "text": "High Court declined to call upon Tribunal to state a case in Income Tax Reference No. 26 of 1968 (order dated July 1, 1968).",
      "type": "procedural",
      "date": "1968-07-01",
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Assessee filed appeal by special leave to Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether any question of law arose from the order of the Tribunal which required the Tribunal to state the case for the opinion of the High Court.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Tribunal misconstrued or misunderstood the two documents viz. the selling agency agreement dated March 26, 1962 and the partnership deed dated April 13, 1962; no discrepancy as partnership may be oral and agreement comes into force on April 13, 1962.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Tribunal ignored the oral evidence and the same has vitiated its conclusions; depositions clearly show selling agency contacted customers and improved sales.",
      "supporting_facts": [
        "f5",
        "f12"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Tribunal's order is prima facie perverse, citing cases like Dhirajlal Girdharilal, Rajasthan Mines Ltd., A. Raman & Co., Indian Woollen Textile Mills, Durga Prasad More.",
      "supporting_facts": [],
      "legal_basis": "Precedents cited"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Tribunal's findings are facts; no misconstruction of documents; oral evidence not ignored but not relied upon due to surrounding circumstances.",
      "supporting_facts": [
        "f8",
        "f9",
        "f10",
        "f11",
        "f12"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Tribunal's findings that selling agency was make-believe and device to minimize tax are prima facie findings of fact; no discrepancy challengeable as partnership deed shows existence from April 13, 1962.",
      "addresses_issue": "i1",
      "key_observation": "Selling agency firm did not exist on March 26, 1962."
    },
    {
      "id": "cr2",
      "text": "Tribunal did not ignore oral evidence but declined reliance in view of surrounding circumstances; open to Tribunal to reject it.",
      "addresses_issue": "i1",
      "key_observation": "No much value can be attached to oral evidence."
    },
    {
      "id": "cr3",
      "text": "Tribunal's conclusions supported by evidence, rationally arrived at, not perverse; AAC's observation mere ipse dixit without reasons.",
      "addresses_issue": "i1",
      "key_observation": "No irrelevant or inadmissible material used."
    },
    {
      "id": "cr4",
      "text": "Case falls within Swadeshi Cotton Mills: whether expenditure u/s 37 laid out wholly for business decided on facts; mere agreement and payment does not bind ITO.",
      "addresses_issue": "i1",
      "key_observation": "Assessee adopted device making income appear earned by another."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Tribunal was justified in not stating a case; High Court justified in not calling for statement of case u/s 256(1) and (2). No question of law arose.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Dhirajlal Girdharilal v. Commissioner of Income-tax, Bombay",
      "citation": "26 ITR 736",
      "treatment": "distinguished",
      "relevance": "Finding vitiated only if based on partly irrelevant material; not applicable here."
    },
    {
      "case_name": "Commissioner of Income-tax, West Bengal-II v. Rajasthan Mines Ltd.",
      "citation": "78 ITR 45",
      "treatment": "followed",
      "relevance": "Tribunal conclusion can be challenged if not supported by evidence or perverse; not so here."
    },
    {
      "case_name": "Commissioner of Income-tax, Gujarat v. A. Raman & Co.",
      "citation": "67 ITR 11",
      "treatment": "followed",
      "relevance": "Tax avoidance devices allowed unless income made to appear earned by another; assessee case falls in latter."
    },
    {
      "case_name": "Commissioner of Income-tax, Punjab v. Indian Woollen Textile Mills",
      "citation": "51 ITR 291",
      "treatment": "distinguished",
      "relevance": "Tribunal assumed facts and ignored others; not so here."
    },
    {
      "case_name": "Commissioner of Income-tax, West Bengal II v. Durga Prasad More",
      "citation": "82 ITR 540",
      "treatment": "followed",
      "relevance": "Tribunal finding on unreality not vitiated."
    },
    {
      "case_name": "Swadeshi Cotton Mills Co. Ltd. v. Commissioner of Income-tax, U.P.",
      "citation": "63 ITR 57",
      "treatment": "followed",
      "relevance": "Whether s.37 expenditure for business decided on facts; mere agreement does not bind."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act, 1961",
      "sections": [
        "Section 37",
        "Section 256(1)",
        "Section 256(2)"
      ],
      "relevance": "Deduction for business expenditure; reference to High Court if question of law arises."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal by special leave against High Court's refusal to direct Tribunal to state a case is dismissed. Tribunal justified in holding selling agency commission not deductible as sham arrangement.",
    "relief_granted": null,
    "costs": "Dismissed with costs."
  },
  "key_quotes": [
    {
      "text": "\"the so called selling agency agreement between the assessee firm and the selling agency firm was only a make-believe arrangement. It was merely a device to minimise the tax liability of the assessee firm\"",
      "speaker": "court",
      "significance": "Tribunal's key finding upheld by Supreme Court."
    },
    {
      "text": "\"the selling agency firm had no even come into existence. It came into existence for the first time on April 13, 1962.\"",
      "speaker": "court",
      "significance": "Discrepancy in dates supporting sham nature."
    },
    {
      "text": "\"Prima facie all these are findings of fact.\"",
      "speaker": "court",
      "significance": "No question of law arises from factual findings."
    }
  ],
  "_case_id": "1972_357",
  "_label": 0,
  "_text_length": 16544,
  "_extracted_at": "2026-02-10T20:09:48.366741"
}