{
  "metadata": {
    "case_name": "M/s. Rai Singh Deb Singh Bist (HUF) v. Income-tax Officer",
    "case_year": 1969,
    "court": "Supreme Court of India",
    "judges": [
      "HEGDE, J."
    ],
    "case_number": "Civil Appeals Nos. 2392 to 2403 of 1969",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The assessee is an H.U.F. namely M/s. Rai Singh Deb Singh Bist with Karta Thakur Mohan Singh Bist.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Assessment years concerned: 1942-43 to 1953-54.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Assessee filed returns for these years in due time.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Assessee's account-books showed considerable cash credits in the name of brothers-in-law of the Karta, who were living in Nepal.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Account books showed credit entries in the name of Rana Anand Nar Singh in connection with expenses for getting trees cut on behalf of assessee.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Assessee was a forest contractor who had taken large tracts of forests for felling trees in Nepal.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Income-tax Officer investigated genuineness of cash credit entries and amount due to one creditor; assessee's contention substantially accepted by Appellate Assistant Commissioner or Revenue Appellate Tribunal.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "For assessment years 1943-44 to 1949-50, final assessments made pursuant to settlement between assessee and Deputy Director of Inspection (Investigation), New Delhi on October 18, 1954.",
      "type": "procedural",
      "date": "1954-10-18",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Long after finalisation, Income-tax Officer, Central Circle 1, Delhi issued notices under s.34(1)(a) of Indian Income-tax Act, 1922 to reopen assessments.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Assessee filed writ petitions (Civil Writs Nos. 67 to 78 of 1968) in Delhi High Court challenging validity of notices.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Delhi High Court by judgment dated September 9, 1968 allowed writ petitions and quashed notices.",
      "type": "procedural",
      "date": "1968-09-09",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "In writ petitions, assessee alleged no relevant material before ITO for reason to believe income escaped assessment; called for production of ITO's report to Central Board of Revenue and CBR order.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f13",
      "text": "Department failed to produce ITO's report or CBR order despite prayers; affidavit stated records missing from CBR file; no reason for not producing copies from ITO's file.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Department contended that in 1955, assessee sold large tracts of land to two brothers-in-law for Rs.47 lakhs but property not worth that amount.",
      "type": "disputed",
      "date": "1955",
      "source": "respondent"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether Income-tax Officer had jurisdiction to issue notices under s.34(1)(a) of the Indian Income-tax Act, 1922 to reopen assessments, i.e., whether ITO had reason to believe that income escaped assessment due to assessee's omission or failure to disclose fully and truly all material facts, and whether reasons were recorded and CBR satisfied.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "No relevant material before ITO to have reason to believe any income escaped assessment due to non-disclosure.",
      "supporting_facts": [
        "f12"
      ],
      "legal_basis": "s.34(1)(a) of Indian Income-tax Act, 1922"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Assessee sold large tracts of land to brothers-in-law in 1955 for Rs.47 lakhs though not worth that amount.",
      "supporting_facts": [
        "f14"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Before issuing notice u/s 34(1)(a), ITO must have reason to believe income escaped due to non-disclosure of material facts, record reasons, and CBR must be satisfied on those reasons.",
      "addresses_issue": "i1",
      "key_observation": "Recording reasons and CBR satisfaction are conditions precedent to jurisdiction."
    },
    {
      "id": "cr2",
      "text": "Cash credits were already investigated and substantially accepted before final assessments.",
      "addresses_issue": "i1",
      "key_observation": "No new material for belief of non-disclosure."
    },
    {
      "id": "cr3",
      "text": "Department failed to produce ITO's report to CBR or CBR order despite calls; records not traced from CBR, no copies from ITO file; adverse inference against department.",
      "addresses_issue": "i1",
      "key_observation": "Records not produced as they did not assist department's case."
    },
    {
      "id": "cr4",
      "text": "No basis shown for department's conclusion on land sale value; vague feeling insufficient for belief.",
      "addresses_issue": "i1",
      "key_observation": "Facts necessary for jurisdiction not established."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "ITO lacked jurisdiction to issue notices u/s 34(1)(a) as no relevant material for reason to believe income escaped due to non-disclosure; conditions precedent not satisfied.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Calcutta Discount Co. Ltd. v. Income-tax Officer, Companies District I, Calcutta",
      "citation": "(1961) 41 I.T.R. 191",
      "treatment": "followed",
      "relevance": "Two conditions precedent for jurisdiction u/s 34 beyond 4 years but within 8: ITO belief of under-assessment and due to non-disclosure."
    },
    {
      "case_name": "Chhugamal Rajpal v. S. P. Chaliha",
      "citation": "79 I.T.R. 603",
      "treatment": "followed",
      "relevance": "ITO needs relevant material for belief income escaped; vague feeling insufficient; CBR must examine reasons independently, not mechanically."
    },
    {
      "case_name": "Sheo Nath Singh v. Appellate Assistant Commissioner of Income-tax, Central, Calcutta",
      "citation": "82 I.T.R. 147",
      "treatment": "followed",
      "relevance": "Reiterated CBR must examine ITO reasons independently."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act, 1922",
      "sections": [
        "s.34(1)(a)",
        "s.22"
      ],
      "relevance": "Governs reopening of assessments; requires belief of escape due to non-disclosure, recorded reasons, and CBR satisfaction."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court dismissed the appeals, upholding the Delhi High Court's order quashing the notices issued under s.34(1)(a) as the Income-tax Officer lacked jurisdiction due to absence of relevant material and failure to produce records establishing conditions precedent.",
    "relief_granted": "Notices quashed (upheld High Court order)",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"The recording of the reasons in support of the belief formed by the Income-tax Officer and the satisfaction of the Central Board of Revenue on the basis of the reasons recorded by the Income-tax Officer that it is a fit case for issue of notice under s. 34(1)(a) are extremely important circumstances to find out whether the Income-tax Officer had jurisdiction.\"",
      "speaker": "court",
      "significance": "Emphasizes mandatory conditions precedent for jurisdiction."
    },
    {
      "text": "\"We are constrained to come to the conclusion that the records in question were not produced because they did not assist the department's case.\"",
      "speaker": "court",
      "significance": "Adverse inference from non-production of records leading to finding against jurisdiction."
    }
  ],
  "_case_id": "1972_585",
  "_label": 0,
  "_text_length": 8239,
  "_extracted_at": "2026-02-10T20:11:06.516127"
}