{
  "metadata": {
    "case_name": "State of Uttar Pradesh v. Raja",
    "case_year": 1967,
    "court": "Supreme Court of India",
    "judges": [
      "Ray, J."
    ],
    "case_number": "Civil Appeal No. 238 of 1967",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The respondent was prior to the abolition of Zamindari in the State of Uttar Pradesh the Raja of the properties known as Chandapur Raj consisting of 28 villages, in the Tahsil Maharajganj in the District of Rae Bareli.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The respondent was a minor till 3 March, 1958 and he attained majority on 4 March, 1958.",
      "type": "background",
      "date": "1958-03-04",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The properties were under the management of the Court of Wards from 1945 to 1953 and thereafter under the management of the District Judge, Rae Bareli up to 4 March, 1958.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The agricultural land had been sub-let to tenants under the orders of the Court of Wards and the District Judge when the respondent's properties were under their management.",
      "type": "material",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f5",
      "text": "On 1 April, 1958 the Tax Assessment Officer, Maharajganj Sub-Division served a notice under section 7(2) of the 1957 Act on the respondent for the assessment Fasli year 1365 commencing on 1 July, 1957 and ending on 30 June, 1958.",
      "type": "procedural",
      "date": "1958-04-01",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The respondent filed a return and claimed benefit of exemption under rule 6-A of the said Rules in respect of the agricultural land which had been sub-let.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f7",
      "text": "On 16 July, 1958 the Sub-Divisional Officer, Maharajganj being the Assessing Officer dismissed the respondent's claim for exemption in respect of the land holding sub-let and passed an assessment order imposing tax on the land holding of the respondent for the sum of Rs. 62,011.39.",
      "type": "procedural",
      "date": "1958-07-16",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "The assessment according to the respondent should have been Rs. 34,274-6-10 as a result of the exemption under rule 6-A.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f9",
      "text": "The respondent preferred an appeal before the Commissioner, Lucknow Division. The appeal was dismissed on 9 September, 1958. The Commissioner held that rule 6-A was not applicable to assessment of tax for the 1365 Fasli year.",
      "type": "procedural",
      "date": "1958-09-09",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "On 29 September, 1958 the respondent filed a writ petition in the High Court at Allahabad challenging the validity of the Act and for quashing the assessment orders.",
      "type": "procedural",
      "date": "1958-09-29",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "The learned Single Judge of the Allahabad High Court on 29 February, 1960 held that the Act was valid and allowed the writ petition in part by holding that the respondent was entitled to the benefit of rule 6-A and therefore quashed the assessment order.",
      "type": "procedural",
      "date": "1960-02-29",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "The State filed an appeal. The High Court dismissed the appeal and upheld the judgment and order of the learned Single Judge on 9 February, 1965.",
      "type": "procedural",
      "date": "1965-02-09",
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "The 1957 Act came into force on 1 July, 1957.",
      "type": "background",
      "date": "1957-07-01",
      "source": "court"
    },
    {
      "id": "f14",
      "text": "The rules were published in the U.P. Gazette, Extraordinary dated 23 November, 1957.",
      "type": "background",
      "date": "1957-11-23",
      "source": "court"
    },
    {
      "id": "f15",
      "text": "Rule 6-A was added to the Rules by an amendment on 23 April, 1958.",
      "type": "background",
      "date": "1958-04-23",
      "source": "court"
    },
    {
      "id": "f16",
      "text": "The respondent was a disabled land-holder within the meaning of section 157 of the Zamindari Abolition and Land Reforms Act, 1950.",
      "type": "admitted",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the respondent was entitled to the benefit of rule 6-A for the assessment year Fasli 1365 commencing 1 July 1957, given that rule 6-A came into existence on 23 April 1958.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the land was lawfully sub-let.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether there was a patent error justifying the issuance of a writ for misconstruction of rule 6-A by the assessing authorities.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Tax was to be assessed on the annual value of land holding as on 1 July, 1957 and inasmuch rule 6-A did not come into existence on 1 July, 1957 the respondent was not entitled to the benefit of the rule.",
      "supporting_facts": [
        "f13",
        "f15"
      ],
      "legal_basis": "Section 3 of the Act"
    },
    {
      "id": "pa2",
      "text": "Rule 6-A was not at all applicable, because it was not proved that the land was lawfully sub-let.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": "Rule 6-A"
    },
    {
      "id": "pa3",
      "text": "The High Court was wrong in issuing the writ on the ground of misconstruction of rule 6-A by the assessing authorities because it was not a patent error.",
      "supporting_facts": [
        "f11",
        "f12"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Entitled to exemption under rule 6-A in respect of the agricultural land which had been sub-let to tenants under the orders of the Court of Wards and the District Judge.",
      "supporting_facts": [
        "f3",
        "f4",
        "f16"
      ],
      "legal_basis": "Rule 6-A of the Uttar Pradesh Large Land Holdings Rules, 1957; section 157 of the U.P. Zamindari Abolition and Land Reforms Act, 1950"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The contention that rule 6-A was not made retrospective and therefore does not apply is unacceptable as it is unsound. Rule 6-A is to be read with sections 3, 4 and 5 of the Act. The assessment was for the entire agricultural year from 1 July, 1957 up to 30 June, 1958. Rules are procedural and relate to assessments made after the rule came into effect.",
      "addresses_issue": "i1",
      "key_observation": "Rule 6-A applies to the assessment for the year even if made after its enactment, as the land fulfilled the character of being legally sub-let during the assessment year."
    },
    {
      "id": "cr2",
      "text": "The contention that the land had not been legally sub-let cannot be entertained as in the High Court the State did not dispute the legality of sub-letting.",
      "addresses_issue": "i2",
      "key_observation": "Legality of sub-letting not disputed earlier."
    },
    {
      "id": "cr3",
      "text": "The contention that there is no patent error and therefore the High Court was wrong in issuing a writ is unacceptable. The question of application of rule 6-A is a question of construction of the statute and rules in respect of assessment.",
      "addresses_issue": "i3",
      "key_observation": "High Court justified in issuing writ."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The respondent was entitled to the benefit under rule 6-A of the Uttar Pradesh Large Land Holdings Rules, 1957 for the assessment year Fasli 1365.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "The land was legally sub-let.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "High Court was justified in issuing the writ quashing the assessment order.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Uttar Pradesh Large Land Holdings Tax Act, 1957",
      "sections": [
        "Section 3",
        "Section 4",
        "Section 5",
        "Section 7(2)",
        "Section 29"
      ],
      "relevance": "Levy of tax on annual value of land holding for agricultural year; empowers making of rules; notice for return."
    },
    {
      "name": "Uttar Pradesh Large Land Holdings Rules, 1957",
      "sections": [
        "Rule 6-A"
      ],
      "relevance": "Exemption from holding tax on land legally sub-let by disabled land-holder; benefit applicable to assessment year."
    },
    {
      "name": "U.P. Zamindari Abolition and Land Reforms Act, 1950",
      "sections": [
        "Section 157(1)"
      ],
      "relevance": "Defines disabled land-holder."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal by special leave by the State of Uttar Pradesh is dismissed. The judgment of the Allahabad High Court upholding the Single Judge's order quashing the assessment and granting benefit of rule 6-A to the respondent is affirmed.",
    "relief_granted": "Respondent entitled to benefit under rule 6-A; assessment order quashed.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"This contention is unacceptable as it is unsound. Under section 3 of the Act holding tax... is levied for the agricultural year on the annual value of each land holding.\"",
      "speaker": "court",
      "significance": "Rejects argument that rule 6-A inapplicable due to date of enactment."
    },
    {
      "text": "\"The entire fallacy of the appellant is that to make rule 6-A effective from 23 April, 1958 would be to rob rule 6-A of its extent and content in respect of assessment.\"",
      "speaker": "court",
      "significance": "Explains applicability of rule to ongoing assessment year."
    },
    {
      "text": "\"Rules are procedural. Rules relate to the assessments. The assessment is for the entire year.\"",
      "speaker": "court",
      "significance": "Justifies application of subsequent rules to assessments."
    }
  ],
  "_case_id": "1972_513",
  "_label": 0,
  "_text_length": 8720,
  "_extracted_at": "2026-02-10T20:10:18.006051"
}