{
  "metadata": {
    "case_name": "State v. Respondents (Paulraj Match Works and Meenachi Match Works)",
    "case_year": 1969,
    "court": "Supreme Court of India",
    "judges": [
      "Ray, J."
    ],
    "case_number": "Criminal Appeals Nos. 194 and 195 of 1969",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "In Criminal Appeal No. 194 of 1969, acts complained of occurred on 25 July 1964; complaint filed on 18 May 1965 against accused No.1 (licensee of Paulraj Match Works, Nallichatram) and accused No.2 (accountant); accused affixed cut banderols and torn banderols to matches to evade excise duty of Rs. 577.42; violations of Rules 53, 64, 67, 68, 70, 71, 66 and 226; RG1 not written from 2 July 1964, RG3 incorrectly maintained, shortage of 50 banderol leaves.",
      "type": "material",
      "date": "1964-07-25",
      "source": "prosecution"
    },
    {
      "id": "f2",
      "text": "Sub-Divisional Magistrate acquitted accused on 30 November 1965 holding prosecution barred by limitation under Section 40(2); complaint received 18 May 1965, six months from 25 July 1964 expired on 25 January 1965.",
      "type": "procedural",
      "date": "1965-11-30",
      "source": "lower_court"
    },
    {
      "id": "f3",
      "text": "Madras High Court on 21 November 1968 dismissed State's appeal holding prosecution barred by limitation.",
      "type": "procedural",
      "date": "1968-11-21",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "In Criminal Appeal No. 195 of 1969, acts complained of occurred on 20 June 1964; complaint filed on 15 January 1965 against accused No.1 (licensee of Meenachi Match Works) and accused No.2 (husband running factory); factory working at night, cut banderols pasted instead of full, excess matches cleared without entry/payment of duty Rs. 2437.50 during 1963-64 and 1964-65 up to 20 June 1964; violations of Rules 9, 53, 64, 66, 67, 68, 70 and 226.",
      "type": "material",
      "date": "1964-06-20",
      "source": "prosecution"
    },
    {
      "id": "f5",
      "text": "Sub-Divisional Magistrate convicted accused on 6 July 1965; Sessions Judge at Ramanathapuram acquitted on 16 November 1965 holding prosecution barred by limitation under Section 40(2).",
      "type": "procedural",
      "date": "1965-11-16",
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "Madras High Court maintained Sessions Judge's acquittal on 21 November 1968.",
      "type": "procedural",
      "date": "1968-11-21",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Prosecutions in both appeals for violations punishable under Sections 9(b) and 9(d) of Central Excises and Salt Act, 1944 and Sections 420/511/109 IPC.",
      "type": "background",
      "date": null,
      "source": "prosecution"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether Section 40(2) of the Central Excises and Salt Act, 1944 bars prosecution after six months for anything done or ordered to be done under the Act, including by private persons for violations of the Act and Rules.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether Section 40(2) applies only to Government servants, only to acts not in violation, or only to acts in good faith.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Section 40(2) applies only to Government servants.",
      "supporting_facts": [],
      "legal_basis": "Interpretation of Section 40(1) and (2)"
    },
    {
      "id": "pa2",
      "text": "Words 'anything done or ordered to be done under this Act' do not mean any act in violation of the provisions of the Act.",
      "supporting_facts": [],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Protection under Section 40 is for actions done inadvertently or mistakenly but not for acts done deliberately and maliciously.",
      "supporting_facts": [],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Section 40(2) applies to prosecution of respondents for violation of provisions of Rules and Act; prosecutions instituted after expiry of six months from date of alleged offences.",
      "supporting_facts": [
        "f1",
        "f2",
        "f4",
        "f5"
      ],
      "legal_basis": "Section 40(2) of Central Excises and Salt Act, 1944"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Section 40(2) has no words restricting to Government servants unlike Section 40(1); wide amplitude applies to any person; contrasted with other statutes that explicitly limit to Government/officers.",
      "addresses_issue": "i1",
      "key_observation": "Sub-section (2) applicable to any individual or person without qualification."
    },
    {
      "id": "cr2",
      "text": "'Anything done or ordered to be done under the Act' includes violations, illegal omissions, non-compliance with Rules (e.g., improper banderols, accounts); good faith not required in sub-section (2).",
      "addresses_issue": "i1",
      "key_observation": "Definition of 'act' in General Clauses Act includes illegal omissions; evasion via cut/torn banderols and improper records is infraction under the Act."
    },
    {
      "id": "cr3",
      "text": "Precedents confirm protection applies to non-compliance under the Act by any person, including filing false returns or absent from duty.",
      "addresses_issue": "i2",
      "key_observation": "Filing returns, maintaining accounts done under the Act."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Section 40(2) bars suits, prosecutions or proceedings after six months for anything done or ordered under the Act, applicable to any person including private licensees for violations/omissions.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Pritam Singh v. State of Haryana",
      "citation": "1971 1 SCC 653",
      "treatment": "followed",
      "relevance": "Prosecution for non-compliance with duty under Police Act barred by limitation under similar provision."
    },
    {
      "case_name": "Maulud Ahmad v. State of Uttar Pradesh",
      "citation": "1963 Supp. 2 SCR 38",
      "treatment": "followed",
      "relevance": "Prosecution for false entries/non-maintenance of diary under Police Act barred."
    },
    {
      "case_name": "Sitaram v. State of Madhya Pradesh",
      "citation": "1962 Supp. 3 SCR 21",
      "treatment": "followed",
      "relevance": "'Any person' in sales tax limitation not restricted to govt servants; filing false returns under Act covered."
    },
    {
      "case_name": "Amalgamated Electricity Co. v. Municipal Committee, Ajmer",
      "treatment": "referred",
      "relevance": "Omission of statutory duty with positive content (illegality) covered."
    }
  ],
  "statutes_cited": [
    {
      "name": "Central Excises and Salt Act, 1944",
      "sections": [
        "40(2)",
        "9(b)",
        "9(d)",
        "37"
      ],
      "relevance": "Bar of limitation on prosecutions; offences for evasion, false info, contravention of provisions/Rules."
    },
    {
      "name": "Central Excise Rules",
      "sections": [
        "9",
        "53",
        "64",
        "67",
        "68",
        "70",
        "71",
        "66",
        "226"
      ],
      "relevance": "Requirements for payment, stock accounts, banderols, maintenance; violations by respondents."
    },
    {
      "name": "Indian Penal Code",
      "sections": [
        "420",
        "511",
        "109"
      ],
      "relevance": "Cheating attempt, abetment."
    },
    {
      "name": "General Clauses Act, 1897",
      "sections": [
        "definition of 'act'"
      ],
      "relevance": "Includes series of acts, illegal omissions."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court dismissed the State's appeals by special leave against Madras High Court judgment dated 21 November 1968, upholding acquittals by lower courts on ground that prosecutions were barred by six-month limitation under Section 40(2) of Central Excises and Salt Act, 1944.",
    "relief_granted": "Acquittals upheld",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "No suit, prosecution or other legal proceedings shall be instituted for anything done or ordered to be done under the Act after the expiration of six months from the accrual of the cause of action or from the date of the act or order complained of.",
      "speaker": "court",
      "significance": "Text of Section 40(2) central to interpretation."
    },
    {
      "text": "Sub-section (2) does not have any words of restriction or limitation of class of persons unlike sub-section (1). Sub-section (2) is applicable to any individual or person.",
      "speaker": "court",
      "significance": "Rejects contention limited to govt servants."
    },
    {
      "text": "The words 'anything done or ordered to be done under the Act' in section 40(2) extend to illegal omissions and infraction of the requirements of the statute.",
      "speaker": "court",
      "significance": "Covers violations by respondents."
    }
  ],
  "_case_id": "1972_308",
  "_label": 0,
  "_text_length": 21692,
  "_extracted_at": "2026-02-10T20:09:06.217611"
}