{
  "metadata": {
    "case_name": "Millers (Appellants) v. State of Andhra Pradesh (Respondent)",
    "case_year": 1972,
    "court": "Supreme Court of India",
    "judges": [
      "Beg, J."
    ],
    "case_number": "C.A. Nos. 323-332, 1312, 1174 of 1969; C.A. No. 1518 of 1970 and others",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Each of the appellants is a miller who applied to the Andhra Pradesh High Court under Article 226 for a writ of prohibition against sales tax assessment proceedings based on allegedly void Item 6 of Schedule III of the Andhra Pradesh General Sales Tax Act, 1957.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Appellants are registered dealers under the AP GST Act and Central Sales Tax Act, 1956; some sell groundnuts; groundnuts purchased specifically for crushing into oil or other products or for sale.",
      "type": "background",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "Item 6 of Schedule III levies tax on groundnuts at 3 naya paise in the rupee: when purchased by a miller other than decorticating miller at point of purchase by such miller; in other cases at point of purchase by last dealer.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Groundnuts declared goods of special importance in inter-state trade under Section 14 of Central Sales Tax Act.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "AP High Court granted some relief on rate of tax issue due to turnover definition potentially exceeding sale price limit under Section 15(a) CST Act.",
      "type": "procedural",
      "date": "1968-09-27",
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "None of the assessees is a decorticating miller; purchases of groundnuts by millers become taxable at point of purchase.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "In some cases, part of groundnuts purchased by assessees sold to other millers.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Is any part of the provision of Item 6 of Schedule III of the Andhra Pradesh General Sales Tax Act, 6 of 1957 relating to the point of levy void for contravening Section 15(a) of the Central Sales Tax Act, 1956?",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Groundnuts purchased by appellants (millers) taxed at point of purchase by them and also again in hands of last dealers to whom they sell, violating single stage levy under Section 15(a) CST Act.",
      "supporting_facts": [
        "f2",
        "f3"
      ],
      "legal_basis": "Section 15(a) Central Sales Tax Act, 1956"
    },
    {
      "id": "pa2",
      "text": "Only one point of taxation can be provided for declared goods by State law.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": "Section 15(a) Central Sales Tax Act, 1956"
    },
    {
      "id": "pa3",
      "text": "In cases where part of groundnuts sold to other millers, tax only on part crushed for oil; remaining part taxed on last dealer purchase.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Appellants taxed only at point of purchase as millers, not as last dealers; as millers they purchase to convert groundnuts into other products, making them last purchasers of groundnuts as such.",
      "addresses_issue": "i1",
      "key_observation": "No double taxation or taxation at more than one point; miller and last dealer on equal footing."
    },
    {
      "id": "cr2",
      "text": "Liability to pay purchase tax falls only at one point; charge effective as soon as purchase made by miller, computation later.",
      "addresses_issue": "i1",
      "key_observation": "Event attracting tax is purchase by miller, subsequent dealings irrelevant."
    },
    {
      "id": "cr3",
      "text": "Issue covered by prior decision in Sri Venkateswara Rice etc. v. State of A.P.; purchases taxable immediately upon miller purchase; no exclusion for groundnuts sold to other millers.",
      "addresses_issue": "i1",
      "key_observation": "Tax liability on purchase act, not on crushing or other dealings."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "No part of Item 6 Schedule III AP GST Act void for contravening Section 15(a) CST Act; levy at point of purchase by miller (non-decorticating) valid as single point taxation on declared goods.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Sri Venkateswara Rice, Ginning Groundnut Oil Mill Contractors Co. etc. v. State of A.P. Ors.",
      "citation": "A.I.R. 1972 S.C. 51",
      "treatment": "followed",
      "relevance": "Holds that miller purchases of groundnuts taxable at point of purchase; charge arises immediately; subsequent sales irrelevant; no exclusion for sales to other millers."
    }
  ],
  "statutes_cited": [
    {
      "name": "Andhra Pradesh General Sales Tax Act, 1957",
      "sections": [
        "Item 6 of Schedule III",
        "Section 5"
      ],
      "relevance": "Levy of tax on groundnuts at point of purchase by miller other than decorticating miller or by last dealer."
    },
    {
      "name": "Central Sales Tax Act, 1956",
      "sections": [
        "Section 14",
        "Section 15(a)"
      ],
      "relevance": "Restrictions on State tax on declared goods (groundnuts): not exceed 3% and not levied at more than one stage."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 226"
      ],
      "relevance": "Basis for writ petitions in High Court seeking prohibition."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeals by certificate from Andhra Pradesh High Court judgments dismissed; Item 6 Schedule III AP GST Act held valid and not contravening Section 15(a) CST Act; no double taxation as millers taxed only once at purchase point as last purchasers of groundnuts.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "Is any part of the provision of Item 6 of Schedule III of the Andhra Pradesh General Sales Tax Act... void for contravening Section 15(a) of the Central Sales Tax Act, 1956?",
      "speaker": "court",
      "significance": "Formulates the sole legal question argued."
    },
    {
      "text": "The short answer to this argument would be that the validity of the levy of a tax upon a purchase by a last dealer would be questioned by one of the appellants only if he was being taxed as a last dealer and not as a miller.",
      "speaker": "court",
      "significance": "Rejects double taxation claim."
    },
    {
      "text": "The event which attracted tax is the act of the miller purchasing groundnut and not his act of crushing the groundnut purchased or dealing with that groundnut in any other manner.",
      "speaker": "court",
      "significance": "Clarifies taxable event under the Act."
    }
  ],
  "_case_id": "1972_283",
  "_label": 0,
  "_text_length": 9594,
  "_extracted_at": "2026-02-10T20:09:03.807525"
}