{
  "metadata": {
    "case_name": "Hindustan Steel Ltd. v. Heirs of Vyomkesh Mukherjee & Ors.",
    "case_year": 1971,
    "court": "Supreme Court of India",
    "judges": [
      "Mukherjea, J."
    ],
    "case_number": "Civil Appeal No. 1787 of 1971",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "By a registered document dated 11 July 1919, Kumar Amardeyal Singh, proprietor of Ladi Estate, granted a perpetual Mokarari Settlement lease in favour of Pran Kristo Chatterjee for various minerals including iron ore over 2227 acres in village Adar and 1303 acres in village Gore, District Palamau.",
      "type": "background",
      "date": "1919-07-11",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "In 1937, heirs of original lessee Pran Kristo Chatterjee assigned and transferred their interest under the 1919 lease to Vyomkesh Mukherjee.",
      "type": "background",
      "date": "1937",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Vyomkesh Mukherjee died in 1949, leaving behind respondents Nos. 1 to 3 (petitioners in High Court) as his heirs and successors.",
      "type": "background",
      "date": "1949",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On 21 September 1951, petitioners granted a sub-lease under the 1919 lease to Madan Gopal Rungta.",
      "type": "background",
      "date": "1951-09-21",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Madan Gopal Rungta was obstructed in working the mines by Deputy Commissioner of Palamau in December 1952.",
      "type": "procedural",
      "date": "1952-12",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "On 16 April 1953, Madan Gopal Rungta agreed to pay royalty to Government of Bihar for working mining rights under the sub-lease.",
      "type": "procedural",
      "date": "1953-04-16",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "In January 1955, whole of Ladi Estate vested in State of Bihar under Bihar Land Reforms Act, 1950.",
      "type": "material",
      "date": "1955-01",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "In 1959, Controller of Mining Leases initiated case for modification of terms of 1919 lease.",
      "type": "procedural",
      "date": "1959",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "On 28 September 1959, Controller modified 1919 lease, making it terminable from 20 September 1961, after hearing petitioners and Madan Gopal Rungta.",
      "type": "procedural",
      "date": "1959-09-28",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "On 10 September 1962, Madan Gopal Rungta and Tribeni Prasad Rungta applied for mining lease; other parties applied earlier.",
      "type": "procedural",
      "date": "1962-09-10",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "On 13 November 1962, notice issued to Tribeni Prasad Rungta under Sec. 7 Bihar and Orissa Public Demands Recovery Act for Rs. 66,317.93 dead rent and royalties.",
      "type": "procedural",
      "date": "1962-11-13",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "On 1 April 1963, Ms. Hindustan Steel Limited applied for mining lease over 67.26 acres.",
      "type": "procedural",
      "date": "1963-04-01",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "In 1963, Tribeni Prasad Rungta filed writ under Art. 226 challenging certificate proceedings; High Court quashed on 23 November 1964.",
      "type": "procedural",
      "date": "1964-11-23",
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "On 22 July 1965, Government of Bihar granted mining lease to appellant Hindustan Steel Limited.",
      "type": "material",
      "date": "1965-07-22",
      "source": "court"
    },
    {
      "id": "f15",
      "text": "Lease to Bharat Marble Company granted sometime in 1966.",
      "type": "material",
      "date": "1966",
      "source": "court"
    },
    {
      "id": "f16",
      "text": "On 2 September 1968, S.K. Jain on behalf of petitioners filed writ petition in Patna High Court to quash leases to appellant and Bharat Marble Company.",
      "type": "procedural",
      "date": "1968-09-02",
      "source": "petitioner"
    },
    {
      "id": "f17",
      "text": "In April 1970, one of the petitioners died.",
      "type": "procedural",
      "date": "1970-04",
      "source": "court"
    },
    {
      "id": "f18",
      "text": "On 17 September 1971, Patna High Court quashed the two leases in favour of petitioners.",
      "type": "material",
      "date": "1971-09-17",
      "source": "lower_court"
    },
    {
      "id": "f19",
      "text": "Appellant admitted in possession since grant of lease on 22 July 1965, commenced operations, invested Rs. 1,50,000; petitioners admitted prospecting operations.",
      "type": "admitted",
      "date": "1965-07-22",
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Could Kumar Amardeyal Singh, the proprietor of Ladi Estate, grant a mining lease?",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "What was the effect of the Bihar Land Reforms Act, 1950 upon the right and title, if any, of the petitioners?",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Assuming petitioners became lessees under State of Bihar by reason of Bihar Land Reforms Act, could the Controller of Mining Leases terminate their lease?",
      "framed_by": "court"
    },
    {
      "id": "i4",
      "text": "What is the effect of the possession enjoyed by the appellant since grant of mining lease on 22 July 1965?",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Petitioners trace title to 1919 lease by Kumar Amardeyal Singh; predecessor exercised rights until 1949; remained in possession post-BLRA vesting; became lessees of State on same terms; Controller's order illegal and void; State acted illegally granting new leases.",
      "supporting_facts": [
        "f1",
        "f2",
        "f3",
        "f7"
      ],
      "legal_basis": "Bihar Land Reforms Act, 1950 Sec. 10"
    },
    {
      "id": "pa2",
      "text": "Kumar Amardeyal Singh was proprietor per Register D extracts and Government letter of Nov 1967 recognizing ex-proprietor's leases; proprietors have sub-soil mineral rights.",
      "supporting_facts": [
        "f1"
      ],
      "legal_basis": "Lodna Colliery Co. v. Bhola Nath Roy"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Original 1919 lease did not give mining rights to Kumar Amardeyal Singh; even if valid, terminated by Controller; State free to grant new leases; appellant in possession since 1965, serious title dispute bars writ relief.",
      "supporting_facts": [
        "f9",
        "f14",
        "f19"
      ],
      "legal_basis": "Bihar Land Reforms Act, 1950; Mining Lease Modification Rules, 1956 Rule 6"
    },
    {
      "id": "ra2",
      "text": "Register D entries not conclusive of title; mutation proceedings fiscal only.",
      "supporting_facts": [
        "f1"
      ],
      "legal_basis": "Land Registration Act, 1876 Sec. 4; Nirman Singh v. Lal Rudra Partab Narain; Sri Marudeswarar Temple v. Dhanalakshmi Ammal"
    },
    {
      "id": "ra3",
      "text": "Government letter post-dates lease grant, no estoppel against lessee.",
      "supporting_facts": [
        "f14"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Assuming valid 1919 lease subsisting pre-vesting, Sec. 10 BLRA deemed it lease from State for remainder term; petitioners entitled to possession; BLRA did not end title.",
      "addresses_issue": "i2",
      "key_observation": "Petitioners became lessees directly under Government on same terms."
    },
    {
      "id": "cr2",
      "text": "Controller's 1959 order invalid; Sec. 10 creates new statutory lease; confirmed in Bihar Mines Ltd. v. Union of India.",
      "addresses_issue": "i3",
      "key_observation": "Order of no legal effect."
    },
    {
      "id": "cr3",
      "text": "Kumar's competence to grant lease not conclusively proved; Register D prima facie but not conclusive evidence of proprietorship; Government letter recognition not binding on appellant post-lease.",
      "addresses_issue": "i1",
      "key_observation": "Petitioners showed only prima facie title."
    },
    {
      "id": "cr4",
      "text": "Appellant in admitted possession since 1965, conducting operations; serious title dispute; writ inappropriate to disturb possession without title suit.",
      "addresses_issue": "i4",
      "key_observation": "Distinguishable from Mohd. Hanif; follow Sohan Lal v. Union of India."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "BLRA Sec. 10 substitutes State as lessor, does not terminate subsisting mining lease.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Controller cannot terminate lease under Sec. 10 BLRA via modification rules.",
      "resolves_issue": "i3",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h3",
      "text": "Prima facie title insufficient in face of possession and title dispute; writ cannot displace possession.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h4",
      "text": "High Court erred in quashing leases via writ due to disputed title and appellant's possession.",
      "resolves_issue": "i4",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Bihar Mines Ltd. v. Union of India",
      "citation": "AIR 1967 S.C. 887",
      "treatment": "followed",
      "relevance": "Sec. 10 BLRA creates new statutory lease; Controller order invalid."
    },
    {
      "case_name": "Lodna Colliery Co. (1920) Ltd. v. Bhola Nath Roy",
      "citation": "AIR 1964 S.C. 918",
      "treatment": "referred",
      "relevance": "Zemindars/proprietors have rights over sub-soil minerals."
    },
    {
      "case_name": "Nirman Singh v. Lal Rudra Partab Narain",
      "citation": "53 I.A. 220",
      "treatment": "followed",
      "relevance": "Mutation proceedings not conclusive of title."
    },
    {
      "case_name": "Sri Marudeswarar Temple v. Dhanalakshmi Ammal",
      "citation": null,
      "treatment": "followed",
      "relevance": "Revenue entries not conclusive of title."
    },
    {
      "case_name": "Sohan Lal v. Union of India",
      "citation": "1957 S.C.R. 738",
      "treatment": "followed",
      "relevance": "Writ inappropriate for title disputes."
    },
    {
      "case_name": "Mohd. Hanif v. State of Assam",
      "citation": "1969 2 S.C.C. 782",
      "treatment": "distinguished",
      "relevance": "Writ for executive interference with possession, not applicable here."
    }
  ],
  "statutes_cited": [
    {
      "name": "Bihar Land Reforms Act, 1950",
      "sections": [
        "Section 10"
      ],
      "relevance": "Subsisting mining leases deemed granted by State; new statutory lease."
    },
    {
      "name": "Mining Lease Modification of Terms Rules, 1956",
      "sections": [
        "Rule 6"
      ],
      "relevance": "Controller purported to modify/terminate lease; held invalid post-BLRA."
    },
    {
      "name": "Mineral Concession Rules, 1960",
      "sections": [
        "Rule 58"
      ],
      "relevance": "Area notified for fresh grant."
    },
    {
      "name": "Bihar and Orissa Public Demands Recovery Act",
      "sections": [
        "Section 7"
      ],
      "relevance": "Notice for dead rent/royalties; quashed by HC."
    },
    {
      "name": "Land Registration Act, 1876",
      "sections": [
        "Section 4",
        "Section 78"
      ],
      "relevance": "Register D not conclusive of title."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; judgment and order dated 17 September 1971 of Patna High Court set aside; parties to bear own costs. Not a determination of title.",
    "relief_granted": "Leases to appellant not quashed; no restoration to petitioners.",
    "costs": "Parties bear their own respective costs."
  },
  "key_quotes": [
    {
      "text": "\"Subsisting leases of mines and minerals.- Notwithstanding anything contained in this Act, where immediately before the date of vesting... be deemed to have been leased by the State Government to the holder...\"",
      "speaker": "court",
      "significance": "Quotes Sec. 10 BLRA verbatim, core to issues 2 and 3."
    },
    {
      "text": "\"We are, therefore, of opinion that the right of property of the persons... extends to the sub-soil minerals of the land held by them.\"",
      "speaker": "court",
      "significance": "From Lodna Colliery, supports proprietor mineral rights."
    },
    {
      "text": "\"mutation proceedings are in the nature of fiscal enquiries... revenue authorities have no jurisdiction to pronounce upon the validity of claims of title.\"",
      "speaker": "court",
      "significance": "Explains why Register D not conclusive."
    },
    {
      "text": "\"the proper remedy... is by way of a title suit in a civil court.\"",
      "speaker": "court",
      "significance": "From Sohan Lal, justifies denying writ relief."
    }
  ],
  "_case_id": "1972_499",
  "_label": 1,
  "_text_length": 31197,
  "_extracted_at": "2026-02-10T20:10:20.847366"
}