{
  "metadata": {
    "case_name": "Appellants v. Respondent",
    "case_year": 1971,
    "court": "Supreme Court of India",
    "judges": [
      "Mitter, J."
    ],
    "case_number": "Civil Appeal No. 1706 of 1971",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The respondent is a temporary Government servant.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Services of the respondent terminated by order dated September 25, 1968 on the basis of directive contained in circular dated September 12, 1968 that action should be taken against every employee who absented himself from duty on September 19, 1968.",
      "type": "material",
      "date": "1968-09-25",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "No contention raised at any stage that action would be taken under Rule 5 of the Central Service (Temporary Service) Rules 1965.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "It is admitted that payment of the salary and allowances was not made to the respondent on September 25, 1968.",
      "type": "admitted",
      "date": "1968-09-25",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "According to the respondent, the disbursing officer was intimated about the order of termination only on September 28, 1968 when he was supplied with the necessary funds.",
      "type": "disputed",
      "date": "1968-09-28",
      "source": "respondent"
    },
    {
      "id": "f6",
      "text": "In the counter affidavit to the writ petition filed by the respondent in the High Court, it was alleged that one month's pay and allowances had been sent by money order to the respondent.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "The order of termination was quashed by a learned single Judge of the Kerala High Court and this was upheld by a Division Bench in Civil Writ Appeal No. 534 of 1969 by judgment and order dated January 5, 1971.",
      "type": "procedural",
      "date": "1971-01-05",
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the order dated September 25, 1968 terminating the services of the respondent, a temporary Government servant, was in accordance with the provisions of Rule 5 of the Central Service (Temporary Service) Rules 1965.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "It would be almost impossible for the authorities to give effect to the proviso if payment has to be made at the time the order of termination is served; sanction has to be taken, time elapses for procedure, money from treasury or cheque.",
      "supporting_facts": [],
      "legal_basis": "Practical considerations"
    },
    {
      "id": "pa2",
      "text": "Appointing authority could never ask employee to go at once if High Court's construction maintained; normally follows complaint, enquiry; within time for deliberation, pay can be calculated and offered.",
      "supporting_facts": [],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Cited State of Uttar Pradesh v. Dinanath Rai where rule differently worded and payment not required simultaneously.",
      "supporting_facts": [],
      "legal_basis": "State of Uttar Pradesh v. Dinanath Rai, Civil Appeal No. 1734 of 1968"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Disbursing officer intimated only on 28th September; payment not made on 25th September.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": "Rule 5"
    },
    {
      "id": "ra2",
      "text": "Construction of rule should mitigate rigour of termination; with notice employee can arrange, but immediate termination depends on mercy of Government for payment.",
      "supporting_facts": [],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The rule is capable of the only interpretation that the order of termination can be upheld if the requisite amount in terms of the rule was paid into the hands of the employee or made available to him at the same time as he was served with the order.",
      "addresses_issue": "i1",
      "key_observation": "Termination of service has to be simultaneous with the payment to the employee of whatever is due to him."
    },
    {
      "id": "cr2",
      "text": "Proviso gives Government option to terminate forthwith by payment; operative words: 'may be terminated forthwith by payment'. Payment is a condition of the termination forthwith.",
      "addresses_issue": "i1",
      "key_observation": "Rule does not lend itself to interpretation that termination effective as soon as order served irrespective of when payment made."
    },
    {
      "id": "cr3",
      "text": "Practical difficulties addressed: normally follows enquiry, time to calculate pay at same rates; no difficulty in calculation.",
      "addresses_issue": "i1",
      "key_observation": "Direction can be given during preliminary enquiry to calculate pay for offer at time of serving order."
    },
    {
      "id": "cr4",
      "text": "Distinguished State of Uttar Pradesh v. Dinanath Rai: rule there differently worded, no condition as to when payment to be given; here payment condition of termination forthwith.",
      "addresses_issue": "i1",
      "key_observation": "Essential difference in wording."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Termination of temporary service under Rule 5(1)(b) proviso requires payment simultaneous with service of termination order.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "State of Uttar Pradesh v. Dinanath Rai",
      "citation": "Civil Appeal No. 1734 of 1968 dated 11th October, 1968",
      "treatment": "distinguished",
      "relevance": "Rule differently worded; no requirement for simultaneous payment; pay substituted for notice without timing condition."
    }
  ],
  "statutes_cited": [
    {
      "name": "Central Service (Temporary Service) Rules 1965",
      "sections": [
        "Rule 5"
      ],
      "relevance": "Governs termination of temporary government servants; requires one month's notice or forthwith termination by payment equivalent to notice period simultaneously."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 309"
      ],
      "relevance": "Powers conferred for making rules on services, referenced in the UP rule cited."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal by special leave against the Kerala High Court order upholding quashing of the termination order dated September 25, 1968 is dismissed, as termination not in accordance with Rule 5 due to absence of simultaneous payment.",
    "relief_granted": "Termination order quashed (upheld from High Court)",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "To put the matter in a nutshell, to be effective the termination of service has to be simultaneous with the payment to the employee of whatever is due to him.",
      "speaker": "court",
      "significance": "Core holding on interpretation of Rule 5 proviso."
    },
    {
      "text": "The operative words of the proviso are 'the services of any such Government servant may be terminated forthwith by payment'.",
      "speaker": "court",
      "significance": "Emphasizes payment as condition precedent for forthwith termination."
    },
    {
      "text": "Payment is a condition of the termination of service forthwith.",
      "speaker": "court",
      "significance": "Distinguishes from cases without timing requirement."
    }
  ],
  "_case_id": "1972_525",
  "_label": 0,
  "_text_length": 10010,
  "_extracted_at": "2026-02-10T20:10:16.544865"
}