{
  "metadata": {
    "case_name": "Appellant (Chartered Accountant) v. First Respondent (Holding Company/Madras Company)",
    "case_year": 1968,
    "court": "Supreme Court of India",
    "judges": [
      "Jaganmohan Reddy, J."
    ],
    "case_number": "Civil Appeals Nos. 1421 and 1422 of 1968",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "First respondent (holding company/Madras company), a joint stock company and commercial establishment, promoted subsidiary company (Gordon Woodroffe Leather Manufacturing Company/Pallavaram company), holding 80 preference shares and 70 equity shares; was managing agent until 1959 but continued control via shareholding.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Appellant, a Chartered Accountant qualified in London, applied for and was offered employment as Assistant in holding company by letter dated 19-10-1963, which he accepted.",
      "type": "material",
      "date": "1963-10-19",
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "Appointment terms: basic salary, dearness allowance at 35% or as Board decides, Provident Fund contributions by both parties, annual bonus as for other Assistants, work in Madras office (9.15 a.m. to 5.30 p.m.) or Pallavaram (8 a.m. to 4.30 p.m.) or any other office/place of business of the company, termination by one month's notice or pay in lieu.",
      "type": "material",
      "date": "1963-10-19",
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "After appointment, appellant given training for two months in Madras company, then Director asked him to work in Pallavaram company.",
      "type": "material",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "Salary paid by Madras company, debited to Pallavaram company by arrangement; bonus for year ending 1964 paid by Madras company.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "On 28-10-1965, holding company offered revision of terms effective 1-7-1965 (basic salary, allowances, bonus), other terms unaltered; appellant confirmed acceptance; thereafter permitted to cross efficiency bar.",
      "type": "material",
      "date": "1965-10-28",
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "Appellant continued to work in Pallavaram company till 15-10-1966, when services terminated by holding company.",
      "type": "material",
      "date": "1966-10-15",
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "Appellant filed appeal before Additional Commissioner for Workmen's Compensation under section 41(2) of the Act.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "Respondent objected that appellant not a person employed within meaning of Act; appellant filed application under section 51 for declaration that he is a person employed; s.41(2) stayed.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f10",
      "text": "Issue before authorities: whether appellant employee of holding company or subsidiary company.",
      "type": "disputed",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Commissioner of Labour by order dated 9-1-1968 held appellant not person employed under s.2(12)(iii) or (ii) vis-a-vis either company, dismissed s.51 application.",
      "type": "procedural",
      "date": "1968-01-09",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Additional Commissioner for Workmen's Compensation dismissed s.41(2) appeal holding no jurisdiction in view of s.51 findings, order dated 18-1-1968.",
      "type": "procedural",
      "date": "1968-01-18",
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Appellant filed Special Leave Petitions against both orders, consolidated into these appeals.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Pallavaram company is a factory; appellant not member of clerical staff there.",
      "type": "admitted",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f15",
      "text": "Income-tax deductions made by Madras company, certificate to tax authority; certified salary to Madras Housing Board on 8-1-1966.",
      "type": "material",
      "date": "1966-01-08",
      "source": "petitioner"
    },
    {
      "id": "f16",
      "text": "Leave applications made to Managing Director of Madras company.",
      "type": "material",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f17",
      "text": "Appellant signed bills for Tullies Woodroffe factory (another subsidiary) and bills of sale for administrative convenience.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f18",
      "text": "Termination letter dated 15-10-1966 from Director of Madras company referring to appointment letter of 19-10-1963, giving one month's notice.",
      "type": "material",
      "date": "1966-10-15",
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether on the facts and circumstances of the case and on a true construction of clause (iii) sub-section (12) of section 2, the appellant being wholly and principally employed in connection with the business of the Madras establishment was a person employed.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether the jurisdiction of the authority under section 41 sub-section (2) is circumscribed by the provisions of section 51.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Under terms of offer of appointment accepted by him, required to work either in Madras office or Pallavaram office or any other office or place of business of the company; working in Pallavaram but salary, bonus paid by holding company; services terminated by holding company.",
      "supporting_facts": [
        "f2",
        "f3",
        "f5",
        "f7",
        "f15",
        "f18"
      ],
      "legal_basis": "Section 2(12)(iii) Madras Shops and Establishments Act, 1947"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Though appointed/dismissed by Madras company, actually employed in Pallavaram company (factory); salary paid by Madras but recovered from Pallavaram; relevant is employment in, not by; not person employed under s.2(12)(iii) as wholly/principally employed in connection with business of Pallavaram factory.",
      "supporting_facts": [
        "f4",
        "f5",
        "f7",
        "f14"
      ],
      "legal_basis": "Section 2(12)(iii) Madras Shops and Establishments Act, 1947"
    },
    {
      "id": "ra2",
      "text": "Madras and Pallavaram are separate legal entities; test is where he works, not who employs; possible to employ for work in another establishment.",
      "supporting_facts": [
        "f1"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Second issue academic; must determine if appellant is 'person employed' under s.2(12)(iii); Pallavaram is factory, appellant not clerical staff, so not under (ii); Madras is commercial establishment (joint stock company etc.); key is whether wholly or principally employed in connection with business of the (commercial) establishment.",
      "addresses_issue": "i1",
      "key_observation": "Focus not just 'employed in' or 'by', but 'wholly or principally employed in connection with the business of the establishment'."
    },
    {
      "id": "cr2",
      "text": "Cited precedents do not decide issue of 'person employed' under s.2(12)(iii); in T. Prem Sagar, test is whether wholly or principally employed in connection with business of establishment.",
      "addresses_issue": "i1",
      "key_observation": "Employer is Madras company: appointed them, terms specify their PF, bonus, termination by them, work wherever they direct including Pallavaram as part of their business."
    },
    {
      "id": "cr3",
      "text": "All facts (salary, bonus, PF, leave, tax, certification, signing bills for subsidiaries, termination) show employed by Madras for their business; mere work at Pallavaram under directions does not make Pallavaram employer; would lead to incongruity allowing circumvention of Act.",
      "addresses_issue": "i1",
      "key_observation": "Appellant wholly/principally employed in connection with business of Madras commercial establishment."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Appellant is a person employed within meaning of section 2(12)(iii) by the Madras company.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Salem Sri Ramaswami Bank Ltd. v. The Additional Commissioner for Workmen's Compensation, Chepauk, Madras and another",
      "citation": null,
      "treatment": "distinguished",
      "relevance": "Dealt with position of management under s.4(1)(a), not 'person employed' under s.2(12)(iii); observations on 'employed' taken out of context."
    },
    {
      "case_name": "T. P. Chandra v. The Commissioner for Workmen's Compensation, Madras and another",
      "citation": "1957 A.I.R. Vol. 44 p.668",
      "treatment": "distinguished",
      "relevance": "Not contended that appellant not person employed under s.2(12)."
    },
    {
      "case_name": "T. Prem Sagar v. The Standard Vacuum Oil Company Madras and Others",
      "citation": "1964 5 S.C.R. 1030",
      "treatment": "followed",
      "relevance": "Test for s.2(12)(iii): wholly or principally employed in connection with business of establishment."
    }
  ],
  "statutes_cited": [
    {
      "name": "Madras Shops and Establishments Act, 1947",
      "sections": [
        "2(12)(ii)",
        "2(12)(iii)",
        "2(3)",
        "2(5)",
        "2(6)",
        "4(1)(a)",
        "41(1)",
        "41(2)",
        "51"
      ],
      "relevance": "Definition of 'person employed'; declaration of status under s.51 prerequisite for appeal under s.41(2); appellant qualifies under 2(12)(iii) as wholly/principally employed in connection with business of Madras commercial establishment."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeals allowed; appellant held to be person employed under s.2(12)(iii) by Madras company; orders of Commissioner of Labour and Additional Commissioner for Workmen's Compensation set aside; authority under s.41(2) to decide merits of termination.",
    "relief_granted": "Declaration that appellant is person employed; remit to Additional Commissioner for Workmen's Compensation to adjudicate appeal on merits under s.41(1).",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"The test which has to be applied in determining the question as to whether a person is employed in a commercial establishment is whether he is wholly or principally employed in connection with the business of the said establishment.\"",
      "speaker": "court",
      "significance": "Key test from T. Prem Sagar adopted by court."
    },
    {
      "text": "\"It is clear from this letter of appointment that he has to work wherever the company directs him to work as such he would be a person wholly or principally employed in connection with the business of the Madras company.\"",
      "speaker": "court",
      "significance": "Applies test to facts, holding in favor of appellant."
    },
    {
      "text": "\"We do not think that such a result was intended, nor is a conclusion so baneful deducible from the provisions of the Act.\"",
      "speaker": "court",
      "significance": "Rejects respondent's interpretation as allowing circumvention of Act."
    }
  ],
  "_case_id": "1972_228",
  "_label": 1,
  "_text_length": 24716,
  "_extracted_at": "2026-02-10T20:08:36.995100"
}