{
  "metadata": {
    "case_name": "Civil Appeal No. 1533 of 1971 and connected matters",
    "case_year": 1971,
    "court": "Supreme Court of India",
    "judges": [
      "Ray, J."
    ],
    "case_number": "Civil Appeal Nos. 1533, 1797 and 1798 of 1971; Special Leave Petition (Civil) Nos. 3254 and 3268 of 1971",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Co-operative Societies held annual general meetings under section 32 of the U.P. Co-operative Societies Act, 1965 and elected members of the Committee of Management.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Registrar of U.P. Co-operative Societies issued circular dated 5 November 1969 interpreting rule 409 of U.P. Co-operative Societies Rules, 1968, stating all members of general body exercise right of vote in filling all seats of elected Directors.",
      "type": "material",
      "date": "1969-11-05",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Shamli Cane Development Union Ltd., Shamli, U.P. registered under Co-operative Societies Act, 1912, deemed registered under 1965 Act; bye-laws provide Committee of Management of 14 members elected from 14 constituencies by delegates of each constituency; election dates: nominations 13 Oct 1970, scrutiny 17 Oct 1970, withdrawal 19 Oct 1970, poll 28 Oct 1970.",
      "type": "background",
      "date": "1970-10-13",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Registrar by letter dated 14 October 1970 directed election by all representatives of the area, not just related constituencies; each delegate to have as many votes as members to be elected (14 votes).",
      "type": "material",
      "date": "1970-10-14",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Election petition No. 140 of 1970 filed under rule 229(2) of Co-operative Societies Rules, 1967; S.D.O. Arbitrator, Muzaffarnagar by judgment dated 18 September 1971 set aside election of Management Committee of Co-operative Cane Development Union, Shamli.",
      "type": "procedural",
      "date": "1971-09-18",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "In Sahkari Ganna Vikas Samiti Ltd., Iqbalpur, District Saharanpur, Arbitrator under sections 70 and 71 set aside election; appeal under section 98(i)(h) dismissed by District Magistrate Registrar, Saharanpur on 18 September 1971.",
      "type": "procedural",
      "date": "1971-09-18",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "In Sahkari Ganna Vikas Samiti Ltd., Laksar, District Saharanpur, Arbitrator under sections 70 and 71 set aside election; appeal under section 98(i)(h) dismissed by District Magistrate, Saharanpur on 16 September 1971.",
      "type": "procedural",
      "date": "1971-09-16",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "In Sahkari Ganna Vikas Samiti, Sarsawa, Arbitrator under sections 70 and 71 set aside election; appeal under section 98(i)(h) dismissed by Registrar, Co-operative Societies, District Magistrate Saharanpur on 16 September 1971.",
      "type": "procedural",
      "date": "1971-09-16",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "District Authority, Bulandshahr set aside election of Committee of Management of Co-operative Cane Development Union Ltd. on application under rule 229 of U.P. Co-operative Societies Rules, 1968.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the Registrar had power to issue the circular interpreting rule 409",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether that interpretation of rule 409 is correct in terms of the Act and the Rules",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether right of vote for election of member of Committee of Management is confined to delegates of that particular constituency or extends to all constituencies",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Section 20 of the Act provides one vote in the affairs of the society; constitution of Committee of Management is principal affair, so each member entitled to cast as many votes as strength of Committee.",
      "supporting_facts": [
        "f1",
        "f2"
      ],
      "legal_basis": "Section 20 U.P. Co-operative Societies Act, 1965; Rule 105"
    },
    {
      "id": "pa2",
      "text": "Every member would have one vote for each member of Committee of Management.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": "Rule 105"
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Rule 409 does not confer power on Registrar to interpret or express views on voting rights; society may with previous sanction divide membership into groups and specify proportion for representation.",
      "addresses_issue": "i1",
      "key_observation": "Registrar has no power to interpret rule 409 or regulate voting rights by giving more than one vote."
    },
    {
      "id": "cr2",
      "text": "Under rule 409, division into constituencies on territorial or rational basis for suitable representation; voting by delegates of particular constituency only, to ensure representation from that group/area/interest.",
      "addresses_issue": "i2",
      "key_observation": "Circular allows voting outside constituencies, striking at root of representation and one member one vote principle."
    },
    {
      "id": "cr3",
      "text": "Section 20 provides one vote irrespective of shareholding; affairs of society include Committee election, but through constituency representative; multiple votes defeat purpose.",
      "addresses_issue": "i3",
      "key_observation": "One member one vote for his constituency; Rule 105 relates to meetings resolutions, not elections."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Registrar's circular dated 5 November 1969 is illegal and unwarranted; no power to interpret rule 409 or give members more than one vote.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "At election of Committee members, one member has only one vote for the constituency to which he belongs.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Elections held following the circular are bad.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "U.P. Co-operative Societies Act, 1965",
      "sections": [
        "20",
        "29",
        "32",
        "70",
        "71",
        "98(i)(h)"
      ],
      "relevance": "Governs voting rights (one member one vote), Committee of Management election at annual general meeting, election disputes and appeals; interpreted to limit votes to own constituency."
    },
    {
      "name": "U.P. Co-operative Societies Rules",
      "sections": [
        "229(2)",
        "409",
        "105"
      ],
      "relevance": "Rule 229 for election petitions; rule 409 for dividing membership into groups/constituencies for representation with Registrar sanction; rule 105 for meetings, not elections."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The three appeals by special leave and two special leave petitions dismissed; elections held following Registrar's circular declared bad.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "a member of a Co-operative Society shall notwithstanding the quantum of his interest in the capital of the Society have one vote in the affairs of the Society.",
      "speaker": "court",
      "significance": "Core principle of one member one vote under section 20."
    },
    {
      "text": "The impeached circular of the Registrar is illegal and unwarranted. Registrar has no power to interpret rule 409.",
      "speaker": "court",
      "significance": "Direct holding on Registrar's lack of authority."
    },
    {
      "text": "At an election of members of the committee of management one member will have only One vote for the constituency to which he belongs.",
      "speaker": "court",
      "significance": "Rules on correct voting procedure."
    }
  ],
  "_case_id": "1972_24",
  "_label": 0,
  "_text_length": 17233,
  "_extracted_at": "2026-02-10T20:07:18.740176"
}