{
  "metadata": {
    "case_name": "Appellant (Tenant) v. Respondent (Landlord)",
    "case_year": 1971,
    "court": "Supreme Court of India",
    "judges": [
      "Jaganmohan Reddy, J."
    ],
    "case_number": "C.A. No. 1052 of 1971",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Respondent was constructing a building and leased it out on a monthly tenancy to the appellant on 1st November 1959.",
      "type": "background",
      "date": "1959-11-01",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The building was ultimately completed in March 1960.",
      "type": "material",
      "date": "1960-03",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Respondent filed a suit for ejectment on 14-1-1963 and obtained a decree for ejectment on 14-8-1969.",
      "type": "procedural",
      "date": "1963-01-14",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Respondent filed an execution petition on 29-8-1969.",
      "type": "procedural",
      "date": "1969-08-29",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Executing court dismissed the execution petition on 16-4-1970 on the ground that conditions prescribed in the notification of the Government of Punjab under section 3 of the Punjab Urban Rent Restriction Act 1949 dated 30-7-1965, exempting such decrees from section 13 of the Act, were not complied with.",
      "type": "procedural",
      "date": "1970-04-16",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Appeal against the executing court's judgment was unsuccessful.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "On second appeal (Execution Second Appeal No. 1783 of 1970), the Punjab and Haryana High Court held that the decree was executable inasmuch as it was exempted under the notification, by judgment and order dated May 27, 1971.",
      "type": "procedural",
      "date": "1971-05-27",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "This appeal is by special leave against the High Court judgment.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the exemption from section 13 of the Punjab Urban Rent Restriction Act 1949 under the notification dated 30-7-1965 applies to a decree for ejectment passed after the 5-year period from completion of the building (March 1960), where the suit was filed within that period (14-1-1963), or whether the decree itself must be obtained within the 5-year period.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The decree having been passed on 14th August 1969 after the period of 5 years from the date of construction (March 1960), the exemption from the restrictions placed by section 13 is not available, because not only the suit should be filed but the decree for eviction should be obtained within the said period of 5 years.",
      "supporting_facts": [
        "f2",
        "f3"
      ],
      "legal_basis": "Notification dated 30-7-1965 under section 3 of the Punjab Urban Rent Restriction Act 1949"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The words 'were or are' used in clause (b) of the notification both in respect of the filing of the suits and the passing of the decrees indicate that suits must have been already filed or are to be instituted during the period of exemption, and decrees had been passed or are hereafter to be passed; thus, filing of suit within the 5-year period suffices for exemption of the decree from section 13.",
      "supporting_facts": [
        "f2",
        "f3"
      ],
      "legal_basis": "Notification dated 30-7-1965 under section 3 of the Punjab Urban Rent Restriction Act 1949"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The notification exempts decrees for ejectment from section 13 if the building was constructed during 1959-1963 and suits for ejectment were instituted during the 5-year period from completion; the filing of the suit within that period is the only condition necessary, and the decree may be passed thereafter, as what is exempted is the decree, not the suit.",
      "addresses_issue": "i1",
      "key_observation": "Accepting appellant's contention would nullify the purpose of the exemption, which is to induce construction by granting landlords ordinary rights for 5 years; specifying suit filing time would be unnecessary if decree also had to be within period."
    },
    {
      "id": "cr2",
      "text": "The notification clarifies and provides a workable solution for buildings constructed in 1959-1963, previously exempted by earlier notifications; clause (b) ensures suits filed during exemption period lead to executable decrees free from section 13 fetters.",
      "addresses_issue": "i1",
      "key_observation": "Language 'were or are' accounts for timing variations across construction years relative to notification date."
    },
    {
      "id": "cr3",
      "text": "Courts must ascertain the intendment of the legislature or delegate; the provision presumes design to effectuate object of encouraging construction via 5-year exemption from date of completion, with suits filed within that period.",
      "addresses_issue": "i1",
      "key_observation": "High Court's construction is the only possible one on the language."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Under the notification dated 30-7-1965, provisions of section 13 do not apply to decrees for ejectment in respect of buildings constructed during 1959-1963 where suits were instituted within 5 years from completion date, even if decree passed later.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Punjab Urban Rent Restriction Act 1949",
      "sections": [
        "Section 3",
        "Section 13"
      ],
      "relevance": "Section 13 restricts execution of eviction decrees except on specified grounds via Controller; section 3 empowers Government to exempt buildings; notification under s.3 exempts specified decrees from s.13."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court upheld the Punjab and Haryana High Court's judgment allowing execution of the ejectment decree, finding it exempted under the notification dated 30-7-1965 from section 13 of the Act, as the suit was filed within 5 years of building completion.",
    "relief_granted": "Execution of decree permitted",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "This contention on the very face of it would lead to incongruity or would, if accepted, have the effect of nullifying the very purpose for which the exemption was being given.",
      "speaker": "court",
      "significance": "Rejects appellant's narrow interpretation as defeating legislative intent."
    },
    {
      "text": "It is clear to our minds, as it was to the High Court that under clause (b) the filing-of the suit within the period of exemption is the- only- condition that is necessary to satisfy one of the requirements of the exemption.",
      "speaker": "court",
      "significance": "Core holding on exemption condition."
    },
    {
      "text": "In the view we have taken, the construction placed by the High Court is the only construction that is possible on the language of the notification.",
      "speaker": "court",
      "significance": "Affirms High Court and resolves ambiguity in favor of broader exemption."
    }
  ],
  "_case_id": "1972_116",
  "_label": 0,
  "_text_length": 15228,
  "_extracted_at": "2026-02-10T20:08:14.982702"
}