{
  "metadata": {
    "case_name": "Appellant (Owner of 32, Balrampur House) v. State of U.P.",
    "case_year": 1972,
    "court": "Supreme Court of India",
    "judges": [
      "DWIVEDI, J."
    ],
    "case_number": "Civil Appeal No. 80 of 1972",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The appellant is the owner of 32, Balrampur House, Mumfordganj, Allahabad.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "After residing therein for some time, he started living in 33 Pan Dariba, Allahabad with his mother.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "His own house he let out on September 9, 1964 to the State Government for a period of 5 years on a monthly rent of Rs. 300/-. The State Government obtained the lease for the purposes of residence or Office of the Directorate of Geology and Mining, U.P. The lease was signed by Shri P. N. Singh, Geologist, on behalf of the State Government.",
      "type": "material",
      "date": "1964-09-09",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "In 1967 the appellant had shifted from the house No. 33, Pan Dariba to house No. 39,8/5, Meerapur, Allahabad. In Meerapur he was living as a tenant.",
      "type": "background",
      "date": "1967",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The period of lease with respect to his own house expired on September 9, 1969.",
      "type": "material",
      "date": "1969-09-09",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The District Magistrate, Allahabad passed an order under S. 3 of the U.P. Temporary Accommodation Requisition Act, 1947 on October 4, 1969. By the order the District Magistrate requisitioned the house to provide accommodation to Shri P. N. Singh, Geologist, Directorate of Geology and Mining, U.P. The appellant was directed to hand over possession of the house within 24 hours after the expiry of 15 days from the date of the service of the order on him.",
      "type": "material",
      "date": "1969-10-04",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "The appellant filed a writ petition in the Allahabad High Court challenging the validity of the order. One of the grounds of challenge was that the order was made without issuing any notice to him and without giving him a hearing.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "The petition was dismissed summarily by a Division Bench of the High Court on January 23, 1970. The argument of want of notice and hearing was not accepted by the High Court.",
      "type": "procedural",
      "date": "1970-01-23",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Feeling aggrieved with the decision of the High Court, the appellant has filed this appeal by special leave.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "The requisitioning order was made by the District Magistrate without giving notice and hearing to the appellant.",
      "type": "disputed",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the requisitioning order is invalid for want of notice and hearing.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether S. 3 of the U.P. Temporary Accommodation Requisition Act, 1947 is ultra vires simply because it does not provide for a show cause notice to be served on the owner before the order of requisition can be passed.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The requisitioning order is invalid for want of notice and hearing.",
      "supporting_facts": [
        "f6",
        "f7",
        "f10"
      ],
      "legal_basis": "Principles of natural justice; A. K. Kraipak v. Union of India; Daud Ahmad v. District Magistrate, Allahabad; State of Punjab v. K. R. Erry"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "We should not entertain the argument as it was not raised before the High Court.",
      "supporting_facts": [],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "The District Magistrate acts in an administrative capacity under S. 3 and it is not necessary to hear the affected party in an administrative proceeding.",
      "supporting_facts": [],
      "legal_basis": "Province of Bombay v. Bhanji Munji; Collector of Akola v. Ramchandra; State of Bombay v. Bhanji Munji"
    },
    {
      "id": "ra3",
      "text": "Requisition deprives the owner of the property of the use thereof for a temporary period and for such requisition such a detailed procedure is not necessary.",
      "supporting_facts": [],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "We are satisfied on a reading of the judgment of the High Court that the point was raised by the appellant before the High Court.",
      "addresses_issue": "i1",
      "key_observation": "Point was raised in High Court."
    },
    {
      "id": "cr2",
      "text": "S. 3 does not contain an express provision for notice and hearing before the making of the requisitioning order. But it appears to us that such a provision is to be read therein by necessary implication.",
      "addresses_issue": "i1",
      "key_observation": "Notice and hearing implied by necessary implication due to deprivation of cherished right to hold and enjoy property."
    },
    {
      "id": "cr3",
      "text": "The District Magistrate may requisition an accommodation if he is of opinion that it is necessary to requisition it for any public purpose. He is accordingly to make up his mind on two matters: 1) there exists a public purpose to warrant the making of an order of requisition and 2) in view of that public purpose it is necessary to requisition a particular accommodation.",
      "addresses_issue": "i1",
      "key_observation": "Objective factors involved where owner should be heard."
    },
    {
      "id": "cr4",
      "text": "The first proviso to S. 3 provides that no building or part of a building exclusively used for religious worship shall be requisitioned. Whether a building is being exclusively used for religious worship is a question of fact which may be disputed, fairness demands hearing the owner.",
      "addresses_issue": "i1",
      "key_observation": "Provisos suggest implication of notice and hearing."
    },
    {
      "id": "cr5",
      "text": "The second proviso provides that no accommodation which is in the actual occupation of any person shall be requisitioned unless suitable alternative accommodation exists or has been provided. Whether accommodation is in actual occupation is a question of fact, cannot be determined without hearing.",
      "addresses_issue": "i1",
      "key_observation": "Second proviso supports inference of notice and hearing."
    },
    {
      "id": "cr6",
      "text": "The Act does not provide for any appeal or revision from the order of the District Magistrate under S. 3. The District Magistrate is constituted the plenary authority. It seems reasonable to think that the legislature intended that an order under S. 3 should be made after notice and hearing.",
      "addresses_issue": "i1",
      "key_observation": "No appeal/revision implies need for prior hearing."
    },
    {
      "id": "cr7",
      "text": "The barest minimum is a fair hearing. Notice should be given to the person who will be affected by the order of requisitioning asking him to show why his accommodation should not be requisitioned. He should be given reasonable time to file his reply. In some cases opportunity to produce evidence.",
      "addresses_issue": "i1",
      "key_observation": "Scheme and setting of S. 3 imply notice and hearing."
    },
    {
      "id": "cr8",
      "text": "Cases cited by respondent distinguished as issue of notice and hearing did not directly arise there.",
      "addresses_issue": "i1",
      "key_observation": "Administrative acts may require natural justice."
    },
    {
      "id": "cr9",
      "text": "In A. K. Kraipak, dividing line between administrative and quasi-judicial is thin; rules of natural justice apply to prevent miscarriage of justice even in administrative enquiries.",
      "addresses_issue": "i1",
      "key_observation": "Natural justice applies to administrative deprivation of property."
    },
    {
      "id": "cr10",
      "text": "Daud Ahmad is direct authority: order under S. 3 quashed for want of notice and hearing.",
      "addresses_issue": "i1",
      "key_observation": "Direct precedent supports quashing."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The order of requisition is not invalid, nor can S. 3 of the Act be said to be ultra vires simply because it does not provide for a show cause notice; however, notice and hearing is to be read by necessary implication.",
      "resolves_issue": "i1",
      "in_favor_of": "partial"
    },
    {
      "id": "h2",
      "text": "The requisitioning order made without notice and hearing is illegal.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Province of Bombay v. Bhanji Munji",
      "citation": "1955 1 S.C.R. 777",
      "treatment": "distinguished",
      "relevance": "Requisition administrative, not quasi-judicial; notice/hearing not directly considered."
    },
    {
      "case_name": "Collector of Akola v. Ramchandra",
      "citation": "1968 1 S.C.R. 401",
      "treatment": "distinguished",
      "relevance": "DM's opinion on public purpose final; notice/hearing not directly considered."
    },
    {
      "case_name": "State of Bombay v. Bhanji Munji",
      "citation": "1950 S.C.R. 621",
      "treatment": "distinguished",
      "relevance": "Requisition administrative; notice/hearing not directly considered."
    },
    {
      "case_name": "A. K. Kraipak v. Union of India",
      "citation": "1970 1 S.C.R. 457",
      "treatment": "followed",
      "relevance": "Natural justice applies to administrative acts to prevent miscarriage of justice."
    },
    {
      "case_name": "Daud Ahmad v. District Magistrate, Allahabad",
      "citation": "A.I.R. 1972 S.C. 896",
      "treatment": "followed",
      "relevance": "Direct authority: S.3 order quashed for no notice/hearing."
    },
    {
      "case_name": "State of Punjab v. K. R. Erry",
      "citation": "1973 2 S.C.R. 405",
      "treatment": "followed",
      "relevance": "Hearing required before depriving property rights like pension."
    }
  ],
  "statutes_cited": [
    {
      "name": "U.P. Temporary Accommodation Requisition Act, 1947",
      "sections": [
        "Section 3"
      ],
      "relevance": "Authorizes DM to requisition accommodation for public purpose; interpreted to imply notice and hearing by necessary implication; provisos support this."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "The appeal is allowed with costs. The requisition order is held illegal for want of notice and hearing to the appellant.",
    "relief_granted": "Quashing of requisition order implied by allowing appeal.",
    "costs": "Appeal allowed with costs."
  },
  "key_quotes": [
    {
      "text": "Requisitioning of the property deprives the owner of the property of the right to hold and enjoy the property as he likes. The right to hold and enjoy the property is a cherish right.",
      "speaker": "court",
      "significance": "Justifies implication of natural justice."
    },
    {
      "text": "The scheme and setting of s. 3 imply a notice and hearing to the person who will be affected by the proposed requisitioning order.",
      "speaker": "court",
      "significance": "Core holding on implied notice."
    },
    {
      "text": "The aim of the rules of natural justice is to secure justice or to put it negatively to prevent miscarriage of justice.",
      "speaker": "court",
      "significance": "From A.K. Kraipak, applied to administrative acts."
    }
  ],
  "_case_id": "1972_573",
  "_label": 1,
  "_text_length": 17261,
  "_extracted_at": "2026-02-10T20:11:03.609551"
}