{
  "metadata": {
    "case_name": "Jayaram Mudaliar v. Ayyaswami Mudaliar & Ors.",
    "case_year": 1970,
    "court": "Supreme Court of India",
    "judges": [
      "Sikri C.J.",
      "A. N. Ray J.",
      "M. H. Beg J."
    ],
    "case_number": "Civil Appeal No. 2152 of 1968",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Partition suit filed by plaintiff-respondent Ayyaswami Mudaliar via pauper application dated 23-6-1958 in Vellore, Madras, claiming B Schedule properties as joint family properties.",
      "type": "procedural",
      "date": "1958-06-23",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Jayaram Mudaliar (appellant, 12th defendant) purchased leasehold land for Rs. 10,500/- from Munisami Mudaliar and others under sale deed Ex. B-7 dated 7-7-1958, comprising items 5, 15 to 19, 24 and 28 of Schedule B.",
      "type": "material",
      "date": "1958-07-07",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Sale certificate Ex. B-51 dated 15-7-1960 issued to Jayaram Mudaliar for Rs. 6,550/- at public auction for pumpset arrears under hire purchase system due from Munisami Mudaliar under Land Improvement Loans Act, covering items 4, 18, 20, 23 to 27.",
      "type": "material",
      "date": "1960-07-15",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Munisami Mudaliar (1st defendant) and Jayaram denied that properties were joint family properties; claimed acquired by Munisami with own funds.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f5",
      "text": "Trial Court found B Schedule properties joint family properties with Munisami as karta; sales true and supported by consideration but hit by lis pendens; decreed partition into six shares, directing commissioner to allot sold properties to Munisami's share as far as possible.",
      "type": "admitted",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "First Appellate Court (District Judge) confirmed trial court's decree.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "High Court (Madras) in Second Appeal No. 1173 of 1964 on 19-7-1968 held Ex. B7 voluntary sale hit by lis pendens; Ex. B51 partially exempt for lands improved by loans; directed trial court to take evidence on which properties improved by loans.",
      "type": "procedural",
      "date": "1968-07-19",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Appellant did not seek Letters Patent certificate orally immediately after High Court judgment as per Rule 28 Order IV Madras High Court Rules; later application rejected on 6-9-1968.",
      "type": "procedural",
      "date": "1968-09-06",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Plaint amended on 18-9-1961 challenging sales as sham, not supported by consideration, hit by lis pendens.",
      "type": "procedural",
      "date": "1961-09-18",
      "source": "petitioner"
    },
    {
      "id": "f10",
      "text": "Pre-existing mortgages and decrees: Mortgage 17-1-1944 Rs.7500 to Kannayiram; second mortgage to Patta Mal assigned to T. Pillai; third mortgage 27-5-1952 to Jayaram; suits O.S. 124/1955 and O.S. 2/1956 leading to decrees.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Sale deed Ex. B7 consideration breakdown: Rs.7375.11 for decree O.S.2/56; Rs.538/- bond 14-10-1957; Rs.662/- another bond; Rs.1250 debt to Thiruvenkata Pillai; Rs.100+51 govt liabilities; Rs.521 cash.",
      "type": "material",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the voluntary sale under Ex. B7 dated 7-7-1958 and revenue sale under Ex. B51 dated 15-7-1960 of joint family properties during pendency of partition suit are hit by doctrine of lis pendens under Section 52 of Transfer of Property Act.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether Rule 28 Order IV Madras High Court Rules is ultra vires Letters Patent Cl.15 and whether appeal incompetent for not seeking certificate timely.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Sales were to discharge pre-existing liabilities of joint family of which Munisami was karta; properties liable to be sold for such debts; not hit by lis pendens as only remaining properties available for partition.",
      "supporting_facts": [
        "f2",
        "f3",
        "f10",
        "f11"
      ],
      "legal_basis": "Doctrine of lis pendens does not apply to involuntary sales in execution of prior mortgages; Sityam Lal v. Sohan Lal; Chinnaswami v. Darmalinga"
    },
    {
      "id": "pa2",
      "text": "Revenue sale under Land Improvement Loans Act has priority over other claims; loans for joint family improvements.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": "Land Improvement Loans Act S.7(1)(c); paramount claim of State like taxes; Builders Supply Corporation v. Union of India"
    },
    {
      "id": "pa3",
      "text": "Rule 28 Order IV Madras HC Rules ultra vires Letters Patent Cl.15 as cuts down limitation period.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": "Letters Patent Cl.15; Art.117 Limitation Act 1963"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Sales voluntary and fraudulent, not for legal necessity, not binding on joint family; hit by lis pendens.",
      "supporting_facts": [
        "f2",
        "f3",
        "f9"
      ],
      "legal_basis": "Section 52 TPA applies to voluntary sales; Ram Sanehi Lal v. Janki Prasad"
    },
    {
      "id": "ra2",
      "text": "Appeal incompetent as no timely oral application for Letters Patent certificate.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": "Rule 28 Order IV Madras HC Rules; Penu Balakrishna Iyer v. Ariya Ramaswami Iyer"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Rule 28 Order IV valid, regulates manner of exercising Letters Patent right; but special leave granted and matter advanced, so hear on merits.",
      "addresses_issue": "i2",
      "key_observation": "High Court can regulate time and manner; no inflexible rule to refuse SL if LP not exhausted; case advanced beyond interim stage."
    },
    {
      "id": "cr2",
      "text": "Doctrine of lis pendens from jurisdiction/control over subject matter; S.52 TPA prevents transfers/dealings affecting other parties' rights.",
      "addresses_issue": "i1",
      "key_observation": "Purpose not to defeat just claims but subject to court authority; courts directed allotment to Munisami's share safeguarding purchaser."
    },
    {
      "id": "cr3",
      "text": "Ex. B7 voluntary sale, not in execution of decree; not on behalf of joint family; sellers denied jointness; lis pendens applies fully.",
      "addresses_issue": "i1",
      "key_observation": "Distinguished from court sales; exemption not extended to voluntary sales; Bishan Singh distinguished as pre-emption case."
    },
    {
      "id": "cr4",
      "text": "Ex. B51 revenue sale: Loans recoverable under S.7(1)(a) from borrower only, not affecting prior interests per proviso; individual liability unless proved joint; allot to Munisami's share.",
      "addresses_issue": "i1",
      "key_observation": "High Court right to separate improved lands; pre-existing charge not affected by lis pendens but limited to borrower's interest."
    },
    {
      "id": "cr5",
      "text": "No paramount claim beyond statute; cannot sell non-borrower's property.",
      "addresses_issue": "i1",
      "key_observation": "Statute displaces prerogative; Builders Supply limited."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Doctrine of lis pendens under S.52 TPA applies to voluntary sale Ex. B7 fully; applies to revenue sale Ex. B51 except for lands specifically improved by loans.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Rule 28 Order IV not ultra vires; appeal maintainable on facts as SL granted and advanced.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Union of India v. Ram Kanwar",
      "citation": "1962 3 S.C.R. 313",
      "treatment": "followed",
      "relevance": "High Court can regulate time/manner for Letters Patent certificate application."
    },
    {
      "case_name": "Bishan Singh v. Khazan Singh",
      "citation": "1959 S.C.R. 878",
      "treatment": "distinguished",
      "relevance": "Pre-emption rights; not applicable to general lis pendens in partition."
    },
    {
      "case_name": "Builders Supply Corporation v. Union of India",
      "citation": "1965 2 S.C.R. 289",
      "treatment": "referred",
      "relevance": "Paramount State claim for taxes limited by statute."
    },
    {
      "case_name": "Penu Balakrishna Iyer v. Ariya M. Ramaswami Iyer",
      "citation": "1964 7 S.C.R. 49",
      "treatment": "referred",
      "relevance": "No inflexible rule refusing SL if LP not exhausted."
    },
    {
      "case_name": "Kedar Nath Lal v. Ganeshi Ram",
      "citation": "1970 2 S.C.R. 204",
      "treatment": "followed",
      "relevance": "Lis pendens applies to court auctions."
    },
    {
      "case_name": "Attorney-General v. De Keyser's Royal Hotel Ltd.",
      "citation": "1920 A.C. 508",
      "treatment": "referred",
      "relevance": "Statute displaces Crown prerogative."
    }
  ],
  "statutes_cited": [
    {
      "name": "Transfer of Property Act, 1882",
      "sections": [
        "Section 52"
      ],
      "relevance": "Doctrine of lis pendens; prevents transfers during suit affecting other parties' rights."
    },
    {
      "name": "Land Improvement Loans Act, 1883",
      "sections": [
        "Section 7(1)(a)",
        "Section 7(1)(c)",
        "Proviso to Section 7"
      ],
      "relevance": "Loans recoverable as land revenue from borrower/land; proviso protects prior interests."
    },
    {
      "name": "Madras Revenue Recovery Act, 1864",
      "sections": [
        "Section 42"
      ],
      "relevance": "Lands sold free of encumbrances for revenue arrears."
    },
    {
      "name": "Letters Patent (Madras High Court)",
      "sections": [
        "Clause 15",
        "Clause 37"
      ],
      "relevance": "Right to appeal; High Court power to make rules."
    },
    {
      "name": "Limitation Act, 1963",
      "sections": [
        "Article 117",
        "Section 5"
      ],
      "relevance": "30 days for LP appeal; condonation."
    },
    {
      "name": "Madras High Court Rules",
      "sections": [
        "Rule 28 Order IV"
      ],
      "relevance": "Oral immediate application for LP certificate."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal dismissed with costs. Upheld High Court: voluntary sale Ex.B7 hit by lis pendens; revenue sale Ex.B51 partially exempt for improved lands; trial court to take evidence and allot sold properties to 1st defendant's share as far as possible.",
    "relief_granted": "Purchaser protected by allotment to Munisami's share; partition decreed subject to lis pendens and directions.",
    "costs": "Dismissed with costs."
  },
  "key_quotes": [
    {
      "text": "The purpose of s. 52 of the Transfer of Property Act is not to defeat any just and equitable claim but only to subject them to the authority of the Court which is dealing with the property to which claims are put forward.",
      "speaker": "court",
      "significance": "Core principle of lis pendens balancing court control and just claims."
    },
    {
      "text": "Expositions of the doctrine of lis pendens indicate that the need for it arises from the very nature of the jurisdiction of Courts and their control over the subject matter of litigation.",
      "speaker": "court",
      "significance": "Explains basis and rationale of doctrine."
    },
    {
      "id": "q3",
      "text": "Rule 28 Order 4 does not take away any right conferred by cl. 15 of the Letters Patent. It only regulates the manner of the exercise of that right.",
      "speaker": "court",
      "significance": "Upholds procedural rule validity."
    }
  ],
  "_case_id": "1972_226",
  "_label": 0,
  "_text_length": 53850,
  "_extracted_at": "2026-02-10T20:08:25.447431"
}