{
  "metadata": {
    "case_name": "Appellant (Public Limited Company) v. State of Assam & Ors.",
    "case_year": 1972,
    "court": "Supreme Court of India",
    "judges": [
      "Hegde, J."
    ],
    "case_number": "C.A. No. 15 of 1972",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant had exclusive privilege under contract with Government of Assam for supplying country spirit to two warehouses in District of Lakhimpur from July 1, 1967 to March 3, 1970.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Commissioner of Excise, Assam invited sealed tenders for privilege of supplying country spirit to retail vendors in Upper Assam area (Districts of Lakhimpur and Sibsagar including Mikir Sub-Division) for three years from April 1, 1970. Notification stated preference to manufacturers.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Appellant tendered at 74 P. per London proof litre; Respondent No. 5 at 95 P. per London proof litre; Rampur Distillery offered 60 P. but tender defective and rejected.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Government not satisfied with tenders; by letter dated February 28, 1970, asked tenderers to indicate willingness to reduce rates by March 10, 1970.",
      "type": "procedural",
      "date": "1970-02-28",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Only Respondent No. 5 responded; Managing Director by letter dated March 4, 1970 agreed to reduce rate and accept any rate fixed by Government as reasonable.",
      "type": "material",
      "date": "1970-03-04",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Government reduced Respondent No. 5's rate to 74 P. per London proof litre and accepted its tender.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Assam Government order dated June 16, 1970 granted contract to Respondent No. 5 for wholesale supply of country spirit to Tinsukia and North Lakhimpur warehouses for three years from July 1, 1970 to June 30, 1973.",
      "type": "material",
      "date": "1970-06-16",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Appellant filed petition under Art. 226 in Assam and Nagaland High Court (Civil Rule No. 431 of 1970) to quash Government order; rejected by judgment dated December 16, 1971.",
      "type": "procedural",
      "date": "1971-12-16",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "No allegation of mala fides against Government.",
      "type": "admitted",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the impugned order of Assam Government dated June 16, 1970 granting contract to Respondent No. 5 violates Rule 93 of the Rules framed under the Eastern Bengal and Assam Excise Act, 1910.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Impugned order cannot be sustained because Government nowhere stated that tenders were not acceptable on ground that none appeared satisfactory.",
      "supporting_facts": [
        "f3",
        "f4"
      ],
      "legal_basis": "Rule 93"
    },
    {
      "id": "pa2",
      "text": "Under Rule 93, Government could not enter into negotiations with any tenderers.",
      "supporting_facts": [
        "f4",
        "f5",
        "f6"
      ],
      "legal_basis": "Rule 93"
    },
    {
      "id": "pa3",
      "text": "Before concluding contract with Respondent No. 5, Government should have given opportunity to other tenderers to reduce rates.",
      "supporting_facts": [
        "f4",
        "f5"
      ],
      "legal_basis": "principles of natural justice"
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Government considered tenders unsatisfactory as evidenced by letter asking to reduce prices; clear from facts.",
      "addresses_issue": "i1",
      "key_observation": "From facts, Government considered tenders unsatisfactory and hence unacceptable."
    },
    {
      "id": "cr2",
      "text": "Notification mentioned preference to manufacturers; prima facie nothing wrong; Government as purchaser can prefer one seller to another for good reasons like guarantee of supply; classification rational.",
      "addresses_issue": "i1",
      "key_observation": "Preference to manufacturers justified; no rule prohibits it; falls under s.19 powers."
    },
    {
      "id": "cr3",
      "text": "Rule 93 does not prohibit negotiations with tenderers; authorizes negotiations with non-tenderers; no rational basis to prohibit with tenderers; Government can negotiate under s.19 to get cheapest rates and regular supplies.",
      "addresses_issue": "i1",
      "key_observation": "Rule 93 does not prohibit negotiations with tenderers."
    },
    {
      "id": "cr4",
      "text": "No fundamental right to Government contract; appellant given opportunity to tender, offer considered, not rejected irrationally; no question of hearing as no rights deprived; only fair play required.",
      "addresses_issue": "i1",
      "key_observation": "No one has fundamental right to get Government contract; principles of natural justice not violated."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Impugned order does not violate Rule 93 or any statutory provision; s.19 confers wide powers on Government absent restrictive rules.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Eastern Bengal and Assam Excise Act, 1910",
      "sections": [
        "Section 19",
        "Section 36",
        "Rules 91",
        "Rule 92",
        "Rule 93"
      ],
      "relevance": "s.19 empowers Provincial Government to grant exclusive privilege of supplying country liquor; Rules 91-93 govern tender process but do not prohibit negotiations with tenderers or preference to manufacturers."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 226"
      ],
      "relevance": "Basis for High Court petition to quash Government order."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal by special leave dismissed; High Court order upheld; no order as to costs.",
    "relief_granted": "None",
    "costs": "No order as to costs"
  },
  "key_quotes": [
    {
      "text": "No one has a fundamental right to get a Government contract.",
      "speaker": "court",
      "significance": "Rejects natural justice argument."
    },
    {
      "text": "The Provincial Government may grant to any person... the exclusive privilege of manufacturing or of supplying... any country liquor... within any specified local area.",
      "speaker": "court",
      "significance": "Quotes s.19 highlighting wide Government powers."
    },
    {
      "text": "In the very notification calling for tenders, it had been mentioned that preference will be given to the manufacturers.",
      "speaker": "court",
      "significance": "Justifies preference given to Respondent No. 5."
    }
  ],
  "_case_id": "1972_211",
  "_label": 0,
  "_text_length": 10824,
  "_extracted_at": "2026-02-10T20:08:15.479549"
}