{
  "metadata": {
    "case_name": "Appellant Company v. Pritam Singh Gill",
    "case_year": 1970,
    "court": "Supreme Court of India",
    "judges": [
      "Dua, J."
    ],
    "case_number": "Civil Appeal No. 1171 of 1970",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The appellant is a company incorporated under the Companies Act, 1956 with its registered office in New Delhi. Its entire share capital has been subscribed by the Central Government.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Pritam Singh Gill, respondent number 1, was employed by the appellant as Junior Engineer at its Bhopal office with effect from the 9th November, 1962 at Rs. 280/- p.m. as basic salary with other allowances.",
      "type": "material",
      "date": "1962-11-09",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On October 5, 1964 Pritam Singh Gill was suspended and this order of suspension remained in force till September 18, 1967.",
      "type": "material",
      "date": "1964-10-05",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "During the period of suspension, on October 7, 1965, the respondent was transferred to Delhi.",
      "type": "procedural",
      "date": "1965-10-07",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Pritam Singh Gill was dismissed from service on September 19, 1967.",
      "type": "material",
      "date": "1967-09-19",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "On June 15, 1968 the respondent applied to the Labour Court at Delhi under s. 33C(2) of the Industrial Disputes Act, 1947 for computing the benefits and amount he was entitled to receive alleging that the appellant had not paid to him such amounts and benefits.",
      "type": "procedural",
      "date": "1968-06-15",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "The Labour Court framed the following four issues: Whether the application is not legally maintainable? Whether this court has no jurisdiction to entertain this petition? Whether the petitioner has been dismissed with effect from 19-9-1967, if so its effect? Whether the applicant is entitled to any of the benefits claimed? and decided all of them in favour of the respondent.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "The Labour Court held respondent entitled to Rs. 5,195/- as balance of salary at the rate of Rs. 150 p.m. for the period of suspension and also other allowances, the total amount computed being Rs. 10,259.98.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Appeal by special leave from the judgment and order dated February 18, 1970 of the Labour Court, Delhi in L.C.A. No. 709 of 1968.",
      "type": "procedural",
      "date": "1970-02-18",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether s. 33C(2) can be invoked by a dismissed workman in respect of benefits and salary due to him for the period prior to the date of his dismissal.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The respondent, having already been dismissed, had ceased to be a workman on the date of the application under s. 33C(2) and therefore had no locus standi to approach the Labour Court which had no jurisdiction to entertain the application. The date of the application is the crucial point of time to see whether the applicant is a workman.",
      "supporting_facts": [
        "f5",
        "f6"
      ],
      "legal_basis": "Section 2(s) definition of workman; Central Bank of India v. S. Rajagopalan"
    },
    {
      "id": "pa2",
      "text": "Under s. 33C(2) the applicant cannot claim that his dismissal is unlawful and be deemed in service entitled to salary under pre-existing contract. A dismissed workman is considered a workman only for proceedings in relation to an industrial dispute connected with his dismissal.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": "Section 33C(2); Section 2(s)"
    },
    {
      "id": "pa3",
      "text": "The respondent's claim raises an industrial dispute appropriate for reference under s.10 of the Act.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": "Section 10"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "If the period in respect of which the benefits and amount are claimed under s. 33C(2) was during the course of his employment prior to his dismissal, then the mere fact that he was dismissed before he could apply would not deprive him of his right to claim relief under that section.",
      "supporting_facts": [
        "f3",
        "f5",
        "f6"
      ],
      "legal_basis": "Section 33C(2)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "A suspended workman can invoke s.33C(2) as suspension does not make him cease to be a workman. The question is pure question of law on construction of statutory provisions.",
      "addresses_issue": "i1",
      "key_observation": "Appellant concedes suspended workman can invoke s.33C(2)."
    },
    {
      "id": "cr2",
      "text": "Section 2(s) defines workman including dismissed etc. only for proceedings under the Act in relation to industrial dispute connected with dismissal, but s.2 begins with 'unless repugnant in subject or context'. S.33C(2) is for recovery of money due, where workman entitled to money or benefit computable in money.",
      "addresses_issue": "i1",
      "key_observation": "Labour Court can decide if right exists before computing benefit."
    },
    {
      "id": "cr3",
      "text": "S.33C(2) is executing provision for speedy remedy to individual workmen for existing rights without recourse to s.10. Broad construction needed to advance remedy. Accepting appellant's view would allow employers to dismiss to deprive s.33C(2) relief, defeating purpose – repugnant to s.2(s). Thus 'workman' in s.33C(2) includes one employed during claim period even if dismissed later.",
      "addresses_issue": "i1",
      "key_observation": "Term workman in s.33C(2) includes persons whose claim is for existing right from past employment relationship."
    },
    {
      "id": "cr4",
      "text": "Distinguishes Central Bank of India v. S. Rajagopalan as not covering claims for pre-dismissal period. Approves propositions from Chief Mining Engineer case on scope of s.33C(2). Follows High Court decisions like Tiruchi-Srirangam Transport, Manicka Mudaliar etc. upholding jurisdiction for ex-employees' pre-termination claims.",
      "addresses_issue": "i1",
      "key_observation": "Legislative history supports individual speedy remedies."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "S.33C(2) can be invoked by a dismissed workman for benefits due for period prior to dismissal. 'Workman' in s.33C(2) includes one who was in employment during the period claimed even if not at application time.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Central Bank of India v. S. Rajagopalan",
      "citation": "1964 3 S.C.R. 140",
      "treatment": "distinguished",
      "relevance": "Does not assist as claim here is for pre-dismissal suspension period, not challenging dismissal."
    },
    {
      "case_name": "Messrs Kesoram Cotton Mills Ltd. v. Gangadhar",
      "citation": "1964 2 S.C.R. 809",
      "treatment": "distinguished",
      "relevance": "On suspension and dismissal wages, not relevant to s.33C jurisdiction."
    },
    {
      "case_name": "Chief Mining Engineer, East India Coal Co. Ltd. v. Rameswar",
      "citation": "1968 1 S.C.R. 140",
      "treatment": "followed",
      "relevance": "Propositions on scope of s.33C(2) as speedy remedy for individual rights, wider than s.33C(1), Labour Court can decide existence of right."
    },
    {
      "case_name": "U.P. Electric Supply Co. v. R. K. Shukla",
      "citation": "A.I.R. 1970 S.C. 237",
      "treatment": "followed",
      "relevance": "Labour Court jurisdiction for existing rights from employment relationship."
    },
    {
      "case_name": "R. B. Bansilal Abhirchand Mills Co. P. Ltd. v. The Labour Court, Nagpur",
      "citation": "A.I.R. 1972 S.C. 451",
      "treatment": "followed",
      "relevance": "Jurisdiction under s.33C(2) not ousted by denial of claim; Labour Court to determine."
    },
    {
      "case_name": "Tiruchi-Srirangam Transport Co. P. Ltd. v. Labour Court, Madurai",
      "citation": "1961 1 L.L.J. 729",
      "treatment": "followed",
      "relevance": "Dismissed workman can claim under s.33C(2) for prior bonus."
    },
    {
      "case_name": "Manicka Mudaliar M. v. Labour Court, Madras",
      "citation": "1961 1 L.L.J. 592",
      "treatment": "followed",
      "relevance": "Ex-employee can claim arrears and notice pay under s.33C(2)."
    },
    {
      "case_name": "Bachittar Singh v. Central Labour Court, Jullundur",
      "citation": "A.I.R. 1969 Punjab 187",
      "treatment": "followed",
      "relevance": "Supports jurisdiction for ex-workmen."
    },
    {
      "case_name": "Management of Government Soap Factory, Bangalore v. Presiding Officer, Labour Court Bangalore",
      "citation": "A.I.R. 1970 Mys. 225",
      "treatment": "followed",
      "relevance": "Supports jurisdiction for ex-workmen."
    },
    {
      "case_name": "U.P. Electric Supply Co. Ltd. v. Assistant Labour Commissioner, Allahabad",
      "citation": "1966 II I.L.J. 715",
      "treatment": "followed",
      "relevance": "Under similar provision, ex-employee can claim."
    },
    {
      "case_name": "Bennet Coleman Co. P. Ltd. v. Punya Priya Das Gupta",
      "citation": "1970 1 S.C.R. 181",
      "treatment": "distinguished",
      "relevance": "Different statute without limited inclusion/exclusion in definition."
    }
  ],
  "statutes_cited": [
    {
      "name": "Industrial Disputes Act, 1947",
      "sections": [
        "Section 33C(2)",
        "Section 2(s)",
        "Section 10",
        "Section 33A",
        "Chapter VA"
      ],
      "relevance": "S.33C(2) for computing benefits due to workman; s.2(s) defines workman; s.10 for industrial disputes; speedy individual remedy."
    },
    {
      "name": "Companies Act, 1956",
      "sections": [],
      "relevance": "Appellant incorporated under it."
    },
    {
      "name": "U.P. Industrial Disputes Act",
      "sections": [
        "Section 6H"
      ],
      "relevance": "Identical to s.33C; jurisdiction upheld."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal challenging jurisdiction of Labour Court under s.33C(2) is dismissed. Labour Court correctly entertained claim for suspension benefits prior to dismissal.",
    "relief_granted": "Labour Court award upheld (Rs.10,259.98)",
    "costs": "Dismissed with costs."
  },
  "key_quotes": [
    {
      "text": "The sole question we are thus called upon to decide is, whether s. 33C(2) can be invoked by a dismissed workman in respect of benefits and salary due, to him for the period prior to the date of his dismissal.",
      "speaker": "court",
      "significance": "Frames the core legal issue."
    },
    {
      "text": "In order to remove this repugnancy s. 33C(2) must be so construed as to take within its fold a workman, who was employed during the period in respect of which he claims relief, even though he is no longer employed at the time of the application.",
      "speaker": "court",
      "significance": "Key holding on construction of 'workman' in s.33C(2)."
    },
    {
      "text": "Section 33C of the Act has accordingly been described as a provision which clothes the Labour Court with the powers similar to those of an executing court so that the workman concerned receives speedy relief in respect of his existing individual rights.",
      "speaker": "court",
      "significance": "Explains purpose and broad construction of s.33C."
    }
  ],
  "_case_id": "1972_113",
  "_label": 0,
  "_text_length": 28084,
  "_extracted_at": "2026-02-10T20:07:25.175924"
}