{
  "metadata": {
    "case_name": "Assessee Firm v. Income Tax Authorities",
    "case_year": 1969,
    "court": "Supreme Court of India",
    "judges": [
      "HEGDE, J."
    ],
    "case_number": "Civil Appeal No. 1690 of 1969",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The appellant is the assessee firm concerned with assessment for the assessment year 1958-59, relevant previous year ended on March 31, 1958.",
      "type": "background",
      "date": "1958-03-31",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Assessee firm applied for renewal of registration under section 26A of the Indian Income Tax Act 1922 before the Income-Tax Officer on May 26, 1958, mentioning that the previous year's income had been divided among the partners.",
      "type": "procedural",
      "date": "1958-05-26",
      "source": "assessee"
    },
    {
      "id": "f3",
      "text": "Income-Tax Officer rejected the application, disbelieving the assessee's version that the previous year's income had been divided.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f4",
      "text": "In appeal, the Appellate Assistant Commissioner agreed with the Income-Tax Officer.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "On further appeal to the Income-tax Appellate Tribunal, the Tribunal agreed with the lower authorities.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "Before the Tribunal, assessee contended that at any rate the partners having divided the income of the previous year as evidenced by the balance sheet before the assessment was made, the assessee firm was entitled to registration under section 26A.",
      "type": "disputed",
      "date": null,
      "source": "assessee"
    },
    {
      "id": "f7",
      "text": "Tribunal did not go into the question raised before it.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Delhi High Court in Income-tax Reference No. 44 of 1964 by judgment and order dated July 15, 1968 agreed with the view taken by the Tribunal.",
      "type": "procedural",
      "date": "1968-07-15",
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether it was incumbent on the part of the assessee to have divided the profits of the previous year before it made its application for renewal of the registration certificate.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The previous year's income had been divided among the partners.",
      "supporting_facts": [
        "f2"
      ],
      "legal_basis": "Section 26A of the Indian Income Tax Act 1922"
    },
    {
      "id": "pa2",
      "text": "At any rate the partners having divided the income of the previous year as evidenced by the balance sheet before the assessment was made, the assessee firm was entitled for its registration under section 26A.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": "Section 26A of the Indian Income Tax Act 1922"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Version of the assessee that the previous year's income had been divided not believed.",
      "supporting_facts": [
        "f3",
        "f4",
        "f5"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "For deciding the question it is necessary to refer to the relevant provisions of the Act as well as the Rules: Section 26A read with Rules 2, 3 and 6, and the forms.",
      "addresses_issue": "i1",
      "key_observation": "In the case of an application for renewal it is incumbent on the part of the assessee to have divided the previous years profits. This conclusion appears to be obvious from Section 26A read with Rules 2, 3, 6 and the forms set out."
    },
    {
      "id": "cr2",
      "text": "Rule 2 requires application signed by all partners; timelines specified. Rule 3 requires form with certification that profits 'were/will be' divided. Form I requires certification that profits 'were/will be' divided as shown in schedule.",
      "addresses_issue": "i1",
      "key_observation": "Clear that in the case of an application for renewal it is incumbent on the part of the assessee to have divided the previous years profits."
    },
    {
      "id": "cr3",
      "text": "Rule 6 for renewal: application with certificate that profits 'were/will be' divided or credited as shown.",
      "addresses_issue": "i1",
      "key_observation": "From a reading of these provisions it is clear that in the case of an application for renewal it is incumbent on the part of the assessee to have divided the previous years profits."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "In the case of an application for renewal of registration under section 26A, it is incumbent on the part of the assessee to have divided the previous year's profits before making the application.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Indian Income Tax Act 1922",
      "sections": [
        "Section 26A"
      ],
      "relevance": "Governs procedure for registration and renewal of firms; requires certification of division of previous year's profits in application for renewal."
    },
    {
      "name": "Indian Partnership Act 1932",
      "sections": [],
      "relevance": "Referenced in Rule 2 regarding registration of firm or deed."
    },
    {
      "name": "Indian Registration Act 1908",
      "sections": [],
      "relevance": "Referenced in Rule 2 regarding registration of deed of partnership."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court held that for renewal of registration under section 26A, the assessee firm must have divided the previous year's profits before the application, affirming the lower authorities and High Court.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The only question that arises for decision in this case is whether it was incumbent on the part of the assessee to have divided the profits of the previous year before it made its application for renewal of the registration certificate.",
      "speaker": "court",
      "significance": "Frames the sole issue for decision."
    },
    {
      "text": "From a reading of these provisions it is clear that in the case of an application for renewal it is incumbent on the part of the assessee to have divided the previous years profits.",
      "speaker": "court",
      "significance": "Core holding of the court."
    }
  ],
  "_case_id": "1972_497",
  "_label": 0,
  "_text_length": 10103,
  "_extracted_at": "2026-02-10T20:10:12.540188"
}