{
  "metadata": {
    "case_name": "Nanhku Singh v. State",
    "case_year": null,
    "court": "Supreme Court of India",
    "judges": [
      "Jaganmohan Reddy, J."
    ],
    "case_number": null,
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "On November 17, 1964 at about one Pahar after sun-rise, about 7 or 8 A.M. Nanhku Singh, Mohan Singh A-3 who had each a gun, along with accused Nos. 4 to 26 who were armed with ballams, Garashas and lathis came to the field of Indradeo Singh PW 12 and were alleged to be engaged in cutting the paddy crop in that field.",
      "type": "material",
      "date": "1964-11-17",
      "source": "prosecution"
    },
    {
      "id": "f2",
      "text": "Indradeo Singh along with Chait Ahir PW 8 and others went there and when Indradeo Singh protested at the high handedness of the accused there was an altercation between him and the party of the accused whereupon Nanhku Singh shot Indradeo Singh. This was followed by Mohan Singh also firing at Indradeo Singh.",
      "type": "material",
      "date": "1964-11-17",
      "source": "prosecution"
    },
    {
      "id": "f3",
      "text": "Indradeo Singh was injured after which he fell down in the field of Sumer Singh situated in the north of his own field separated by a small plot of Jamus Singh and water nala.",
      "type": "material",
      "date": "1964-11-17",
      "source": "prosecution"
    },
    {
      "id": "f4",
      "text": "After Indradeo Singh fell down, Chait Ahir went to his rescue and wanted to lift him but Lalita Singh fired and caused him injuries.",
      "type": "material",
      "date": "1964-11-17",
      "source": "prosecution"
    },
    {
      "id": "f5",
      "text": "Dina Nath PW 11 who was cutting his paddy crop in the field situated near Indradeo Singh's field, on hearing the gun shots came to the scene and witnessed the shooting of Chait Ahir. He placed Indradeo Singh on a cot and he along with others took him to the Police Station, about 8 miles away. There about 2 p.m. Dina Nath lodged a first information Report because Indradeo Singh was completely unconscious and was unable to speak.",
      "type": "procedural",
      "date": "1964-11-17",
      "source": "prosecution"
    },
    {
      "id": "f6",
      "text": "The injured persons were then sent to the Durgawati Hospital for their medical examination where they were attended by Doctor Aggarwal.",
      "type": "procedural",
      "date": "1964-11-17",
      "source": "prosecution"
    },
    {
      "id": "f7",
      "text": "There was enmity between the father of the appellant Ambika Singh and Indradeo Singh PW 12, Chait Ahir PW 8, Dina Nath PW 11, Mushan Pandey PW 7. Ambika Singh initiated proceedings under Section 107 Cr.P.C. against Bilar Ahir PW 3, Mushan Pandey PW 7, Chait Ahir PW 8, Dina Nath PW 11 and Indradeo Singh PW 12.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "In a case brought against PW 3 by Ghureher Gareri, accused Mohan Singh and Ambika Singh had given evidence and though he was convicted by the Trial Court, the Appellate Court acquitted him.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Of the 26 accused charged with offences under Sections 307/149, 304/34, 147, 148 and 379, the Trial Court acquitted 24 accused but convicted Nanhku Singh A-1 and Lalita Singh A-2 under Section 307 and sentenced the former to 7 years rigorous imprisonment and the latter to 5 years rigorous imprisonment.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "In appeal the High Court confirmed the conviction of both the accused but under Section 307 read with Section 34 and reduced the sentences to be undergone by each of them to 3 years rigorous imprisonment.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "This Court granted Special leave only to Nanhku Singh and rejected the petition of Lalita Singh for default of surrender.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Blood stains discovered by the investigating Officer at the place where Indradeo Singh is said to have fallen down.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Indradeo Singh had punctured wound on the left prominence of the cheek 8/10 x 1/2 with everted and irregular edges and another wound of 1/2 x 1/10 x 1/2 situated 1/5 below the right lobule of the ear.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Investigating Officer Rang Nath Prasad PW 13 could not record the statement of Indradeo Singh because he was in pain and could not speak.",
      "type": "procedural",
      "date": "1964-11-17",
      "source": "prosecution"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the conviction of Nanhku Singh under Section 307/34 IPC is sustainable given the enmity between the parties and the need to scrutinise eyewitness evidence carefully.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the courts below erred in accepting the eyewitness testimony despite contradictions with the FIR and acquittal of Mohan Singh on the same evidence.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "On the same evidence Mohan Singh was acquitted by the Trial Court and that benefit should also have been given to the appellant and the other accused.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Contradictions between the First Information Report and the evidence of PW 11 Dina Nath.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": "Section 145 of the Evidence Act"
    },
    {
      "id": "pa3",
      "text": "Indradeo Singh could have given a statement to the Police but did not do so till after about 12 days which only shows that the case against his clients was fabricated.",
      "supporting_facts": [
        "f14"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Prosecution case as per FIR and eyewitnesses: Nanhku Singh fired at Indradeo Singh, Lalita Singh at Chait Ahir.",
      "supporting_facts": [
        "f1",
        "f2",
        "f4",
        "f5"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Both the Trial Court as well as the Appellate Court were aware of the need to exercise caution and after weighing the evidence carefully and giving the utmost benefit to the accused nonetheless came to the conclusion that the offence against both the appellant and the other accused had been established.",
      "addresses_issue": "i1",
      "key_observation": "This Court does not ordinarily interfere with the findings arrived at on an appreciation of evidence by the High Court particularly when it affirms the finding of the Trial Court unless the conclusions arrived at cannot be supported by the evidence or that it is perverse."
    },
    {
      "id": "cr2",
      "text": "Analysis of PW 3 Bilar Ahir: Despite enmity, did not implicate Mohan Singh despite opportunity, corroborated by blood stains.",
      "addresses_issue": "i1",
      "key_observation": "Two circumstances which lend weight to the evidence of PW 3: did not involve Mohan Singh despite prior enmity context, and location of fall corroborated."
    },
    {
      "id": "cr3",
      "text": "PW 5 Bikram Singh not eyewitness to shooting but saw accused with guns; no enmity.",
      "addresses_issue": "i1",
      "key_observation": "Tendency to exaggerate but saw persons with guns."
    },
    {
      "id": "cr4",
      "text": "PW 7 Mushan Pandey saw later part: Lalita firing at Chait Ahir.",
      "addresses_issue": "i1",
      "key_observation": "Possibility of seeing later firing; minor inference differences do not reject factum of firing."
    },
    {
      "id": "cr5",
      "text": "Injured PW 8 Chait Ahir implicates Lalita without hesitation; no enmity with Lalita.",
      "addresses_issue": "i1",
      "key_observation": "Does not go out of way to implicate appellant."
    },
    {
      "id": "cr6",
      "text": "PW 11 Dina Nath's evidence accepted; no reason to falsely give prominent part to appellant over father Ambika.",
      "addresses_issue": "i1",
      "key_observation": "FIR lodged when injury not known to be fatal; no mention of Ambika instigation in FIR."
    },
    {
      "id": "cr7",
      "text": "FIR is not substantive evidence; contradictions not put to witness; informant not necessarily eyewitness.",
      "addresses_issue": "i2",
      "key_observation": "Opportunity not given to explain."
    },
    {
      "id": "cr8",
      "text": "No validity in delay argument for Indradeo statement: IO testified he could not speak due to pain; injuries consistent; no cross on this.",
      "addresses_issue": "i2",
      "key_observation": "Injuries made it difficult to speak."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Conviction under Section 307/34 sustainable; no interference warranted as findings not perverse.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "307/149",
        "304/34",
        "147",
        "148",
        "379"
      ],
      "relevance": "Offences charged"
    },
    {
      "name": "Code of Criminal Procedure",
      "sections": [
        "107",
        "154"
      ],
      "relevance": "Proceedings initiated by Ambika Singh; FIR lodged"
    },
    {
      "name": "Indian Evidence Act",
      "sections": [
        "145"
      ],
      "relevance": "FIR used for contradicting witness"
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Special leave petition of Nanhku Singh dismissed; conviction under Section 307/34 and sentence of 3 years RI confirmed.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "This Court does not ordinarily interfere with the findings arrived at on an appreciation of evidence by the High Court particularly when it affirms the finding of the Trial Court unless the conclusions arrived at cannot be supported by the evidence or that it is perverse.",
      "speaker": "court",
      "significance": "Principle for interference in concurrent findings"
    },
    {
      "text": "We do not think this is a case of that kind where our interference is called for.",
      "speaker": "court",
      "significance": "Dismissal rationale"
    }
  ],
  "_case_id": "1972_193",
  "_label": 0,
  "_text_length": 12944,
  "_extracted_at": "2026-02-10T20:08:23.328474"
}