{
  "metadata": {
    "case_name": "State of Mysore v. Respondents (Writ Petitioners Nos. 1416 and 2918 of 1967)",
    "case_year": 1971,
    "court": "Supreme Court of India",
    "judges": [
      "BEG, J."
    ],
    "case_number": "Civil Appeals Nos. 193, 194 of 1971",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Two Writ Petitions Nos. 1416 and 2918 of 1967 allowed by Mysore High Court on April 11, 1969, quashing State Government Notifications Nos. GSRS. 384, 392 and 303 dated 30th August, 1967 amending Mysore State Accounts Services Recruitment Rules, 1959.",
      "type": "procedural",
      "date": "1969-04-11",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "High Court quashed promotions of Respondents 3 to 8 in Writ Petition No. 1416/67.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f3",
      "text": "High Court directed State of Mysore to consider cases of petitioners (respondents before Supreme Court) with those of Respondents 3 to 8 for promotion under Mysore State Accounts Services Recruitment Rules, 1959 notified on 26-5-1959 made under Article 309.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f4",
      "text": "Petitioners joined Accounts services in Comptroller's office of former Mysore State as first and second Division Clerks.",
      "type": "background",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f5",
      "text": "Consequent upon abolition of Comptroller's office, petitioners began working as Accounts Clerks under Chief Engineer, P.W.D.",
      "type": "background",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f6",
      "text": "On 31st October, 1953, Divisional Accounts Cadre in scale of Rs. 130-335 created by Mysore Government under administrative control of Chief Engineer.",
      "type": "background",
      "date": "1953-10-31",
      "source": "respondent"
    },
    {
      "id": "f7",
      "text": "Both petitioners passed prescribed examinations and were absorbed in Divisional Accounts Cadre.",
      "type": "admitted",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "In April, 1959, P.W.D. Reorganisation Committee recommended transfer of P.W.D. Accounts Branch in toto to newly set up Controller of State Accounts.",
      "type": "background",
      "date": "1959-04",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "In accordance with recommendation, petitioners came under administrative control of Controller; designation changed to Accounts Superintendent.",
      "type": "background",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f10",
      "text": "On 15th May, 1959, two formerly separate units (P.W.D. Accounts unit under Chief Engineer and Local Fund Audit unit/State Accounts Department) came under common administrative control of Controller of State Accounts.",
      "type": "background",
      "date": "1959-05-15",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "On 26th May, 1959, Mysore State Accounts Services Cadre and Recruitment Rules issued; combined cadre strength fixed.",
      "type": "material",
      "date": "1959-05-26",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Rules of 1959 brought complete integration between two units: qualifications and status identical, work same nature, recruiting authorities same, standards and tests identical; artificial distinction based on separate control abolished; single permanent service under uniform rules.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Petitioners discriminated against in promotions because they worked in P.W.D. Accounts Unit which ceased to exist.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f14",
      "text": "Figures showed striking disparity in promotional opportunities between officers of two wings in same cadres.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f15",
      "text": "Impugned Notifications fixed cadre strength reducing promotional posts for Public Works Accounts Unit compared to other wing.",
      "type": "material",
      "date": "1967-08-30",
      "source": "lower_court"
    },
    {
      "id": "f16",
      "text": "State contended petitioners never promoted or appointed under rules of 1959.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f17",
      "text": "Point that petitioners not promoted under 1959 rules not argued before High Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Validity of amendments made retrospectively in 1967 to Mysore State Accounts Services Recruitment Rules, 1959, via Notifications, creating differences in promotional chances between two wings of integrated service, violating Articles 14 and 16(1).",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether petitioners were promoted or appointed to offices under rules of 1959 so as to claim equality of promotional chances.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Petitioners (respondents before Supreme Court) never promoted or appointed to offices under rules of 1959, so cannot complain of denial of equality of promotional chances.",
      "supporting_facts": [
        "f16"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Amendments made retrospectively in 1967 justifying differences in promotional chances between two wings legal and bore rational nexus to object.",
      "supporting_facts": [
        "f15"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Differences justified by historical backgrounds and past practice of distinction in promotional chances.",
      "supporting_facts": [
        "f12"
      ],
      "legal_basis": null
    },
    {
      "id": "pa4",
      "text": "Reliance on Ram Lal Wadhwa v. State of Haryana and S.C. Jaisinghani v. Union of India to justify difference in promotional chances.",
      "supporting_facts": [],
      "legal_basis": "Ram Lal Wadhwa AIR 1972 SC 1982; S.C. Jaisinghani 1967 2 SCR 703"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Complete integration under 1959 Rules; discrimination in promotions due to origin in P.W.D. Accounts Unit violates Articles 14 and 16(1).",
      "supporting_facts": [
        "f11",
        "f12",
        "f13",
        "f14",
        "f15"
      ],
      "legal_basis": "Articles 14, 16(1)"
    },
    {
      "id": "ra2",
      "text": "Impugned Notifications reduce promotional posts for P.W.D. unit violating seniority-cum-merit basis of 1959 Rules.",
      "supporting_facts": [
        "f15"
      ],
      "legal_basis": "Mysore State Accounts Services Recruitment Rules, 1959"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Point that petitioners not appointed under 1959 Rules not raised before High Court; cannot be entertained for first time in Supreme Court as involves facts.",
      "addresses_issue": "i2",
      "key_observation": "Well recognised practice not to allow new points involving facts."
    },
    {
      "id": "cr2",
      "text": "1959 Rules effected complete integration of two units into single service; qualifications, status, work identical.",
      "addresses_issue": "i1",
      "key_observation": "Artificial distinction abolished; single permanent service."
    },
    {
      "id": "cr3",
      "text": "Amendments sought to disintegrate integrated service to justify illegal promotions; ultra vires Articles 14, 16(1).",
      "addresses_issue": "i1",
      "key_observation": "Cannot validate unconstitutional discrimination."
    },
    {
      "id": "cr4",
      "text": "Historical division or past unconstitutional practice cannot justify differences without rational nexus to merit/seniority.",
      "addresses_issue": "i1",
      "key_observation": "Fortuitous artificial division insufficient."
    },
    {
      "id": "cr5",
      "text": "Ram Lal Wadhwa distinguished: no formal integration there; gradual elimination of cadre.",
      "addresses_issue": "i1",
      "key_observation": "Here complete integration accomplished."
    },
    {
      "id": "cr6",
      "text": "Jaisinghani distinguished: quotas there on rational criteria; here to validate violations.",
      "addresses_issue": "i1",
      "key_observation": "Amendments for illegal purpose."
    },
    {
      "id": "cr7",
      "text": "Inequality in promotion opportunities justifiable only on rational criteria related to competence; here no such distinction between single class.",
      "addresses_issue": "i1",
      "key_observation": "Members of one class not even considered."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Impugned Notifications unconstitutional as they divide integrated single service into classes for unequal promotional chances without rational basis, violating Articles 14 and 16(1).",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Cases of respondents to be considered for promotion under 1959 Rules on merit-cum-seniority without ignoring due to source of recruitment.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "State of Mysore v. Padmanabhacharya",
      "citation": "AIR 1966 SC 602",
      "treatment": "followed",
      "relevance": "Power under Article 309 proviso cannot validate unconstitutional discrimination in promotional chances."
    },
    {
      "case_name": "Ram Lal Wadhwa v. State of Haryana",
      "citation": "AIR 1972 SC 1982",
      "treatment": "distinguished",
      "relevance": "Historical reasons justified difference there due to no integration; not applicable here."
    },
    {
      "case_name": "S.C. Jaisinghani v. Union of India",
      "citation": "1967 2 SCR 703",
      "treatment": "distinguished",
      "relevance": "Quotas fixed on rational criteria there; here amendments to validate violations."
    },
    {
      "case_name": "State of Punjab v. Joginder Singh",
      "citation": "AIR 1963 SC 913",
      "treatment": "referred",
      "relevance": "Inequality of promotion opportunity not unconstitutional per se if justified rationally."
    },
    {
      "case_name": "K.M. Bakshi v. Union of India",
      "citation": "1965 Supp 2 SCR 169",
      "treatment": "referred",
      "relevance": "Inequality must be justified on rational criteria related to object."
    }
  ],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Article 309",
        "Article 14",
        "Article 16(1)",
        "Article 132",
        "Article 133(1)(c)"
      ],
      "relevance": "Rules under 309; notifications violate equality under 14, 16(1); certificate under 132, 133."
    },
    {
      "name": "Mysore State Accounts Services Recruitment Rules, 1959",
      "sections": [],
      "relevance": "Integrated service on seniority-cum-merit; amendments disintegrated it unconstitutionally."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeals by special leave dismissed; High Court order upheld quashing notifications and directing consideration of respondents' cases for promotion under 1959 Rules without discrimination based on unit origin.",
    "relief_granted": "Respondents' cases to be considered with Respondents 3-8 under 1959 Rules on merit-cum-seniority.",
    "costs": "Dismissed with one set of costs."
  },
  "key_quotes": [
    {
      "text": "There cannot be the slightest doubt from these rules that a clear and complete integration was brought about between the two units.",
      "speaker": "lower_court",
      "significance": "High Court's finding on integration under 1959 Rules upheld."
    },
    {
      "text": "Such amendments made for the purpose of justifying the illegal promotions made, in the teeth of the protection conferred by Articles 14 and 16(1)... could not be upheld.",
      "speaker": "court",
      "significance": "Core holding on unconstitutionality of amendments."
    },
    {
      "text": "Articles 14 and 16(1) of the Constitution must be held to be violated when members of one class are not even considered for promotion.",
      "speaker": "court",
      "significance": "Explains violation where no consideration given to merits."
    }
  ],
  "_case_id": "1972_409",
  "_label": 0,
  "_text_length": 13361,
  "_extracted_at": "2026-02-10T20:09:44.788379"
}