{
  "metadata": {
    "case_name": "Appellant Company v. Ganapati Sontra and Others",
    "case_year": 1968,
    "court": "Supreme Court of India",
    "judges": [
      "Mathew, J."
    ],
    "case_number": "Civil Appeal No. 1462 of 1968",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The appellant, a company incorporated under the Companies Act, filed a writ petition before the High Court of Calcutta praying for the issue of a writ or an order in the nature of certiorari quashing the award passed by the Second Industrial Tribunal, West Bengal, Calcutta, directing the reinstatement of Ganapati Sontra, the second respondent.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "A learned judge of the Calcutta High Court dismissed the writ petition.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f3",
      "text": "The appellant filed an appeal before a Division Bench of the Calcutta High Court, which was dismissed.",
      "type": "procedural",
      "date": "1967-11-28",
      "source": "lower_court"
    },
    {
      "id": "f4",
      "text": "This appeal is preferred against the order of the Division Bench by certificate granted by the High Court under Article 133(1)(c) of the Constitution.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The second respondent was employed by the appellant in the year 1946 as a clerk in its Service Department. At that time, there was no rule prescribing the age of retirement of the workmen of the company.",
      "type": "background",
      "date": "1946",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "In November 1951, the appellant introduced standing orders under the provisions of the Industrial Employment (Standing Orders) Act, 1946, which fixed the age of retirement at 55.",
      "type": "material",
      "date": "1951-11",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "On September 17, 1956, the Central Act 20 of 1946 was amended by Act 36 of 1956.",
      "type": "background",
      "date": "1956-09-17",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "The standing orders in the appellant company were modified on May 30, 1961, but the provision regarding the age of superannuation remained unchanged at 55.",
      "type": "material",
      "date": "1961-05-30",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "On November 27, 1961, the appellant issued a notice to the second respondent informing him that he was due to retire on August 31, 1962 as he would be attaining the age of 55 on that date.",
      "type": "material",
      "date": "1961-11-27",
      "source": "petitioner"
    },
    {
      "id": "f10",
      "text": "On August 11, 1962, respondent No. 3, the Union of the employees of the appellant, submitted a charter of demands, one of which was to raise the age of retirement from 55 to 60.",
      "type": "material",
      "date": "1962-08-11",
      "source": "respondent"
    },
    {
      "id": "f11",
      "text": "On August 18, 1962, respondent No. 3 wrote to the appellant to keep the retirement of second respondent in abeyance till a decision on the charter of demands.",
      "type": "material",
      "date": "1962-08-18",
      "source": "respondent"
    },
    {
      "id": "f12",
      "text": "On August 30, 1962, the second respondent wrote to the appellant to postpone taking a final decision on his retirement as a dispute had been raised about the retirement age.",
      "type": "material",
      "date": "1962-08-30",
      "source": "respondent"
    },
    {
      "id": "f13",
      "text": "By letter dated August 31, 1962, the Secretary of the appellant company replied that as long as the retirement age in standing orders was not altered, he had to be guided by the same, but if altered later, it would be adhered to.",
      "type": "material",
      "date": "1962-08-31",
      "source": "petitioner"
    },
    {
      "id": "f14",
      "text": "The second respondent was made to retire on September 1, 1962.",
      "type": "material",
      "date": "1962-09-01",
      "source": "petitioner"
    },
    {
      "id": "f15",
      "text": "Government of West Bengal, by order dated January 29, 1963, made a reference to the first respondent (Tribunal) of the industrial dispute between appellant and its workmen represented by third respondent. Relevant question: Is the superannuation of Shri Ganapati Santra justified? What relief, if any? What should be the age of retirement?",
      "type": "procedural",
      "date": "1963-01-29",
      "source": "court"
    },
    {
      "id": "f16",
      "text": "Appellant contended before Tribunal that age of retirement was 55 per standing orders and retirement was proper.",
      "type": "admitted",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f17",
      "text": "Union contended that second respondent, appointed in 1946 when no age fixed, not bound by 1952 or 1961 standing orders.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f18",
      "text": "Industrial Tribunal, by award dated April 27, 1964, held retirement unjustified as second respondent not bound by standing orders provision, directed reinstatement. Also raised retirement age to 58 for all categories, modifying standing orders.",
      "type": "material",
      "date": "1964-04-27",
      "source": "lower_court"
    },
    {
      "id": "f19",
      "text": "Appellant challenged award in writ petition (Original Order No. 201 of 1966), contending standing orders bind all workmen whether employed before or after certification.",
      "type": "procedural",
      "date": "1966",
      "source": "petitioner"
    },
    {
      "id": "f20",
      "text": "Single judge of High Court, following Guest Keen Williams, held provision does not bind pre-standing order employee, dismissed writ but modified relief to salary till age 58 as he had attained 58.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the provision in the standing orders regarding the age of retirement binds workmen employed prior to the coming into force of the standing orders.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the second respondent can support the reinstatement direction on the ground that the award raised retirement age to 58 for all workmen, binding under Section 18(3) of Industrial Disputes Act.",
      "framed_by": "respondent"
    },
    {
      "id": "i3",
      "text": "Whether the award has retrospective effect to benefit the second respondent who retired before the award became enforceable.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Standing orders bind all workmen in the establishment whether employed before or after framing and certification; retirement at 55 was proper.",
      "supporting_facts": [
        "f6",
        "f8",
        "f16"
      ],
      "legal_basis": "Industrial Employment (Standing Orders) Act, 1946"
    },
    {
      "id": "pa2",
      "text": "Only issue before Tribunal was whether standing orders bound pre-employed worker; cannot enlarge scope to other grounds. Award not retrospective; second respondent ceased to be workman before award operative under Section 17A.",
      "supporting_facts": [
        "f14",
        "f18",
        "f19"
      ],
      "legal_basis": "Industrial Disputes Act, 1947 Sections 17A, 18(3)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Second respondent appointed in 1946 when no age fixed, not bound by 1952 or 1961 standing orders provision for age 55.",
      "supporting_facts": [
        "f5",
        "f6",
        "f8",
        "f17"
      ],
      "legal_basis": "Guest Keen Williams Private Ltd. v. P. J. Sterling"
    },
    {
      "id": "ra2",
      "text": "Even if standing orders bind, award raised age to 58 binding on all employed on date of dispute under Section 18(3)(d); reinstatement justified as retirement before 58 invalid.",
      "supporting_facts": [
        "f10",
        "f15",
        "f18"
      ],
      "legal_basis": "Industrial Disputes Act, 1947 Section 18(3)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "View of High Court that standing orders retirement age provision does not bind pre-employed workmen cannot stand in light of decisions in Agra Electric Supply Co. Ltd. v. Shri Alladin, Salem Erode Electricity Distribution Co. Ltd. v. Employees Union, and United Provinces Electric Supply Co. Ltd. v. T. N. Chatterjee.",
      "addresses_issue": "i1",
      "key_observation": "High Court erred in following Guest Keen Williams; standing orders bind all workmen."
    },
    {
      "id": "cr2",
      "text": "Not necessary to decide if award's enhanced age benefits second respondent retrospectively, as Tribunal ordered reinstatement solely on ground that standing orders did not bind him (per Guest Keen), not on enhanced age ground.",
      "addresses_issue": "i2",
      "key_observation": "Second respondent did not support award on enhanced age in counter-affidavit; new plea not allowed."
    },
    {
      "id": "cr3",
      "text": "Only question raised and considered was binding nature of standing orders on pre-employed; cannot enlarge controversy.",
      "addresses_issue": "i3",
      "key_observation": "Award operative post-retirement; no retrospective benefit claimed originally."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Provisions in certified standing orders regarding age of retirement bind all workmen, including those employed prior to certification.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Reinstatement direction cannot be sustained on alternative ground of enhanced retirement age under award, as not basis of Tribunal's decision and new plea not permitted.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Guest Keen Williams Private Ltd. v. P. J. Sterling and others",
      "citation": "1960 1 S.C.R. 348",
      "treatment": "distinguished",
      "relevance": "High Court followed it to hold standing orders do not bind pre-employed; SC holds view cannot stand."
    },
    {
      "case_name": "Agra Electric Supply Co. Ltd. v. Shri Alladin and others",
      "citation": "1970 1 S.C.R. 808",
      "treatment": "followed",
      "relevance": "Standing orders bind pre-employed workmen."
    },
    {
      "case_name": "Salem Erode Electricity Distribution Company Ltd. v. Salem Erode Electricity Distribution Co. Ltd. Employees Union",
      "citation": "1966 2 S.C.R. 498",
      "treatment": "followed",
      "relevance": "Standing orders bind pre-employed workmen."
    },
    {
      "case_name": "United Provinces Electric Supply Co. Ltd., Allahabad v. T. N. Chatterjee and others",
      "citation": "Civil Appeal No. 1734 of 1967, decided on 13-3-1972",
      "treatment": "followed",
      "relevance": "Standing orders bind pre-employed workmen."
    }
  ],
  "statutes_cited": [
    {
      "name": "Industrial Employment (Standing Orders) Act, 1946",
      "sections": [
        "Entire Act"
      ],
      "relevance": "Governs introduction and binding nature of standing orders fixing retirement age at 55."
    },
    {
      "name": "Industrial Disputes Act, 1947",
      "sections": [
        "Section 18(3)",
        "Section 17A(1)",
        "Section 17A(4)",
        "Section 10A(3A)"
      ],
      "relevance": "Binding effect of award on parties including all workmen employed on date of dispute; enforceability and operation date of award."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 133(1)(c)"
      ],
      "relevance": "Certificate for appeal to Supreme Court."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Supreme Court holds High Court's view erroneous; standing orders bind pre-employed workmen. Rejects alternative support for reinstatement on enhanced age ground as new plea. Implies quashing of reinstatement direction.",
    "relief_granted": "Writ petition to quash reinstatement allowed implicitly",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The view of the High Court that the provision in the standing orders regarding retirement age cannot bind the workmen who were employed in the establishment prior to the coming into force of the standing orders cannot stand in the light of the decisions of this Court...",
      "speaker": "court",
      "significance": "Overrules High Court's reasoning on binding nature of standing orders."
    },
    {
      "text": "It is clear from the award that the Tribunal did not order the reinstatement of the 2nd respondent on the ground that he was entitled to the benefit of the enhanced retirement age conferred on all categories of workers...",
      "speaker": "court",
      "significance": "Explains why alternative argument rejected; sticks to original grounds."
    }
  ],
  "_case_id": "1972_250",
  "_label": 1,
  "_text_length": 13039,
  "_extracted_at": "2026-02-10T20:09:07.593894"
}