{
  "metadata": {
    "case_name": "Appellant v. State of Bihar",
    "case_year": 1969,
    "court": "Supreme Court of India",
    "judges": [
      "Mathew, J."
    ],
    "case_number": "Criminal Appeal No. 33 of 1969",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "One Ramnagina Rai filed a complaint before the Sub-Divisional Officer, Sadar, Chapra, against Bishundeo Rai, Sheo Deo Prasad Rai, Mohan Rai, Jangli Rai and the appellant stating that they entered into a conspiracy and forged a Zerpeshgi deed on 25-1-1964 purporting to be executed by Bishundeo Rai and Nageshwar Rai in favour of Jangli Rai in which Sheo Deo Prasad Rai falsely personated Nageshwar Rai.",
      "type": "background",
      "date": "1964-01-25",
      "source": "petitioner"
    },
    {
      "id": "f2",
      "text": "The Sessions Court, to which the case was committed, after trial, came to the conclusion that Sheo Deo Prasad Rai, posing as Nageshwar, son of Bujhawan, executed the Zerpeshgi deed and that Sheo Deo Prasad Rai falsely personated as Nageshwar before the Sub-Registrar, that no such person as Nageshwar existed and that Bishundeo Rai, the father of Sheo Deo Prasad Rai and co-executant of the document was a party to the forgery.",
      "type": "disputed",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f3",
      "text": "The Sessions Court convicted Bishundeo Rai and Sheo Deo Prasad Rai of offences under section 467 and section 120B of the Indian Penal Code. Bishundeo and Sheo Deo Prasad were also convicted under section 82(d) and 82(c) respectively of the Act. The remaining three accused were given the benefit of doubt and acquitted.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f4",
      "text": "Two appeals were filed from this judgment to the High Court, namely, Criminal Appeal No. 205/1966 and Criminal Appeal No. 58/1966. Criminal Appeal No. 58/1966 was filed by the complainant against the acquittal of the appellant.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "In Criminal Appeal No. 58/1966, the Patna High Court set aside the acquittal of the appellant by the Additional Sessions Judge of Chapra and convicted him under section 82(d) of the Indian Registration Act for abetment of an offence under s.82 as there was clear evidence that it was he who identified Sheo Deo Prasad Rai as Nageshwar, son of Bujhawan, before the Sub-Registrar.",
      "type": "material",
      "date": "1968-11-12",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The High Court overruled the appellant's contention that the complaint was not maintainable without the permission as required by section 83 of the Act.",
      "type": "procedural",
      "date": "1968-11-12",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the complaint was competent as it was filed by a private person without obtaining the necessary permission under section 83 of the Indian Registration Act, and therefore the conviction was bad and must be set aside.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether section 83 of the Indian Registration Act is prohibitory in character, precluding a private person from commencing a prosecution without permission when the offence comes to the knowledge of a registering officer in his official capacity.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The complaint was incompetent as it was filed by a person without obtaining the necessary permission under section 83 of the Act and, therefore, the conviction was bad and must be set aside.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": "Section 83 of the Indian Registration Act"
    },
    {
      "id": "pa2",
      "text": "Section 83 of the Act is prohibitory in character.",
      "supporting_facts": [],
      "legal_basis": "K. M. Kanavi v. State of Mysore"
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Section 83 of the Act provides that a prosecution for any offence under this Act coming to the knowledge of a registering officer in his official capacity may be commenced by or with the permission of the Inspector General, the Registrar or the Sub-Registrar. It deals only with prosecution for an offence under the Act coming to the knowledge of the Registering Officer in his official capacity and is permissive/enabling, not prohibitory. It has no application to cases where offences are committed under the Act but do not come to the knowledge of the Registering Officer in his official capacity. Even where it does come to knowledge, it does not preclude a private person from commencing a prosecution.",
      "addresses_issue": "i1",
      "key_observation": "The section is an enabling one. It enables the persons mentioned therein to commence a prosecution in cases where the commission of the offence under the Act comes to the knowledge of the Registering Officer in his official capacity."
    },
    {
      "id": "cr2",
      "text": "The decisions in Gopinath v. Kuldip Singh, Re Piranu Nadathi, Emperor v. Yesa Nath Bidwagh lay down the correct law that section 83 is not prohibitory.",
      "addresses_issue": "i2",
      "key_observation": "Views in Nge Pan Gaing v. King Emperor and Emperor v. Mohd. Mehdi that section 83 is mandatory/prohibitory are inadmissible."
    },
    {
      "id": "cr3",
      "text": "If authorities collude or fail to prosecute, there should not be a total bar to private prosecution. A construction prohibiting private prosecution is not warranted by the plain language.",
      "addresses_issue": "i2",
      "key_observation": "Private persons are seriously injured by such offences and should not be denied liberty to prosecute."
    },
    {
      "id": "cr4",
      "text": "Language in sections like 195(1) CrPC, 70(1) Stamp Act, 29 Arms Act is prohibitory, unlike section 83(1) Registration Act.",
      "addresses_issue": "i2",
      "key_observation": "Section 83 is not prohibitory either in terms or intention."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Section 83 of the Indian Registration Act is enabling and permissive, not prohibitory. A private person can commence prosecution for offences under the Act without permission under section 83, especially where the offence does not come to the knowledge of the registering officer in official capacity.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "The complaint filed by Ramnagina Rai was competent, and the conviction under section 82(d) is valid.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Gopinath v. Kuldip Singh and others",
      "citation": "I.L.R. Calcutta Series, Vol. XI, 566",
      "treatment": "followed",
      "relevance": "Section 83 is not prohibitory; private person can prosecute without permission."
    },
    {
      "case_name": "Re Piranu Nadathi and others",
      "citation": "I.L.R. 40 Madras 880",
      "treatment": "followed",
      "relevance": "Section 83 is enabling; does not prohibit private prosecution."
    },
    {
      "case_name": "Emperor v. Yesa Nath Bidwagh and others",
      "citation": "A.I.R. 1937 Bombay 191",
      "treatment": "followed",
      "relevance": "Section 83 applies only when offence known to registering officer officially; enabling, not precluding private prosecution."
    },
    {
      "case_name": "Ganga Dibya and another v. Emperor",
      "citation": "A.I.R. 1943 Patna 227",
      "treatment": "followed",
      "relevance": "Same view as above."
    },
    {
      "case_name": "Habib Shah v. Mehda Shah",
      "citation": "A.I.R. 1960 J K 18",
      "treatment": "followed",
      "relevance": "Same view."
    },
    {
      "case_name": "Nge Pan Gaing and other v. King Emperor",
      "citation": "A.I.R. 1927 Rangoon 61",
      "treatment": "distinguished",
      "relevance": "Held 'may' means 'must'; rejected as incorrect."
    },
    {
      "case_name": "Emperor v. Mohd. Mehdi and others",
      "citation": "A.I.R. 1934 Allahabad 963",
      "treatment": "distinguished",
      "relevance": "Full Bench held mandatory; rejected."
    },
    {
      "case_name": "K. M. Kanavi v. State of Mysore",
      "citation": "1968 3 S.C.R. 821",
      "treatment": "distinguished",
      "relevance": "Different language; not applicable."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Registration Act",
      "sections": [
        "Section 81",
        "Section 82",
        "Section 82(a)",
        "Section 82(b)",
        "Section 82(c)",
        "Section 82(d)",
        "Section 83"
      ],
      "relevance": "Defines offences of incorrect registration (s.81), false statements/personation/abetment (s.82); s.83 governs prosecutions coming to knowledge of registering officers - held enabling."
    },
    {
      "name": "Indian Penal Code",
      "sections": [
        "Section 467",
        "Section 120B"
      ],
      "relevance": "Forgery and criminal conspiracy; convictions thereunder by Sessions Court."
    },
    {
      "name": "Code of Criminal Procedure",
      "sections": [
        "Section 195(1)"
      ],
      "relevance": "Contrasted as prohibitory language unlike Registration Act s.83."
    },
    {
      "name": "Indian Stamp Act",
      "sections": [
        "Section 70(1)"
      ],
      "relevance": "Contrasted as prohibitory."
    },
    {
      "name": "Indian Arms Act, 1878",
      "sections": [
        "Section 29"
      ],
      "relevance": "Contrasted as prohibitory."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court dismissed the appeal by special leave against the Patna High Court's judgment convicting the appellant under section 82(d) of the Indian Registration Act, holding that the private complaint was maintainable without permission under section 83 as the section is enabling and not prohibitory.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The section is not prohibitory in that it does not preclude a private person from commencing a prosecution. Even in a case where the commission of an offence comes to the knowledge of the Registering Officer in his official capacity, the section does not prohibit a private person from commencing a prosecution as the section is clearly permissive in its language and intent.",
      "speaker": "court",
      "significance": "Core holding on interpretation of section 83."
    },
    {
      "text": "Seeing that a private person will be more seriously injured by the action of an offender who not only forges a document but endeavors to give it a higher efficacy by registering it, we can perceive no reason why the private person should be denied the liberty to prosecute the offender.",
      "speaker": "court",
      "significance": "Policy rationale supporting private prosecutions."
    }
  ],
  "_case_id": "1972_31",
  "_label": 0,
  "_text_length": 12241,
  "_extracted_at": "2026-02-10T20:07:27.020417"
}