{
  "metadata": {
    "case_name": "Appellant v. First Respondent",
    "case_year": 1967,
    "court": "Supreme Court of India",
    "judges": [
      "Mathew, J."
    ],
    "case_number": "Civil Appeal No. 1204 of 1967",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The first respondent was a combatant Clerk in the Indian Army for a period of more than 14 years.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The first respondent was discharged from the Army on 9th June, 1953.",
      "type": "background",
      "date": "1953-06-09",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On 2nd July 1953, the first respondent was re-employed as an ordinary clerk on the pay scale of Rs. 55-85EB-4-125-5-130.",
      "type": "background",
      "date": "1953-07-02",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "His pay was re-fixed in the above scale at Rs. 70/- plus a personal pay of Rs. 2.50 by an Order dated 28th October, 1958, with effect from the date of re-employment, i.e., 2-7-1953.",
      "type": "procedural",
      "date": "1958-10-28",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "On 15th July, 1960, the Government of India, Ministry of Defence, issued Office Memorandum No. 2 54 58/5801/D Civil providing benefits to ex-military personnel on re-employment by adding increments equal to the total number of completed years of military service to the bottom of their scales.",
      "type": "background",
      "date": "1960-07-15",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The Order applies to re-employment on or after 25-11-58; past cases will not be reopened. Exception for pensioners in service on date of issue, re-employed prior to 25-11-1958 for unspecified period or extending beyond issue date, subject to option exercised in writing within three months.",
      "type": "material",
      "date": "1958-11-25",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "The first respondent claimed benefit of the Order; claim rejected by Government.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "First respondent filed Writ Petition No. 885 of 1964 in Mysore High Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Mysore High Court by order dated 9th September, 1966 allowed the writ petition and directed respondent No. 2 to refix pay of respondent No. 1 at Rs. 89/- as from 2-7-1953 with consequential adjustments.",
      "type": "procedural",
      "date": "1966-09-09",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "The first respondent exercised the option to be brought under the provisions of the Order.",
      "type": "admitted",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the first respondent is entitled to the benefit of the Office Memorandum as his re-employment was prior to 25-11-1958 but falls under the exception for exercising option.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the Office Memorandum, being an administrative order, confers a justiciable right enforceable by writ of mandamus.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether the pay fixation should be with retrospective effect from 2-7-1953.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The Order is not applicable to the first respondent as he was re-employed before 25-11-1958 and his pay had already been fixed; past cases cannot be reopened.",
      "supporting_facts": [
        "f3",
        "f4",
        "f6"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "The Order being an administrative direction confers no justiciable right enforceable by mandamus.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "The Order is not retrospective; pay should not be fixed from 2-7-1953.",
      "supporting_facts": [
        "f5",
        "f9"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The first respondent answers the description for the benefit as re-employed prior to 25-11-1958 for unspecified period, exercised option under clause 3 of para 3 and clause 4.",
      "supporting_facts": [
        "f3",
        "f6",
        "f10"
      ],
      "legal_basis": "Office Memorandum paras 3 and 4"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Para 3 first sentence applies to re-employment on/after 25-11-58; past cases not reopened is general rule, but clause 3 of para 3 creates exception for re-employed prior for unspecified period/extending beyond, with option; first respondent fits and exercised option.",
      "addresses_issue": "i1",
      "key_observation": "The contention of the first respondent is well founded."
    },
    {
      "id": "cr2",
      "text": "Administrative orders can confer rights and impose duties enforceable by courts; cites Sant Ram Sharma (Govt can supplement rules under Art.309) and Indo Afghan (courts compel performance of schemes); Order conferred right to pay fixation as part of conditions of service.",
      "addresses_issue": "i2",
      "key_observation": "We see no reason why the Court should not enforce that right."
    },
    {
      "id": "cr3",
      "text": "The Order is not retrospective; High Court wrong in directing fixation from 2-7-1953; direct fixation from date of the Order.",
      "addresses_issue": "i3",
      "key_observation": "The direction could only be to fix the pay with effect from the date of the Order."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "First respondent entitled to benefit of the Order as exception applies.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Administrative Order confers justiciable right to pay fixation enforceable by mandamus.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Pay to be fixed with effect from date of the Order, not retrospectively from 2-7-1953.",
      "resolves_issue": "i3",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Sant Ram Sharma v. State of Rajasthan and Another",
      "citation": "1968 1 S.C.R. 111",
      "treatment": "followed",
      "relevance": "Government can fill gaps and supplement rules under Art. 309 by instructions not inconsistent with framed rules."
    },
    {
      "case_name": "Union of India and Others v. M/s. Indo Afghan Agencies Ltd.",
      "citation": "1968 2 S.C.R. 366, 377",
      "treatment": "followed",
      "relevance": "Courts can compel performance of obligations imposed by executive schemes like Import Trade Policy."
    }
  ],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Article 309"
      ],
      "relevance": "Rules framed under it can be supplemented by Government instructions where silent."
    }
  ],
  "outcome": {
    "disposition": "partially_accepted",
    "summary": "Appeal by special leave allowed in part; High Court right that first respondent entitled to Order's benefit and enforceable by mandamus, but wrong on retrospective effect; second respondent directed to fix pay in accordance with Order with effect from date of Order.",
    "relief_granted": "Pay fixation of first respondent as per Office Memorandum with effect from date of Order, consequential adjustments and payments.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "We think that the contention of the first respondent is well founded.",
      "speaker": "court",
      "significance": "Court accepts respondent's interpretation of Order's exception."
    },
    {
      "text": "To say that an administrative order can never confer any right would be too wide a proposition.",
      "speaker": "court",
      "significance": "Establishes justiciability of administrative orders conferring rights."
    },
    {
      "text": "The Order conferred upon the first respondent the right to have his pay fixed in the manner specified in the Order and that was part of the conditions of his service.",
      "speaker": "court",
      "significance": "Holds Order creates enforceable service condition."
    }
  ],
  "_case_id": "1972_411",
  "_label": 0,
  "_text_length": 8987,
  "_extracted_at": "2026-02-10T20:09:41.780759"
}