{
  "metadata": {
    "case_name": "Municipal Board of Rampur & Ors. v. Plaintiff",
    "case_year": 1967,
    "court": "Supreme Court of India",
    "judges": [
      "Beg, J."
    ],
    "case_number": "Civil Appeal No. 279 of 1967",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Government of Rampur gave plaintiff a house under orders of His Highness the Nawab of Rampur passed on 23rd June 1945.",
      "type": "material",
      "date": "1945-06-23",
      "source": "petitioner"
    },
    {
      "id": "f2",
      "text": "Merger of Rampur State in Uttar Pradesh in 1949, Rampur became a district of Uttar Pradesh.",
      "type": "background",
      "date": "1949",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "After merger, house given by Government of Uttar Pradesh to Municipal Board of Rampur, defendant-appellant.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Municipal Board demanded rent from plaintiff by notice.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f5",
      "text": "On plaintiff's refusal to pay rent, house attached on 23rd February 1955.",
      "type": "procedural",
      "date": "1955-02-23",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Plaintiff deposited Rs. 100 under protest.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "Plaintiff filed suit on 26-10-1956 for declaration of ownership in possession of house, or alternatively licensee entitled to remain for life without rent.",
      "type": "procedural",
      "date": "1956-10-26",
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "Defendants (State of UP, Municipal Board, PWD Rampur) denied gift of ownership or life-interest.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f9",
      "text": "Defendants pleaded no landlord-tenant relationship; permission to reside valid only during service of former ruler.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f10",
      "text": "Defendants claimed damages for use and occupation as rent Rs. 10 per month from 1-4-1953 to 30-1-1954.",
      "type": "disputed",
      "date": "1953-04-01 to 1954-01-30",
      "source": "respondent"
    },
    {
      "id": "f11",
      "text": "Plaintiff's licence, if any, terminated on merger of Rampur with UP.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f12",
      "text": "Alleged gift not governed by Mahomedan law upheld as no registered deed for house value exceeding Rs. 100.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f13",
      "text": "Trial court and first appellate court found plaintiff failed to prove claims after examining evidence including order dated 23-6-1945 (Ex.1), letter 30-6-1949 (Ex.A-10), oral evidence.",
      "type": "admitted",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "Allahabad High Court in Second Appeal No. 222 of 1960 on 15-9-1966 reversed lower courts, held order of Nawab dated 23-6-1945 valid gift under Mahomedan law conferring ownership.",
      "type": "procedural",
      "date": "1966-09-15",
      "source": "lower_court"
    },
    {
      "id": "f15",
      "text": "Order Ex.1 in Urdu: 'Ap ki sakunat ke waste Abdul Karim Sabib wala makan atta farmaya gaya hai. Ap aj hi us me muntaquil ho jayen Ap un se mil kar inteqal niaka.1 ki karrawai kariye.' Translated as information to vacate current house and shift to Abdul Karim wala house for residence.",
      "type": "material",
      "date": "1945-06-23",
      "source": "court"
    },
    {
      "id": "f16",
      "text": "Plaintiff described as Nigran Shikar Mahi or Supervisor of Fishing.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f17",
      "text": "Agha Khan, Assistant Military Secretary, signed and sent communication Ex.1; deposed Nawab gave oral order to vacate private house and allot government house; house belonged to Government of Rampur; previous occupant mechanic occupied rent-free with permission.",
      "type": "admitted",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f18",
      "text": "No mutation in municipal records showing transfer of ownership.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f19",
      "text": "Plaintiff in evidence stated gift in lieu of old services, but not mentioned in plaint; took alternative case of life interest.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the alleged gift is governed by Mahomedan Law",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the requirements of Mahomedan law for establishing a gift of the house or of its usufruct for life to the plaintiff could be held to have been satisfied",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether anything beyond the order of 23-6-1945 could be looked into to determine the Nawab's intention",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "No gift of ownership or life-interest; only permission to reside valid during service of former ruler; licence terminated on merger.",
      "supporting_facts": [
        "f8",
        "f9",
        "f10",
        "f11"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Gift not valid under Mahomedan law as no registered deed for house value exceeding Rs.100.",
      "supporting_facts": [
        "f12"
      ],
      "legal_basis": "Mahomedan law"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Order dated 23-6-1945 constitutes valid declaration of gift by owner, conferring ownership under Mahomedan law; words 'inteqal' and 'atta' determine intent conclusively; nothing beyond order to be considered.",
      "supporting_facts": [
        "f1",
        "f14",
        "f15"
      ],
      "legal_basis": "Mahomedan law"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Plaintiff acquired right from Government of Rampur State under Nawab's orders; house belonged to Government, not Nawab's private property.",
      "addresses_issue": "i1",
      "key_observation": "Presumption of Mahomedan law applies only to private property."
    },
    {
      "id": "cr2",
      "text": "Order Ex.1 is mere information to shift residence, not declaration of gift; words 'inteqal' and 'atta' mean physical transfer of residence for residential purpose, not ownership; no 'hibba' or life estate words; document to be read as whole.",
      "addresses_issue": "i2",
      "key_observation": "Lacks clear declaration of what is gifted."
    },
    {
      "id": "cr3",
      "text": "Oral and other evidence admissible under Proviso 6 to Sec.92 Evidence Act to resolve latent ambiguity; evidence shows only licence like previous occupant.",
      "addresses_issue": "i3",
      "key_observation": "Evidence consistent with temporary accommodation, not gift."
    },
    {
      "id": "cr4",
      "text": "No need for detailed Mahomedan law discussion; first condition of declaration lacking; transaction is revocable licence (areeat).",
      "addresses_issue": "i2",
      "key_observation": "Plaintiff failed to prove grant of corpus or usufruct."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "No valid gift under Mahomedan law; only revocable licence to reside.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Requirements of Mahomedan law not satisfied; lacks declaration of gift.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h3",
      "text": "Evidence beyond document admissible to determine intention.",
      "resolves_issue": "i3",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Amjad Khan v. Ashraf Khan",
      "citation": null,
      "treatment": "referred",
      "relevance": "Distinction between gifts of corpus and usufruct under Mahomedan law"
    },
    {
      "case_name": "Nawazish Ali Khan v. Ali Raza Khan",
      "citation": null,
      "treatment": "referred",
      "relevance": "Distinction between gifts of corpus and usufruct under Mahomedan law"
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Evidence Act",
      "sections": [
        "Section 92 Proviso 6"
      ],
      "relevance": "Admits oral evidence to resolve latent ambiguity in document"
    },
    {
      "name": "Mahomedan Law",
      "sections": [],
      "relevance": "Governs gifts; requires declaration, acceptance, delivery; distinguishes corpus/usufuct, licence (areeat)"
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Supreme Court allowed the appeal by special leave, set aside Allahabad High Court judgment, restored findings of courts below that plaintiff failed to prove ownership or life interest, holding only revocable licence granted.",
    "relief_granted": "Appeal allowed; declaration of ownership or life licence denied to plaintiff.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "'His Highness has passed orders that you should immediately vacate the house in which you reside and pay up to the landlord all his dues. Abdul Karim wala house has been given to you for your residential purpose. You should shift to that house this very day.'",
      "speaker": "court",
      "significance": "Translation of Ex.1 showing no intent to gift ownership"
    },
    {
      "text": "The transaction before us would amount to nothing more than the grant of a license, revocable at the Grantors option to reside in the house so long as the grantor allowed the licensee to do so. Such a grant is known as areeat in Mahomedan law.",
      "speaker": "court",
      "significance": "Core holding on nature of grant"
    },
    {
      "id": "kq3",
      "text": "'a declaration must indicate, with reasonable clarity, what is really gifted.'",
      "speaker": "court",
      "significance": "Essential condition of gift under Mahomedan law lacking"
    }
  ],
  "_case_id": "1972_98",
  "_label": 1,
  "_text_length": 12156,
  "_extracted_at": "2026-02-10T20:07:24.789869"
}