{
  "metadata": {
    "case_name": "British India Corporation Ltd. v. Commissioner of Excess Profits Tax",
    "case_year": 1969,
    "court": "Supreme Court of India",
    "judges": [
      "Jaganmohan Reddy, J."
    ],
    "case_number": "Civil Appeal Nos. 1987 to 1988 of 1969",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The assessee is a public limited company having several branches and subsidiary companies. It has a Board of Directors which looks after its business. The branches are looked after by managers who are members of the Board of Directors.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "For a long time and even before the Excess Profits Tax Act came into force, the company has been remunerating its directors including the Managing Director and branch managers by way of commission based on a certain fixed percentage of its net audited profits. This commission was in addition to the directors fees and or stipulated monthly salary.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "In the case of a branch manager the amount of commission to be paid was calculated on the profits of the branch of which he was in charge. In the case of others the profits made by the Corporation as a whole were taken into consideration.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The commission to be paid was either fixed at the time of appointment or by resolution passed subsequently.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The two chargeable accounting periods are January 1, 1945 to December 31, 1945 and January 1, 1946 to March 31, 1946.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Resolution dated February 24, 1940: Commission on profits would be payable to the Managing Director and the Branch Managers entitled thereto, on net audited profits, only after depreciation had been allowed for but prior to any allocation or appropriation of such profits including provision for taxation.",
      "type": "material",
      "date": "1940-02-24",
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "Excess Profits Tax Bill introduced on January 27, 1940, passed and assented on April 5, 1940.",
      "type": "background",
      "date": "1940-01-27",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Resolution dated July 27, 1940: The words 'including provision for taxation' were intended to and did specifically cover all forms of taxation including the Excess Profits Tax and other like impositions and, therefore, no deduction of excess profits tax and other like impositions from the audited profits should be made prior to the calculation of Managerial commissions. This ruling to have effect retrospectively to the commission paid in respect of the year 1939.",
      "type": "material",
      "date": "1940-07-27",
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "Excess Profits Tax Officer order dated December 15, 1947 for period ending December 31, 1945: Held that commission allowed to the management and directors is both unreasonable and unnecessary. Any payment in excess of the agreed proportion of the net profits after deduction of Excess Profits Tax is not justified. Disallowed Rs. 11,47,143 for first period and Rs. 11,06,693 for second, but specifically Rs. 5,39,057 and Rs. 1,28,743 attributable to excess profits.",
      "type": "procedural",
      "date": "1947-12-15",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "For first chargeable period, excess profits payable approximately Rs. 64,36,000 out of net audited profits of Rs. 1.37 crores. Portion disallowed at 8.4% of excess profits: Rs. 5,39,057. For second period: Rs. 1,28,743.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Commission of this nature paid even before Act came into force and allowed in entirety under s.10 of Income-tax Act, 1922.",
      "type": "admitted",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f12",
      "text": "EPT Officer ignored terms of appointment and resolutions, drew support from Tribunal orders for prior periods 1943 and 1944.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Before Tribunal, admitted no new material other than records from 1943-1944 periods. Tribunal dismissed appeals following earlier decisions.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f14",
      "text": "Allahabad High Court judgment dated October 22, 1965 in Income-tax Reference No. 154 of 1957 answered both questions in affirmative.",
      "type": "procedural",
      "date": "1965-10-22",
      "source": "lower_court"
    },
    {
      "id": "f15",
      "text": "Earlier Allahabad HC in British India Corporation Ltd. v. Commr. of E.P.T. (33 ITR 826) by Bhargava and Mehrotra JJ. held disallowance not justified, following Full Bench in Shyamlal Pragnarain v. I.T. (27 ITR 404).",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether on the facts and circumstances of this case the amount of Rs. 5,39,057/- was rightly disallowed under rule 12(1) of the Schedule to the Excess Profits Tax Act?",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether on the facts and circumstances of this case the amount of Rs. 1,28,743/- was rightly disallowed under rule 12(1) of Schedule I to the Excess Profits Tax Act?",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Commission was being paid even before the Act came into force and allowed in entirety under s.10 of Income-tax Act in corresponding assessments.",
      "supporting_facts": [
        "f2",
        "f11"
      ],
      "legal_basis": "s.10 Income-tax Act, 1922; resolutions dated 1940"
    },
    {
      "id": "pa2",
      "text": "Payments per terms of appointment and resolutions; prior practice indicates commission without deducting EPT.",
      "supporting_facts": [
        "f6",
        "f8"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Commission unreasonable and unnecessary having regard to requirements of business and actual services rendered; portion attributable to excess profits payable to State due to war conditions not justified.",
      "supporting_facts": [
        "f9",
        "f10"
      ],
      "legal_basis": "Rule 12(1) Schedule I, Excess Profits Tax Act, 1940"
    },
    {
      "id": "ra2",
      "text": "Huge profits due to war, not management activity; employee benefits more from national emergency than employer.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Rule 12(1) designed to prevent dissipation of excess profits by inflating expenditure not related to business requirements. Test is whether expenditure unreasonable and unnecessary having regard to business requirements and actual services rendered.",
      "addresses_issue": "i1",
      "key_observation": "No reference in rule to commercial expediency, but all relevant factors including commercial principles to be considered."
    },
    {
      "id": "cr2",
      "text": "EPT Officer gave reasons in prior orders (incorporated by reference) that commissions fixed pre-war, no deduction for EPT, profits rose due to war from Rs.10 lakhs to Rs.2 crores; payment on undistributable profits unreasonable.",
      "addresses_issue": "i2",
      "key_observation": "Commission on excess profits for which managers made no contribution ex facie unreasonable and unnecessary."
    },
    {
      "id": "cr3",
      "text": "Upholds EPT Officer and Tribunal findings; High Court observations on prior decisions not justified as those courts considered reasonableness and necessity per commercial practice.",
      "addresses_issue": "i1",
      "key_observation": "Material existed for findings as in Ahmedabad Manufacturing case."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Amounts of Rs. 5,39,057 and Rs. 1,28,743 rightly disallowed under Rule 12(1) as unreasonable and unnecessary.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Same for second amount.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "British India Corporation Ltd. v. Commr. of E.P.T.",
      "citation": "33 I.T.R. 826",
      "treatment": "followed",
      "relevance": "Allahabad HC held disallowance not justified, considered reasonableness per commercial practice."
    },
    {
      "case_name": "Shyamlal Pragnarain v. I.T.",
      "citation": "27 I.T.R. 404",
      "treatment": "followed",
      "relevance": "Full Bench: Reasonableness/necessity judged by business requirements, commercial practice, not just contract terms."
    },
    {
      "case_name": "Ahmedabad Manufacturing Calico Printing Co. v. Commr. of E.P.T.",
      "citation": null,
      "treatment": "followed",
      "relevance": "SC upheld disallowance of bonus/contributions calculated pre-EPT deduction; material for findings sufficient."
    },
    {
      "case_name": "Walchand Co. Ltd. v. Hindustan Construction Co. Ltd.",
      "citation": "12 I.T.R. 104",
      "treatment": "referred",
      "relevance": "EPT Officer drew analogy on benefiting from national emergency."
    }
  ],
  "statutes_cited": [
    {
      "name": "Excess Profits Tax Act, 1940",
      "sections": [
        "Rule 12(1) Schedule I",
        "s.21"
      ],
      "relevance": "Disallowance if expenses unreasonable/unnecessary for business requirements and services rendered."
    },
    {
      "name": "Indian Income-tax Act, 1922",
      "sections": [
        "s.10",
        "s.66(2)"
      ],
      "relevance": "Commission allowed under s.10; reference procedure."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court dismissed the appeals by certificate from Allahabad High Court judgment dated October 22, 1965, upholding disallowance of portions of managerial commission under Rule 12(1) as unreasonable and unnecessary.",
    "relief_granted": null,
    "costs": "with costs"
  },
  "key_quotes": [
    {
      "text": "\"In computing the profits of any chargeable accounting period no deduction shall be allowed in respect of expenses in excess of the amount which the Excess Profits Tax Officer considers reasonable and necessary having regard to the requirements of the business...\"",
      "speaker": "court",
      "significance": "Quotes Rule 12(1) central to the decision."
    },
    {
      "text": "\"Any commission paid on the excess profits for which the managers or employees made no sort of contribution would ex facie be unreasonable and unnecessary...\"",
      "speaker": "court",
      "significance": "Crux of upholding disallowance due to war profits."
    }
  ],
  "_case_id": "1972_420",
  "_label": 0,
  "_text_length": 18639,
  "_extracted_at": "2026-02-10T20:09:41.897047"
}