{
  "metadata": {
    "case_name": "Gudar Dusadh v. State",
    "case_year": 1969,
    "court": "Supreme Court of India",
    "judges": [
      "Khanna, J."
    ],
    "case_number": "Criminal Appeal No. 94 of 1969",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "A day before the occurrence, Prasadi Dusadh and Ganesh Dusadh killed a goat belonging to Baharan Bhagat PW 8. On the advice of Ramlal Bhagat deceased, Baharan Bhagat lodged a report with the police at 3 p.m. on that day.",
      "type": "background",
      "date": "1965-08-13",
      "source": "prosecution"
    },
    {
      "id": "f2",
      "text": "On the morning of August 14, 1965, Ramlal and his son Ramashish went to their paddy field. While they were returning from the field at about 11 a.m., they were assaulted by the six convicted persons who had been hiding on the route.",
      "type": "material",
      "date": "1965-08-14",
      "source": "prosecution"
    },
    {
      "id": "f3",
      "text": "The appellant gave a lathi blow on the head of Ramlal as a result of which the latter fell down and died at the spot.",
      "type": "material",
      "date": "1965-08-14",
      "source": "prosecution"
    },
    {
      "id": "f4",
      "text": "One of the companions of the appellant then shouted that the assault was made because of Ramlal being responsible for the commencement of criminal proceedings by Baharan.",
      "type": "material",
      "date": "1965-08-14",
      "source": "prosecution"
    },
    {
      "id": "f5",
      "text": "Some injuries were also caused to Ramashish PW 10.",
      "type": "material",
      "date": "1965-08-14",
      "source": "prosecution"
    },
    {
      "id": "f6",
      "text": "The accused then set fire to one of their huts with a view to prepare some kind of defence. After that the accused fled away.",
      "type": "material",
      "date": "1965-08-14",
      "source": "prosecution"
    },
    {
      "id": "f7",
      "text": "SHO Sarju Prasad Singh of police station Barauli on receipt of information that a large number of persons belonging to the party of the accused had collected to attack the other party in spite of the promulgation of an order under section 144 CrPC, came to the place of occurrence but before that Ramlal had already been killed. Sarju Prasad Singh recorded the statement of Ramashish and on the basis of that statement, a formal information report was prepared at the police station.",
      "type": "procedural",
      "date": "1965-08-14",
      "source": "prosecution"
    },
    {
      "id": "f8",
      "text": "Post mortem examination on the body of Ramlal deceased was performed by Dr. R. S. Singh on August 15, 1965. The doctor found a lacerated wound 2x1/2 bone deep on the left side of the head of the deceased. The injury was ante-mortem and had been caused by a weapon like lathi. On dissection the doctor found 3 long fracture of the left parietal bone about 2 1/2 from the middle line of the top of the head. On removing the skull the doctor noticed large amount of blood and blood clots on the left side of the brain. Death, in the opinion of the doctor, was due to compression on the left side of the brain. The doctor further stated that the above injury was sufficient in the ordinary course of nature to cause death.",
      "type": "material",
      "date": "1965-08-15",
      "source": "prosecution"
    },
    {
      "id": "f9",
      "text": "Gudar Dusadh appellant was tried along with 23 others in the court of Additional Sessions Judge Saran. Eighteen of the accused were acquitted by the trial court. The appellant was convicted under sections 302 and 147 Indian Penal Code and was sentenced to undergo imprisonment for life on the former count. No separate sentence was awarded to the appellant for the offence under section 147 Indian Penal Code. The remaining five accused were convicted under section 323 read with section 149 Indian Penal Code as well as for other minor offences.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "On appeal the Patna High Court maintained the conviction and sentence of the appellant, while some modification was made as regards the sentence awarded to the other five convicted accused.",
      "type": "procedural",
      "date": "1968-01-30",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "At the trial the plea of the appellant was that he had been falsely involved in the case at the instance of the Mukhia of the village who was inimical to the appellant.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f12",
      "text": "The two courts below accepted the prosecution case that it was the appellant who had given a lathi blow on the head of Ramlal deceased as a result of which the latter died.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "The appellant along with his companions was lying in wait to attack Ramlal. There was no altercation or exchange of abuses between Ramlal and the accused party.",
      "type": "material",
      "date": "1965-08-14",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the offence committed by the appellant was murder or culpable homicide not amounting to murder.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The appellant had been falsely involved in the case at the instance of the Mukhia of the village who was inimical to the appellant.",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Reference made to the case of Chamru Budhwa v. State of Madhya Pradesh to argue that the case does not fall under clause 3rdly of section 300 IPC.",
      "supporting_facts": [],
      "legal_basis": "Chamru Budhwa v. State of Madhya Pradesh"
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The two courts below accepted the prosecution case that it was the appellant who had given a lathi blow on the head of Ramlal deceased as a result of which the latter died. It was held that the case against the appellant fell under clause 3rdly of section 300 of Indian Penal Code.",
      "addresses_issue": "i1",
      "key_observation": "Lower courts rightly convicted under section 302 IPC."
    },
    {
      "id": "cr2",
      "text": "The appellant who caused the above injury to Ramlal deceased, in our opinion, was guilty of the offence of murder and he has been rightly convicted under section 302 Indian Penal Code.",
      "addresses_issue": "i1",
      "key_observation": "Appellant and companions lying in wait; premeditated assault; blow on head caused instantaneous death."
    },
    {
      "id": "cr3",
      "text": "The fact that the appellant gave only one blow on the head would not mitigate the offence of the appellant and make him guilty of the offence of culpable homicide not amounting to murder. The blow on the head of Ramlal with lathi was plainly given with some force, and resulted in a 3 long fracture of the left parietal bone. Ramlal deceased died instantaneously.",
      "addresses_issue": "i1",
      "key_observation": "Single deliberate blow sufficient; no occasion for second blow."
    },
    {
      "id": "cr4",
      "text": "As the injury on the head was deliberate and not accidental and as the injury was sufficient in the ordinary course of nature to cause death, the case against the appellant would fall squarely within the ambit of clause 3rdly of section 300 Indian Penal Code.",
      "addresses_issue": "i1",
      "key_observation": "Intention to cause particular injury which was sufficient to cause death."
    },
    {
      "id": "cr5",
      "text": "Clause 3rdly consists of two parts. Under the first part, it has to be shown that there was an intention on the part of the accused to inflict the particular injury which was found on the body of the deceased. The second part requires that the bodily injury intended to be inflicted was sufficient in the ordinary course of nature to cause death.",
      "addresses_issue": "i1",
      "key_observation": "Both parts satisfied: injury not accidental, intended on head, medically sufficient to cause death."
    },
    {
      "id": "cr6",
      "text": "The above case [Chamru Budhwa] does not warrant the proposition that if the accused gives a deliberate blow on the head of the deceased with a lathi and thereby causes an injury as is sufficient in the ordinary course of nature to cause death and actually results in death, the case against him would not fall under clause 3rdly of section 300 of Indian Penal Code.",
      "addresses_issue": "i1",
      "key_observation": "Chamru Budhwa distinguished due to sudden fight in heat of passion; not applicable here as premeditated."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The appellant was guilty of the offence of murder under section 302 IPC as the case falls under clause 3rdly of section 300 IPC.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Chamru Budhwa v. State of Madhya Pradesh",
      "citation": null,
      "treatment": "distinguished",
      "relevance": "Distinguished because that case involved sudden fight in heat of passion without premeditation, unlike premeditated lying in wait here."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "302",
        "147",
        "323",
        "149",
        "300"
      ],
      "relevance": "Conviction under 302 and 147; others under 323/149; analysis under clause 3rdly of section 300 for murder vs culpable homicide not amounting to murder."
    },
    {
      "name": "Code of Criminal Procedure",
      "sections": [
        "144"
      ],
      "relevance": "Order under section 144 promulgated; accused collected in spite of it."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal by special leave, confined to the question whether the offence was murder or culpable homicide not amounting to murder, was dismissed as the Supreme Court held the appellant rightly convicted under section 302 IPC.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The appellant along with his companions was lying in wait to attack Ramlal and, according to the evidence on record which has been accepted by the High Court, he gave a blow on the head of Ramlal as a result of which Ramlal fell down and died instantaneously.",
      "speaker": "court",
      "significance": "Establishes premeditation and deliberate nature of assault."
    },
    {
      "text": "As the injury on the head was deliberate and not accidental and as the injury was sufficient in the ordinary course of nature to cause death, the case against the appellant would fall squarely within the ambit of clause 3rdly of section 300 Indian Penal Code.",
      "speaker": "court",
      "significance": "Core reasoning applying clause 3rdly of section 300 IPC."
    },
    {
      "text": "The fact that the appellant gave only one blow on the head would not mitigate the offence of the appellant and make him guilty of the offence of culpable homicide not amounting to murder.",
      "speaker": "court",
      "significance": "Rejects argument that single blow reduces culpability."
    }
  ],
  "_case_id": "1972_80",
  "_label": 0,
  "_text_length": 10319,
  "_extracted_at": "2026-02-10T20:07:23.998638"
}