{
  "metadata": {
    "case_name": "Income Tax Department v. Respondent Private Company",
    "case_year": 1969,
    "court": "Supreme Court of India",
    "judges": [
      "Jaganmohan Reddy, J."
    ],
    "case_number": "C. A. Nos. 1378 and 1379 of 1969",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The respondent is a private company to which sub-s. (1) of s.23-A of the Income-tax Act, 1922 would be attracted if it fulfilled the conditions prescribed therein.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Assessment years 1958-59 and 1959-60 for which the accounting years ended on 30th June 1957 and 30th June 1958 respectively.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The Income-tax Officer made orders under S. 23-A(1) dated October 31, 1961.",
      "type": "procedural",
      "date": "1961-10-31",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The company declared dividends of Rs. 15,000 at the general meeting held on December 17, 1959 and Rs. 90,000 on May 26, 1960 in respect of the relevant assessment years.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "These dividends were declared after the period of 12 months immediately following the expiry of the previous years but before the date on which the orders under S. 23-A(1) had been made by the Income-tax Officer.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Income-tax Officer rejected the contention that dividends declared before the order exempt the company from super-tax and included the dividends in assessing super-tax, with previous sanction of Inspecting Assistant Commissioner.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Appeal to Appellate Assistant Commissioner was unsuccessful.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Tribunal held that in computing undistributed balance, dividends actually distributed (even after 12 months but before order) should be deducted, and no time limit applicable; directed ITO to take Rs.15,000 and Rs.90,000 into account.",
      "type": "procedural",
      "date": null,
      "source": "tribunal"
    },
    {
      "id": "f9",
      "text": "Calcutta High Court in Income-tax Reference No. 17 of 1965 dated May 21, 1968 answered the question in affirmative against the department, following obiter in Moore Avenue Properties Private Ltd. v. C.I.T.",
      "type": "procedural",
      "date": "1968-05-21",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Appeal to Supreme Court by certificate.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether, on the facts and in the circumstances of the case, the Tribunal was right in holding that in the matter of calculation of undistributed balance of the total income of an assessee for the purpose of levy of super-tax in terms of S. 23-A(1) of the Income-tax Act, 1922, the Income-tax Officer should have taken into consideration dividend declared by the company after the period of 12 months immediately following the expiry of the previous years relevant to the assessment years 1958-59 and 1959-60 but before the date on which the orders under S. 23-A(1) had been made by the Income-tax Officer?",
      "framed_by": "tribunal"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The company had declared the dividends after the 12 months following the accounting year and hence the Income-tax Officer had, with the previous sanction of the Inspecting Assistant Commissioner, validly subjected the company to super-tax in terms of the latter part of s. 23-A(1).",
      "supporting_facts": [
        "f2",
        "f3",
        "f4",
        "f5"
      ],
      "legal_basis": "S. 23-A(1) of the Income-tax Act, 1922"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Once dividends were declared before an order is made under this section no super-tax can be levied in respect of those dividends.",
      "supporting_facts": [
        "f4",
        "f5"
      ],
      "legal_basis": "S. 23-A(1) of the Income-tax Act, 1922"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "S.23-A(1) enacted to deter private companies not distributing at least 60% of assessable income, subjecting undistributed balance to additional super-tax; object to prevent accumulation of profits to avoid shareholder super-tax.",
      "addresses_issue": "i1",
      "key_observation": "Provision applies to companies in which public not substantially interested."
    },
    {
      "id": "cr2",
      "text": "ITO gets jurisdiction if at time of order, company has not distributed statutory percentage within 12 months; but if dividend declared and paid before order (even after 12 months), ITO cannot levy super-tax on that portion to avoid exceeding commercial profits or double taxation.",
      "addresses_issue": "i1",
      "key_observation": "Company can only declare dividends from profits in general meeting; post-declaration assessment under S.23-A would be unreasonable."
    },
    {
      "id": "cr3",
      "text": "High Court right in answering question in affirmative.",
      "addresses_issue": "i1",
      "key_observation": "Such result not intended by legislature."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "In calculating undistributed balance for super-tax u/s 23A(1), ITO must consider dividends actually distributed if declared before the date of the order, even if after 12 months from accounting year.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Moore Avenue Properties Private Ltd. v. C.I.T.",
      "citation": "59 I.T.R. 466",
      "treatment": "followed",
      "relevance": "Reasoning (though obiter) followed by High Court and approved."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act, 1922",
      "sections": [
        "S. 66(1)",
        "S. 23-A(1)",
        "S. 2(6A)",
        "S. 23"
      ],
      "relevance": "Governs reference to High Court, levy of super-tax on undistributed income of private companies, definition of dividend; ITO must deduct actually distributed dividends before order."
    },
    {
      "name": "Banking Companies Act, 1949",
      "sections": [
        "S. 17"
      ],
      "relevance": "Amount transferred to reserve fund deductible in case of banking companies."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court upheld High Court's answer in affirmative against department; Tribunal correct that ITO must consider dividends declared after 12 months but before S.23A order in computing undistributed balance for super-tax.",
    "relief_granted": "No super-tax on dividends of Rs.15,000 and Rs.90,000",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"the Income-tax Officer though for the non-fulfilment of the conditions prescribed in the section may seek to reopen it he cannot make an assessment in cases where the dividend has actually been declared and paid before the date of his order.\"",
      "speaker": "court",
      "significance": "Core holding preventing super-tax post-dividend declaration."
    },
    {
      "text": "\"Such a result was not intended.\"",
      "speaker": "court",
      "significance": "Explains avoidance of double taxation and illogical assessment."
    }
  ],
  "_case_id": "1972_373",
  "_label": 0,
  "_text_length": 8809,
  "_extracted_at": "2026-02-10T20:09:35.681439"
}