{
  "metadata": {
    "case_name": "Appellant (Traffic Assistant) v. State",
    "case_year": 1969,
    "court": "Supreme Court of India",
    "judges": [
      "Jaganmohan Reddy, J."
    ],
    "case_number": "Criminal Appeal No. 101 of 1969",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant employed as Traffic Assistant in Indian Airlines Corporation office at Jaipur; duty to make reservations and issue tickets.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "When quota of seats allotted to Jaipur full, intending travellers required to pay trunk telephone charges to obtain release of seats from quotas allotted to other centers.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Practice: Collect approximate charges, issue receipt; if seat available, confirm reservation.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Appellant in charge of arrangements between 16-2-62 and 30-8-62; collected Rs. 184.90 towards trunk telephone charges but deposited only Rs. 44.91 with Airlines Corporation, misappropriated balance Rs. 139.99.",
      "type": "material",
      "date": "1962-02-16 to 1962-08-30",
      "source": "prosecution"
    },
    {
      "id": "f5",
      "text": "Modus operandi: Demanded higher amount for trunk call charges than likely incurred; issued correct receipt for higher amounts on behalf of Airlines Corporation; after trunk call, altered counter-foil to actual amount; made daily return showing actual amounts and deposited them with Cashier.",
      "type": "material",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f6",
      "text": "Typical sample: Exhibit 40, receipt No. 354577 dated 30-8-62 for Rs. 23.40 from M/s. M Travels, Jaipur for T Call charges to Udaipur and AMD for release of seat.",
      "type": "material",
      "date": "1962-08-30",
      "source": "prosecution"
    },
    {
      "id": "f7",
      "text": "On 31-8-62, M.D. Singh of Mercury Travel Agency, Jaipur complained to B.S. Gupta, Incharge, that appellant collected Rs. 23.40 for proposed trunk call charges but no call made and no seat allotted to passenger despite availability; seat given to someone else.",
      "type": "material",
      "date": "1962-08-31",
      "source": "prosecution"
    },
    {
      "id": "f8",
      "text": "B.S. Gupta questioned appellant, who confessed to collecting amount but not making call; immediately resigned.",
      "type": "material",
      "date": "1962-08-31",
      "source": "prosecution"
    },
    {
      "id": "f9",
      "text": "Preliminary inquiry conducted by Area Manager; thereafter First Information Report lodged.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Accused denied collecting amounts or issuing receipts; stated whatever amounts collected were paid in office everyday.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f11",
      "text": "Both courts found proved: Appellant made trunk calls when on duty; called for and received trunk call charges from intending passengers; gave receipts (exhibited) in his own handwriting and signed by him; realised total sum of Rs. 185/- entrusted to him over which he had dominion as public servant.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Initially charged under s.5(2) r/w s.5(1)(c) PCA, s.409 IPC, s.477A IPC; later additional charges under s.5(2) r/w s.5(1)(c) and s.5(2) r/w s.5(1)(w?) PCA.",
      "type": "procedural",
      "date": "1964-01-15",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Special Judge convicted under s.409 IPC and s.5(2) r/w s.5(1)(c) and (d) PCA; sentenced to RI 18 months + fine Rs.250/- each, concurrent.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "Rajasthan High Court held no conviction recorded under s.5(1)(d) PCA; confirmed conviction under s.409 IPC and s.5(2) r/w s.5(1)(c) PCA; RI 18 months each, reduced fine to Rs.150/- each.",
      "type": "procedural",
      "date": "1969-04-16",
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether there was entrustment of the collected trunk call charges to the appellant as public servant, necessary for conviction under s.409 IPC and s.5(2) r/w s.5(1)(c) PCA.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether appellant entitled to benefit of Probation of Offenders Act.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Prosecution case showed appellant collected excess charges by representing them as actual trunk call charges, not that excess would be returned; thus no entrustment as amounts obtained by cheating; cannot be convicted under s.409 IPC or s.5(2) r/w s.5(1)(c) PCA.",
      "supporting_facts": [
        "f4",
        "f5",
        "f10"
      ],
      "legal_basis": "Surendra Pal Singh v. The State, AIR 1957 All 122"
    },
    {
      "id": "pa2",
      "text": "Trial extended over more than 3 years, enormous expenses travelling to Chandigarh, in jail some time; benefit of Probation of Offenders Act should be given.",
      "supporting_facts": [
        "f13",
        "f14"
      ],
      "legal_basis": "Probation of Offenders Act"
    },
    {
      "id": "pa3",
      "text": "Distinction from State v. Dahyalal: There was definite direction to collect specific amount lawfully; here passengers parted with proprietary rights, money not become property of Corporation.",
      "supporting_facts": [
        "f4",
        "f5"
      ],
      "legal_basis": "State v. Dahyalal Dalpatram, AIR 1960 Bom 53"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Appellant convicted under s.5(1)(d) PCA; contention has no merits as no appeal by State.",
      "supporting_facts": [
        "f13",
        "f14"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Entrustment exists if property voluntarily handed over for specific purpose and dishonestly disposed contrary to terms; wide sense includes possession for particular manner, ownership in other; public servant authorized to collect moneys entrusted when paid to him; payer loses proprietary interest but principal becomes owner.",
      "addresses_issue": "i1",
      "key_observation": "Receipts given on behalf of Corporation; Corporation liable if no calls made or excess charged; amounts paid to Corporation via appellant, entrusted to him upon receipt."
    },
    {
      "id": "cr2",
      "text": "Disapproved Surendra Pal Singh (Allahabad); agreed with Dahyalal (Bombay); cited precedents showing entrustment even if obtained by false representation, as long as received for master's benefit in particular way.",
      "addresses_issue": "i1",
      "key_observation": "Criminal intent at receipt does not negate entrustment if for specific purpose."
    },
    {
      "id": "cr3",
      "text": "Evidence of practice: Witnesses (P.W.6 M.U. Menon, P.W.3 Ganesh Singh) confirm trunk charges demanded and paid to Corporation for seat release; no cross-examination.",
      "addresses_issue": "i1",
      "key_observation": "Appellant falsified counter-foils, misappropriated; guilty of criminal breach of trust."
    },
    {
      "id": "cr4",
      "text": "Probation of Offenders Act inapplicable: s.4 excludes offences punishable with life imprisonment (s.409 IPC); s.18 excludes s.5(2) PCA offences.",
      "addresses_issue": "i2",
      "key_observation": "High Court rightly rejected."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Entrustment proved; convictions under s.409 IPC and s.5(2) r/w s.5(1)(c) PCA upheld; no confirmation of s.5(1)(d) PCA as High Court omitted and no State appeal.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Probation of Offenders Act inapplicable to convictions.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Surendra Pal Singh v. The State",
      "citation": "AIR 1957 All 122",
      "treatment": "disapproved",
      "relevance": "Held no entrustment for excess collected by public servant; disapproved by court."
    },
    {
      "case_name": "State v. Dahyalal Dalpatram",
      "citation": "AIR 1960 Bom 53",
      "treatment": "followed",
      "relevance": "Entrustment when public servant collects amounts lawfully due even if disputed; approved."
    },
    {
      "case_name": "In the matter of Ram Sounder Poddar Ors.",
      "citation": "1878 2 Cal LR 515",
      "treatment": "referred",
      "relevance": "s.409 does not require property to be Government's, only entrusted to public servant in that capacity."
    },
    {
      "case_name": "In re Ramappa",
      "citation": "1911 22 MLJ 112",
      "treatment": "referred",
      "relevance": "Receipt by false pretense still entrustment if for master's benefit in particular way."
    },
    {
      "case_name": "Venkata Raghunatha Sastri",
      "citation": "1923 45 MLJ 133",
      "treatment": "referred",
      "relevance": "Inducing hand over by pretense constitutes cheating and also breach of trust on misappropriation."
    },
    {
      "case_name": "Crown Prosecutor v. McIver and K.S. Narasimhachari",
      "citation": "69 MLJ 681",
      "treatment": "referred",
      "relevance": "Entrustment even if induced by deception; subsequent misappropriation is breach of trust."
    }
  ],
  "statutes_cited": [
    {
      "name": "Prevention of Corruption Act, 1947",
      "sections": [
        "5(2)",
        "5(1)(c)",
        "5(1)(d)"
      ],
      "relevance": "Conviction under s.5(2) r/w s.5(1)(c); no confirmation under s.5(1)(d); s.18 of Probation Act excludes."
    },
    {
      "name": "Indian Penal Code",
      "sections": [
        "409",
        "477A"
      ],
      "relevance": "Conviction under s.409 for criminal breach of trust by public servant; entrustment ingredient satisfied."
    },
    {
      "name": "Probation of Offenders Act",
      "sections": [
        "4",
        "18"
      ],
      "relevance": "Inapplicable to offences punishable with life imprisonment or under s.5(2) PCA."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal by special leave dismissed; convictions under s.409 IPC and s.5(2) r/w s.5(1)(c) PCA confirmed as per High Court (RI 18 months each, fine Rs.150/- each); no interference with omission of s.5(1)(d) PCA.",
    "relief_granted": "None to appellant",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"The expression entrusted in section 409 is used in a wide sense and includes all cases in which property is voluntarily handed over for a specific purpose and is dishonestly disposed of contrary to the terms on which possession has been handed over.\"",
      "speaker": "court",
      "significance": "Defines broad scope of entrustment, key to upholding conviction."
    },
    {
      "text": "\"As soon as the receipt for the amount actually received from the passengers was given by the accused on behalf of the Corporation, he was entrusted with that amount.\"",
      "speaker": "court",
      "significance": "Moment of entrustment identified, resolves core issue."
    },
    {
      "text": "\"section 409 does not as supposed by the Deputy Magistrate, require the property in respect of which criminal breach of trust is committed, to be the property of Government, but only requires that it should be entrusted to a public servant in his capacity as such public servant.\"",
      "speaker": "court",
      "significance": "Clarifies entrustment not limited to government property."
    }
  ],
  "_case_id": "1972_77",
  "_label": 0,
  "_text_length": 18846,
  "_extracted_at": "2026-02-10T20:07:30.029811"
}