{
  "metadata": {
    "case_name": "Civil Appeal No. 1807 of 1971",
    "case_year": 1971,
    "court": "Supreme Court of India",
    "judges": [
      "Mathew, J."
    ],
    "case_number": "Civil Appeal No. 1807 of 1971",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "There is a bamboo company known as Bantha Bamboo company in Chatra North Division of Hazaribagh district.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On July 22, 1970, the Forest Department of the Government of Bihar advertised for settlement of the right to exploit the COUP by Public auction.",
      "type": "procedural",
      "date": "1970-07-22",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The auction was held in the Office of the Divisional Forest Officer on August 7, 1970. Five persons including the appellant participated. Reserve price Rs. 95,000/-. Appellant's bid of Rs. 92,001/-, highest, accepted provisionally by Divisional Forest Officer. Appellant deposited security Rs. 23,800/- and executed agreement.",
      "type": "material",
      "date": "1970-08-07",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Divisional Forest Officer reported auction to Conservator of Forests, Hazaribagh Circle by letter dated August 25, 1970.",
      "type": "procedural",
      "date": "1970-08-25",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Since provisional settlement exceeded Rs. 50,000/-, Conservator forwarded papers to Deputy Secretary, Government of Bihar, Forest Department for confirmation. Matter referred to Finance Department as below reserve price.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Finance Department sought comments from Divisional Forest Officer on why settled below reserve. Divisional Forest Officer explained by letter dated October 30, 1970.",
      "type": "procedural",
      "date": "1970-10-30",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Appellant expressed willingness to take settlement at reserve price of Rs. 95,000/- by communication dated October 26, 1970.",
      "type": "material",
      "date": "1970-10-26",
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "Appellant filed application on November 3, 1970, praying for settlement on basis of highest bid.",
      "type": "procedural",
      "date": "1970-11-03",
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "Minister of Forest by proceedings dated November 27, 1970, directed settlement of company with highest bidder (appellant) at reserve price.",
      "type": "material",
      "date": "1970-11-27",
      "source": "respondent"
    },
    {
      "id": "f10",
      "text": "Telegram sent by Government to Conservator of Forests, Hazaribagh Circle on November 28, 1970, copy to Conservator of Forest, Bihar, confirming auction sale to appellant at Rs. 95,000/-. Divisional Forest Officer did not receive intimation and did not communicate to appellant.",
      "type": "material",
      "date": "1970-11-28",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Md. Yakub (Respondent No. 6) filed petition on December 4, 1970, before Government of Bihar offering Rs. 1,01,125/- for settlement.",
      "type": "material",
      "date": "1970-12-04",
      "source": "respondent"
    },
    {
      "id": "f12",
      "text": "Telegram sent by Government on December 5, 1970, to Divisional Forest Officer directing not to take action on telegram dated November 28, 1970.",
      "type": "procedural",
      "date": "1970-12-05",
      "source": "respondent"
    },
    {
      "id": "f13",
      "text": "Telegram received by Divisional Forest Officer on December 10, 1970. Divisional Forest Officer informed Government by letter same date that previous telegram not received and not communicated to appellant.",
      "type": "procedural",
      "date": "1970-12-10",
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Minister of Forest by proceedings dated December 13, 1970, cancelled settlement with appellant and settled with Respondent No. 6 for Rs. 1,01,125/-.",
      "type": "material",
      "date": "1970-12-13",
      "source": "respondent"
    },
    {
      "id": "f15",
      "text": "Government sent telegrams on December 21, 1970, to Conservator and Divisional Forest Officer informing settlement with Respondent No. 6.",
      "type": "procedural",
      "date": "1970-12-21",
      "source": "respondent"
    },
    {
      "id": "f16",
      "text": "Divisional Forest Officer by letter dated December 23, 1970, directed Respondent No. 6 to deposit security and first instalment. Respondent No. 6 deposited and executed agreement.",
      "type": "procedural",
      "date": "1970-12-23",
      "source": "court"
    },
    {
      "id": "f17",
      "text": "Appellant filed writ petition in Patna High Court praying quashing of order dated December 13, 1970, and mandamus to give effect to order dated November 27, 1970.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f18",
      "text": "Writ petition dismissed by Division Bench of Patna High Court on May 6, 1971 in C.W.J.C. No. 41 of 1971.",
      "type": "procedural",
      "date": "1971-05-06",
      "source": "lower_court"
    },
    {
      "id": "f19",
      "text": "Appeal by special leave to Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f20",
      "text": "Special conditions in tender notice: Divisional Forest Officer can accept bid less than Rs. 50,000/- outright; above subject to confirmation by Chief Conservator and Forest Dept; auction >50k not recognised till confirmed; bid binding on bidder for 2 months or till rejection.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f21",
      "text": "Letter from Deputy Secretary to Accountant General dated November 22, 1967: Relaxation of Rule 10(1) for Forest Dept to authorise leases >50k if reserve fixed, highest bid accepted, not below reserve, no relaxation without Finance concurrence.",
      "type": "background",
      "date": "1967-11-22",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether there was a concluded contract between the appellant and the Government upon provisional acceptance of bid by Divisional Forest Officer and subsequent proceedings of Minister dated November 27, 1970.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether the settlement of the company in favour of Respondent No. 6 by private treaty violated Rule 10 of the Rules of Executive Business made under Article 166(3), particularly requirement of prior consultation with Finance Department.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether Rule 10(1) is mandatory or directory.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "There was a concluded contract when bid accepted provisionally by Divisional Forest Officer (subject to confirmation) and Government confirmed by proceedings dated November 27, 1970, even without communication to appellant.",
      "supporting_facts": [
        "f3",
        "f9",
        "f10"
      ],
      "legal_basis": "The Rajanagaram Village Cooperative Society v. Veerasami Mudaly (1950) 11 M.L.J. 486"
    },
    {
      "id": "pa2",
      "text": "Settlement with 6th Respondent by private treaty violated statutory rules (Rule 10 of Rules of Executive Business under Article 166(3)).",
      "supporting_facts": [
        "f14",
        "f21"
      ],
      "legal_basis": "Rule 10(1) of Rules of Executive Business; relaxation letter dated November 22, 1967"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "No concluded contract as provisional acceptance did not become binding without confirmation of original bid and communication.",
      "supporting_facts": [
        "f3",
        "f5",
        "f9",
        "f10"
      ],
      "legal_basis": "Somasundaram Pillai v. Provincial Government of Madras AIR 1947 Mad 366; Williston on Contracts Vol. I, 3rd Ed. Section 77A"
    },
    {
      "id": "ra2",
      "text": "Rule 10(1) is not a statutory rule and does not concern lease of forest coupes; no bar to private treaty settlement.",
      "supporting_facts": [
        "f14"
      ],
      "legal_basis": null
    },
    {
      "id": "ra3",
      "text": "Rule 10(1) requiring prior consultation with Finance Department is directory, not mandatory.",
      "supporting_facts": [
        "f14"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "No concluded contract: Minister's proceedings dated November 27, 1970 did not confirm Divisional Forest Officer's acceptance of Rs. 92,001 bid but accepted appellant's new offer of October 26 for Rs. 95,000, which was not communicated to appellant and was revoked by appellant's November 3 letter. No acceptance put in course of transmission.",
      "addresses_issue": "i1",
      "key_observation": "Want of confirmation of conditional acceptance and lack of communication of new acceptance."
    },
    {
      "id": "cr2",
      "text": "Special conditions in tender make acceptance above Rs. 50,000 provisional subject to confirmation; bid binding on bidder but not on Government till confirmed.",
      "addresses_issue": "i1",
      "key_observation": "Provisional acceptance subject to Government confirmation."
    },
    {
      "id": "cr3",
      "text": "Settlement with 6th Respondent by private treaty: Rule 10(1) as relaxed does not prohibit private treaty; only requires consultation for leases > Rs. 50,000, but relaxation applies to auctions.",
      "addresses_issue": "i2",
      "key_observation": "Rule does not mandate public auction only."
    },
    {
      "id": "cr4",
      "text": "No prior consultation with Finance Department before December 13 order for 6th Respondent.",
      "addresses_issue": "i2",
      "key_observation": "Finance Department not consulted."
    },
    {
      "id": "cr5",
      "text": "Rule 10(1) uses prohibitive language, concerns State revenue and individual rights; tests indicate it is mandatory, not directory. Rule 10(2) reinforces by requiring Cabinet decision if Finance disagrees.",
      "addresses_issue": "i3",
      "key_observation": "Negative language and context make provision mandatory."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "No concluded contract between appellant and Government.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Rule 10(1) of Rules of Executive Business is mandatory requiring prior consultation with Finance Department for certain leases.",
      "resolves_issue": "i3",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "The Rajanagaram Village Cooperative Society v. Veerasami Mudaly",
      "citation": "(1950) 11 M.L.J. 486",
      "treatment": "considered",
      "relevance": "Held conditional acceptance binds bidder upon confirmation; relied by appellant but distinguished."
    },
    {
      "case_name": "Somasundaram Pillai v. Provincial Government of Madras",
      "citation": "A.I.R. 1947 Mad 366",
      "treatment": "followed",
      "relevance": "Provisional or conditional acceptance does not make binding contract without unconditional acceptance."
    },
    {
      "case_name": "Dattatreya Moreshwar Pangerkar v. The State of Bombay",
      "citation": null,
      "treatment": "referred",
      "relevance": "Prescriptions for public duty may be directory if invalidation causes inconvenience."
    }
  ],
  "statutes_cited": [
    {
      "name": "Rules of Executive Business (Bihar)",
      "sections": [
        "Rule 10(1)",
        "Rule 10(2)"
      ],
      "relevance": "Requires prior consultation with Finance Department for orders affecting State finances including forest leases > Rs. 50,000; mandatory provision."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 166(3)"
      ],
      "relevance": "Rules of Executive Business made thereunder."
    }
  ],
  "outcome": {
    "disposition": null,
    "summary": "Judgment text incomplete; court held no concluded contract with appellant but found Rule 10(1) mandatory and no consultation done for settlement with Respondent No. 6.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "We are, therefore, of the opinion that there was no concluded contract between the appellant and the Government.",
      "speaker": "court",
      "significance": "Rejects petitioner's primary contention on contract formation."
    },
    {
      "text": "The negative or prohibitive language of rule 10(1) is a strong indication of the intent to make the rule mandatory.",
      "speaker": "court",
      "significance": "Determines mandatory nature of consultation requirement."
    },
    {
      "text": "Neither rule 10(1) nor the rule as relaxed says that forest land can be leased only by public auction.",
      "speaker": "court",
      "significance": "Rejects argument that private treaty prohibited."
    }
  ],
  "_case_id": "1972_70",
  "_label": 1,
  "_text_length": 19337,
  "_extracted_at": "2026-02-10T20:07:42.675097"
}