{
  "metadata": {
    "case_name": "Civil Appeal No. 1192 and 1193 of 1967",
    "case_year": 1967,
    "court": "Supreme Court of India",
    "judges": [
      "GROVER, J."
    ],
    "case_number": "Civil Appeal No. 1192 and 1193 of 1967",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Notification issued under s. 4 of the Land Acquisition Act, 1894 on October 15, 1960 for acquisition of the land in dispute.",
      "type": "procedural",
      "date": "1960-10-15",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Under s. 17(4) of the Act the provisions of s. 5A were dispensed with.",
      "type": "procedural",
      "date": "1960-10-15",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Notification under s. 6 issued on October 28, 1960.",
      "type": "procedural",
      "date": "1960-10-28",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Appellant directed to be present before the Collector in pursuance of a notice under s. 9 on December 4, 1960.",
      "type": "procedural",
      "date": "1960-12-04",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "On December 5, 1960 the appellant filed a petition under Art. 226 of the Constitution challenging the acquisition proceedings.",
      "type": "procedural",
      "date": "1960-12-05",
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "Petition dismissed by a single judge of the High Court whose judgment was affirmed in Special Appeal by the Division Bench.",
      "type": "procedural",
      "date": "1969-01-13",
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "It is common ground that the Collector did not cause public notice of the substance of the notification to be given at convenient places in the locality where the land sought to be acquired was situated. In other words there was non-compliance whatsoever with the second part of sub-s. (1) of s. 4.",
      "type": "admitted",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the provisions of s. 4(1) of the Land Acquisition Act, 1894, particularly the requirement for the Collector to cause public notice of the substance of the notification at convenient places in the locality, are mandatory even when provisions of s. 5A are dispensed with under s. 17(4).",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The acquisition proceedings are vitiated due to non-compliance with the second part of s. 4(1), as the Collector did not cause public notice of the substance of the notification to be given at convenient places in the locality.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "s. 4(1) Land Acquisition Act, 1894; Khub Chand Others v. The State of Rajasthan; State of Mysore v. Abdul Razak Sahib"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Public notice of the substance of the notification under s. 4(1) by the Collector is only necessary when persons interested can file objections under s. 5A, but since s. 5A provisions were dispensed with under s. 17(4) simultaneously with s. 4(1) notification, it is unnecessary for interested parties to have information of the proceedings as they are not entitled to file objections under s. 5A.",
      "supporting_facts": [
        "f2"
      ],
      "legal_basis": "s. 17(4), s. 5A Land Acquisition Act, 1894"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The law as settled by this Court is that such a notice under second part of s. 4(1) is mandatory and unless that notice is given in accordance with the provisions contained therein the entire acquisition proceedings are vitiated.",
      "addresses_issue": "i1",
      "key_observation": "Object is to give intimation to a person whose land is sought to be acquired of the intention of the officer to enter the land. Under s. 4(2) such a notice is a necessary condition for the exercise of the power of entry; non-compliance makes the entry unlawful."
    },
    {
      "id": "cr2",
      "text": "In the case of a notification under s. 4 the law has prescribed that in addition to publication in the official gazette the Collector must also give publicity of the substance of the notification in the concerned locality. Unless both these conditions are satisfied s. 4 of the Act cannot be said to have been complied with.",
      "addresses_issue": "i1",
      "key_observation": "Purpose behind such a notice is that interested persons should know that the land is being acquired so as to prefer any objections under s. 5A which confers a valuable right."
    },
    {
      "id": "cr3",
      "text": "The provisions of s. 4(1) cannot be held to be mandatory in one situation and directory in another. Section 4(1) does not contemplate any distinction between proceedings where s. 17(4) dispenses with s. 5A and where it does not.",
      "addresses_issue": "i1",
      "key_observation": "s. 4(1) lays down in unequivocal terms that both publication in gazette and public notice by Collector must be done simultaneously."
    },
    {
      "id": "cr4",
      "text": "s. 4(1) has to be read as an integrated provision which contains two conditions: publication in official gazette and Collector causing public notice of substance at convenient places. These two conditions must be satisfied for compliance with s. 4(1). Construction of s. 4(1) cannot depend upon any action under s. 17(4).",
      "addresses_issue": "i1",
      "key_observation": "Direction under s. 17(4) can be made even later; it affects s. 6 declaration and possession but not validity of s. 4(1)."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Provisions of s. 4(1) second part are mandatory irrespective of whether s. 5A is dispensed with under s. 17(4); non-compliance vitiates entire acquisition proceedings.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Khub Chand Others v. The State of Rajasthan, Ors.",
      "citation": "1967 1 S.C.R. 120",
      "treatment": "followed",
      "relevance": "Notice under s. 4(1) second part is mandatory; object to intimate owner of intention to enter land; necessary for power of entry under s. 4(2); non-compliance makes entry unlawful."
    },
    {
      "case_name": "State of Mysore v. Abdul Razak Sahib",
      "citation": null,
      "treatment": "followed",
      "relevance": "Both gazette publication and locality publicity by Collector required for valid s. 4 notification; purpose to enable objections under s. 5A."
    }
  ],
  "statutes_cited": [
    {
      "name": "Land Acquisition Act, 1894",
      "sections": [
        "s. 4(1)",
        "s. 4(2)",
        "s. 5A",
        "s. 6",
        "s. 9",
        "s. 17(4)"
      ],
      "relevance": "s. 4(1) requires gazette notification and public notice by Collector in locality, mandatory in all cases; s. 17(4) dispenses s. 5A but does not affect s. 4(1) compliance."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 226"
      ],
      "relevance": "Petition filed challenging acquisition proceedings."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeals allowed on short ground of non-compliance with s. 4(1) second part; acquisition proceedings in both appeals quashed.",
    "relief_granted": "Acquisition proceedings quashed",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The law as settled by this Court is that such a notice under second part of s. 4(1) is mandatory and unless that notice is given... the entire acquisition proceedings are vitiated.",
      "speaker": "court",
      "significance": "Core holding on mandatory nature of public notice."
    },
    {
      "text": "In our judgment the provisions of s. 4(1) cannot be held to be mandatory in one situation and directory in another.",
      "speaker": "court",
      "significance": "Rejects respondent's distinction based on s. 17(4)."
    },
    {
      "text": "s. 4(1) has to be read as an integrated provision which contains two conditions... These two conditions must be satisfied for the purpose of compliance with the provisions of s. 4(1).",
      "speaker": "court",
      "significance": "Explains integrated reading of s. 4(1) independent of s. 17(4)."
    }
  ],
  "_case_id": "1972_574",
  "_label": 1,
  "_text_length": 6792,
  "_extracted_at": "2026-02-10T20:11:02.411152"
}