{
  "metadata": {
    "case_name": "Sohrab and Nadar v. State",
    "case_year": 1969,
    "court": "Supreme Court of India",
    "judges": [
      "Jaganmohan Reddy, J."
    ],
    "case_number": "Criminal Appeal No. 240 of 1969",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Strained relationship between accused and deceased: In December 1963, Kudrat (husband of Jinnatbai) was murdered; Sobal Singh (deceased) prosecuted but acquitted.",
      "type": "background",
      "date": "1963-12",
      "source": "prosecution"
    },
    {
      "id": "f2",
      "text": "On morning of 26th February 1966, seven accused started from house of Sohrab: Jinnatbai with son and Nadar in chhakda driven by Gaburia; Ismail, Bashir, Sardar on bicycles; Sohrab on mare with unlicensed revolver.",
      "type": "material",
      "date": "1966-02-26",
      "source": "prosecution"
    },
    {
      "id": "f3",
      "text": "Jinnatbai handed unlicensed gun to Nadar, kept in chhakda.",
      "type": "material",
      "date": "1966-02-26",
      "source": "prosecution"
    },
    {
      "id": "f4",
      "text": "Shortly before, Sobal Singh left Solsindhi for Sanwer on foot with Chhogia, followed by Madhosingh, Kishandas, Kana, Bhawarsingh in chhakda.",
      "type": "material",
      "date": "1966-02-26",
      "source": "prosecution"
    },
    {
      "id": "f5",
      "text": "Near village Maharajganj, accused overtook the two groups and went ahead; Sohrab turned mare, chased Sobal Singh across fields in mouza Ranwer; Chhogia ran away.",
      "type": "material",
      "date": "1966-02-26",
      "source": "prosecution"
    },
    {
      "id": "f6",
      "text": "Sohrab fired revolver at Sobal Singh several times, caught him by shirt which came off; dismounted mare; Nadar ran with double-barrelled shot-gun, handed to Sohrab, caught Sobal Singh.",
      "type": "disputed",
      "date": "1966-02-26",
      "source": "prosecution"
    },
    {
      "id": "f7",
      "text": "Sohrab fired gun at Sobal Singh; both Sobal Singh and Nadar fell; Nadar got up; Sohrab fired again at Sobal Singh lying face up.",
      "type": "material",
      "date": "1966-02-26",
      "source": "prosecution"
    },
    {
      "id": "f8",
      "text": "Bashir and Sardar ran to spot, struck Sobal Singh with knives; Sobal Singh died on spot from cumulative effect.",
      "type": "disputed",
      "date": "1966-02-26",
      "source": "prosecution"
    },
    {
      "id": "f9",
      "text": "Accused went to chhakda; Jinnatbai asked if man dead; told Kudrat avenged.",
      "type": "material",
      "date": "1966-02-26",
      "source": "prosecution"
    },
    {
      "id": "f10",
      "text": "Within one hour, Madhosingh (deceased's father, eyewitness) reported at Sanwar police station (1.5 miles away); FIR issued.",
      "type": "procedural",
      "date": "1966-02-26",
      "source": "prosecution"
    },
    {
      "id": "f11",
      "text": "Police seized from spot and vicinity: used/unused shotgun/revolver ammunition, shirt, stirrup with strap piece.",
      "type": "material",
      "date": "1966-02-26",
      "source": "prosecution"
    },
    {
      "id": "f12",
      "text": "After Bashir's statement, two knives recovered from trunk of date palm tree near Bhaori-Deorakhedi border.",
      "type": "material",
      "date": "post 1966-02-26",
      "source": "prosecution"
    },
    {
      "id": "f13",
      "text": "Sohrab pointed out place on Bhaori-Deorakhedi border where he broke revolver and gun, cut/burnt wooden components; firearm parts recovered.",
      "type": "material",
      "date": "post 1966-02-26",
      "source": "prosecution"
    },
    {
      "id": "f14",
      "text": "Divers recovered disjointed/mutilated firearm parts, cartridges from river Kshipra bottom near that place.",
      "type": "material",
      "date": "post 1966-02-26",
      "source": "prosecution"
    },
    {
      "id": "f15",
      "text": "Saddle (missing stirrup/strap) from house of Darvesh (Sohrab's maternal uncle); strap matched scene strap.",
      "type": "material",
      "date": "post 1966-02-26",
      "source": "prosecution"
    },
    {
      "id": "f16",
      "text": "Deceased's payjama and two knives sent to Chemical Examiner/Serologist: blood on one knife, could not confirm human.",
      "type": "material",
      "date": "post 1966-02-26",
      "source": "prosecution"
    },
    {
      "id": "f17",
      "text": "Autopsy: Death from internal haemorrhage/shock due to gunshot wounds/injuries to liver, spleen, lungs.",
      "type": "material",
      "date": "post 1966-02-26",
      "source": "prosecution"
    },
    {
      "id": "f18",
      "text": "Nadar operated twice; five bullets extracted (three left hand, two right); identified as gun shots.",
      "type": "material",
      "date": "post 1966-02-26",
      "source": "prosecution"
    },
    {
      "id": "f19",
      "text": "Ballistic expert: Hole in recovered shirt caused by .38 revolver; shots from body were gun pellets, not revolver bullets.",
      "type": "material",
      "date": "post 1966-02-26",
      "source": "prosecution"
    },
    {
      "id": "f20",
      "text": "Sessions Judge acquitted all seven accused.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f21",
      "text": "State appealed to High Court (Criminal Appeal No. 26 of 1967); High Court maintained acquittal of five (Jinnatbai, Gaburia, Ismail, Sardar, Bashir), convicted Sohrab and Nadar under 302/34 IPC (life imprisonment) and 25-A Arms Act (1 year RI, concurrent).",
      "type": "procedural",
      "date": "1969-08-05",
      "source": "court"
    },
    {
      "id": "f22",
      "text": "Appeal to Supreme Court by special leave/certificate.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f23",
      "text": "Accused denied guilt; stated death not caused by them.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f24",
      "text": "Sessions Judge found: Chase on horse, revolver firing, shirt pull fabrication; shirt hole not linked to Sohrab (pellets not revolver); disbelieved PW1 Madhosingh, PW2 Arjun, PW6 Kishandas, PW31 Babulal; most incised injuries postmortem; no belief in stabbing by Bashir/Sardar.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f25",
      "text": "Sessions Judge: Injuries suggest shooter lower than victim or victim bending/kneeling (not supported); Nadar pellets not as per witnesses.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f26",
      "text": "High Court: Contradictions minor; Nadar palm injuries from protecting against gunfire; incised wounds likely postmortem; pistol story myth, discarded.",
      "type": "procedural",
      "date": "1969-08-05",
      "source": "court"
    },
    {
      "id": "f27",
      "text": "High Court: Unanimity that Sohrab fired fatal gun shot(s) handed by Nadar; corroborated by medical; rejected accidental firing defence.",
      "type": "procedural",
      "date": "1969-08-05",
      "source": "court"
    },
    {
      "id": "f28",
      "text": "Appellant Sohrab's statement u/s 342: Started 7 AM to court on mare; Nadar etc in cart; dispute with Chhogya; heard gun fire, saw Nadar running north chased by Sobal Singh loading gun; struggled, gun fired, Sobal fell; dropped gun, fired again; saw Nadar bleeding; hid then surrendered.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f29",
      "text": "Appellant Nadar's statement: Going to court; Sohrab ahead on mare; Sobal Singh/Chhogya behind with gun; Nadar urinating, first shot hit hands, fell face up; second missed; ran to cart, to Sanwer, sent sister-in-law, beaten at PS, report not recorded.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f30",
      "text": "FIR by Madhosingh: Saw Sohrab catch Sobal; Nadar bring gun, catch Sobal; Sohrab fire back, Sobal fall, second fire; Sardar/Bashir knife blows; went to cart.",
      "type": "material",
      "date": "1966-02-26",
      "source": "prosecution"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether Sohrab and Nadar are guilty of murder under Section 302/34 IPC based on prosecution evidence, despite Sessions Judge acquittal, considering contradictions, medical evidence, and defence version.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Scope of High Court's power in appeal against acquittal under Sections 417, 418, 423 CrPC.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Prosecution story of chase on mare, revolver firing, shirt pull is fabrication; shirt hole from revolver but body pellets from gun.",
      "supporting_facts": [
        "f6",
        "f19",
        "f24"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Disbelieved eyewitnesses PW1,2,6,31; most incised injuries postmortem; no stabbing by Bashir/Sardar.",
      "supporting_facts": [
        "f24"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Medical evidence: Injuries suggest shooter lower than victim (no bending/kneeling); Nadar injuries not as per witnesses; pistol integral, unsafe to believe.",
      "supporting_facts": [
        "f17",
        "f18",
        "f25"
      ],
      "legal_basis": null
    },
    {
      "id": "pa4",
      "text": "High Court agreed on contradictions, pistol myth, postmortem wounds but still convicted; in appeal against acquittal, must consider trial court reasons.",
      "supporting_facts": [
        "f26"
      ],
      "legal_basis": "Sheo Swarup v. King Emperor; Sanwant Singh v. State of Rajasthan; Agarwal v. State of Maharashtra"
    },
    {
      "id": "pa5",
      "text": "Defence: Accidental firing in scuffle with Sobal Singh who had gun.",
      "supporting_facts": [
        "f28",
        "f29"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Unanimity in eyewitnesses that Nadar handed gun to Sohrab who fired fatal shots; corroborated by medical (gunshot wounds), FIR, recoveries.",
      "supporting_facts": [
        "f7",
        "f17",
        "f27",
        "f30"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Contradictions minor (spot, fields, manner); Nadar injuries from gunfire protection; details from distance are inferences, broad facts visible.",
      "supporting_facts": [
        "f26"
      ],
      "legal_basis": null
    },
    {
      "id": "ra3",
      "text": "Defence accidental firing rejected; incompatible with medical, statements.",
      "supporting_facts": [
        "f27",
        "f28",
        "f29"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Sessions Judge and High Court agreed on embellishments (pistol, chase details, stabbing) but broad features credible: parties in field, Sohrab on mare chased, Nadar handed gun, Sohrab fired causing death and Nadar injury.",
      "addresses_issue": "i1",
      "key_observation": "Discrepancies do not discard entire evidence; sift truth after caution; falsus in uno falsus in omnibus not rule."
    },
    {
      "id": "cr2",
      "text": "High Court reviewed evidence at large, gave weight to trial views, presumption of innocence, etc., as per precedents; considered Sessions reasons but found overwhelming evidence on core facts.",
      "addresses_issue": "i2",
      "key_observation": "High Court power full under CrPC; expressed reasons for reversal."
    },
    {
      "id": "cr3",
      "text": "FIR names core roles of Sohrab/Nadar; accused statements admit presence, gun firing in their hands, Nadar injury; defence scuffle accidental rejected as Sessions/High Court disbelieved, incompatible with medical.",
      "addresses_issue": "i1",
      "key_observation": "Accused versions lend credence to prosecution core."
    },
    {
      "id": "cr4",
      "text": "No justification linking specific entry/exit wounds; no probe; positions indeterminable.",
      "addresses_issue": "i1",
      "key_observation": "Medical does not negate deliberate firing by Sohrab."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Sohrab and Nadar guilty under Section 302/34 IPC; Sohrab fired gun deliberately at Sobal Singh handed by Nadar.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "High Court justified in reversing acquittal after full review.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Sheo Swarup and Ors. v. King Emperor",
      "citation": "A.I.R. 1934 P.C. 227",
      "treatment": "followed",
      "relevance": "High Court power in appeal against acquittal: review evidence at large, reverse if warranted, give weight to trial views etc."
    },
    {
      "case_name": "Sanwant Singh v. State of Rajasthan",
      "citation": "1961 3 S.C.R. 120",
      "treatment": "followed",
      "relevance": "Adopts Sheo Swarup principles for appellate approach in acquittal appeals."
    },
    {
      "case_name": "Agarwal v. State of Maharashtra",
      "citation": "1963 2 S.C.R. 405",
      "treatment": "followed",
      "relevance": "No curtailment of appellate powers; consider all record, express reasons."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "302",
        "34"
      ],
      "relevance": "Murder with common intention applied to Sohrab and Nadar."
    },
    {
      "name": "Arms Act",
      "sections": [
        "25-A"
      ],
      "relevance": "Conviction for unlicensed arms, 1 year RI concurrent."
    },
    {
      "name": "Code of Criminal Procedure",
      "sections": [
        "342",
        "417",
        "418",
        "423"
      ],
      "relevance": "Statement u/s 342; High Court appellate powers against acquittal."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court confirmed High Court judgment convicting Sohrab and Nadar under Section 302/34 IPC (life imprisonment) and Section 25-A Arms Act (1 year RI concurrent), dismissing appeal against acquittal reversal.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"falsus in uno falsus in omnibus is not a sound rule for the reason that hardly one comes across a witness whose evidence does not contain a grain of untruth or at any rate exaggeration, embroideries or embellishments.\"",
      "speaker": "court",
      "significance": "Justifies accepting core prosecution evidence despite discrepancies."
    },
    {
      "text": "\"The unassailable story therefore remains is that Sohrab fired a gun at Sobal Singh and Nadar handed over the gun to him. Both of them are therefore guilty.\"",
      "speaker": "court",
      "significance": "High Court conclusion on guilt adopted by Supreme Court."
    },
    {
      "id": "kq3",
      "text": "\"In this view, we confirm the judgment of the High Court and dismiss the appeal.\"",
      "speaker": "court",
      "significance": "Final disposition."
    }
  ],
  "_case_id": "1972_237",
  "_label": 0,
  "_text_length": 26332,
  "_extracted_at": "2026-02-10T20:09:15.322216"
}