{
  "metadata": {
    "case_name": "Travancore Sugars and Chemicals Ltd. v. Commissioner of Income-tax",
    "case_year": 1969,
    "court": "Supreme Court of India",
    "judges": [
      "Jaganmohan Reddy J."
    ],
    "case_number": "Civil Appeal No. 2161 of 1969",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant is a limited company incorporated under the Travancore Companies Regulation, carrying on business in Kerala of manufacturing sugar, running a distillery and a tincture factory.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Appellant-company floated to take over business assets of Travancore Sugars Ltd. (being wound up, State Government held largest shares), Government Distillery at Nagercoil, and Government Tincture Factory at Trivandrum.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Agreement dated June 18, 1937 between Government of Travancore and Sir William Wright on behalf of Parry & Co. Ltd., promoters of appellant-company, for sale of assets of the three concerns to appellant-company.",
      "type": "material",
      "date": "1937-06-18",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Clause 3: Cash consideration for Travancore Sugars Ltd. assets: 3.25 lakh rupees.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Clause 4(a): Cash consideration for Government Distillery by joint valuation by engineers.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Clause 5(a): Cash consideration for Government Tincture Factory assets as per book value.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Clauses 4(b) and 4(c): Government to recognise transfer of distillery licence to appellant and secure continuance for 5 years after existing licence.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Clause 5(b): Government to purchase pharmaceutical products from appellant's tincture factory for medical requirements.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Clause 6: Books of account open to Government inspection.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Clause 10: Government entitled to nominate a director on appellant's board without voting power or interference in normal management.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Clause 7 (original): Government entitled to 20% of net profits per year, max Rs. 40,000, after deductions for expenditure, depreciation (not less than IT rates), secretaries/treasurers remuneration.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Agreement dated January 28, 1947 substituted Clause 7: Government entitled to 10% of net profits, defined as amount for which company's audited profits assessed to income-tax in Travancore.",
      "type": "material",
      "date": "1947-01-28",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "For assessment year 1958-59 (previous year May 1, 1956 to April 30, 1957), amount payable to Government under Clause 7: Rs. 42,480.",
      "type": "material",
      "date": "1956-05-01 to 1957-04-30",
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Appellate Assistant Commissioner disallowed deduction of Rs. 42,480 as mere sharing of profits after existence, relying on Pondicherry Railway Co. Ltd. v. CIT.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f15",
      "text": "Income Tax Appellate Tribunal allowed appeal, holding it within British Sugar Manufacturers Ltd. v. Harris, as expenditure to earn profits, not out of earned profits.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f16",
      "text": "Tribunal referred question to Kerala High Court at Revenue's instance: Whether payment of Rs. 42,480 allowable under s.10 of Income-tax Act?",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f17",
      "text": "Kerala High Court (Aug 20, 1963) held payment constituted capital expenditure, not allowable under s.10(2)(xv).",
      "type": "procedural",
      "date": "1963-08-20",
      "source": "lower_court"
    },
    {
      "id": "f18",
      "text": "Supreme Court Appeal No. 324 of 1965 allowed on Sep 20, 1966, remanded to High Court for re-hearing per directions.",
      "type": "procedural",
      "date": "1966-09-20",
      "source": "court"
    },
    {
      "id": "f19",
      "text": "On remand, Kerala High Court Division Bench (Raghavan J. and Isaac J.) differed; Mathew J. agreed with Raghavan J.",
      "type": "procedural",
      "date": "1968-04-05",
      "source": "lower_court"
    },
    {
      "id": "f20",
      "text": "Present appeal by certificate against Kerala High Court judgment dated April 5, 1968.",
      "type": "procedural",
      "date": "1968-04-05",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether, on the facts and circumstances of the case, the payment of Rs. 42,480 by the assessee to the Travancore Government under the agreements dated June 18, 1937, and January 28, 1947, was allowable under section 10 of the Income-tax Act?",
      "framed_by": "lower_court"
    },
    {
      "id": "i2",
      "text": "Whether the payment is capital expenditure or revenue expenditure.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether the payment tantamounts to diversion of profits by paramount title.",
      "framed_by": "court"
    },
    {
      "id": "i4",
      "text": "Whether the payment is wholly and exclusively laid out for the purpose of the business under s.10(2)(xv).",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Payment of Rs. 42,480 is not capital expenditure but revenue nature, allowable under s.10(2)(xv); annual payments under cl.7 not part of purchase price; separate cash considerations in cls.3,4(a),5(a); payments in consideration of Government's obligations in cls.4(b),4(c),5(b).",
      "supporting_facts": [
        "f4",
        "f5",
        "f6",
        "f7",
        "f8"
      ],
      "legal_basis": "Section 10(2)(xv) of Income-tax Act, 1922"
    },
    {
      "id": "pa2",
      "text": "Payment is diversion of profits by overriding title at source.",
      "supporting_facts": [
        "f3",
        "f11",
        "f12"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Payment wholly or exclusively laid out for purposes of business.",
      "supporting_facts": [
        "f13"
      ],
      "legal_basis": "Section 10(2)(xv)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Payment represents division of profits; preamble to 1947 agreement indicates purchase consideration includes cl.7 payment.",
      "supporting_facts": [
        "f12"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Supreme Court remand does not conclusively hold it revenue expenditure; issue still open.",
      "supporting_facts": [
        "f18"
      ],
      "legal_basis": null
    },
    {
      "id": "ra3",
      "text": "Transaction is joint venture to share profits.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Supreme Court in prior appeal held payment not capital but revenue expenditure, overruling High Court; categorical finding not open to re-agitation.",
      "addresses_issue": "i2",
      "key_observation": "Payment not tied to fixed capital sum, indefinite period, related to annual profits from trading."
    },
    {
      "id": "cr2",
      "text": "Once held revenue expenditure, allowable under s.10(2)(xv) as wholly/exclusively for business, whether overriding charge or ordinary deduction.",
      "addresses_issue": "i4",
      "key_observation": "No need to further classify as diversion vs application; revenue nature suffices."
    },
    {
      "id": "cr3",
      "text": "Payment not mere division of profits but expenditure ascertained by reference to profits, incurred in discharge of contractual obligation linked to profit-earning assets transfer.",
      "addresses_issue": "i3",
      "key_observation": "Company created subject to obligations at inception; no volition, enforceable at source."
    },
    {
      "id": "cr4",
      "text": "Obligations interlinked with asset transfer: licence continuance, product purchase, director nomination, labour engagement; payment supports profit-making apparatus.",
      "addresses_issue": "i1",
      "key_observation": "Expenditure deductible whether overriding or under s.10(2)(xv)."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Payment of Rs. 42,480 is revenue expenditure, not capital, allowable as deduction under s.10(2)(xv) of Income-tax Act, 1922.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Prior Supreme Court finding that payment is revenue expenditure conclusive.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h3",
      "text": "Kerala High Court conclusions unsustainable; answer to reference affirmative.",
      "resolves_issue": "i4",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Pondicherry Railway Co. Ltd. v. Commissioner of Income-tax",
      "citation": "1931 5 I.T.C. 363 (58 I.A. 239)",
      "treatment": "distinguished",
      "relevance": "Disallowed as sharing profits after accrual; distinguished as here obligation at inception for asset transfer."
    },
    {
      "case_name": "British Sugar Manufacturers Ltd. v. Harris (Inspector of Taxes)",
      "citation": "1939 7 T.R. 101 C.A.",
      "treatment": "followed",
      "relevance": "Payment of commission related to profits allowable as expenditure to earn profits."
    },
    {
      "case_name": "Commissioner of Inland Revenue v. 36/49 Holdings Ltd. (In Liquidation)",
      "citation": "25 T.C. 173",
      "treatment": "followed",
      "relevance": "Support for revenue nature."
    },
    {
      "case_name": "Commissioner of I.T. v. Kolhia Hirdagarh Co. Ltd.",
      "citation": "17 I.T.R. 545",
      "treatment": "followed",
      "relevance": "Support for revenue nature."
    },
    {
      "case_name": "Jones v. Commissioner of Inland Revenue",
      "citation": "1921 K.B. 711",
      "treatment": "followed",
      "relevance": "Support for revenue nature."
    },
    {
      "case_name": "Union Cold Storage Co. Ltd. v. Adamson (H.M. Inspector of Taxes)",
      "citation": "16 T.C. 292",
      "treatment": "referred",
      "relevance": "Explains Pondicherry observations; distinguishes rent from profit-sharing."
    },
    {
      "case_name": "Indian Radio & Cable Communications Co. Ltd. v. Commissioner of Income-tax Bombay",
      "citation": "5 I.T.R. 270",
      "treatment": "distinguished",
      "relevance": "Joint adventure; not allowable under s.10(2)(ix); distinguished."
    }
  ],
  "statutes_cited": [
    {
      "name": "Income-tax Act, 1922",
      "sections": [
        "Section 10(1)",
        "Section 10(2)(xv)"
      ],
      "relevance": "Profits computed after allowances; deduction for revenue expenditure wholly/exclusively for business purposes, not capital."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Supreme Court allowed the appeal, holding the payment of Rs. 42,480 to be revenue expenditure allowable as deduction under s.10(2)(xv), overruling Kerala High Court; answer to reference in affirmative.",
    "relief_granted": "Deduction allowed; High Court judgment set aside.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"In view of these facts we are of opinion that the payment of the sum of Rs. 42,480 in the present case is not in the nature of capital expenditure but is in the nature of revenue expenditure and the judgment of the High Court of Kerala on this point must be over-ruled.\"",
      "speaker": "court",
      "significance": "Conclusive holding on capital vs revenue nature from prior judgment."
    },
    {
      "text": "\"A payment out of profits and conditional on profits being earned cannot accurately be described as a payment made to earn profits. It assumes that profits have first come into existence.\"",
      "speaker": "court",
      "significance": "Quote from Pondicherry case, distinguished here."
    },
    {
      "text": "\"Once the crucial question is decided by this Court that the expenditure is not of a capital nature but is a revenue expenditure, we should have thought that the matter ended there.\"",
      "speaker": "court",
      "significance": "Emphasizes revenue nature suffices for deductibility."
    }
  ],
  "_case_id": "1972_408",
  "_label": 0,
  "_text_length": 32398,
  "_extracted_at": "2026-02-10T20:09:47.789995"
}