{
  "metadata": {
    "case_name": "Union of India & Ors. v. Ravi Varma, Ganapathi Kini & Ors. (C.As. Nos. 1845 & 1846 of 1968) and Union of India & Ors. v. Suresh Kumar & Tara Chand Jain (C.A. No. 50 of 1969)",
    "case_year": 1968,
    "court": "Supreme Court of India",
    "judges": [
      "Khanna, J."
    ],
    "case_number": "Civil Appeals Nos. 1845, 1846 of 1968 and Civil Appeal No. 50 of 1969",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Office Memorandum dated June 22, 1949 issued by Ministry of Home Affairs provided that seniority in each grade should generally be determined on the basis of the length of service in that grade irrespective of whether under Central or Provincial Government of India or Pakistan, for displaced government servants and temporary employees, extended to all categories.",
      "type": "background",
      "date": "1949-06-22",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Office Memorandum dated December 22, 1959 issued by Ministry of Home Affairs cancelled 1949 instructions except for persons appointed prior to that date, and provided general principles for seniority of persons appointed after that date, including permanent officers ranked senior to officiating, with no retrospective effect.",
      "type": "background",
      "date": "1959-12-22",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Ravi Varma appointed as Inspector in Central Excise Collectorate Madras on 27-5-1947, confirmed on 7-4-1956.",
      "type": "admitted",
      "date": "1947-05-27",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Ganapathi Kini appointed as Inspector in Central Excise Collectorate Madras on 28-5-1947, service computed from 10-10-1946 due to war service, confirmed on 7-4-1956.",
      "type": "admitted",
      "date": "1947-05-28",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "In 1959 seniority list of Inspectors, Ganapathi Kini at serial No. 115 and Ravi Varma at 141 based on length of service per 1949 OM.",
      "type": "admitted",
      "date": "1959",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Central Board of Revenue letter dated October 19, 1962 directed revised seniority list in 1963 computing from date of confirmation; Ganapathi Kini at 149, Ravi Varma at 150.",
      "type": "procedural",
      "date": "1962-10-19",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Ganapathi Kini and Ravi Varma filed writ petitions under Article 226 in Mysore High Court praying quashing of 1963 revised seniority list, claiming seniority per 1949 OM; Mysore HC allowed on January 10, 1968 and October 20, 1967.",
      "type": "procedural",
      "date": "1968-01-10",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Suresh Kumar appointed Lower Division Clerk in Medical Stores Depot, Karnal on October 9, 1950, confirmed March 31, 1960.",
      "type": "admitted",
      "date": "1950-10-09",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Tara Chand Jain appointed Lower Division Clerk in Medical Stores Depot, Karnal on November 26, 1951, confirmed March 31, 1960.",
      "type": "admitted",
      "date": "1951-11-26",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Seniority list per 1949 OM showed Suresh Kumar at 32, Tara Chand Jain at 34.",
      "type": "admitted",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Directorate General of Health Services Memorandum dated June 19, 1963 referred to 1959 OM, stated SC/ST confirmed in reserved vacancies rank senior to temporary/quasi-permanent irrespective of seniority list; revised list placed Suresh Kumar at 40, Tara Chand Jain at 42.",
      "type": "procedural",
      "date": "1963-06-19",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Suresh Kumar and Tara Chand Jain filed writ under Articles 226/227 in Punjab & Haryana HC; single judge dismissed, Letters Patent appeal reversed, directed revised list per original seniority.",
      "type": "procedural",
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Central Board of Revenue letter dated July 3, 1957 adopted rule that date of confirmation basis for seniority.",
      "type": "background",
      "date": "1957-07-03",
      "source": "petitioner"
    },
    {
      "id": "f14",
      "text": "Central Board of Revenue letter dated March 15, 1958 to Collectors reiterated permanent clerks first for promotions.",
      "type": "background",
      "date": "1958-03-15",
      "source": "petitioner"
    },
    {
      "id": "f15",
      "text": "Central Board of Revenue letter dated August 27, 1971 to Collectors superseded previous orders, applied 1959 OM to non-gazetted staff appointed after receipt.",
      "type": "procedural",
      "date": "1971-08-27",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether seniority of Ravi Varma and Ganapathi Kini should be determined by length of service per Office Memorandum dated June 22, 1949 or by date of confirmation as claimed by appellants.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Similar question for seniority of Suresh Kumar and Tara Chand Jain.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "After 1959 OM, seniority of all Central Government employees determined by date of confirmation, not length of service; 1959 OM effect is permanent senior to officiating.",
      "supporting_facts": [
        "f2"
      ],
      "legal_basis": "Office Memorandum dated December 22, 1959"
    },
    {
      "id": "pa2",
      "text": "For Central Excise clerks/supervisors/inspectors, Central Board of Revenue decided permanent employees precedence per letters July 3, 1957 and March 15, 1958.",
      "supporting_facts": [
        "f13",
        "f14"
      ],
      "legal_basis": "Central Board of Revenue letters"
    },
    {
      "id": "pa3",
      "text": "For Suresh Kumar and Tara Chand Jain, Office Memoranda January 28, 1952, April 20, 1961, March 27, 1963 provide departure for SC/ST benefit; DGHS memo June 19, 1963 implements 1959 OM.",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": "Office Memoranda dated 28-1-1952, 20-4-1961, 27-3-1963; DGHS memo 19-6-1963"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Seniority determined according to length of service in terms of Office Memorandum dated June 22, 1949.",
      "supporting_facts": [
        "f1",
        "f3",
        "f4",
        "f8",
        "f9"
      ],
      "legal_basis": "Office Memorandum dated June 22, 1949"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "1949 OM issued for displaced servants on compassionate grounds, extended to all; 1959 OM reviewed as objects achieved, not retrospective, applies only to appointments after its date.",
      "addresses_issue": "i1",
      "key_observation": "1959 OM expressly not retrospective: 'seniority of all persons appointed... after the date of these instructions'"
    },
    {
      "id": "cr2",
      "text": "In Mervyn Coutinho, confirmed 1959 principles not retrospective but from date of issue.",
      "addresses_issue": "i1",
      "key_observation": "Principles not to apply retrospectively"
    },
    {
      "id": "cr3",
      "text": "CBR letters 1957/1958 superseded by CBR letter 27-8-1971 applying 1959 OM only to post-receipt appointments.",
      "addresses_issue": "i1",
      "key_observation": "Seniority of pre-1959 appointees like GK/RV by 1949 OM length of service"
    },
    {
      "id": "cr4",
      "text": "OMs 1952/1961/1963 on SC/ST relate to recruitment/merit, not length of service rule; DGHS 1963 memo exceeds 1959 OM for pre-1959 appointees.",
      "addresses_issue": "i2",
      "key_observation": "SK/TCJ pre-1959, governed by 1949 OM; general questions by Home Affairs per Allocation Rules"
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Seniority of persons appointed to Central services before December 22, 1959 determined by length of service per 1949 OM, not date of confirmation per 1959 OM.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Revised seniority lists invalid; to be rectified per 1949 OM.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Mervyn Coutinho Ors. v. Collector of Customs, Bombay Ors.",
      "citation": "1966 3 S.C.R. 600",
      "treatment": "followed",
      "relevance": "1959 OM principles not retrospective but from date of issue"
    }
  ],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Article 226",
        "Article 227"
      ],
      "relevance": "Writ petitions filed under these articles"
    },
    {
      "name": "Government of India Allocation of Business Rules, 1961",
      "sections": [],
      "relevance": "General questions of recruitment, promotion, seniority in Central services dealt by Ministry of Home Affairs"
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court dismissed the appeals filed by Union of India, upheld High Court judgments directing determination of seniority of respondents (appointed before 1959) on basis of length of service per 1949 OM, quashed revised lists based on confirmation date.",
    "relief_granted": "High Courts' directions upheld: rectify seniority lists per 1949 OM",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"seniority should, as a general rule, be determined on the basis of the length of service in that Grade irrespective of whether the latter was under the Central or Provincial Government of India or Pakistan.\"",
      "speaker": "court",
      "significance": "Core of 1949 OM rule applied to pre-1959 appointees"
    },
    {
      "text": "\"hereafter the seniority of all persons appointed to the various Central Services after the date of these instructions should be determined in accordance with the General principles annexed hereto.\"",
      "speaker": "court",
      "significance": "1959 OM explicitly prospective only"
    },
    {
      "text": "\"the Office Memorandum dated December 22, 1959 and the provisions laid down in the Annexure thereto could not apply to persons appointed to the various Central services before the date of that Memorandum.\"",
      "speaker": "court",
      "significance": "Key holding on non-retrospectivity"
    }
  ],
  "_case_id": "1972_12",
  "_label": 0,
  "_text_length": 26653,
  "_extracted_at": "2026-02-10T20:07:28.443447"
}