{
  "metadata": {
    "case_name": "Appellant v. State",
    "case_year": 1968,
    "court": "Supreme Court of India",
    "judges": [
      "Grover, J."
    ],
    "case_number": "Criminal Appeal No. 67 of 1968",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "A Sen-Raleigh cycle was stolen from the possession of Sheo Charan Lal on March 24, 1965. He reported the matter to the Police on March 25, 1965.",
      "type": "material",
      "date": "1965-03-24",
      "source": "prosecution"
    },
    {
      "id": "f2",
      "text": "On May 11, 1965, Station House Officer A.D.N. Sinha, Incharge Giridih Police Station, apprehended Mohd. Siddique running away with a cycle on Moharram day and took the cycle into custody.",
      "type": "material",
      "date": "1965-05-11",
      "source": "prosecution"
    },
    {
      "id": "f3",
      "text": "Mohd. Siddique made a statement to the police officer which led to search of the appellant's premises. Seven cycles including the stolen Sen-Raleigh cycle and three other cycles (total 10 cycles) were recovered from the appellant's house.",
      "type": "material",
      "date": "1965-05-11",
      "source": "prosecution"
    },
    {
      "id": "f4",
      "text": "It was not disputed that the Sen-Raleigh cycle was recovered from the appellant's house on May 11, 1965 and that it was stolen.",
      "type": "admitted",
      "date": "1965-05-11",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Mohd. Siddique and the appellant were tried; Siddique under s.379 IPC (convicted, sentenced, no appeal); appellant under s.411 IPC (convicted, 3 years RI). Patna High Court upheld in Criminal Appeal No. 407 of 1966 on January 18, 1968.",
      "type": "procedural",
      "date": "1968-01-18",
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "Appellant's explanation: three out of 10 cycles belonged to family members; other seven pledged with him as pawn broker business. Sen-Raleigh cycle pledged by Siddique.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "PW1 Jayantilal and PW2 Shyam Narain Singh deposed that appellant and family lived in same house, worked as contractors, took things on pawn (ornaments, utensils; PW2 not seen cycles pledged).",
      "type": "background",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f8",
      "text": "Appellant produced Exh. DA (scribed by Baldev Pandit, attested by Mahabir Sao, Nanden): Rs.80 advance to Siddique, cycle pledged. Scribe and attesting witnesses did not testify. DW1 Ramjit Sao (neighbour) said document scribed in his presence, Rs.80 paid, cycle pawned.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "Courts below found Exh. DA manufactured, not genuine. No evidence produced about pledging of other cycles or other pledged articles found during search.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Investigating Officer deposed: after recovery of 10 cycles, verified police records; besides Sen-Raleigh, cases instituted re four more cycles. At least two cycles admitted by Siddique as stolen by him.",
      "type": "material",
      "date": null,
      "source": "prosecution"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the appellant received the stolen Sen-Raleigh cycle knowing or having reason to believe it to be stolen, guilty under s.411 IPC.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Correct ambit of presumption under s.114 illustration (a) Evidence Act: whether explanation that cycle pledged in ordinary course of pawn broker business 'might reasonably be true'.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether other recovered cycles and lack of enquiry relevant to guilt under s.411 for specific cycle.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Trial confined to Sen-Raleigh cycle; prosecution re other cycles should not be considered.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Approach re no bona fide enquiry unsustainable; subjective test applies: was appellant aware/believed/suspected stolen and shut eyes? Cited Atwal v. Massey.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": "Atwal v. Massey (1971) 3 All ER 881"
    },
    {
      "id": "pa3",
      "text": "Misapplication of s.114(a) Evidence Act presumption. Explanation given (pledge in business, supported by evidence) might reasonably be true even if not convincing; prosecution fails to prove beyond doubt. Cited Otto George Gfeller v. King; Rex v. Abramovitch.",
      "supporting_facts": [
        "f6",
        "f7",
        "f8"
      ],
      "legal_basis": "Evidence Act s.114 ill.(a); Otto George Gfeller v. The King (1943 PC 211); Rex v. Abramovitch (1914) 84 LJ KB 391"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "No ordinary precaution of enquiring ownership before advancing loan; Exh.A silent on source/acquisition of cycle by Siddique; not bona fide pawn broker transaction.",
      "supporting_facts": [
        "f8",
        "f9"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "At least two of 10 cycles stolen (admitted by Siddique); Investigating Officer verification re four more (even if inadmissible); conduct not consistent with ordinary prudence.",
      "supporting_facts": [
        "f3",
        "f10"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "High Court considered lack of enquiry, silence in Exh.A on source, multiple stolen cycles, no prudent conduct; upheld conviction.",
      "addresses_issue": "i1",
      "key_observation": "Transaction could not have been bona fide."
    },
    {
      "id": "cr2",
      "text": "Explanation examined: Exh.DA not proved; no other pledged articles; no books/accounts for pawn business; multiple cycles including stolen ones; explanation not 'reasonably true'. Presumption under s.114(a) applies, not rebutted.",
      "addresses_issue": "i2",
      "key_observation": "Circumstances justify holding explanation could not reasonably be true."
    },
    {
      "id": "cr3",
      "text": "Accepted law from Otto George Gfeller/Rex v. Abramovitch on presumption.",
      "addresses_issue": "i2",
      "key_observation": "If explanation might reasonably be true and consistent with innocence, acquit; here not."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Explanation not reasonably true; presumption under s.114(a) Evidence Act drawn that appellant received stolen property knowing it to be stolen.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Conviction under s.411 IPC sustainable despite other cycles evidence.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Atwal v. Massey",
      "citation": "1971 3 All. E.R. 881",
      "treatment": "referred",
      "relevance": "Laid down subjective test for knowledge/belief under equivalent of s.411 IPC; cited by appellant."
    },
    {
      "case_name": "Otto George Gfeller v. The King",
      "citation": "1943 P.C. 211",
      "treatment": "followed",
      "relevance": "Correct statement on presumption under s.114(a) Ev Act: explanation reasonably true leads to acquittal."
    },
    {
      "case_name": "Rex v. Abramovitch",
      "citation": "1914 84 L.J. K.B. 391",
      "treatment": "followed",
      "relevance": "Statement on presumption where accused possesses recently stolen goods."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "s.411",
        "s.379"
      ],
      "relevance": "Appellant convicted under s.411 (dishonestly receiving stolen property); Siddique under s.379 (theft)."
    },
    {
      "name": "Indian Evidence Act",
      "sections": [
        "s.114 illustration (a)"
      ],
      "relevance": "Presumption: person in possession of stolen property soon after theft is thief or receiver knowing it stolen, unless accounts for possession."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court upheld the Patna High Court's judgment convicting the appellant under s.411 IPC and sentencing him to three years rigorous imprisonment. The appeal by special leave was dismissed.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"the question was a subjective one was the appellant aware of the theft or did he believe the goods to be stolen or did he, suspecting the goods to be stolen, deliberately shut his eyes to the circumstances?\"",
      "speaker": "petitioner_counsel",
      "significance": "Argues for subjective test over objective enquiry for s.411 guilt."
    },
    {
      "text": "\"if an explanation were given which the jury think might reasonably be true, and which is consistent with innocence although they were not convinced of its truth the prisoners were entitled to be acquitted\"",
      "speaker": "court",
      "significance": "Key test for rebutting s.114(a) presumption from Otto George Gfeller."
    },
    {
      "text": "\"we are unable to come to the conclusion that the explanation could be regarded such as might reasonably be true.\"",
      "speaker": "court",
      "significance": "Court's holding that appellant's pledge explanation fails presumption test."
    }
  ],
  "_case_id": "1972_219",
  "_label": 0,
  "_text_length": 11636,
  "_extracted_at": "2026-02-10T20:08:18.323233"
}