{
  "metadata": {
    "case_name": "Sabharwal Brothers v. Respondent No. 1",
    "case_year": 1971,
    "court": "Supreme Court of India",
    "judges": [
      "Mitter, J."
    ],
    "case_number": "C.A. No. 1574 of 1971",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Respondent No. 1 was the owner of a flat on the second floor of Block No. 8 Shyam Niwas, Warden Road, Bombay. She was a member of a Co-operative Housing Society and had acquired the flat from the said society.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "In 1959, Respondent No. 1 put the appellant Sabharwal Brothers in possession of the flat for a period of 11 months on payment of Rs. 510/- per month. There was an agreement in writing which purported to show that the possession was to be on leave and licence basis. This agreement was signed by a partner of Sabharwal Brothers who also became member of the said Co-operative Society.",
      "type": "material",
      "date": "1959",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "There were repeated renewals of the said agreement until 25th October, 1962 when the first respondent asked the appellants to vacate possession on the ground that she required the flat for her personal occupation.",
      "type": "material",
      "date": "1962-10-25",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Respondent No. 1 filed a statement of claim before the Registrar of Co-operative Societies on the ground that there was a dispute within the meaning of s. 91 of the Maharashtra Co-operative Societies Act which required adjudication.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Appellants challenged the jurisdiction of the nominee of the Registrar to whom it was referred.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "On July 3, the nominee made an award to the effect that the appellants were occupying the flat on leave and licence basis.",
      "type": "procedural",
      "date": "1970-07-03",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Anticipating the award, the appellants filed a suit in the Court of Small Causes Bombay stating that they were in occupation of the flat as tenants and as such entitled to protection under the Bombay Rent Act, 1947 and the first respondent had no right to evict them.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "In her written statement the defendant denied that the plaintiffs were tenants contending, inter alia, that the plaintiffs were occupying the flat only on leave and licence basis etc. that the dispute between the parties had been referred to the Registrar of Co-operative Societies for disposal and finally that the Court of Small Causes had no jurisdiction to entertain and try a suit involving such a dispute.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f9",
      "text": "The Small Causes Court framed no less than twelve issues of which issues 2 to 8 related to the maintainability of the suit and the jurisdiction of the court in view of the provisions of s. 91(1)(d) of the Act. The Small Causes Court held that the suit was maintainable and answered the other preliminary issues in favour of the plaintiff.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "The matter was taken in revision to a Bench of the said Small Causes Court. The Bench took a different view holding that the Registrar's nominee did have jurisdiction to try the dispute between the parties and remanded the proceedings to the trial court for disposal of the suit after deciding on issue as to res judicata by reason of the award of the nominee.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "The High Court dismissed the Special Civil Application of the plaintiffs holding that the revisional court of the Small Causes was justified in coming to the conclusion that it was no longer open to the plaintiffs to contend that the Registrar or his nominee had no jurisdiction to entertain the dispute.",
      "type": "procedural",
      "date": "1971-07-06",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Bye-law No. 2 of the Society: objects inter alia to carry on the trade of buying, selling, hiring and letting land in accordance with the co-operative principles. Regulation No. 5 in form A: No tenant shall assign, underlet, vacate or part with the possession of the tenement or any part thereof without the consent in writing of the society.",
      "type": "background",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether there was any dispute between the parties touching the business of the Co-operative Society which could be decided by the Registrar or referred by him to a nominee for disposal.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the suit filed in the Small Causes Court was maintainable having regard to the nature of the relief sought.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The dispute between the parties is not capable of reference under s.91(1)(b) of the Maharashtra Co-operative Societies Act as it does not touch the business of the society.",
      "supporting_facts": [
        "f2",
        "f3",
        "f12"
      ],
      "legal_basis": "Maharashtra Co-operative Societies Act s.91(1)(b); Bye-law No. 2"
    },
    {
      "id": "pa2",
      "text": "Letting by a member to another member does not concern the business of the society once the society has sold the flat to the member.",
      "supporting_facts": [
        "f1",
        "f2"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "The suit in Small Causes Court claiming tenancy under Bombay Rent Act is maintainable.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "Bombay Rent Act, 1947"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The dispute touches the business of the society as per bye-laws, and is referable to Registrar under s.91; nominee had jurisdiction.",
      "supporting_facts": [
        "f4",
        "f5",
        "f6",
        "f12"
      ],
      "legal_basis": "Maharashtra Co-operative Societies Act s.91(1)"
    },
    {
      "id": "ra2",
      "text": "Plaintiffs occupy on leave and licence basis; Small Causes Court has no jurisdiction due to reference to Registrar.",
      "supporting_facts": [
        "f2",
        "f8"
      ],
      "legal_basis": "Maharashtra Co-operative Societies Act s.91(3), s.163(1)"
    },
    {
      "id": "ra3",
      "text": "Award of nominee is final as no appeal filed; res judicata applies.",
      "supporting_facts": [
        "f6",
        "f10"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Letting by a member to another does not touch the business of the society; 'to touch means to come in contact with' and there is no point of contact when society is not the landlord.",
      "addresses_issue": "i1",
      "key_observation": "The letting of flat by respondent No. 1 was a transaction of the same nature as the society itself was empowered to enter into but such letting by itself did not concern the business of the society."
    },
    {
      "id": "cr2",
      "text": "Bye-laws constitute agreement between members; breach affects membership but letting by member post-sale does not affect society's business.",
      "addresses_issue": "i1",
      "key_observation": "Nothing was brought to our notice to show that such a letting would affect the business of the society once it had sold the flat to the respondent No. 1."
    },
    {
      "id": "cr3",
      "text": "High Court erred in holding nominee's decision final without jurisdiction challenge being open; fundamental error in approach.",
      "addresses_issue": "i2",
      "key_observation": "It was no longer open to plaintiffs to contend no jurisdiction only if jurisdiction was properly assumed."
    },
    {
      "id": "cr4",
      "text": "Two Acts harmonised by holding Bombay Rent Act provisions apply in matters covered by it rather than Co-operative Act.",
      "addresses_issue": "i2",
      "key_observation": "Reference to Deccan Merchants case."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The dispute between the parties is not a dispute touching the business of the society under s.91(1)(b) of the Maharashtra Co-operative Societies Act and is not referable to the Registrar or nominee.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "The suit in Small Causes Court is maintainable; Registrar nominee lacked jurisdiction.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Deccan Merchants Co-operative Bank Ltd. v. M/s Dalichand Jugraj Jain and others",
      "citation": "1969 1 S.C.R. 887",
      "treatment": "referred",
      "relevance": "Observations that in matters covered by Bombay Rent Act, its provisions rather than Co-operative Societies Act should apply to harmonise the two Acts."
    }
  ],
  "statutes_cited": [
    {
      "name": "Maharashtra Co-operative Societies Act",
      "sections": [
        "s. 91(1)(b)",
        "s. 91(1)(d)",
        "s. 91(3)",
        "s. 163(1)"
      ],
      "relevance": "Defines disputes referable to Registrar; bars court jurisdiction over such disputes."
    },
    {
      "name": "Bombay Rent Act, 1947",
      "sections": [
        "s. 28"
      ],
      "relevance": "Provides protection to tenants; competes with Co-operative Act jurisdiction."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; judgments and orders of Bombay High Court and Bench of Court of Small Causes set aside; suit in Small Causes Court held maintainable as dispute not touching business of society.",
    "relief_granted": "Appeal allowed, lower court orders set aside.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "'To touch means to come in contact with and it does not appear that there is a point of contact between a letting by the respondent No. 1 and the business of the society when the society was not itself the landlord of the flat.'",
      "speaker": "court",
      "significance": "Core reasoning on why dispute not referable under s.91."
    },
    {
      "text": "The two acts can be harmonised best by holding that in matters covered by the Rent Act, its provisions, rather than the provisions of the Act, should apply.",
      "speaker": "court",
      "significance": "Resolution of competing jurisdictions, citing Deccan Merchants."
    }
  ],
  "_case_id": "1972_129",
  "_label": 1,
  "_text_length": 9193,
  "_extracted_at": "2026-02-10T20:08:25.992302"
}