{
  "metadata": {
    "case_name": "Income-tax Officer, Gorakhpur v. Ram Prasad",
    "case_year": 1969,
    "court": "Supreme Court of India",
    "judges": [
      "Hegde, J."
    ],
    "case_number": "C.A. Nos. 257 and 258 of 1969",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The first respondent Ram Prasad was the Karta of a Hindu undivided family which carried on business in the name and style of Ram Nath Ram Prasad.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Assessments were made on the family for income-tax for the assessment years 1944-45 to 1947-48 and for excess profits tax for the corresponding chargeable accounting periods respectively ending on October 28, 1943, October 16, 1944, November 4, 1945 and March 31, 1946.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The income-tax assessments for the assessment year 1944-45 and the excess profits tax assessment for the corresponding chargeable accounting period ending on October 28, 1943 were set aside by the Income-tax Appellate Tribunal with the direction that fresh orders of assessment be made in accordance with the directions given by the Tribunal.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On September 25, 1951, under a scheme for voluntary disclosure, the first respondent disclosed by means of an application a sum of Rs. 2,08,450 and offered the same for taxation.",
      "type": "material",
      "date": "1951-09-25",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "On October 1, 1951, the Hindu undivided family disrupted and there was a complete partition, which was accepted by the department as of that date.",
      "type": "material",
      "date": "1951-10-01",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Thereafter fresh assessments to income-tax were made for the assessment years 1944-45 to 1947-48 taking into consideration the disclosures made by the first respondent. There is no dispute about those assessments.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Subsequently notices were issued under s. 13 of the Excess Profits Tax Act, 1940 to the first respondent on February 14, 1957 for all the four chargeable accounting periods ending on October 28, 1943, October 16, 1944, November 4, 1945 and March 31, 1946.",
      "type": "procedural",
      "date": "1957-02-14",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Immediately thereafter the first respondent filed two writ petitions before the Allahabad High Court challenging the validity of the notices issued.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "After the institution of those writ petitions on April 8, 1958, the appellant issued three notices to the respondent under s. 15 of the Act in respect of the chargeable accounting periods ending on October 16, 1944, November 4, 1945 and March 31, 1946.",
      "type": "procedural",
      "date": "1958-04-08",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Thereafter the writ petitions filed by the first respondent were amended and the validity of those notices was also challenged.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "The learned single judge who heard the writ petitions allowed the same holding that the appellant was not competent to take proceedings under the provisions of the Act in respect of Hindu undivided family which had been divided.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Aggrieved by that decision, the appellant took up the matter in appeal to the Division Bench of the Allahabad High Court. The Division Bench upheld the decision of the learned single judge.",
      "type": "procedural",
      "date": "1967-07-11",
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Aggrieved by the decision of the Allahabad High Court in Misc. Writ Petitions Nos. 1057 and 1059 of 1957, the Income-tax Officer, Gorakhpur has brought these appeals after obtaining special leave from this Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the Excess Profits Tax Officer is competent to issue notices and make assessments under the Excess Profits Tax Act, 1940 in respect of a Hindu undivided family which has undergone complete partition after the relevant chargeable accounting periods.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "In the case of Excess Profits Tax, the tax is levied on the business and not on any individual and therefore what is relevant is the continuation of the business and not the continuity of the identity of the assessee. If the business continues, the fact that the identity of the person who is continuing the business has changed is not relevant.",
      "supporting_facts": [
        "f2",
        "f5",
        "f6"
      ],
      "legal_basis": "Section 4 of the Excess Profits Tax Act, 1940"
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The word 'paid' in the context of s.4 can only refer to the person. That is a clear indication that the Act contemplates assessment of the tax on a person though on the basis of the profits from a business.",
      "addresses_issue": "i1",
      "key_observation": "Section 4 refers to assessments in respect of any business but tax to be paid by the person."
    },
    {
      "id": "cr2",
      "text": "This conclusion receives support from s.5 of the Act which states that the Act is to apply to every business of which any part of the profits made during the chargeable accounting period is chargeable to income-tax.",
      "addresses_issue": "i1",
      "key_observation": "Basis of assessment is accrual of profits to a person."
    },
    {
      "id": "cr3",
      "text": "Section 14(1) provides for assessment of the tax after the return is submitted and requires furnishing a copy of the order to the person on whom the assessment has been made. Sub-section (2) imposes liability to pay on the person carrying on the business in that period.",
      "addresses_issue": "i1",
      "key_observation": "Assessment is on the person carrying on the business."
    },
    {
      "id": "cr4",
      "text": "Section 44 of the Indian Income-tax Act, 1922 applies only to firms and association of persons. Hindu undivided family is neither a firm nor an association of persons. It is a separate entity by itself.",
      "addresses_issue": "i1",
      "key_observation": "HUF is distinct assessee under s.3 of IT Act, 1922."
    },
    {
      "id": "cr5",
      "text": "There is no provision in the Excess Profits Tax Act similar to s.25A of the Indian Income-tax Act, 1922 which provides for assessment after partition of HUF. The legislature did not include s.25A in s.21 of the Act nor make any similar provision.",
      "addresses_issue": "i1",
      "key_observation": "No mechanism for post-partition assessment under EPT Act."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Excess Profits Tax assessment is on the person carrying on the business during the chargeable accounting period, and change in identity due to partition of HUF prevents assessment post-partition absent specific provision.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Commissioner of Excess Profits Tax, Madras v. Jivraj Topun and Sons, Madras",
      "citation": "(1950) 20 ITR 143",
      "treatment": "followed",
      "relevance": "Excess Profits Tax is assessed on the person in the same manner as under the Income-tax Act."
    }
  ],
  "statutes_cited": [
    {
      "name": "Excess Profits Tax Act, 1940",
      "sections": [
        "2(17)",
        "4",
        "5",
        "13",
        "14",
        "21"
      ],
      "relevance": "Defines person including HUF; charging section on business profits; notices, assessment and payment by person carrying business; attracts IT Act provisions except partition-specific."
    },
    {
      "name": "Indian Income-tax Act, 1922",
      "sections": [
        "3",
        "4(3)",
        "25A",
        "44",
        "4A",
        "4B",
        "10",
        "13",
        "24B",
        "29",
        "36 to 44C",
        "45 to 48",
        "49E",
        "49F",
        "50",
        "54",
        "61 to 63",
        "65 to 67A"
      ],
      "relevance": "Classifies HUF as separate assessee; provides for post-partition assessment (not applied to EPT); s.44 for firms/AOP; provisions attracted via s.21 EPT Act."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeals by the Income-tax Officer against the Allahabad High Court's decision allowing writ petitions and holding no competence to proceed under EPT Act post-partition of HUF are dismissed, as the Court holds assessment must be on the person carrying the business during the period and no provision exists for post-partition HUF like s.25A IT Act.",
    "relief_granted": "Writ petitions upheld; no EPT proceedings allowed",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The word 'paid' in the context can only refer to the person. That is a clear indication that the Act contemplates assessment of the tax on a person though on the basis of the profits from a business.",
      "speaker": "court",
      "significance": "Interprets s.4 EPT Act to levy tax on person, not just business."
    },
    {
      "text": "Hindu undivided family is neither a firm nor an association of persons. It is a separate entity by itself.",
      "speaker": "court",
      "significance": "Distinguishes HUF from entities covered by s.44 IT Act."
    },
    {
      "text": "There is no provision in the Act similar to s. 25-A of the Indian Income-tax Act, 1922.",
      "speaker": "court",
      "significance": "Highlights absence of partition provision in EPT Act."
    }
  ],
  "_case_id": "1972_313",
  "_label": 0,
  "_text_length": 13512,
  "_extracted_at": "2026-02-10T20:09:02.381904"
}