{
  "metadata": {
    "case_name": "G.L. Bhatia v. State",
    "case_year": 1968,
    "court": "Supreme Court of India",
    "judges": [
      "Grover, J."
    ],
    "case_number": "Criminal Appeal No.51 of 1968",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "In March 1966 a suit was filed against the appellant by D. N. Santani who is also an Advocate for recovery of Rs. 640/- in the court of the Civil Judge, Junior Division, Kalyan. The plaintiff in that suit had engaged H. I. Jagiasi as his Advocate.",
      "type": "background",
      "date": "1966-03",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "In the written statement filed by the appellant he made certain allegations against Jagiasi and alleged inter alia that the latter was responsible for the suit.",
      "type": "material",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "Jagiasi filed a criminal complaint for defamation in August 1966 against the appellant in the court of Shri P. D. Sayyid, Judicial Magistrate at Kalyan.",
      "type": "material",
      "date": "1966-08",
      "source": "lower_court"
    },
    {
      "id": "f4",
      "text": "On October 15, 1966 the appellant filed an application before the Judicial Magistrate saying that he intended to apply for transfer of the case to some other court.",
      "type": "procedural",
      "date": "1966-10-15",
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "On October 28, 1966 he presented a transfer application in the court of the Sessions Judge, Thana.",
      "type": "procedural",
      "date": "1966-10-28",
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "The transfer application was ultimately dismissed by the Assistant Judge and Additional Sessions Judge on March 8, 1967.",
      "type": "procedural",
      "date": "1967-03-08",
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "The appellant applied for transfer of the civil suit which had been filed by D. N. Santani to the court of the District Judge. The suit was stayed and ultimately it was transferred sometime in the year 1967 from the court of Shri B. Baadkar.",
      "type": "procedural",
      "date": "1967",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "The civil suit was ultimately dismissed in August 1969.",
      "type": "procedural",
      "date": "1969-08",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "While dismissing the transfer application of the appellant in the criminal complaint filed by Jagiasi in the court of Shri P. D. Sayyid the Additional Sessions Judge recorded an order that a report be submitted to the High Court for considering the conduct of the appellant and the course adopted by him in making the transfer application and in making imputations or aspersions against the Judicial Officers and to take action for contempt of court under s. 3 of the Contempt of Courts Act, 1952.",
      "type": "procedural",
      "date": "1967-03-08",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "The High Court made an order on December 1, 1967, referring the matter for suitable action against the respondent-Advocate for making such allegations.",
      "type": "procedural",
      "date": "1967-12-01",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "The High Court directed the District Judge to record the evidence and to submit his report along with the evidence and the reports of the two judges. The inquiry was confined to the allegations quoted in para 1 of the transfer application.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Show cause notice issued to the appellant by the High Court confined to paragraph 1 of the transfer application.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "The District Judge submitted a report giving his own findings on the evidence recorded by him and also after taking into consideration the reports of Sarvshri Baadkar and Sayyid.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "The appellant raised preliminary objections before the High Court: District Judge could only submit record of evidence and could not give findings; could not take into consideration reports of two judges not shown to appellant; no opportunity to cross-examine the judicial officers.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f15",
      "text": "The High Court repelled all preliminary objections.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f16",
      "text": "Bombay High Court found the appellant guilty of contempt of court and sentenced him to simple imprisonment for four weeks and a fine of Rs. 1,000/-. In default of payment of fine, further simple imprisonment for four weeks. Ordered to pay costs of Assistant Government Pleader in High Court and Government Pleader before Sessions Judge.",
      "type": "material",
      "date": "1968-02-02",
      "source": "court"
    },
    {
      "id": "f17",
      "text": "Allegations in para 1 of transfer application: The Magistrate below is on friendly relations with the complainant the respondent No. 1 in the present petition and he even enjoys the hospitality of the respondent No. 1 some times alone and some times in company of the Civil Judge J. D. Kalyan Shri M. B. Baadkar who is also on friendly relations with the respondent No.1 and who also enjoys the hospitality of the respondent No. 1.",
      "type": "disputed",
      "date": "1966-10-28",
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the allegation made in para 1 of the transfer application amounts to contempt of court under s. 3 of the Contempt of Courts Act, 1952.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the Contempt of Courts Act, 1952 is unconstitutional and invalid, violating Articles 20 and 21 of the Constitution.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether proper procedure was followed in the contempt proceedings.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The Act is unconstitutional and invalid. It violates Articles 20 and 21 of the Constitution. No procedure has been provided in the Act and therefore it is bad. Even the normal procedure which should be followed in such cases has not been followed.",
      "supporting_facts": [],
      "legal_basis": "Articles 20, 21 of Constitution"
    },
    {
      "id": "pa2",
      "text": "The High Court was not entitled to call for a report from the District Judge or to delegate its functions, including the examination of witnesses to the District Judge.",
      "supporting_facts": [
        "f13",
        "f14"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "The show cause notice issued by the High Court containing the charge of contempt was confined only to paragraph 1 of the transfer application. The statements made in that paragraph could not by themselves constitute contempt.",
      "supporting_facts": [
        "f12",
        "f17"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The allegations in para 1 of the transfer application were serious, attacking the integrity and honesty of the courts of the Judicial Magistrate and the Civil Judge, scandalizing and maligning the same.",
      "supporting_facts": [
        "f9",
        "f17"
      ],
      "legal_basis": "s. 3 Contempt of Courts Act, 1952"
    },
    {
      "id": "ra2",
      "text": "The appellant failed to prove the allegations; he pitched the case higher by trying to prove the judges were receiving bribes.",
      "supporting_facts": [
        "f13"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "It is wholly unnecessary to decide points regarding constitutionality and procedure because the appellant must succeed on the point that para 1 does not constitute contempt.",
      "addresses_issue": "i1",
      "key_observation": "The High Court confined action to para 1."
    },
    {
      "id": "cr2",
      "text": "Principles from Perspective Publications: Committals for contempt for scandalizing the court have become obsolete. Summary jurisdiction must be exercised with great care; distinction between mere defamation and contempt calculated to interfere with course of justice.",
      "addresses_issue": "i1",
      "key_observation": "Test: whether impugned publication interferes with due course of justice or proper administration of law."
    },
    {
      "id": "cr3",
      "text": "Mere statement that a Magistrate is friendly with a party who is an advocate and enjoys his hospitality does not constitute contempt unless there is imputation of improper motives amounting to scandalizing the court.",
      "addresses_issue": "i1",
      "key_observation": "Allegations in para 1 may amount to defamation but do not fulfil tests for contempt."
    },
    {
      "id": "cr4",
      "text": "In State of MP v. Revashankar, aspersions in transfer petition scandalizing court constituted contempt, but here allegations do not reach that level.",
      "addresses_issue": "i1",
      "key_observation": "Aspersions must tend to create distrust in popular mind."
    },
    {
      "id": "cr5",
      "text": "Applications for transfer stand on slightly different footing; judge often given opportunity to explain. Nature of allegations must be closely examined.",
      "addresses_issue": "i1",
      "key_observation": "No punishment unless allegations satisfy requirements of contempt."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Allegations in para 1 of transfer application do not constitute contempt of court under s. 3 of the Contempt of Courts Act, 1952.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Perspective Publications (P) Ltd. & Anr. v. State of Maharashtra",
      "citation": "1969 2 S.C.R. 779",
      "treatment": "followed",
      "relevance": "Laid down principles on contempt by scandalizing court: obsolete, exercise with care, distinction from defamation, tests for interference with justice."
    },
    {
      "case_name": "State of Madhya Pradesh v. Revashankar",
      "citation": "1959 S.C.R. 1367",
      "treatment": "followed",
      "relevance": "Allegations in transfer application scandalizing magistrate constitute contempt under s.3; aspersions create distrust."
    },
    {
      "case_name": "Brahma Prakash Sharma v. State of Uttar Pradesh",
      "citation": "1953 SCR 1169",
      "treatment": "referred",
      "relevance": "Publication disparaging judge injures public if creates apprehension about integrity or deters litigants."
    },
    {
      "case_name": "State v. The Editors, Publishers of Eastern Times and Prajatantra",
      "citation": null,
      "treatment": "referred",
      "relevance": "Punitive jurisdiction confined to grave scurrilous attacks lowering prestige of court."
    },
    {
      "case_name": "Swarnamayi Panigrahi v. B. Nayak & Ors.",
      "citation": "A.I.R. 1952 Orissa 318",
      "treatment": "referred",
      "relevance": "Exceeded limits in transfer application by maligning integrity and attacking administration of justice."
    },
    {
      "case_name": "Emperor v. Murli Dhar & Another",
      "citation": "I.L.R. 8 All. 284",
      "treatment": "distinguished",
      "relevance": "Assertion of intimacy in transfer application not offence under s.228 IPC, no intention to insult."
    },
    {
      "case_name": "Debi Prasad Sharma & Others v. Emperor",
      "citation": null,
      "treatment": "referred",
      "relevance": "Untrue allegation against Chief Justice in newspaper report."
    }
  ],
  "statutes_cited": [
    {
      "name": "Contempt of Courts Act, 1952",
      "sections": [
        "Section 3"
      ],
      "relevance": "Action for contempt taken under this section for scandalizing court."
    },
    {
      "name": "Code of Criminal Procedure",
      "sections": [
        "Section 204(b)"
      ],
      "relevance": "Summons not accompanied by copy of complaint as required."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 20",
        "Article 21"
      ],
      "relevance": "Alleged violation by Contempt Act."
    },
    {
      "name": "Indian Penal Code",
      "sections": [
        "Section 228"
      ],
      "relevance": "Related to insulting court, distinguished in transfer applications."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "The appeal is allowed. The allegations in paragraph 1 of the transfer application do not amount to contempt of court. The judgment and order of the Bombay High Court dated February 2, 1968 finding the appellant guilty of contempt and sentencing him is set aside.",
    "relief_granted": "Appeal allowed; conviction and sentence set aside",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"It will not be right to say that the committals for contempt for scandalizing the court have become obsolete.\"",
      "speaker": "court",
      "significance": "Principle from Perspective Publications on when contempt jurisdiction exercised."
    },
    {
      "text": "\"The test in each case would be whether the impugned publication is a mere defamatory attack on the judge or whether it is calculated to interfere with the due course of justice.\"",
      "speaker": "court",
      "significance": "Key test distinguishing defamation from contempt."
    },
    {
      "text": "\"It is difficult to comprehend that the mere statement that a Magistrate is friendly with a party who happens to be an advocate and enjoys his hospitality or has friendly relations with him will constitute contempt unless there is an imputation of some improper motives.\"",
      "speaker": "court",
      "significance": "Direct holding on why para 1 not contempt."
    }
  ],
  "_case_id": "1972_82",
  "_label": 1,
  "_text_length": 24078,
  "_extracted_at": "2026-02-10T20:07:26.343472"
}