{
  "metadata": {
    "case_name": "Oil and Natural Gas Commission v. Workmen",
    "case_year": 1972,
    "court": "Supreme Court of India",
    "judges": [
      "Dua, J."
    ],
    "case_number": "Civil Appeal No. 391 of 1972",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Central Government constituted National Industrial Tribunal at Dhanbad with Shri Kamal Sahai as Presiding Officer vide notification dated August 21, 1968 No. S.O. 3088 and referred industrial dispute vide Reference No. NIT 4 of 1970.",
      "type": "procedural",
      "date": "1968-08-21",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Dispute referred: Whether demand to stop extra hours for office administrative staff in workshop and fix hours like office staff justified; whether demand for compensation from June 1965 at overtime rate or 20% factory allowance justified.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On retirement of Shri Kamal Sahai, dispute referred to Tribunal presided by Mr. Justice N. Chandra on December 10, 1970.",
      "type": "procedural",
      "date": "1970-12-10",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Tribunal settled issues including demands on working hours and compensation, validity of settlement on 20th January 1968, and jurisdiction over certain sections.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "Oil and Natural Gas Commission has central workshop at Baroda controlling western region workshops; workmen transferable across workshops and regions.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "From December 1964 to June 1965, office administrative staff worked 10 a.m. to 5 p.m. with half-hour interval (6.5 hours work) in shed 2 km away due to construction.",
      "type": "admitted",
      "date": "1964-12 to 1965-06",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "From June 1965, after shifting to workshop site, working hours fixed at 8 a.m. to 5 p.m. with one-hour interval (8 hours work).",
      "type": "admitted",
      "date": "1965-06",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Variations in administrative staff hours in other ONGC projects: Jammu (9 or 8.5 hrs incl interval), DehraDun (8.5 hrs), Cauvery (8.5 hrs), others 6.5 or less excluding interval.",
      "type": "background",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Tribunal held no condition of service for 6.5 hours; s.9A inapplicable; reduced hours to 6.5 for clerical staff excluding time-keepers/store-keepers; awarded 10% compensation.",
      "type": "procedural",
      "date": "1971-11-18",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Shri S. Hassan (MW1) stated reduction in office staff hours would adversely affect connected work, especially as Baroda is central workshop controlling western region.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether demand to stop extra hours of work for office administrative staff in workshop and fix working hours on lines of office staff justified?",
      "framed_by": "lower_court"
    },
    {
      "id": "i2",
      "text": "Whether demand for compensation to administrative staff for extra hours from June 1965 at overtime rate or 20% factory allowance justified? If so, to what relief?",
      "framed_by": "lower_court"
    },
    {
      "id": "i3",
      "text": "Was change in working hours from 6.5 to 8 hours violative of s.9A of Industrial Disputes Act?",
      "framed_by": "respondent"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "6.5 hours was temporary due to construction and accommodation shortage; no term in appointment letters; s.9A inapplicable as no change in condition of service.",
      "supporting_facts": [
        "f6",
        "f7"
      ],
      "legal_basis": "Section 9A Industrial Disputes Act"
    },
    {
      "id": "pa2",
      "text": "Management has discretion to fix 8 hours within Factories Act limits; necessary for efficient functioning of central workshop; reduction would affect production and cause dissatisfaction.",
      "supporting_facts": [
        "f5",
        "f10"
      ],
      "legal_basis": "Factories Act"
    },
    {
      "id": "pa3",
      "text": "No uniform practice of 6.5 hours across ONGC projects; Baroda central workshop requires 8 hours.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": null
    },
    {
      "id": "pa4",
      "text": "Tribunal misread evidence of Shri S. Hassan; precedents do not support reduction.",
      "supporting_facts": [
        "f10"
      ],
      "legal_basis": "Workmen of B.O.A.C., May Bekar Ltd. v. Their Workmen, Workmen of Hindustan Shipyard, Associated Cements Staff Union"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "6.5 hours became condition of service by practice from Dec 1964-June 1965; change to 8 hours without notice violative of s.9A.",
      "supporting_facts": [
        "f6",
        "f7"
      ],
      "legal_basis": "Section 9A Industrial Disputes Act"
    },
    {
      "id": "ra2",
      "text": "Change not justified by convenience; distinction between factory workers and office staff; no uniform 8 hours in other ONGC projects/offices.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": "Factories Act; Workmen of B.O.A.C.; Nawabganj Sugar Mills"
    },
    {
      "id": "ra3",
      "text": "Factory work would not suffer from 6.5 hours for clerical staff per evidence of Shri S. Hassan.",
      "supporting_facts": [
        "f10"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "6.5 hours was interim temporary arrangement due to construction; not a condition of service; no term in appointment letters; s.9A inapplicable.",
      "addresses_issue": "i3",
      "key_observation": "Temporary location 2 km away during construction does not create permanent condition of service."
    },
    {
      "id": "cr2",
      "text": "Management has full power to fix 8 hours within statutory limits (Factories Act); justified for central workshop efficiency; no health impairment shown.",
      "addresses_issue": "i1",
      "key_observation": "Baroda controls western region; requirements differ from other projects."
    },
    {
      "id": "cr3",
      "text": "Tribunal misread Shri Hasan's evidence; reduction would adversely affect interconnected work; no uniform practice across projects.",
      "addresses_issue": "i1",
      "key_observation": "Evidence shows adverse impact on production."
    },
    {
      "id": "cr4",
      "text": "Precedents like B.O.A.C. do not support respondents; Tribunal erred in interfering with management's competence.",
      "addresses_issue": "i1",
      "key_observation": "Industrial adjudication not to fix hours for overtime earnings."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Fixation of 8 working hours per day for administrative staff at Baroda central workshop is within management's competence and justified.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "No payment of compensation for working 8 hours; set aside Tribunal's reduction to 6.5 hours and 10% compensation.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Workmen of B.O.A.C. v. B.O.A.C.",
      "citation": "1962 I L.L.J. 257",
      "treatment": "distinguished",
      "relevance": "Dealt with peculiar service; does not support reducing clerical hours."
    },
    {
      "case_name": "Nawabganj Sugar Mills v. Its Workmen",
      "citation": "1964 I L.L.J. 750",
      "treatment": "distinguished",
      "relevance": "Dealing with rationing allowance; unhelpful to respondents."
    },
    {
      "case_name": "May Bekar Ltd. v. Their Workmen",
      "citation": "1961 II L.L.J. 94",
      "treatment": "followed",
      "relevance": "Tribunal cannot reduce hours where employer follows statutory provisions."
    },
    {
      "case_name": "Workmen of Hindustan Shipyard P. Ltd. v. Industrial Tribunal, Hyderabad",
      "citation": "1961 II L.L.J. 526",
      "treatment": "followed",
      "relevance": "Management power to vary hours within legal limits."
    },
    {
      "case_name": "Associated Cements Staff Union v. Associated Cement Company Ltd.",
      "citation": "1964 I L.L.J. 12",
      "treatment": "followed",
      "relevance": "Not function of adjudication to fix hours for overtime; consider production factors."
    }
  ],
  "statutes_cited": [
    {
      "name": "Industrial Disputes Act",
      "sections": [
        "Section 9A"
      ],
      "relevance": "Requires notice for change in conditions of service; inapplicable here as no such condition existed."
    },
    {
      "name": "Factories Act",
      "sections": [
        "48 hours week / 8 hours day"
      ],
      "relevance": "Management may fix clerical hours within limits; applies to workshops."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; award of National Industrial Tribunal dated November 18, 1971 set aside in toto regarding reduction of working hours to 6 1/2 hours and grant of 10% compensation; appellant to pay costs of respondents in this Court.",
    "relief_granted": "Restoration of 8 hours working day; no compensation.",
    "costs": "Appellant to pay costs of respondents in Supreme Court."
  },
  "key_quotes": [
    {
      "text": "\"There is nothing to show that it was a condition of service that an employee would work 6 1/2 hours only. Nor is there anything to that effect in the appointment letter.\"",
      "speaker": "court",
      "significance": "Rejects claim of 6.5 hours as condition of service."
    },
    {
      "text": "\"The management must... have full power and discretion in fixing the working hours of the administrative staff within the limits prescribed by the statute.\"",
      "speaker": "court",
      "significance": "Affirms management's authority over working hours."
    },
    {
      "text": "\"If the hours of the staff working in the office of the workshop are reduced, it will adversely affect the working because the whole work is connected.\"",
      "speaker": "petitioner_counsel",
      "significance": "Evidence misread by Tribunal; supports no reduction."
    }
  ],
  "_case_id": "1972_385",
  "_label": 1,
  "_text_length": 27229,
  "_extracted_at": "2026-02-10T20:09:40.160905"
}