{
  "metadata": {
    "case_name": "Commissioner of Income-tax, Madras v. Ashok Motors Ltd.",
    "case_year": 1969,
    "court": "Supreme Court of India",
    "judges": [
      "Hedge, J."
    ],
    "case_number": "Civil Appeal No. 1989 of 1969",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The assessee was a public Limited Co., originally known as Ashok Motors Ltd. It was incorporated on September 7, 1948.",
      "type": "background",
      "date": "1948-09-07",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The Articles of Association of the Company authorised it to carry on various businesses, such as manufacturers, assemblers, dealers, hirers, repairers of motorcars, motorcycles, motor buses, lorries, trucks etc. In particular it authorised the Company to import into India Austin Cars and other Austin products, to assemble Austin products from their components, to undertake the progressive manufacture in India, of such parts of Austin products as can under suitable provisions for such manufacture be manufactured thereto, supply Austin products and parts to accredited distributors for resale to the public in India and to provide adequate facilities for the prompt servicing of Austin products in India.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The Company appointed Car Builders Limited, as their managing agents under an agreement dated October 18, 1948 for a term of 14 years from the date of its registration. The managing agents were to be paid at the rate of Rs. 2,000/- per mensem as office allowance and 10 per cent of the annual profits with a minimum of Rs. 18,000 per annum in case of inadequacy or absence of profits.",
      "type": "background",
      "date": "1948-10-18",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Initially the business of the Company consisted in the assembly and sale of Austin cars and Leyland Trucks.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "During the year 1952, the Government of India referred the question of establishing an Automobile Industry in India to the Tariff Commission. The Company prepared and submitted a comprehensive memorandum to the Tariff Commission for the manufacture of Leyland Trucks. It also participated in the proceedings of the Tariff Commission.",
      "type": "background",
      "date": "1952",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The Government instructed the Company to take up the manufacture of Leyland Commercial Vehicles. From April 1954, the Company ceased to assemble Austin Cars in view of the Government decision and engaged itself in the manufacture of Leyland Commercial Vehicles.",
      "type": "background",
      "date": "1954-04",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "The progress of the scheme was reviewed by all the Directors on January 24, 1955 when the Union Minister for Commerce and Industry was also present. In the course of the discussion, the Union Minister suggested to the Company to invite Leylands to provide capital as and when required till their holding bore to the existing paid up capital in the ratio of 40/45 to 50/55 per cent subject to a maximum of half a million pounds. The Company was asked to raise the remaining capital in India. The Minister is stated to have assured that the Government would arrange for the required capital in India but that responsibility would be in the nature of contingent liability and that it would accept such a liability only if the Managing Agency is abolished. The Directors pointed out to the Minister that they had already taken steps to terminate the services of the managing agents on payment of compensation.",
      "type": "material",
      "date": "1955-01-24",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "On January 29, 1955, by means of an agreement between the Company and the managing agents, the managing agency agreement was terminated subject to the condition that the managing agents were to be paid compensation in a sum of Rs. 2,50,000/.",
      "type": "material",
      "date": "1955-01-29",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "The Company paid the said sum during the accounting year ended on December 31, 1955, relevant to the assessment year 1956-57.",
      "type": "material",
      "date": "1955-12-31",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "The Company claimed deduction of the same in its assessment as revenue expenditure laid out wholly and exclusively for the purpose of the business in the relevant previous year.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f11",
      "text": "At about this time the Company entered into an agreement with Leyland Motor Limited, Leyland U.K. for participation of the said concern with the Company for implementing its manufacturing programme.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "The Income-tax Officer as well as the Appellate Assistant Commissioner rejected the claim of the Company that it was a Revenue expenditure but the Tribunal in appeal upheld the contention of the Company.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Aggrieved by the decision of the Tribunal, the Commissioner demanded a case to be stated... The Tribunal refused... Thereafter the Commissioner moved the High Court under s. 66(2) and at the instance of the High Court, the Tribunal stated the case... But the High Court answered that question in the affirmative and in favour of the Company.",
      "type": "procedural",
      "date": "1968-02-08",
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "The Tribunal found that the Company terminated the services of the managing agents on business considerations. It accepted the plea of the Company that in view of the change in its business activity, the continuance of the managing agents became superfluous.",
      "type": "admitted",
      "date": null,
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether on the facts and in the circumstances of the case the payment of Rs. 2,50,000/- made for the termination of Managing Agency is an allowable deduction in computing the total income of the assessee company for 1956-57.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The termination of the managing agency has led to reorientation of the business of the Company. That termination facilitated the Company to enter into collaboration with Leylands. It also made it possible for the Company to get financial assistance from the Government if there be need.",
      "supporting_facts": [
        "f7",
        "f11"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "The compensation was paid at the behest of the Government and was for a non-business purpose. Under these circumstances, it was said that the expenditure cannot be considered as having been incurred to meet any commercial expediency.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Because of the Government policy the Company had to give up its assembling activity and take to manufacture of Leyland Trucks. For that purpose it sought and obtained the collaboration of Leylands. In view of the change in the business activity of the Company, continuance of the managing agency became superfluous. Its continuance meant unnecessary business expenditure for the Company. Hence commercial expediency required the Company to terminate the services of the managing agents and the managing agents could be got rid of only by paying reasonable compensation.",
      "supporting_facts": [
        "f5",
        "f6",
        "f7",
        "f11"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The general tests to be applied to distinguish capital expenditure from revenue expenditure have been enunciated in various decisions... when an expenditure is made with a view to bring into existence an asset or an advantage for the enduring benefit of a trade, there is good reason... for treating such an expenditure as properly attributable not to revenue but to capital.",
      "addresses_issue": "i1",
      "key_observation": "The Act has not defined the expressions capital expenditure and the revenue expenditure. The line that divides revenue expenditure from capital expenditure is often times very thin."
    },
    {
      "id": "cr2",
      "text": "There is no doubt that as a result of the termination of the services of the managing agents, the Company got rid of its liability to pay office allowance as well as the commission it was required to pay under the managing agency agreement not only during the accounting year but also for a few years more. The expenditure thus saved undoubtedly swelled the profits of the Company.",
      "addresses_issue": "i1",
      "key_observation": "From the facts found, it is clear that the managing agency was terminated on business considerations and as a matter of commercial expediency."
    },
    {
      "id": "cr3",
      "text": "There is no basis for holding that by terminating the managing agency, the Company acquired any enduring benefit or any income yielding asset... It will not be correct to say that by avoiding certain business expenditure, the Company can be said to have acquired enduring benefits or acquired any income yielding asset.",
      "addresses_issue": "i1",
      "key_observation": "A payment made to remove the possibility of a recurring disadvantage cannot be considered as a payment made to acquire an enduring advantage."
    },
    {
      "id": "cr4",
      "text": "It is obvious from the facts set out earlier that the compensation paid for termination of the services of the managing agents was a payment made with a view to save business expenditure in the relevant accounting year as well as for a few more years. It was not made for acquiring any enduring benefit or income-yielding asset.",
      "addresses_issue": "i1",
      "key_observation": "We agree with the High Court that the Tribunal was right in its conclusion that the expenditure in question was a revenue expenditure."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The compensation paid to the managing agents can be considered as an expenditure wholly and exclusively laid out for the purpose of the business and is a revenue expenditure allowable as deduction.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "B.W. Noble Limited v. Mitchell",
      "citation": "11 TC 372",
      "treatment": "followed",
      "relevance": "Payment to get rid of a servant when it is not expedient to keep him in the interest of trade would be a deductible expenditure. A payment made to remove the possibility of a recurring disadvantage cannot be considered as a payment made to acquire an enduring advantage."
    },
    {
      "case_name": "Atherton v. British Insulated and Helsby Cables Ltd.",
      "citation": "10 TC 155",
      "treatment": "followed",
      "relevance": "A sum of money expended, not of necessity and with a view to a direct and immediate benefit to the trade, but voluntarily and on the grounds of commercial expediency, and in order indirectly to facilitate the carrying on of the business, may yet be expended wholly and exclusively for the purposes of the trade."
    },
    {
      "case_name": "Anglo Persian Oil Co. Ltd. v. Dale",
      "citation": "16 TC 253",
      "treatment": "followed",
      "relevance": "Payment to cancel agreements with agents and get rid of onerous contract for commission payments is revenue expenditure, not capital merely because it secures enduring benefit by getting rid of onerous contract."
    },
    {
      "case_name": "C. Scammell and Nephew Ltd. v. Rowles",
      "citation": "1940 ITR Suppl 41",
      "treatment": "followed",
      "relevance": "The expenditure incurred for the termination of a trading relationship in order to avoid losses occurring in the future through that relationship, whether pecuniary losses or commercial inconveniences, is just as much for the purposes of the trade as the making or the carrying into effect of a trading agreement."
    },
    {
      "case_name": "Anglo-Persian Oil Co. (India) Ltd. v. Commissioner of Income-tax",
      "citation": "1933 vol. I, I.T.R. 129",
      "treatment": "followed",
      "relevance": "Money paid in a lump sum as compensation for loss of agency whereby the company relieved itself of future annual payments of commission chargeable to revenue account is allowable as revenue expenditure."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act, 1922",
      "sections": [
        "s. 66(2)"
      ],
      "relevance": "Reference under s. 66(2) for stating a case to the High Court on the question of law."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court upheld the decision of the Madras High Court and the Tribunal, holding that the payment of Rs. 2,50,000/- to terminate the managing agency was revenue expenditure allowable as a deduction in computing the total income for 1956-57.",
    "relief_granted": "Deduction allowed to the assessee company.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"when an expenditure is made with a view to bring into existence an asset or an advantage for the enduring benefit of a trade, there is good reason... for treating such an expenditure as properly attributable not to revenue but to capital.\"",
      "speaker": "court",
      "significance": "States the general test to distinguish capital from revenue expenditure."
    },
    {
      "text": "\"A payment made to remove the possibility of a recurring disadvantage cannot be considered as a payment made to acquire an enduring advantage.\"",
      "speaker": "court",
      "significance": "Key observation rejecting revenue's contention of enduring benefit."
    },
    {
      "text": "\"a sum of money expended, not of necessity and with a view to a direct and immediate benefit to the trade, but voluntarily and on the grounds of commercial expediency, and in order indirectly to facilitate the carrying on of the business, may yet be expended wholly and exclusively for the purposes of the trade.\"",
      "speaker": "court",
      "significance": "Quote from Atherton case approved by the court to support commercial expediency."
    }
  ],
  "_case_id": "1972_600",
  "_label": 0,
  "_text_length": 18125,
  "_extracted_at": "2026-02-10T20:11:12.258332"
}