{
  "metadata": {
    "case_name": "Bhagat Ram v. State of Rajasthan & State of Rajasthan v. Ram Swaroop",
    "case_year": 1970,
    "court": "Supreme Court of India",
    "judges": [
      "Khanna, J."
    ],
    "case_number": "Criminal Appeals Nos. 36 of 1969 and 202 of 1970",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Bhagat Ram during the year 1962 was posted as circle inspector of police at Ganganagar. Ancestral village of Bhagat Ram is Mehna in Tehsil Moga, District Ferozepur. Ram Swaroop also belongs to that village.",
      "type": "background",
      "date": "1962",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "A case under sections 408 and 420 IPC was registered on June 14, 1962 at police station Ganganagar on a report made by the general manager of Ganganagar Sugar Mills against Ramesh, an employee of the sugar mills.",
      "type": "material",
      "date": "1962-06-14",
      "source": "prosecution"
    },
    {
      "id": "f3",
      "text": "Bhagat Ram took over the investigation of the above case. Bhagat Ram during investigation came to know that Ramesh had sent the misappropriated amount to his brother Puran Chand at Ludhiana.",
      "type": "material",
      "date": "1962",
      "source": "prosecution"
    },
    {
      "id": "f4",
      "text": "Puran Chand had entered into a transaction for the purchase of a truck from PW Niranjan Dass of Moga for a price of Rs. 22,000. Niranjan Dass received Rs. 7,000 from Puran Chand in that connection. As Puran Chand could not pay the balance of the purchase price, the bargain regarding the purchase of the truck was cancelled and the amount received by Niranjan Dass was stated to have been returned to Puran Chand.",
      "type": "material",
      "date": "1962",
      "source": "prosecution"
    },
    {
      "id": "f5",
      "text": "Bhagat Ram took the stand that part of Rs. 7,000 had been kept by Niranjan Dass with himself. Bhagat Ram summoned Niranjan Dass to police station Ganganagar.",
      "type": "material",
      "date": "1962",
      "source": "prosecution"
    },
    {
      "id": "f6",
      "text": "In obedience to the summons, Niranjan Dass went with his brother Manohar Lal PW to Ganganagar police station on July 27, 1962. Niranjan Dass and Manohar Lal could not meet Bhagat Ram on that day but met him on the following day.",
      "type": "material",
      "date": "1962-07-27",
      "source": "prosecution"
    },
    {
      "id": "f7",
      "text": "Bhagat Ram then behaved in an unduly rude and harsh manner to Niranjan Dass and kept him at the police station.",
      "type": "disputed",
      "date": "1962-07-28",
      "source": "prosecution"
    },
    {
      "id": "f8",
      "text": "Manohar Lal apprehending trouble, returned to Moga and took with him Ram Swaroop accused and some other persons. Manohar Lal and his companions reached Ganganagar on July 29, 1962.",
      "type": "material",
      "date": "1962-07-29",
      "source": "prosecution"
    },
    {
      "id": "f9",
      "text": "Bhagat Ram had gone to Hindumalkot. Accompanied by Niranjan Dass, Ram Swaroop and others, Manohar Lal went to Hindumalkot Dak bungalow where Bhagat Ram was staying. Ram Swaroop went inside the room in which Bhagat Ram was present, while others stayed outside.",
      "type": "material",
      "date": "1962-07-29",
      "source": "prosecution"
    },
    {
      "id": "f10",
      "text": "After some time Ram Swaroop came out of the room and told Niranjan Dass and Manohar Lal not to feel worried. Niranjan Dass was asked to give a statement which was thereafter recorded by Bhagat Ram.",
      "type": "material",
      "date": "1962-07-29",
      "source": "prosecution"
    },
    {
      "id": "f11",
      "text": "Bhagat Ram then produced three documents relating to the agreement for the sale of truck and the receipt which Niranjan Dass had obtained from Puran Chand for the refund of Rs. 7,000. Bhagat Ram then told Niranjan Dass to go back to Moga.",
      "type": "material",
      "date": "1962-07-29",
      "source": "prosecution"
    },
    {
      "id": "f12",
      "text": "About 10 or 15 days after that, Bhagat Ram went to Moga in a jeep and stayed at the house of Niranjan Dass and Manohar Lal for the night. While leaving Moga early next morning, Bhagat Ram told Niranjan Dass and Manohar Lal that they should have a talk with Ram Swaroop and act according to Ram Swaroop's instructions.",
      "type": "material",
      "date": "1962-08",
      "source": "prosecution"
    },
    {
      "id": "f13",
      "text": "After Bhagat Ram had left Moga, Ram Swaroop met Niranjan Dass and informed him that Bhagat Ram wanted Rs. 2,000 as bribe for having helped Niranjan Dass to get out of the trouble and that otherwise, Niranjan Dass would be again entangled in the case.",
      "type": "disputed",
      "date": "1962-08",
      "source": "prosecution"
    },
    {
      "id": "f14",
      "text": "Niranjan Dass told Ram Swaroop that he would consult a lawyer and give a reply.",
      "type": "material",
      "date": "1962-08",
      "source": "prosecution"
    },
    {
      "id": "f15",
      "text": "Ram Swaroop came to Niranjan Dass in the first week of October 1962 and showed letter P. 2 which had been sent by Bhagat Ram to Ram Swaroop from Alwar. In the course of that letter it was stated 'Kindly kindness send that thing to Alwar. This is very important and please do not be careless and slack in the matter.' Ram Swaroop told Niranjan Dass that the words 'that thing' in the letter referred to Rs. 2,000 and demanded that amount from Niranjan Dass, so that it could be passed on to Bhagat Ram.",
      "type": "disputed",
      "date": "1962-10",
      "source": "prosecution"
    },
    {
      "id": "f16",
      "text": "Niranjan Dass expressed his inability to accede to this demand. The letter was retained by Niranjan Dass.",
      "type": "material",
      "date": "1962-10",
      "source": "prosecution"
    },
    {
      "id": "f17",
      "text": "A few days thereafter Ram Swaroop again came to Niranjan Dass and showed him telegram P.3A dated October 19, 1962. The telegram had been addressed by Bhagat Ram to Ram Swaroop and it was stated therein that Ram Swaroop should ask Niranjan Dass to see Bhagat Ram and that otherwise, warrants of arrest would be issued against him. This telegram too was kept by Niranjan Dass.",
      "type": "disputed",
      "date": "1962-10-19",
      "source": "prosecution"
    },
    {
      "id": "f18",
      "text": "On December 26, 1962, Niranjan Dass came to know that warrants for his arrest had been received by the Moga police in the above mentioned case registered at Ganganagar. Niranjan Dass then consulted a lawyer and sent complaint dated December 26, 1962 to the Inspector General of Police, Special Police Establishment.",
      "type": "material",
      "date": "1962-12-26",
      "source": "prosecution"
    },
    {
      "id": "f19",
      "text": "A case was thereafter registered on the basis of the above complaint by DSP Umaid Singh of AntiCorruption Department. After necessary investigation, Bhagat Ram and Ram Swaroop were sent up for trial.",
      "type": "procedural",
      "date": "1962-12",
      "source": "prosecution"
    },
    {
      "id": "f20",
      "text": "Both Bhagat Ram and Ram Swaroop were tried in the court of special judge, Ganganagar for offenses under section 120B IPC for conspiring to extort bribe of Rs. 2,000 from PW 1 Niranjan Dass of Moga. Charges were also framed against Bhagat Ram for offenses under sections 161, 218, 347 and 389 Indian Penal Code as also section 5(1)(a) read with section 5(2) of Prevention of Corruption Act. Additional charge under section 165A Indian Penal Code was framed against Ram Swaroop.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f21",
      "text": "Both Bhagat Ram and Ram Swaroop were acquitted by the special judge, Ganganagar in respect of all the charges.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f22",
      "text": "The State of Rajasthan filed an appeal against the acquittal of the two accused. The appeal was heard by a Division Bench consisting of Tyagi and Lodha, JJ.",
      "type": "procedural",
      "date": "1969-01-17",
      "source": "court"
    },
    {
      "id": "f23",
      "text": "The Division Bench dismissed the said appeal against the acquittal of Ram Swaroop. The appeal of the State against Bhagat Ram in so far as it related to his acquittal for offenses under sections 347, 218, 389 and 120B IPC was also dismissed.",
      "type": "procedural",
      "date": "1969-01-17",
      "source": "lower_court"
    },
    {
      "id": "f24",
      "text": "There was a difference of opinion between the two learned judges on the point as to whether the acquittal of Bhagat Ram for offenses under section 161 IPC and 5(1)(a) of Prevention of Corruption Act should be maintained. Tyagi, J. held not proved, dismiss appeal. Lodha, J. held guilty, convict.",
      "type": "procedural",
      "date": "1969-01-17",
      "source": "lower_court"
    },
    {
      "id": "f25",
      "text": "In view of the difference, the case was placed under section 429 of the Code of Criminal Procedure before Jagat Narayan, J.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f26",
      "text": "Jagat Narayan, J. concluded that Ram Swaroop and Bhagat Ram had entered into an agreement to extort bribe from Niranjan Dass, guilty under section 120B IPC. However, felt could not set aside acquittal of Ram Swaroop in view of Division Bench. As regards Bhagat Ram, set aside acquittal for 120B, 218, 347 IPC.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f27",
      "text": "Bhagat Ram found guilty by Jagat Narayan, J. of offenses under sections 120B, 161, 218 and 347 IPC. Sentenced: s.161 RI 1 year + fine Rs.500/- or 3 months RI; s.218 and 347 RI 1 year each, concurrent. No sentence for 120B.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f28",
      "text": "Bhagat Ram filed criminal appeal No. 36 of 1969 against his conviction and sentence, while State of Rajasthan filed appeal No. 202 of 1970 against acquittal of Ram Swaroop. Both on certificate by Rajasthan High Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f29",
      "text": "In statement u/s 342 CrPC, Ram Swaroop admitted knowing Bhagat Ram, gone to him on July 29, 1962 with Manohar Lal and Niranjan Dass at Hindumalkot. Denied demand for illegal gratification. Stated Bhagat Ram asked to realise embezzled amount. Admitted receiving letter P.2 and telegram P.3A from Bhagat Ram and handing to Niranjan Dass. Added asked Niranjan to pay embezzled amount.",
      "type": "admitted",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f30",
      "text": "Bhagat Ram admitted entrusted with investigation against Ramesh, called Niranjan Dass. Denied maltreated or unlawful detention. Admitted Niranjan and Ram Swaroop met on July 29 at Hindumalkot, denied demand through Ram Swaroop for Rs.2000 bribe. Admitted went to Moga, denied demand. Admitted sent letter P.2 and telegram P.3A. 'That thing' referred to embezzled amount retained by Niranjan.",
      "type": "admitted",
      "date": null,
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the third judge (Jagat Narayan, J.) could set aside the acquittal of Bhagat Ram for offenses under sections 120B, 218 and 347 IPC, after the Division Bench had dismissed the State appeal on those charges and upheld the acquittal.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the acquittal of Ram Swaroop under section 120B IPC requires acquittal of Bhagat Ram under section 120B IPC for conspiracy between them.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether conviction of Bhagat Ram under section 161 IPC can stand when no direct demand by him, alleged demand through Ram Swaroop who was acquitted under 165A and 120B IPC.",
      "framed_by": "court"
    },
    {
      "id": "i4",
      "text": "Whether State appeal against acquittal of Ram Swaroop should succeed given concurrent findings of trial court and High Court.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Bhagat Ram appeals against his conviction and sentence by third judge.",
      "supporting_facts": [
        "f27",
        "f28"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Denials in statement u/s 342: no maltreatment, no demand directly or through Ram Swaroop, 'that thing' refers to embezzled amount.",
      "supporting_facts": [
        "f7",
        "f13",
        "f15",
        "f17",
        "f30"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "State appeals against acquittal of Ram Swaroop.",
      "supporting_facts": [
        "f28"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Ram Swaroop's defenses: no demand for gratification, only to recover embezzled amount.",
      "supporting_facts": [
        "f29"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Division Bench dismissed State appeal against Bhagat Ram's acquittal under ss.347,218,389,120B IPC. Third judge under s.429 CrPC could only resolve difference on ss.161 IPC and 5(1)(a) PCA, not reopen dismissed charges. Binding on third judge.",
      "addresses_issue": "i1",
      "key_observation": "Order of Division Bench unless set aside in appeal, binding and conclusive. Principle of res judicata applies to criminal proceedings."
    },
    {
      "id": "cr2",
      "text": "Charge u/s 120B was conspiracy between Bhagat Ram and Ram Swaroop. Acquittal of Ram Swaroop makes charge against Bhagat Ram fail.",
      "addresses_issue": "i2",
      "key_observation": "Basis of conspiracy charge disappears with acquittal of co-conspirator."
    },
    {
      "id": "cr3",
      "text": "No direct demand by Bhagat Ram; alleged through Ram Swaroop who was acquitted. Inconsistent to convict Bhagat Ram under s.161.",
      "addresses_issue": "i3",
      "key_observation": "Acquittal of intermediary leads to failure of case against principal."
    },
    {
      "id": "cr4",
      "text": "Concurrent findings of trial court and High Court acquitting Ram Swaroop under ss.120B,165A; no reason to interfere.",
      "addresses_issue": "i4",
      "key_observation": "No fresh appraisement justifies interference."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Third judge erred in convicting Bhagat Ram under ss.120B,218,347 IPC as Division Bench had upheld acquittal thereon; res judicata applies.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Acquittal of Ram Swaroop under s.120B requires acquittal of Bhagat Ram under s.120B.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h3",
      "text": "Conviction under s.161 cannot stand without proof of demand through acquitted Ram Swaroop.",
      "resolves_issue": "i3",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h4",
      "text": "State appeal against Ram Swaroop's acquittal dismissed.",
      "resolves_issue": "i4",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Sambasivam v. Public Prosecutor, Federation of Malaya",
      "citation": "1950 A.C. 458",
      "treatment": "followed",
      "relevance": "Verdict of acquittal binding and conclusive in subsequent proceedings between parties; res judicata applies to criminal cases."
    },
    {
      "case_name": "Pritam Singh v. State of Punjab",
      "citation": "1956 S.C.R. 415",
      "treatment": "followed",
      "relevance": "Approved observations from Sambasivam on binding nature of acquittal."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "120B",
        "161",
        "165A",
        "218",
        "347",
        "389",
        "408",
        "420"
      ],
      "relevance": "Charges framed; convictions and acquittals thereunder analyzed."
    },
    {
      "name": "Prevention of Corruption Act",
      "sections": [
        "5(1)(a)",
        "5(2)"
      ],
      "relevance": "Charge against Bhagat Ram; difference of opinion resolved."
    },
    {
      "name": "Code of Criminal Procedure",
      "sections": [
        "342",
        "403",
        "429"
      ],
      "relevance": "Statement under 342; reference to third judge under 429; autrefois acquit under 403."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal of Bhagat Ram allowed; his conviction and sentence set aside, acquitted on all charges. Appeal of State of Rajasthan against acquittal of Ram Swaroop dismissed.",
    "relief_granted": "Acquittal of Bhagat Ram; confirmation of acquittal of Ram Swaroop.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The order of the Division Bench unless set aside in appeal to this Court, was binding and conclusive in all subsequent proceedings between the parties.",
      "speaker": "court",
      "significance": "Core holding on binding nature of Division Bench order."
    },
    {
      "text": "The principle of res judicata is also applicable to criminal proceedings and it is not permissible in the subsequent stage of the same proceedings or in some other subsequent proceedings to convict a person for an offence in respect of which an order for his acquittal has already been recorded.",
      "speaker": "court",
      "significance": "Affirms res judicata in criminal law."
    },
    {
      "text": "It would indeed be incongruous and inconsistent to acquit Ram Swaroop, for offenses under sections 165A and 120B IPC and, at the same time, to convict Bhagat Ram for the offence under section 161 IPC for asking for bribe from Niranjan Dass through the instrumentality of Ram Swaroop.",
      "speaker": "court",
      "significance": "Explains inconsistency in outcomes."
    }
  ],
  "_case_id": "1972_14",
  "_label": 1,
  "_text_length": 19611,
  "_extracted_at": "2026-02-10T20:07:37.357534"
}