{
  "metadata": {
    "case_name": "Appellant (Employer) v. Respondent (Workman)",
    "case_year": 1968,
    "court": "Supreme Court of India",
    "judges": [
      "GROVER, J."
    ],
    "case_number": "Civil Appeal No. 2458 of 1968",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Respondent was an employee of the appellant, working as conductor.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Disciplinary proceedings taken against respondent on certain charges, inquired into by Disciplinary Officer of appellant, who found charges proved and submitted report to Special Officer Discipline.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On May 18, 1967, competent authority, after considering Inquiry Officer's report, recorded order expressing agreement that respondent be removed from service after giving one month's wages. Order stated: 'The delinquent is removed from the service of the Corporation. He will be given one months wages and simultaneously an application may be filed in the Tribunal, seeking approval of the action taken, as required under Section 33(2) of the I.D. Act.'",
      "type": "material",
      "date": "1967-05-18",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Proceedings pending before 5th Industrial Tribunal, West Bengal, on reference under s.10 of the Act regarding disputes between appellant and its workmen, necessitating approval under s.33(2)(b).",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Notice dated June 22, 1967 sent to respondent informing removal from service effective July 1, 1967; reached him on June 26, 1967.",
      "type": "procedural",
      "date": "1967-06-22",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "One month's wages remitted to respondent on June 28, 1967 by Money Order, received by him on July 1, 1967.",
      "type": "material",
      "date": "1967-06-28",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Application under s.33(2)(b) filed on July 3, 1967 (Monday).",
      "type": "procedural",
      "date": "1967-07-03",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Second Labour Court, West Bengal, by order dated June 29, 1969, found domestic enquiry report, findings and punishment justified, but held application on July 3 did not satisfy proviso to s.33(2)(b) as not part of same transaction with removal order of May 18 and wages.",
      "type": "procedural",
      "date": "1969-06-29",
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the application under s.33(2)(b) of the Industrial Disputes Act, 1947 filed on July 3, 1967 satisfied the proviso requiring dismissal/discharge, payment of one month's wages, and application for approval to be simultaneous and part of the same transaction.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Order of removal merely recorded on May 18, 1967 on file, effective only from July 1, 1967; before that, open to withdraw. Date of dismissal is July 1, 1967. Wages received on July 1 (Saturday). Application filed July 3 (Monday, next working day after Sunday holiday). Conduct of employer shows three requirements (dismissal, wages payment, application) part of same transaction.",
      "supporting_facts": [
        "f3",
        "f5",
        "f6",
        "f7"
      ],
      "legal_basis": "Proviso to s.33(2)(b) of Industrial Disputes Act, 1947; Strawboard Manufacturing Co. v. Govind; P. H. Kalyani v. Air France"
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Labour Court misunderstood facts and law. Order recorded May 18 but effective July 1; date of dismissal July 1. Wages received July 1. Application July 3 next working day. Proviso requires dismissal/discharge, payment/offer of wages, and application to be simultaneous/part of same transaction; employer's conduct shows this. Not necessary all on same day.",
      "addresses_issue": "i1",
      "key_observation": "Filing on next working day after wages receipt and effective dismissal date satisfies proviso based on employer's conduct."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Application under s.33(2)(b) complies with proviso where dismissal effective date, wages receipt, and application (next working day) form part of same transaction as per employer's conduct.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Strawboard Manufacturing Co. v. Govind",
      "citation": null,
      "treatment": "followed",
      "relevance": "Employer's conduct must show dismissal, wages payment, and application are parts of same transaction under proviso to s.33(2)(b)."
    },
    {
      "case_name": "P. H. Kalyani v. Air France, Calcutta",
      "citation": null,
      "treatment": "followed",
      "relevance": "Dismissal order passed May 28, communicated May 30 with wages offer, application same day complies with proviso; similar action required but not necessarily all on same day; conduct matters."
    }
  ],
  "statutes_cited": [
    {
      "name": "Industrial Disputes Act, 1947",
      "sections": [
        "s.33(2)(b)",
        "s.10"
      ],
      "relevance": "Approval required for removal during pendency of proceedings under s.10; proviso mandates dismissal, wages payment, and application as simultaneous/same transaction."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal by special leave allowed; Labour Court's order rejecting approval application under s.33(2)(b) set aside as it misunderstood facts and law; employer's actions complied with proviso.",
    "relief_granted": "Approval of removal order granted",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The proviso to s.33(2)(b) contemplates three things (i) dismissal or discharge (ii) payment of wages and (iii) making of an application for approval to be simultaneous and to be part of the same transaction.",
      "speaker": "court",
      "significance": "Defines requirements of proviso central to issue."
    },
    {
      "text": "It is the conduct of the employer that has to be considered from the point of view of finding out whether the dismissal or discharge, payment of wages and making of the application for approval form a part of the same transaction.",
      "speaker": "court",
      "significance": "Key test applied to hold compliance."
    }
  ],
  "_case_id": "1973_117",
  "_label": 1,
  "_text_length": 5265,
  "_extracted_at": "2026-02-10T20:11:29.408145"
}