{
  "metadata": {
    "case_name": "Writ Petition No. 39 of 1969",
    "case_year": 1969,
    "court": "Supreme Court of India",
    "judges": [
      "MATHEW, J."
    ],
    "case_number": "Writ Petitions Nos. 39 & 92 of 1969",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Petitioner is a company incorporated under the Indian Companies Act, 1913, with registered office in Calcutta and branch office at Binani House, Khundi Katra, Mirzapur, U.P.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Petitioner is an importer and dealer in non-ferrous metals like zinc, lead, copper, tin, etc., and is on the approved list of registered suppliers to the Directorate General of Supplies and Disposals (DGSD).",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Petitioner is a registered dealer in the State of West Bengal under the Bengal Finance Act, 1941 and the Central Sales Tax Act, 1956.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Petitioner used to procure non-ferrous metals from various countries and within the country for fulfilling its contracts with the Government of India through DGSD.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Import of non-ferrous metals was under Open General Licence till June 30, 1957. Thereafter, a licensing system was introduced and established traders including petitioner were asked to get quotas fixed on past imports.",
      "type": "background",
      "date": "1957-06-30",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "On April 2, 1958, Government of India promulgated Non-Ferrous Metals Control Order, 1958 under Essential Commodities Act, 1951, banning free sale of copper. Imports by established licence holders to be distributed under directions of Controller of Non-ferrous Metals.",
      "type": "background",
      "date": "1958-04-02",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Under Non-Ferrous Metals Control Order, 1958 and Import Trade Regulations, established importers not free to sell imported metals even to DGSD without additional import licence.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Established importers including petitioner obtained quota licences for import upto April 1964-March 1965, but imports to be distributed under directions of Controller or Import Trade Control Authority.",
      "type": "background",
      "date": "1964-04-01 to 1965-03-31",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "On September 14, 1965, Government promulgated Scarce Industrial Materials Control Order, 1965 under Defence of India Rules, freezing stocks of non-ferrous metals including incoming imports. Non-Ferrous Metals Control Order, 1958 repealed.",
      "type": "background",
      "date": "1965-09-14",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Scarce Industrial Materials Control Order, 1965 repealed on June 6, 1966.",
      "type": "background",
      "date": "1966-06-06",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Government of India used to grant import licences to petitioner in terms of contracts for placing orders.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Petitioner had been importing and supplying non-ferrous metals to respondents 1, 2 and 3 during the last 19 years.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Respondent No. 2 agreed to pay and was paying Central Sales Tax or West Bengal Sales Tax as applicable to petitioner in terms of contracts.",
      "type": "admitted",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f14",
      "text": "In 1966, this Court held in K.G. Khosla and Co. v. Deputy Commissioner of Commercial Taxes that sale to DGSD of goods manufactured abroad occasioned movement in course of import, no sales tax exigible under s.5(2) Central Sales Tax Act, 1956.",
      "type": "material",
      "date": "1966",
      "source": "court"
    },
    {
      "id": "f15",
      "text": "On basis of Khosla judgment, respondent No. 2 issued order (Annexure P-1) to authorities including respondent No. 4 (Pay and Accounts Officer) directing no sales tax allowance for supplies specifically imported against licences issued on Import Recommendation Certificates by DGSD etc.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f16",
      "text": "Pay and Accounts Officer deducted Rs. 60,780/- from petitioner's pending bills and threatened to recover Rs. 2,35,130.01 already paid as sales tax on executed contracts.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f17",
      "text": "Assessments on petitioner upto year ending October 27, 1962 completed prior to Khosla judgment and Annexure P-1.",
      "type": "procedural",
      "date": "1962-10-27",
      "source": "court"
    },
    {
      "id": "f18",
      "text": "Petitioner filed revised returns claiming refund of taxes paid, treating sales to DGSD as in course of import per Khosla.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f19",
      "text": "West Bengal Sales Tax authorities held two sales involved: foreign seller to petitioner, petitioner to DGSD; no privity between DGSD and foreign sellers; import licences allowed import from any source; no obligation to supply to DGSD post-import; tax exigible on petitioner's sales.",
      "type": "disputed",
      "date": null,
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether, on the basis of Annexure P-1 Order, respondent No. 4 was entitled to deduct Rs. 60,780/- from pending bills and recover Rs. 2,35,130.01 from petitioner.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether sales by petitioner to DGSD were in the course of import of goods into India and thus exempt from sales tax under Article 286(1)(b) and s.5(2) Central Sales Tax Act, 1956.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Transactions of sales to DGSD were not sales which occasioned movement of goods in course of import; sales separate and distinct from contracts of purchase with foreign sellers which alone occasioned import; Khosla Case not applicable.",
      "supporting_facts": [
        "f4",
        "f11",
        "f12"
      ],
      "legal_basis": "Article 286(1)(b); s.5(2) Central Sales Tax Act, 1956"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Contracts of sale between petitioner and DGSD envisaged import of goods for fulfilling contracts; DGSD recommendation for import licences; movement in course of import occasioned by contracts of sale to DGSD.",
      "supporting_facts": [
        "f11",
        "f15"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Two sales involved; no privity of contract between DGSD and foreign sellers; petitioner entitled to import from any person/country under licences; no obligation to supply to DGSD after import.",
      "supporting_facts": [
        "f7",
        "f8",
        "f19"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Sales by petitioner to DGSD distinct and separate from purchases from foreign sellers; movement of goods occasioned by purchase contracts with foreign sellers, not sales to DGSD; no privity between DGSD and foreign sellers.",
      "addresses_issue": "i2",
      "key_observation": "Petitioner's sales to DGSD did not occasion the import."
    },
    {
      "id": "cr2",
      "text": "Contracts envisaged import but DGSD had no absolute obligation to procure licences; petitioner obliged to obtain licences; no reason to distinguish from Coffee Board Case.",
      "addresses_issue": "i2",
      "key_observation": "Recommendation for licence does not make sales occasion import."
    },
    {
      "id": "cr3",
      "text": "Distinguishes Khosla Case: there contract directly led to import from principal manufacturer with inspections; here petitioner acts as principal buying from foreigners.",
      "addresses_issue": "i2",
      "key_observation": "No completed sale abroad reserved right of inspection linking directly."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Sales by petitioner to DGSD not in course of import; tax exigible thereon.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Respondent No. 4 entitled to deduct Rs. 60,780/- and recover Rs. 2,35,130.01.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "K.G. Khosla and Co. v. Deputy Commissioner of Commercial Taxes",
      "citation": "1966 3 S.C.R. 352",
      "treatment": "distinguished",
      "relevance": "Held sales to DGSD in course of import exempt; distinguished as there direct contract with foreign manufacturer."
    },
    {
      "case_name": "State of Travancore-Cochin v. Bombay Co. Ltd.",
      "citation": "1952 S.C.R. 1112",
      "treatment": "followed",
      "relevance": "Sale by export involves integrated activities; sale and export parts of single transaction."
    },
    {
      "case_name": "State of Travancore-Cochin v. Shanmugha Vilas Cashew Nut Factory",
      "citation": "1954 S.C.R. 53, 63",
      "treatment": "followed",
      "relevance": "Integrated activities mean sale cannot be dissociated from export."
    },
    {
      "case_name": "Ben Gorm Nilgiri Plantations Co. v. Sales Tax Officer",
      "citation": "1964 7 S.C.R. 706",
      "treatment": "followed",
      "relevance": "To occasion export, bond between sale and export; sales for export not in course if intermediary."
    },
    {
      "case_name": "Coffee Board v. Joint Commercial Tax Officer",
      "citation": "1970 3 S.C.R. 147",
      "treatment": "followed",
      "relevance": "Sales to intermediaries not in course of export; two sales break link."
    }
  ],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Article 32",
        "Article 31(1)",
        "Article 286(1)(b)"
      ],
      "relevance": "Petitions under Art 32 for enforcement of fundamental right under Art 31(1); Art 286 exempts sales in course of import."
    },
    {
      "name": "Central Sales Tax Act, 1956",
      "sections": [
        "Section 5(2)"
      ],
      "relevance": "Deems sale in course of import if occasions import or by transfer of title before customs frontier; applied to determine taxability."
    },
    {
      "name": "Essential Commodities Act, 1951",
      "sections": [],
      "relevance": "Non-Ferrous Metals Control Order, 1958 promulgated thereunder."
    },
    {
      "name": "Non-Ferrous Metals Control Order, 1958",
      "sections": [],
      "relevance": "Banned free sale of copper; imports distributed under Controller's directions."
    },
    {
      "name": "Scarce Industrial Materials Control Order, 1965",
      "sections": [],
      "relevance": "Froze stocks of non-ferrous metals under Defence of India Rules; repealed 1966."
    },
    {
      "name": "Bengal Finance Act, 1941",
      "sections": [],
      "relevance": "Petitioner registered dealer thereunder."
    },
    {
      "name": "Indian Companies Act, 1913",
      "sections": [],
      "relevance": "Petitioner incorporated thereunder."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Court held that the sales by the petitioner to DGSD were not in the course of import as they did not occasion the movement of goods; the import was occasioned by separate purchase contracts with foreign sellers. Therefore, sales tax was exigible, and deductions/recoveries by respondents justified. Decision in WP 39/69 governs WP 92/69.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"the movement of goods was occasioned by the contracts for purchase which the petitioner entered into with the foreign sellers. No movement of goods in the course of import took place in pursuance to the contracts of sale made by the petitioner with the DGSD.\"",
      "speaker": "court",
      "significance": "Core holding distinguishing sales from purchases."
    },
    {
      "text": "\"There was no privity of contract between DGSD and the foreign sellers.\"",
      "speaker": "court",
      "significance": "Explains why no integrated transaction."
    },
    {
      "text": "\"sales by the Coffee Board were sales for export, they were not sales in the course of export, that there were two independent sales involved\"",
      "speaker": "court",
      "significance": "Analogy from Coffee Board Case applied."
    }
  ],
  "_case_id": "1973_350",
  "_label": 1,
  "_text_length": 23064,
  "_extracted_at": "2026-02-10T20:13:36.810488"
}