{
  "metadata": {
    "case_name": "Devender Singh & Ors. v. Syed Khaja",
    "case_year": 1969,
    "court": "Supreme Court of India",
    "judges": [
      "BEG, J."
    ],
    "case_number": "Civil Appeal No. 2517 of 1969",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Agreement dated 27-9-1962 (first agreement, Ex. B.15) between Plaintiff (residing at Hyderabad) and First Defendant (Devender Singh, residing at New Delhi) through agent Laxmanaswamy (D.W.2) with help of Sambamurthy (D.W.3, nephew of Laxmanaswamy and Income-tax practitioner at Secunderabad) for sale of house facing Secunderabad Junction Railway Station for Rs.55,000/-",
      "type": "material",
      "date": "1962-09-27",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Plaintiff drew cheque for Rs.10,000/- as earnest money in favour of First Defendant, handed to agent; cheque cancelled for unclear reasons; Sambamurthy (D.W.3) stated Rs.20,000/- earnest demanded, to which plaintiff consented, but new cheque for Rs.10,000/- issued for unknown reason",
      "type": "material",
      "date": "1962-09-27",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Plaintiff became aware of lack of written authority of Laxmanaswamy or Sambamurthy to conclude contract on behalf of First Defendant, leading to uncertainty about first agreement's effect; higgling continued despite first agreement",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Up to 27-9-1962, First Defendant had no better offer than plaintiff's for the property, though keen to dispose of it and may have had other offers",
      "type": "admitted",
      "date": "1962-09-27",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Conflicting evidence on whether First Defendant authorised Sambamurthy by telephone to conclude contract for Rs.55,000/-, but unimportant due to subsequent agreement",
      "type": "disputed",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Plaintiff, anxious to obtain property, flew to Delhi with lawyer; induced First Defendant to execute fresh agreement dated 9-10-1962 (Ex. A1) for Rs.60,000/-, with Rs.20,000/- earnest (Rs.10,000/- cash + Rs.10,000/- cheque dated 9-10-1962), balance at registration",
      "type": "material",
      "date": "1962-10-09",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "First Defendant had ample time to consider other offers and take legal advice before executing agreement of 9-10-1962; not executed in hurry",
      "type": "material",
      "date": "1962-10-09",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Trial Court and High Court found First Defendant fully aware of facts, entered agreement with open eyes as most advantageous transaction; not result of pressure, misrepresentation or fraud; First Defendant middle-aged, hard-headed astute businessman, Director of Blackwood Hodge Pvt. Ltd. and connected with other businesses",
      "type": "admitted",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "First Defendant stated in evidence he entered agreement of 9-10-1962 because 'a bird in hand was worth two in the bush'",
      "type": "admitted",
      "date": null,
      "source": "first_defendant"
    },
    {
      "id": "f10",
      "text": "First Defendant sold property under deed dated 19-10-1962 (Ex. B.22) for Rs.70,000/- to Gulam Hussain Jowkar (2nd Def), Rajab (3rd Def), Safar Jowkar (4th Def), Hussain Jowkar (5th Def), Wali Husstin Nasab (6th Def), partners in Alpha Hotel (7th Def) situated in front of Railway Station at Secunderabad",
      "type": "material",
      "date": "1962-10-19",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Plaintiff sued First Defendant for specific performance of contract dated 9-10-1962",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "First Defendant pleaded contract of 9-10-1962 resulted from misrepresentation and fraud, claiming overawed by Plaintiff and lawyer misrepresenting first agreement binding",
      "type": "disputed",
      "date": null,
      "source": "first_defendant"
    },
    {
      "id": "f13",
      "text": "Trial Court found plea of fraud/misrepresentation baseless but held plaintiff obtained unfair advantage, denied specific performance, awarded return of Rs.20,000/- earnest, Rs.20,000/- liquidated damages/penalty, additional damages Rs.2,300/-, interest at 6% p.a., costs",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "High Court, after re-examination of evidence, found no unfair advantage to plaintiff, First Defendant's stand disingenuous and plea incredible; held First Defendant concluded agreement for enhancement to Rs.60,000/- and Rs.20,000/- earnest plus further Rs.20,000/- damages stipulation; First Defendant in advantageous bargaining position; decreed specific performance",
      "type": "procedural",
      "date": "1969-03-31",
      "source": "high_court"
    },
    {
      "id": "f15",
      "text": "Appeal to Supreme Court on certificate of fitness by Andhra Pradesh High Court under Articles 132 and 133",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f16",
      "text": "Plaintiff carries on bakery business; no evidence of extent of loss of prospective gains from depreciation of site in front of Secunderabad Junction Railway Station",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f17",
      "text": "First Defendant resided in Delhi for 19 years (by 1963), fully occupied with businesses, could not conveniently look after Secunderabad property",
      "type": "background",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the presumption in Explanation to Section 12 of Specific Relief Act 1877 (that breach of contract to transfer immovable property cannot be adequately relieved by compensation in money) is rebutted by stipulation for Rs.20,000/- liquidated damages in contract dated 9-10-1962, barring specific performance under Section 21",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether High Court erred in interfering with Trial Court's discretion to deny specific performance under Section 22 of Specific Relief Act 1877",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Stipulation for Rs.20,000/- liquidated damages in event of breach by First Defendant rebuts presumption in Explanation to Section 12 Specific Relief Act 1877; thus, under Section 21, contract for non-performance of which pecuniary compensation is adequate relief cannot be specifically enforced",
      "supporting_facts": [
        "f6",
        "f13"
      ],
      "legal_basis": "Section 12 Explanation, Section 21 Specific Relief Act 1877"
    },
    {
      "id": "pa2",
      "text": "High Court should not have interfered with Trial Court's exercise of discretion to deny specific performance",
      "supporting_facts": [
        "f13",
        "f14"
      ],
      "legal_basis": "Section 22 Specific Relief Act 1877"
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Mere stipulation for liquidated damages does not rebut presumption under Explanation to Section 12 Specific Relief Act 1877; Section 20 provides contract otherwise proper for specific performance may be enforced though sum named for breach if party in default willing to pay; no option given in contract to pay damages as alternative to performance",
      "addresses_issue": "i1",
      "key_observation": "Assumptions that liquidated damages clause alone rebuts presumption and automatically triggers Section 21 bar are incorrect; clause is evidence but not conclusive"
    },
    {
      "id": "cr2",
      "text": "Principles in Sections 12, 20, 21 Specific Relief Act 1877 incorporated in Sections 10, 23, 14 Specific Relief Act 1963; Section 23(1) clarifies sum named to secure performance, not as alternative, allows specific performance without also decreeing the sum",
      "addresses_issue": "i1",
      "key_observation": "Distinction per Fry's Treatise: whether sum secures performance of act or is alternative election; here, former"
    },
    {
      "id": "cr3",
      "text": "No evidence led to show pecuniary compensation adequate; no standard for loss from prime site; First Defendant failed to rebut presumption; Trial/High Court found no fraud/misrepresentation/unfair advantage",
      "addresses_issue": "i1",
      "key_observation": "Defendants miserably failed to prove case; First Defendant's willingness to pay Rs.20,000/- damages despite gaining only Rs.10,000/- more from other sale suggests ulterior motive"
    },
    {
      "id": "cr4",
      "text": "Discretion under Section 22 Specific Relief Act 1877 (Section 20 of 1963 Act) not arbitrary but on sound judicial principles, correctable on appeal; Trial Court erred on untenable ground of unfair advantage to plaintiff, when First Defendant exploited plaintiff's position",
      "addresses_issue": "i2",
      "key_observation": "High Court rightly corrected Trial Court's fanciful exercise of discretion"
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Presumption under Explanation to Section 12 Specific Relief Act 1877 not rebutted; specific performance decreeable despite liquidated damages clause as it secures performance, not alternative",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "High Court correctly interfered with Trial Court's erroneous discretion",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Sir Edward Fry's Treatise on the Specific Performance of Contracts (Sixth Edn. at p. 65)",
      "citation": null,
      "treatment": "referred",
      "relevance": "Distinction between sum to secure performance vs. alternative election; equitable principles statutorily embodied in India"
    }
  ],
  "statutes_cited": [
    {
      "name": "Specific Relief Act 1877",
      "sections": [
        "Section 12",
        "Section 20",
        "Section 21",
        "Section 22"
      ],
      "relevance": "Governs enforceability of specific performance; presumption for immovable property contracts; discretion; liquidated damages do not bar if to secure performance"
    },
    {
      "name": "Specific Relief Act 1963",
      "sections": [
        "Section 10",
        "Section 14",
        "Section 20",
        "Section 23"
      ],
      "relevance": "Incorporates principles of 1877 Act; clarifies when sum named allows specific performance"
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 132",
        "Article 133"
      ],
      "relevance": "Basis for certificate of fitness for appeal to Supreme Court"
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court dismissed the appeal with costs, upholding High Court's decree for specific performance of the agreement dated 9-10-1962 in favour of the plaintiff-respondent against the first defendant for sale of the property.",
    "relief_granted": "Specific performance of contract dated 9-10-1962",
    "costs": "Appeal dismissed with costs"
  },
  "key_quotes": [
    {
      "text": "'a bird in hand was worth two in the bush'",
      "speaker": "first_defendant",
      "significance": "First Defendant's own admission of reason for entering second agreement"
    },
    {
      "text": "It is agreed that should I fail to comply with the terms of this agreement, I shall be liable not only for the refund of the advance, of Rs. 20,000/- ... but I shall also be liable to pay a similar amount of Rs. 20,000/- ... as damages to the said Syed Khaja.",
      "speaker": "contract",
      "significance": "Liquidated damages clause central to dispute; no alternative to performance"
    },
    {
      "text": "Unless and until the contrary is proved, the Court shall presume that the breach of a contract to transfer immovable property cannot be adequately relieved by compensation in money",
      "speaker": "court",
      "significance": "Key presumption under Explanation to Section 12 Specific Relief Act 1877 not rebutted"
    },
    {
      "text": "Equity helps honest plaintiffs against defendants who break solemnly given undertakings.",
      "speaker": "court",
      "significance": "Justification for granting specific performance"
    }
  ],
  "_case_id": "1973_190",
  "_label": 0,
  "_text_length": 25543,
  "_extracted_at": "2026-02-10T20:12:17.079312"
}