{
  "metadata": {
    "case_name": "Sales Tax Authorities v. Assessee Firm",
    "case_year": 1970,
    "court": "Supreme Court of India",
    "judges": [
      "HEGDE, J."
    ],
    "case_number": "Civil Appeal Nos. 1889 to 1900 of 1970",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Assessee firm engaged in supply of foreign cotton to textile mills in South India on basis of import licences issued to the mills authorising import of foreign cotton by them.",
      "type": "background",
      "date": null,
      "source": "assessee"
    },
    {
      "id": "f2",
      "text": "Mills make enquiries with firm regarding quality of cotton required, period of supply, price and other particulars.",
      "type": "procedural",
      "date": null,
      "source": "assessee"
    },
    {
      "id": "f3",
      "text": "Firm contacts foreign suppliers in Egypt, Sudan or America to ascertain if they could supply the cotton required.",
      "type": "procedural",
      "date": null,
      "source": "assessee"
    },
    {
      "id": "f4",
      "text": "If offers from foreign suppliers acceptable, firm enters into contract with the mills concerned and immediately thereafter accepts offer by foreign suppliers.",
      "type": "procedural",
      "date": null,
      "source": "assessee"
    },
    {
      "id": "f5",
      "text": "Example with M/s. Mahalakshmi Textiles Mills Ltd.: After enquiry from mills, firm contacts American suppliers in New York who agree to supply at agreed price; firm enters contract with mills dated 20-3-1964.",
      "type": "material",
      "date": "1964-03-20",
      "source": "assessee"
    },
    {
      "id": "f6",
      "text": "Import licence issued in favour of the mills made available to firm for utilisation in contract.",
      "type": "material",
      "date": null,
      "source": "assessee"
    },
    {
      "id": "f7",
      "text": "Letter of authority issued authorising firm to import cotton.",
      "type": "material",
      "date": null,
      "source": "assessee"
    },
    {
      "id": "f8",
      "text": "Bill of lading obtained by foreign supplier on shipment made in name of mills, not assessee-firm.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Contract specifies quantity, quality, places from where imported; price fixed on C.I.F. Cochin terms; payment by mills to firm against documents.",
      "type": "material",
      "date": null,
      "source": "assessee"
    },
    {
      "id": "f10",
      "text": "Contract conditions: C.I.F. nature; price variation subject to import duty, freight, insurance, exchange; subject to import licence provided by mills; irrevocable; arbitration for disputes.",
      "type": "material",
      "date": null,
      "source": "assessee"
    },
    {
      "id": "f11",
      "text": "Under import control regulations, importer is the mill; authorisation and import licence issued to mills only; mills remain importer and liable as such even under letter of authority to firm.",
      "type": "material",
      "date": null,
      "source": "assessee"
    },
    {
      "id": "f12",
      "text": "Particulars for bill of lading furnished by firm to foreign suppliers before shipment.",
      "type": "procedural",
      "date": null,
      "source": "assessee"
    },
    {
      "id": "f13",
      "text": "After shipment at foreign port, bill of lading, invoice and documents of title forwarded through bank to India; firm receives after payment to agent bank.",
      "type": "procedural",
      "date": null,
      "source": "assessee"
    },
    {
      "id": "f14",
      "text": "Firm informs mill on receipt of documents; mill makes payment per contract; goods cleared by agents at Cochin and delivered to mills.",
      "type": "procedural",
      "date": null,
      "source": "assessee"
    },
    {
      "id": "f15",
      "text": "Goods could not in any circumstances be diverted from determined destination i.e. the mills once shipped.",
      "type": "material",
      "date": "null",
      "source": "tribunal"
    },
    {
      "id": "f16",
      "text": "Letter of authority condition: Firm acts purely as agent of licensee (mill); goods property of licensee at clearance through customs and subsequent thereto; licensee ensures delivery to itself, no disposal otherwise; licensee shall not cause or permit holder of letter of authority to dispose of goods.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f17",
      "text": "Sales Tax Officer and Appellate Assistant Commissioner held sales as intra-state sales rejecting assessee contention.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f18",
      "text": "Sales Tax Tribunal on appeal held assessee case falls within S.5(2) Central Sales Tax Act 1956 read with Art. 286 Constitution.",
      "type": "procedural",
      "date": null,
      "source": "tribunal"
    },
    {
      "id": "f19",
      "text": "Kerala High Court on revision affirmed Tribunal decision dated October 28, 1969 in R.C. Nos. 40-48, 52-54 of 1968.",
      "type": "procedural",
      "date": "1969-10-28",
      "source": "high_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the sales effected by the respondent occasioned import of cotton.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Sales in question were intra-state sales.",
      "supporting_facts": [],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "High Court observation incorrect that contract condition prevents diversion of goods from mills as no such term in contract.",
      "supporting_facts": [
        "f9",
        "f10"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Khosla case distinguishable as only one sale there, whereas here two sales.",
      "supporting_facts": [],
      "legal_basis": "K. Khosla Co. v. Deputy Commissioner of Commercial Taxes"
    },
    {
      "id": "pa4",
      "text": "Coffee Board case supports that purchases/sales do not occasion import/export if preparatory.",
      "supporting_facts": [],
      "legal_basis": "Coffee Board, Bangalore v. Joint Commercial Tax Officer"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Firm supplies cotton to mills on basis of specific written contracts using mills' import licences; procedure detailed including contacting foreign suppliers post-enquiry, entering contracts C.I.F. Cochin, acting as agent per letter of authority, documents in mills' name, no diversion possible.",
      "supporting_facts": [
        "f1",
        "f2",
        "f3",
        "f4",
        "f5",
        "f6",
        "f7",
        "f8",
        "f9",
        "f10",
        "f11",
        "f12",
        "f13",
        "f14",
        "f15",
        "f16"
      ],
      "legal_basis": "S.5(2) Central Sales Tax Act 1956; Art. 286 Constitution"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Facts as set out by Tribunal are admitted; cannot question their correctness.",
      "addresses_issue": "i1",
      "key_observation": "Facts admitted by Tribunal."
    },
    {
      "id": "cr2",
      "text": "Even if no explicit non-diversion clause in contract, letter of authority makes firm agent, goods property of mills at clearance and after, no disposal otherwise.",
      "addresses_issue": "i1",
      "key_observation": "Letter of authority clause part of contract; respondents could not sell to others."
    },
    {
      "id": "cr3",
      "text": "Case falls within rule in K. Khosla: sales to fulfil contracts with licence-holders using their licences, documents in their name, no diversion, occasions import.",
      "addresses_issue": "i1",
      "key_observation": "Facts similar to Khosla; not two sales but one in course of import."
    },
    {
      "id": "cr4",
      "text": "Coffee Board distinguished: there purchases preparatory to export by buyers, not occasioning export; Khosla affirmed.",
      "addresses_issue": "i1",
      "key_observation": "Coffee Board inapplicable."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Sales occasioned import under S.5(2) Central Sales Tax Act 1956 as they either occasion import or effected by transfer of documents before crossing customs frontiers.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "K. Khosla Co. v. Deputy Commissioner of Commercial Taxes",
      "citation": "1966 3 S.C.R. 352",
      "treatment": "followed",
      "relevance": "Sales to fulfil import contracts using buyers' licences occasion import; exempt under S.5(2)."
    },
    {
      "case_name": "Coffee Board, Bangalore v. Joint Commercial Tax Officer, Madras",
      "citation": null,
      "treatment": "distinguished",
      "relevance": "Purchases for purpose of export by auction buyers do not occasion export."
    }
  ],
  "statutes_cited": [
    {
      "name": "Central Sales Tax Act, 1956",
      "sections": [
        "5(2)"
      ],
      "relevance": "Sale deemed in course of import if occasions import or by transfer of documents before customs frontier."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "286"
      ],
      "relevance": "Read with S.5(2) Central Sales Tax Act; Tribunal and High Court basis."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeals by Sales Tax authorities against High Court affirmation of Tribunal holding that sales occasioned import dismissed; sales exempt under S.5(2) CST Act.",
    "relief_granted": "None to appellants; status quo upheld for respondents.",
    "costs": "Dismissed with costs."
  },
  "key_quotes": [
    {
      "text": "\"A sale or purchase of goods shall be deemed to take place in the course of the import of the goods into the territory of India only if the sale or purchase either occasions such import or is effected by a transfer of documents of title to the goods before the goods have crossed the customs frontiers of India.\"",
      "speaker": "court",
      "significance": "Defines scope of S.5(2) Central Sales Tax Act."
    },
    {
      "text": "The person or firm... will act purely as an agent of the licensee and the goods imported will be the property of the licence-holder both at the time of clearance through the Customs and subsequent thereto.",
      "speaker": "court",
      "significance": "Key condition in letter of authority precluding diversion."
    },
    {
      "text": "From the facts set out above it is clear that this case clearly falls within the rule laid down by this Court in K. Khosla Co.",
      "speaker": "court",
      "significance": "Court's conclusion applying precedent."
    }
  ],
  "_case_id": "1973_107",
  "_label": 0,
  "_text_length": 11847,
  "_extracted_at": "2026-02-10T20:11:41.546467"
}