{
  "metadata": {
    "case_name": "Appellant v. State",
    "case_year": 1970,
    "court": "Supreme Court of India",
    "judges": [
      "Chandrachud, J."
    ],
    "case_number": "Criminal Appeal No. 68 of 1970",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Learned Judicial Magistrate, 1st Class, Sunam convicted the appellant under section 9 of the Opium Act for being in possession of over 1 kg. of opium without a licence and sentenced him to suffer rigorous imprisonment for 8 months and to pay a fine of Rs. 500/-",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Order of conviction and sentence was confirmed in appeal by the learned Sessions Judge, Sangrur",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f3",
      "text": "Conviction confirmed in revision by the High Court of Punjab and Haryana in Criminal Revision No. 66 of 1969 dated 12th February, 1970",
      "type": "procedural",
      "date": "1970-02-12",
      "source": "high_court"
    },
    {
      "id": "f4",
      "text": "Appellant was arrested on June 9, 1968 under section 54 of the Code of Criminal Procedure",
      "type": "procedural",
      "date": "1968-06-09",
      "source": "prosecution"
    },
    {
      "id": "f5",
      "text": "While in police lock-up, appellant allegedly made a statement that he had kept a tin containing opium in his house",
      "type": "disputed",
      "date": "1968-06-09",
      "source": "prosecution"
    },
    {
      "id": "f6",
      "text": "Gurdev Singh, SHO Lehra Police Station, asked constable to secure two Panchas (Kehar Singh and Krishan Chand)",
      "type": "material",
      "date": "1968-06-09",
      "source": "prosecution"
    },
    {
      "id": "f7",
      "text": "Police party went to appellant's house; appellant produced a tin of opium weighing 1 kg. and 300 gms. and handed it over to Gurdev Singh",
      "type": "disputed",
      "date": "1968-06-09",
      "source": "prosecution"
    },
    {
      "id": "f8",
      "text": "Appellant examined seven witnesses in support of defence that he was arrested on June 8, 1968 at Nagla where he runs a liquor shop",
      "type": "background",
      "date": "1968-06-08",
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "Before leaving Nagla, appellant and companion Jagdish Rai presented application before Sarpanch of village panchayat stating apprehension of false charge due to enmity; produced application and receipt acknowledging fee paid",
      "type": "admitted",
      "date": "1968-06-08",
      "source": "petitioner"
    },
    {
      "id": "f10",
      "text": "Appellant denied making statement about opium or producing the opium tin",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f11",
      "text": "Kehar Singh was charged by police in case under section 429 IPC and cited as prosecution witness in case against Gajjan Singh",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Krishan Chand figured as accused in prosecution under section 382 IPC by Sham Lal and concerned with commencement of security proceedings against Hans Raj",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Krishan Chand's uncle Mohan Lal was rival candidate against appellant in municipal elections of Lehra, and appellant won",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Kehar Singh stated whole police party entered room from which opium was discovered",
      "type": "disputed",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f15",
      "text": "Krishan Chand initially supported but later conceded: Did not enter room; sat on chabutra outside with Kehar Singh while SHO sat on cot",
      "type": "disputed",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f16",
      "text": "Gurdev Singh had seen the two panchas before the case and was not fully known to them",
      "type": "material",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f17",
      "text": "Ex. P.A., alleged statement by appellant at police station, bears appellant's signature and contains unqualified admission of concealing tin of opium",
      "type": "disputed",
      "date": "1968-06-09",
      "source": "respondent"
    },
    {
      "id": "f18",
      "text": "No case registered against appellant before house search",
      "type": "material",
      "date": "1968-06-09",
      "source": "court"
    },
    {
      "id": "f19",
      "text": "Appellant not asked in examination under section 342 CrPC for explanation regarding statement Ex. P.A.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the prosecution story of recovery of opium on basis of appellant's disclosure statement, supported by panch witnesses, is credible and establishes possession of opium without licence under section 9 Opium Act",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether defence evidence deserves consideration or can be summarily rejected",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Reliability of panch witnesses Kehar Singh and Krishan Chand given their backgrounds and contradictions in testimony",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Arrested on June 8, 1968 at Nagla liquor shop; presented application to Sarpanch apprehending false charge due to enmity; denied making disclosure statement or producing opium tin",
      "supporting_facts": [
        "f8",
        "f9",
        "f10"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Examined seven witnesses in support of defence",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Relied heavily on Ex. P.A., the disclosure statement bearing appellant's signature, containing unqualified admission of concealing opium tin, sufficient to sustain conviction",
      "supporting_facts": [
        "f17"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Prosecution story inherently impossible of belief; three courts concurrently held against appellant but failed to appreciate mutually destructive statements of prosecution witnesses and summarily rejected defence evidence",
      "addresses_issue": "i1",
      "key_observation": "Story fiction-like; panchas not respectable (Kehar Singh charged u/s 429 IPC, Krishan Chand accused u/s 382 IPC, family rivalry); contradictions on whether they witnessed recovery"
    },
    {
      "id": "cr2",
      "text": "Panchas not true witnesses to seizure; pretence of search; SHO knew them previously; no reliance on signed statement due to infirmities in recording witnesses and no explanation sought u/s 342 CrPC",
      "addresses_issue": "i1",
      "key_observation": "Defence witnesses not to be assumed always untrustworthy; prosecution evidence open to criticism"
    },
    {
      "id": "cr3",
      "text": "High Court wrongly believed Kehar Singh due to his charge showing police not favourable; ignored rivalry and contradictions; brushed aside defence as fabricated without scrutiny",
      "addresses_issue": "i2",
      "key_observation": "No influence of appellant evident; documents fabricable by anyone"
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Prosecution evidence unreliable due to inherent improbabilities, unreliable panchas, contradictions; no reliance on signed statement without proper examination u/s 342 CrPC",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Defence evidence requires careful scrutiny, not summary rejection",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Opium Act",
      "sections": [
        "9"
      ],
      "relevance": "Conviction for possession of over 1 kg opium without licence"
    },
    {
      "name": "Code of Criminal Procedure",
      "sections": [
        "54",
        "342"
      ],
      "relevance": "Arrest; examination of accused regarding incriminating circumstances like disclosure statement"
    },
    {
      "name": "Indian Penal Code",
      "sections": [
        "429",
        "382"
      ],
      "relevance": "Backgrounds of panch witnesses (mischief by killing animal; theft after preparation for hurt)"
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal by special leave allowed; order of conviction and sentence set aside due to unreliable prosecution evidence and failure to appreciate defence",
    "relief_granted": "Acquittal by setting aside conviction and sentence",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The story of the prosecution is so inherently impossible of belief that we are unable to persuade ourselves to stay our hands and let the conviction and sentence stand.",
      "speaker": "court",
      "significance": "Core reason for overturning concurrent findings of lower courts"
    },
    {
      "text": "Defence witnesses are often untrustworthy but it is wrong for that reason to assume that they always lie and that the prosecution witnesses are always trustworthy.",
      "speaker": "court",
      "significance": "Critique of lower courts' approach to evidence appreciation"
    },
    {
      "text": "It is obvious from these admissions that Kehar Singh and Krishan Chand were not in any sense witnesses to the seizure of the opium.",
      "speaker": "court",
      "significance": "Undermines authenticity of recovery"
    }
  ],
  "_case_id": "1973_305",
  "_label": 1,
  "_text_length": 10865,
  "_extracted_at": "2026-02-10T20:12:50.324077"
}