{
  "metadata": {
    "case_name": "State of Mysore v. Shri Bidap",
    "case_year": 1973,
    "court": "Supreme Court of India",
    "judges": [
      "KRISHNA IYER, J."
    ],
    "case_number": "Civil Appeal No. 992 of 1973",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Shri Bidap appointed Member of the State Public Service Commission by the Governor of Mysore on March 20, 1967.",
      "type": "material",
      "date": "1967-03-20",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "While his term as Member was still running, Shri Bidap appointed Chairman of the Commission with effect from February 15, 1969.",
      "type": "material",
      "date": "1969-02-15",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "State took the view that the six years assured by Article 316(2) commenced from the date he became Member and did not receive a fresh start from the date he assumed office as Chairman.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "Government's view revealed in answer to interpellation in Legislative Council on March 17, 1973; on this reckoning, Chairman's term would end on March 19, 1973.",
      "type": "procedural",
      "date": "1973-03-17",
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "Respondent filed Writ Petition No. 774 of 1973 in Mysore High Court seeking writ interdicting Government's move; High Court granted timely interim order and allowed the writ petition on June 4, 1973.",
      "type": "procedural",
      "date": "1973-06-04",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Divergence of judicial opinion at High Court level: preponderance including Mysore High Court ruling militates against appellant's standpoint.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Administrative practice by Union Government, based on Attorney General's opinion prompted by Conference of All India Chairmen of Public Service Commissions and Calcutta High Court full Bench judgment, against appellant's position.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "In 12 states and Union, only two instances beyond eight years tenure and 19 cases more than six years, indicating practice of fresh term from Chairman appointment.",
      "type": "background",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the six-year term of office under Article 316(2) for a Member of a Public Service Commission commences afresh upon appointment as Chairman during the term, or runs from the initial appointment as Member.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Article 316(2) fixes a term of six years for a member, which includes Chairman; incumbent cannot exceed six years in all, as membership is common denominator covering both offices.",
      "supporting_facts": [
        "f1",
        "f2",
        "f3"
      ],
      "legal_basis": "Articles 316(2), 316(3), 317, 319"
    },
    {
      "id": "pa2",
      "text": "High policy limits official life to six years to prevent abuse, with bans on reappointment and subsequent employment; longer term via Chairmanship violates this.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": "Articles 316, 319; Constituent Assembly proceedings"
    },
    {
      "id": "pa3",
      "text": "Appointment as Chairman is reappointment to same office of member, violating ineligibility for reappointment under Article 316(3).",
      "supporting_facts": [
        "f2"
      ],
      "legal_basis": "Article 316(3)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Appointment as Chairman inaugurates a new term from the later date, based on harmonious reading of Articles 316 and 319.",
      "supporting_facts": [
        "f1",
        "f2"
      ],
      "legal_basis": "Articles 316(2), 319(1)(d)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Chairman is also a member, but office of member is different from office of Chairman with different duties; term under Article 316(2) runs from date enters upon his office, which for Chairman begins when starts functioning as Chairman.",
      "addresses_issue": "i1",
      "key_observation": "Offices are different though both holders are members."
    },
    {
      "id": "cr2",
      "text": "Article 316(3) prohibits reappointment to that particular office; elevation from member to Chairman is not reappointment to identical office.",
      "addresses_issue": "i1",
      "key_observation": "Re-appointment predicates previous holding of identical office."
    },
    {
      "id": "cr3",
      "text": "Article 319(1)(d) expressly makes member eligible for appointment as Chairman on ceasing to hold office as member; upon assuming Chairman office, member ceases to hold ordinary member office by implication.",
      "addresses_issue": "i1",
      "key_observation": "Automatic expiry of ordinary member office on assumption of Chairman office."
    },
    {
      "id": "cr4",
      "text": "Public policy against indefinite tenure not frustrated as maximum possible is 12 years in rare cases, and practice shows no widespread abuse.",
      "addresses_issue": "i1",
      "key_observation": "Apprehension of misuse not supported by practice."
    },
    {
      "id": "cr5",
      "text": "Follows minority view in Calcutta HC (Mitter J.), Mysore HC, Orissa HC, Patna HC decisions allowing fresh term.",
      "addresses_issue": "i1",
      "key_observation": "Harmonious construction resolves apparent conflict."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "A Member appointed as Chairman gets a fresh six-year term from the date of assuming office as Chairman; elevation to Chairman is appointment to a different office, not reappointment.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Full Bench decision of Calcutta High Court",
      "citation": "AIR 1966 Cal. 290",
      "treatment": "distinguished",
      "relevance": "Majority held term runs from member appointment; minority (Mitter J.) allowed fresh term followed by this Court."
    },
    {
      "case_name": "Mysore High Court in Writ Petitions Nos. 6492, 5031 and 3758 of 1969",
      "citation": "Unreported (Ext. B)",
      "treatment": "followed",
      "relevance": "Followed minority Calcutta view allowing continuance as Chairman."
    },
    {
      "case_name": "Orissa High Court",
      "citation": "AIR 1970 Orissa 205",
      "treatment": "followed",
      "relevance": "Appointment as Chairman causes ipso facto cessation of member office, reconciling Arts. 316 and 319."
    },
    {
      "case_name": "Patna High Court in C.W.J.C. 1997 of 1970",
      "citation": "Unreported",
      "treatment": "followed",
      "relevance": "Similar holding; SLP against it dismissed by Supreme Court."
    },
    {
      "case_name": "State of Travancore-Cochin v. Bombay Co. Ltd., Alleppey",
      "citation": "AIR 1952 SC 366",
      "treatment": "referred",
      "relevance": "Rule excluding Constituent Assembly debates in interpretation."
    },
    {
      "case_name": "A.K. Gopalan v. State of Madras",
      "citation": "1950 SCR 88",
      "treatment": "referred",
      "relevance": "Speeches indicative of speaker's intent only, not majority."
    }
  ],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Article 316",
        "Article 317",
        "Article 319"
      ],
      "relevance": "Appointment, term of office, reappointment bar, and post-cessation employment prohibitions for Public Service Commission members and Chairman interpreted harmoniously to allow fresh term on elevation to Chairman."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal by the State against the Mysore High Court judgment allowing the writ petition of Shri Bidap is dismissed; the respondent's appointment as Chairman entitles him to a fresh six-year term from February 15, 1969.",
    "relief_granted": "Writ petition allowed by High Court upheld; State restrained from ousting Chairman prematurely.",
    "costs": "Dismissed with costs."
  },
  "key_quotes": [
    {
      "text": "A Chairman is also a member... Nevertheless, the office of member is different from that of Chairman and so also the duties attached to each.",
      "speaker": "court",
      "significance": "Distinguishes offices, foundational to holding."
    },
    {
      "text": "To re-appoint to an office predicates the previous holding of that identical office. Re-, as a prefix has the sense of again.",
      "speaker": "court",
      "significance": "Explains why elevation to Chairman is not reappointment."
    },
    {
      "text": "For these reasons we dismiss the appeal with costs.",
      "speaker": "court",
      "significance": "Final disposition in favor of respondent."
    }
  ],
  "_case_id": "1973_230",
  "_label": 0,
  "_text_length": 39332,
  "_extracted_at": "2026-02-10T20:12:49.783817"
}