{
  "metadata": {
    "case_name": "Khatedars v. Special Land Acquisition Officer",
    "case_year": 1967,
    "court": "Supreme Court of India",
    "judges": [
      "Shelat, J."
    ],
    "case_number": "Civil Appeal Nos. 1353 to 1355 of 1967",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Lands of three Khatedars (appellants) acquired for submersion area of Linganmakki reservoir in Mysore State; areas: 29 acres and 37 guntas, 3.32 acres, and 8.20 acres respectively; all wet lands.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Special Land Acquisition Officer classified lands as rain-fed (one crop) and tank-fed (two crop/perennially irrigated); valued at Rs. 600 per acre for tank-fed and Rs. 500 per acre for rain-fed by capitalising net annual rent of Rs. 30 per acre (gross Rs. 37.50 from 1-1/2 pallas paddy at Rs. 25 per palla minus land revenue and bad debts).",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f3",
      "text": "Appellants referred matter under sec. 18 of Land Acquisition Act, 1894; District Judge increased valuation to Rs. 2500 per acre for tank-fed and Rs. 2000 per acre for rain-fed by capitalising whole net income (not just rent) by 20 years.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f4",
      "text": "Acquisition Officer appealed to Mysore High Court; High Court reduced compensation to uniform Rs. 1250 per acre for all lands (irrespective of tank-fed/rain-fed or tenant/self-cultivated), based on average rent of 2-1/2 pallas paddy (Rs. 62.50 at Rs. 25 per palla) capitalised by 20 years; awarded 6% interest.",
      "type": "procedural",
      "date": "1966-09-15",
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "High Court rejected District Judge's method of including tenant's share as net income, holding that tenant's labour and cultivation costs must be considered; applied uniform rent-based measure even to self-cultivated lands.",
      "type": "background",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "In Civil Appeal No. 1354 of 1967: 7 acres 10 guntas self-cultivated; part of lands in C.A. No. 1353 also self-cultivated by Khatedars.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Notifications under secs. 4 and 6 of Land Acquisition Act issued in April and August 1960.",
      "type": "procedural",
      "date": "1960-04/1960-08",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Tenants originally annual tenants; no notices issued to them by SLO or District Judge; some appeared as witnesses for claimants.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Mysore Tenancy Act XIII of 1952 (secs. 4, 5(1), 5(2), 15) deemed cultivators as tenants with minimum 5-year tenure; amended by Acts 16/1957, 24/1962, 12/1963; Act 16/1957 extended tenure and cancelled certain eviction notices.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Mysore Tenants Temporary Protection From Eviction Act 37 of 1961 (secs. 3,4) protected tenants from eviction till at least March 31, 1962.",
      "type": "background",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the High Court followed a correct principle in awarding a uniform rate of compensation of Rs. 1250 per acre for all acquired lands, irrespective of whether under tenants' cultivation or personal cultivation of claimants.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether tenants acquired any interest in the compensation due to operation of Mysore Tenancy Act and related laws.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Lands under personal cultivation (e.g., 7 acres 10 guntas in C.A. 1354 and part of C.A. 1353) should not be valued by capitalising annual rent from other tenant-cultivated lands; net return differs as self-cultivation involves deducting owner's costs from gross income.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "District Judge's method of capitalising whole net income (geni rent plus tenant's share) was appropriate.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Uniform measure of capitalised annual rent (2-1/2 pallas paddy) applies to all lands, whether tenant-cultivated or self-cultivated; tenant's labour and costs justify excluding their share from owner's income.",
      "supporting_facts": [
        "f4",
        "f5"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "If capitalised rent measure good for leased lands, equally good for personally cultivated lands.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "High Court erred in equating tenant-cultivated and self-cultivated lands with uniform rent-based measure; for self-cultivated lands, calculate gross income minus owner's cultivation costs/expenses, then capitalise by 20 years.",
      "addresses_issue": "i1",
      "key_observation": "Annual rent from tenant land not correct measure for personally cultivated land due to differences in quality, situation, productivity; net returns differ."
    },
    {
      "id": "cr2",
      "text": "SLO and District Judge failed to ascertain tenants' interests under Mysore Tenancy Act 1952 and amendments, which granted secured tenure; tenants may be entitled to share in compensation.",
      "addresses_issue": "i2",
      "key_observation": "Tenants ceased to be mere annual tenants; deemed tenants with fixed tenure; fairness requires ascertaining their share, subject to limitation."
    },
    {
      "id": "cr3",
      "text": "Fresh ascertainment of annual income, net after costs, required; separate treatment for tenant vs self-cultivated lands.",
      "addresses_issue": "i1",
      "key_observation": "Even if tenants get no share, self-cultivated lands cannot be valued same as tenant lands."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Compensation for self-cultivated lands must be based on net income (gross minus owner's costs) capitalised by 20 years, not rent from tenant lands.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Tenants' interests under tenancy laws must be ascertained for possible share in compensation.",
      "resolves_issue": "i2",
      "in_favor_of": "partial"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Land Acquisition Act, 1894",
      "sections": [
        "Section 18",
        "Section 4",
        "Section 6"
      ],
      "relevance": "Reference for enhanced compensation; notifications for acquisition"
    },
    {
      "name": "Mysore Tenancy Act, XIII of 1952",
      "sections": [
        "Section 4",
        "Section 5(1)",
        "Section 5(2)",
        "Section 15"
      ],
      "relevance": "Deemed tenants with minimum 5-year tenure; non-terminability except specified grounds"
    },
    {
      "name": "Mysore Act 16 of 1957",
      "sections": [
        "Section 4"
      ],
      "relevance": "Extended tenancies; cancelled certain eviction notices"
    },
    {
      "name": "Mysore Tenants Temporary Protection From Eviction Act, 37 of 1961",
      "sections": [
        "Section 3",
        "Section 4"
      ],
      "relevance": "Protected tenants from eviction during its operation"
    }
  ],
  "outcome": {
    "disposition": "remanded",
    "summary": "Appeals allowed; High Court judgment set aside; remanded to High Court for fresh calculation of compensation distinguishing tenant-cultivated and self-cultivated lands, ascertaining tenants' interests if any, and per principles stated; liberty for fresh evidence if needed.",
    "relief_granted": "Remand for fresh determination of market value/compensation",
    "costs": "Costs of these appeals will abide by the result in the High Court"
  },
  "key_quotes": [
    {
      "text": "the High Court was in error in equating the lands cultivated by the tenants and those under the personal cultivation of the claimants and applying to both a uniform measure, viz., the annual rent obtained from the former for fixing compensation.",
      "speaker": "court",
      "significance": "Core holding on erroneous uniform valuation"
    },
    {
      "text": "Ordinarily rent payable by a tenant would be fixed after calculating approximately the gross income less the tenants cost of cultivation, cost of labour expended by him and a certain amount of return for all the labour thrown in by him.",
      "speaker": "court",
      "significance": "Explains distinction in net income calculation for tenant vs owner cultivation"
    },
    {
      "text": "In assessing compensation for lands acquired, on the basis of capitalisation of annual income the usual method adopted is to capitalise the annual rent on the basis of certain number of years purchase.",
      "speaker": "court",
      "significance": "High Court's adopted principle, later critiqued for uniform application"
    }
  ],
  "_case_id": "1973_26",
  "_label": 1,
  "_text_length": 12927,
  "_extracted_at": "2026-02-10T20:11:03.165210"
}