{
  "metadata": {
    "case_name": "Appellants v. State",
    "case_year": 1970,
    "court": "Supreme Court of India",
    "judges": [
      "Dua, J."
    ],
    "case_number": "Criminal Appeal No. 5 of 1970",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "On August 11, 1963, between 7 and 8 a.m., Dharamvir (PW9) started from village Ramsara for his land in Azamgarh area driving a bullock cart with his wife Nathi (PW5), brother's wife Ankori (PW6), small girl Guddi, and Chandu; brother Jaidev (PW4) walking behind.",
      "type": "material",
      "date": "1963-08-11",
      "source": "prosecution"
    },
    {
      "id": "f2",
      "text": "Three jeeps overtook the cart near land of Ranbir appellant; one jeep obstructed in front, one by east side, one behind; 13 accused including five appellants emerged armed: Ranbir with spiked dang (sela), Laxmi with kuthari, Hanuman with gun, others with lathis.",
      "type": "material",
      "date": "1963-08-11",
      "source": "prosecution"
    },
    {
      "id": "f3",
      "text": "Accused pulled Dharamvir from cart and beat him; Jaidev intervened to save brother but beaten by Ranbir, Laxmi and another; Ankori and Nathi tried to protect husbands and were beaten; witnessed by Tota Ram (PW7) and Hardwari (PW8).",
      "type": "material",
      "date": "1963-08-11",
      "source": "prosecution"
    },
    {
      "id": "f4",
      "text": "Accused lifted injured Dharamvir and Jaidev into one jeep and drove east; in Ranbir's field, Jaswant wrapped gunny bag around Dharamvir's knees, Laxmi placed 5 seer iron weight under knee, Ranbir and Sahi Ram struck hammer blows on knee.",
      "type": "material",
      "date": "1963-08-11",
      "source": "prosecution"
    },
    {
      "id": "f5",
      "text": "Jaidev taken 20 karams away and given similar knee injuries by Ranbir, Jaswant, Laxmi, Sahi Ram; both put back in jeep to cut into pieces and throw in pucca canal near Fazilka.",
      "type": "material",
      "date": "1963-08-11",
      "source": "prosecution"
    },
    {
      "id": "f6",
      "text": "Jeeps driven towards Abohar; at katcha canal 11 miles from Abohar towards Ramsara, one jeep returned to Ramsara, two proceeded; near Abohar PS, injured raised alarm 'Mardiya Mardiya', accused dropped them roadside and fled.",
      "type": "material",
      "date": "1963-08-11",
      "source": "prosecution"
    },
    {
      "id": "f7",
      "text": "ASI Bhagat Singh and policemen arrived; SI Bhagat Singh recorded Jaidev's statement sent to PS, FIR Exh. PG/2 recorded; injured taken to Civil Hospital Abohar, then Fazilka, Dharamvir to Ferozepur.",
      "type": "procedural",
      "date": "1963-08-11",
      "source": "prosecution"
    },
    {
      "id": "f8",
      "text": "Sessions Judge, Ferozepur tried 13 accused under ss. 148, 307/149, 364 IPC; acquitted Moman due to non-inclusion in FIR, lack of support by witnesses; convicted remaining 12 including five appellants under ss. 148 and 325/149 IPC to RI 2 years and fine Rs. 200/- each.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Punjab and Haryana High Court, in Criminal Appeal No. 836 of 1964, judgment dated July 22, 1966, upheld conviction of five appellants (Ranbir, Laxmi, Hanuman, Jaswant, Hari Ram), acquitted other seven giving benefit of doubt due to identification issues and enmity.",
      "type": "procedural",
      "date": "1966-07-22",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Admitted enmity between parties; eye-witnesses supported participation of five appellants consistently; medical evidence consistent; FIR corroborative.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Tota Ram (PW7) examined after delay, hid for four days out of fear; no question to IOs on delay.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f12",
      "text": "Tracks of only one jeep traceable though three jeeps used.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether testimony of eye-witnesses reliable despite enmity and discrepancies, entitling appellants to benefit of doubt?",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether substratum of prosecution case proved beyond reasonable doubt against five appellants?",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Testimony of eye-witnesses not worthy of acceptance due to admitted enmity, discrepancies, danger of false implication; all accused entitled to acquittal.",
      "supporting_facts": [
        "f10",
        "f9"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Falsus in uno falsus in omnibus applicable; chance of false implication of all accused.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Delay in examining Tota Ram (PW7) casts suspicion.",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": null
    },
    {
      "id": "pa4",
      "text": "Only one jeep track traceable despite three jeeps, making prosecution story untrustworthy.",
      "supporting_facts": [
        "f12"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Eye-witness testimony consistent on participation of five appellants; medical evidence and FIR corroborative; substratum intact.",
      "supporting_facts": [
        "f2",
        "f3",
        "f4",
        "f5",
        "f10"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "In party factions, tendency to implicate innocents with guilty, but where substratum intact and witnesses identify assailants, court must sift evidence carefully; maxim falsus in uno falsus in omnibus not applicable in India.",
      "addresses_issue": "i1",
      "key_observation": "Evidence believed by both courts against five appellants acceptable, proves guilt beyond doubt."
    },
    {
      "id": "cr2",
      "text": "Delay in Tota Ram's examination not material without questioning IO; he hid out of fear.",
      "addresses_issue": "i1",
      "key_observation": "No unfair practice suggested."
    },
    {
      "id": "cr3",
      "text": "Jeep tracks: jeeps one behind other, one track expected; no discrepancy with eye-witnesses.",
      "addresses_issue": "i1",
      "key_observation": "Trial court rightly repelled argument."
    },
    {
      "id": "cr4",
      "text": "High Court conclusions on facts final under Art. 136 unless serious defect; no infirmity found.",
      "addresses_issue": "i2",
      "key_observation": "No departure from normal practice warranted."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Evidence against five appellants reliable; convictions under ss. 148 and 325/149 IPC upheld.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Appeal by special leave dismissed.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Deep Chand v. State of Haryana",
      "citation": "1969 3 S.C.C. 890",
      "treatment": "referred",
      "relevance": "Maxim falsus in uno falsus in omnibus not sound rule in India; scrutinise evidence carefully if substratum intact."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "148",
        "325/149",
        "307/149",
        "364"
      ],
      "relevance": "Offences charged: rioting armed with deadly weapon, voluntarily causing grievous hurt by dangerous weapons in prosecution of common object, attempt to murder, kidnapping."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court dismissed the appeal by special leave, upholding the Punjab and Haryana High Court's judgment convicting the five appellants under Sections 148 and 325/149 IPC and sentences of rigorous imprisonment for two years and fine of Rs. 200/- each.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"the maxim falsus in uno falsus in omnibus is not a sound rule to apply in the conditions in this country\"",
      "speaker": "court",
      "significance": "Rejects blanket rejection of witness testimony; basis for sifting evidence."
    },
    {
      "text": "\"No doubt, in cases of party factions, there is generally speaking, a tendency on the part of the prosecution witnesses to implicate some innocent persons also along with the guilty ones\"",
      "speaker": "court",
      "significance": "Explains approach to faction cases with enmity."
    }
  ],
  "_case_id": "1973_106",
  "_label": 0,
  "_text_length": 15324,
  "_extracted_at": "2026-02-10T20:11:34.980618"
}