{
  "metadata": {
    "case_name": "State of Punjab v. Jagir Singh, Baljit Singh and Karam Singh",
    "case_year": 1972,
    "court": "Supreme Court of India",
    "judges": [
      "KHANNA, J."
    ],
    "case_number": "Criminal Appeal No. 7 of 1972",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Nine accused tried: Jagir Singh 27, Baljit Singh 36, Karam Singh 30, Amarjit Singh 38, Atma Singh 27, Chanan Singh 22, Tarlok Singh 19, Joginder Singh 22, Swarn Singh 23.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Occurrence on July 8, 1968 in village Longowal Khurd. Labh Singh 35, Joginder Singh 30, Lakha Singh 25 received fatal injuries. Ajit Singh, Jarnail Singh, Mohinder Singh, Harbans Singh PWs injured.",
      "type": "material",
      "date": "1968-07-08",
      "source": "prosecution"
    },
    {
      "id": "f3",
      "text": "Strained relations between accused party and deceased party for 10-12 years, involved in cross criminal cases. Two years prior, Lakha Singh and others injured Atma Singh and Puran Singh; case pending in Magistrate Batala court.",
      "type": "background",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f4",
      "text": "July 8, 1968 date of hearing in Batala court. Chanan Singh PW 8 accompanied Lakha Singh to court, returned to Lakha's house in Longowal Khurd (2.5 miles from Batala).",
      "type": "procedural",
      "date": "1968-07-08",
      "source": "prosecution"
    },
    {
      "id": "f5",
      "text": "Heard changars (challenging shouts) near Labh Singh's house. Lakha Singh, Harbans Singh PW 21, Chanan Singh PW 8 went there. Found Labh Singh, Joginder Singh, Lakha Singh deceased, Ajit Singh PW 19, Jarnail Singh PW 22, Mohinder Singh PW 27, Harbans Singh PW 21, Bawa Singh PW 25, Chanan Singh PW 26 in courtyard. Also wives Joginder Kaur and Harbans Kaur.",
      "type": "material",
      "date": "1968-07-08",
      "source": "prosecution"
    },
    {
      "id": "f6",
      "text": "Nine accused came near compound wall (6.5 ft high outside, 4.5 ft inside). At instigation of Tarlok Singh, Atma Singh, Swarn Singh, Jagir Singh and Baljit Singh threw one hand-grenade each into courtyard. Both exploded, injuring deceased and PWs.",
      "type": "material",
      "date": "1968-07-08",
      "source": "prosecution"
    },
    {
      "id": "f7",
      "text": "Accused entered courtyard. Karam Singh, Amarjit Singh with spears; Tarlok, Joginder, Atma, Chanan, Swarn with kirpans; Jagir, Baljit empty handed. Karam gave spear blow to left flank of Labh Singh. Amarjit spear to right arm of Labh. Joginder kirpan to nose of Harbans Singh PW. Chanan accused sheathed kirpan to back of Mohinder Singh PW. Swarn towards Chanan PW 8, who took danda and hit Swarn's left shoulder. Accused ran away after alarm.",
      "type": "material",
      "date": "1968-07-08",
      "source": "prosecution"
    },
    {
      "id": "f8",
      "text": "Labh Singh succumbed soon. Cart from Chanan Singh PW 26's house (Longowal Kalan, 2.5 furlongs away). Lakha and Joginder laid on cart, taken to Batala hospital by Chanan PW 8, Harbans, Sarjan, Mohinder. Chanan lodged FIR at PS Sadar Batala at 11.15 p.m.",
      "type": "procedural",
      "date": "1968-07-08",
      "source": "prosecution"
    },
    {
      "id": "f9",
      "text": "SI Kehar Singh PW 30 went to hospital. Deputed ASIs/constables to scene. Found Lakha, Joginder; Dr. Dhillon examined, endorsed fit for statements. Deputed HC for magistrate (raining, no arrival). Recorded dying declarations in Dr. Dhillon's presence. Sent to VJ Hospital Amritsar.",
      "type": "procedural",
      "date": "1968-07-08",
      "source": "prosecution"
    },
    {
      "id": "f10",
      "text": "SI reached scene at 5 a.m., found Labh body, inquest report, blood-stained earth from 3 places, lever P1, percussion cap P2, 4 grenade pieces sealed.",
      "type": "procedural",
      "date": "1968-07-09",
      "source": "prosecution"
    },
    {
      "id": "f11",
      "text": "Injuries: Harbans (2 grievous lacerated: right index finger, nose bridge, July 9 Dr. Dhillon). Ajit (simple punctured thigh). Jarnail (simple lacerated neck). Mohinder (4 simple, July 10 Dr. Mago).",
      "type": "material",
      "date": "1968-07-09",
      "source": "prosecution"
    },
    {
      "id": "f12",
      "text": "Lakha died July 10, Joginder July 11 at VJ Amritsar. PM by Dr. Narinder Mohan July 11.",
      "type": "material",
      "date": "1968-07-10",
      "source": "prosecution"
    },
    {
      "id": "f13",
      "text": "Grenade parts to PW 20 J.M. John, opined remnants of exploded hand-grenade.",
      "type": "material",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f14",
      "text": "Sessions Judge convicted Jagir, Baljit u/s 302 IPC two counts (Joginder, Lakha) death each; 302/34 for Labh life; 307 four counts (Mohinder, Ajit, Jarnail, Harbans) 3 yrs RI each. Karam u/s 302 for Labh death; 302/34 two counts life; 307/34 four counts 3 yrs. Acquitted other six.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f15",
      "text": "High Court on appeal/reference acquitted Jagir, Baljit, Karam benefit of doubt.",
      "type": "procedural",
      "date": "1971-02-25",
      "source": "lower_court"
    },
    {
      "id": "f16",
      "text": "Accused relations: Karam, Amarjit, Baljit brothers; Jagir, Joginder, Tarlok brothers; Chanan, Swarn brothers; Atma maternal uncle of Jagir. Deceased: Labh, Joginder brothers; Chanan PW8, Mohinder PW27 their brothers; Harbans PW21 brother of Lakha.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f17",
      "text": "Accused plea: denial. Chanan, Swarn added heard changars, bomb explosion at guru dwara at 10 p.m., did not stir.",
      "type": "disputed",
      "date": "1968-07-08",
      "source": "respondent"
    },
    {
      "id": "f18",
      "text": "Defence: Bachan Singh admitted Batala hospital with injuries night July 8-9, metallic substance removed July 20. Labh Singh away to Pathankot at 7 p.m.",
      "type": "disputed",
      "date": "1968-07-08",
      "source": "respondent"
    },
    {
      "id": "f19",
      "text": "PM Labh by Dr. Dhillon: 5 injuries, 3 by grenade, 2 sharp pointed. Fatal: punctured incised over 5th rib left, fracture, lung puncture etc.",
      "type": "material",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f20",
      "text": "PM Joginder: 3 lacerated grenade; fatal penetrating epigastric. Lakha: 2 grenade; fatal abdominal.",
      "type": "material",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f21",
      "text": "Occurrence at 7.15 p.m., sunset 7.28 p.m., full moon next day.",
      "type": "material",
      "date": "1968-07-08",
      "source": "prosecution"
    },
    {
      "id": "f22",
      "text": "FIR received by magistrate at 1 a.m.",
      "type": "procedural",
      "date": "1968-07-09",
      "source": "prosecution"
    },
    {
      "id": "f23",
      "text": "Labh wearing only kachha and parna.",
      "type": "material",
      "date": "1968-07-08",
      "source": "prosecution"
    },
    {
      "id": "f24",
      "text": "Plan discrepancy: wall 6.5 ft outside, 4.5 inside explained by higher courtyard level by draftsman PW 9 Bal Kishan.",
      "type": "disputed",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f25",
      "text": "Dr. Dhillon: Harbans nose injury could be kirpan or missile.",
      "type": "material",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f26",
      "text": "Radhey Sham DW3: Labh drove bus to Pathankot 7 p.m. But Dalip Singh PW11 records: Piara Singh drove; Piara PW12 relieved Labh at Batala 5 p.m.; Yes Raj DW2 way bill initial.",
      "type": "disputed",
      "date": "1968-07-08",
      "source": "respondent"
    },
    {
      "id": "f27",
      "text": "Bachan Singh DW6 denied presence/injury at occurrence, said dispute with father. Piaro DW4 same.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the High Court erred in acquitting Jagir Singh, Baljit Singh and Karam Singh by giving benefit of doubt, setting aside Sessions Judge's conviction.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "High Court erred in setting aside conviction of three accused-respondents; view manifestly unreasonable.",
      "supporting_facts": [
        "f14",
        "f15"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "View taken by High Court correct; prosecution evidence unreliable due to party witnesses, delay in FIR, discrepancy in plans, injury nature, Labh in Pathankot, Bachan injury, light, etc.",
      "supporting_facts": [
        "f17",
        "f18",
        "f24",
        "f25",
        "f26"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Eyewitnesses reliable despite relation; injured PWs present; FIR prompt (4 hrs reasonable post-shock, distance); contains material facts, corroborates ocular. Grenade pieces at courtyard, not gurudwara. Wall height explained. Nose injury possible by kirpan. Labh not in Pathankot per records. Enough light pre-sunset. Bachan injury immaterial. High Court based on conjectures, suspicion of officers unwarranted.",
      "addresses_issue": "i1",
      "key_observation": "Prosecution evidence ex facie trustworthy; High Court view manifestly unreasonable, miscarriage of justice."
    },
    {
      "id": "cr2",
      "text": "Criminal trial judges evidence by probabilities, intrinsic worth; reject fanciful conjectures.",
      "addresses_issue": "i1",
      "key_observation": "High Court rejected convincing evidence on surmises."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Accept appeal, set aside High Court acquittal, restore Sessions convictions for offences under 302, 302/34, 307, 307/34 IPC.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Reduce death sentence u/s 302 to life imprisonment due to >2 years since acquittal.",
      "resolves_issue": "i1",
      "in_favor_of": "partial"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "302",
        "302 read with 34",
        "307",
        "307 read with 34"
      ],
      "relevance": "Convictions for murder, common intention murder, attempt to murder, common intention attempt to murder."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal accepted; High Court judgment set aside; accused-respondents Jagir Singh, Baljit Singh, Karam Singh convicted as per Sessions Judge for offences under sections 302, 302/34, 307, 307/34 IPC; death sentences commuted to life imprisonment; other sentences maintained.",
    "relief_granted": "Conviction restored with modified sentence to life imprisonment for section 302 IPC.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The view taken by the High Court is manifestly unreasonable and has resulted in miscarriage of justice.",
      "speaker": "court",
      "significance": "Core finding reversing High Court acquittal."
    },
    {
      "text": "A criminal trial is not like a fairy tale wherein one is free to give flight to one's imagination and phantasm.",
      "speaker": "court",
      "significance": "Emphasizes evidence must be judged by probabilities, not conjectures."
    },
    {
      "text": "If their evidence can stand that test, as it does in the present case, there is no reason why it should not be acted upon.",
      "speaker": "court",
      "significance": "On reliability of related/injured eyewitnesses."
    }
  ],
  "_case_id": "1973_183",
  "_label": 1,
  "_text_length": 31689,
  "_extracted_at": "2026-02-10T20:12:11.962056"
}