{
  "metadata": {
    "case_name": "Government of Madras v. Respondent",
    "case_year": 1967,
    "court": "Supreme Court of India",
    "judges": [
      "Mathew, J."
    ],
    "case_number": "Civil Appeals Nos. 1468-69 of 1967",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The appellant, the Government of Madras, acquired 9 acres and 86 cents of land in Tirunelveli District as it was needed for reserve area in Block III of Manimuthar Project.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Notification under s. 4(1) of the Land Acquisition Act was published on March 7, 1956.",
      "type": "procedural",
      "date": "1956-03-07",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The area of the land concerned in this appeal is one acre and 59 cents comprised of 3 topes of coconuts and oranges.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The Land Acquisition Officer, by his award, gave a total compensation of Rs. 28,572-15-6 inclusive of solatium. The method adopted by him for valuing coconut and orange topes was to capitalize the net income from these topes at 20 years purchase.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Dissatisfied with the award, the respondent moved for reference under s. 18 of the Land Acquisition Act and the case was referred to the Subordinate Judge, Tirunelveli.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The learned Subordinate Judge increased the estimated yield from the coconut and orange trees as well as the price of the yield but capitalized the net income at 20 years purchase.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Against this decision, the State of Madras filed A.S. No. 63 of 1959, while the respondent filed A.S. No. 78 of 1959 in the High Court of Madras.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "The High Court, by the common judgment under appeal dated April 10, 1962, allowed the appeals in part and dismissed them in other respects. As regards the coconut and orange topes, the High Court held that capitalization of the net income at 20 years purchase was a fair method for arriving at their market value.",
      "type": "procedural",
      "date": "1962-04-10",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "The Land Acquisition Officer found in his award that all the fruit bearing trees will yield for more than 20 years.",
      "type": "background",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "These two appeals, by certificate, are directed against the judgment and decree of the High Court of Madras in A.S. Nos. 63 and 78 of 1959 dated April 10, 1962.",
      "type": "procedural",
      "date": "1962-04-10",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the High Court went wrong in capitalizing the net income of the coconut and orange topes at 20 years purchase to arrive at their market value.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The High Court went wrong in capitalizing the net income of the topes at 20 years purchase.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": "Shunmuga Velavuda Mudaliar and others v. Collector of Tanjore (AIR 1926 Mad 945), where it was held that the proper method to find out the market value of coconut garden would be to capitalize the net income from the garden at 10 years purchase."
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "No reason was given in Shunmuga Velavuda Mudaliar why capitalization should be at 10 years purchase. It distinguished Rajammal v. Head Quarters Deputy Collector (1914, 25 IC 393) which used 20 years for mango trees as long-lived.",
      "addresses_issue": "i1",
      "key_observation": "There was no discussion in the judgment of the principle on the basis of which such a mode of calculation was adopted."
    },
    {
      "id": "cr2",
      "text": "In Kompalli Nageshwara Rao v. Special Deputy Collector (AIR 1959 AP 52 at 62), the Court said that the approved method for valuing orchards is to capitalize their net income at a number of years purchase which has to be fixed with reference to the nature of the trees and other circumstances and capitalized at 15 years purchase.",
      "addresses_issue": "i1",
      "key_observation": "Number of years purchase fixed with reference to nature of trees."
    },
    {
      "id": "cr3",
      "text": "In Elias M. Cohen v. Secy. of State (43 Ind. Cas 172, AIR 1918 Pat. 625), the net income from an orchard was capitalized at 15 years purchase.",
      "addresses_issue": "i1",
      "key_observation": "Precedent for 15 years."
    },
    {
      "id": "cr4",
      "text": "The Land Acquisition Officer found that all the fruit bearing trees will yield for more than 20 years, which was the reason to capitalize at 20 years purchase.",
      "addresses_issue": "i1",
      "key_observation": "Learned Subordinate Judge and High Court did not go wrong in accepting this estimate of the average yielding life of coconut and orange trees."
    },
    {
      "id": "cr5",
      "text": "Capitalization of the net yield from these topes at 20 years purchase was a fair method to arrive at the market value of these topes. The method of valuation adopted was in the circumstances in no way unreasonable.",
      "addresses_issue": "i1",
      "key_observation": "Method reasonable given circumstances."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The learned Subordinate Judge and the High Court did not go wrong in accepting the estimate of average yielding life of coconut and orange trees at more than 20 years, and capitalization at 20 years purchase was a fair method.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Shunmuga Velavuda Mudaliar and others v. Collector of Tanjore",
      "citation": "AIR 1926 Mad. 945",
      "treatment": "distinguished",
      "relevance": "Held proper method for coconut garden is 10 years purchase; no reason given why 10 years."
    },
    {
      "case_name": "Rajammal v. Head Quarters Deputy Collector, Vellore",
      "citation": "1914 25 I.C. 393",
      "treatment": "referred",
      "relevance": "Estimated value of mango tope at 20 years annual rental as mango trees are long-lived."
    },
    {
      "case_name": "Kompalli Nageshwara Rao Others v. Special Deputy Collector, Land Acquisition",
      "citation": "AIR 1959 A.P. 52 at 62",
      "treatment": "followed",
      "relevance": "Approved method for orchards is to capitalize net income at number of years purchase fixed with reference to nature of trees; used 15 years for coconut and orange."
    },
    {
      "case_name": "Elias M. Cohen v. Secy. of State",
      "citation": "43 Ind. Cas 172; AIR 1918 Pat. 625",
      "treatment": "referred",
      "relevance": "Net income from orchard capitalized at 15 years purchase."
    }
  ],
  "statutes_cited": [
    {
      "name": "Land Acquisition Act",
      "sections": [
        "Section 4(1)",
        "Section 18"
      ],
      "relevance": "Notification under s.4(1); reference under s.18 for enhancement of compensation."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeals fail and they are dismissed with costs.",
    "relief_granted": null,
    "costs": "Dismissed with costs"
  },
  "key_quotes": [
    {
      "text": "We do not think that the learned Subordinate Judge and the High Court went wrong in accepting this estimate of the average yielding life of coconut and orange trees.",
      "speaker": "court",
      "significance": "Upholds the 20 years capitalization based on tree life estimate."
    },
    {
      "text": "We are not satisfied that the method of valuation adopted for finding out the market value of the topes was, in the circumstances, in any way unreasonable.",
      "speaker": "court",
      "significance": "Confirms the valuation method as fair."
    }
  ],
  "_case_id": "1973_410",
  "_label": 0,
  "_text_length": 4625,
  "_extracted_at": "2026-02-10T20:13:25.997338"
}