{
  "metadata": {
    "case_name": "Management v. Workman",
    "case_year": 1968,
    "court": "Supreme Court of India",
    "judges": [
      "GROVER, J."
    ],
    "case_number": "Civil Appeal No. 698 of 1968",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The workman concerned was charge-sheeted in respect of riotous and disorderly behaviour for having assaulted a tea maker Shri U. M. Abdul Kadar on May 29, 1965, inside the factory.",
      "type": "material",
      "date": "1965-05-29",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "A departmental enquiry was held wherein, it is said, he was given every opportunity to fully participate. He was found guilty of misconduct by the domestic tribunal and was accordingly dismissed.",
      "type": "procedural",
      "date": null,
      "source": "management"
    },
    {
      "id": "f3",
      "text": "There was a scheme of gratuity in force. Clause 4 of that scheme provides that if a dispute arises regarding a claim for payment of gratuity of a workman who has been dismissed for misconduct, such a dispute shall be referred to the labour court having jurisdiction.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "As a dispute arose with regard to the payment of gratuity, the matter was referred to the Labour Court in Industrial Dispute No. 70 of 1965, published in Kerala Govt. Gazette No. 39 dated 3-10-67. Award dated August 10, 1967.",
      "type": "procedural",
      "date": "1967-08-10",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "In statement of case by Secretary of Malabar Estate Workers Union: Worker not paid gratuity despite request. Gratuity scheme applicable. Allegations of misconduct do not disentitle worker to gratuity as they do not involve moral turpitude or financial loss. Worker entitled to gratuity for 18 years service at 15 days wages per completed year.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f6",
      "text": "Management's reply set out facts of dismissal for misconduct.",
      "type": "admitted",
      "date": null,
      "source": "management"
    },
    {
      "id": "f7",
      "text": "Before Labour Court, no dispute that dismissal was on account of misconduct consisting of riotous and disorderly manner and assaulting tea maker/supervisor.",
      "type": "admitted",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the workman is entitled to gratuity despite dismissal for misconduct involving riotous and disorderly behaviour and assault.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Workman guilty of serious misconduct of third category (acts of violence, riotous or disorderly behaviour), entitling forfeiture of gratuity in entirety per Delhi Cloth Mills and other precedents.",
      "supporting_facts": [
        "f1",
        "f2",
        "f7"
      ],
      "legal_basis": "Delhi Cloth General Mills Co., Ltd. v. Workmen; Remington Rand of India Ltd. v. The Workmen; Payment of Gratuity Act S.4(6)(b)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Allegations of misconduct do not involve moral turpitude or financial loss to company, do not disentitle worker to gratuity. Labour Court did not apply mind to nature and degree of misconduct.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Labour Court referred to State of Punjab v. Suraj Parkash but did not apply Delhi Cloth Mills which categorises misconduct: technical (no forfeiture), damage to property (partial), serious like violence/riotous (full forfeiture). This misconduct falls in third category.",
      "addresses_issue": "i1",
      "key_observation": "Misconduct conducive to grave indiscipline entails full forfeiture of gratuity."
    },
    {
      "id": "cr2",
      "text": "Remington Rand agrees with Delhi Cloth Mills on treatment for discipline-impacting misconduct. Payment of Gratuity Act S.4(6)(b) incorporates same principle though not applicable here. Rule conducive to industrial harmony.",
      "addresses_issue": "i1",
      "key_observation": "Facts not in dispute before Labour Court, no need to remit."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Gratuity payable to employee wholly forfeited if terminated for riotous or disorderly conduct or act of violence.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "State of Punjab v. Suraj Parkash Kapur",
      "citation": "1962 2 S.C.R. 711",
      "treatment": "referred",
      "relevance": "General argument rejected that gratuity always forfeited for misconduct; requires consideration of circumstances."
    },
    {
      "case_name": "Delhi Cloth General Mills Co., Ltd. v. Workmen and Others",
      "citation": "1969 2 S.C.R. 307",
      "treatment": "followed",
      "relevance": "Categorises misconduct into three types; third category (violence, riotous behaviour) entails full forfeiture of gratuity."
    },
    {
      "case_name": "Remington Rand of India Ltd. v. The Workmen",
      "citation": "1970 2 S.C.R. 935",
      "treatment": "followed",
      "relevance": "Agrees with Delhi Cloth Mills; misconduct impacting discipline requires forfeiture."
    }
  ],
  "statutes_cited": [
    {
      "name": "Payment of Gratuity Act",
      "sections": [
        "S. 4(6)(b)"
      ],
      "relevance": "Provides for forfeiture of gratuity for riotous conduct/violence; principle incorporated though statute not governing."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed, award of Labour Court set aside. Declared that the concerned workman is not entitled to the gratuity earned by him.",
    "relief_granted": "Forfeiture of gratuity upheld",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"if a workman is guilty of a serious misconduct of the third category, then, his gratuity can be forfeited in its entirety.\"",
      "speaker": "court",
      "significance": "Core holding on forfeiture for riotous misconduct."
    },
    {
      "text": "\"the gratuity payable to an employee shall be wholly forfeited if the services of such employee have been terminated for his riotous or disorderly conduct or any other act of violence on his part.\"",
      "speaker": "court",
      "significance": "Quotes Payment of Gratuity Act reinforcing principle."
    }
  ],
  "_case_id": "1973_57",
  "_label": 1,
  "_text_length": 7120,
  "_extracted_at": "2026-02-10T20:11:33.392893"
}