{
  "metadata": {
    "case_name": "Swarajya Lakshmi v. Dr. G. G. Padma Rao",
    "case_year": 1970,
    "court": "Supreme Court of India",
    "judges": [
      "MUKHERJEA, J."
    ],
    "case_number": "Civil Appeal No. 2248 of 1970",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant Swarajya Lakshmi and respondent Dr. G. G. Padma Rao were married on June 17, 1963. Appellant was 20 years old and respondent was 28 years old.",
      "type": "background",
      "date": "1963-06-17",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Appellant was taken away by her parents to New Delhi only two days after the marriage and returned to Hyderabad to live with her husband towards the end of August 1963.",
      "type": "background",
      "date": "1963-08-end",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "In September 1963, respondent discovered that appellant was suffering from leprosy and tuberculosis.",
      "type": "material",
      "date": "1963-09",
      "source": "respondent"
    },
    {
      "id": "f4",
      "text": "Respondent, being a doctor, started treating the appellant immediately and consulted two experts: Dr. C. V. Ethirajulu and Dr. Shanti Narayan Mathur.",
      "type": "material",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f5",
      "text": "Respondent contemplated admitting appellant to a leper home, but in May 1964, appellant was taken away by her father to New Delhi as she was expecting a child.",
      "type": "background",
      "date": "1964-05",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "On June 4, 1965, respondent filed a petition under Section 13(1)(iv) of the Hindu Marriage Act, 1955 for dissolution of marriage by decree of divorce on the ground that appellant had been suffering from a virulent and incurable form of leprosy for not less than three years preceding the petition.",
      "type": "procedural",
      "date": "1965-06-04",
      "source": "respondent"
    },
    {
      "id": "f7",
      "text": "Respondent made an application under Section 14(1) of the Act before the City Civil Court at Hyderabad for permission to present the petition before three years from marriage, on ground of exceptional hardship. Permission was granted.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "On February 22, 1966, Second Additional Chief Judge, City Civil Court, Hyderabad held that appellant had been suffering from incurable and virulent form of leprosy for not less than three years preceding petition, but petition was premature as parties had not been husband and wife for three years. Petition dismissed.",
      "type": "procedural",
      "date": "1966-02-22",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Respondent appealed to High Court of Andhra Pradesh. Division Bench by order dated July 22, 1969 allowed appeal, set aside trial court order, and granted decree for divorce to respondent under Section 13(1)(iv).",
      "type": "procedural",
      "date": "1969-07-22",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Appellant filed appeal by special leave to Supreme Court against High Court judgment.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f11",
      "text": "Both parties agreed that appellant was suffering from lepromatous form of leprosy.",
      "type": "admitted",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the appellant's leprosy was of a virulent and incurable form as required under Section 13(1)(iv) of the Hindu Marriage Act, 1955.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Meaning of 'virulent' in the context of Section 13(1)(iv), whether it is a medical term or to be interpreted from dictionaries and medical authorities.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether lepromatous leprosy is virulent and incurable, considering medical evidence and authorities.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The leprosy suffered by appellant was curable and she was on the way to recovery when the petition was presented.",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Virulent is not a medical term; relied on old Hindu law decisions interpreting virulent leprosy in context of inheritance disqualification.",
      "supporting_facts": [],
      "legal_basis": "Hindu law precedents on inheritance"
    },
    {
      "id": "pa3",
      "text": "Sulphone treatment has revolutionized leprosy treatment making it curable.",
      "supporting_facts": [],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Appellant's lepromatous leprosy was an incurable and virulent form.",
      "supporting_facts": [
        "f3",
        "f4",
        "f11"
      ],
      "legal_basis": "Section 13(1)(iv) Hindu Marriage Act, 1955; medical evidence"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Medical evidence from parties cancels each other; relied on well-known medical authorities and dictionaries as leprosy is well-known disease.",
      "addresses_issue": "i3",
      "key_observation": "Lepromatous leprosy is malignant and contagious per medical texts."
    },
    {
      "id": "cr2",
      "text": "Virulent not a medical term; dictionary meaning: malignant, infectious, poisonous. Lepromatous leprosy fits this as per authorities like Practice of Dermatology, Leprosy in Theory and Practice, etc.",
      "addresses_issue": "i2",
      "key_observation": "Lepromatous leprosy is virulent."
    },
    {
      "id": "cr3",
      "text": "Lepromatous leprosy is incurable: arrest possible with sulphones but not cure; lifelong treatment needed; relapses possible. Legislators knew of sulphones in 1955 but still provided for divorce on incurable leprosy.",
      "addresses_issue": "i3",
      "key_observation": "No complete cure even with advances."
    },
    {
      "id": "cr4",
      "text": "Distinguished old Hindu law precedents on inheritance as different context emphasizing social/religious competence, not using 'virulent' equivalently.",
      "addresses_issue": "i1",
      "key_observation": "Not applicable to divorce grounds."
    },
    {
      "id": "cr5",
      "text": "Divorce not favored; stricter conditions than judicial separation under Sec.10(1). Considered welfare of spouses and children, not parental conduct.",
      "addresses_issue": "i1",
      "key_observation": "Fit case for divorce despite suspicions of fraud by appellant's father."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Appellant's lepromatous leprosy is a virulent and incurable form under Section 13(1)(iv) of Hindu Marriage Act.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Virulent means malignant and infectious per dictionaries and medical authorities.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Rangayya Chetti v. Thanikachalla Muddi Ors.",
      "citation": "I.L.R. 19 Mad. 74",
      "treatment": "distinguished",
      "relevance": "Interpreted virulent leprosy in Hindu inheritance context as spreading quickly."
    },
    {
      "case_name": "Ananta Ramabai",
      "citation": "I.L.R. 1 Bom. 554",
      "treatment": "distinguished",
      "relevance": "Virulent leprosy as sanious or ulcerous kind for inheritance disqualification."
    },
    {
      "case_name": "Ramabai v. Harnabai",
      "citation": "I.L.R. 48 Bom. 363",
      "treatment": "distinguished",
      "relevance": "Privy Council on leprosy disqualification for joint family property if not apparent."
    },
    {
      "case_name": "Kayarchana Pathan v. Subbaraya Thevan",
      "citation": null,
      "treatment": "referred",
      "relevance": "Deformity and unfitness for social intercourse as test for virulent leprosy."
    },
    {
      "case_name": "Karali Charan Pal v. Ashutosh Nandi",
      "citation": "I.L.R. 38 Mad. 250 / I.L.R. 50 Cal. 604",
      "treatment": "distinguished",
      "relevance": "Sanious or ulcerous leprosy, not anesthetic, for inheritance exclusion."
    }
  ],
  "statutes_cited": [
    {
      "name": "Hindu Marriage Act, 1955",
      "sections": [
        "Section 13(1)(iv)",
        "Section 14(1)",
        "Section 10(1)"
      ],
      "relevance": "Grounds for divorce on virulent and incurable leprosy (3 years); permission for early petition on hardship; comparison with judicial separation (virulent leprosy, 1 year)."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court dismissed the appeal, upheld the Andhra Pradesh High Court judgment granting decree of divorce to respondent under Section 13(1)(iv) of Hindu Marriage Act on finding appellant's lepromatous leprosy virulent and incurable.",
    "relief_granted": "Decree of divorce in favour of respondent.",
    "costs": "No order as to costs."
  },
  "key_quotes": [
    {
      "text": "'Virulent therefore according to the dictionary meaning stands for malignant and infectious.'",
      "speaker": "court",
      "significance": "Defines key term 'virulent' for Section 13(1)(iv)."
    },
    {
      "text": "In the lepromatous type one should speak of arrest rather than cure, and it may take 3-15 years to rid the skin of bacilli sulphones should then be continued at half the maximal dosage for life.",
      "speaker": "court",
      "significance": "From Manson's Tropical Diseases; supports incurability of lepromatous leprosy."
    },
    {
      "text": "From the moment a marriage has been completed the relation of the husband and wife has to be considered only from the point of view of the welfare of the husband and wife and, also, of the children, if any, of the marriage.",
      "speaker": "court",
      "significance": "Emphasizes welfare over parental misconduct in divorce decision."
    }
  ],
  "_case_id": "1973_266",
  "_label": 0,
  "_text_length": 22329,
  "_extracted_at": "2026-02-10T20:12:49.726024"
}