{
  "metadata": {
    "case_name": "Harchand Singh & Jaswant Singh v. State of Punjab",
    "case_year": 1970,
    "court": "Supreme Court of India",
    "judges": [
      "KHANNA, J."
    ],
    "case_number": "Criminal Appeal No. 32 of 1970",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Gulab Kaur, widow of Jwala Singh, made a will of land measuring about fifty bighas in favour of Ajaib Singh (deceased) and his brother Tej Singh. Gulab Kaur died about two years before the occurrence.",
      "type": "background",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f2",
      "text": "Land of Gulab Kaur was under cultivating possession of Ajaib Singh and Teja Singh after her death. Accused are collaterals of Jwala Singh and felt aggrieved by the will.",
      "type": "background",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f3",
      "text": "On June 12, 1966 at about 10 or 11 a.m., Ajaib Singh went to work his well known as Nawa Khu in village Jaipura.",
      "type": "material",
      "date": "1966-06-12",
      "source": "prosecution"
    },
    {
      "id": "f4",
      "text": "Six accused present at their nearby well: Sadhu Singh and Harchand Singh armed with barchhas; Jaswinder Singh, Gajjan Singh and Labh Singh with gandasas; Jaswant Singh with takwa.",
      "type": "material",
      "date": "1966-06-12",
      "source": "prosecution"
    },
    {
      "id": "f5",
      "text": "Accused prevented Ajaib Singh from taking water from the well and inflicted injuries with their weapons.",
      "type": "material",
      "date": "1966-06-12",
      "source": "prosecution"
    },
    {
      "id": "f6",
      "text": "Occurrence witnessed by Ajaib Singh's sons Amarjit Singh and Mal Singh, and brother Teja Singh, present in nearby field.",
      "type": "disputed",
      "date": "1966-06-12",
      "source": "prosecution"
    },
    {
      "id": "f7",
      "text": "Eyewitnesses rushed to spot; accused ran away.",
      "type": "material",
      "date": "1966-06-12",
      "source": "prosecution"
    },
    {
      "id": "f8",
      "text": "Ajaib Singh taken on cart to Duraha, then Payal, then taxi to Khanna hospital, arrived 6.30 p.m.",
      "type": "procedural",
      "date": "1966-06-12",
      "source": "prosecution"
    },
    {
      "id": "f9",
      "text": "Dr. Shamsher Singh at Khanna hospital sent intimation to PS Khanna that Ajaib Singh's condition serious and statement might be recorded.",
      "type": "procedural",
      "date": "1966-06-12",
      "source": "prosecution"
    },
    {
      "id": "f10",
      "text": "ASI Harbhajan Singh recorded dying declaration of Ajaib Singh at 7.30 p.m., giving version of occurrence as above.",
      "type": "material",
      "date": "1966-06-12",
      "source": "prosecution"
    },
    {
      "id": "f11",
      "text": "Ajaib Singh died at 8.45 p.m. in Khanna hospital.",
      "type": "material",
      "date": "1966-06-12",
      "source": "prosecution"
    },
    {
      "id": "f12",
      "text": "Intimation of dying declaration sent to PS Payal; case registered, formal FIR prepared on basis of dying declaration.",
      "type": "procedural",
      "date": "1966-06-12",
      "source": "prosecution"
    },
    {
      "id": "f13",
      "text": "SI Hoshiar Singh investigated; arrested accused on June 16, 1966 hiding at Duraha power-house.",
      "type": "procedural",
      "date": "1966-06-16",
      "source": "prosecution"
    },
    {
      "id": "f14",
      "text": "Recoveries: Harchand Singh - blood-stained barchha; Jaswant Singh - blood-stained takwa; Jaswinder Singh - blood-stained gandasa.",
      "type": "material",
      "date": "1966-06-16",
      "source": "prosecution"
    },
    {
      "id": "f15",
      "text": "Post-mortem by Dr. Gurcharan Singh Randhawa on June 13, 1966 at 1 p.m.: 18 injuries, 7 by sharp-edged weapons; death due to shock and haemorrhage from cumulative effect.",
      "type": "material",
      "date": "1966-06-13",
      "source": "prosecution"
    },
    {
      "id": "f16",
      "text": "Accused denied prosecution allegations, falsely involved.",
      "type": "admitted",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f17",
      "text": "Trial court (Additional Sessions Judge, Ludhiana): Acquitted Sadhu, Gajjan, Labh; convicted Harchand & Jaswant u/s 304 Pt II r/w 34 IPC (7 years RI each); Jaswinder u/s 323 IPC (1 year RI). Rejected Amarjit (PW2), Mal (PW3), Teja (PW4), dying declaration; relied on Ram Asra (PW14) who said only 3 accused present, injuries by Harchand (drat sickle), Jaswant (kirpan).",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f18",
      "text": "Ram Asra's statement recorded by police June 13, 1966.",
      "type": "procedural",
      "date": "1966-06-13",
      "source": "court"
    },
    {
      "id": "f19",
      "text": "High Court (Punjab & Haryana, judgment April 23, 1969): In appeals (accused appeal 320/672/1967, State appeal): Acquitted Jaswinder; convicted Harchand & Jaswant u/s 302 r/w 34 IPC (life each). Relied on Amarjit, Mal, Teja & Ram Asra; held case under 302/34 not 304 Pt II/34.",
      "type": "procedural",
      "date": "1969-04-23",
      "source": "lower_court"
    },
    {
      "id": "f20",
      "text": "Supreme Court appeal by special leave by Harchand & Jaswant.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f21",
      "text": "Dr. Shamsher Singh examined Ajaib at Khanna hospital.",
      "type": "material",
      "date": "1966-06-12",
      "source": "prosecution"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the conviction of Harchand Singh and Jaswant Singh under section 302 read with section 34 IPC is sustainable given the contradictory eyewitness testimonies.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Reliability of eyewitnesses Amarjit Singh, Mal Singh, Teja Singh, and Ram Asra, and the dying declaration.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Conviction cannot be sustained due to unreliable and contradictory prosecution evidence: one set of eyewitnesses (Amarjit, Mal, Teja) contradicts the other (Ram Asra), and dying declaration inconsistencies.",
      "supporting_facts": [
        "f6",
        "f10",
        "f17",
        "f19"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Conviction can be based on single reliable witness; Ram Asra's testimony sufficient.",
      "supporting_facts": [
        "f17"
      ],
      "legal_basis": "Vadivalu Thevar v. State of Madras (1957 SCR 981)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Murderous assault on Ajaib Singh undisputed, 18 injuries including 7 sharp-edged, death by shock and haemorrhage.",
      "addresses_issue": "i1",
      "key_observation": "Prosecution examined two sets of eyewitnesses which contradict each other."
    },
    {
      "id": "cr2",
      "text": "Trial court correctly rejected Amarjit (PW2), Mal (PW3), Teja (PW4) as not present; reasons cogent. Ram Asra's evidence shows they were not present.",
      "addresses_issue": "i2",
      "key_observation": "Discrepancies: dying declaration says they were in nearby field; they claim coming from house 60 karams away with tools, unconvincing timing."
    },
    {
      "id": "cr3",
      "text": "Ram Asra (PW14) unreliable: not mentioned in dying declaration; Amarjit etc. say he was not there; his statement recorded late (June 13).",
      "addresses_issue": "i2",
      "key_observation": "Prosecution evidence itself condemns Ram Asra's testimony."
    },
    {
      "id": "cr4",
      "text": "No reliable trustworthy evidence to base conviction; contradictory sets leave no firm ground. Accused benefit from doubt.",
      "addresses_issue": "i1",
      "key_observation": "Court's function is to find guilt on reliable evidence; here prosecution evidence strikes at itself."
    },
    {
      "id": "cr5",
      "text": "Vadivalu Thevar principle applies only if single witness convincing and reliable; here prosecution evidence creates doubt on Ram Asra.",
      "addresses_issue": "i1",
      "key_observation": "Cannot sustain conviction on unreliable solitary witness contradicted by prosecution's own case."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Conviction of appellants cannot be sustained due to lack of reliable evidence; acquitted.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Vadivalu Thevar v. State of Madras",
      "citation": "1957 S.C.R. 981",
      "treatment": "referred",
      "relevance": "Conviction possible on single witness if convincing and reliable; distinguished here as evidence unreliable and self-contradictory."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "302",
        "304 Part II",
        "323",
        "34"
      ],
      "relevance": "Accused charged under 302/34 (murder with common intention), 304 Pt II/34 (culpable homicide not amounting to murder), 323 (voluntarily causing hurt); court finds no sustainable conviction."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Supreme Court allowed the appeal by Harchand Singh and Jaswant Singh, set aside High Court conviction under section 302 r/w 34 IPC, and acquitted them due to contradictory and unreliable prosecution eyewitness evidence.",
    "relief_granted": "Acquittal of Harchand Singh and Jaswant Singh",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The prosecution in support of its case examined two sets of eye witnesses. The evidence of one set consists of the testimony of Amarjit Singh, Mal Singh and Teja Singh... The other eye witness... is Ram Asra... prosecution evidence itself condemns the other set.",
      "speaker": "court",
      "significance": "Highlights core reason for acquittal: self-contradictory prosecution evidence."
    },
    {
      "text": "If in a case the prosecution leads two sets of evidence, each one of which contradicts and strikes at the other and shows it to be unreliable, the result would necessarily be that the court would be left with no reliable and trustworthy evidence.",
      "speaker": "court",
      "significance": "States principle applied to give benefit of doubt to accused."
    }
  ],
  "_case_id": "1973_408",
  "_label": 1,
  "_text_length": 13897,
  "_extracted_at": "2026-02-10T20:13:30.133196"
}