{
  "metadata": {
    "case_name": "Agricultural Industrial Syndicate Ltd. v. State of U.P.",
    "case_year": 1971,
    "court": "Supreme Court of India",
    "judges": [
      "Dwivedi J."
    ],
    "case_number": "Civil Appeal No. 2043 of 1971",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The appellant, the Agricultural Industrial Syndicate Ltd., is the tenure-holder of a large area of land in two villages in the district of Saharanpur in Uttar Pradesh, Aithal Buzurg and Bukkanpur.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Some of its land have been declared as surplus land under the U.P. Imposition of Ceiling on Land Holdings Act.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "It went in appeal against the order declaring surplus land to the District Judge, but without success.",
      "type": "procedural",
      "date": "1964-01-31",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Its writ petition has been partly allowed and partly dismissed by the Allahabad High Court by judgment and order dated July 27, 1970 in Writ Petition No. 1701 of 1964.",
      "type": "procedural",
      "date": "1970-07-27",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "This appeal, by special leave, is directed against the latter part of the order of the High Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "As the appellant did not file a statement under s. 9, a statement prepared under s. 10 was served on it. An objection was filed by it indicating the plots which it wanted to retain as its ceiling area.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "The Prescribed Authority did not accept its choice wholly.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "After the decision of the Prescribed Authority, it received CH Form V issued under the provisions of the U.P. Consolidation of Holdings Act with respect to the land situated in village Bukkanpur.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "A review application was then moved before the Prescribed Authority on the ground of the pendency of consolidation operations in village Bukkanpur. The application was rejected on September 15, 1962.",
      "type": "procedural",
      "date": "1962-09-15",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "While the appeal against the order of the Prescribed Authority was pending, village Aithal Buzurg was also brought under consolidation operations. The appellant received CH Form V issued under the Consolidation Act with respect to the plots situate in village Aithal Buzurg.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "It made an application to the appellate authority informing him of the initiation of consolidation operations in the two villages. It is said that the appellate authority took no notice of the application and decided the appeal on merits.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "The appellate authority also did not accept wholly the choice of the appellant in regard to the plots to be retained as its ceiling area.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "In the writ petition before the High Court, the appellant pressed two points: First, the Prescribed Authority and the appellate authority should have accepted entirely the choice of the plots which it wanted to retain as the ceiling area; second, the two authorities should have stayed the proceedings under the Ceiling Act during consolidation operations in the said villages.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f14",
      "text": "The first contention was accepted by the High Court; the second was rejected.",
      "type": "procedural",
      "date": "1970-07-27",
      "source": "court"
    },
    {
      "id": "f15",
      "text": "The High Court quashed the order of the appellate authority and directed it to decide the appeal in the light of its judgment. The High Court also directed that the proceedings before the consolidation authorities would remain stayed until the appeal was decided by the appellate authority under the Ceiling Act.",
      "type": "procedural",
      "date": "1970-07-27",
      "source": "lower_court"
    },
    {
      "id": "f16",
      "text": "This appeal is confined to the second point.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f17",
      "text": "While the petition was pending in the High Court, the Consolidation Officer and the Asstt. Settlement Officer had adjudicated upon the objections of a large number of persons claiming interest in the plots of the appellant. Their objections were dismissed. They filed revisions against those orders. The revisions were pending when the petition was heard by the High Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f18",
      "text": "After the decision of the High Court, the State Government has issued a notification under s. 6 of the Consolidation Act canceling the notification bringing the aforesaid villages under consolidation operations.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f19",
      "text": "The High Court has admitted a writ petition of the appellant against this notification and has stayed the operation of the notification.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the proceedings under the Ceiling Act should be stayed or abated during consolidation operations under the Consolidation Act, specifically whether such proceedings fall within s.5(2) of the Consolidation Act.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The Prescribed Authority and the appellate authority should have stayed the proceedings under the Ceiling Act during consolidation operations in the said villages.",
      "supporting_facts": [
        "f8",
        "f9",
        "f10",
        "f11",
        "f17"
      ],
      "legal_basis": "Section 5(2) of the U.P. Consolidation of Holdings Act"
    },
    {
      "id": "pa2",
      "text": "As revisions were pending under the Consolidation Act, its interest in the plots was under cloud. It might or might not be held to be the tenure-holder of all or some of the plots.",
      "supporting_facts": [
        "f17"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "There was no merit in the argument that proceedings under the Ceiling Act should be stayed during consolidation operations.",
      "supporting_facts": [],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "The appellant had not raised the argument before the Prescribed Authority and the appellate authority.",
      "supporting_facts": [],
      "legal_basis": null
    },
    {
      "id": "ra3",
      "text": "All those claimants before the revising authority under the Consolidation Act can be impleaded as parties in the proceedings under the Ceiling Act.",
      "supporting_facts": [
        "f17"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The second reason assigned by the High Court for rejecting the second argument of the appellant may be disposed of first. It is clear from the facts already stated that the appellant did raise at the proper time before the Prescribed Authority and the appellate authority the argument that the proceedings under the Ceiling Act should remain stayed during consolidation operations.",
      "addresses_issue": "i1",
      "key_observation": "Appellant did raise the point earlier."
    },
    {
      "id": "cr2",
      "text": "The Prescribed Authority acting under s. 10(2) and 12 of the Ceiling Act is an authority within the meaning of that expression in s. 5(2). The proceeding before him will be a proceeding within the meaning of the said word in s. 5(2). But the proceeding before him is not a proceeding for the correctness of records or for declaration or adjudication of any other right in regard to which proceedings can or ought to be taken under the Consolidation Act.",
      "addresses_issue": "i1",
      "key_observation": "Limited question: whether proceeding is in respect of declaration of rights or interest in any land."
    },
    {
      "id": "cr3",
      "text": "Where the tenure-holder does not voluntarily file a statement under s.9 and disputes that he is not the tenure-holder of all or some of the plots included in the statement prepared under s.10, there ensues a dispute about a right or interest in land.",
      "addresses_issue": "i1",
      "key_observation": "In this case, dispute exists due to claims by others."
    },
    {
      "id": "cr4",
      "text": "Section 49 of the Consolidation Act: Notwithstanding anything contained in any other law for the time being in force, the declaration and adjudication of rights of tenure-holders in respect of land lying in an area, for which a notification has been issued under sub-section (2) of s.4 shall be done in accordance with the provisions of this Act.",
      "addresses_issue": "i1",
      "key_observation": "Non-obstante clause excludes operation of Ceiling Act."
    },
    {
      "id": "cr5",
      "text": "Section 5(2) and s.49 indicate clearly that the proceedings in the instant case are to be abated under s.5(2).",
      "addresses_issue": "i1",
      "key_observation": "Ceiling Act proceedings abate."
    },
    {
      "id": "cr6",
      "text": "As soon as the consolidation operations are closed on the valid issue of a notification under s.6 or s.52, the proceeding under the Ceiling Act may be resumed.",
      "addresses_issue": "i1",
      "key_observation": "Temporary abatement."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The proceedings under the Ceiling Act abate under s.5(2) of the Consolidation Act during consolidation operations where there is a dispute about rights or interest in land.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "U.P. Imposition of Ceiling on Land Holdings Act",
      "sections": [
        "Section 9",
        "Section 10",
        "Section 12",
        "Section 32"
      ],
      "relevance": "Governs determination of ceiling area and surplus land; proceedings before Prescribed Authority may involve declaration of rights."
    },
    {
      "name": "U.P. Consolidation of Holdings Act",
      "sections": [
        "Section 4",
        "Section 5",
        "Section 6",
        "Section 48",
        "Section 48A",
        "Section 49",
        "Section 52"
      ],
      "relevance": "Section 5(2) provides for abatement of proceedings for declaration of rights or interest in land; Section 49 gives preemptive jurisdiction with non-obstante clause."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "The appeal is allowed and the judgment of the High Court is set aside. The writ petition filed by the appellant in the High Court is allowed in toto. The order of the District Judge, dated January 31, 1964, is quashed and the proceedings under the Ceiling Act are abated under s.5(2) of the Consolidation Act. The proceedings under the Ceiling Act may be resumed after the issue of a notification under s.52 or after the dismissal of the writ petition challenging the notification under s.6.",
    "relief_granted": "Quashing of District Judge's order; abatement of Ceiling Act proceedings; resumption after consolidation closure.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "Section 5(2) and s.49 indicate clearly that the proceedings in the instant case are to be abated under s.5(2).",
      "speaker": "court",
      "significance": "Core holding on abatement of proceedings."
    },
    {
      "text": "Notwithstanding anything contained in any other law for the time being in force, the declaration and adjudication of rights of tenure-holders in respect of land lying in an area... shall be done in accordance with the provisions of this Act.",
      "speaker": "court",
      "significance": "Quotes s.49 non-obstante clause giving primacy to Consolidation Act."
    }
  ],
  "_case_id": "1973_171",
  "_label": 1,
  "_text_length": 14765,
  "_extracted_at": "2026-02-10T20:12:13.156560"
}