{
  "metadata": {
    "case_name": "V. Ramanaiah v. State of Andhra Pradesh",
    "case_year": 1973,
    "court": "Supreme Court of India",
    "judges": [
      "Sarkaria, J."
    ],
    "case_number": "Writ Petition No. 1435 of 1973",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "V. Ramanaiah was convicted of offences under sections 489-A to 489-D, Penal Code, on 17th July, 1968, by the Sessions Court, Nellore, Andhra Pradesh and sentenced to rigorous imprisonment for a period of 10 years.",
      "type": "material",
      "date": "1968-07-17",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Six other persons namely, 1. B. Sitaramireddi, 2. M. Rangareddy, 3. Ch. Somireddy, 4. K. E. Lakshman, 5. K. Balaram and 6. Mallikharjundu, were also tried and convicted of offences under all or some of the sections 489-A to 489-D, Penal Code and were sentenced to various terms of imprisonment by the same Court.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On the occasion of Gandhi Centenary celebrations, the Governor of Andhra Pradesh, purporting to exercise the powers under Article 161 of the Constitution, issued G.O. No. Ms. 1321, Home Prisons A Department, dated 25th September, 1969, granting special remission of sentences to various categories of prisoners mentioned therein. The preamble of this G.O. expressly limits its operation to prisoners who are convicted of offences against laws relating to matters to which the executive power of the State extends.",
      "type": "material",
      "date": "1969-09-25",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The jail authorities obviously misinterpreting the aforesaid G.O., granted the benefit of remission thereunder to prisoners B. Sitaramireddi, M. Rangareddy, K. Balaram and T. Mallikharjundu and released them from jail.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The mistake came to the notice of the Inspector-General of Prisons, and, as a result of his intervention, the release of the petitioner and another prisoner, K. E. Lakshman, was stopped and they are still undergoing the remaining terms of their sentences.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The petitioner submitted several applications to the State Government, urging it to release him in exercise of its power of clemency under section 401, CrPC, but without success.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "The petitioner moved the High Court of Andhra Pradesh by application under section 491 (1)(a) and (b) of the Code of Criminal Procedure, which was dismissed by a judgment, dated 18th January, 1973.",
      "type": "procedural",
      "date": "1973-01-18",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "The petition has been opposed by the respondents on the ground that the State Government has no power to remit the sentence of the petitioner, who was convicted of offences relating to a matter, which was within the sphere of the executive power of the Union and not of the State.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f9",
      "text": "The aforesaid four prisoners were released owing to a mistake on the part of the jail authorities and they are liable to be remanded to undergo the unexpired terms of their sentence, if the State Government cancels the remission granted to them by mistake.",
      "type": "admitted",
      "date": null,
      "source": "respondent"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Which is the appropriate Government - Central or the State Government - empowered to remit the sentence of a person convicted of offences under sections 489-A to 489-D of the Penal Code?",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The entire Indian Penal Code, including sections 489-A to 489-D, as at the commencement of the Constitution, would fall under the Head Criminal law, which finds a place in Entry No. 1 of the Concurrent List. The clause excluding offences against laws with respect to matters in List I or List II takes effect only so long as no law is made in respect of any of those matters, and since the Governor has made the G.O., which is a criminal law, the excluding clause does not operate.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": "Entry 1 Concurrent List; Re. N.V. Natarajan AIR 1965 Mad 11; H.M. Seervai Constitutional Law para 22.128; R.L. Aurora Ram Ditta Mal v. State of Punjab AIR 1958 All 126"
    },
    {
      "id": "pa2",
      "text": "Even if the State Government had extended the benefit of its G.O., owing to a mistake to four other persons, similarly placed, it was not fair to deny the same treatment to the petitioner.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The State Government has no power to remit the sentence of the petitioner, who was convicted of offences relating to a matter which was within the sphere of the executive power of the Union and not of the State.",
      "supporting_facts": [
        "f1"
      ],
      "legal_basis": "Sections 401, 402 CrPC; Articles 72, 161, 73, 162 Constitution; Entries 36, 93 Union List"
    },
    {
      "id": "ra2",
      "text": "The G.O. in question does not fall under the head Criminal law; even if assumed to, proviso to Article 162 read with Articles 72 and 73 prevents it from falling within State executive power. Government of India letter No. 40/58-Judl.(T), dated 31st December, 1958.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": "Entry 1 List III, Entries 36, 93 List I; Articles 72, 162 Constitution"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Section 402(3) CrPC defines 'appropriate Government': for offences against laws relating to Union executive power matters, Central Government; others, State Government. Articles 72, 161 limit to respective executive powers.",
      "addresses_issue": "i1",
      "key_observation": "Executive power follows legislative power per Articles 73, 162."
    },
    {
      "id": "cr2",
      "text": "Sections 489-A to 489-D added by Currency Notes Forgery Act, 1899, relate to Currency Notes and Bank Notes, Entry 36 Union List; offences against such laws under Entry 93 Union List. Thus, Union executive power.",
      "addresses_issue": "i1",
      "key_observation": "Offences under these sections exclusively within Union legislative competence."
    },
    {
      "id": "cr3",
      "text": "Entry 1 Concurrent List excludes offences against List I/II matters, which are covered by Entries 93 List I, 64 List II. Many IPC offences relate to Union List matters, e.g., ss 489A-D to Entry 36.",
      "addresses_issue": "i1",
      "key_observation": "Only Central Government competent for such offences."
    },
    {
      "id": "cr4",
      "text": "Distinguished Re. N.V. Natarajan (different context on statutory validity); G.O. under Art 161 not 'criminal law'; other citations not applicable.",
      "addresses_issue": "i1",
      "key_observation": "Petitioner's reliance on precedents misplaced."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The appropriate Government competent to remit the sentence of the petitioner convicted under sections 489-A to 489-D IPC is the Central Government and not the State Government.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Re. N.V. Natarajan",
      "citation": "AIR 1965 Madras 11",
      "treatment": "distinguished",
      "relevance": "Observations on excluding clause in Entry 1 List III not applicable as different context on statutory validity."
    },
    {
      "case_name": "R.L. Aurora Ram Ditta Mal v. State of Punjab others",
      "citation": "AIR 1958 Allahabad 126",
      "treatment": "distinguished",
      "relevance": "Facts entirely different, not discussed."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "489-A",
        "489-B",
        "489-C",
        "489-D"
      ],
      "relevance": "Offences relate to currency notes and bank notes, within Union List."
    },
    {
      "name": "Code of Criminal Procedure",
      "sections": [
        "401",
        "402",
        "491"
      ],
      "relevance": "Defines appropriate Government for remission; s.402(3) assigns to Central Govt for Union matters."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "32",
        "72",
        "73",
        "161",
        "162"
      ],
      "relevance": "Executive power distribution; Governor/President clemency limited to respective spheres; Seventh Schedule Entries 1 List III, 36 & 93 List I."
    },
    {
      "name": "Currency Notes Forgery Act",
      "sections": [],
      "relevance": "Added ss 489A-D IPC for protection of currency and bank notes."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The writ petition under Article 32 is dismissed as the State Government lacks power to remit the sentence; only Central Government is competent for offences under ss 489A-D IPC relating to Union executive matters.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "Are the provisions of sections 489-A to 489-D, Penal Code, under which the petitioner was convicted, a law relating to a matter to which the legislative power of the State or the Union extends?",
      "speaker": "court",
      "significance": "Frames core issue on legislative competence determining executive power."
    },
    {
      "text": "Currency, coinage and legal tender are matters, which are expressly included in Entry No. 36 of the Union List... Entry No. 93... specifically confers on the Parliament the power to legislate with regard to offences against laws with respect to any of the matters in the Union List.",
      "speaker": "court",
      "significance": "Establishes Union exclusive domain over offences."
    },
    {
      "text": "This excluding clause in Entry No. 1, List III read with Entries Nos. 36 and 93 of the Union List, shows beyond all manner of doubt that in respect of offences falling under sections 489-A to 489-D, only the Central Government is competent to suspend or remit the sentence of a convict.",
      "speaker": "court",
      "significance": "Key holding on appropriate Government."
    }
  ],
  "_case_id": "1973_263",
  "_label": 0,
  "_text_length": 13418,
  "_extracted_at": "2026-02-10T20:12:52.917019"
}