{
  "metadata": {
    "case_name": "University of Kashmir v. Respondent Professor",
    "case_year": 1972,
    "court": "Supreme Court of India",
    "judges": [
      "KRISHNA IYER, J."
    ],
    "case_number": "Civil Appeal No. 1386 of 1972",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Jammu and Kashmir University Act, 2005 Samvat Year created the University of Jammu and Kashmir.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Respondent joined the University as a lecturer on contract basis in 1963, governed by 1948 Act and statutes.",
      "type": "background",
      "date": "1963",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Jammu and Kashmir University Act, 1965 passed, repealing previous Act but preserving rules, regulations, and services of teachers (s.52). Created Jammu and Kashmir Divisions.",
      "type": "background",
      "date": "1965",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Respondent appointed as Reader in September 1965.",
      "type": "material",
      "date": "1965-09",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Respondent appointed Professor in Post-Graduate Department, Kashmir Division, on terms in letter dated January 8, 1968. On probation for one year, required to enter agreement binding to statutes and regulations.",
      "type": "material",
      "date": "1968-01-08",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Both parties agree appointment as Professor was on contract basis.",
      "type": "admitted",
      "date": null,
      "source": "petitioner | respondent | high_court"
    },
    {
      "id": "f7",
      "text": "Probation expired December 14, 1968; Vice-Chancellor extended it for one more year by order dated November 11, 1968. Extension confirmed by Central Council on June 26, 1969.",
      "type": "procedural",
      "date": "1968-11-11",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Central Council on June 26, 1969 resolved to charge-sheet respondent for alleged misconduct.",
      "type": "procedural",
      "date": "1969-06-26",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Enquiry officer Shri J.N. Bhan held enquiry and submitted report on September 5, 1969 holding respondent guilty substantially.",
      "type": "procedural",
      "date": "1969-09-05",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Jammu and Kashmir University Ordinance, 1969 promulgated September 5, 1969 by Governor, establishing separate Universities for Jammu and Kashmir. S.52 continued rules, regulations, services; contract teachers' services cease after 60 days unless Chancellor orders otherwise.",
      "type": "background",
      "date": "1969-09-05",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "No order by Chancellor extending respondent's employment.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Respondent allowed to function as Professor; probation extended again for a year by Vice-Chancellor under s.13(4) of Ordinance.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Ordinance replaced by Jammu and Kashmir Universities Act, 1969 on November 10, 1969.",
      "type": "background",
      "date": "1969-11-10",
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Vice-Chancellor directed release of respondent's salary and requested him to serve on Academic Council as ex-officio member as Professor and Head of History Department.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f15",
      "text": "Vice-Chancellor issued show-cause notice to respondent on December 22, 1969 based on enquiry report; respondent replied January 31, 1970.",
      "type": "procedural",
      "date": "1969-12-22",
      "source": "court"
    },
    {
      "id": "f16",
      "text": "University Council on July 7, 1970 decided to remove respondent paying one month's salary, based on enquiry report.",
      "type": "material",
      "date": "1970-07-07",
      "source": "court"
    },
    {
      "id": "f17",
      "text": "Respondent filed Writ Petition No. 36 of 1970 in Jammu and Kashmir High Court at Srinagar; High Court by judgment dated October 26, 1971 held termination void, directed reinstatement by mandamus.",
      "type": "procedural",
      "date": "1971-10-26",
      "source": "court"
    },
    {
      "id": "f18",
      "text": "Statutory cessation of respondent's contract services effective November 5, 1969 (60 days after September 5, 1969).",
      "type": "material",
      "date": "1969-11-05",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Respondent's right to continue in service even after the statutory cessation under s.52(4) of 1969 Ordinance/Act, including plea of implied fresh appointment.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Validity of reliance on the enquiry report (initiated under 1965 Act) in the termination order and compliance with statutory conditions for termination by University Council.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Statutory cessation of respondent's contractual service by operation of s.52(4) of 1969 Ordinance and Act; no implied employment thereafter as appointment powers vest only in University Council on recommendation of Selection Committee per s.22(f); de facto functioning does not create legal status.",
      "supporting_facts": [
        "f10",
        "f11",
        "f18",
        "f13"
      ],
      "legal_basis": "J&K Universities Act 1969 ss.52(4), 22(f), 36; Ordinance 1969 s.52(4); Statutes under 1965 Act"
    },
    {
      "id": "pa2",
      "text": "No provision in 1969 Act continues or validates the enquiry commenced under 1965 Act.",
      "supporting_facts": [
        "f9",
        "f13"
      ],
      "legal_basis": "J&K Universities Act 1969"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Facts and circumstances spell out a fresh appointment as Professor by implied contract after 1969 Ordinance/Act; termination must follow statutory regulations.",
      "supporting_facts": [
        "f12",
        "f14",
        "f15"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Enquiry under 1965 Act lapsed with 1969 Ordinance/Act; cannot form basis for punitive termination.",
      "supporting_facts": [
        "f9",
        "f10",
        "f13"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Contract services ceased statutorily on November 5, 1969 per s.52(4); no Chancellor order extending. De facto functioning, salary, probation extension by Vice-Chancellor do not create implied valid appointment as powers vest exclusively in University Council on Selection Committee recommendation per s.22(f); Vice-Chancellor power temporary and limited, not exercised.",
      "addresses_issue": "i1",
      "key_observation": "Doctrine of implied engagement de hors statutory scheme subversive; factum valet does not validate."
    },
    {
      "id": "cr2",
      "text": "No provision continues enquiry from 1965 Act into 1969 Act; report invalid, reliance thereon illegal for punitive termination. Termination order (Annexure A) carries stigma of guilt, void.",
      "addresses_issue": "i2",
      "key_observation": "Response to show-cause does not clothe enquiry with legality."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "No right to continue in service post statutory cessation; implied appointment invalid.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Termination order void as based on invalid enquiry report; carries stigma but no reinstatement as no subsisting service right.",
      "resolves_issue": "i2",
      "in_favor_of": "partial"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Jammu and Kashmir University Act, 1948 (2005 Samvat)",
      "sections": [],
      "relevance": "Created original University; governed initial service."
    },
    {
      "name": "Jammu and Kashmir University Act, 1965",
      "sections": [
        "52"
      ],
      "relevance": "Repealed prior Act, preserved services; governed enquiry; statutes required written contract for teachers."
    },
    {
      "name": "Jammu and Kashmir University Ordinance, 1969",
      "sections": [
        "52",
        "51",
        "13(4)",
        "22(f)",
        "36"
      ],
      "relevance": "Established separate Universities; s.52(4) terminated contract services after 60 days unless extended; continued prior statutes/regulations."
    },
    {
      "name": "Jammu and Kashmir Universities Act, 1969",
      "sections": [
        "52",
        "59",
        "22(f)",
        "36"
      ],
      "relevance": "Replaced Ordinance; appointment powers in University Council per s.22(f); no continuation of prior enquiry."
    }
  ],
  "outcome": {
    "disposition": "partially_accepted",
    "summary": "Supreme Court quashed High Court's reinstatement order, declared University's termination order (Annexure A) void due to invalid reliance on lapsed enquiry but held respondent had no right to continue in service post statutory cessation under s.52(4), directing him to leave the post.",
    "relief_granted": "Declaration that termination order void; no reinstatement.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "by the inexorable operation of the calendar, on November 5, 1969, the respondent made a statutory exit from the employment of the Kashmir University.",
      "speaker": "court",
      "significance": "Pins the exact date of service cessation."
    },
    {
      "text": "the doctrine of implied engagement de hors the provisions and powers under the Act would be subversive of the statutory scheme regarding appointments of officers and cannot be countenanced by the Court.",
      "speaker": "court",
      "significance": "Rejects implied contract theory."
    },
    {
      "text": "We, therefore declare that Annexure A is void but further hold that the respondent has no right to continue in service and the direction to him that he should leave his post as Professor... is good.",
      "speaker": "court",
      "significance": "Nuanced holding: order void but no reinstatement."
    }
  ],
  "_case_id": "1973_290",
  "_label": 1,
  "_text_length": 21039,
  "_extracted_at": "2026-02-10T20:12:48.383221"
}