{
  "metadata": {
    "case_name": "Appellants v. State",
    "case_year": 1970,
    "court": "Supreme Court of India",
    "judges": [
      "CHANDRACHUD J."
    ],
    "case_number": "Criminal Appeal No. 110 of 1970",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellants, eleven in all, were acquitted by the Additional Sessions Judge, Gonda.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f2",
      "text": "Allahabad High Court, Lucknow Bench, in Criminal Appeal No. 634 of 1967, set aside the acquittal by judgment dated 8th January 1970 and convicted appellants under sections 302, 325 and 323 read with section 149 and under section 147 of the Penal Code, sentencing to life imprisonment for murder and shorter terms for other offences.",
      "type": "procedural",
      "date": "1970-01-08",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On evening of September 17, 1966 (Kajri Tij day), Rampher and deceased Hausla Prasad went to a temple about 8 miles from village Jhampur.",
      "type": "background",
      "date": "1966-09-17",
      "source": "prosecution"
    },
    {
      "id": "f4",
      "text": "They left temple late afternoon with Dwarika and Lakhu whom they met there.",
      "type": "background",
      "date": "1966-09-17",
      "source": "prosecution"
    },
    {
      "id": "f5",
      "text": "Soon after crossing river near village Singha Chanda, attacked by appellants who formed unlawful assembly with common object to cause death of Hausla Prasad and injuries to Rampher, Dwarika and Lakhu.",
      "type": "material",
      "date": "1966-09-17",
      "source": "prosecution"
    },
    {
      "id": "f6",
      "text": "Dwarika brought bullock cart from village Gauhani (3-4 miles away).",
      "type": "material",
      "date": "1966-09-17",
      "source": "prosecution"
    },
    {
      "id": "f7",
      "text": "Rampher dictated First Information Report to boy Gorakhnath; lodged at Tarabganj police station at about 12:30 at night (police station 4 miles from scene).",
      "type": "procedural",
      "date": "1966-09-17",
      "source": "prosecution"
    },
    {
      "id": "f8",
      "text": "Hausla Prasad succumbed to injuries just before reaching police station; had 12 injuries, mostly contused lacerated wounds and abrasions.",
      "type": "material",
      "date": "1966-09-17",
      "source": "prosecution"
    },
    {
      "id": "f9",
      "text": "Rampher received 6 injuries, Dwarika 9 injuries, Lakhu 6 injuries and a swelling.",
      "type": "material",
      "date": "1966-09-17",
      "source": "prosecution"
    },
    {
      "id": "f10",
      "text": "Prosecution eye-witnesses: Rampher (PW2), Dwarika, Lakhu, Ram Shanker (PW?), Ram Kripal (PW?).",
      "type": "material",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f11",
      "text": "Sessions Judge held eye-witnesses not worthy of credit and acquitted appellants.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "High Court not impressed by Ram Shanker and Ram Kripal but accepted Rampher, Dwarika, Lakhu and convicted.",
      "type": "procedural",
      "date": "1970-01-08",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Appellants' case: occurrence after dark, explaining delay in FIR.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f14",
      "text": "Village Singha Chanda one furlong from scene; Gauhani 3-4 miles away.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f15",
      "text": "Took longer route to police station to avoid crossing river twice; river ankle-deep, 12 paces wide.",
      "type": "disputed",
      "date": "1966-09-17",
      "source": "prosecution"
    },
    {
      "id": "f16",
      "text": "Rampher stated in committing court waited 2 hours after nightfall at spot.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f17",
      "text": "Ram Kripal (brother of Rampher) not mentioned in FIR despite details of others; Sessions and HC rejected as unreliable/afterthought.",
      "type": "disputed",
      "date": null,
      "source": "court"
    },
    {
      "id": "f18",
      "text": "Ram Shanker admitted in committing court left house at 2:30 pm for temple, impossible to be at scene at 4 pm; improved to 6 am in Sessions Court; stated waited till 8 pm then denied.",
      "type": "disputed",
      "date": null,
      "source": "court"
    },
    {
      "id": "f19",
      "text": "Rampher in Sessions Court: assailants dacoits/looteras, searched pockets.",
      "type": "disputed",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f20",
      "text": "Motive: Hausla Prasad's illicit intimacy with Sheshkali (daughter of principal accused Gaya Prasad, who died during proceedings); Gaya Prasad said 'Is ko Aashnai ka Maza Chakha do' before hitting.",
      "type": "disputed",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f21",
      "text": "FIR makes no mention of accused referring to 'Aashnai' (illicit intimacy).",
      "type": "disputed",
      "date": "1966-09-17",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Scope of Supreme Court's power under Article 136 to interfere in appeals by special leave against High Court judgments setting aside acquittals, particularly re-appreciation of evidence.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Principles governing High Court's powers in appeals against acquittal under CrPC section 423.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether High Court correctly applied principles in reversing acquittal, including assessment of delay in FIR, time of incident, credibility of eye-witnesses.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "High Court erred in accepting evidence of three eye-witnesses (Rampher, Dwarika, Lakhu); undue delay in FIR (8+ hours for 4 miles), explained by prosecution fantastically; incident after dark.",
      "supporting_facts": [
        "f7",
        "f13",
        "f14",
        "f15",
        "f16"
      ],
      "legal_basis": "Article 136 of Constitution; principles from precedents on appeals against acquittal"
    },
    {
      "id": "pa2",
      "text": "Inconsistencies in witnesses: Ram Kripal not in FIR, rejected; Ram Shanker conflicting statements on timing; Rampher called assailants dacoits who searched pockets, inconsistent with motive of illicit intimacy.",
      "supporting_facts": [
        "f17",
        "f18",
        "f19",
        "f20",
        "f21"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Sole question is whether High Court right in accepting evidence of three eye-witnesses; Supreme Court ought not re-appreciate evidence under Article 136.",
      "supporting_facts": [
        "f12"
      ],
      "legal_basis": "Article 136 of Constitution"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Supreme Court can examine evidence if High Court failed to correctly apply principles governing appeals against acquittal; no limitation on High Court's power to review evidence but must give weight to trial court's views, presumption of innocence, benefit of doubt, advantage of seeing witnesses.",
      "addresses_issue": "i1",
      "key_observation": "Principles from Sheo Swarup: High Court has full power to review but with due regard to listed factors; no 'substantial and compelling reasons' magic formula to curtail power."
    },
    {
      "id": "cr2",
      "text": "High Court aware of principles but failed to apply: characterized trial court finding as perverse wrongly; delay in FIR undue and unexplained, supports appellants' case of post-dark incident.",
      "addresses_issue": "i3",
      "key_observation": "Prosecution explanations fanciful (Dwarika went far for cart, longer route to avoid jolts/tiny river); Sessions Judge view reasonable."
    },
    {
      "id": "cr3",
      "text": "Ram Kripal afterthought, Ram Shanker contradictory timings/oath statements; Rampher introduced dacoity/searching pockets inconsistent with motive, no 'Aashnai' mention in FIR.",
      "addresses_issue": "i3",
      "key_observation": "High Court wrongly minimized inconsistencies; danger in accepting partisan witnesses."
    },
    {
      "id": "cr4",
      "text": "Not broad daylight; witnesses had motive to falsely implicate.",
      "addresses_issue": "i3",
      "key_observation": "High Court not justified in interfering with acquittal."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Supreme Court under Article 136 examines if High Court applied correct principles in appeals against acquittal; if yes, no re-appraisal unless exceptional injustice.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "High Court failed to apply principles correctly; view of Sessions Judge reasonable; acquittal order restored.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Sheo Swarup and Ors. v. The King-Emperor",
      "citation": "61 I.A. 398",
      "treatment": "followed",
      "relevance": "High Court has full power to review evidence in appeals against acquittal under CrPC s.423, no distinction from conviction appeals, but with due regard to trial court views etc."
    },
    {
      "case_name": "Nur Mahomed v. Emperor",
      "citation": "A.I.R. 1945 P.C. 151",
      "treatment": "followed",
      "relevance": "Reiterated full review power with weight to presumption of innocence etc."
    },
    {
      "case_name": "Surajpal Singh v. The State",
      "citation": "1952 S.C.R. 193; A.I.R. 1952 S.C. 52",
      "treatment": "followed",
      "relevance": "Presumption of innocence reinforced by acquittal; reverse only for substantial/compelling reasons."
    },
    {
      "case_name": "Sanwat Singh v. State of Rajasthan",
      "citation": "1961 3 S.C.R. 120",
      "treatment": "followed",
      "relevance": "Clarified no magic in 'compelling reasons'; appellate court must review evidence, give reasons why acquittal wrong."
    },
    {
      "case_name": "Harbans Singh v. State of Punjab",
      "citation": "1962 1 Supp. S.C.R. 104",
      "treatment": "followed",
      "relevance": "Examine evidence carefully; interfere only if acquitting judge's view clearly unreasonable."
    },
    {
      "case_name": "Ramabhupala Reddy v. State of Andhra Pradesh",
      "citation": "A.I.R. 1971 S.C. 460",
      "treatment": "followed",
      "relevance": "Do not disturb if two reasonable views possible."
    },
    {
      "case_name": "Shivaji Sahebrao Bobade v. State of Maharashtra",
      "citation": "A.I.R. 1973 S.C. 2622",
      "treatment": "followed",
      "relevance": "Substantial/compelling grounds needed; duty to scrutinize but homage to liberty restrains."
    },
    {
      "case_name": "Ajmer Singh v. State of Punjab",
      "citation": "1953 S.C.R. 418; A.I.R. 1953 S.C. 76",
      "treatment": "referred",
      "relevance": "Used 'substantial and compelling reasons' phrase."
    },
    {
      "case_name": "Aher Raja Khima v. State of Saurashtra",
      "citation": "1955 2 S.C.R. 1285; A.I.R. 1955 S.C. 583",
      "treatment": "referred",
      "relevance": "Substantial/compelling as synonymous with strong reasons."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "302",
        "325",
        "323",
        "149",
        "147"
      ],
      "relevance": "Appellants convicted under these by High Court for murder, grievous hurt, hurt r/w common object, and rioting."
    },
    {
      "name": "Code of Criminal Procedure",
      "sections": [
        "404",
        "410",
        "417",
        "418",
        "422",
        "423"
      ],
      "relevance": "Powers of High Court in appeals against acquittal; no distinction from conviction appeals."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "136"
      ],
      "relevance": "Supreme Court's appellate jurisdiction by special leave; limited to cases where High Court misapplies principles."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Supreme Court allowed the appeal by special leave, set aside High Court's conviction and restored the acquittal order passed by Additional Sessions Judge, Gonda, holding that High Court failed to apply correct principles and Sessions Judge's view was reasonable.",
    "relief_granted": "Acquittal restored",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"There is, in their opinion, no foundation for the view... that the High Court has no power or jurisdiction to reverse an order of acquittal on a matter of fact, except in cases in which the lower Court has obstinately blundered...\"",
      "speaker": "court",
      "significance": "Quoting Privy Council in Sheo Swarup on High Court's full power in acquittal appeals."
    },
    {
      "text": "\"The words were intended to convey the idea that an appellate court not only shall bear in mind the principles laid down by the Privy Council but also must give its clear reasons...\"",
      "speaker": "court",
      "significance": "From Sanwat Singh clarifying no curtailment of review power."
    },
    {
      "text": "\"If two views of the evidence are reasonably possible, the finding of acquittal ought not to be disturbed.\"",
      "speaker": "court",
      "significance": "Core principle applied to justify restoring acquittal."
    }
  ],
  "_case_id": "1973_339",
  "_label": 1,
  "_text_length": 27331,
  "_extracted_at": "2026-02-10T20:13:36.029198"
}