{
  "metadata": {
    "case_name": "Registrar, High Court of Madhya Pradesh & State v. B.A. Nigam",
    "case_year": 1972,
    "court": "Supreme Court of India",
    "judges": [
      "Alagiriswami, J."
    ],
    "case_number": "Civil Appeal No. 624 of 1972",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "In the Judicial Service of Madhya Pradesh there are three classes of officers, Civil Judges, Additional District and Sessions Judges and District Judges but under the Madhya Pradesh Civil Courts Act, 1958 there are four classes of Civil Courts, the Court of the District Judge, the Court of the Addl. District Judge, the Court of the Civil Judge Class 1 and the Court of the Civil Judge Class II.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The respondent No. 1, Shri B. A. Nigam, entered service as a Civil Judge on 20-10-1956 in Madhya Bharat. After Madhya Bharat became part of Madhya Pradesh he was absorbed as a Civil Judge and placed for purposes of seniority at No. 189.",
      "type": "background",
      "date": "1956-10-20",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "From the time when the Madhya Pradesh Civil Court Act, 1958 came into force some period of service of a Civil Judge during which he exercised powers of Civil Judge, Class 1, however, small, was considered a necessary qualification for promotion to the post of Additional District and Sessions Judge.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On or about May 3, 1968, by a resolution of the High Court it was laid down that selection of a Civil Judge, Class II, as a Civil Judge, Class I, shall be deemed as promotion and that being so, only the cases of Civil Judges, Class 1, shall be considered for promotion as Additional District and Sessions Judges in order of their seniority.",
      "type": "procedural",
      "date": "1968-05-03",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "According to the Service Rules there is only one class of Civil Judges and no two classes of Civil Judges Class 1 and Civil Judges Class II.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The fitness of the respondent 1 for promotion as Civil Judge, Class I, seems to have been considered on a number of occasions i.e. on May 3, 1966, August 12, 1966, April 17, 1967, November 6, 1967 and April 18, 1968 and on each of these occasions he was found unfit to exercise powers of a Civil Judge, Class 1.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Mr. N. Shroff appearing for the appellants has also shown us the file containing the proceedings of the Judges meetings of the High Court of Madhya Pradesh on the various dates above referred to in which the names of various officers for being Posted as Class I Civil Judges have been considered. We have scrutinised them carefully and can see no reason to doubt the bona fide nature of the decisions therein made.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Though the junior members in the cadre of Civil Judges had often been allowed to exercise the powers of Civil Judge, Class 1, without considering at that time the respondents claim and then those junior members had been preferred for promotion on the ground that they had exercised such powers, and such preference was open to attack as being violative of the fundamental rights of the respondent, they could not assist him on that ground because even if his claims for exercising the powers of Civil Judge, Class I had been considered at the appropriate time, he would not have been found fit for the purpose.",
      "type": "disputed",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Finally, on 30-11-1968 the respondent was found fit to be posted as a Civil Judge, Class I and he filed the petition, out of which this appeal arises, for consideration of his name for being promoted as an Additional District and Sessions Judge over the heads of all the people who had been earlier found to have better qualifications for being posted as Civil Judges, Class I in preference to him.",
      "type": "procedural",
      "date": "1968-11-30",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "That petition having been allowed by the High Court his appeal has been filed by certificate by the Registrar of the High Court of Madhya Pradesh and the State against the judgment of that High Court dated August 8, 1971 in Misc. Petition No. 537 of 1969.",
      "type": "procedural",
      "date": "1971-08-08",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Out of the 41 people whom the respondent No. 1 had made respondents to his petition, 10 people were found fit in 1962 and one in 1963. Then we have 3 others whose claims were considered on 3-5-66 alongwith that of the respondent No. 1 and found superior to his. There are 8 others whose claims were compared to the respondents on 12-8-66 and found to be superior to his. Seventeen others, whose claims were compared to the respondents on 17-4-67 were found to be superior to the respondents and two were found superior to the respondent on 7-11-67.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "The jurisdiction of the Class II civil Judges is only upto Rs. 5,000 and that of Class I Civil Judges upto Rs. 10,000.",
      "type": "background",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the respondent No.1 is entitled to be considered for promotion as Additional District and Sessions Judge on the basis of his original seniority in the cadre of Civil Judges despite repeatedly being found unfit for posting as Civil Judge Class I until 30-11-1968, over the heads of his juniors who were found fit earlier.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the High Court resolution of May 3, 1968 requiring experience as Civil Judge Class I as a qualification for promotion to Additional District and Sessions Judge is valid and has rational relation to suitability, given that service rules provide for only one class of Civil Judges.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The respondent was found unfit multiple times for Class I posting (May 3,1966; Aug12,1966; Apr17,1967; Nov6,1967; Apr18,1968) compared to juniors who were found superior; even if considered earlier, he would not have been selected.",
      "supporting_facts": [
        "f6",
        "f7",
        "f8",
        "f11"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "The High Court resolution of May 3, 1968 requiring Class I experience has rational relation to suitability for promotion to Additional District and Sessions Judge; respondent lacked qualification until 30-11-1968, so his claim deemed rejected by implication.",
      "supporting_facts": [
        "f4",
        "f9"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "To allow respondent to overtake juniors found superior earlier would be a mockery of fair play and justice.",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "In the list of Civil Judges he was senior to all of them and as there was no provision in the service rules for classifying Civil Judges as Class I or Class II and the power to create various classes of services was one which vested with the Government and not with the High Court therefore the resolution of the High Court of May 3, 1968 cannot affect him adversely.",
      "supporting_facts": [
        "f2",
        "f5",
        "f4"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Juniors were preferred despite his seniority, violating fundamental rights.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Agrees that till November 30, 1968 the respondent No. 1 was not qualified to be considered for promotion as an Additional District and Sessions Judge; his claim regarded as considered and rejected by implication.",
      "addresses_issue": "i1",
      "key_observation": "High Court rightly held respondent lacked qualification."
    },
    {
      "id": "cr2",
      "text": "Once it is found that experience as Civil Judge, Class 1, at least for a short period, is a necessary qualification for promotion as Additional District and Sessions Judge and that such a requirement has a rational relation to the question at issue, respondent cannot claim promotion based on entry date over juniors found superior earlier.",
      "addresses_issue": "i2",
      "key_observation": "Qualification rationally related to suitability."
    },
    {
      "id": "cr3",
      "text": "The resolution of the High Court of May 1968 should not be interpreted literally; it was to have a list of persons qualified to be posted as Class I Civil Judges and fitness for such as qualification for promotion; not creating new class.",
      "addresses_issue": "i2",
      "key_observation": "Resolution valid as selection criterion."
    },
    {
      "id": "cr4",
      "text": "No justification for reopening cases closed more than 10 years ago at instance of officer whose record is not shining.",
      "addresses_issue": "i1",
      "key_observation": "Respondent's being found fit on 30-11-68 as matter of grace."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Experience as Civil Judge Class I is necessary qualification for promotion to Additional District and Sessions Judge with rational relation to suitability; respondent not entitled to consideration over juniors found superior earlier merely on basis of original seniority.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "High Court resolution requiring Class I experience valid.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Madhya Pradesh Civil Courts Act, 1958",
      "sections": [],
      "relevance": "Defines four classes of Civil Courts; from its enforcement, Class I experience required for promotion."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "The appeal is allowed and the judgment of the Madhya Pradesh High Court is set aside. There will, however, be no order as to costs.",
    "relief_granted": "None; High Court order quashed.",
    "costs": "No order as to costs"
  },
  "key_quotes": [
    {
      "text": "to allow the respondent No. 1 to be considered for promotion as Additional District and Sessions Judge in preference to others who had been found better qualified to be posted as Civil Judges Class I much earlier merely on the basis of the date of his entry into service would be a mockery of all canons of fair play and justice.",
      "speaker": "court",
      "significance": "Core reasoning against retrospective seniority claim."
    },
    {
      "text": "his being found fit for promotion to Class I Civil Judge on 30-11-68 seems to have been done more as a matter of grace and he should be more than happy to have got what he got.",
      "speaker": "court",
      "significance": "Dismisses respondent's further claims."
    }
  ],
  "_case_id": "1973_138",
  "_label": 1,
  "_text_length": 10419,
  "_extracted_at": "2026-02-10T20:12:10.701875"
}