{
  "metadata": {
    "case_name": "Assessee Firm v. Commissioner of Income-tax",
    "case_year": 1970,
    "court": "Supreme Court of India",
    "judges": [
      "HEGDE J."
    ],
    "case_number": "Civil Appeals Nos. 471 to 476 of 1970",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The assessee firm was constituted under a deed of partnership dated 5-2-1955 but the deed shows that the firm came into existence on January 1, 1955.",
      "type": "background",
      "date": "1955-02-05",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The firm consisted of five partners: 1. B. Satyanarayanamurti, 2. B. Bapaiah Pantulu, 3. B. Seetaramaiah, 4. B. Subrahmanyam and 5. B. Rammonanrao (minor, represented by his father B. Satyanarayanamurty).",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "One of the terms of the partnership deed is that the profit and loss of a business should be divided and borne between the partners in equal shares.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Applications under s. 26A of the Indian Income-tax Act, 1922 relating to assessment years 1956-57 to 1961-62 (relevant accounting years: calendar years 1955 to 1960) were made by the appellant to the Income-tax Officer.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The application under s. 26A for the assessment year 1956-57 was made on 30-6-1955, the last date for making the application. Along with that application, a copy of the partnership deed was also sent to the Income-tax Officer.",
      "type": "procedural",
      "date": "1955-06-30",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Income-tax Officer accepted the application for 1956-57 and granted registration by order dated 30-6-1960. At the same time he granted renewals for other assessment years.",
      "type": "procedural",
      "date": "1960-06-30",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Commissioner of Income-tax under s. 33B called for and examined the papers, heard the assessee, and set aside the orders of the Income-tax Officer.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Assessee appealed to Income-tax Appellate Tribunal, which rejected the appeal.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Question of law referred to Andhra Pradesh High Court under s. 66(1) at instance of assessee. High Court answered in negative, in favour of Revenue, by judgment dated July 29, 1969 in Referred Case No. 34 of 1965.",
      "type": "procedural",
      "date": "1969-07-29",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "On October 18, 1955, an application was made by the partners to the Registrar of Firms to register the firm.",
      "type": "procedural",
      "date": "1955-10-18",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Registrar by letter dated December 13, 1955 objected to registration on ground that partnership invalid under s. 30 of Partnership Act as one partner was minor.",
      "type": "procedural",
      "date": "1955-12-13",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Four adult partners by letter dated December 18, 1955 informed Registrar that minor admitted to benefits only, with consent of all partners, has nothing to do with losses, and agreed to amend application.",
      "type": "procedural",
      "date": "1955-12-18",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Registrar registered the assessee firm on January 10, 1956.",
      "type": "procedural",
      "date": "1956-01-10",
      "source": "court"
    },
    {
      "id": "f14",
      "text": "It is not known whether a copy of the letter dated 18-12-1955 was sent to Income-tax Officer and if so when.",
      "type": "disputed",
      "date": null,
      "source": "court"
    },
    {
      "id": "f15",
      "text": "Commissioner concluded partnership ab initio void, rejected contention that letter to Registrar validated deed, and opined several terms adversely affected minor.",
      "type": "disputed",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f16",
      "text": "Tribunal upheld Commissioner, and additionally held applications for registration and renewal did not conform to law requirements and were invalid.",
      "type": "disputed",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f17",
      "text": "High Court affirmed Tribunal that partnership not valid in law; did not address if applications otherwise invalid.",
      "type": "disputed",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f18",
      "text": "In applications for registration and renewal, in Column 6 of the form, minor's share shown as 1/5th (meaning share in profits and losses), letter 'P' not mentioned.",
      "type": "material",
      "date": null,
      "source": "tribunal"
    },
    {
      "id": "f19",
      "text": "Assessee firm not registered under Indian Partnership Act before s.26A application; partnership deed not registered under Indian Registration Act.",
      "type": "background",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether on the facts and in the circumstances of the case, the assessee firm is entitled to registration under s. 26A of the Act.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Technicalities should not come in the way of doing substantial justice; substantial compliance with rules sufficient.",
      "supporting_facts": [],
      "legal_basis": "s. 185(2) of Income-tax Act, 1961"
    },
    {
      "id": "pa2",
      "text": "High Court decided on ground partnership ab initio void, not on application invalidity; should not take up those grounds afresh.",
      "supporting_facts": [
        "f17"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Letter to Registrar dated 18-12-1955 validated the partnership deed.",
      "supporting_facts": [
        "f12"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Partnership ab initio void under s.30 Partnership Act as minor partner.",
      "supporting_facts": [
        "f2",
        "f3"
      ],
      "legal_basis": "s.30 Partnership Act"
    },
    {
      "id": "ra2",
      "text": "Letter to Registrar did not validate partnership deed.",
      "supporting_facts": [
        "f12"
      ],
      "legal_basis": null
    },
    {
      "id": "ra3",
      "text": "Several terms in partnership deed adversely affected minor.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": null
    },
    {
      "id": "ra4",
      "text": "Applications for registration and renewal did not conform to requirements of law and consequently invalid.",
      "supporting_facts": [
        "f5",
        "f6",
        "f18"
      ],
      "legal_basis": "Rule 2, Rule 3, Rule 6 under Income-tax Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Applications for registration and renewal did not conform to requirements of law: firm not registered under Partnership Act or deed under Registration Act; deed submitted showed partnership void u/s 30 Partnership Act with minor as full partner; subsequent alteration after time limit expired, no condonation of delay.",
      "addresses_issue": "i1",
      "key_observation": "The assessee firm was not registered under the Indian Partnership Act before the application under s.26A was made nor was the partnership deed registered under the Indian Registration Act."
    },
    {
      "id": "cr2",
      "text": "In Column 6 of forms under Rule 3 and Rule 6, minor's share shown as 1/5th without 'P' indicating only profits, meaning share in profits and losses.",
      "addresses_issue": "i1",
      "key_observation": "Both in the application made for registration as well as in the applications made for renewal, letter P was not mentioned."
    },
    {
      "id": "cr3",
      "text": "No record shows Income-tax Officer informed of letter to Registrar dated 18-12-1955 or condoned delay under proviso to Rule 2.",
      "addresses_issue": "i1",
      "key_observation": "The record before us does not show whether the Income-tax Officer was informed of the letter written to the Registrar of Firms on 18-12-1955, and if so on what date."
    },
    {
      "id": "cr4",
      "text": "Right to registration under s.26A creature of statute, must strictly comply with terms; substantial compliance insufficient.",
      "addresses_issue": "i1",
      "key_observation": "A person who seeks relief under section 26A must bring himself strictly within its terms before he can claim the benefit of it."
    },
    {
      "id": "cr5",
      "text": "s.185(2) of 1961 Act not retrospective and requirements not complied with.",
      "addresses_issue": "i1",
      "key_observation": "Section 185(2) of the 1961 Act is not retrospective in operation nor were the requirements of that provision complied with."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Applications made by partners did not comply with requirements of rules; cannot be considered valid applications; registration and renewals unauthorised.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Rao Bahadur Ravulu Subba Rao and ors. v. Commissioner of Income-tax, Madras",
      "citation": "42 I.T.R. 224",
      "treatment": "followed",
      "relevance": "Right under s.26A must strictly comply with statute terms; statute exhaustive on conditions."
    },
    {
      "case_name": "N.T. Patel Co. v. Commissioner of Income-tax, Madras",
      "citation": null,
      "treatment": "followed",
      "relevance": "Same view as Ravulu Subba Rao on strict compliance."
    },
    {
      "case_name": "Khanjan Lal Sewak Ram v. Commissioner of Income-Tax, U.P.",
      "citation": "83 I.T.R. 175",
      "treatment": "followed",
      "relevance": "Lends support to conclusion on strict compliance."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act, 1922",
      "sections": [
        "s. 26A",
        "s. 33B",
        "s. 66(1)",
        "s. 59(5)"
      ],
      "relevance": "Governs application for firm registration; Commissioner powers to revise; reference to High Court; rules have effect as enacted."
    },
    {
      "name": "Income-tax Rules, 1922",
      "sections": [
        "Rule 2",
        "Rule 3",
        "Rule 4",
        "Rule 6"
      ],
      "relevance": "Prescribe form, time, particulars for registration and renewal applications; requirement to indicate if partner shares only in profits with 'P'."
    },
    {
      "name": "Indian Partnership Act, 1932",
      "sections": [
        "s. 30"
      ],
      "relevance": "Minor cannot be full partner; partnership invalid if minor party to deed."
    },
    {
      "name": "Indian Registration Act, 1908",
      "sections": [],
      "relevance": "Deed registration affects time for s.26A application."
    },
    {
      "name": "Income-tax Act, 1961",
      "sections": [
        "s. 185(2)"
      ],
      "relevance": "Argued for substantial compliance but held not retrospective."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeals by special leave against the Andhra Pradesh High Court judgment upholding refusal of registration under s.26A fail as applications did not comply with statutory rules; appeals dismissed.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "A person who seeks relief under section 26A must bring himself strictly within its terms before he can claim the benefit of it.",
      "speaker": "court",
      "significance": "Core principle denying registration for non-compliance."
    },
    {
      "text": "The statute must be construed as exhaustive in regard to the conditions under which it can be claimed.",
      "speaker": "court",
      "significance": "Emphasizes strict statutory interpretation for s.26A benefits."
    }
  ],
  "_case_id": "1973_95",
  "_label": 0,
  "_text_length": 14241,
  "_extracted_at": "2026-02-10T20:11:44.256102"
}