{
  "metadata": {
    "case_name": "Appellants v. Municipal Corporation of Delhi",
    "case_year": 1973,
    "court": "Supreme Court of India",
    "judges": [
      "Mathew, J."
    ],
    "case_number": "Criminal Appeal No. 49 of 1973",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Municipal Corporation of Delhi filed a complaint on September 10, 1970, before the Judicial First Class Magistrate, Delhi against the appellants under s. 7 read with s. 16 of the Prevention of Food Adulteration Act, 1954, alleging that they gave a false warranty in respect of the curry powder manufactured by them.",
      "type": "procedural",
      "date": "1970-09-10",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Appellants appeared in response to summons and filed an application for quashing the proceedings on the ground that the complaint was incompetent. The Magistrate dismissed the application.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Appellants filed a revision to the Additional Sessions Judge, which was dismissed.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f4",
      "text": "Appellants filed a revision before the Delhi High Court, which dismissed it on August 22, 1972.",
      "type": "procedural",
      "date": "1972-08-22",
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "On November 28, 1968, the Food Inspector went to the shop of Ram Prakash Oberoi and purchased three sealed tins of curry powder, sent one sample to Public Analyst who reported it adulterated.",
      "type": "material",
      "date": "1968-11-28",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Complaint filed against Ram Prakash Oberoi under s. 16 read with s. 7 of the Act by Food Inspector.",
      "type": "procedural",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f7",
      "text": "Ram Prakash Oberoi stated under s. 342 that he purchased curry powder in sealed tins from appellants under a warranty and sold it in the same condition.",
      "type": "admitted",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "First appellant examined, gave evidence that curry powder manufactured by second appellant company, sold in tins to concern of Ram Prakash Oberoi, admitted issue of warranty.",
      "type": "admitted",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "Ram Prakash Oberoi acquitted on October 25, 1969, as he discharged onus under s. 19(2) of the Act.",
      "type": "procedural",
      "date": "1969-10-25",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Magistrate observed in concluding portion that it is open to Municipal Corporation to institute complaint against warrantor for issuing false warranty.",
      "type": "background",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Sample bearing No. DS. 2385 taken by P.W. 2 from Ram Prakash Oberoi from bill Ex. DWI A.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the complaint against appellants for giving false warranty is barred because Food Inspector did not join them in complaint against Ram Prakash Oberoi or Magistrate did not implead them under s. 20A.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether s. 20A of the Act is mandatory or enabling, and failure to implead under it bars separate prosecution.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether joint trial under s. 20A is more advantageous and separate trial discriminatory.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Food Inspector had opportunity to know of warranty and under s. 14A vendor bound to disclose, so duty to join appellants in complaint against Oberoi.",
      "supporting_facts": [
        "f5",
        "f6",
        "f7"
      ],
      "legal_basis": "Sections 14A, 20A of Prevention of Food Adulteration Act"
    },
    {
      "id": "pa2",
      "text": "Magistrate ought to have impleaded appellants under s. 20A and tried them along with Oberoi; failure bars present complaint.",
      "supporting_facts": [
        "f9",
        "f10"
      ],
      "legal_basis": "Section 20A of Prevention of Food Adulteration Act"
    },
    {
      "id": "pa3",
      "text": "Joint trial under s. 20A more advantageous (e.g., s. 13(2) for CFL analysis) than separate trial, leading to discrimination.",
      "supporting_facts": [],
      "legal_basis": "Sections 13(2), 20A of Prevention of Food Adulteration Act; Northern India Caterers case"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "No obligation on Food Inspector to join warrantors in vendor's case; s. 20A enabling, not mandatory; no bar to separate prosecution.",
      "supporting_facts": [
        "f1",
        "f2",
        "f3",
        "f4"
      ],
      "legal_basis": "Sections 19(3), 20A of Prevention of Food Adulteration Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "No provision obliges Food Inspector to join warrantor in vendor's complaint; s. 19(3) allows warrantor to appear and give evidence without becoming accused.",
      "addresses_issue": "i1",
      "key_observation": "s. 19(3) proceeds on assumption no obligation to join manufacturer/distributor/dealer."
    },
    {
      "id": "cr2",
      "text": "s. 20A is enabling, discretionary; not mandatory; failure to implead does not confer immunity or bar separate prosecution.",
      "addresses_issue": "i2",
      "key_observation": "Separate trial normal rule; joint trial exception; no prejudice in separate trial."
    },
    {
      "id": "cr3",
      "text": "Purpose of s. 20A to avoid conflicting findings; but no bar if not used; no unguided discretion causing discrimination.",
      "addresses_issue": "i3",
      "key_observation": "Joint vs separate trial advantages not predictable; principle from Northern India Caterers not applicable."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "No substance in contentions; complaint competent; no bar due to failure to implead under s. 20A.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "s. 20A enabling provision, not mandatory; separate prosecution not barred.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "No discrimination between joint and separate trials under the Act.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "State of Andhra Pradesh v. Cheemallapati Ganeswara Rao and Another",
      "citation": "1964 3 S.C.R. 297, 324",
      "treatment": "followed",
      "relevance": "Separate trial normal rule, joint trial exception under CrPC."
    },
    {
      "case_name": "Northern India Caterers Private Ltd. and Another v. State of Punjab and Another",
      "citation": "1967 3 S.C.R. 395",
      "treatment": "distinguished",
      "relevance": "No unguided discretion to choose between procedures causing discrimination; not applicable here."
    }
  ],
  "statutes_cited": [
    {
      "name": "Prevention of Food Adulteration Act, 1954",
      "sections": [
        "7",
        "16",
        "14",
        "14A",
        "19(2)",
        "19(3)",
        "20",
        "20A",
        "13(2)"
      ],
      "relevance": "Governing offences of false warranty, vendor defence, impleadment of warrantors, institution of prosecution."
    },
    {
      "name": "Code of Criminal Procedure, 1898",
      "sections": [
        "351(1)",
        "233-239",
        "5(2)"
      ],
      "relevance": "Normal rule of separate trials; joint trial exception; applies subject to special enactments."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court dismissed the appeal by special leave against the Delhi High Court's order upholding the complaint against appellants for false warranty, holding no bar to prosecution despite not being impleaded in vendor's trial under s. 20A.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "We do not think that there is any substance in these contentions.",
      "speaker": "court",
      "significance": "Rejects appellants' main arguments outright."
    },
    {
      "id": "kq2",
      "text": "Section 20A is an enabling one. There is nothing mandatory about it.",
      "speaker": "court",
      "significance": "Key holding on discretionary nature of impleadment."
    },
    {
      "id": "kq3",
      "text": "The real purpose of enacting S. 20A is to avoid, as far as possible, conflicting findings.",
      "speaker": "court",
      "significance": "Explains legislative intent behind s. 20A."
    }
  ],
  "_case_id": "1973_401",
  "_label": 0,
  "_text_length": 20591,
  "_extracted_at": "2026-02-10T20:13:28.338589"
}