{
  "metadata": {
    "case_name": "Appellants v. Respondents (Landlords)",
    "case_year": 1972,
    "court": "Supreme Court of India",
    "judges": [
      "ALAGIRISWAMI, J."
    ],
    "case_number": "Civil Appeal No. 846 and 1343 of 1972; Civil Appeal No. 1343 of 1973",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Respondents are landlords of two houses in Karol Bagh area of Delhi built on lands given on long lease by Delhi Improvement Trust (succeeded by Delhi Development Authority).",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Lease terms: lessees to put up residential buildings; land and buildings not to be used for any purpose other than residential without lessor's written consent; lease void if used otherwise.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Present landlords are successors in interest of original lessees.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Portions of buildings leased for commercial purposes: barber shop in C.A. 846 and scooter repair shop in C.A. 1343.",
      "type": "disputed",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Buildings put to commercial use even before 1957 when Delhi Development Authority Act 1957 came into force.",
      "type": "admitted",
      "date": "before 1957",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Delhi Development Authority gave notice to landlords citing breach of lease, threatening determination of lease and re-entry without compensation.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Landlords issued notice to tenants to stop commercial use and instituted eviction proceedings.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Controller dismissed landlords' petitions; appeals to Rent Control Tribunal dismissed.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Landlords filed appeals to Delhi High Court (S.A.O. No. 83-D of 1965 and S.A.O. No. 239-D of 1965); single judge referred to Division Bench contrary to earlier decisions; Division Bench decided in favour of landlords on November 22, 1971.",
      "type": "procedural",
      "date": "1971-11-22",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Leases granted in 1940; buildings possibly before Delhi and Ajmer Rent Control Act 1952.",
      "type": "background",
      "date": "1940",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Are the landlords estopped or otherwise prohibited from getting possession of the property from the tenants because they themselves had let it out for commercial purposes.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Landlord estopped from claiming possession as he leased for commercial purpose.",
      "supporting_facts": [
        "f4",
        "f9"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Clause (k) applies only where tenant used after previous notice from landlord at beginning of tenancy prohibiting commercial use; here both aware, so no notice needed and clause inapplicable.",
      "supporting_facts": [
        "f4",
        "f7"
      ],
      "legal_basis": "Section 14(1) proviso (k) Delhi Rent Control Act 1958"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Not interested in evicting tenants but in stopping commercial use to avoid lease forfeiture by DDA; both landlord and tenant would lose otherwise.",
      "supporting_facts": [
        "f6",
        "f4"
      ],
      "legal_basis": "Section 14(1) proviso (k) and sub-section (11) Delhi Rent Control Act 1958"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Clauses (c) and (k) of Section 14(1) proviso address different situations; (k) applies where lease to tenant for commercial purpose but contrary to head-lease condition.",
      "addresses_issue": "i1",
      "key_observation": "Legislature anxious to prevent unauthorized use of leased lands by authorities like DDA."
    },
    {
      "id": "cr2",
      "text": "No estoppel against statute; tenancy not void ab initio; landlord can enforce despite participation in breach.",
      "addresses_issue": "i1",
      "key_observation": "Even if landlord cannot evict, DDA can forfeit lease, harming both."
    },
    {
      "id": "cr3",
      "text": "Sub-section (11) provides alternatives: comply with condition or pay compensation as directed by Controller.",
      "addresses_issue": "i1",
      "key_observation": "Controller must consider options; cannot mandatorily evict."
    },
    {
      "id": "cr4",
      "text": "Section 14 Delhi Development Act 1957 irrelevant as prohibition from lease terms, not plan; no regulations framed for continuance.",
      "addresses_issue": "i1",
      "key_observation": "Section enforces plans, allows continuance of prior uses subject to regulations."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Landlords not estopped; can seek possession under clause (k); matter remitted to Controller to decide under sub-section (11) whether compliance or compensation.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Section 14 Delhi Development Act has no relevance.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Smt. Uma Kumari v. Jaswant Rai Chopra",
      "citation": "P.L.R. 1960 460",
      "treatment": "distinguished",
      "relevance": "Earlier decision holding landlord not entitled due to estoppel; Division Bench took contrary view."
    },
    {
      "case_name": "S. P. Arora v. Ajit Singh",
      "citation": "I.L.R. 1970 11 Delhi 130",
      "treatment": "distinguished",
      "relevance": "Earlier decision holding landlord not entitled due to estoppel; Division Bench took contrary view."
    },
    {
      "case_name": "Waman Shriniwas Kini v. Rati Lal Bhagwandas",
      "citation": "A.I.R. 1959 S.C. 689",
      "treatment": "followed",
      "relevance": "Clear words of section do not make lease void ab initio."
    }
  ],
  "statutes_cited": [
    {
      "name": "Delhi Rent Control Act 1958",
      "sections": [
        "Section 14(1) proviso (c)",
        "Section 14(1) proviso (k)",
        "Section 14(11)"
      ],
      "relevance": "Grounds for eviction; clause (k) for misuse contrary to head-lease conditions; sub-sec (11) allows compliance or compensation."
    },
    {
      "name": "Delhi Development Authority Act 1957",
      "sections": [
        "Section 14"
      ],
      "relevance": "Regulates use per plans; allows continuance of prior uses subject to regulations; not applicable here as breach from lease terms."
    },
    {
      "name": "Delhi and Ajmer Rent Control Act 1952",
      "sections": [],
      "relevance": "First introduced similar remedy for misuse contrary to head-lease."
    },
    {
      "name": "United Provinces Town Improvement Act 1919",
      "sections": [],
      "relevance": "Constituted Delhi Improvement Trust which leased the lands."
    }
  ],
  "outcome": {
    "disposition": "partially_accepted",
    "summary": "Supreme Court allowed the appeals by special leave, set aside Delhi High Court judgment favoring landlords, and remitted the matter to the Controller to decide under Section 14(11) whether tenants should comply with the condition or pay compensation to the authority.",
    "relief_granted": "Remand to Controller for fresh consideration under Section 14(11); no immediate eviction.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The question that arises for decision in these cases is this: Are the landlords estopped or otherwise prohibited from getting possession of the property from the tenants because they themselves had let it out for commercial purposes.",
      "speaker": "court",
      "significance": "Frames the core legal issue."
    },
    {
      "text": "There can be no estoppel against the statute.",
      "speaker": "court",
      "significance": "Rejects estoppel argument central to tenants' case."
    },
    {
      "text": "The policy of the legislature seems to be to put an end to unauthorised use of the leased lands rather than merely to enable the authorities to get back possession of the leased lands.",
      "speaker": "court",
      "significance": "Explains legislative intent behind clause (k)."
    }
  ],
  "_case_id": "1973_6",
  "_label": 1,
  "_text_length": 17353,
  "_extracted_at": "2026-02-10T20:11:02.116116"
}