{
  "metadata": {
    "case_name": "Jahangiri Mal Kalu Ram (Appellants) v. Official Receiver and Others",
    "case_year": 1967,
    "court": "Supreme Court of India",
    "judges": [
      "ALAGIRISWAMI, J."
    ],
    "case_number": "Civil Appeal No. 1248 of 1967",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellants are two brothers and their sons who constituted a firm called Jahangiri Mal Kalu Ram.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On 19-11-1956, appellants were declared insolvents and Official Receiver took possession of all their properties including the building in dispute.",
      "type": "material",
      "date": "1956-11-19",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On 21-11-1956, appellants filed objection petition under s.60 CPC read with s.4 Provincial Insolvency Act claiming exemption for the building under clause (ccc).",
      "type": "procedural",
      "date": "1956-11-21",
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "Official Receiver contended that the property is not a residential house but a shop, and back portion (kitchen, raised platform) given in trust for residential purposes.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f5",
      "text": "Creditors contended that property is a shop, though appellants using back portion as residence.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f6",
      "text": "Trial Court (Insolvency Judge) held building consists of two distinct units: front shop (main hall, two apartments, kotha integral part), back residential (BCDE and upper storey). Upheld objection for residential portion, dismissed for shop.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Appeal by insolvents: District Judge Hissar held no doubt building is main residential house of insolvents, allowed appeal.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Appeal by creditors: Single Judge accepted shop has separate access but connected to residential portion; only portion of ground floor used as shop; upheld District Judge.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Letters Patent Appeal (judgment dated April 7, 1966): Division Bench followed Full Bench Ude Bhan v. Kapoor Chand, held if portion let out, whole house not occupied by judgment-debtor; allowed appeal, restored Insolvency Judge order.",
      "type": "procedural",
      "date": "1966-04-07",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Building is single one: portion downstairs opens on chowk Mandi Dabwali and public street used as shop; no evidence upstairs used for shop.",
      "type": "admitted",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Interpretation of clause (ccc) to proviso to sub-s.(1) of s.60 CPC: whether main residential house occupied by judgment-debtor (non-agriculturist) is exempt from attachment if a portion is used by him as a shop.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Building in dispute is main residential house entitled to exemption under clause (ccc) of s.60(1) CPC.",
      "supporting_facts": [
        "f1",
        "f10"
      ],
      "legal_basis": "s.60 CPC proviso clause (ccc); s.4 Provincial Insolvency Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Property is a shop, not residential house; back portion used for residence but front is distinct shop.",
      "supporting_facts": [
        "f4",
        "f5",
        "f6"
      ],
      "legal_basis": "s.60 CPC proviso clause (ccc)"
    },
    {
      "id": "ra2",
      "text": "Portion used as shop analogous to letting out to tenant, hence not occupied by judgment-debtor, no exemption for whole house (following Ude Bhan Full Bench).",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": "Ude Bhan Ors. v. Kapoor Chand Ors."
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Building is single main residential house occupied by insolvents; no warrant for finding two distinct portions; Division Bench accepted this but wrongly analogized to letting out.",
      "addresses_issue": "i1",
      "key_observation": "Shop portion has separate access but connected to residential; upstairs entirely residential."
    },
    {
      "id": "cr2",
      "text": "Full Bench Ude Bhan applies to portion let out to tenant (not occupied by judgment-debtor), not to portion used by owner as shop.",
      "addresses_issue": "i1",
      "key_observation": "Using portion of residential house for business does not cease it being residential house, given social conditions in country."
    },
    {
      "id": "cr3",
      "text": "Composite user common: lawyer's office, doctor's consulting room in house remain part of residential house.",
      "addresses_issue": "i1",
      "key_observation": "Punjab cases from 1951 support: shop on ground floor does not convert building to non-residential if occupied by owner."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Main residential house occupied by judgment-debtor exempt under clause (ccc) even if portion used by him as shop; whole building exempt from attachment.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Ude Bhan Ors. v. Kapoor Chand Ors.",
      "citation": "I.L.R. 1966 2 Punjab 400",
      "treatment": "distinguished",
      "relevance": "Applies to portion let out to tenant (not occupied by judgment-debtor); does not cover owner using portion as shop."
    },
    {
      "case_name": "Agha Jafar Ali Khan v. Radha Kishan",
      "citation": "A.I.R. 1951 Punjab 433",
      "treatment": "followed",
      "relevance": "Shop on ground floor does not convert whole building to non-residential if used by owner for residence."
    },
    {
      "case_name": "Firm Ganga Ram v. Firm Jai Ram",
      "citation": "A.I.R. 1957 Punjab 293",
      "treatment": "followed",
      "relevance": "Ground floor commercial, upper floors residential: entire house exempt if main residential house occupied by judgment-debtor; recognizes composite user in country."
    },
    {
      "case_name": "Punjab Mercantile Bank Limited in liquidation Jullundur City v. Messrs General Typewriter Co., Jullundur City",
      "citation": "1962 P.L.R. 1081",
      "treatment": "followed",
      "relevance": "Distinguishes letting out (chabaras to tenants not exempt) from owner use; portion let out not occupied by judgment-debtor."
    }
  ],
  "statutes_cited": [
    {
      "name": "Code of Civil Procedure",
      "sections": [
        "s.60(1) proviso clause (ccc)"
      ],
      "relevance": "Exempts main residential house and appurtenant land of non-agriculturist judgment-debtor occupied by him, unless specifically charged; added by Punjab Relief of Indebtedness Act 7 of 1934, amended by Acts 12 of 1940, 6 of 1942."
    },
    {
      "name": "Provincial Insolvency Act",
      "sections": [
        "s.4"
      ],
      "relevance": "Basis for objection petition read with s.60 CPC."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; judgment of Division Bench set aside; judgments of Single Judge and District Judge restored; whole building held exempt from attachment as main residential house occupied by insolvents.",
    "relief_granted": "Exemption of entire building from attachment and sale.",
    "costs": "Respondents to pay appellants costs."
  },
  "key_quotes": [
    {
      "text": "\"In the circumstances and social conditions of this country it would be difficult to justify the conclusion that where a part of a residential house is used in connection with the business or profession of the owner of that house that portion ceases to be part of the residential house.\"",
      "speaker": "court",
      "significance": "Core reasoning distinguishing own business use from letting out."
    },
    {
      "text": "\"The conditions in our country are such which admit of a composite user of the same building. A part of the same house is used for dwelling, and the other part is meant for commercial or business purpose...\"",
      "speaker": "court",
      "significance": "Explains cultural context supporting exemption for composite use (from Firm Ganga Ram)."
    }
  ],
  "_case_id": "1973_158",
  "_label": 1,
  "_text_length": 11908,
  "_extracted_at": "2026-02-10T20:12:09.377407"
}