{
  "metadata": {
    "case_name": "Kanta Prosad Chotaria v. Harnandrai Badridas",
    "case_year": 1967,
    "court": "Supreme Court of India",
    "judges": [
      "Mukherjea, J."
    ],
    "case_number": "Civil Appeal No. 1323 of 1967",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "In May 1956 one Debidutt Bhagwati Prasad obtained a money decree against Harnandrai Badridas.",
      "type": "material",
      "date": "1956-05",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "In January 1959 Mr. S. Tibrewal, a member of the Calcutta Bar was appointed Receiver in an insolvency proceeding against one Durga Prasad Goinka, a partner of the defendant firm in respect of premises No. 99 and 128 Cotton Street, Calcutta for the purpose of selling those properties.",
      "type": "procedural",
      "date": "1959-01",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On 3 April 1958 Mr. Tibrewal was also appointed receiver in execution of the decree obtained by Debidutt Bhagwati Prasad for the sale of the two premises.",
      "type": "procedural",
      "date": "1958-04-03",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On 26 April 1958 the properties were put up to sale by auction and one Kanta Prosad Chotaria was declared the purchaser of premises No. 128, Cotton Street for Rs. 52,000/-. Kanta Prosad made a deposit of Rs. 13,000/- as earnest money.",
      "type": "procedural",
      "date": "1958-04-26",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "There were various proceedings after this at the end of which, on 19 May 1964, there was an order directing the receiver to complete the sale within one month from that date and Kanta Prosad was directed to pay the balance of the purchase money within that time.",
      "type": "procedural",
      "date": "1964-05-19",
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "The receiver was directed to execute and register a conveyance on behalf of the judgment-debtors who were the owners of premises No. 128, Cotton Street in case they refused to register the same. The purchaser was by the same order directed to pay interest on the balance of the purchase money from 13 June 1963 to 19 March 1964 in default whereof there was an order nisi to execute the conveyance.",
      "type": "procedural",
      "date": "1964-05-19",
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "On 17 June 1964 the receiver executed the conveyance on behalf of the judgment-debtor and the insolvent.",
      "type": "procedural",
      "date": "1964-06-17",
      "source": "receiver"
    },
    {
      "id": "f8",
      "text": "On 19 June 1964 the purchaser through his attorney requested the receiver to make over possession of premises No. 128, Cotton Street.",
      "type": "procedural",
      "date": "1964-06-19",
      "source": "purchaser"
    },
    {
      "id": "f9",
      "text": "On 23 July 1964 the receiver was further requested by the attorney to make over possession of the premises by the issue of letters of attorney addressed to each tenant in respect of portions which were tenanted and to make over vacant possession of that portion of the premises which was in the occupation of the judgment-debtor to the purchaser.",
      "type": "procedural",
      "date": "1964-07-23",
      "source": "purchaser"
    },
    {
      "id": "f10",
      "text": "On 17th November 1964 an application was made praying inter alia for an order upon the judgment-debtor to deliver vacant possession of the premises in their occupation to the receiver and also a direction to the receiver to deliver vacant possession of the same to the purchaser.",
      "type": "procedural",
      "date": "1964-11-17",
      "source": "purchaser"
    },
    {
      "id": "f11",
      "text": "In due course, the court made an order in terms of that prayer.",
      "type": "procedural",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "On appeal against that order in the appellate court the original order was confirmed.",
      "type": "procedural",
      "source": "calcutta_high_court"
    },
    {
      "id": "f13",
      "text": "Appeal by certificate from the judgment and order dated April 29, 1966 of the Calcutta High Court in Appeal No. 109 of 1965.",
      "type": "procedural",
      "date": "1966-04-29",
      "source": "calcutta_high_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "whether after an auction sale in execution of a decree a decree-holder auction-purchaser can move the executing court for delivery of vacant possession of an immovable property or whether he has to file a separate suit to get that possession.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "as soon as a receiver in execution has executed a conveyance in favour of an auction purchaser the decree stands satisfied and there is an end of the execution proceedings so that the question of the auction-purchaser getting possession of the property is a matter which has nothing to do with the execution, discharge or satisfaction of the decree. Such a question does not fall to be determined by the executing court but can be decided only in a separate suit.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "Ram Singh Gopal Singh and Anr. v. Abdullah Habibullah I.L.R. 26 Lah. 252; followed by Allahabad, Patna, Bombay High Courts"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The auction-purchaser is entitled to apply for delivery of possession under O. XXI r.95, and such questions fall under sec. 47 CPC as relating to execution, discharge or satisfaction of the decree.",
      "supporting_facts": [
        "f10",
        "f11"
      ],
      "legal_basis": "Kailash Chandra Tarafdar v. Gopal Chandra Poddar I.L.R 53 Cal. 781 (Full Bench Calcutta HC); O. XXI rr. 95, 96 CPC"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "If a confirmation of the sale would finally terminate all questions as to execution of the decree it is difficult to appreciate why the legislature would frame such rules as rules 95 to 102 under o. XXI of the Code of Civil Procedure.",
      "addresses_issue": "i1",
      "key_observation": "Legislature intended executing court duty to include delivery of possession to auction purchaser under rr.95,96."
    },
    {
      "id": "cr2",
      "text": "Sec. 47 in our view should be construed liberally... a decree-holder who has been a party to the decree will shed his character as such party merely upon purchasing the property at the execution sale... There is no reason why he should not retain his character of a party to the suit until the delivery of possession to him of the property purchased by him.",
      "addresses_issue": "i1",
      "key_observation": "Auction-purchaser (decree-holder) remains party to suit; questions on delivery of possession relate to execution under sec.47."
    },
    {
      "id": "cr3",
      "text": "We have carefully gone through the various decisions cited before us and we find ourselves in agreement with the opinion of the full bench of the Calcutta High Court in Kailash Tarafdars case.",
      "addresses_issue": "i1",
      "key_observation": "Agrees with Calcutta Full Bench over Lahore Full Bench view."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "A decree-holder auction-purchaser can move the executing court for delivery of vacant possession under O. XXI r.95; such questions arise between parties to the suit and relate to execution, discharge or satisfaction of the decree within sec.47 CPC.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Kailash Chandra Tarafdar v. Gopal Chandra Poddar",
      "citation": "I.L.R 53 Cal. 781",
      "treatment": "followed",
      "relevance": "Full Bench Calcutta HC holding that decree-holder auction-purchaser entitled to possession under O.XXI r.95 via sec.47 CPC"
    },
    {
      "case_name": "Ram Singh Gopal Singh and Anr. v. Abdullah Habibullah",
      "citation": "I.L.R. 26 Lah. 252",
      "treatment": "distinguished",
      "relevance": "Lahore HC view that sec.47 does not apply to application under O.XXI r.95 by decree-holder auction-purchaser; decree satisfied post-sale"
    },
    {
      "case_name": "Prosunno Coomar Sanyal v. Kalidas Sanyal",
      "citation": "19 I.A. 160",
      "treatment": "followed",
      "relevance": "Judicial Committee observation supporting wide construction of sec.47 CPC"
    },
    {
      "case_name": "Ganapathy v. Krishnamachariar",
      "citation": null,
      "treatment": "followed",
      "relevance": "Privy Council favoring liberal construction of sec.47 (earlier sec.244); auction-purchaser is party to suit"
    }
  ],
  "statutes_cited": [
    {
      "name": "Code of Civil Procedure",
      "sections": [
        "Section 47",
        "Order XXI Rule 95",
        "Order XXI Rule 96",
        "Order XXI Rules 95 to 102"
      ],
      "relevance": "Sec.47 applies to questions of delivery of possession to decree-holder auction-purchaser; rr.95-96 provide for application for possession post-sale"
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court dismissed the appeal, upholding the Calcutta High Court's confirmation of the executing court's order directing delivery of vacant possession to the auction-purchaser through the receiver.",
    "relief_granted": "Direction to judgment-debtor to deliver vacant possession to receiver and receiver to purchaser upheld",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "whether after an auction sale in execution of a decree a decree-holder auction-purchaser can move the executing court for delivery of vacant possession of an immovable property or whether he has to file a separate suit to get that possession.",
      "speaker": "court",
      "significance": "States the core legal question"
    },
    {
      "text": "We find ourselves in agreement with the opinion of the full bench of the Calcutta High Court in Kailash Tarafdars case.",
      "speaker": "court",
      "significance": "Court's adoption of Calcutta view resolving conflict"
    },
    {
      "text": "Sec. 47 in our view should be construed liberally.",
      "speaker": "court",
      "significance": "Key principle for interpreting applicability to possession applications"
    }
  ],
  "_case_id": "1973_400",
  "_label": 0,
  "_text_length": 11674,
  "_extracted_at": "2026-02-10T20:13:47.234737"
}