{
  "metadata": {
    "case_name": "Amco Battery Manufacturing Company v. Workmen",
    "case_year": 1968,
    "court": "Supreme Court of India",
    "judges": [
      "VAIDIALINGAM, J."
    ],
    "case_number": "Civil Appeal No. 2433 of 1968",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "At the commencement of the year 1966, the appellant published a list of holidays for that year, stating Kali Puja holiday on Friday, 11th November 1966.",
      "type": "background",
      "date": "1966",
      "source": "appellant"
    },
    {
      "id": "f2",
      "text": "On November 5, 1966, the appellant notified that the factory will remain closed for Kali Puja on Friday, 11th November 1966, based on the list of holidays.",
      "type": "procedural",
      "date": "1966-11-05",
      "source": "appellant"
    },
    {
      "id": "f3",
      "text": "Workmen represented by two unions: Amco Employees Association and Amco Sramik Sangha (Sangha represented majority of workmen).",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On November 10, 1966, General Secretary of Sangha wrote to factory Manager requesting change of Kali Puja holiday to Saturday, 12th November 1966, instead of 11th, and to keep factory working on 11th; stated large number of workmen won't attend on 12th otherwise, causing loss of production.",
      "type": "material",
      "date": "1966-11-10",
      "source": "respondent"
    },
    {
      "id": "f5",
      "text": "On November 10, 1966, appellant put up notice acceding to Sangha's request: factory closed on 12th November for Kali Puja, open on 11th November during specified hours, cancelling previous notice of November 5.",
      "type": "procedural",
      "date": "1966-11-10",
      "source": "appellant"
    },
    {
      "id": "f6",
      "text": "On November 10, 1966, Association wrote to management objecting to change of Diwali holiday, demanding 11th November stand as originally declared.",
      "type": "disputed",
      "date": "1966-11-10",
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "Appellant did not accede to Association's request; most Association workmen did not attend work on November 11, 1966; wages not paid for absence.",
      "type": "material",
      "date": "1966-11-11",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "On December 30, 1967, 83 respondents (workmen) filed application before Labour Court, Gauhati under section 33-A alleging change of holiday altered conditions of service without complying with sections 33 and 9-A during pending industrial dispute; claimed one day Kali Puja holiday was condition of service; sought wages for November 11, 1966.",
      "type": "procedural",
      "date": "1967-12-30",
      "source": "respondent"
    },
    {
      "id": "f9",
      "text": "Management contested: no change in conditions of service; change at request of majority for their convenience and benefit; Standing Orders entitled them to fix/change holidays; cited previous instances of changes at workmen request.",
      "type": "admitted",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f10",
      "text": "Labour Court found Sangha represented majority; change at their request; but held alteration of fixed holiday amounted to change in condition of service requiring section 9-A compliance; violated section 33 read with 9-A; granted relief to workmen.",
      "type": "procedural",
      "date": "1968-08-09",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "List of holidays published at beginning of 1966 stated subject to modification if thought necessary.",
      "type": "background",
      "date": "1966",
      "source": "appellant"
    },
    {
      "id": "f12",
      "text": "Paragraph 6 of company's certified Standing Orders: Notice specifying days observed as holidays shall be posted as required by Factory Act.",
      "type": "background",
      "date": null,
      "source": "appellant"
    },
    {
      "id": "f13",
      "text": "Previous occasions when holiday for Puja or Diwali once fixed had been altered at request of workmen.",
      "type": "background",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f14",
      "text": "Evidence shows workmen celebrated Diwali on 12th November 1966.",
      "type": "admitted",
      "date": "1966-11-12",
      "source": "respondent"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the appellant contravened section 9-A of the Industrial Disputes Act, 1947 by changing the Diwali holiday from 11th November 1966 to 12th November 1966 at the request of the majority of the workmen, during pendency of industrial dispute, without following section 9-A procedure, thereby violating section 33.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "No change in conditions of service effected; no cancellation of holiday, workmen had Diwali holiday on 12th; change made at request of majority for their convenience and benefit; Standing Orders entitled management to fix and change holidays; previous instances of such changes; section 33(2)(a) permitted.",
      "supporting_facts": [
        "f3",
        "f4",
        "f5",
        "f9",
        "f10",
        "f11",
        "f12",
        "f13"
      ],
      "legal_basis": "Section 33(2)(a), Standing Orders para 6"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Holiday originally fixed for 11th November per list and notice; one day Kali Puja holiday was condition of service for years; Standing Orders gave no power to change; alteration required section 9-A procedure or settlement under proviso (a); action illegal, absence on 11th legal.",
      "supporting_facts": [
        "f1",
        "f2",
        "f6",
        "f7",
        "f8"
      ],
      "legal_basis": "Sections 33, 9-A, Fourth Schedule Item 5"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Alteration of Diwali holiday date from 11th to 12th at majority request not change in conditions of service; workmen entitled to Diwali holiday but date decided by management in consultation; no deprivation of holiday; list subject to modification; notices complied with Standing Orders.",
      "addresses_issue": "i1",
      "key_observation": "Workmen not deprived of Diwali holiday; got it on 12th when majority celebrated."
    },
    {
      "id": "cr2",
      "text": "Even if alteration were change in condition, no section 9-A violation as majority workmen themselves requested it; object of 9-A is to allow workmen consider proposed change.",
      "addresses_issue": "i1",
      "key_observation": "Employer within rights under section 33(2)(a)."
    },
    {
      "id": "cr3",
      "text": "Distinguished Sur Iron Steel: no specific entry for weekly off; Tata Iron: cancellation of long-standing Sunday holiday different, as Sunday unique.",
      "addresses_issue": "i1",
      "key_observation": "Here, festival holiday date flexible based on observance."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Change of Diwali holiday date at request of majority workmen does not amount to alteration in conditions of service under section 9-A; no contravention of section 33 read with 9-A.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Workmen of M/s. Sur Iron Steel Co. Pvt. Ltd. v. M/s. Sur Iron Steel Co. Pvt. Ltd.",
      "citation": "1971 1 LLJ 570",
      "treatment": "distinguished",
      "relevance": "Rejected contention that change of weekly off-day without 9-A illegal; no opinion on whether such change attracts 9-A."
    },
    {
      "case_name": "M/s Tata Iron and Steel Co. Ltd. v. The Workmen",
      "citation": "1972 I LLJ 259",
      "treatment": "distinguished",
      "relevance": "Cancellation of long-standing Sunday holiday amounted to change in conditions; different from shifting festival holiday date."
    }
  ],
  "statutes_cited": [
    {
      "name": "Industrial Disputes Act, 1947",
      "sections": [
        "33",
        "33(2)(a)",
        "9-A",
        "Fourth Schedule Item 5"
      ],
      "relevance": "No change in conditions specified in Fourth Schedule requiring 9-A notice; section 33(2)(a) permitted action during pending dispute."
    },
    {
      "name": "Company's Certified Standing Orders",
      "sections": [
        "Paragraph 6"
      ],
      "relevance": "Required posting notice of holidays; all notices complied."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal by special leave allowed; Labour Court award set aside; no violation of sections 33 read with 9-A; workmen not entitled to wages for November 11, 1966.",
    "relief_granted": "None to respondents; relief to appellant by reversing Labour Court.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The alteration of the date regarding the holiday for Diwali, from the 11th to the next day, cannot be considered to be an alteration in the conditions of service.",
      "speaker": "court",
      "significance": "Core holding that shift in date not change in service conditions."
    },
    {
      "text": "Even assuming that the alteration of the date of the holiday for Diwali will amount to a condition of service, there is no question, in this case, of a contravention of section 9-A, when the majority of the workmen themselves requested the employer to make the alteration.",
      "speaker": "court",
      "significance": "Even if change, majority request negates 9-A violation."
    }
  ],
  "_case_id": "1973_116",
  "_label": 1,
  "_text_length": 14027,
  "_extracted_at": "2026-02-10T20:11:34.579456"
}