{
  "metadata": {
    "case_name": "Municipal Council of Bhopal v. Respondents",
    "case_year": 1967,
    "court": "Supreme Court of India",
    "judges": [
      "ALAGIRISWAMI, J."
    ],
    "case_number": "Civil Appeal No. 1547 of 1967",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "On 6-11-1964 the Municipal Council of Bhopal made bye-laws under s. 356(7) read with s. 349(ii) of the Madhya Pradesh Municipalities Act, 1961 after previous publication in the Gazette as required under s. 357(4) and confirmation by the State Government under s. 357(3) in respect of a Municipal bus stand.",
      "type": "procedural",
      "date": "1964-11-06",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Bye-law 2 provided that no person in charge of a motor-bus plying for hire shall for the purpose of taking up or setting down of passengers, park or stop his bus anywhere within the limits of the Bhopal Municipality except at the Municipal Bus Stand.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Bye-laws 3 to 7 provided for a levy of a fee of Re. 1 for every eight hours or part thereof in respect of the use of the bus stand by such buses and for the issue of a permit on such payment.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On 13-11-1964 the respondents filed a writ petition in the High Court of Madhya Pradesh challenging the said bye-laws.",
      "type": "procedural",
      "date": "1964-11-13",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The High Court held that bye-law 1(c), which defined the expression Municipal Bus Stand, and bye-law 2 were valid, but bye-laws 3 to 7 were invalid, and restrained the Municipal Council from giving effect to those bye-laws and directed refund of fees collected from the respondents.",
      "type": "procedural",
      "date": "1966-10-18",
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "This appeal filed by the Municipal Council by certificate granted by the High Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "The respondents as well as the Municipal Council had stated that the District Magistrate had declared the Bhopal Municipal Bus Stand as a bus stand.",
      "type": "admitted",
      "date": null,
      "source": "petitioner | respondent"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the Municipal Council has power under sections 349(ii) and 358(7)(f) and (n) of the Madhya Pradesh Municipalities Act, 1961 to make bye-laws compelling motor buses to use only the Municipal Bus Stand for taking up or setting down passengers and to levy fees therefor.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether bye-law 2 is valid, and consequently bye-laws 3 to 7.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "There is no compulsion on anybody to park his bus within the municipal limits and he can park it outside; if he parks in the municipal bus stand he is using municipal land with permission for which a permit is issued and fee charged.",
      "supporting_facts": [
        "f2",
        "f3"
      ],
      "legal_basis": "s. 349(ii) Madhya Pradesh Municipalities Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Argument based on section 6 of the Madhya Pradesh Motor Vehicles Taxation Act, 1947.",
      "supporting_facts": [],
      "legal_basis": "s. 6 Madhya Pradesh Motor Vehicles Taxation Act, 1947"
    },
    {
      "id": "ra2",
      "text": "Had a fundamental right to use the Municipal bus stand.",
      "supporting_facts": [],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "S. 349(ii) does not apply as it deals with fees for permissions required under other sections for temporary occupation by individuals, not provision of bus stand or compelling use.",
      "addresses_issue": "i1",
      "key_observation": "The section itself does not enable the Municipal Council to require permission; it deals with levy of fees for permissions required under other sections."
    },
    {
      "id": "cr2",
      "text": "Under s. 358(7)(f) and (n), no power to compel use of municipal land as halting place; power to regulate or prohibit use cannot compel people to use it.",
      "addresses_issue": "i1",
      "key_observation": "The power to regulate or prohibit the use of municipal land as halting place of vehicles cannot be used to compel people use such land as halting places."
    },
    {
      "id": "cr3",
      "text": "Power to specify places for picking up/setting down passengers and regulate stands vests in State Government under s.68(2)(r)(s) of Motor Vehicles Act; District Magistrate declaration not under this power.",
      "addresses_issue": "i1",
      "key_observation": "Power to compel persons in charge of motor buses to stop only at certain places relates to motor traffic regulation under Motor Vehicles Act."
    },
    {
      "id": "cr4",
      "text": "Petitioner's propositions rejected: cannot compel buses outside limits indirectly; no fundamental right to use municipal land without permission.",
      "addresses_issue": "i2",
      "key_observation": "The person plying a motor bus for hire cannot exercise his trade effectively if not allowed to set down or take up passengers within town limits."
    },
    {
      "id": "cr5",
      "text": "Municipal Council can provide voluntary bus stand and charge fees as property owner, but cannot compel use via bye-laws.",
      "addresses_issue": "i2",
      "key_observation": "While no power to compel, no objection to providing bus stand voluntarily and requiring payment."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Bye-law 2 is invalid as Municipal Council lacks power under MP Municipalities Act to compel exclusive use of Municipal Bus Stand; power lies under Motor Vehicles Act s.68(2)(r)(s).",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Bye-laws 3 to 7 invalid consequently.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "High Court erred in holding bye-law 2 valid.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "T. B. Ibrahim v. R.T.C., Tanjore",
      "citation": "1953 S.C.R. 290",
      "treatment": "followed",
      "relevance": "Expression 'duly notified stand' means notified by Transport Authority; s.68(2)(r) empowers prohibition of picking up/setting down except at notified stands."
    },
    {
      "case_name": "Municipal Board, Pushkar v. State Transport Authority, Rajasthan",
      "citation": "1963 Supp. 2 S.C.R. 373",
      "treatment": "followed",
      "relevance": "Bus stand is place where service commences/terminates; fixation within s.68(2)(r); s.86 deals with parking under s.91(2)(c)."
    }
  ],
  "statutes_cited": [
    {
      "name": "Madhya Pradesh Municipalities Act, 1961",
      "sections": [
        "s. 349(ii)",
        "s. 356(7)",
        "s. 357(3)",
        "s. 357(4)",
        "s. 358(7)(f)",
        "s. 358(7)(n)"
      ],
      "relevance": "No power to compel use of bus stand or levy fees therefor; s.349(ii) for fees on permissions under other sections; s.358 for regulation/prohibition, not compulsion."
    },
    {
      "name": "Motor Vehicles Act",
      "sections": [
        "s. 68(2)(r)",
        "s. 68(2)(s)",
        "s. 76"
      ],
      "relevance": "State Government power to prohibit picking up/setting down except at notified stands, regulate stands; s.76 for general standing places, not passenger pick-up/set-down."
    },
    {
      "name": "Madras District Municipalities Act, 1920",
      "sections": [
        "s. 270-B",
        "s. 270-C"
      ],
      "relevance": "Compared: empowers construction/maintenance of halting places/cart-stands and prohibition nearby, but does not affect Transport Authority power under MV Act."
    },
    {
      "name": "Madhya Pradesh Motor Vehicles Taxation Act, 1947",
      "sections": [
        "s. 6"
      ],
      "relevance": "Argument advanced but not considered as bye-laws held invalid."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Court held bye-law 2 invalid, reversing the High Court's validation of it, and consequently bye-laws 3-7 invalid, aligning with High Court's order on those while declaring the compulsion invalid; no necessity to consider other arguments.",
    "relief_granted": "Bye-laws held invalid; High Court order on bye-laws 3-7 affirmed implicitly.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The power to regulate or prohibit the use of municipal land as halting place of vehicles cannot be used to compel people use such land as halting places. Such a power must be specifically given.",
      "speaker": "court",
      "significance": "Core reasoning on lack of compulsion power under s.358."
    },
    {
      "text": "The person plying a motor bus for hire cannot exercise his trade or profession effectively if he is not allowed to set down or take up passengers within the limits of a town.",
      "speaker": "court",
      "significance": "Rejects petitioner's no-compulsion argument."
    },
    {
      "id": "kq3",
      "text": "Power to specify the place under section 68(2)(r)(s) vests in the State Government.",
      "speaker": "court",
      "significance": "Clarifies authority for bus stand notification."
    }
  ],
  "_case_id": "1973_178",
  "_label": 0,
  "_text_length": 14736,
  "_extracted_at": "2026-02-10T20:12:16.495861"
}