{
  "metadata": {
    "case_name": "State of U.P. and another v. Plaintiff-Respondents",
    "case_year": 1971,
    "court": "Supreme Court of India",
    "judges": [
      "Dua J."
    ],
    "case_number": "Civil Appeal No. 1701 of 1971",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Plaintiffs instituted suit for recovery of Rs. 69,556.27 by way of damages for breach of contract, impleading State of U.P. through Collector of Bijnor as first defendant and Divisional Forest Officer, Bijnor as second defendant.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Summons to State of U.P. served on District Government Counsel.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On September 2, 1966, District Government Counsel filed appearance slip and formal application praying for one month's time to file written statement. Prayer granted.",
      "type": "procedural",
      "date": "1966-09-02",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On October 1, 1966, District Government Counsel filed application under s. 34 of Arbitration Act pleading arbitration clause in agreement and willingness of State to refer matter to arbitration, seeking stay of suit.",
      "type": "procedural",
      "date": "1966-10-01",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Trial court held dispute subject to arbitration clause, State had not taken any steps in suit proceedings nor filed written statement, allowed application and stayed suit.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "Plaintiffs appealed to Allahabad High Court. High Court allowed appeal, set aside stay order, relying on United Provinces Government v. Sri Har Nath (AIR 1957 All 91) and Union of India v. Hans Raj Gupta Co. (AIR 1949 All 611), holding action of District Government Counsel in applying for time to file written statement amounted to taking a step in proceedings under s. 34.",
      "type": "procedural",
      "date": "1971-02-10",
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "State of U.P. and Divisional Forest Officer filed appeal by special leave to Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the application by District Government Counsel for time to file written statement constitutes a 'step in the proceedings' under s. 34 of the Arbitration Act, disentitling the State from obtaining stay of suit.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the District Government Counsel acted without instructions, such that his action does not bind the State.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether the High Court erred in reversing the trial court's discretionary order of stay.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "District Government Counsel had no instructions to ask for adjournment for filing written statement, so his action cannot bind State of U.P., rendering s.34 application competent.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": "Punjab State v. Moji Ram; State of Himachal Pradesh v. Lalchand Shahi (AIR 1953 H.P. 75); Harbans Lal v. National Fire General Insurance Co. Ltd. (AIR 1957 Punjab 223)"
    },
    {
      "id": "pa2",
      "text": "Trial court exercised discretion properly in granting stay; High Court erred in reversing it as discretion was neither unreasonable nor contrary to principles.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": "The Printers (Mysore) Private Ltd. v. Pothen Joseph; Johri Mal v. Fatehchand ((1960) 3 S.C.R. 746)"
    },
    {
      "id": "pa3",
      "text": "Counsel without instructions asking for adjournment ostensibly for WS should be construed as seeking time to get instructions; test is objective but rebuttable in cases like Government counsel without instructions.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": "Johri Mal v. Fatehchand (observations at p.71 para 23-A)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "No material on record that counsel had no instructions; counsel presumed duly empowered, filed appearance slip, prayer for adjournment for WS is step in aid under s.34.",
      "supporting_facts": [
        "f2",
        "f3"
      ],
      "legal_basis": "Sarat Kumar Ray v. Corporation of Calcutta; Edward Keventrash v. Judgilal (AIR 1943 Bom 228); Roop Kishore v. U.P. Government (AIR 1945 All 24); United Provinces Government v. Sri Har Nath (AIR 1957 All 91); Union of India v. Hans Raj Gupta Co. (AIR 1949 All 611)"
    },
    {
      "id": "ra2",
      "text": "Burden on defendant to establish circumstances rebutting prima facie effect of adjournment application.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": "Roop Kishore v. U.P. Government"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "District Government Counsel is recognized agent under Order XXVII Rule 2 CPC, authorized to receive summons, appear, act and make applications for State; served with copy of plaint, specifically asked for time to file WS, not for instructions; State took benefit of adjournment.",
      "addresses_issue": "i1",
      "key_observation": "Prayer for time specifically for filing written statement is a step in proceedings under s.34, displaying intention to proceed with suit."
    },
    {
      "id": "cr2",
      "text": "No merit in claim of no instructions or voluntary appearance; recognized agent cannot appear as volunteer; failure to file WS on due date avoided by application.",
      "addresses_issue": "i2",
      "key_observation": "State cannot disown authorized counsel's act after benefiting from it; unjust to opposite party."
    },
    {
      "id": "cr3",
      "text": "No discretion to exercise if s.34 application incompetent due to prior step; High Court judgment has no serious infirmity.",
      "addresses_issue": "i3",
      "key_observation": "Suit for heavy damages better tried in court than by lay arbitrator; considerable delay since institution."
    },
    {
      "id": "cr4",
      "text": "S.34 requires application before WS or other step; taking step contemplates aid to progress of suit or submission to jurisdiction for merits.",
      "addresses_issue": "i1",
      "key_observation": "Mere arbitration clause no bar to suit; defendant bears onus to comply strictly with s.34."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Application for time to file written statement by authorized Government counsel constitutes step in proceedings under s.34 Arbitration Act.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "District Government Counsel's action binds State as recognized agent; no evidence of lack of instructions.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "High Court correctly set aside trial court's stay order; no interference under Article 136.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "United Provinces Government v. Sri Har Nath",
      "citation": "AIR 1957 All 91",
      "treatment": "followed",
      "relevance": "Action of counsel applying for time to file WS is step under s.34"
    },
    {
      "case_name": "Union of India v. Hans Raj Gupta Co.",
      "citation": "AIR 1949 All 611",
      "treatment": "followed",
      "relevance": "Action of counsel applying for time to file WS is step under s.34"
    },
    {
      "case_name": "Punjab State v. Moji Ram",
      "citation": null,
      "treatment": "distinguished",
      "relevance": "Govt pleader acted as volunteer without instructions; distinguished as here counsel authorized"
    },
    {
      "case_name": "State of Himachal Pradesh v. Lalchand Shahi",
      "citation": "AIR 1953 H.P. 75",
      "treatment": "distinguished",
      "relevance": "Counsel without awareness or instructions; not applicable here"
    },
    {
      "case_name": "Harbans Lal v. National Fire General Insurance Co. Ltd.",
      "citation": "AIR 1957 Punjab 223",
      "treatment": "distinguished",
      "relevance": "Oral adjournment needed due to late summons receipt; not applicable"
    },
    {
      "case_name": "The Printers (Mysore) Private Ltd. v. Pothen Joseph",
      "citation": null,
      "treatment": "referred",
      "relevance": "Appellate court interferes with trial discretion only if unreasonable"
    },
    {
      "case_name": "Johri Mal v. Fatehchand",
      "citation": "(1960) 3 S.C.R. 746 / AIR 1960 Raj 67",
      "treatment": "referred",
      "relevance": "Test for step in proceedings: objective, presumption from WS adjournment application rebuttable in exceptional cases like govt counsel without instructions"
    },
    {
      "case_name": "Anderson Wright Ltd. v. Moran & Co.",
      "citation": "AIR 1955 SC 53; CA 452/1959",
      "treatment": "referred",
      "relevance": "S.34 stay not as matter of course; discretion considering delay, complexity"
    },
    {
      "case_name": "Roop Kishore v. U.P. Government",
      "citation": "AIR 1945 All 24",
      "treatment": "followed",
      "relevance": "Burden on defendant to rebut prima facie step from adjournment prayer"
    },
    {
      "case_name": "Dr. V.R. Vaidya v. Union of India",
      "citation": "1970 Maharashtra Law Journal (notes) p.12 Case No.20",
      "treatment": "referred",
      "relevance": "Counsel deemed instructed for WS adjournment; no stay"
    }
  ],
  "statutes_cited": [
    {
      "name": "Arbitration Act",
      "sections": [
        "Section 34"
      ],
      "relevance": "Application for stay must be before written statement or other step in proceedings; step means aid to suit progress or submission to jurisdiction"
    },
    {
      "name": "Code of Civil Procedure",
      "sections": [
        "Section 9",
        "Order XXVII Rule 2"
      ],
      "relevance": "General right to sue; District Govt Counsel recognized agent for State, authorized to appear/act/apply"
    },
    {
      "name": "Indian Contract Act",
      "sections": [
        "Section 230"
      ],
      "relevance": "Mentioned in context of Anderson Wright case liability"
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court dismissed the appeal by special leave, upheld Allahabad High Court judgment setting aside trial court's stay order under s.34 Arbitration Act, holding that District Government Counsel's application for time to file written statement constituted a step in proceedings, disentitling stay. Suit to proceed to trial on merits.",
    "relief_granted": "Suit not stayed; to be tried in civil court",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"An application for time to file written statement or any other similar application should not be treated as a matter of law a step in the proceedings. In order to constitute a step, it must be of such a nature as to lead the Court to the conclusion that the party prefers to have his rights and liabilities determined by the Civil Court rather than by the domestic forum.\"",
      "speaker": "court",
      "significance": "From Johri Mal, test for what constitutes a 'step' under s.34"
    },
    {
      "text": "\"Taking other steps in the suit proceedings connotes the idea of doing something in aid of the progress of the suit or submitting to the jurisdiction of the court for the purpose of adjudication of the merits of the controversy in the suit.\"",
      "speaker": "court",
      "significance": "Defines 'step in proceedings' under s.34"
    },
    {
      "text": "\"The State took benefit of his appearance and his successful prayer for adjournment... It will be somewhat irrational... to permit the State, after having taken the benefit of this adjournment, to plead that the application for adjournment was not made on instructions.\"",
      "speaker": "court",
      "significance": "Rejects State's disowning of counsel's act"
    }
  ],
  "_case_id": "1973_94",
  "_label": 0,
  "_text_length": 22765,
  "_extracted_at": "2026-02-10T20:11:44.024041"
}