{
  "metadata": {
    "case_name": "Trustees of Shri Chandre Prabhuji Jain Temple v. Administrator-General and another",
    "case_year": 1967,
    "court": "Supreme Court of India",
    "judges": [
      "Mathew, J."
    ],
    "case_number": "Civil Appeal No. 1701 of 1967",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "One Gopalakrishna Raju died in Madras on or about November 13, 1941, leaving behind his widow Manorama, one minor son and two minor daughters.",
      "type": "background",
      "date": "1941-11-13",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On March 25, 1941, Raju executed a will appointing Manorama the executor of the will and the guardian of his minor son and daughters and bequeathing all his properties to the minor son with directions as regards the maintenance and marriage of his daughters.",
      "type": "material",
      "date": "1941-03-25",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On June 7, 1948, Manorama mortgaged certain properties to raise a loan of Rs. 7,000/- for the purpose of meeting the marriage expenses of her elder daughter.",
      "type": "material",
      "date": "1948-06-07",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On August 26, 1948, Manorama filed an application under sections 7 and 10 of the Guardians and Wards Act, 1890, before the High Court of Madras to appoint her as the guardian of her minor children, without disclosing that Raju died after executing a will, stating that Raju died leaving two houses Nos. 18 and 18A in Egmore, Madras, that she was the owner of one half of the houses and that her minor son was the owner of the other half, and that no guardian had been appointed.",
      "type": "procedural",
      "date": "1948-08-26",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Along with the guardian petition, Manorama filed an application seeking permission of the court to raise a loan of Rs. 7,000/- by mortgaging the two houses.",
      "type": "procedural",
      "date": "1948-08-26",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "On September 9, 1948, the Court passed an order appointing Manorama as the guardian of the person and property of the minor son and daughters and granted her permission to raise a loan of Rs. 7,000/- by mortgaging the two houses.",
      "type": "procedural",
      "date": "1948-09-09",
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "On September 24, 1948, Manorama borrowed Rs. 7,000/- by mortgaging the two houses on the basis of the court orders.",
      "type": "material",
      "date": "1948-09-24",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "On January 19, 1950, Manorama filed another application seeking permission of the High Court to raise a loan of Rs. 40,000/- on the security of the two houses.",
      "type": "procedural",
      "date": "1950-01-19",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "On January 23, 1950, the application was allowed under s. 29 of the Act permitting her to raise a loan of Rs. 30,000/- on the security of the two houses belonging to the minor.",
      "type": "procedural",
      "date": "1950-01-23",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "On March 4, 1950, Manorama borrowed Rs. 30,000/- from the trustees of Shri Chandre Prabhuji Jain Temple (appellants) by executing a mortgage of the two houses.",
      "type": "material",
      "date": "1950-03-04",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "On April 24, 1950, Manorama applied to the Court for raising a further loan of Rs. 15,000/- on the security of the two houses but sanction was accorded to raise a loan of only Rs. 10,000/-",
      "type": "procedural",
      "date": "1950-04-24",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "On May 31, 1950, Manorama borrowed a further sum of Rs. 10,000/- from the appellants by executing a mortgage on the same properties.",
      "type": "material",
      "date": "1950-05-31",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Manorama filed an application praying for permission to sell one of the houses to discharge the amount due to the appellants under the two mortgages. Permission was granted and the Indian Bank Limited purchased one house for Rs. 41,500/- but later sought to set aside the sale upon learning of the will.",
      "type": "procedural",
      "source": "court"
    },
    {
      "id": "f14",
      "text": "When the existence of the will was brought to the notice of the Court, Krishnaswami Nayudu, J. directed the Administrator-General to take immediate possession of the estate of Raju and to apply for Letters of Administration.",
      "type": "procedural",
      "source": "lower_court"
    },
    {
      "id": "f15",
      "text": "The Administrator-General obtained Letters of Administration and took possession of the estate.",
      "type": "procedural",
      "source": "court"
    },
    {
      "id": "f16",
      "text": "The Administrator-General, after obtaining court sanction, put up one of the houses for sale. The Indian Bank purchased it for Rs. 39,200/-. The sale proceeds are being retained by the Administrator-General.",
      "type": "material",
      "source": "court"
    },
    {
      "id": "f17",
      "text": "The appellants filed the suit on the original side of the High Court to recover the money due under the two mortgages executed by Manorama as guardian.",
      "type": "procedural",
      "source": "petitioner"
    },
    {
      "id": "f18",
      "text": "Respondents (Administrator-General and minor son) contended that Manorama had no authority to execute the mortgages, obtained sanctions by fraud on the court, appellants did not act with due care, sanctions were only prima facie evidence, enquiry was summary, and sanctions invalid as will not disclosed.",
      "type": "disputed",
      "source": "respondent"
    },
    {
      "id": "f19",
      "text": "Balakrishna Ayyar, J. held orders obtained by fraud but voidable, appellants not parties to fraud, not required to go behind orders, entitled to recover from mortgaged properties, passed preliminary decree.",
      "type": "procedural",
      "source": "lower_court"
    },
    {
      "id": "f20",
      "text": "Respondents appealed, referred to Full Bench on whether order under s. 31/32 conclusive proof of necessity/benefit.",
      "type": "procedural",
      "date": "1961-12-01",
      "source": "lower_court"
    },
    {
      "id": "f21",
      "text": "Full Bench held order under s. 31/32 substitute for alienee's enquiry but minor can show alienee not bona fide or on notice of defects; if no suspicion, alienee relies on it; not always conclusive; if alienee knew more or independent enquiry, onus on minor; if no fraud knowledge, can rely; orders valid despite will appointment; mortgages enforceable only against one half as guardian only for that half; decree for recovery from one-half.",
      "type": "procedural",
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the orders sanctioning mortgages under the Guardians and Wards Act were valid given suppression of the will appointing Manorama as guardian with restrictions on alienation.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether Manorama was appointed guardian only of one-half share in the properties.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether appellants entitled to enforce mortgages against entire properties despite invalid sanctions.",
      "framed_by": "court"
    },
    {
      "id": "i4",
      "text": "Effect of order under s. 31/32 of the Act on alienee's title.",
      "framed_by": "lower_court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Finding that mortgages valid only for one half incorrect; Manorama appointed guardian of person and properties of minor; statement in application about half shares does not conclude limited appointment; guardian appointed for all properties, not specific items; s.16 makes certificate conclusive.",
      "supporting_facts": [
        "f4",
        "f6",
        "f8",
        "f9"
      ],
      "legal_basis": "Guardians and Wards Act, s.16"
    },
    {
      "id": "pa2",
      "text": "High Court of Madras had inherent jurisdiction to appoint guardian and sanction alienation apart from Act provisions.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": "s.3 Guardians and Wards Act; In re Mahadev Krishna Rupji; Raja of Vizianagaram v. Secretary of State"
    },
    {
      "id": "pa3",
      "text": "Respondents cannot impugn validity of sanctions as no appeal from decree for half-share.",
      "supporting_facts": [
        "f19",
        "f21"
      ],
      "legal_basis": null
    },
    {
      "id": "pa4",
      "text": "Orders voidable, not void; appellants bona fide.",
      "supporting_facts": [
        "f10",
        "f12"
      ],
      "legal_basis": "s.30 Guardians and Wards Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Manorama had no authority to execute mortgages; obtained sanctions by fraud (suppressing will); appellants did not act with due care; sanctions prima facie only, do not cure defects; summary enquiry; invalid as will not disclosed.",
      "supporting_facts": [
        "f2",
        "f4",
        "f14"
      ],
      "legal_basis": "Guardians and Wards Act, ss.28,29,31/32"
    },
    {
      "id": "ra2",
      "text": "Order under s.31/32 not conclusive if alienee on notice of defects or not bona fide.",
      "supporting_facts": [
        "f21"
      ],
      "legal_basis": "Guardians and Wards Act, s.31/32"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Orders appointing guardian and sanctioning mortgages did not limit to half-share; order clear on face, no limitation visible; court no enquiry into extent; sanctions authorized mortgaging entire properties.",
      "addresses_issue": "i2",
      "key_observation": "Judged by orders read with appointment order."
    },
    {
      "id": "cr2",
      "text": "Manorama guardian under will with restrictions; no application under s.28; court not apprised of will; no order removing restrictions; sanctions under s.29/31 invalid as s.29 not applicable to testamentary guardian.",
      "addresses_issue": "i1",
      "key_observation": "s.28 requires court apprised of will restrictions."
    },
    {
      "id": "cr3",
      "text": "Inherent powers do not override s.28 principle; s.28 salutary for parental jurisdiction.",
      "addresses_issue": "pa2",
      "key_observation": "Principle of s.28 binds even inherent powers."
    },
    {
      "id": "cr4",
      "text": "Will appointed Manorama guardian of property too, as powers to manage with restrictions indicate.",
      "addresses_issue": "i1",
      "key_observation": "Entire document determines scope."
    },
    {
      "id": "cr5",
      "text": "Respondents can urge invalidity of sanctions in response to appeal seeking more relief; not barred as supporting their decree portion.",
      "addresses_issue": "pa3",
      "key_observation": "Rule from Venkata Rao v. Satyanarayanamurthy."
    },
    {
      "id": "cr6",
      "text": "Disposals under ss.28/29 contravention voidable per s.30; appellants bona fide; but to avoid sanctions in defence, restitution required.",
      "addresses_issue": "i3",
      "key_observation": "Condition restitution for setting aside."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Sanctions invalid as not under s.28, s.29 inapplicable to testamentary guardian, fraud in suppression.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Guardian appointment and sanctions cover entire properties, not limited to half.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h3",
      "text": "Appellants entitled to decree for mortgage amounts as charge on sale proceeds of one property and entire interest in other, with restitution.",
      "resolves_issue": "i3",
      "in_favor_of": "partial"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "In re Mahadev Krishna Rupji",
      "citation": "T. L. R. 1937 Bom. 432",
      "treatment": "referred",
      "relevance": "High Court inherent power to appoint guardian for undivided share despite Act."
    },
    {
      "case_name": "The Raja of Vizianagaram v. The Secretary of State for India in Council",
      "citation": "T. L. R. 1937 Mad. 383",
      "treatment": "referred",
      "relevance": "High Court jurisdiction under Letters Patent cl.17 not affected by Act, saved by s.3."
    },
    {
      "case_name": "In the matter of Sirsh Chander Singh and Others",
      "citation": "21 1894 I. L. R. Calcutta 206",
      "treatment": "followed",
      "relevance": "Scope of guardian appointment from entire document."
    },
    {
      "case_name": "Management of Itakhoolie Tea Estate v. its workmen",
      "citation": "A. I. R. 1960 S. C. 1349",
      "treatment": "referred",
      "relevance": "Whether respondent can urge plea imperilling decree in appellant's appeal."
    },
    {
      "case_name": "Venkata Rao v. Satyanarayanamurthy",
      "citation": "I. L. R. 1944 Mad. 147",
      "treatment": "followed",
      "relevance": "Respondent can urge contention against appellant's further relief."
    },
    {
      "case_name": "Parshotam Das V. Nazir Husain",
      "citation": "54 I. C. 846",
      "treatment": "followed",
      "relevance": "Restitution condition for setting aside voidable alienation."
    },
    {
      "case_name": "Peria Karuppan Chetty v. Kandasamy Chetty",
      "citation": "1933 Mad. W. N. 791",
      "treatment": "followed",
      "relevance": "Restitution for contravention of ss.28/29."
    },
    {
      "case_name": "Abbas Husain v. Kiran Shashi Devi",
      "citation": "A. I. R. 1942 Nag. 12",
      "treatment": "followed",
      "relevance": "Restitution condition."
    }
  ],
  "statutes_cited": [
    {
      "name": "Guardians and Wards Act, 1890",
      "sections": [
        "7",
        "10",
        "16",
        "28",
        "29",
        "30",
        "31",
        "32",
        "4(2)"
      ],
      "relevance": "Appointment of guardian, permissions for alienation, restrictions for testamentary guardians, voidable transactions."
    },
    {
      "name": "Civil Procedure Code",
      "sections": [
        "Order 41, rule 33"
      ],
      "relevance": "Appellate court power to pass decree as justice requires."
    }
  ],
  "outcome": {
    "disposition": "partially_accepted",
    "summary": "Appeal allowed; High Court decree set aside; decree passed directing respondents to pay appellants principal under two mortgages with 6% interest from June 1, 1950; charge on sale proceeds of one property retained by Administrator-General and entire interest in other property.",
    "relief_granted": "Decree for recovery of Rs.40,000 principal + interest as charge on specified properties/proceeds.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The principle underlying s. 28 is that when a guardian is appointed under a will and his powers are expressly restricted by that instrument, the court must be apprised of the will and of the restrictions on his powers imposed by the testator.",
      "speaker": "court",
      "significance": "Core reason for invalidity of sanctions."
    },
    {
      "text": "As condition for setting aside a disposal of immovable property made in contravention of s. 28 or s. 29 which is voidable under s. 30, it is just that there must be restitution of the benefits received.",
      "speaker": "court",
      "significance": "Basis for granting relief to bona fide appellants."
    }
  ],
  "_case_id": "1973_203",
  "_label": 1,
  "_text_length": 26913,
  "_extracted_at": "2026-02-10T20:12:18.127493"
}