{
  "metadata": {
    "case_name": "Khashaba Maruti Shelke v. State",
    "case_year": 1972,
    "court": "Supreme Court of India",
    "judges": [
      "KHANNA, J."
    ],
    "case_number": "Criminal Appeal No. 223 of 1972",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant Khashaba Maruti Shelke, aged 33, wanted in two murder cases of 1962 and 1966, absconding since 1962.",
      "type": "background",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f2",
      "text": "From March 1967 to May 1971, Sub Inspector Ramchandra Mardur (PW 58) posted in Sangli District to trace absconding accused including appellant.",
      "type": "background",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f3",
      "text": "On July 24, 1970, informant told Sub Inspector Kumbhar that appellant, resident of village Kameri, present in village Kavathe-Piran, Sangli District.",
      "type": "material",
      "date": "1970-07-24",
      "source": "prosecution"
    },
    {
      "id": "f4",
      "text": "On July 25, 1970, Head Constable Naik (PW 18) and others saw appellant in Kavathe-Piran carrying gun and bandoleer with cartridges.",
      "type": "material",
      "date": "1970-07-25",
      "source": "prosecution"
    },
    {
      "id": "f5",
      "text": "On July 26, 1970, at 9 p.m., police party of 30 armed constables and tear gas squad reached outskirts of Kavathe-Piran.",
      "type": "procedural",
      "date": "1970-07-26",
      "source": "prosecution"
    },
    {
      "id": "f6",
      "text": "Appellant fired at Jaising Patil (PW 21) at his house and ran away.",
      "type": "material",
      "date": "1970-07-26",
      "source": "prosecution"
    },
    {
      "id": "f7",
      "text": "Police party split; group led by Sub Inspector Mardur (including Head Constable Yesade, Naik (PW 18), Lavate (PW 55), constables Madane (PW 30), Huzare (PW 29), Savant (PW 47), Havaldar (PW 44), Pimpri (PW 45)) went to Ananda's house.",
      "type": "material",
      "date": "1970-07-26",
      "source": "prosecution"
    },
    {
      "id": "f8",
      "text": "Head Constable Lavate watched back door. Mardur called Ananda from cattle shed; door closed inside. Ananda said only mother inside, but footsteps and whispering heard.",
      "type": "material",
      "date": "1970-07-26",
      "source": "prosecution"
    },
    {
      "id": "f9",
      "text": "Mardur kicked open door; firing sound from inside. Mardur flashed torch, Yesade entered room, explosion occurred with flames.",
      "type": "material",
      "date": "1970-07-26",
      "source": "prosecution"
    },
    {
      "id": "f10",
      "text": "Mardur injured, returned to shed, ordered police to fire two rounds. Firing from inside heard. Mardur sheltered behind wall, directed stop firing.",
      "type": "material",
      "date": "1970-07-26",
      "source": "prosecution"
    },
    {
      "id": "f11",
      "text": "Lavate saw one man emerge from back door and escape; another man escaped.",
      "type": "material",
      "date": "1970-07-26",
      "source": "prosecution"
    },
    {
      "id": "f12",
      "text": "SP Krishnan arrived, sent injured to hospital, burst tear gas. Ananda and one other came out. SP found Yesade injured in room adjoining cattle shed; Yesade died soon. Balkabai (Ananda's mother, 70) found dead in room.",
      "type": "material",
      "date": "1970-07-26",
      "source": "prosecution"
    },
    {
      "id": "f13",
      "text": "On July 27, 1970, at 9 a.m., Head Constable Naik lodged report Ex. 52.",
      "type": "procedural",
      "date": "1970-07-27",
      "source": "prosecution"
    },
    {
      "id": "f14",
      "text": "Appellant and Ramchandra entered Appa Kesre's (PW 23) house around 11-11:30 p.m. on July 26, disclosed identity, asked not to make noise, concealed themselves.",
      "type": "material",
      "date": "1970-07-26",
      "source": "prosecution"
    },
    {
      "id": "f15",
      "text": "Appellant and Ramchandra apprehended from Kesre's house at 1:30 p.m. on July 27; appellant had abrasions and blood-stained underwear taken into possession.",
      "type": "material",
      "date": "1970-07-27",
      "source": "prosecution"
    },
    {
      "id": "f16",
      "text": "Investigation: Tiles removed from roof of Ananda's house; .303 rifle (butt broken) found dangling; three empty cartridges; iron pin found.",
      "type": "material",
      "date": "1970-07-27",
      "source": "prosecution"
    },
    {
      "id": "f17",
      "text": "Senior Inspector of Explosives Birendranath De (PW 53) examined on July 30, 1970; concluded hand-grenade exploded, service origin, fragmentation type, manufactured 1964.",
      "type": "material",
      "date": "1970-07-30",
      "source": "prosecution"
    },
    {
      "id": "f18",
      "text": "Post-mortem by Dr. Govind Jathar (PW 48) on July 27: Yesade (45) had 3 lacerated wounds, abrasions, metal piece from chest, aorta punctured, caused by hard blunt substance with velocity, no bullet injury. Balkabai had 12 lacerated wounds, abrasions, blackening, caused by explosion material.",
      "type": "material",
      "date": "1970-07-27",
      "source": "prosecution"
    },
    {
      "id": "f19",
      "text": "Dr. Chokakakar (PW 52) examined Mardur (5 dangerous injuries), constables Madane, Huzare, Savant, Havaldar, More: injuries from explosion. Appellant had 7 abrasions from hard blunt substance. Ananda had 4 punctured wounds from splinters.",
      "type": "material",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f20",
      "text": "Appellant separately convicted on August 23, 1971 under s.307 IPC, s.25/27 Arms Act for firing at Jaising.",
      "type": "procedural",
      "date": "1971-08-23",
      "source": "court"
    },
    {
      "id": "f21",
      "text": "Appellant's plea: Left village fearing Shankar Bhima Patil (relation of murder accused against whom appellant's father testified); injuries from police apprehension in field at noon July 27.",
      "type": "disputed",
      "date": "1970-07-27",
      "source": "petitioner"
    },
    {
      "id": "f22",
      "text": "Sessions Judge convicted appellant under various sections including 302 IPC (death for Yesade and Balkabai), 307, 333, 332 IPC, Arms Act, Explosive Substances Act; acquitted others including Ananda, Ramchandra.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f23",
      "text": "Bombay High Court affirmed Sessions Judge on appeal and reference, dated February 10-11, 1972.",
      "type": "procedural",
      "date": "1972-02-10",
      "source": "lower_court"
    },
    {
      "id": "f24",
      "text": "Appellant accompanied by Ramchandra, Mane, Shankar, Sadashiv on night of occurrence.",
      "type": "material",
      "date": "1970-07-26",
      "source": "prosecution"
    },
    {
      "id": "f25",
      "text": "Appellant's brother Jallandar employed in army, untraceable since July 26, 1970.",
      "type": "background",
      "date": "1970-07-26",
      "source": "respondent"
    },
    {
      "id": "f26",
      "text": "Police entries Ex.139, Ex.162: intelligence that appellant carried hand-grenade.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f27",
      "text": "No bullet injuries on deceased or injured; FIR by Naik (Ex.52) mentions firing and tear gas, no hand-grenade.",
      "type": "admitted",
      "date": "1970-07-27",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the appellant possessed the hand-grenade and exploded it, causing deaths of Head Constable Yesade and Smt. Balkabai, and injuries to Sub Inspector Mardur and others.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Denial simpliciter; left village fearing Shankar Bhima Patil; injuries from police apprehension.",
      "supporting_facts": [
        "f21"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Circumstantial evidence: absconding in murders; seen with gun/cartridges July 25; fired at Jaising; sought shelter post-explosion; abrasions and blood on underwear; brother in army (grenade service origin); police intelligence of grenade possession.",
      "supporting_facts": [
        "f1",
        "f4",
        "f6",
        "f14",
        "f15",
        "f25",
        "f26"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Hand-grenade explosion and resulting injuries/deaths undisputed, but no direct evidence appellant possessed or exploded it.",
      "addresses_issue": "i1",
      "key_observation": "Crucial question: appellant's possession and explosion of grenade."
    },
    {
      "id": "cr2",
      "text": "Circumstances (absconding, gun sighting, firing at Jaising, shelter-seeking, abrasions/blood) do not prove appellant exploded grenade; companions (Ramchandra, Mane, Shankar, Sadashiv) present, any could have.",
      "addresses_issue": "i1",
      "key_observation": "Possibility others exploded it not ruled out."
    },
    {
      "id": "cr3",
      "text": "Brother's army link and police entries (Ex.139,162) insufficient; no direct witness to grenade possession.",
      "addresses_issue": "i1",
      "key_observation": "Entries hearsay, no substantive evidence."
    },
    {
      "id": "cr4",
      "text": "Prior conviction for firing at Jaising under s.307, Arms Act bars double conviction for same rifle/cartridges; no bullet injuries anyway.",
      "addresses_issue": "i1",
      "key_observation": "No injury from rifle to deceased/injured."
    },
    {
      "id": "cr5",
      "text": "FIR no mention of grenade; police surprise explains omission. Inmates of Ananda's house (potential witnesses) arraigned as accused, not examined.",
      "addresses_issue": "i1",
      "key_observation": "Lack of direct evidence unfortunate but fatal."
    },
    {
      "id": "cr6",
      "text": "Circumstantial evidence must be conclusive, exclude other hypotheses; chain must not leave reasonable doubt; if two plausible inferences, benefit to accused. Here, does not satisfy for capital offence.",
      "addresses_issue": "i1",
      "key_observation": "Evidence admits rational explanation of others' guilt."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Case not proved beyond reasonable doubt; circumstantial evidence insufficient to conclusively prove appellant exploded hand-grenade.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "302/34",
        "307/34",
        "324/34",
        "333/34",
        "332",
        "149",
        "307"
      ],
      "relevance": "Charges for murder, attempt to murder, causing grievous hurt; convictions under 302, 307, 333, 332 set aside"
    },
    {
      "name": "Arms Act",
      "sections": [
        "25",
        "27"
      ],
      "relevance": "Possession of arms; prior conviction stands, no double jeopardy for same rifle/cartridges"
    },
    {
      "name": "Explosive Substances Act",
      "sections": [
        "3",
        "4",
        "5",
        "6"
      ],
      "relevance": "Charges for possession/use of explosive; convictions set aside due to lack of proof"
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Supreme Court allowed the appeal by special leave, set aside convictions and sentences under IPC ss.302,307,333,332, Arms Act ss.25/27 (beyond prior case), and Explosive Substances Act; case not proved beyond reasonable doubt.",
    "relief_granted": "Acquittal on all charges in this case",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "We have heard... and are of the view that the case has not been proved against the appellant beyond all reasonable doubt.",
      "speaker": "court",
      "significance": "Core holding of acquittal"
    },
    {
      "text": "In order to base the conviction of an accused on circumstantial evidence the court must be certain that the circumstantial evidence is of such a character as is consistent only with the guilt of the accused.",
      "speaker": "court",
      "significance": "Principles for circumstantial evidence convictions"
    },
    {
      "text": "If two inferences are possible from the circumstantial evidence, one pointing to the guilt of the accused, and the other, also plausible, that the commission of the crime was the act of someone else, the circumstantial evidence would not warrant the conviction of the accused.",
      "speaker": "court",
      "significance": "Reason for giving benefit of doubt"
    }
  ],
  "_case_id": "1973_177",
  "_label": 1,
  "_text_length": 21495,
  "_extracted_at": "2026-02-10T20:12:15.001142"
}