{
  "metadata": {
    "case_name": "State of Bihar v. Bhagirath Sharma and Radhey Shyam Sharma",
    "case_year": 1970,
    "court": "Supreme Court of India",
    "judges": [
      "DUA, J."
    ],
    "case_number": "Criminal Appeal No. 7 of 1970",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Proprietor of M/s. Auto Spare, Law Road, Gaya, not properly maintaining account of Motor Tyres with motive of withholding supply to genuine customers.",
      "type": "background",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f2",
      "text": "On May 22, 1969, Shri Ram Nivas Singh, Marketing Officer, Gaya, with two Supply Inspectors, made surprise inspection of the firm and found irregularities including failure to display price list and stock position of Motor Tyres (contravention of clause 4), and huge stock of 487 Motor Tyres stored in inner portion of shop.",
      "type": "material",
      "date": "1969-05-22",
      "source": "prosecution"
    },
    {
      "id": "f3",
      "text": "Prima facie case against partners Bhagirath Sharma and Radhey Shyam Sharma for contravention of clauses 3, 4 and 5 of the Bihar Essential Commodities (other than Foodgrains) Prices and Stocks Display and Control Order, 1967.",
      "type": "disputed",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f4",
      "text": "Complaint filed on May 23, 1969 in Court of Sub-Divisional Magistrate, Gaya.",
      "type": "procedural",
      "date": "1969-05-23",
      "source": "prosecution"
    },
    {
      "id": "f5",
      "text": "Sub-Divisional Officer, Sadar, Gaya took cognizance under S. 7 of Essential Commodities Act and transferred case to Shri N. N. Singh, Munsif Magistrate, 1st Class, Gaya.",
      "type": "procedural",
      "date": "1969-05-23",
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "Respondents filed revision under ss. 439/561-A Cr.P.C. in Patna High Court against Magistrate's order.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f7",
      "text": "Patna High Court Single Judge on August 14, 1969 quashed prosecution, following earlier Single Bench decision dated April 20, 1969 in Criminal Misc. Case No. 1479 of 1968, holding item No. 1 of Schedule I does not cover Motor Tyres and Tubes; item No. 5 also does not cover them.",
      "type": "procedural",
      "date": "1969-08-14",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Schedule I item No. 1: 'Component parts and accessories of automobiles.' Item No. 5: 'Cycle tyres and tubes, including cycle rickshaw tyres and tubes.'",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Bihar Government Gazette Notification No. G.S.R. 82 dated September 18, 1970 added item No. 11: 'Tyres and tubes of cars, buses, jeeps, vans, trucks, automobiles of any category whatsoever, tractors and tractor-trollies.'",
      "type": "background",
      "date": "1970-09-18",
      "source": "respondent"
    },
    {
      "id": "f10",
      "text": "Patna High Court granted certificate under Article 134(1)(c) on oral request without detailed reasons.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether Motor Tyres and Tubes are covered under item No. 1 'Component parts and accessories of automobiles' or item No. 5 'Cycle tyres and tubes' of Schedule I to the Bihar Essential Commodities (other than Foodgrains) Prices and Stocks Display and Control Order, 1967, as in force in May 1969.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the Order provides sufficient certainty and clarity to give fair warning that Motor Tyres and Tubes are scheduled items requiring display of price list and stock position.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Validity of certificate under Article 134(1)(c) granted by Patna High Court.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Item No. 1 'Component parts and accessories of automobiles' covers Tyres and Tubes of Motor Cars and Motor Cycles as essential component parts.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": "Bihar Essential Commodities (other than Foodgrains) Prices and Stocks Display and Control Order, 1967, Schedule I item 1"
    },
    {
      "id": "pa2",
      "text": "Earlier Patna High Court decision in Criminal Misc. Case No. 1479/1968 wrongly decided.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Item No. 1 does not cover Motor Tyres and Tubes; where intended, tyres are expressly stated (e.g., item 5 for cycle tyres).",
      "supporting_facts": [
        "f8",
        "f9"
      ],
      "legal_basis": "Earlier Patna HC decision in Criminal Misc. Case No. 1479/1968; Central Government notifications distinguishing tyres"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Drafting precedents from Central Government notifications (Jan 11, 1968 No.S.C.218; Aug 22, 1968 No. S.O. 2878; Jan 3, 1969 No. S.O. 85) indicate Motor Tyres not intended under general 'component parts and accessories'; expressly listed separately when intended.",
      "addresses_issue": "i1",
      "key_observation": "Draftsman did not intend scheduled items in May 1969 Order to cover Motor Tyres."
    },
    {
      "id": "cr2",
      "text": "Order lacks certainty and clarity for ascertainable standard of guilt; must give reasonable precise guidance and fair warning to dealers of obligations to avoid criminal liability.",
      "addresses_issue": "i2",
      "key_observation": "Fundamental principle of criminal jurisprudence requires dealer know with reasonable certainty what constitutes offence."
    },
    {
      "id": "cr3",
      "text": "Certificate under Art 134(1)(c) questionable as no substantial question of law of general importance; no indication of pending similar cases; later 1970 notification cures defect for future.",
      "addresses_issue": "i3",
      "key_observation": "Certificate not to be granted as matter of course; High Court order laconic."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Motor Tyres and Tubes not covered by Schedule I items 1 or 5 of the Order as in force in May 1969.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Legal mandate in Order not expressed with sufficient certainty to hold dealers criminally liable without fair warning.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Criminal Misc. Case No. 1479 of 1968 (Patna High Court)",
      "citation": "Judgment dated April 20, 1969",
      "treatment": "followed",
      "relevance": "Held item No. 1 does not cover Motor Tyres; Supreme Court agrees and finds it correctly decided."
    }
  ],
  "statutes_cited": [
    {
      "name": "Bihar Essential Commodities (other than Foodgrains) Prices and Stocks Display and Control Order, 1967",
      "sections": [
        "clauses 3",
        "clause 4",
        "clause 5",
        "Schedule I item 1",
        "Schedule I item 5"
      ],
      "relevance": "Prosecution for contravention; interpreted not to cover Motor Tyres due to lack of clarity."
    },
    {
      "name": "Essential Commodities Act",
      "sections": [
        "S. 7"
      ],
      "relevance": "Cognizance taken by Magistrate."
    },
    {
      "name": "Code of Criminal Procedure",
      "sections": [
        "ss. 439",
        "561-A"
      ],
      "relevance": "Revision petition in High Court quashing prosecution."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 134(1)(c)"
      ],
      "relevance": "Certificate for appeal to Supreme Court scrutinized."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal against Patna High Court order quashing prosecution dismissed; High Court justified in quashing as Order did not clearly cover Motor Tyres, no fair warning for criminal liability.",
    "relief_granted": "Prosecution quashed upheld; respondents acquitted.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"According to the fundamental principle of our criminal jurisprudence, which reflects fair play, the dealer must know with reasonable certainty and must have a fair warning as to what his obligation is...\"",
      "speaker": "court",
      "significance": "Core holding on requirement of certainty in penal statutes."
    },
    {
      "text": "\"We do not think it does unless the dealers are in a position to know with certainty that the items of Tyres and Tubes of Motor Cars are included in the scheduled items...\"",
      "speaker": "court",
      "significance": "Explains why Order fails vagueness test."
    }
  ],
  "_case_id": "1973_113",
  "_label": 0,
  "_text_length": 10808,
  "_extracted_at": "2026-02-10T20:11:34.510937"
}