{
  "metadata": {
    "case_name": "M/s. Ram Autar Lal Jain v. Bijoy Bahadur Singh & Ors.",
    "case_year": 1969,
    "court": "Supreme Court of India",
    "judges": [
      "BEG, J."
    ],
    "case_number": "Civil Appeal No. 2606 of 1969",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Ram Autar Lal Jain made an application before the Chhotanagpur Regional Transport Authority (RTA) for grant of a stage carriage permit on a particular route within the time fixed.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Before the application could be considered, Ram Autar Lal Jain died leaving one widow and two sons as his survivors, heirs and legal representatives.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Ram Autar Lal Jain's heirs formed a partnership firm called M/s. Ram Autar Lal Jain and made an application before the RTA for substitution of the firm in place of Ram Autar Lal Jain deceased.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The RTA allowed the substitution but split up the route into two parts and granted one part to the appellant (firm) and the other part to Respondent No. 4.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The matter was taken up in appeal before the State Transport Authority (STA) by four different parties.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The STA set aside the order of the RTA on grounds: (i) the route could not be split up; (ii) the parties in whose favour the permit had been given had failed to produce the vehicle within the time allowed by the RTA.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "The STA granted the permit to Mangtulal Tulshiyan without going into the question of legality of substitution of the appellant firm.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Four revision petitions were filed against the STA order; the Minister concerned remanded the case to the RTA for reconsideration after hearing all parties which had appeared before the RTA on April 23, 1965.",
      "type": "procedural",
      "date": "1965-04-23",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Mangtulal Tulshiyan challenged the Minister's remand order before the Patna High Court, which set it aside and directed the Minister to rehear only the petitioners who had filed revision petitions and not those who had not complained against the previous order before the Minister.",
      "type": "procedural",
      "date": "1968-07-01",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "The Minister granted the permit in favour of Bijoy Bahadur Singh (Respondent No. 4) on the ground that he was competent and qualified, satisfied the RTA requirement of introducing a new-comer and small operator on the route, and to break monopolies.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "The Minister rejected the appellant's application on two grounds: (i) the appellant not being an heir to Ram Autar Lal Jain, should not have been allowed to prosecute the application before the RTA; (ii) the appellant did not satisfy the criterion of being a new-comer or small operator.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "The appellant filed a writ petition before the Patna High Court, which was summarily dismissed.",
      "type": "procedural",
      "date": "1968-07-01",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Appeal to Supreme Court by certificate from Patna High Court judgment.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether, upon the death of an applicant for a stage carriage permit before his application has been considered by the Regional Transport Authority, the heirs or legal representatives of the applicant have the right to step into the shoes of the deceased applicant and prosecute the application filed by him before the Regional Transport Authority.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Relied on observations in Dhani Devi v. Sant Bihari Ors. that on death of applicant before final disposal, RTA has power to substitute person succeeding to possession of vehicles.",
      "supporting_facts": [
        "f2",
        "f3"
      ],
      "legal_basis": "Dhani Devi v. Sant Bihari Ors."
    },
    {
      "id": "pa2",
      "text": "M/s. Ram Autar Lal Jain is a new entity separate from deceased and heirs, but could prosecute as successor.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Appellant not an heir, should not have been allowed to prosecute; did not satisfy criterion of new-comer or small operator.",
      "supporting_facts": [
        "f3",
        "f11"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "No provision in Motor Vehicles Act, 1939 for succession to applicant's right to prosecute application; right to apply and have it considered is personal, depending on qualifications/capabilities which heirs may not have.",
      "addresses_issue": "i1",
      "key_observation": "Neither Act nor rules provide for substitution of heirs; cannot import such provision."
    },
    {
      "id": "cr2",
      "text": "Dhani Devi case distinguished: applied where applicant possessed vehicles (covered by Section 61(2)); here no vehicles, so no succession to application.",
      "addresses_issue": "i1",
      "key_observation": "Ratio of Dhani Devi limited to cases with vehicle possession; permit becomes property right attached to business."
    },
    {
      "id": "cr3",
      "text": "Order XXII CPC and Section 306 Indian Succession Act have no application.",
      "addresses_issue": "i1",
      "key_observation": "Personal qualifications key to permit claims; difficult to conceive succession."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Heirs or legal representatives have no right to prosecute deceased applicant's stage carriage permit application before RTA upon his death before consideration.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Dhani Devi v. Sant Bihari Ors.",
      "citation": "1969 2 S.C.R. 507",
      "treatment": "distinguished",
      "relevance": "Distinguished as it concerned applicant in possession of vehicles under Section 61(2); not applicable without vehicles."
    }
  ],
  "statutes_cited": [
    {
      "name": "Motor Vehicles Act, 1939",
      "sections": [
        "Chapter IV",
        "Section 61(2)"
      ],
      "relevance": "Confers right to apply and have application considered; no provision for succession to application; Section 61(2) allows transfer post-permit with vehicles."
    },
    {
      "name": "Code of Civil Procedure, 1908",
      "sections": [
        "Order XXII"
      ],
      "relevance": "No application to permit applications."
    },
    {
      "name": "Indian Succession Act, 1925",
      "sections": [
        "Section 306"
      ],
      "relevance": "No application to permit applications."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal is dismissed as there is no right for heirs to prosecute the deceased applicant's permit application; no need to decide if firm is separate entity.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The principal question that has arisen for determination in this appeal is whether, upon the death of an applicant for a stage carriage permit before his application has been considered by the Regional Transport Authority, the heirs or legal representatives of the applicant have the right to step into the shoes of the deceased applicant...",
      "speaker": "court",
      "significance": "Frames the core legal issue."
    },
    {
      "text": "Probably it was for this reason that neither the Motor Vehicles Act nor the rules made thereunder provide for the substitution of heirs to prosecute the application of a deceased claimant for a permit.",
      "speaker": "court",
      "significance": "Explains absence of statutory provision and personal nature of right."
    },
    {
      "text": "We are inclined to think that in the case of death of the applicant before the final disposal of his application for the grant of a permit in respect of his vehicles the Regional Transport Authority has power to substitute the person succeeding to the possession of the vehicles...",
      "speaker": "court",
      "significance": "Quote from Dhani Devi case distinguished by the court."
    }
  ],
  "_case_id": "1973_317",
  "_label": 0,
  "_text_length": 9440,
  "_extracted_at": "2026-02-10T20:12:49.694804"
}