{
  "metadata": {
    "case_name": "Plaintiffs-Appellants v. Abdul Karim & Ors.",
    "case_year": 1967,
    "court": "Supreme Court of India",
    "judges": [
      "Sarkaria, J."
    ],
    "case_number": "Civil Appeal No. 1759 of 1967",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Plaintiffs-appellants instituted suit on 30-6-1956 in Court of Subordinate Judge, Samastipur for declaration of title and possession of pucca house in Plot No. 216, Ward III of Samastipur Municipality.",
      "type": "procedural",
      "date": "1956-06-30",
      "source": "petitioner"
    },
    {
      "id": "f2",
      "text": "Abdul Karim (Def. No. 1) purchased house in name of wife Mst. Hakimunnissa by registered sale-deed dated 10-5-1941 from Abdul Motilib for Rs. 4300/- out of his own funds; alleged benami.",
      "type": "disputed",
      "date": "1941-05-10",
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "After purchase, Defendant No.1 executed two mortgage deeds dated 6-1-1948 and 28-7-1948 in favour of son-in-law Abdul Latif (Defendant No. 3), husband of Mst. Bibi Hazra (Defendant No. 2).",
      "type": "material",
      "date": "1948-01-06",
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "Abdul Karim agreed to sell house to Plaintiff No. 1 for Rs. 20,000/-; Plaintiff No. 1 paid Rs. 10,209-4-0 by installments; Rs. 2,990-12-0 left with Plaintiff No. 2 for mortgage debts of Rs. 6,800/-; balance paid in cash at registration of sale-deed on 25-5-1951.",
      "type": "material",
      "date": "1951-05-25",
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "Plaintiff No. 2 got house mutated in Municipal records in her favour.",
      "type": "material",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "Defendants Nos. 1 to 3 continued in illegal possession despite sale.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "Defendant No. 1 admitted sale deed dated 25-5-1951 but pleaded without consideration; asserted house purchased by him, Mst. Hakimunnissa benamidar.",
      "type": "admitted",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "Mst. Bibi Hazra (Def. No. 2) pleaded house purchased by mother Mst. Hakimunnissa with own money; on death in 1944, inherited 12 annas share; 4 annas to Def. No. 1 per Mohammedan Law; sale deed dated 25-5-1951 fictitious and collusive qua her share.",
      "type": "disputed",
      "date": "1944",
      "source": "respondent"
    },
    {
      "id": "f9",
      "text": "Trial court held house belonged to Abdul Karim, Mst. Hakimunnissa benamidar in Ex. D/1; sale to Plaintiff No. 2 valid, genuine, for consideration; decreed suit.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "High Court in First Appeal No. 619 of 1958 reversed trial court; held plaintiffs failed to prove Mst. Hakimunnissa benamidar in Ex. D/1 dated 10-5-1941; dismissed suit re 12 annas share of Bibi Hazra; decreed joint possession of 4 annas share of Def. No. 1.",
      "type": "procedural",
      "date": "1962-10-31",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Abdul Karim had two kathas ancestral land, tailoring shop with capital Rs. 1000-1500, no accounts, six family members, rental Rs. 12/month.",
      "type": "background",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f12",
      "text": "Mst. Hakimunnissa had means; first husband and son Moktadi well-to-do; Moktadi had big shop.",
      "type": "background",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f13",
      "text": "Sale-deed C-1/11 dated 1-4-1942 by Mst. Hakimunnissa selling another house; recited incurred debts to purchase disputed house.",
      "type": "material",
      "date": "1942-04-01",
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Mst. Hakimunnissa was Pardanishin lady.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f15",
      "text": "House rented to Abdul Karim by Abdul Motlib before purchase; previous mortgage by Hakimunnissa dated 13-9-1940 from Abdul Motlib.",
      "type": "background",
      "date": "1940-09-13",
      "source": "court"
    },
    {
      "id": "f16",
      "text": "In rent suit by Fakira Lal Sahu (1943), decree against Abdul Karim alone; Hakimunnissa's claim to house dismissed on 22-11-1943 as benamidar; appeal dismissed 21-2-1944.",
      "type": "background",
      "date": "1943-11-22",
      "source": "court"
    },
    {
      "id": "f17",
      "text": "Municipal receipt Ex. A-11 in name of Mst. Hakimunnissa for platform tax on disputed house.",
      "type": "material",
      "date": null,
      "source": "respondent"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the sale-deed Ex. D/1 dated 10-5-1941 in name of Mst. Hakimunnissa was benami transaction for benefit of her husband Abdul Karim.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Mst. Hakimunnissa was benamidar of Abdul Karim in 1941 purchase; source of money from him; possession and dealings by him post-purchase; mortgages by him; previous order finding benami; recitals in Ex. D/1.",
      "supporting_facts": [
        "f2",
        "f3",
        "f11",
        "f14",
        "f15",
        "f16"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Sale to Plaintiff No. 2 valid and for consideration.",
      "supporting_facts": [
        "f4",
        "f5"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Mst. Hakimunnissa real purchaser with own funds; had means; Abdul Karim financially incapable; sale to plaintiffs fictitious qua her 12 annas share.",
      "supporting_facts": [
        "f8",
        "f11",
        "f12",
        "f13",
        "f17"
      ],
      "legal_basis": "Mohammedan Law (succession)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Burden on person alleging benami to prove strictly by legal evidence or circumstances unerringly raising inference; indicia include source of money (most important), possession, motive, relationship, custody of deeds, conduct.",
      "addresses_issue": "i1",
      "key_observation": "Essence of benami is intention; apparent purchaser has initial presumption."
    },
    {
      "id": "cr2",
      "text": "Source of money: Abdul Karim admitted poor finances, unable to pay Rs. 4300; Hakimunnissa had means per evidence including recital in 1942 deed ante litem motam.",
      "addresses_issue": "i1",
      "key_observation": "Abdul Karim did not testify money from his funds."
    },
    {
      "id": "cr3",
      "text": "Possession joint pre/post sale, immaterial; no motive for benami shown; negotiations/custody by husband as agent for Pardanishin wife.",
      "addresses_issue": "i1",
      "key_observation": "Mortgages post-controversy, suspect collusion."
    },
    {
      "id": "cr4",
      "text": "1943 order re benami in execution not res judicata, inconclusive; outweighed by other evidence; rent judgment not against Hakimunnissa.",
      "addresses_issue": "i1",
      "key_observation": "Municipal receipt strengthens ownership by Hakimunnissa."
    },
    {
      "id": "cr5",
      "text": "Plaintiffs failed to prove benami; totality of circumstances show Hakimunnissa real purchaser.",
      "addresses_issue": "i1",
      "key_observation": "Preponderating probability money from Hakimunnissa."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Plaintiffs failed to discharge burden to prove 1941 sale benami; Mst. Hakimunnissa real purchaser.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Evidence Act",
      "sections": [
        "Section 13"
      ],
      "relevance": "Admissibility of previous order as evidence of benami"
    },
    {
      "name": "Code of Civil Procedure",
      "sections": [
        "Section 47",
        "Order 21 Rule 57",
        "Order 21 Rule 103"
      ],
      "relevance": "Application in execution for claim to attached property; suit to establish right"
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court affirmed High Court judgment; held plaintiffs failed to prove benami; dismissed suit regarding 12 annas share of Bibi Hazra; allowed joint possession of 4 annas share; dismissed appeal.",
    "relief_granted": "Joint possession of 4 annas share to plaintiffs",
    "costs": "Dismissed with costs"
  },
  "key_quotes": [
    {
      "text": "It is well settled that the burden of proving that a particular sale is benami and the apparent purchaser is not the real owner, always rests on the person asserting it to be so.",
      "speaker": "court",
      "significance": "States the legal burden and standard of proof for benami transactions"
    },
    {
      "text": "The source whence the purchase money came, is by far the most important test for determining whether the sale standing in the name of one person, is in reality for the benefit of another.",
      "speaker": "court",
      "significance": "Identifies primary indicia for proving benami"
    },
    {
      "text": "Keeping in view the totality of the circumstances and the probabilities of the case, we have no hesitation in holding that the plaintiffs appellants had failed to prove that Mst. Hakimunnissa... was not the real purchaser but only a benamidar of her husband.",
      "speaker": "court",
      "significance": "Concluding finding on failure to prove benami"
    }
  ],
  "_case_id": "1973_252",
  "_label": 0,
  "_text_length": 18339,
  "_extracted_at": "2026-02-10T20:12:49.899061"
}