{
  "metadata": {
    "case_name": "Sukh Ram v. State",
    "case_year": 1970,
    "court": "Supreme Court of India",
    "judges": [
      "Dwivedi J."
    ],
    "case_number": "Criminal Appeal No. 99 of 1970",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Three persons, Mahendra Singh, Lakhan Singh and the appellant Sukh Ram, were tried for the murder of one Chunni Lal under s. 302 read with s. 34, I.P.C. by the Sessions Judge, Aligarh.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The Sessions Judge acquitted Mahendra Singh, and convicted and sentenced the remaining two (Lakhan Singh and Sukh Ram) to imprisonment for life.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f3",
      "text": "On appeal the High Court of Allahabad acquitted Lakhan Singh and affirmed the conviction and sentence of the appellant Sukh Ram.",
      "type": "procedural",
      "date": "1970-01-28",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The deceased Chunni Lal has a tea stall near the Bus Stand in Sasni. He was shot dead on 9-3-1967 at about 10-30 p.m.",
      "type": "material",
      "date": "1967-03-09",
      "source": "prosecution"
    },
    {
      "id": "f5",
      "text": "The First Information Report of the incident was lodged by Sunder Lal, a relation of the deceased.",
      "type": "procedural",
      "date": "1967-03-09",
      "source": "prosecution"
    },
    {
      "id": "f6",
      "text": "The prosecution examined Sunder Lal, Radhey Shyam, Puran Mal and Devi Prasad to prove its case against the aforesaid accused.",
      "type": "procedural",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f7",
      "text": "The Sessions Judge believed all the witnesses.",
      "type": "admitted",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "In a careful and sifting analysis of the entire evidence, the learned Judges of the High Court (S. D. Khare and Jagmohan Lal Sinha JJ.) have winnowed out all evidence which could legitimately be objected to by the appellant and have held that the remaining evidence clearly brought home the guilt to him.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "The charge framed by the Sessions Judge specifically charged Sukh Ram s/o Hari Ram, Lakhan Singh s/o Biri Singh and Mahendra Singh s/o Gulab Chand that on 9th March 1967 at about 10.30 p.m. in Sasni near bus stand at shop of Chunni Lal, in furtherance of common intention to commit murder, committed murder by one of them firing pistol, punishable under s.302/34 IPC.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "The charge does not mention that any other persons, known or unknown, were concerned in the commission of the offence.",
      "type": "disputed",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Unambiguous evidence tendered by prosecution in Sessions Court showed Chunni Lal was murdered by the appellant and two other persons, fatal shot fired by one of these two.",
      "type": "material",
      "date": "1967-03-09",
      "source": "prosecution"
    },
    {
      "id": "f12",
      "text": "The line of defence adopted by the appellant, as reflected in cross-examination of prosecution witnesses, discloses awareness on his part of the substance and true nature of allegations.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Sessions Judge while examining appellant under s.342 Cr.P.C. questioned him in regard to his participation in the crime along with his companions, not along with the two named co-accused.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "Sessions Court found: This direct evidence taken as a whole proves beyond any reasonable doubt that Sukh Ram along with two other companions had gone to Chunni Lal's shop at that time and one of his companions fired at Chunni Lal with a pistol while Chunni Lal was closing his shop.",
      "type": "admitted",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f15",
      "text": "High Court acquitted Lakhan Singh because it thought it unsafe to rely on sole testimony of Kunwarji in regard to Lakhan Singh's identification.",
      "type": "procedural",
      "date": "1970-01-28",
      "source": "court"
    },
    {
      "id": "f16",
      "text": "High Court certain that there were three culprits, appellant being one of those three.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f17",
      "text": "High Court: We are, therefore, of the opinion that it is fully established that Sukh Ram was amongst the three assailants of Chunni Lal and that the pistol was fired at Chunni Lal in furtherance of the common intention of all the three assailants.",
      "type": "admitted",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the appellant could be convicted under section 302 read with section 34, Penal Code, even though the two other accused specifically named in the charge have been acquitted.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Counsel for the appellant could number point out any infirmity in High Court's opinion on evidence, but strenuously urged that after acquittal of Mahendra Singh and Lakhan Singh, the appellant could not be convicted with the aid of s.34 I.P.C.",
      "supporting_facts": [
        "f2",
        "f3",
        "f9",
        "f10"
      ],
      "legal_basis": "s.302/34 IPC"
    },
    {
      "id": "pa2",
      "text": "Relied on Dalip Singh v. State of Punjab, Mohan Singh v. State of Punjab, Krishna Govind Patil v. State of Maharashtra.",
      "supporting_facts": [],
      "legal_basis": "Precedents: Dalip Singh (1954 SCR 145), Mohan Singh (1962 Suppl. 3 SCR 848), Krishna Govind Patil"
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "We have read the entire evidence, and we are satisfied that they have rightly found the appellant guilty of the murder of Chunni Lal.",
      "addresses_issue": "i1",
      "key_observation": "Evidence clearly brings home guilt."
    },
    {
      "id": "cr2",
      "text": "In view of the unambiguous evidence tendered by the prosecution in the Sessions Court, no prejudice can be said to have been caused to the appellant by reason of his conviction under section 302 read with section 34, even though the two other accused specifically named in the charge have been acquitted.",
      "addresses_issue": "i1",
      "key_observation": "No prejudice due to evidence and awareness in defence."
    },
    {
      "id": "cr3",
      "text": "Though the charge confines participation to three named individuals, evidence was led to show Chunni Lal was murdered by appellant and two others; heart of issue was whether evidence proved appellant and two others committed murder in pursuance of common intention.",
      "addresses_issue": "i1",
      "key_observation": "Variance between charge and evidence, but no prejudice."
    },
    {
      "id": "cr4",
      "text": "A possible prejudice to the accused, on a reasonable view of the course the trial has taken, is the true touch-stone of such matters.",
      "addresses_issue": "i1",
      "key_observation": "Examined for prejudice."
    },
    {
      "id": "cr5",
      "text": "Distinguished Dalip Singh v. State of Punjab: Not a case of mistaken identity possible; all named, no others suggested.",
      "addresses_issue": "i1",
      "key_observation": "Facts differ."
    },
    {
      "id": "cr6",
      "text": "Followed Bharwad Nepa Dana v. State of Bombay: Nothing in law prevents finding unlawful assembly consisted of convicted persons and unidentified others if evidence supports.",
      "addresses_issue": "i1",
      "key_observation": "Depends on facts and evidence."
    },
    {
      "id": "cr7",
      "text": "Facts resemble Kartar Singh v. State of Punjab: Possible to find more than required number with unidentified.",
      "addresses_issue": "i1",
      "key_observation": "Close resemblance."
    },
    {
      "id": "cr8",
      "text": "Distinguished Mohan Singh v. State of Punjab: Prosecution case limited to five named, no others; on concession, assembly reduced below required number.",
      "addresses_issue": "i1",
      "key_observation": "Facts distinguishable."
    },
    {
      "id": "cr9",
      "text": "Distinguished Krishna Govind Patil v. State of Maharashtra: Eyewitnesses deposed only four named; no evidence of others; High Court found with one or more of others.",
      "addresses_issue": "i1",
      "key_observation": "Entirely distinguishable; prosecution not case of known + unknowns."
    },
    {
      "id": "cr10",
      "text": "It is clear that notwithstanding the charge, the acquittal of Mahendra Singh and Lakhan Singh raises no bar to the conviction of the appellant under s.302/34.",
      "addresses_issue": "i1",
      "key_observation": "High Court right."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Appellant can be convicted under s.302/34 IPC despite acquittal of two other named accused, as evidence showed three assailants including appellant, no prejudice caused.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Dalip Singh v. State of Punjab",
      "citation": "1954 S.C.R. 145",
      "treatment": "distinguished",
      "relevance": "Acquittal where all named accused in FIR, no possibility of others or mistaken identity."
    },
    {
      "case_name": "Bharwad Nepa Dana v. State of Bombay",
      "citation": "1960 2 S.C.R. 172",
      "treatment": "followed",
      "relevance": "Permissible to find unlawful assembly of convicted + unidentified if evidence supports, no legal bar."
    },
    {
      "case_name": "Kartar Singh v. State of Punjab",
      "citation": "1962 2 S.C.R. 395",
      "treatment": "followed",
      "relevance": "Acquittal of named does not bar if evidence shows party had more, with unidentified possible."
    },
    {
      "case_name": "Mohan Singh v. State of Punjab",
      "citation": "1962 Suppl. 3 S.C.R. 848",
      "treatment": "distinguished",
      "relevance": "Where prosecution limited to named five, acquittal of two reduces below unlawful assembly number."
    },
    {
      "case_name": "Krishna Govind Patil v. State of Maharashtra",
      "citation": null,
      "treatment": "distinguished",
      "relevance": "Acquittal where evidence only of named four, no others suggested."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "302",
        "34",
        "149"
      ],
      "relevance": "Conviction under 302/34; comparison with 149 cases."
    },
    {
      "name": "Code of Criminal Procedure",
      "sections": [
        "342"
      ],
      "relevance": "Examination of accused."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal is dismissed. The conviction and sentence of the appellant under s.302/34 IPC affirmed by High Court upheld.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "A possible prejudice to the accused, on a reasonable view of the course the trial has taken, is the true touch-stone of such matters",
      "speaker": "court",
      "significance": "Test for validity of conviction despite acquittal of co-accused."
    },
    {
      "text": "We are, therefore, of the opinion that it is fully established that Sukh Ram was amongst the three assailants of Chunni Lal and that the pistol was fired at Chunni Lal in furtherance of the common intention of all the three assailants.",
      "speaker": "court",
      "significance": "High Court's finding on participation upheld."
    },
    {
      "text": "Nothing in law prevented the High Court from finding that the unlawful assembly consisted of the four convicted persons and some unidentified persons, who together numbered more than five.",
      "speaker": "court",
      "significance": "From Bharwad Nepa Dana, principle applied."
    }
  ],
  "_case_id": "1973_314",
  "_label": 0,
  "_text_length": 13949,
  "_extracted_at": "2026-02-10T20:12:55.675583"
}