{
  "metadata": {
    "case_name": "Appellant (Sub-Inspector of Police) v. State of Madhya Pradesh",
    "case_year": 1967,
    "court": "Supreme Court of India",
    "judges": [
      "Shelat, Acting C.J."
    ],
    "case_number": "Civil Appeal No. 1259 of 1967",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant first appointed in 1934 as a police company stable in the erstwhile State of Gwalior and promoted in March 1945 to the post of Sub-Inspector.",
      "type": "background",
      "date": "1934-03-1945",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "In May 1948, rulers of Gwalior, Indore and certain other States formed United States of Madhya Bharat under a covenant; appellant allowed to work as Sub-Inspector but entered in list of provisionally absorbed servants from May 1948.",
      "type": "background",
      "date": "1948-05",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Notification dated December 16, 1948 by Madhya Bharat Government published Retrenchment Terms, revised by notification dated July 9, 1949, laying down principles for selection of Government servants for discharge including seven categories.",
      "type": "background",
      "date": "1948-12-16 / 1949-07-09",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Retrenchment Terms categories: (1) attained superannuation age (55 superior/60 inferior); (2) consistently bad record; (3) temporary/officiating; (4) no minimum qualification; (5) 30+ years service; (6) permanent with <3 years; (7) surplus/cannot be absorbed; effective from July 1, 1948.",
      "type": "background",
      "date": "1948-07-01",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "While working at Bhilsa as Sub-Inspector, appellant received order from Deputy Inspector-General, Central Range, retrenching him for consistent bad record under category 2, with benefits of leave, pension etc.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Appellant appealed to Inspector-General of Police; IG issued notice to show cause under categories 2, 4 and 7; appellant submitted explanation.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Inspector-General rejected appeal by order dated January 2, 1954, confirmed retrenchment under categories 2, 4 and 7 (bad record, no minimum qualification, cannot be absorbed).",
      "type": "procedural",
      "date": "1954-01-02",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Appellant filed writ petition in Madhya Pradesh High Court claiming order was removal by way of punishment attracting Art. 311; dismissed on October 22, 1959 on ground of delay, but observed bad record ground required Art. 311 procedure (not followed), though category 4 not pressed by State.",
      "type": "procedural",
      "date": "1959-10-22",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "In 1960, appellant filed suit in Court of Additional District Judge, Indore for declaration that order bad under Art. 311, continued in service, and salary for entire period.",
      "type": "procedural",
      "date": "1960",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Trial Judge decreed suit relying on High Court observations in writ petition.",
      "type": "procedural",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "State appealed to Madhya Pradesh High Court (Division Bench including Krishnan, J.); High Court allowed appeal by judgment dated December 20, 1966, set aside decree, holding order valid on category 4 (no minimum qualification) as separate good ground even if category 2 invalid.",
      "type": "procedural",
      "date": "1966-12-20",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Appellant filed appeal by special leave to Supreme Court.",
      "type": "procedural",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Appellant did not possess minimum educational qualification for Sub-Inspector post.",
      "type": "admitted",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the impugned retrenchment order amounted to dismissal or removal attracting Art. 311 of the Constitution.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether the order could be sustained on category 4 (no minimum qualification) and category 7 after failure of category 2 (consistent bad record) ground.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "On construction of Retrenchment Terms, impugned order amounted to one of dismissal attracting Art. 311.",
      "supporting_facts": [
        "f5",
        "f7",
        "f8"
      ],
      "legal_basis": "Art. 311 of the Constitution"
    },
    {
      "id": "pa2",
      "text": "Ground of consistent bad record amounted to stigma, could not be relied on, so order fell and could not be sustained on second ground.",
      "supporting_facts": [
        "f7",
        "f11"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Retrenched appellant under categories 2, 4 and 7; even if category 2 unavailable, categories 4 and 7 valid and objective grounds.",
      "supporting_facts": [
        "f7",
        "f13"
      ],
      "legal_basis": "Retrenchment Terms categories 4 and 7"
    },
    {
      "id": "ra2",
      "text": "Appellant was provisionally absorbed, not yet employee; non-absorption not dismissal or removal.",
      "supporting_facts": [
        "f2",
        "f3",
        "f4"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Appellant permanent in Gwalior State but position changed on accession to Madhya Bharat; no right to absorption unless new State agreed; provisionally absorbed pending decision.",
      "addresses_issue": "i1",
      "key_observation": "No individual right under covenant; absorption process pending."
    },
    {
      "id": "cr2",
      "text": "Retrenchment Terms addressed surplus staff from acceding States, principles for non-absorption, not retrenchment of absorbed employees; categories for selection of who not to absorb.",
      "addresses_issue": "i1",
      "key_observation": "Provisional work pending absorption; non-absorption not removal/dismissal."
    },
    {
      "id": "cr3",
      "text": "Category 2 (bad record) not punishment as not yet employees; same for other categories like superannuation.",
      "addresses_issue": "i1",
      "key_observation": "Art. 311 inapplicable to non-employees."
    },
    {
      "id": "cr4",
      "text": "Appellant lacked minimum qualification (category 4), also surplus (category 7); objective tests, valid even if category 2 fails; not subjective satisfaction.",
      "addresses_issue": "i2",
      "key_observation": "Categories 4 and 7 sufficient to sustain order."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Impugned order not dismissal/removal attracting Art. 311; non-absorption of provisional employee.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Order sustainable on categories 4 and 7 as objective valid grounds.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Article 311"
      ],
      "relevance": "Art. 311 attracted only to removal/dismissal of employees; inapplicable to non-absorption of provisional surplus staff."
    },
    {
      "name": "Retrenchment Terms (Madhya Bharat Government Notifications dated Dec 16, 1948 and July 9, 1949)",
      "sections": [
        "Categories 1-7"
      ],
      "relevance": "Governed selection for non-absorption; objective criteria applied."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court dismissed the appeal, upholding High Court judgment; retrenchment order valid on categories 4 and 7 of Retrenchment Terms as non-absorption not attracting Art. 311.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"The non-absorption of persons falling in the seven categories could not, therefore, amount in law to removal or dismissal from service. They were simply not absorbed in the service of the new State and had, therefore, not yet become its employees.\"",
      "speaker": "court",
      "significance": "Core holding that Art. 311 inapplicable."
    },
    {
      "text": "\"The tests here were objective ones and if one of the several such tests failed, but the others were sufficient, the order would still have to be sustained.\"",
      "speaker": "court",
      "significance": "Explains why order upheld despite category 2 issue."
    }
  ],
  "_case_id": "1973_87",
  "_label": 0,
  "_text_length": 15903,
  "_extracted_at": "2026-02-10T20:11:36.216635"
}