{
  "metadata": {
    "case_name": null,
    "case_year": 1970,
    "court": "Supreme Court of India",
    "judges": [
      "HEGDE, J."
    ],
    "case_number": "Civil Appeal No. 1352 of 1970",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The assessee is a manufacturer of oil and purchased groundnuts in large quantity for the manufacture of oil.",
      "type": "material",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f2",
      "text": "The petitioner in his Writ Petition has definitely stated that he purchased groundnuts mostly from cultivators for the manufacture of oil.",
      "type": "admitted",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "The question of the nature of groundnut came up for consideration in connection with the levy of purchase-tax on the purchase of oilseed.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Assessing authorities levied purchase-tax treating groundnut as oilseed.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "Allahabad High Court in Special Appeal No. 94 of 1967 by judgment dated 7th August 1967 held that groundnut is oilseed.",
      "type": "procedural",
      "date": "1967-08-07",
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "Appeal to Supreme Court by certificate.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether groundnut is oilseed.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Groundnut is not oilseed.",
      "supporting_facts": [
        "f1",
        "f2"
      ],
      "legal_basis": "Commissioner of Sales Tax, Madhya Pradesh, Indore v. Bakhat Rai Co. 18 S.T.C. 285; Hans Raj Choudhri v. J.S. Rajyana, Excise and Taxation Officer 19 S.T.C. 489"
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The meaning of the term 'oilseeds' in the Sales-tax law is to be found in commercial parlance, not dictionaries.",
      "addresses_issue": "i1",
      "key_observation": "See Commissioner of Sales Tax, Madhya Pradesh, Indore v. Jaswant Singh Charan Singh 19 S.T.C. 469."
    },
    {
      "id": "cr2",
      "text": "In commercial circles groundnut is dealt with as oilseed; commercial journals and newspapers list groundnuts as one of the species of oilseeds while quoting market prices.",
      "addresses_issue": "i1",
      "key_observation": "Groundnut is treated as oilseed in commercial circles."
    },
    {
      "id": "cr3",
      "text": "A seed is one which germinates; it is not disputed that groundnut germinates, hence it is a seed.",
      "addresses_issue": "i1",
      "key_observation": "Groundnut is undoubtedly a seed."
    },
    {
      "id": "cr4",
      "text": "Groundnut is mostly used for the manufacture of groundnut oil which is used in the manufacture of Dalda and other cooking media; groundnut is one of the items mostly used in this country for the manufacture of cooking media.",
      "addresses_issue": "i1",
      "key_observation": "Groundnut is generally used for manufacture of oil."
    },
    {
      "id": "cr5",
      "text": "Allahabad High Court correctly held groundnut is oilseed; Madhya Pradesh High Court and Punjab Haryana High Court were wrong.",
      "addresses_issue": "i1",
      "key_observation": "Agree with Allahabad High Court."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Groundnut is oilseed.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Commissioner of Sales Tax, Madhya Pradesh, Indore v. Bakhat Rai Co.",
      "citation": "18 S.T.C. 285",
      "treatment": "distinguished",
      "relevance": "Cited by petitioner in support of contention that groundnut is not oilseed; not accepted as laying down law correctly."
    },
    {
      "case_name": "Hans Raj Choudhri v. J.S. Rajyana, Excise and Taxation Officer",
      "citation": "19 S.T.C. 489",
      "treatment": "distinguished",
      "relevance": "Cited by petitioner in support of contention that groundnut is not oilseed; not accepted as laying down law correctly."
    },
    {
      "case_name": "Commissioner of Sales Tax, Madhya Pradesh, Indore v. Jaswant Singh Charan Singh",
      "citation": "19 S.T.C. 469",
      "treatment": "followed",
      "relevance": "Meaning of terms in sales-tax law to be ascertained from commercial parlance."
    }
  ],
  "statutes_cited": [
    {
      "name": "Sales-tax law",
      "sections": [],
      "relevance": "Levy of purchase-tax on purchase of oilseed; interpretation of term 'oilseeds'"
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal is dismissed. The Supreme Court agrees with the Allahabad High Court that groundnut is oilseed in commercial parlance, as it germinates and is mostly used for oil manufacture. The decisions of Madhya Pradesh High Court and Punjab Haryana High Court holding otherwise are incorrect.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The only question that arises for decision is whether groundnut is oilseed.",
      "speaker": "court",
      "significance": "Frames the sole issue in the appeal."
    },
    {
      "text": "In finding out the true meaning of term oilseeds found in the Sales-tax law in question, we are not to refer to dictionaries. We are to find out the meaning ascribed to that term in commercial parlance.",
      "speaker": "court",
      "significance": "Key principle for interpreting commercial terms in tax laws."
    },
    {
      "text": "There can hardly be any doubt that in commercial circles Ground nut is dealt with as oilseed.",
      "speaker": "court",
      "significance": "Core finding on commercial treatment of groundnut."
    }
  ],
  "_case_id": "1973_39",
  "_label": 0,
  "_text_length": 3259,
  "_extracted_at": "2026-02-10T20:11:03.760385"
}