{
  "metadata": {
    "case_name": "Chairman, Hindustan Steel Limited v. Respondent",
    "case_year": 1970,
    "court": "Supreme Court of India",
    "judges": [
      "DWIVEDI, J."
    ],
    "case_number": "Criminal Appeal No. 129 of 1970",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant is the Chairman of Hindustan Steel Limited (the Company).",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Respondent was employed in the Company on a contract of service providing for termination by giving three months' notice or three months' pay in lieu thereof and without assigning any cause.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On February 21, 1968, the Company gave respondent a notice stating that his performance and conduct have not been good, he has not proved useful, advising him to vacate the position and try for alternative employment, and mentioning release on pro-rata payment under bond not exceeding Rs. 20,000/- reduced pro-rata for service rendered after training.",
      "type": "material",
      "date": "1968-02-21",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Charge sheet dated July 1, 1966 and confidential character report dated April 27, 1967 issued against respondent.",
      "type": "background",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "On May 27, 1968, respondent instituted a suit in the Court of the Second Munsif, Asansol claiming: (1) declaration that notice dated February 21, 1968 is illegal, bad, mala fide, without jurisdiction, void and inoperative; (2) declaration that charge sheet dated July 1, 1966 and confidential character report dated April 27, 1967 are ultra vires, illegal, mala fide, opposed to rules and natural justice; (3) declaration that plaintiff entitled to promotion to foreman from October 10, 1966; (4) mandatory injunction to promote to foreman; (5) permanent injunction restraining effect to notice dated February 21, 1968.",
      "type": "procedural",
      "date": "1968-05-27",
      "source": "respondent"
    },
    {
      "id": "f6",
      "text": "No interim injunction was sought or granted in the suit restraining termination of service. No undertaking given by appellant or Company to refrain from terminating service during pendency of suit.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "On February 26, 1968, the Company issued notice terminating respondent's services with effect from date of service of order and payment of three months' pay in lieu of notice in terms of clause (vi) of appointment letter dated January 29, 1962.",
      "type": "material",
      "date": "1968-02-26",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Calcutta High Court (R.N. Dutt and B. Banerji JJ.) in Criminal Misc. Case No. 179 of 1969 by judgment and order dated July 24, 1969 held that termination of services amounts to contempt of the Munsif's Court as it obstructs or interferes with due course of justice in the suit.",
      "type": "procedural",
      "date": "1969-07-24",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Appellant tendered unconditional apology in High Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "High Court accepted apology, refrained from awarding punishment, but directed appellant to pay Rs. 200/- as costs to respondent.",
      "type": "procedural",
      "date": "1969-07-24",
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether termination of respondent's service by the Company in exercise of contractual rights, during pendency of suit but in absence of interim injunction or undertaking, amounts to contempt of court.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Initiation of departmental enquiry or exercise of statutory rights bona fide during pendency of proceedings does not amount to contempt if no interim injunction or undertaking.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": "Ruka Ram Gokar v. R.N. Shukla; Jang Bahadur Singh v. Baij Nath Tewari; Malojirao Shitole v. C.G. Matkar"
    },
    {
      "id": "pa2",
      "text": "Principle extends to bona fide exercise of contractual rights; termination was honest exercise of right under service contract.",
      "supporting_facts": [
        "f2",
        "f3",
        "f7",
        "f6"
      ],
      "legal_basis": "Contractual rights"
    },
    {
      "id": "pa3",
      "text": "Termination does not threaten withdrawal of suit; respondent free to amend plaint for relief against termination; mere infructuousness of some reliefs not contempt.",
      "supporting_facts": [
        "f5",
        "f7"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Termination of services during pendency of suit amounts to obstruction or interference with due course of justice, making some reliefs infructuous.",
      "supporting_facts": [
        "f5",
        "f7"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Cited Pratap Singh v. Gurbaksh Singh and Gobind Sahai v. State of U.P. as supporting contempt.",
      "supporting_facts": [],
      "legal_basis": "Pratap Singh v. Gurbaksh Singh; Gobind Sahai v. State of U.P."
    },
    {
      "id": "ra3",
      "text": "Since unconditional apology tendered, Supreme Court should not interfere.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Bona fide exercise of statutory right during pendency of proceedings not contempt absent interim injunction or undertaking; principle extends to honest exercise of contractual rights.",
      "addresses_issue": "i1",
      "key_observation": "Rights under contract are legal rights; bona fide exercise allocates proper sphere to contempt law and contract law."
    },
    {
      "id": "cr2",
      "text": "Termination notices show honest exercise of contractual right; no contempt committed.",
      "addresses_issue": "i1",
      "key_observation": "Satisfied from combined reading of two notices that termination was honest."
    },
    {
      "id": "cr3",
      "text": "Pratap Singh and Gobind Sahai distinguishable: there no legal right to punish suitor for instituting proceedings; here contractual right to terminate existed.",
      "addresses_issue": "i1",
      "key_observation": "In those cases, no legal right to take action against suitor."
    },
    {
      "id": "cr4",
      "text": "Apology relevant only after finding of contempt; High Court erred in finding contempt.",
      "addresses_issue": "i1",
      "key_observation": "Apology goes to sentence, not liability."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Bona fide or honest exercise of a right under a contract, by a party to a suit terminating service of adversary absent interim injunction or undertaking, does not constitute contempt of court.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Ruka Ram Gokar v. R. N. Shukla",
      "citation": "1968 3 S.C.R. 422",
      "treatment": "followed",
      "relevance": "Bona fide departmental enquiry under Customs Act during criminal prosecution not contempt."
    },
    {
      "case_name": "Jang Bahadur Singh v. Baij Nath Tewari",
      "citation": "1969 1 S.C.R 134",
      "treatment": "followed",
      "relevance": "Supports bona fide statutory exercise not contempt."
    },
    {
      "case_name": "Malojirao Shitole v. C. G. Matkar",
      "citation": "1969 1 SCR 176",
      "treatment": "followed",
      "relevance": "Notification under Abolition of Jagirs Act during writ petition not contempt as bona fide statutory exercise."
    },
    {
      "case_name": "Pratap Singh v. Gurbaksh Singh",
      "citation": null,
      "treatment": "distinguished",
      "relevance": "Departmental proceedings punishing suit for going to court held contempt; no legal right to punish suitor."
    },
    {
      "case_name": "Gobind Sahai v. State of U.P.",
      "citation": null,
      "treatment": "distinguished",
      "relevance": "Expulsion from party for filing suit held contempt; no legal right to punish suitor."
    }
  ],
  "statutes_cited": [
    {
      "name": "Contract Act (implied)",
      "sections": [],
      "relevance": "Rights under contract of service enforceable; bona fide exercise not contempt."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; High Court order set aside; held no contempt committed by appellant; appellant entitled to have High Court order set aside as apology accepted only after erroneous finding of contempt.",
    "relief_granted": "High Court order of contempt and costs set aside",
    "costs": "High Court direction to pay Rs. 200/- as costs set aside"
  },
  "key_quotes": [
    {
      "text": "bonafide or honest exercise of a right under a contract should be the yardstick for allocating their respective area to contempt and it gives to each its proper sphere.",
      "speaker": "court",
      "significance": "Core holding defining boundary between contempt and contractual rights."
    },
    {
      "text": "So where a party to a suit, as here, terminates the service of the adversary party in the honest exercise of his rights under the contract of service and in the absence of any interim injunction or undertaking, his act would not constitute contempt of court.",
      "speaker": "court",
      "significance": "Direct application to facts resolving the issue."
    }
  ],
  "_case_id": "1973_359",
  "_label": 1,
  "_text_length": 10576,
  "_extracted_at": "2026-02-10T20:13:33.214709"
}