{
  "metadata": {
    "case_name": "Appellant (General Manager) v. Respondent Fire Insurance Company",
    "case_year": 1967,
    "court": "Supreme Court of India",
    "judges": [
      "MATHEW, J."
    ],
    "case_number": "Civil Appeal No. 1333 of 1967",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant appointed as Secretary of respondent Company on October 16, 1942, with pay fixed at Rs. 1,000 per month free of income tax.",
      "type": "background",
      "date": "1942-10-16",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Appellant later promoted as General Manager of the Company.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On November 21, 1953, appellant sent application for leave to Chairman of Board of Directors, but no reply received.",
      "type": "procedural",
      "date": "1953-11-21",
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "On December 16, 1953, appellant sent another application for 8 months leave.",
      "type": "procedural",
      "date": "1953-12-16",
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "Board of Directors held meeting on December 16, 1953, passing resolution to terminate appellant's services, but no notice given to Director Mr. B. P. Khaitan, who was absent.",
      "type": "disputed",
      "date": "1953-12-16",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "On December 17, 1953, appellant received telegram and registered letter from Chairman stating services terminated and to stop attending office.",
      "type": "material",
      "date": "1953-12-17",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Board of Directors meeting on December 23, 1953, confirmed minutes of December 16 meeting and ratified Chairman's action in terminating services by telegram and letter dated December 17, 1953.",
      "type": "material",
      "date": "1953-12-23",
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "Appellant instituted Suit No. 282 of 1954 for declaration that he continued as General Manager, purported termination inoperative, and claiming Rs. 37,352.30 arrears or alternatively Rs. 1,63,820 as bonus, gratuity etc.; alternatively, 18 months salary as notice period.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "Respondent Company instituted Suit No. 306 of 1954 for recovery of Rs. 1,10,000, decreed for Rs. 5,759/9/6 with proportionate costs.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f10",
      "text": "Trial court held December 16, 1953 meeting valid or ratified on December 23; services validly terminated; rules D-3 and D-4 binding, entitling appellant to only one month's notice (though 12 months if not bound).",
      "type": "admitted",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Delhi High Court by judgment dated November 25, 1966 in Regular First Appeals Nos. 89-D, 104-D, and 88-D of 1956: dismissed 88-D and 104-D, partially allowed 89-D; confirmed trial court findings.",
      "type": "procedural",
      "date": "1966-11-25",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Company rules Exhibits D-3 and D-4 govern employees, clause 6 of D-3 provides one month's notice for termination.",
      "type": "admitted",
      "date": null,
      "source": "respondent"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether services of appellant were validly terminated, given invalidity of December 16, 1953 Board meeting due to lack of notice to all Directors and effect of December 23 ratification.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether appellant entitled to 18 months (or 12 months) notice or only one month's notice under Company rules.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Meeting of Board of Directors on December 16, 1953 not properly convened as no notice given to Director Mr. B. P. Khaitan; resolution invalid; confirmation of minutes on December 23 does not adopt resolution or ratify termination.",
      "supporting_facts": [
        "f5",
        "f7"
      ],
      "legal_basis": "Article 109 of Articles of Association"
    },
    {
      "id": "pa2",
      "text": "In any event, entitled to 12 months notice before termination, as only one month given.",
      "supporting_facts": [
        "f6",
        "f10"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Chairman validly terminated services on December 17, 1953 pursuant to Board resolution of December 16, confirmed by Board on December 23, 1953.",
      "supporting_facts": [
        "f5",
        "f6",
        "f7"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Appellant bound by Company rules D-3 and D-4; entitled only to one month's notice under clause 6 of D-3.",
      "supporting_facts": [
        "f12"
      ],
      "legal_basis": "Company rules Exhibits D-3 and D-4"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Notice to all Directors essential under Article 109; no notice to Mr. Khaitan, so December 16, 1953 meeting and resolution invalid, citing Halsbury Laws of England.",
      "addresses_issue": "i1",
      "key_observation": "Meeting not duly convened; business invalid."
    },
    {
      "id": "cr2",
      "text": "Confirmation of minutes of December 16 does not adopt resolution; but Board on December 23 ratified Chairman's action (telegram/letter of December 17) purporting to act for Company; ratification relates back, validating termination on December 17.",
      "addresses_issue": "i1",
      "key_observation": "Ratification of unauthorized act on behalf of Company possible in regular meeting."
    },
    {
      "id": "cr3",
      "text": "Company rules D-3 and D-4 expressly bind all employees including appellant, who relied on them for other claims; clause 6 provides one month's notice; no need to consider reasonableness apart from rules.",
      "addresses_issue": "i2",
      "key_observation": "Rules binding; one month's notice sufficient."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Services validly terminated on December 17, 1953 upon ratification by Board on December 23, 1953.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Appellant bound by Company rules providing one month's notice for termination.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Halsbury's Laws of England",
      "citation": "Vol. 9, p. 46; Vol. 6, p. 315 article 626",
      "treatment": "referred",
      "relevance": "Notice essential to all directors for valid meeting; omission invalidates even if accidental."
    }
  ],
  "statutes_cited": [
    {
      "name": "Articles of Association of the Company",
      "sections": [
        "Article 109"
      ],
      "relevance": "Requires 72 hours notice in writing to every Director for Board meeting."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal dismissed confirming High Court decree; held termination valid due to ratification; appellant bound by rules entitling only one month's notice; no declaration of continuance as General Manager or additional claims.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "Ratification would always relate back to the date of the act ratified and so it must be held that the services of the appellant were validly terminated on December 17, 1953.",
      "speaker": "court",
      "significance": "Core holding on effect of ratification validating termination retrospectively."
    },
    {
      "text": "It is essential that notice of the meeting and of the business to be transacted should be given to all persons entitled to participate.",
      "speaker": "court",
      "significance": "Explains invalidity of December 16 meeting per Halsbury."
    }
  ],
  "_case_id": "1973_187",
  "_label": 0,
  "_text_length": 11258,
  "_extracted_at": "2026-02-10T20:12:14.981585"
}