{
  "metadata": {
    "case_name": "Appellants v. Respondents",
    "case_year": 1967,
    "court": "Supreme Court of India",
    "judges": [
      "KRISHNA IYER, J."
    ],
    "case_number": "Civil Appeal No. 1787 of 1967",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Suit for partition filed by plaintiffs.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Dispute over shop-room at the northwest corner of plot No. 1238 claimed by plaintiffs but disallowed by High Court.",
      "type": "disputed",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Dispute over three items in Schedule C to the plaint (items 1 to 3), covered by four usufructuary mortgages Ex-B-1 to B-4, claimed by first defendant (first respondent) as exclusively belonging to him.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f4",
      "text": "Trial Court accepted first defendant's case on exclusive ownership of items 1-3 in Schedule C and partially upheld possession of shop-room.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "Patna High Court in Appeal from Original Decree No. 77 of 1958, judgment dated January 31, 1963, affirmed Trial Court's findings on items 1-3 and held shop-room allotted to defendant No. 1 in 1938 partition.",
      "type": "procedural",
      "date": "1963-01-31",
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "Admissions in Title Suit No. 61 of 1945: Ex. G (deposition of first plaintiff), Ex. G2 (deposition of eighth defendant, father of plaintiffs), Ex. H (written statement by eighth defendant and plaintiffs, two of whom were majors).",
      "type": "admitted",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "Partition took place in 1938 allotting disputed shop-room to defendant No. 1.",
      "type": "background",
      "date": "1938",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "First respondent's case: properties belonged to him as heir of his father Narain Sah; alternatively, based on admissions.",
      "type": "background",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f9",
      "text": "Appellants did not raise prejudice from admissions in Trial Court, High Court appeal, memorandum for certificate, or statement of case in Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Eighth defendant did not give evidence in the suit.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the shop-room at the northwest corner of plot No. 1238 belongs exclusively to the defendants first party.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the entire properties mentioned in Schedule C to the plaint (specifically items 1 to 3 covered by Ex-B-1 to B-4) are joint family properties liable to partition.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Propriety of relying on admissions from Title Suit No. 61 of 1945 without putting them to the parties or explaining prejudice.",
      "framed_by": "petitioner"
    },
    {
      "id": "i4",
      "text": "Whether admissions constitute a new case at variance with pleadings requiring opportunity to explain under s.145 Evidence Act.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Admissions in Ex. G, G2, H are vague and insufficient to justify verdict against plaintiffs.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "First respondent's alternative case based on admissions not pleaded in written statement (basic defence was inheritance from Narain Sah), so new case should not be considered.",
      "supporting_facts": [
        "f8",
        "f6"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Admissions not put to first plaintiff in witness box or to eighth defendant, denying opportunity to explain, causing prejudice; reliance on s.145 Indian Evidence Act.",
      "supporting_facts": [
        "f6",
        "f9",
        "f10"
      ],
      "legal_basis": "s.145 Indian Evidence Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Items 1-3 in Schedule C and shop-room belong exclusively to first defendant based on admissions in Ex. G, G2, H from Title Suit No. 61 of 1945.",
      "supporting_facts": [
        "f3",
        "f2",
        "f6",
        "f7"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Admissions are usually telling against the maker unless reasonably explained; no acceptable ground to extricate appellants.",
      "addresses_issue": "i3",
      "key_observation": "Concurrent findings of Trial Court and High Court ordinarily not interfered with absent substantial reasons."
    },
    {
      "id": "cr2",
      "text": "No prejudice shown as admissions considered in Trial Court, not objected in High Court appeal, certificate application, or Supreme Court grounds.",
      "addresses_issue": "i4",
      "key_observation": "Plea of prejudice not articulated earlier."
    },
    {
      "id": "cr3",
      "text": "Distinction: Admissions by party are substantive evidence under ss.17 and 21 Evidence Act, no need to put to party under s.145 (which applies to contradict witnesses); cited Bharat Singh v. Bhagirathi.",
      "addresses_issue": "i3",
      "key_observation": "Admissions admissible irrespective of whether party appears or is confronted."
    },
    {
      "id": "cr4",
      "text": "Agrees with High Court that admissions prove shop-room allotted to defendant No. 1 in 1938 partition and items 1-3 belong to first defendant.",
      "addresses_issue": "i1",
      "key_observation": "Plaintiffs' own admissions damage their case."
    },
    {
      "id": "cr5",
      "text": "No volte face by first defendant as admissions considered even in Trial Court.",
      "addresses_issue": "i4",
      "key_observation": "No surprise prejudice."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Shop-room at northwest corner of plot No. 1238 belongs exclusively to first defendant.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Items 1 to 3 in Schedule C are not joint family properties but belong exclusively to first defendant.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Admissions are substantive evidence under ss.17 and 21 Evidence Act; no requirement to confront party under s.145.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Bharat Singh v. Bhagirathi",
      "citation": null,
      "treatment": "followed",
      "relevance": "Clarifies admissions are substantive evidence under ss.17,21 Evidence Act, distinct from s.145 for contradicting witnesses; no need to confront party."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Evidence Act",
      "sections": [
        "s.17",
        "s.21",
        "s.145"
      ],
      "relevance": "Admissions under ss.17,21 are substantive evidence proprio vigore; s.145 applies only to contradict witnesses, not parties' admissions."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court dismissed the appeal, affirming High Court and Trial Court findings that the disputed shop-room and items 1-3 in Schedule C belong exclusively to the first defendant based on plaintiffs' admissions in earlier suit, rejecting arguments on prejudice and procedural fairness.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "Admissions are substantive evidence by themselves, in view of ss. 17 and 21 of the Indian Evidence Act, though they are not conclusive proof of the matters admitted.",
      "speaker": "court",
      "significance": "Core holding distinguishing admissions from s.145 contradictions."
    },
    {
      "text": "There is no necessary requirement of the statement containing the admission having to be put to the party because it is evidence proprio vigore.",
      "speaker": "court",
      "significance": "Rejects petitioner's procedural objection."
    },
    {
      "text": "On the strength of the written statement and the other statements aforesaid, there is no escape from the conclusion that this disputed shop-room was allotted to defendant No. 1 in the partition that took place in 1938.",
      "speaker": "court",
      "significance": "High Court view adopted by Supreme Court on key fact."
    }
  ],
  "_case_id": "1973_253",
  "_label": 0,
  "_text_length": 9085,
  "_extracted_at": "2026-02-10T20:12:49.101063"
}