{
  "metadata": {
    "case_name": "Revenue v. Assessee Tea Company",
    "case_year": 1970,
    "court": "Supreme Court of India",
    "judges": [
      "HEGDE, J."
    ],
    "case_number": "Civil Appeal No. 79 of 1970",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The assessee is a Tea Company.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Upto the assessment year 1950-51 the Agricultural Income-tax Officer was accepting the computation of the total income from the growth, manufacture and sale of tea made by the Income Tax Officer and taking 60 per cent of the income determined as the agricultural income under Rule 24 of the Income-tax Rules.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On and from the assessment year 1951-52 the agricultural income-tax authorities started taking the market value of thatch, bamboo and fuel etc. grown in the tea estate and used in the tea business as 100 per cent agricultural income and after deducting the cost of cultivation thereof, taxed the whole of the resulting income on the basis of the market value of those articles.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "From assessment year 1951-52 the computation of the total income from tea by the Income-tax authorities was varied by the Agricultural Income-Tax Officer and the assessee had to pay on a total income which was more than the income disclosed in the Profit and Loss Account.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "For the assessment year 1961-62, for which the relevant previous year was the calendar year 1960, the assessee company was assessed to Income-tax under Rule 34 of the Income-tax Rules, on its profits as per its Profit and Loss Account with certain modifications, by the Income-tax Officer. In the expenses debited in its accounts, only the expenses for raising thatch, bamboo, fuel etc. grown in the tea estate and used in the tea business were included.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Before the Appellate Assistant Commissioner, the assessee raised the contention that the market value of agricultural produce grown in the tea estate and utilised by the assessee in the tea business, which had been assessed at 100 per cent to agricultural income-tax, must be taken into consideration in the computation of allowable expenditure. In support of that contention reliance was placed on the decision of this Court in the case of Dooars Tea Co. Ltd. v. Commissioner of Agricultural Income-tax, West Bengal.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f7",
      "text": "The Appellate Assistant Commissioner accepted that contention and directed the Income-tax Officer to modify the assessment accordingly.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "In appeal by the Revenue the finding of the Appellate Assistant Commissioner was accepted by the Tribunal.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Thereafter at the instance of the Revenue the following question was referred to the High Court: Whether, on the facts and in the circumstances of the case, the Tribunal was right in holding that the decision of the Supreme Court in Dooars Tea Co. Ltd. was applicable to the computation of the assessee's total income under the provisions of the Indian Income-tax Act, 1922 and in directing the Income-tax Officer to make a fresh assessment according to law in the light of the aforesaid decision of the Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "The High Court answered that question in the affirmative and in favour of the assessee.",
      "type": "procedural",
      "date": "1969-02-26",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "This is an appeal by special leave by the Revenue.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "In Dooars Tea Co. case, the assessee, a tea grower, grew in its estate bamboo, thatched grass, fuel timber etc. and utilised the same for tea business. The assessee contended that only the cost of growing the produce should be taken into consideration and not its market value as the same was used for the purpose of assessee's tea business. This contention was rejected by the Revenue and this Court upheld the decision of the Revenue, concluding that the agricultural income should be computed on the basis of the market value of bamboos, thatched grass and fuel timber etc. in accordance with rule 4 of the Bengal Agricultural Income-tax Rules.",
      "type": "background",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the assessee is entitled to the market value of the agricultural produce grown by it but utilised for the purpose of tea business in the computation of allowable expenditure for income-tax.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the decision of the Supreme Court in Dooars Tea Co. Ltd. was applicable to the computation of the assessee's total income under the provisions of the Indian Income-tax Act, 1922.",
      "framed_by": "tribunal"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The Tribunal was not right in holding that the decision in Dooars Tea Co. Ltd. was applicable to the computation of the assessee's total income under the Indian Income-tax Act, 1922.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The market value of agricultural produce grown in the tea estate and utilised by the assessee in the tea business, which had been assessed at 100 per cent to agricultural income-tax, must be taken into consideration in the computation of allowable expenditure.",
      "supporting_facts": [
        "f3",
        "f5",
        "f6"
      ],
      "legal_basis": "Dooars Tea Co. Ltd. v. Commissioner of Agricultural Income-tax, West Bengal"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The ratio of Dooars Tea Co. decision is that in the matter of computing the agricultural income it was not necessary that the agricultural produce should be sold and profit or gain made from such sale before it is considered as agricultural income. It is sufficient if the assessee gets any benefit from the same, and what is to be taxed is the market value of the benefit received by the assessee and not the costs incurred by the assessee for raising the agricultural produce in question.",
      "addresses_issue": "i1",
      "key_observation": "If the assessee has to pay agricultural income-tax on the market value of the agricultural produce raised in his estate and used in his tea business it stands to reason that while determining the deductible expenditure incurred for the purpose of his business, the same rule viz. the market value of the produce used for the tea business should be taken into consideration, because in terms of money what he expended was the market value of the produce used in connection with his business. The fact that he used his own goods is immaterial."
    },
    {
      "id": "cr2",
      "text": "The question referred to the High Court, even though not properly framed, is sufficiently wide to decide the real point in issue. The later part of the question covers the point that calls for decision. There is no need either to reframe the question or to direct the Tribunal to submit a separate statement of case.",
      "addresses_issue": "i2",
      "key_observation": "The real contention between the parties is whether the assessee is entitled to the market value of the agricultural produce grown by it but utilised for the purpose of tea business."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The assessee is entitled to take the market value of the agricultural produce grown in the tea estate and used in the tea business into consideration as deductible expenditure in computing income under the Income-tax Act.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "The decision in Dooars Tea Co. Ltd. is applicable by analogy to the computation of total income under the Indian Income-tax Act, 1922.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Dooars Tea Co. Ltd. v. Commissioner of Agricultural Income-tax, West Bengal",
      "citation": "1962 44 I.T.R. 6",
      "treatment": "followed",
      "relevance": "Holds that agricultural income is to be computed on market value of produce used in business even if not sold; applied by analogy to allow market value as deductible business expense under Income-tax Act."
    }
  ],
  "statutes_cited": [
    {
      "name": "Income-tax Rules",
      "sections": [
        "Rule 24",
        "Rule 34"
      ],
      "relevance": "Rule 24 used for apportionment of tea income pre-1951-52; Rule 34 for computation of income-tax on tea profits as per P&L."
    },
    {
      "name": "Indian Income-tax Act, 1922",
      "sections": [],
      "relevance": "Governs computation of assessee's total income for assessment year 1961-62."
    },
    {
      "name": "Bengal Agricultural Income-tax Act",
      "sections": [
        "Rule 4 of Bengal Agricultural Income-tax Rules"
      ],
      "relevance": "Rule 4 requires computation of agricultural income on market value of produce like bamboo, thatch, fuel used in tea business."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal by the Revenue is dismissed with costs, upholding the High Court, Tribunal and AAC decisions that the assessee is entitled to include the market value of agricultural produce used in tea business as allowable expenditure in income-tax computation, directing fresh assessment accordingly.",
    "relief_granted": "Assessee entitled to modified income-tax assessment taking market value as deductible expenditure; costs awarded to assessee.",
    "costs": "Dismissed with costs"
  },
  "key_quotes": [
    {
      "text": "If the assessee has to pay agricultural income-tax on the market value of the agricultural produce raised in his estate and used in his tea business it stands to reason that while determining the deductible expenditure incurred for the purpose of his business, the same rule viz. the market value of the produce used for the tea business should be taken into consideration",
      "speaker": "court",
      "significance": "Core reasoning linking agricultural income-tax treatment to deductible business expense under income-tax."
    },
    {
      "text": "The fact that he used his own goods is immaterial.",
      "speaker": "court",
      "significance": "Emphasizes that market value governs regardless of self-use."
    }
  ],
  "_case_id": "1973_122",
  "_label": 0,
  "_text_length": 6194,
  "_extracted_at": "2026-02-10T20:11:40.888137"
}