{
  "metadata": {
    "case_name": "Appellant v. State",
    "case_year": 1970,
    "court": "Supreme Court of India",
    "judges": [
      "CHANDRACHUD, J."
    ],
    "case_number": "Criminal Appeal No. 130 of 1970",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The complainant Umashanker is a cleaner in the Loco Shed, Kotah.",
      "type": "background",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f2",
      "text": "The appellant was working as a clerk in the office of the Loco Foreman, Western Railway, Kotah, one of his duties being to process applications made by a certain class of employees for advances from the Provident Fund Account.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On April 8, 1966, the complainant presented an application to the appellant asking for an advance of Rs. 150/- from his Provident Fund Account. The appellant refused to accept the application unless the complainant agreed to pay to him a gratification of Rs. 15/-.",
      "type": "material",
      "date": "1966-04-08",
      "source": "prosecution"
    },
    {
      "id": "f4",
      "text": "On April 10, 1966, the complainant approached a Vigilance Officer Srinath Sharan Srivastava, and lodged a complaint before him that the appellant was demanding a bribe.",
      "type": "procedural",
      "date": "1966-04-10",
      "source": "prosecution"
    },
    {
      "id": "f5",
      "text": "On April 12, 1966, the Vigilance Officer took the complainant to the office of the Special Police Establishment, Jaipur where Inspector Ajmera asked the complainant to make one more attempt to present the application to the appellant.",
      "type": "procedural",
      "date": "1966-04-12",
      "source": "prosecution"
    },
    {
      "id": "f6",
      "text": "On April 13, 1966, the complainant resubmitted his application when the appellant renewed his demand for a bribe.",
      "type": "material",
      "date": "1966-04-13",
      "source": "prosecution"
    },
    {
      "id": "f7",
      "text": "A trap was laid and the appellant accepted from the complainant a sum of Rs. 15/- on the evening of April 13, 1966 at Meghraj Hotel. The two currency notes of Rs. 10/- and 5/- were treated with sodium carbonate powder and the payment was witnessed by the motbirs Jagdish Prasad Tiwari (PW 5) and Bhagwandas Makhija (PW 6).",
      "type": "material",
      "date": "1966-04-13",
      "source": "prosecution"
    },
    {
      "id": "f8",
      "text": "The appellant admitted the receipt of the amount but contended that the amount was paid to him by the complainant in part payment of a loan of Rs. 30/- which had been advanced by him to the complainant on November 1, 1965.",
      "type": "disputed",
      "date": "1965-11-01",
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "The appellant stated that the complainant had not presented to him any application at all on April 8, 1966 and on the 13th the application was presented not to him but to the Head-clerk.",
      "type": "disputed",
      "date": "1966-04-08",
      "source": "petitioner"
    },
    {
      "id": "f10",
      "text": "According to the appellant, the application of April 13, 1966 was processed by him in the ordinary course and on the loan being recommended by the Loco Foreman, the application was duly forwarded to the dispatch clerk for obtaining the sanction of the Divisional Superintendent's Office.",
      "type": "disputed",
      "date": "1966-04-13",
      "source": "petitioner"
    },
    {
      "id": "f11",
      "text": "The evidence of the complainant Umashanker (PW 4), Jagdish Prasad (PW 5) and Bhagwandas Makhija (PW 6) leaves no doubt that the appellant accepted the money from the complainant.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "A copy of the appellant's monthly account Ex. D-11 shows that on November 1, 1965, when the loan is alleged to have been given, the appellant was himself in indigent circumstances: In September 1965, expenses exceeded income, sold silver; October overstepped by Rs. 100/-; November took loan of Rs. 80/- from Railway Fund and sold wheat.",
      "type": "material",
      "date": "1965-11-01",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "The debit entry of Rs. 30/- in the name of the complainant was evidently inserted after scoring off a writing against a sum of Rs. 30/-.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "When Inspector Ajmera disclosed his identity to the appellant and asked him to produce the money, he became nervous and begged for mercy.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f15",
      "text": "There was no particular intimacy between the appellant and the complainant and it is not likely that the appellant would give a loan to the complainant, without a receipt and without interest.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f16",
      "text": "The complainant bore no enmity with the appellant.",
      "type": "material",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the concurrent finding of guilt recorded by the learned Special Judge, Jaipur and the High Court of Rajasthan is in accordance with law and the evidence in the case.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The amount of Rs. 15/- was paid in part payment of a loan of Rs. 30/- advanced by appellant to complainant on November 1, 1965.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Complainant had not presented any application on April 8, 1966; on 13th presented to Head-clerk, not appellant; application processed normally.",
      "supporting_facts": [
        "f9",
        "f10"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Presumption under section 4(1) PCA can be raised only if prosecution establishes that amount was paid otherwise than as legal remuneration; prosecution must prove it was bribe.",
      "supporting_facts": [],
      "legal_basis": "Section 4(1) of Prevention of Corruption Act, 1947"
    },
    {
      "id": "pa4",
      "text": "There was hostility between appellant and Head-clerk Chandra Prakash Saxena who influenced complainant to lodge false case.",
      "supporting_facts": [
        "f16"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Appellant demanded and accepted Rs. 15/- as bribe for processing PF advance application, proved by trap, recovery, witnesses PW4, PW5, PW6.",
      "supporting_facts": [
        "f3",
        "f4",
        "f5",
        "f6",
        "f7",
        "f11"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Appellant admitted receipt; independently, evidence of PW4, PW5, PW6 convincing that Rs. 15/- passed from complainant to appellant.",
      "addresses_issue": "i1",
      "key_observation": "Clear and convincing evidence of acceptance of money."
    },
    {
      "id": "cr2",
      "text": "Under section 4(1) PCA, once acceptance of gratification other than legal remuneration proved, presumption arises that accepted as motive/reward for official act (processing PF loan); burden on accused to rebut.",
      "addresses_issue": "i1",
      "key_observation": "Prosecution need only prove acceptance not legal remuneration; petitioner's contention contrary to section terms."
    },
    {
      "id": "cr3",
      "text": "Accused rebuts by preponderance of probabilities, not beyond reasonable doubt.",
      "addresses_issue": "i1",
      "key_observation": "Cited V.D. Jhingan v. State of UP."
    },
    {
      "id": "cr4",
      "text": "Both courts held defence false; loan theory after-thought: no intimacy, unlikely loan without receipt/interest; appellant indigent (Ex D-11); tampered entry; nervous when caught; no enmity by complainant.",
      "addresses_issue": "i1",
      "key_observation": "Preponderance against defence; failed to discharge burden."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Prosecution proved acceptance of Rs. 15/- not legal remuneration; presumption u/s 4(1) PCA applies; appellant failed to rebut.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Defence of loan repayment is false.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "V. D. Jhingan v. State of Uttar Pradesh",
      "citation": "A.I.R. 1966 S.C. 1762",
      "treatment": "followed",
      "relevance": "Accused can rebut presumption under s.4(1) PCA by preponderance of probabilities, not beyond reasonable doubt."
    }
  ],
  "statutes_cited": [
    {
      "name": "Prevention of Corruption Act, 1947",
      "sections": [
        "Section 5(1)(d)",
        "Section 2",
        "Section 4(1)"
      ],
      "relevance": "Conviction under s.5(1)(d) r/w s.2; presumption u/s 4(1) that accepted gratification is motive/reward for official act."
    },
    {
      "name": "Indian Penal Code",
      "sections": [
        "Section 161"
      ],
      "relevance": "Offence of accepting gratification as motive/reward for official act."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal by special leave against conviction by Special Judge and Rajasthan High Court is dismissed; conviction under s.5(1)(d) r/w s.2 PCA 1947 and s.161 IPC and sentence of RI one year and fine Rs.100/- on each count confirmed.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "Section 4(1) of the Prevention of Corruption Act, 1947, provides... that where... it is proved that an accused person has accepted any gratification (other than legal remuneration), it shall be presumed unless the contrary is proved that he accepted that gratification as a motive or reward such as is mentioned in section 161, Penal Code.",
      "speaker": "court",
      "significance": "Explains statutory presumption central to case."
    },
    {
      "text": "To cast on the prosecution the burden of proving that the amount was accepted by the accused otherwise than by way of legal remuneration is to ask the prosecution to prove that the amount was paid and accepted by way of bribe.",
      "speaker": "court",
      "significance": "Rejects petitioner's interpretation of s.4(1) burden."
    },
    {
      "text": "The learned Special Judge described the loan theory propounded by the appellant as false, while the High Court observed that the conclusion is irresistible that the theory is an after-thought.",
      "speaker": "court",
      "significance": "Confirms lower courts' rejection of defence."
    }
  ],
  "_case_id": "1973_335",
  "_label": 0,
  "_text_length": 8179,
  "_extracted_at": "2026-02-10T20:13:28.928150"
}