{
  "metadata": {
    "case_name": "Appellant v. State",
    "case_year": 1972,
    "court": "Supreme Court of India",
    "judges": [
      "Dua, J."
    ],
    "case_number": "Criminal Appeal No. 264 of 1972",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant ran National Octroi Clearing Agency at Mulund check-post and handled transactions for transport companies including Montgomery Transport Company.",
      "type": "background",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f2",
      "text": "On December 16, 1962, truck MPR 2147 belonging to Montgomery Transport Company arrived at check-post carrying Depleix Machine for Messrs Imperial Tobacco Company, with two drivers and one cleaner.",
      "type": "material",
      "date": "1962-12-16",
      "source": "prosecution"
    },
    {
      "id": "f3",
      "text": "Appellant telephoned manager Bakshi of Montgomery Transport Company to arrange octroi payment amounting to more than Rs. 8,000/-.",
      "type": "material",
      "date": "1962-12-16",
      "source": "prosecution"
    },
    {
      "id": "f4",
      "text": "On the following day, Bakshi and director Inderjit Singh obtained Rs. 8,196/- from Imperial Tobacco Company for octroi and handed it to appellant in presence of the driver.",
      "type": "material",
      "date": "1962-12-17",
      "source": "prosecution"
    },
    {
      "id": "f5",
      "text": "Actual octroi required was only Rs. 81.80/-, resulting in Rs. 16/- refunded to Imperial Tobacco Company by cheque.",
      "type": "material",
      "date": "1962-12-17",
      "source": "prosecution"
    },
    {
      "id": "f6",
      "text": "During investigation of another case involving alleged forged receipt for octroi imports by Messrs Pure Drinks Pvt. Ltd., it was discovered that proper octroi had not been paid on December 17, 1962 in respect of this transaction.",
      "type": "procedural",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f7",
      "text": "Assistant Assessor and Collector Shri Karkhanis and his superintendent Govind Charan visited Imperial Tobacco Company office and found the octroi receipt held by the company not genuine; relevant documents not traceable.",
      "type": "material",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f8",
      "text": "Shri Karkhanis lodged complaint in February 1969; Case No. 3-L761Sup. CI/73 registered; after preliminary enquiry under Ch. XVIII Cr.P.C., appellant committed to Court of Session.",
      "type": "procedural",
      "date": "1969-02",
      "source": "prosecution"
    },
    {
      "id": "f9",
      "text": "Appellant tried in Court of Session for Greater Bombay for offences under s. 467, s. 471 read with s. 467, and s. 420 IPC.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Trial court points for determination: (1) Whether receipt Article A is forged? (2) Whether accused forged it with intent to commit fraud? (3) Whether accused used it as genuine knowing it forged? (4) Whether accused cheated Bombay Municipal Corporation? (5) Whether accused cheated Imperial Tobacco Co.?",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Trial court conclusions: (1) Proved forged; (2) Not proved accused forged; (3) Proved used as genuine knowing forged; (4) Proved cheated BMC; (5) Not proved cheated Imperial Tobacco.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Evidence mainly circumstantial; about 20 witnesses examined including handwriting expert (PW 17); key witnesses: Bakshi (PW 4), Inderjit Singh (PW 18); driver Balwant Singh not examined.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Trial court found evidence of Bakshi and Inderjit Singh partly reliable, partly unreliable; handwriting expert opinion did not conclusively prove appellant forged receipt.",
      "type": "disputed",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "Trial court held receipt forged, not prepared at counter, legitimate payment ruled out; accused aware and used forged receipt knowing it forged; convicted under ss. 471/467 and 420 IPC.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f15",
      "text": "Sentences: 5 years RI + Rs.500 fine (6 months default) under 471/467; 2 years RI under 420; substantive sentences concurrent.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f16",
      "text": "Appeal to Bombay High Court (Cr. A. No. 164 of 1972) dismissed in limine on March 6, 1972 with one word 'Dismissed'.",
      "type": "procedural",
      "date": "1972-03-06",
      "source": "lower_court"
    },
    {
      "id": "f17",
      "text": "Appeal by special leave to Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the receipt Article A is a forged document?",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the accused forged the receipt with intent to commit fraud?",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether the accused used the forged receipt as genuine knowing it to be forged?",
      "framed_by": "court"
    },
    {
      "id": "i4",
      "text": "Whether the accused cheated the Bombay Municipal Corporation?",
      "framed_by": "court"
    },
    {
      "id": "i5",
      "text": "Whether the accused cheated Imperial Tobacco Co. of India Ltd.?",
      "framed_by": "court"
    },
    {
      "id": "i6",
      "text": "Whether the High Court was justified in dismissing the appeal in limine with one word 'Dismissed' without a speaking order indicating reasons?",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The appeal raised arguable and substantial points requiring critical scrutiny of prosecution evidence; High Court erred in summarily dismissing without reasons.",
      "supporting_facts": [
        "f12",
        "f13",
        "f16"
      ],
      "legal_basis": "Mushtak Hussein v. State of Bombay; series of Supreme Court decisions requiring reasons in arguable appeals"
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Trial court judgment lengthy, exhaustively discussed evidence; did not place implicit reliance on key witnesses (partly reliable); handwriting expert did not prove forgery by accused.",
      "addresses_issue": "i2",
      "key_observation": "Direct charge of forgery not proved, but receipt forged and accused used it knowing forged."
    },
    {
      "id": "cr2",
      "text": "High Court dismissal without reasons in arguable case improper; Supreme Court has consistently emphasized need for indication of views on arguable points to assist in special leave appeals.",
      "addresses_issue": "i6",
      "key_observation": "Summary dismissal without reasons embarrasses Supreme Court; promotes confidence in judicial process."
    },
    {
      "id": "cr3",
      "text": "Remand necessary for High Court to rehear, consider points, and record reasons; no opinion on merits expressed.",
      "addresses_issue": "i6",
      "key_observation": "Appellant entitled to proper decision by High Court on due appraisal of evidence."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "High Courts must record reasons or indicate views when dismissing appeals raising arguable questions of fact or law.",
      "resolves_issue": "i6",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Mushtak Hussein v. State of Bombay",
      "citation": "1953 S.C.R. 809",
      "treatment": "followed",
      "relevance": "Emphasized need for High Court to indicate views on arguable points in summary dismissals."
    },
    {
      "case_name": "K. K. Jain v. State of Maharashtra",
      "citation": "A.I.R. 1973 S.C. 243",
      "treatment": "followed",
      "relevance": " Reiterated necessity of recording reasons for dismissing appeals raising substantial or arguable questions."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "467",
        "471",
        "420"
      ],
      "relevance": "Offences charged: forgery, using forged document, cheating."
    },
    {
      "name": "Code of Criminal Procedure",
      "sections": [
        "Ch. XVIII"
      ],
      "relevance": "Preliminary enquiry leading to commitment to Sessions Court."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; case remanded to Bombay High Court for rehearing the appeal, considering points raised, and deciding after recording reasons in accordance with law. No opinion expressed on merits.",
    "relief_granted": "Remand to High Court for fresh consideration with reasons.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"I do number, however, feel that this earns an acquittal for him... the charge of using a forged receipt knowing it to be forged companyld be brought home to him.\"",
      "speaker": "lower_court",
      "significance": "Trial court's basis for conviction despite not proving accused forged the document."
    },
    {
      "text": "\"Without the opinion of the High Court on such points in special leave petitions under article 136 of the Constitution this Court sometimes feels embarrassed...\"",
      "speaker": "court",
      "significance": "Explains prejudice caused by non-speaking order."
    },
    {
      "text": "\"the accused ought to be supposed to be aware that the real payment was made and what he carried companyld number be the real receipt.\"",
      "speaker": "lower_court",
      "significance": "Trial court's inference of knowledge of forgery."
    }
  ],
  "_case_id": "1973_45",
  "_label": 1,
  "_text_length": 12095,
  "_extracted_at": "2026-02-10T20:11:13.076236"
}