{
  "metadata": {
    "case_name": "Petitioner v. State of Assam",
    "case_year": 1973,
    "court": "Supreme Court of India",
    "judges": [
      "DWIVEDI, J."
    ],
    "case_number": "Writ Petition No. 1520 of 1973",
    "date_of_judgment": "1973-10-30"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Petitioner is the acting President of the Council of the Displaced Bengalees living in the State of Assam.",
      "type": "background",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f2",
      "text": "On April 2, 1973, the District Magistrate, Sibasagar, Jorhat passed an order under S. 3(2) read with S. 3(1)(a)(ii) of the Maintenance of Internal Security Act, 1971 for detaining the petitioner in Jorhat jail.",
      "type": "procedural",
      "date": "1973-04-02",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On April 3, 1973, the District Magistrate served the grounds of detention on the petitioner.",
      "type": "procedural",
      "date": "1973-04-03",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The State Government approved the order of detention.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The petition was heard on October 30, 1973, and an order directing the release of the petitioner was passed.",
      "type": "procedural",
      "date": "1973-10-30",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Detention order passed to prevent petitioner from acting in any manner prejudicial to maintenance of public order.",
      "type": "material",
      "date": "1973-04-02",
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Grounds of detention: 16 in number. Some relate to public order.",
      "type": "material",
      "date": "1973-04-03",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Irrelevant grounds: Petitioner spoke ill of the State Government and the Assamese people in a meeting in the last part of March, 1961 held at the residence of Shri Hemendra Kishore Roy, Jorhat (then Secretary of Refugee Association, Assam).",
      "type": "disputed",
      "date": "1961-03",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Irrelevant grounds: Issued a Press Statement on 6-12-1971 on Pak atrocities in East Pakistan/Bangla Desh blaming General Yahya Khan and the American Government.",
      "type": "disputed",
      "date": "1971-12-06",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Irrelevant grounds: Sent telegram on 22-11-1971 to Mr. Kenneth Keating, American Ambassador in India, to stop mass killing in East Pakistan.",
      "type": "disputed",
      "date": "1971-11-22",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Irrelevant grounds: Challenged the census operation in Assam stating figures of Assamese population were shown highly inflated at the cost of Bengalis.",
      "type": "disputed",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Irrelevant grounds: Sent telegram on 10-10-1972 to the Prime Minister, India on the language movement in Assam; contents highly exaggerated and false.",
      "type": "disputed",
      "date": "1972-10-10",
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Irrelevant grounds: Sent exaggerated telegram on 31-12-1972 to the Prime Minister, India requesting her not to enter into any language settlement with Cachar leaders; signed as Council's acting President.",
      "type": "disputed",
      "date": "1972-12-31",
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "In grounds of detention, District Magistrate specifically relied on security of State, stating prejudicial activities posed threat to security of State and public order.",
      "type": "disputed",
      "date": "1973-04-03",
      "source": "lower_court"
    },
    {
      "id": "f15",
      "text": "Grounds Nos. 4, 8, 9 and 16 connected with security of the State.",
      "type": "material",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether five specific grounds of detention have no relevance to public order.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether inclusion of irrelevant grounds (one third of total) vitiates the entire detention order due to inability to assess impact on subjective satisfaction.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether reliance in grounds on security of State, when detention order specifies public order, vitiates the order.",
      "framed_by": "court"
    },
    {
      "id": "i4",
      "text": "Difference between public order and security of the State.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Some of the grounds served have no relevance to public order.",
      "supporting_facts": [
        "f8",
        "f9",
        "f10",
        "f11",
        "f12",
        "f13"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Counsel could not satisfy the court as to how the five grounds could have a rational connection with public order.",
      "supporting_facts": [],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Five out of 16 grounds have no rational relation with public order; they may connect to law and order, but public order is an aggravated form of disturbance affecting general current of public life.",
      "addresses_issue": "i1",
      "key_observation": "Concept of law and order not identical with public order."
    },
    {
      "id": "cr2",
      "text": "Detention based on subjective satisfaction; cannot assess how far irrelevant grounds swayed the mind of detaining authority; rule of severability does not apply to intertwined relevant and irrelevant grounds; whole order falls.",
      "addresses_issue": "i2",
      "key_observation": "One third of grounds irrelevant vitiates entire order."
    },
    {
      "id": "cr3",
      "text": "Detention order for public order, but grounds rely on security of State (grounds 4,8,9,16); joint reading suggests detaining authority either had no information on security grounds at time of order or did not believe them and base order on them; cannot buttress order later.",
      "addresses_issue": "i3",
      "key_observation": "Cannot deploy grounds not relied upon initially."
    },
    {
      "id": "cr4",
      "text": "Difference between public order and security of State: three concentric circles - law and order (largest), public order, security of State (smallest); breach of public order does not necessarily affect security of State.",
      "addresses_issue": "i4",
      "key_observation": "Quoted from Dr. Ram Manohar Lohia."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Irrelevant grounds vitiate the detention order as a whole when intertwined with relevant ones.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Detention order cannot be based on grounds related to security of State when order specifies public order only.",
      "resolves_issue": "i3",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h3",
      "text": "Public order and security of State are distinct; not every breach of public order affects security of State.",
      "resolves_issue": "i4",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "State of Bombay v. Atma Ram Sridhar Vaidya",
      "citation": "1951 S.C.R. 167",
      "treatment": "distinguished",
      "relevance": "Distinguishable on facts; not concerned with relevancy of grounds."
    },
    {
      "case_name": "Dr. Ram Manohar Lohia v. State of Bihar",
      "citation": "1966 1 S.C.R. 709 at page 746",
      "treatment": "referred",
      "relevance": "Explains difference between law and order, public order, security of State as concentric circles."
    },
    {
      "case_name": "Shibban Lal Saxena v. State of Uttar Pradesh",
      "citation": "1954 S.C.R. 418 at p. 422",
      "treatment": "referred",
      "relevance": "Irrelevant grounds vitiate detention order as whole; cannot substitute executive decision."
    },
    {
      "case_name": "Motilal Jain v. State of Bihar",
      "citation": "1968 3 S.C.R. 587 at p. 593",
      "treatment": "referred",
      "relevance": "Irrelevant grounds vitiate order; cannot uphold on remaining grounds if influence uncertain."
    },
    {
      "case_name": "Pushkar Mukherjee v. State of West Bengal",
      "citation": "1969 2 S.C.R. 635 at page 641",
      "treatment": "referred",
      "relevance": "Irrelevant grounds make detention order liable to be quashed."
    },
    {
      "case_name": "Ananta Mukhi Ananta Hari v. State of West Bengal",
      "citation": "1972 3 S.C.R. 379",
      "treatment": "referred",
      "relevance": "Grounds relevant to public order and security of State."
    },
    {
      "case_name": "Masood Alam v. Union of India",
      "citation": "A.I.R. 1973 S.C. 897",
      "treatment": "referred",
      "relevance": "Referred to in context of public order vs security."
    }
  ],
  "statutes_cited": [
    {
      "name": "Maintenance of Internal Security Act, 1971",
      "sections": [
        "Section 3(1)(a)(ii)",
        "Section 3(2)"
      ],
      "relevance": "Basis for detention order to prevent acting prejudicial to public order."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 32"
      ],
      "relevance": "Basis for writ petition in nature of habeas corpus."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Petition allowed; detention order quashed due to irrelevant grounds vitiating the entire order and mismatch between public order basis and security grounds; petitioner directed to be released.",
    "relief_granted": "Release of petitioner from detention.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "Public order is an aggravated form of disturbance of public peace. It affects the general current of public life.",
      "speaker": "court",
      "significance": "Distinguishes public order from law and order."
    },
    {
      "text": "To the intertwining of relevant and irrelevant grounds of detention the rule of severability would not apply, and the whole order of detention would fall down.",
      "speaker": "court",
      "significance": "Core reason for quashing detention."
    },
    {
      "text": "One has to imagine three concentric circles. Law and order represents the largest circle within which is the next circle representing public order and the smallest circle represents security of State.",
      "speaker": "court",
      "significance": "Explains hierarchy from Dr. Ram Manohar Lohia."
    }
  ],
  "_case_id": "1973_310",
  "_label": 1,
  "_text_length": 10787,
  "_extracted_at": "2026-02-10T20:12:53.100002"
}