{
  "metadata": {
    "case_name": "Veerpal Singh v. Deputy Registrar, Cooperative Societies, Meerut",
    "case_year": 1972,
    "court": "Supreme Court of India",
    "judges": [
      "RAY, J."
    ],
    "case_number": "Writ Petition No. 298 of 1971 / Civil Appeal No. 593 of 1972",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Order dated 14 July, 1971 passed by the Deputy Registrar, Cooperative Societies, Meerut, suspending the President (Veerpal Singh) and the committee of management of Jahangirabad Cooperative Marketing Society Ltd., Jahangirabad, and appointing Ghanshyam Murari Sharma, Additional District Cooperative Officer, Bulandshahr, as Administrator.",
      "type": "procedural",
      "date": "1971-07-14",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Judgment and order dated November 24, 1971 of the High Court of Allahabad dismissing in limine W.P. No. 6667/71 challenging the suspension order dated 14 July, 1971.",
      "type": "procedural",
      "date": "1971-11-24",
      "source": "lower_court"
    },
    {
      "id": "f3",
      "text": "Inspection of the Jahangirabad Cooperative Marketing Society in April 1969; date of report not disclosed.",
      "type": "background",
      "date": "1969-04",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Petitioner Veerpal Singh reelected as a Director of the management of the Society in October 1969.",
      "type": "background",
      "date": "1969-10",
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "In October 1969, petitioner appointed as a delegate by the committee of management of the Society to the Provincial Cooperative Federation; subsequently elected to the committee of management of the Federation.",
      "type": "background",
      "date": "1969-10",
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "Petitioner elected Chairman of the Provincial Cooperative Federation in April 1970.",
      "type": "background",
      "date": "1970-04",
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "In September 1970, at the instance and under the direction of the Deputy Registrar (former Secretary of the Federation) and Shri Yadav (then Minister of Cooperative Society), U.P. Government nominated 10 members and a Chairman of the Federation, omitting the petitioner.",
      "type": "background",
      "date": "1970-09",
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "In December 1970, new Ministry of U.P. Government revoked the previous nomination order of September 1970.",
      "type": "background",
      "date": "1970-12",
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "In June 1971, new Ministry formed with Shri Yadav again as Minister of Cooperative Society; Government nominated 10 members in the committee of management of the Federation under section 34(1) of the Act and appointed Additional Registrar as President.",
      "type": "background",
      "date": "1971-06",
      "source": "petitioner"
    },
    {
      "id": "f10",
      "text": "In June 1971, lot drawn to determine which Directors of the Provincial Cooperative Federation vacate office to make room for Government nominees; petitioner survived the lot.",
      "type": "background",
      "date": "1971-06",
      "source": "petitioner"
    },
    {
      "id": "f11",
      "text": "Petitioner made application for amendment of petition alleging conspiracy by Shri Yadav and Tyagi to suspend committee of Federation, and that withdrawal of delegation was antedated; order of withdrawal dated 15 July, 1971 by administrator of Society withdrawing petitioner's delegation to U.P. Provincial Cooperative Federation; petitioner denies this.",
      "type": "disputed",
      "date": "1971-07-15",
      "source": "petitioner"
    },
    {
      "id": "f12",
      "text": "Court did not allow amendment as petitioner did not allege facts to raise plea of mala fides.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Administrator appointed by Deputy Registrar withdrew delegation of petitioner Veerpal Singh to Uttar Pradesh Provincial Cooperative Federation under Rule 86 of U.P. Cooperative Societies Rules 1968.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the Deputy Registrar under the Cooperative Societies Act, 1965 could suspend the President and the committee of management of Jahangirabad Cooperative Marketing Society.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the Deputy Registrar could temporarily appoint an administrator.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Order of suspension is void because it is made mala fide and exercised for the collateral purpose of withdrawing the petitioner from the committee of management to which he was elected.",
      "supporting_facts": [
        "f4",
        "f5",
        "f6",
        "f7",
        "f9",
        "f10",
        "f11"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Order of suspension is bad because there were no supersession proceedings as contemplated in section 35 of the Act; Registrar did not give opportunity to Society, did not hear Society, did not obtain opinion of general body.",
      "supporting_facts": [
        "f1"
      ],
      "legal_basis": "Section 35 of the Cooperative Societies Act, 1965"
    },
    {
      "id": "pa3",
      "text": "Suspension order could not have the effect of appointment of an administrator under section 35 of the Act.",
      "supporting_facts": [
        "f1"
      ],
      "legal_basis": "Section 35 of the Cooperative Societies Act, 1965"
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Power of suspension of committee of management under section 35(2) is exercisable only during period of proceedings for supersession under section 35(1); proceedings commence when Registrar takes definite step like issuing notice after forming opinion of default/negligence, affording opportunity to committee and obtaining general body opinion.",
      "addresses_issue": "i1",
      "key_observation": "No proceedings for supersession commenced as no such steps taken."
    },
    {
      "id": "cr2",
      "text": "Registrar could not appoint administrator as prerequisite of commenced supersession proceedings not fulfilled; section 35(2) allows arrangements for management during proceedings, but no proceedings started.",
      "addresses_issue": "i2",
      "key_observation": "Interim suspension and administrator appointment invalid without proceedings."
    },
    {
      "id": "cr3",
      "text": "Administrator's withdrawal of petitioner's delegation invalid as appointment of administrator bad.",
      "addresses_issue": "i2",
      "key_observation": "Under Rule 86, only valid administrator can withdraw delegation."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Deputy Registrar has no power to suspend committee or appoint administrator under section 35(2) unless supersession proceedings under section 35(1) have commenced.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Order dated 14 July, 1971 suspending committee and appointing administrator is set aside and quashed; withdrawal of delegation also bad.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Article 32",
        "Article 226"
      ],
      "relevance": "Basis for writ petition and appeal from High Court writ petition"
    },
    {
      "name": "U.P. Cooperative Societies Act, 1965",
      "sections": [
        "Section 34(1)",
        "Section 35(1)",
        "Section 35(2)",
        "Section 35(3)",
        "Section 35(4)",
        "Section 35(5)",
        "Section 35(6)"
      ],
      "relevance": "Governs powers of Registrar to supersede, suspend committee of management and appoint administrator; suspension only during supersession proceedings"
    },
    {
      "name": "U.P. Cooperative Societies Rules, 1968",
      "sections": [
        "Rule 86"
      ],
      "relevance": "Delegate ceases if withdrawn by committee, administrator or administrators appointed under section 35"
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Writ petition succeeds and appeal allowed; order dated 14 July, 1971 set aside and quashed.",
    "relief_granted": "Suspension order quashed; administrator appointment invalidated; delegation withdrawal invalidated.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"Where the Registrar, while proceeding to take action under sub-section (1) is of opinion that suspension of the committee of management during the period of proceedings is necessary in the interest of the society, he may suspend the committee of management which shall thereupon cease to function, and make such arrangement as he thinks proper for the management of the affairs of the society till the proceedings are completed.\"",
      "speaker": "court",
      "significance": "Quotes section 35(2) central to holding that suspension requires ongoing supersession proceedings"
    },
    {
      "text": "The provisions in the Act indicate that some definite step like the issue of a notice must be taken under the provisions of section 35(1) of the Act with a view to show that proceedings for supersession of the committee are set in motion.",
      "speaker": "court",
      "significance": "Key reasoning why no proceedings commenced, invalidating suspension"
    },
    {
      "text": "For these reasons, the order dated 14 July, 1971 is set aside and quashed. The petition succeeds. The appeal is also allowed.",
      "speaker": "court",
      "significance": "Final disposition in favor of petitioner"
    }
  ],
  "_case_id": "1973_25",
  "_label": 1,
  "_text_length": 11503,
  "_extracted_at": "2026-02-10T20:10:59.619924"
}