{
  "metadata": {
    "case_name": "Kelvinator of India Ltd. v. State",
    "case_year": 1972,
    "court": "Supreme Court of India",
    "judges": [
      "KHANNA, J."
    ],
    "case_number": "Civil Appeal No. 2005 NT of 1972",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant has factory at Faridabad in Haryana manufacturing refrigerators, deep freezers, compressors under collaboration with Kelvinator International Corporation, marketed under trademarks Kelvinator, Leonard and Gem.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Appellant's registered office and sales office at 19A Alipore Road, Delhi with godowns and staff there. Registered dealer under Punjab General Sales Tax Act, 1948 and Central Sales Tax Act, 1956 at Faridabad.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Entire sale of refrigerators, compressors and spare parts in 1964 made to Spencer & Co. Ltd. at Delhi, accepted as genuine by sales tax authorities, not treated as inter-State sales.",
      "type": "admitted",
      "date": "1964",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Distribution agreement with Spencer & Co. Ltd. dated April 26, 1965 effective from April 1, 1965 for Kelvinator products. Similar agreements: Blue Star Engineering Co. Bombay Pvt. Ltd. on September 15, 1965 for Leonard; General Equipment Merchants Ltd. on December 11, 1965 for Gem.",
      "type": "material",
      "date": "1965-04-26",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Agreements stipulate: Company sells and distributors buy products as mutually agreed; sales on principal to principal basis; delivery at Delhi registered office, property passes in Delhi; price ex-works Faridabad plus transport to Delhi borne by distributors; warranty by company.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "For Leonard and Gem agreements: Minimum purchase guarantees (e.g., 1500 Leonard/year, 2000 Gem first year); price ex-factory excluding some charges, transport paid by distributors; property passes in Delhi; company not responsible post-Delhi delivery.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Goods cleared from excise at factory to Delhi office; octroi paid by company; specific orders placed by buyers after goods available in Delhi; delivery on challan, bills raised from Delhi.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "Affidavits: Goods moved on self-excise pass; received in Delhi godown; orders after arrival; delivery and payment in Delhi. Distributors' affidavits: Select and order after inspection in Delhi godown.",
      "type": "admitted",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "Company took transit insurance warehouse to warehouse.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Tribunal findings: Goods transferred to Delhi under despatch numbers; stock entries made; expenses up to Delhi borne by company; orders placed after examination; delivery on challans, bills from Delhi.",
      "type": "admitted",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Assessment year 1965-66 (April 1, 1965 to March 31, 1966). Assessing authority held inter-State sales, tax Rs. 8,14,112.25 reduced to Rs. 1,59,691.19.",
      "type": "procedural",
      "date": "1965-04-01",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Deputy Excise and Taxation Commissioner (appeal): Agreements not sales contracts, transport prior to sale, not inter-State.",
      "type": "procedural",
      "date": "1968-07-24",
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Excise and Taxation Commissioner suo motu: Appropriation at manufacture, movement under agreement to sell.",
      "type": "procedural",
      "date": "1968-09-12",
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "Tribunal: Agreements are sales, inter-State sales. Review dismissed.",
      "type": "procedural",
      "date": "1969-08-14",
      "source": "lower_court"
    },
    {
      "id": "f15",
      "text": "Reference to High Court: Question answered in favour of department.",
      "type": "procedural",
      "date": "1972-04-11",
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether on the facts and circumstances of the case, the agreement between Ms. Kelvinator of India (Assessee), Ms. Spencer & Co. Ltd., Messrs Blue Star Engineering Co., and Ms. General Equipment Ltd., in pursuance of which the refrigerators manufactured by Ms. Kelvinator of India at Faridabad moved to Delhi were merely for distribution of goods between the principal and his agents or were agreements of sale between two parties?",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the sales were local sales of Delhi or in the course of inter-State trade and commerce giving rise to the commencement of movements in the State of Haryana.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether the distributorship agreements could validly be construed to be contracts of sales even when they lack all the essential ingredients for the formation of the same.",
      "framed_by": "petitioner"
    },
    {
      "id": "i4",
      "text": "Whether the movement of the goods from Faridabad to Company's godowns at Delhi at its own risk and cost could be termed to be commercial movements warranting the imposition of the tax under the Central Sales Tax Act or inter-departmental movement for facility of better enjoyment of rights.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The three distribution agreements do not constitute contracts of sale.",
      "supporting_facts": [
        "f4",
        "f5",
        "f6",
        "f7",
        "f8"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Even if distribution agreements were construed as contracts of sale, the movement of goods from Faridabad to Delhi was not occasioned by the distribution agreements.",
      "supporting_facts": [
        "f7",
        "f8",
        "f9",
        "f10"
      ],
      "legal_basis": "Central Sales Tax Act, 1956 s.3(a)"
    },
    {
      "id": "pa3",
      "text": "No appropriation of goods at Faridabad to the contract with any particular distributor.",
      "supporting_facts": [
        "f7",
        "f8"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The three distribution agreements constitute contracts of sale.",
      "supporting_facts": [
        "f4",
        "f5",
        "f6"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "The aforesaid agreements occasioned the movement of goods from Faridabad to Delhi.",
      "supporting_facts": [
        "f4",
        "f5",
        "f6"
      ],
      "legal_basis": "Central Sales Tax Act, 1956 s.3(a)"
    },
    {
      "id": "ra3",
      "text": "Appropriation of goods to the contract with each distributor took place in Faridabad.",
      "supporting_facts": [
        "f1"
      ],
      "legal_basis": "Sale of Goods Act s.23"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Distribution agreements are not contracts of sale as sales depended on future mutual agreements on quantity and price; orders placed in Delhi after goods arrived there; framework for subsequent sales contracts.",
      "addresses_issue": "i1",
      "key_observation": "Sales resulted from orders in Delhi, not distribution agreements."
    },
    {
      "id": "cr2",
      "text": "No appropriation at Faridabad; trademarks interchangeable; orders placed after arrival in Delhi; movement to own godown independent of sales.",
      "addresses_issue": "i1",
      "key_observation": "Movement not under contract of sale; prior to specific orders."
    },
    {
      "id": "cr3",
      "text": "For inter-State sale under s.3(a), sale must occasion movement as integral part; here movement to own Delhi godown precedes sales; parties arranged sales in Delhi to avoid tax.",
      "addresses_issue": "i2",
      "key_observation": "Direct nexus absent; movement not necessitated by sale contract."
    },
    {
      "id": "cr4",
      "text": "Transport charges borne by distributors added to price, but sale/delivery in Delhi; company bore risks till Delhi delivery/inspection.",
      "addresses_issue": "i1",
      "key_observation": "Does not make movement part of sale."
    },
    {
      "id": "cr5",
      "text": "Similar to TELCO case: Movement to stockyards prior to dealer allocations/orders.",
      "addresses_issue": "i2",
      "key_observation": "No firm orders before movement."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The three agreements were merely for distribution of goods between principal and agents, not agreements of sale.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Movement of refrigerators from Faridabad to Delhi not under contract of sale; transactions not in course of inter-State trade or commerce; no liability under Central Sales Tax Act.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Tata Iron and Steel Co. Ltd. v. S. R. Sarkar",
      "citation": "1961 1 SCR 379",
      "treatment": "followed",
      "relevance": "Sale taxable if movement under covenant/incident of contract of sale."
    },
    {
      "case_name": "Ben Gorm Nilgiri Plantations Co. v. Sales Tax Officer",
      "citation": "1964 7 SCR 706",
      "treatment": "followed",
      "relevance": "Connection between sale and movement must be integrated."
    },
    {
      "case_name": "Tata Engineering Locomotive Co. Ltd. v. Assistant Commissioner of Commercial Taxes",
      "citation": "1970 3 SCR 862",
      "treatment": "followed",
      "relevance": "Movement to stockyards prior to dealer orders not occasioned by sale; similar facts."
    }
  ],
  "statutes_cited": [
    {
      "name": "Central Sales Tax Act, 1956",
      "sections": [
        "Section 2(g)",
        "Section 3(a)",
        "Section 6"
      ],
      "relevance": "Definition of sale; inter-State sale if sale occasions movement; tax on inter-State sales."
    },
    {
      "name": "Punjab General Sales Tax Act, 1948",
      "sections": [],
      "relevance": "Appellant registered dealer under this Act."
    },
    {
      "name": "Sale of Goods Act",
      "sections": [
        "Section 23"
      ],
      "relevance": "Appropriation of unascertained goods; no assent or authority shown."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; High Court judgment set aside; question answered against department; transactions not inter-State sales; no tax liability under Central Sales Tax Act.",
    "relief_granted": "Appeal accepted; tax liability negated.",
    "costs": "Appellant entitled to costs from respondent in this Court and High Court."
  },
  "key_quotes": [
    {
      "text": "\"A sale of goods is in the course of inter-State trade if the sale and movement of goods from one State to another are integral parts of the same transaction.\"",
      "speaker": "court",
      "significance": "Defines test for inter-State sale under s.3(a)."
    },
    {
      "text": "\"The distribution agreement with each distributor provided the framework within which the different contracts of sale were entered into by the distributor with the appellant.\"",
      "speaker": "court",
      "significance": "Distinguishes distribution agreements from sales contracts."
    },
    {
      "text": "\"There is nothing illegal or impermissible to a party so arranging its affairs that the liability to pay tax would not be attracted.\"",
      "speaker": "court",
      "significance": "Upholds tax planning via Delhi sales."
    }
  ],
  "_case_id": "1973_407",
  "_label": 1,
  "_text_length": 45262,
  "_extracted_at": "2026-02-10T20:13:31.102292"
}