{
  "metadata": {
    "case_name": "State of Mysore v. Respondent",
    "case_year": 1968,
    "court": "Supreme Court of India",
    "judges": [
      "Mathew, J."
    ],
    "case_number": "Civil Appeal No. 2117 of 1968",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The respondent started service as a police companystable in the State of Bombay in 1935.",
      "type": "background",
      "date": "1935",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "He became a head companystable after he was allotted to the State of Mysore consequent on the reorganization of the states.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "In the year 1962, disciplinary proceedings were commenced against him. The charge was that he was found missing from his post between 11.30 P.M. on March 21, 1962 and 3.30 P.M. on the next day.",
      "type": "material",
      "date": "1962-03-21",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The Superintendent of Police found him guilty of the charge and demoted him as a police companystable.",
      "type": "procedural",
      "date": "1962",
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "The respondent preferred an appeal to the Deputy Inspector General of Police but that was dismissed.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f6",
      "text": "The respondent then filed a revision before the State Government under rule 17 of the Bombay Police Punishment and Appeal Rules, 1956.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f7",
      "text": "The Government thereafter issued a show cause notice to the respondent stating why the punishment imposed upon him by the Superintendent of Police should not be enhanced.",
      "type": "procedural",
      "date": null,
      "source": "state"
    },
    {
      "id": "f8",
      "text": "After hearing the respondent, the punishment was enhanced to one of dismissal by the Government.",
      "type": "procedural",
      "date": null,
      "source": "state"
    },
    {
      "id": "f9",
      "text": "The respondent filed a writ petition before the High Court of Mysore to quash the order, raising two grounds: 1) that the disciplinary proceedings were not conducted in accordance with law; 2) that the enhancement of punishment was beyond the competence of the Government as rule 17(2) of the Rules was ultra vires of s.25(2)(c) of the Bombay Police Act, 1951.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f10",
      "text": "The High Court held that the disciplinary proceedings were conducted in accordance with law, but that the Government had no jurisdiction to enhance the punishment. The Court therefore quashed the order of the Government enhancing the punishment.",
      "type": "procedural",
      "date": "1968-04-16",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Appeal preferred by the State of Mysore on certificate.",
      "type": "procedural",
      "date": null,
      "source": "state"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether rule 17(2) of the Bombay Police Punishment and Appeal Rules, 1956, which authorizes the State Government to call for the records of any case and enhance the punishment inflicted, is ultra vires s.25(2)(c) of the Bombay Police Act, 1951.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Rule 17(2) of the Rules which authorized the State Government to call for the records of any case in which an order has been passed by an authority subordinate to it and enhance the punishment inflicted by the order was not ultra vires s.25(2)(c) of the Act.",
      "supporting_facts": [
        "f4",
        "f8"
      ],
      "legal_basis": "s.25(2)(c) Bombay Police Act, 1951; Rule 17 Bombay Police Punishment and Appeal Rules, 1956"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The disciplinary proceedings were not conducted in accordance with law.",
      "supporting_facts": [
        "f3",
        "f4"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "The enhancement of punishment was beyond the competence of the Government as rule 17(2) of the Rules was ultra vires of s.25(2)(c) of the Bombay Police Act, 1951.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": "s.25(2)(c) Bombay Police Act, 1951; Rule 17(2)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Sub-section (1) of s.25 empowers the State Government or authorised officer to impose punishments like suspension, reduction, dismissal. Sub-section (2)(a) authorises certain officers including Superintendent to impose such punishments subject to rules made by State Government.",
      "addresses_issue": "i1",
      "key_observation": "Source of power for rule 17 is s.25(2)(c), but it only allows rules for regulating exercise of power under s.25(2)(a), not for revision or enhancement after punishment imposed."
    },
    {
      "id": "cr2",
      "text": "The words 'the exercise of any power conferred by this sub-section shall be subject always to such rules and orders as may be made by the State Government' in s.25(2)(c) indicate rules regulate procedure or manner of arriving at decision under s.25(2)(a), not arrogate revision power post-decision.",
      "addresses_issue": "i1",
      "key_observation": "Power to enhance is exercisable only after officer has exercised power under s.25(2)(a); once punishment imposed, it is final subject only to appeal under s.27."
    },
    {
      "id": "cr3",
      "text": "Rule 17(2) by which Government sought to acquire power to call for records, revise orders under s.25(2)(a) and enhance punishment was clearly beyond its competence.",
      "addresses_issue": "i1",
      "key_observation": "High Court correctly held no jurisdiction to enhance."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Rule 17(2) of the Bombay Police Punishment and Appeal Rules, 1956 is ultra vires s.25(2)(c) of the Bombay Police Act, 1951 as it exceeds the rule-making power which is limited to regulating the exercise of powers under s.25(2)(a), not granting revision or enhancement powers post-imposition of punishment.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Bombay Police Act, 1951",
      "sections": [
        "s.25(1)",
        "s.25(2)(a)",
        "s.25(2)(c)",
        "s.27"
      ],
      "relevance": "Defines powers to impose punishments on police officers and limits rule-making to regulate exercise of those powers, not revision/enhancement."
    },
    {
      "name": "Bombay Police Punishment and Appeal Rules, 1956",
      "sections": [
        "Rule 17",
        "Rule 17(2)"
      ],
      "relevance": "Provides for State Government's revision powers including enhancement of punishment, held ultra vires."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court upheld the High Court's order quashing the State Government's enhancement of punishment to dismissal, holding that Rule 17(2) is ultra vires s.25(2)(c) of the Bombay Police Act, 1951. The original demotion by Superintendent stands.",
    "relief_granted": "Writ petition allowed by High Court upheld; enhancement order quashed.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "Rule 17(2) of the Rules, by which the Government sought to acquire power to call for the records and to revise orders passed under s.25(2)(a) and to enhance the punishment imposed, was clearly beyond its competence.",
      "speaker": "court",
      "significance": "Core holding declaring the rule ultra vires."
    },
    {
      "text": "What is made subject to the rules or orders to be passed or made by Government is the exercise of any power conferred under clause (2)(a) of s.25.",
      "speaker": "court",
      "significance": "Interprets scope of s.25(2)(c) limiting rule-making power."
    }
  ],
  "_case_id": "1973_268",
  "_label": 0,
  "_text_length": 8190,
  "_extracted_at": "2026-02-10T20:12:44.860417"
}