{
  "metadata": {
    "case_name": "Union of India and Delhi Development Authority v. Plaintiff (Lessee)",
    "case_year": 1973,
    "court": "Supreme Court of India",
    "judges": [
      "BEG, J."
    ],
    "case_number": "Civil Appeal No. 298 of 1973",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Lease deed dated 17-9-1931 (Ex. P2) executed between Secretary of State for India (lessor) and plaintiff (lessee) for plot of land containing 5444 square yards at Ara Kashan, Paharganj, Delhi, for term of 90 years commencing 1-4-1931 at yearly rent of Rs. 365/- payable half-yearly, in consideration of premium of Rs. 18,054/- paid by lessee.",
      "type": "background",
      "date": "1931-09-17",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Plot entrusted for management to Delhi Improvement Trust, and after its abolition in 1957, to Delhi Development Authority under Section 60 of Delhi Development Act, 1957.",
      "type": "background",
      "date": "1957",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Agreement dated 27-5-1955 (Ex. P4) between Delhi Improvement Trust and plaintiff for payment of development and betterment charges of Rs. 10,888/-; states parties retain rights under 1931 lease; no mention of rent enhancement.",
      "type": "background",
      "date": "1955-05-27",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Defendants demanded enhancement of annual rent from Rs. 365/- to Rs. 730/- retrospectively from 1-4-1951; realized Rs. 5,935.25 as arrears from 1-1-1952 to 30-6-1963 after issuing warrant of arrest dated 2-6-1964.",
      "type": "material",
      "date": "1962-06",
      "source": "plaintiff"
    },
    {
      "id": "f5",
      "text": "Plaintiff sued in Delhi High Court for declaration that rent cannot be enhanced during 90-year lease, refund of Rs. 5,935.25, and injunction restraining defendants from realizing rent exceeding Rs. 365/- annually.",
      "type": "procedural",
      "date": null,
      "source": "plaintiff"
    },
    {
      "id": "f6",
      "text": "Defendants pleaded suit barred by Section 53B(2) of Delhi Development Act and want of notice under Section 80 CPC to Union of India.",
      "type": "procedural",
      "date": null,
      "source": "defendant"
    },
    {
      "id": "f7",
      "text": "Defendants admitted in written statement (para 1 and 12) that lease was for 90 years at Rs. 365/- per annum, but claimed subject to renewal and enhancement as per lease terms.",
      "type": "admitted",
      "date": null,
      "source": "defendant"
    },
    {
      "id": "f8",
      "text": "Single Judge of Delhi High Court dismissed suit on merits, holding rent could be enhanced within 90 years.",
      "type": "procedural",
      "date": "1971-05-26",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Division Bench of Delhi High Court allowed plaintiff's appeal (Civil Regular First Appeal No. O.S. 16 of 1970), decreed suit holding enhancement only on fresh lease after 90 years; certified for Supreme Court appeal under Article 133(1)(a) and (c).",
      "type": "procedural",
      "date": "1971-05-26",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Issue No. 5 framed: Whether on construction of paras 9 and 10 of lease deed dated 17-9-1931 defendants entitled to enhancement of rent as claimed, and if lawfully made.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether on construction of covenants 9 and 10 of lease deed dated 17-9-1931, defendants entitled to enhance rent during the 90-year term or only upon renewal after expiry of 90 years.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether suit barred by Section 53B(2) of Delhi Development Act or want of notice under Section 80 CPC.",
      "framed_by": "respondent"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Lease subject to enhancement within 90 years per covenants 9 and 10; proviso to covenant 9 aggregates original term with renewals not exceeding 90 years total; words of demise qualified by subsequent covenants; initial term deemed 20 years with renewals within 90 years.",
      "supporting_facts": [
        "f1",
        "f7"
      ],
      "legal_basis": "Covenants 9 and 10 of lease deed; similar Delhi High Court judgment"
    },
    {
      "id": "pa2",
      "text": "Proviso 'with' means aggregation/inclusive; 'original term' equates to total 90 years including renewals; no words making lease non-terminable before 90 years.",
      "supporting_facts": [
        "f1"
      ],
      "legal_basis": "Webster's Dictionary meaning of 'with'"
    },
    {
      "id": "pa3",
      "text": "Ex. P4 irrelevant for interpreting 1931 lease; rule of construction favors grantor (State) on public interest.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": "British rule for Sovereign grants"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Lease unequivocally for 90 years at fixed Rs. 365/- rent; covenants 9 and 10 apply only at end of 90-year term for renewal; enhancement conditional on fresh lease after expiry; proviso cannot override clear demise words.",
      "supporting_facts": [
        "f1",
        "f7"
      ],
      "legal_basis": "Covenants 9 and 10; literal construction"
    },
    {
      "id": "ra2",
      "text": "Earlier clear words of demise prevail over ambiguous proviso; interpret in favor of grantee especially for valuable consideration.",
      "supporting_facts": [
        "f1"
      ],
      "legal_basis": "Radha Sunder Dutta v. Mohd. Jahadur Rahim; Sahebzada Mohd. Kamgar Shah v. Jagdish Chandra; Smt. Bina Das Gupta v. Sachindra Mohan"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Defendants admitted lease for 90 years; covenants 9 and 10 operate only at end of 'term hereby granted' i.e. 90 years; renewal is fresh lease after initial term; cannot have renewals within initial 90 years.",
      "addresses_issue": "i1",
      "key_observation": "Admission binds; issues confined to enhancement within 90 years."
    },
    {
      "id": "cr2",
      "text": "Words of demise clear for 90 years at Rs. 365/-; subject to subsequent covenants but proviso to 9 ambiguous; 'original term' in proviso refers to renewal term, not initial 90 years, to avoid absurdity.",
      "addresses_issue": "i1",
      "key_observation": "Read deed as whole; literal rule unless absurd."
    },
    {
      "id": "cr3",
      "text": "Proviso uncertain; clear grant prevails over ambiguous exception; interpret favoring grantee for valuable consideration; no special rule for State grants post-Constitution.",
      "addresses_issue": "i1",
      "key_observation": "State cannot rewrite defective deed against citizen."
    },
    {
      "id": "cr4",
      "text": "Procedural pleas (s.53B(2), s.80 CPC) decided against defendants by both High Court benches.",
      "addresses_issue": "i2",
      "key_observation": "Not argued before Supreme Court."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Rent cannot be enhanced during initial 90-year term; enhancement only on renewal after 90 years per covenants 9 and 10.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Radha Sunder Dutta v. Mohd. Jahadur Rahim",
      "citation": "A.I.R. 1959 S.C. 24",
      "treatment": "followed",
      "relevance": "Prefer construction giving effect to all clauses (ut res magis valeat quam pereat)"
    },
    {
      "case_name": "Sahebzada Mohd. Kamgar Shah v. Jagdish Chandra Rao Dhabel Deo",
      "citation": "1960 3 S.C.R. 604",
      "treatment": "followed",
      "relevance": "Earlier operative part prevails over later inconsistent habendum"
    },
    {
      "case_name": "Smt. Bina Das Gupta v. Sachindra Mohan Das Gunta",
      "citation": "A.I.R. 1968 S.C. 39",
      "treatment": "followed",
      "relevance": "Exception in grant construed in favor of grantee; ambiguous exception fails"
    },
    {
      "case_name": "Raja Rajendira Chand v. Smt. Sukhi",
      "citation": "A.I.R. 1957 S.C. 286",
      "treatment": "followed",
      "relevance": "Grants for valuable consideration construed favorably to grantee over Sovereign rule"
    },
    {
      "case_name": "Monypenny v. Monypenny",
      "citation": "1861 9 H.L.C. 114",
      "treatment": "referred",
      "relevance": "Meaning from words used, not presumed intention"
    },
    {
      "case_name": "Re Meredith, ex p. Chick",
      "citation": "1879 11 Ch. D. 731",
      "treatment": "referred",
      "relevance": "Regard meaning of words used, not presumed intention"
    },
    {
      "case_name": "Stavill Bros. Ltd. v. Bethell",
      "citation": "1902 2 Ch. 723",
      "treatment": "followed",
      "relevance": "Clear grant prevails if exception uncertain"
    },
    {
      "case_name": "Glyn v. Margetson & Co.",
      "citation": "1893 A.C. 351",
      "treatment": "referred",
      "relevance": "Reject inconsistent provisions against main purpose"
    }
  ],
  "statutes_cited": [
    {
      "name": "Delhi Development Act, 1957",
      "sections": [
        "Section 60",
        "Section 53B(2)"
      ],
      "relevance": "Transfer of management to DDA; plea of bar to suit rejected"
    },
    {
      "name": "Code of Civil Procedure, 1908",
      "sections": [
        "Section 80"
      ],
      "relevance": "Plea of want of notice to Union of India rejected"
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 133(1)(a) and (c)"
      ],
      "relevance": "Certification for appeal to Supreme Court"
    },
    {
      "name": "Indian Evidence Act, 1872",
      "sections": [
        "Sections 90 to 94",
        "Sections 95 to 98"
      ],
      "relevance": "Primary rule: meaning from document itself"
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court dismissed the defendants' appeal, affirmed Delhi High Court Division Bench decree declaring no rent enhancement during 90-year lease term, entitling plaintiff to refund and injunction.",
    "relief_granted": "Declaration no enhancement during lease; refund of excess rent; permanent injunction",
    "costs": "Appeal dismissed with costs"
  },
  "key_quotes": [
    {
      "text": "\"the lease was for a total period of 90 years at Rs. 365 per annum.\"",
      "speaker": "defendant",
      "significance": "Admission binding on defendants"
    },
    {
      "text": "\"The Lessor will at the request and cost of the Lessee at the end of the term hereby granted... execute... a new Lease... by way of renewal\"",
      "speaker": "court",
      "significance": "Covenant 9 triggers only after 90-year term"
    },
    {
      "text": "\"if there be admissible two constructions... one of which will give effect to all the clauses... it is the former that should be adopted\"",
      "speaker": "court",
      "significance": "Principle preferring harmonious construction"
    },
    {
      "text": "\"the State as the lessor grantor... should [not] enjoy the benefit of some nebulous and unjust rule of construction\"",
      "speaker": "court",
      "significance": "Rejects special favor to State in modern India"
    }
  ],
  "_case_id": "1973_186",
  "_label": 0,
  "_text_length": 32927,
  "_extracted_at": "2026-02-10T20:12:17.211263"
}