{
  "metadata": {
    "case_name": "Appellant (Iron Mine Lessee) v. Respondents (State)",
    "case_year": 1969,
    "court": "Supreme Court of India",
    "judges": [
      "Mathew, J."
    ],
    "case_number": "Civil Appeal No. 1695 of 1969",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant was operating an iron mine within the State of Mysore on the basis of a lease granted by the State.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Appellant filed Writ Petition No. 347 of 1965 before the High Court of Mysore challenging the validity of the Iron Ore Mines Labour Welfare Cess Act (Central Act 58 of 1961).",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Appellant's contentions in writ petition: Act violative of Article 14 as it imposes flat rate of excise duty on iron ore without reference to actual content of iron; excessive delegation of legislative power as power to fix rate delegated to government.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "Prayer in writ petition: declaration of invalidity of the Act and quashing of demand made pursuant to the Act.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "Writ petition heard along with other similar petitions; High Court dismissed by common order dated February 20-21, 1967.",
      "type": "procedural",
      "date": "1967-02-20",
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "Appeal by special leave to Supreme Court against High Court order insofar as it affects appellant.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Act provides for levy and collection of cess on iron ore for financing promotion of welfare of labour employed in iron ore mining industry.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Act brought into force in Mysore State from October 1, 1963.",
      "type": "material",
      "date": "1963-10-01",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Iron Ore Mines Labour Welfare Cess Rules, 1963 framed and published by notification dated September 20, 1963.",
      "type": "material",
      "date": "1963-09-20",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether Section 2 of the Act suffers from excessive delegation of legislative power by giving Central Government blanket power to fix rate of excise duty without sufficient guidance.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether the Act violates Article 14 by imposing flat rate of excise duty without reference to iron content in ore.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Section 2 suffers from excessive delegation as it leaves rate fixation to Central Government without sufficient guidance, basis, or relevant considerations.",
      "supporting_facts": [
        "f3",
        "f7"
      ],
      "legal_basis": "Section 2 of Iron Ore Mines Labour Welfare Cess Act, 1961"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "High Court negatived excessive delegation contention relying on Corporation of Calcutta v. Liberty Cinema.",
      "supporting_facts": [],
      "legal_basis": "Corporation of Calcutta v. Liberty Cinema, AIR 1965 SC 1107"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "No arguments addressed on Article 14 issue before Supreme Court, so not discussed.",
      "addresses_issue": "i2",
      "key_observation": "First question decided against appellant by High Court not argued."
    },
    {
      "id": "cr2",
      "text": "Reviewed precedents on delegation: Corporation of Calcutta (guidance in monetary needs); Municipal Board Hapur (safeguards for elected bodies); Devi Das (needs of State insufficient guidance); Municipal Corporation of Delhi (guidance in purposes of Act, elected body, max rates, checks); D. Ramaraju (guidelines in Act purposes).",
      "addresses_issue": "i1",
      "key_observation": "Act furnishes definite guidelines in Section 3 purposes, which are specific and calculable; power limited by expenses for those purposes, parliamentary appropriation, accounts/reports, maximum rate of 50 naye paise."
    },
    {
      "id": "cr3",
      "text": "Policy clearly stated in Act; purposes enumerated such that delegate can calculate necessary amount; maximum rate demarcates discretion area.",
      "addresses_issue": "i1",
      "key_observation": "No blanket power delegated."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Section 2 of the Act does not suffer from excessive delegation; sufficient guidance provided.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Corporation of Calcutta v. Liberty Cinema",
      "citation": "AIR 1965 SC 1107",
      "treatment": "followed",
      "relevance": "Upheld delegation for fee fixation with guidance in monetary needs."
    },
    {
      "case_name": "Banarsidas v. State of M.P.",
      "citation": "AIR 1958 SC 909",
      "treatment": "referred",
      "relevance": "Fixation of tax rates not essential legislative function."
    },
    {
      "case_name": "Municipal Board, Hapur v. Raghuvendra Kripal",
      "citation": "AIR 1966 SC 693",
      "treatment": "followed",
      "relevance": "Delegation to elected municipal bodies valid with procedures and checks."
    },
    {
      "case_name": "Devi Das Gopal Krishnan v. State of Punjab",
      "citation": "AIR 1967 SC 1895",
      "treatment": "followed",
      "relevance": "State needs insufficient guidance for tax rate fixation."
    },
    {
      "case_name": "Vasantlal Maganbhai Sanjanwala v. State of Bombay",
      "citation": "AIR 1961 SC 4",
      "treatment": "referred",
      "relevance": "Dissent on limits of delegation."
    },
    {
      "case_name": "Municipal Corporation of Delhi v. Birla Cotton Spinning and Weaving Mills",
      "citation": "AIR 1968 SC 1232",
      "treatment": "followed",
      "relevance": "Delegation to elected corporation valid with guidance in Act purposes, max rates, checks."
    },
    {
      "case_name": "D. Ramaraju v. State of A.P.",
      "citation": "AIR 1972 SC 828",
      "treatment": "followed",
      "relevance": "Guidelines in Act for cess rate fixation sufficient."
    },
    {
      "case_name": "Kruse v. Johnson",
      "citation": "1898 2 QB 91",
      "treatment": "referred",
      "relevance": "Reasonableness of municipal actions reviewable by courts."
    }
  ],
  "statutes_cited": [
    {
      "name": "Iron Ore Mines Labour Welfare Cess Act, 1961 (Central Act 58 of 1961)",
      "sections": [
        "Section 2",
        "Section 3",
        "Section 4",
        "Section 5",
        "Section 6",
        "Section 7",
        "Section 8"
      ],
      "relevance": "Levy of cess (s2), utilization for labour welfare (s3), advisory committees/staff (s4-5), exemptions (s6), reports (s7), rules (s8); provides guidance limiting delegation."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 14"
      ],
      "relevance": "Alleged violation by flat rate duty challenged."
    },
    {
      "name": "Iron Ore Mines Labour Welfare Cess Rules, 1963",
      "sections": [],
      "relevance": "Framed under s8 for implementation."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court dismissed the appeal with costs, upholding the validity of the Iron Ore Mines Labour Welfare Cess Act, 1961 against challenge of excessive delegation in Section 2.",
    "relief_granted": null,
    "costs": "With costs"
  },
  "key_quotes": [
    {
      "text": "\"Tested in the light of the reasoning adopted in the cases referred to above, we are of opinion that the Act has furnished definite guidelines for the government to exercise the power to fix the rate of excise duty.\"",
      "speaker": "court",
      "significance": "Core holding on sufficiency of guidance."
    },
    {
      "text": "\"The power to levy the duty must be taken to be limited by the expenses required to discharge the statutory function to be performed by the delegate.\"",
      "speaker": "court",
      "significance": "Explains implicit limit on delegation."
    },
    {
      "text": "\"We dismiss the appeal with costs.\"",
      "speaker": "court",
      "significance": "Final disposition."
    }
  ],
  "_case_id": "1973_130",
  "_label": 0,
  "_text_length": 20160,
  "_extracted_at": "2026-02-10T20:12:07.140307"
}