{
  "metadata": {
    "case_name": "State of Tamil Nadu v. Respondent Assessee",
    "case_year": 1970,
    "court": "Supreme Court of India",
    "judges": [
      "HEGDE, J."
    ],
    "case_number": "Civil Appeals Nos. 492 to 493 of 1970",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The respondent assessee was assessed to sales tax during the assessment years 1960-61 and 1961-62.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Aggrieved by the orders of the assessing authorities, the assessee went up in appeal to the Appellate Assistant Commissioner, who dismissed his appeals.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The assessee filed second appeal to the Sales Tax Appellate Tribunal, Madras, which dismissed those appeals as having been time-barred.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "After the Tribunal dismissed the appeals, the assessee moved the Board of Revenue under S. 34(1) to revise the assessment orders.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The Board of Revenue came to the conclusion that it had no jurisdiction to entertain those petitions.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The High Court in the writ petitions (W.P. Nos. 4628 and 4630 of 1965) held that the Board had jurisdiction and issued a writ of mandamus to the Board to entertain the revision petitions and consider them on merits.",
      "type": "procedural",
      "date": "1968-12-09",
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "These appeals are by certificate from the Judgment and order dated December 9, 1968 of the Madras High Court.",
      "type": "procedural",
      "date": "1968-12-09",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "The true scope of S. 34 of the Madras General Sales Tax Act, 1959, particularly whether an appeal against an order which was dismissed as having been barred by time can be considered as an order which had been made the subject of an appeal under S. 34(2)(b).",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the assessee had a right to invoke the jurisdiction of the Board to exercise its revisional power under S. 34.",
      "framed_by": "respondent"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The Board had no jurisdiction to entertain the revision petitions because the order had been made the subject of an appeal to the Tribunal, even if dismissed as time-barred.",
      "supporting_facts": [
        "f3",
        "f5"
      ],
      "legal_basis": "S. 34(2)(b) of the Madras General Sales Tax Act, 1959"
    },
    {
      "id": "pa2",
      "text": "The assessee had no right to invoke the jurisdiction of the Board to exercise its revisional power.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": "S. 34(1) of the Madras General Sales Tax Act, 1959 (suo motu power)"
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "In 1963, Madras High Court in Erode Yarn Stores v. State of Madras held that a time-barred appeal dismissed by the Tribunal is not an effective appeal, so Board retains jurisdiction under S. 34; this interpretation prevents mischief where assessee files time-barred appeal to stifle Board's power.",
      "addresses_issue": "i1",
      "key_observation": "The words 'subject of an appeal' mean subject of an effective appeal."
    },
    {
      "id": "cr2",
      "text": "Declines to examine correctness of Erode Yarn Stores as it was rendered in 1963, accepted by State, stood the field, governed several cases, Act amended but S. 34 not; upsetting it would disturb settled position; State can seek legislative amendment.",
      "addresses_issue": "i1",
      "key_observation": "Not proper to upset long-standing High Court decision accepted by State."
    },
    {
      "id": "cr3",
      "text": "Assessee or Revenue can bring errors to Board's notice under S. 34 to remedy injustice; Board erred in refusing jurisdiction due to dismissal of time-barred appeal, which is error apparent on face of record; High Court justified in interfering.",
      "addresses_issue": "i2",
      "key_observation": "Board's refusal vitiated by error apparent; merits left to Board."
    },
    {
      "id": "cr4",
      "text": "Andhra Pradesh High Court decisions on similar provision do not assist appellant.",
      "addresses_issue": "i1",
      "key_observation": "No assistance to State's case."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Time-barred appeal not 'subject of an appeal' under S. 34(2)(b) per settled Madras HC view; Board has jurisdiction to consider revision.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Assessee can invoke Board's S. 34 jurisdiction to point out errors; Board's refusal on jurisdictional ground was erroneous.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Erode Yarn Stores v. State of Madras",
      "citation": null,
      "treatment": "followed",
      "relevance": "Held time-barred appeal not effective appeal, Board retains S. 34 jurisdiction; accepted by State since 1963."
    },
    {
      "case_name": "Messrs. Mela Ram & Sons v. Commissioner of Income-tax, Punjab",
      "citation": "1956 S.C.R. 166",
      "treatment": "referred",
      "relevance": "Held appeal out of time is still an appeal; order dismissing as time-barred is in appeal; considered but not applied to state sales tax act."
    }
  ],
  "statutes_cited": [
    {
      "name": "Madras General Sales Tax Act, 1959",
      "sections": [
        "S. 34(1)",
        "S. 34(2)"
      ],
      "relevance": "Confers suo motu revisional power on Board of Revenue, subject to limitations including if order subject of appeal to Tribunal."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeals against the Madras High Court's order issuing mandamus to the Board of Revenue to consider the revision petitions on merits are dismissed.",
    "relief_granted": "High Court's mandamus upheld; Board directed to consider revisions on merits.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"Whether an appeal against an order which was dismissed as having been barred by time can be considered as an order which had been made the subject of an appeal?\"",
      "speaker": "court",
      "significance": "Frames the core legal issue under S. 34(2)(b)."
    },
    {
      "text": "\"all that an assessee, who wants to stifle the Board's suo motu power of revision, has to do is to file a time-barred appeal and get it dismissed.\"",
      "speaker": "court",
      "significance": "Explains mischief avoided by interpreting 'effective appeal'."
    },
    {
      "text": "\"Under these circumstances it is not proper for this Court to upset that decision at this late stage and disturb a settled position in law.\"",
      "speaker": "court",
      "significance": "Reason for not overturning Madras HC precedent."
    }
  ],
  "_case_id": "1973_35",
  "_label": 0,
  "_text_length": 7661,
  "_extracted_at": "2026-02-10T20:11:00.565951"
}