{
  "metadata": {
    "case_name": "Controller of Estate Duty v. Mohamedbhai Eusufalli",
    "case_year": 1970,
    "court": "Supreme Court of India",
    "judges": [
      "HEGDE, J."
    ],
    "case_number": "Civil Appeal No. 1096 of 1970",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Eusufalli Ebrahimji settled immovable properties and leasehold lands upon trust by indenture dated 15-7-1938.",
      "type": "material",
      "date": "1938-07-15",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Trustees appointed: Eusufalli (settlor), Bai Safiabai (deceased), and their eldest son Mohamedbhai (accountable person).",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Under trust deed: Settlor entitled to net income during his lifetime.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "After settlor's death: Income divided into three equal shares - 1/3rd to Bai Safiabai during her lifetime; out of remaining 2/3rd, 1/3rd to Mohamedbhai and 1/3rd to maintenance of two wives and children of settlor's youngest son Salebhai (who died before trust deed).",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "After death of Safiabai: Trustees to divide trust properties - one equal share (half) to eldest son Mohamedbhai (or his children and wife if predeceased), according to dictates of religion; other half share to wife and children of Salebhai (two anna share to each of two wives, remaining twelve annas to children according to religion); trust to come to an end.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Bai Safiabai died on 6-10-1955.",
      "type": "material",
      "date": "1955-10-06",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Assistant Controller determined value of her estate at Rs. 4,15,000/-, consisting of her individual properties and 1/3rd of trust properties.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Accountable person objected to inclusion of 1/3rd share in trust properties.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "Objection overruled by Assistant Controller.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Accountable person appealed to Appellate Controller, later sought to withdraw appeal; withdrawal refused.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f11",
      "text": "Appellate Controller issued notice to show cause why entire trust estate should not be included; rejected contention that trust property did not belong to deceased; included entire trust property, enhancing valuation by Rs. 5,73,000/-.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Accountable person appealed to Appellate Tribunal.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f13",
      "text": "Tribunal set aside Appellate Controller's order, restored Assistant Controller's; held only 1/3rd of trust estate passed on death of deceased.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "Tribunal referred three questions under s.64(1) of Estate Duty Act partly at instance of Department and partly accountable person; accountable person withdrew third question.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f15",
      "text": "Gujarat High Court answered first question in favour of accountable person; did not answer second as unnecessary.",
      "type": "procedural",
      "date": "1968-10-03",
      "source": "lower_court"
    },
    {
      "id": "f16",
      "text": "High Court judgment and order dated October 3 and 4, 1968 in Estate Duty Tax Reference No. 1 of 1968.",
      "type": "procedural",
      "date": "1968-10-04",
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether on the facts and in the circumstances of the case, the whole of the Trust estate was to be included in the assessment or only a portion thereof and if so what portion.",
      "framed_by": "tribunal"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Title to trust properties vested in trustees till death of deceased; title passed to beneficiaries immediately on her death; title that passed was entire trust property; hence entire value to be included.",
      "supporting_facts": [
        "f2",
        "f6",
        "f15"
      ],
      "legal_basis": "s.5(1) Estate Duty Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Deceased had only 1/3rd interest in trust property; that alone passed on her death; her position as trustee ending on death cannot be considered property passing.",
      "supporting_facts": [
        "f4",
        "f6"
      ],
      "legal_basis": "s.5 Estate Duty Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Under s.5(1), estate duty levied on property passing on death; s.2(15) defines property as including any interest; s.2(16) inclusive definition of passing on death.",
      "addresses_issue": "i1",
      "key_observation": "Property passing on death means change in beneficial interests before and after death; not mere change in title."
    },
    {
      "id": "cr2",
      "text": "Beneficial interest in 2/3rd income vested in others since settlor's death; deceased entitled only to 1/3rd income; only 1/3rd interest passed; change from beneficial income to legal ownership does not enlarge extent.",
      "addresses_issue": "i1",
      "key_observation": "Trustee title is personal right with no monetary value, imposes duties, not property."
    },
    {
      "id": "cr3",
      "text": "Cites English authorities: beneficial enjoyment unaffected by death does not pass; no duty on mere change of title where same persons entitled before/after.",
      "addresses_issue": "i1",
      "key_observation": "Relevant is change in beneficial interest, not title."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Only 1/3rd interest in trust property passed on death of deceased; entire trust estate does not pass.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Scott and Coutts and Co. v. Inland Revenue Commissioner",
      "citation": "1937 A.C. 174",
      "treatment": "followed",
      "relevance": "Property passes if beneficial interests change before/after death."
    },
    {
      "case_name": "Re Thomas Townsend, Deceased",
      "citation": "1901 2 K.B. 331",
      "treatment": "followed",
      "relevance": "Estate duty only on property where beneficial interest changes on death; not on prior vested interests."
    },
    {
      "case_name": "Mahendra Rambhai Patel v. Controller of Estate Duty, Gujarat",
      "citation": "63 I.T.R. 645",
      "treatment": "followed",
      "relevance": "Property passing determined by change in beneficial interest on death."
    }
  ],
  "statutes_cited": [
    {
      "name": "Estate Duty Act",
      "sections": [
        "s.64(1)",
        "s.5(1)",
        "s.2(15)",
        "s.2(16)"
      ],
      "relevance": "Levies duty on property passing on death; defines property and passing; only beneficial interest passes."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court upheld High Court and Tribunal (Assistant Controller) view that only 1/3rd of trust estate passed on death of Bai Safiabai; rejected Department's contention for entire estate.",
    "relief_granted": "None specified beyond upholding lower decisions.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"The word passes means changes hands. To ascertain whether property has passed, a comparison must be made between the persons beneficially interested the moment before the death and the persons so interested the moment after the death.\"",
      "speaker": "court",
      "significance": "Defines test for property passing on death."
    },
    {
      "text": "\"In substance, only 1/3rd interest in the trust property passed on her death.\"",
      "speaker": "court",
      "significance": "Core holding on extent of property passing."
    },
    {
      "text": "\"Her title to the property as a trustee was purely a personal right. It had no value in terms of money. It conferred no right on her. It only imposed some duties. Such a right cannot be considered as property.\"",
      "speaker": "court",
      "significance": "Distinguishes trustee title from beneficial interest."
    }
  ],
  "_case_id": "1973_126",
  "_label": 0,
  "_text_length": 17386,
  "_extracted_at": "2026-02-10T20:11:40.597371"
}