{
  "metadata": {
    "case_name": "Akalu Ahir & Ors. v. Ramdeo Ram",
    "case_year": 1970,
    "court": "Supreme Court of India",
    "judges": [
      "DUA, J"
    ],
    "case_number": "Criminal Appeal No. 40 of 1970",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Three appellants (Akalu Ahir, Chandrika Singh, Jagarnath) and Ramchander Kanu tried before 2nd Assistant Sessions Judge, Chopra for offences under ss. 307 and 307/109 IPC.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Akalu Ahir and Chandrika Singh charged under s. 307 IPC for firing pistol shots and gun shots at Ramdeo Ram at 11.00 p.m. on June 13, 1966.",
      "type": "material",
      "date": "1966-06-13",
      "source": "prosecution"
    },
    {
      "id": "f3",
      "text": "Jagarnath and Ramchander Kanu charged under ss. 307/109 IPC for abetting the offence.",
      "type": "material",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f4",
      "text": "Occurrence arose from election rivalry for office of Mukhia of village Arakpur; long-standing enmity between rival groups, providing motive for offence or false implication.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Three eye-witnesses: Ramdeo Ram (PW1, victim), Puljharia (PW9), Bhuidhar Chamar (PW10, ploughman).",
      "type": "material",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f6",
      "text": "Trial Judge acquitted accused, finding no doubt Ramdeo Ram injured by gun shots but not impressed by prosecution evidence on manner of occurrence; charges not proved beyond reasonable doubt.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "State did not file appeal against acquittal.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Ramdeo Ram filed revision petition in Patna High Court in January 1969 under ss. 435 and 439 CrPC against acquittal of four accused.",
      "type": "procedural",
      "date": "1969-01",
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "Name of Jagarnath Kanu expunged from array of respondents in revision by court order dated July 3, 1969.",
      "type": "procedural",
      "date": "1969-07-03",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Patna High Court on October 14, 1969 allowed revision, set aside acquittal, ordered re-trial, finding trial court's appraisal of evidence infirm, misreading of PW1 evidence, immaterial contradictions.",
      "type": "procedural",
      "date": "1969-10-14",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Appeal by special leave to Supreme Court by three appellants.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether High Court can interfere in revision petition by private party against acquittal order and direct re-trial by re-appraising evidence.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Limits of High Court's revisional jurisdiction under ss. 435/439 CrPC against acquittal when State has not appealed.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "High Court over-stepped limits of power in dealing with revisions against acquittals at instance of private parties.",
      "supporting_facts": [
        "f6",
        "f7",
        "f10"
      ],
      "legal_basis": "ss. 435, 439 CrPC; precedents like K.C. Reddy"
    },
    {
      "id": "pa2",
      "text": "High Court not justified in examining evidence as court of appeal; required to check if trial court correctly appraised evidence.",
      "supporting_facts": [
        "f10"
      ],
      "legal_basis": "s. 439 CrPC"
    },
    {
      "id": "pa3",
      "text": "Order directing re-trial uncalled for and would result in grave injustice.",
      "supporting_facts": [
        "f10",
        "f11"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "No explicit arguments detailed; revision based on infirmities in trial court's evidence appraisal.",
      "supporting_facts": [
        "f10"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Revisional jurisdiction under ss. 435/439 CrPC is extraordinary, discretionary, to correct grave injustices; not for re-appraising facts unless glaring legal defect causing failure of justice.",
      "addresses_issue": "i1",
      "key_observation": "High Court cannot act as appeal court; no conversion of acquittal to conviction directly or indirectly via re-trial."
    },
    {
      "id": "cr2",
      "text": "Private party has limited right in revision against acquittal; only in exceptional cases like jurisdictional error, shutting out evidence, overlooking material evidence.",
      "addresses_issue": "i2",
      "key_observation": "High Court re-weighed evidence contrary to precedents; trial court's appraisal not perfect but insufficient for interference."
    },
    {
      "id": "cr3",
      "text": "Re-trial exposes accused to harassment; not to be ordered lightly without procedural infirmity.",
      "addresses_issue": "i1",
      "key_observation": "High Court's opinion on evidence may unconsciously influence re-trial court."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "High Court commits error in directing re-trial based on re-assessment of oral evidence in revision by private complainant.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Revisional power not to be exercised to convert acquittal into conviction indirectly; only in exceptional cases of glaring defects.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "D. Stephens v. Nosibolla",
      "citation": "1951 S.C.R. 284",
      "treatment": "followed",
      "relevance": "Limits on High Court's interference in revision against acquittal."
    },
    {
      "case_name": "Jogendranath Jha v. Polailal Biswas",
      "citation": "1951 S.C.R. 676",
      "treatment": "followed",
      "relevance": "High Court cannot convert acquittal to conviction even indirectly by re-trial."
    },
    {
      "case_name": "K. C. Reddy v. State of Andhra Pradesh",
      "citation": "1963 3 S.C.R. 412",
      "treatment": "followed",
      "relevance": "Categories of exceptional cases for interference in revision against acquittal."
    },
    {
      "case_name": "Mohendra Pratap Singh v. Sarju Singh",
      "citation": "1968 2 S.C.R. 287",
      "treatment": "followed",
      "relevance": "High Court not to re-weigh evidence in revision against acquittal."
    },
    {
      "case_name": "U.J.S. Chopra v. State of Bombay",
      "citation": "1956 2 S.C.R. 94",
      "treatment": "referred",
      "relevance": "Historical background of appeal/revision against acquittal."
    },
    {
      "case_name": "Amar Chand Aggarwal v. Shanti Bose",
      "citation": "A.I.R. 1973 S.C. 799",
      "treatment": "followed",
      "relevance": "Revisional jurisdiction exercised only in exceptional cases of glaring defect or manifest error."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "307",
        "307/109"
      ],
      "relevance": "Offences charged: attempt to murder and abetment."
    },
    {
      "name": "Code of Criminal Procedure",
      "sections": [
        "435",
        "439",
        "404",
        "417",
        "423"
      ],
      "relevance": "Revisional and appellate powers against acquittal; limits on private party interference."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Supreme Court allowed the appeal, quashed the Patna High Court's order directing re-trial, and restored the trial court's order of acquittal.",
    "relief_granted": "Acquittal restored for appellants.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "Enmity as usual is a double-edged weapon, providing motive both for the offence as well as for false implication.",
      "speaker": "court",
      "significance": "Caution in evaluating evidence in enmity cases."
    },
    {
      "text": "The High Court when approached by a private party for exercising its power of revision from an order of acquittal, should appropriately refrain from interfering except when there is a glaring legal defect of a serious nature which has resulted in grave failure, of justice.",
      "speaker": "court",
      "significance": "Defines limits of revisional jurisdiction."
    },
    {
      "text": "Trials are not to be lightly set aside when such orders expose the accused persons to a fresh trial with all its consequential harassment.",
      "speaker": "court",
      "significance": "Reason against ordering re-trial casually."
    }
  ],
  "_case_id": "1973_151",
  "_label": 1,
  "_text_length": 19473,
  "_extracted_at": "2026-02-10T20:12:13.845674"
}