{
  "metadata": {
    "case_name": "Appellant (Tenant) v. Respondent (Landlord)",
    "case_year": 1970,
    "court": "Supreme Court of India",
    "judges": [
      "PALEKAR, J."
    ],
    "case_number": "Civil Appeal No. 1475 of 1970",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "On or about September 10, 1959 the respondent landlord let out the premises in suit (a shop) to the appellant on a rent of Rs. 125/- per month.",
      "type": "background",
      "date": "1959-09-10",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On 1-9-1962 the respondent applied under section 14 of the Delhi Rent Control Act, No. 59 of 1958 to the Rent Controller, Delhi for evicting the appellant on the ground that she had sub-let the entire premises to one Sohan Singh who was running a business under the name of Royal Dispensing Chemists and Druggists in the shop and that the appellant was charging a fabulous amount as rent from her sub-tenant Sohan Singh.",
      "type": "procedural",
      "date": "1962-09-01",
      "source": "respondent"
    },
    {
      "id": "f3",
      "text": "The appellant in her written statement admitted the tenancy but denied sub-letting. She alleged that Sohan Singh was her husband and from the time of the lease the business of a Chemist was being run there in the premises by her husband and she also occasionally helped him in the running of the business.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "Rent Controller held that the appellant was the legally wedded wife of Sohan Singh or in any event they were living together as husband and wife, therefore no sub-letting. Finding confirmed in appeal by the Rent Control Tribunal, Delhi.",
      "type": "admitted",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "Respondent filed second appeal to High Court of Delhi under section 39 of the Act (Second Appeal No. 25-D of 1966). Single Judge held substantial questions of law involved relating to status of appellant as wife and whether sub-letting established, concluded there was sub-letting and ordered eviction.",
      "type": "procedural",
      "date": "1970-05-29",
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "Appellant passed a rent note in respondent's favour in 1959, in which respondent in his own handwriting wrote that the appellant was the wife of Sohan Singh. Respondent accepted typed copy as true.",
      "type": "material",
      "date": "1959",
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "To the knowledge of the respondent, the appellant and Sohan Singh were living as husband and wife. From the day the rent note was passed in 1959, a Chemist's shop was opened in the premises run principally by Sohan Singh but occasionally by the appellant also.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Respondent's first witness (Sohan Singh's first wife) had no knowledge if appellant was married to Sohan Singh but knew he lived with appellant since about six years before her 1963 deposition. Respondent admitted he never enquired if they were husband and wife and could not deny they were living together.",
      "type": "disputed",
      "date": "1963",
      "source": "respondent"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the appellant had sub-let the premises to Sohan Singh, given they were living as husband and wife and he was running the business from the inception.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the High Court in second appeal under section 39 of the Delhi Rent Control Act could interfere with the concurrent finding of fact of the Rent Control authorities, as no substantial question of law was involved.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether questions relating to the appellant's status as wife of Sohan Singh and sub-letting on facts found involved substantial questions of law.",
      "framed_by": "respondent"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The learned single Judge interfered with a pure finding of fact. Under section 39(2) of the Act the High Court could interfere in second appeal only if there was a substantial question of law. No question of law, much less substantial, involved.",
      "supporting_facts": [
        "f4",
        "f5"
      ],
      "legal_basis": "Section 39(2) of Delhi Rent Control Act, 1958"
    },
    {
      "id": "pa2",
      "text": "Simple question was whether having regard to appellant and Sohan Singh living as husband and wife, it was open to infer sub-letting in absence of contrary evidence. Sub-letting is distinct from permissive user like licensee.",
      "supporting_facts": [
        "f3",
        "f6",
        "f7"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Two substantial questions of law and fact involved: one relating to status of appellant as wife, other whether on facts found ground of sub-letting established. Appellant sub-let entire premises to Sohan Singh running business, charging fabulous rent.",
      "supporting_facts": [
        "f2"
      ],
      "legal_basis": "Section 14(1) proviso (b) and section 14(4) of Delhi Rent Control Act, 1958"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "High Court dealt with case as matrimonial proceeding; simple question was whether factual inference of sub-letting could be drawn when appellant and Sohan Singh living as husband-wife. Rash to infer sub-letting like letting from permissive user.",
      "addresses_issue": "i1",
      "key_observation": "If two persons live together as husband and wife and one owns the house allows the other to carry on business in part, rash inference to draw that owner let out that part."
    },
    {
      "id": "cr2",
      "text": "Section 14(4) not applicable: deems sub-letting only if person allowed ostensibly as partner but really for sub-letting. Not case here that appellant owner of business let in Sohan Singh as partner.",
      "addresses_issue": "i1",
      "key_observation": "Provisions have no application to facts."
    },
    {
      "id": "cr3",
      "text": "Onus on landlord to prove sub-letting. Respondent produced no evidence despite denial. Averment of wife status led to irrelevant battle on marriage, but evidence showed they lived as husband-wife to respondent's knowledge.",
      "addresses_issue": "i1",
      "key_observation": "Landlord prima facie shows exclusive possession for valuable consideration, then tenant rebuts. No such evidence here."
    },
    {
      "id": "cr4",
      "text": "Concurrent finding of no sub-letting by lower courts. No substantial question of law: status irrelevant if living as husband-wife; sub-letting determination is factual common sense inference, not mixed law-fact.",
      "addresses_issue": "i2",
      "key_observation": "Basic facts lead to negative inference of sub-letting without legal principle application."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "No sub-letting by appellant to Sohan Singh; High Court erred in interfering with concurrent factual findings absent substantial question of law under section 39(2).",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "No substantial question of law involved permitting High Court interference in second appeal.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Associated Hotels of India Ltd., Delhi v. S.B. Sardar Ranjit Singh",
      "citation": "1968 2 S.C.R. 548",
      "treatment": "followed",
      "relevance": "Onus on landlord to prove sub-letting; if prima facie exclusive possession for valuable consideration, tenant rebuts."
    },
    {
      "case_name": "Meenakshi Mills, Madurai v. The Commissioner of Income-Tax, Madras",
      "citation": "1956 S.C.R. 691",
      "treatment": "referred",
      "relevance": "In mixed question of law and fact, ultimate conclusion drawn by applying law to basic facts; here pure fact."
    }
  ],
  "statutes_cited": [
    {
      "name": "Delhi Rent Control Act, 1958",
      "sections": [
        "Section 14(1) proviso (b)",
        "Section 14(4)",
        "Section 39",
        "Section 39(2)"
      ],
      "relevance": "Grounds for eviction including sub-letting without consent; deeming provision for partnership ruse; High Court second appeal only on substantial question of law."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed, High Court order set aside, orders of Rent Controller and Tribunal restored. No sub-letting found.",
    "relief_granted": "Eviction order quashed; possession to tenant restored.",
    "costs": "Costs throughout."
  },
  "key_quotes": [
    {
      "text": "Sub-letting like letting, is a particular type of demise of immovable property and is distinct from permissive user like that of a licensee.",
      "speaker": "court",
      "significance": "Distinguishes sub-letting from family/business sharing."
    },
    {
      "text": "If two persons live together in a house as husband and wife and one of them who owns the house allows the other to carry on business in a part of it, it will be in the absence of any other evidence, a rash inference to draw that the owner has let out that part of the premises.",
      "speaker": "court",
      "significance": "Core reasoning against inferring sub-letting from spousal living arrangement."
    },
    {
      "text": "Under section 39(2) of the Act the High Court could interfere in second appeal only if there was a substantial question of law.",
      "speaker": "court",
      "significance": "Limits High Court jurisdiction, justifying reversal."
    }
  ],
  "_case_id": "1973_282",
  "_label": 1,
  "_text_length": 12985,
  "_extracted_at": "2026-02-10T20:12:51.435267"
}