{
  "metadata": {
    "case_name": "Appellant (Mahalinga Thambiran) v. Respondent (Head of Kasi Mutt)",
    "case_year": 1969,
    "court": "Supreme Court of India",
    "judges": [
      "Mathew, J."
    ],
    "case_number": "Civil Appeal No. 1677 of 1969",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant as plaintiff filed a suit for declaration that he was entitled to continue as the Elavarasu or Junior Head of the Tiruppanandal or Kasi Mutt and for perpetual injunction restraining defendant from interfering.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Defendant contended that appellant was not validly nominated as Elavarasu, acquired no right by nomination, was unworthy due to conduct, and defendant cancelled nomination.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f3",
      "text": "Trial court found nomination by Exhibit B-1 will but no status or office acquired; defendant competent to cancel even without misconduct via Exhibit B-9 will; suit dismissed.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f4",
      "text": "District Judge in appeal confirmed trial court findings and dismissed appeal.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "High Court single judge found appellant acquired status/office; termination only for good cause; no misconduct found; cancellation by B-9 ineffective; granted decree declaring appellant junior head entitled to continue subject to removal for good cause, but no declaration of succession right or injunction.",
      "type": "procedural",
      "date": "1968-01-12",
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "Division Bench of Madras High Court reversed single judge: no office acquired, nomination revocable without notice or reason; against Letters Patent Appeals Nos. 4 and 29 of 1967.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "On September 12, 1951, defendant executed Exhibit B-1 will nominating appellant as Elavarasu of Kasi Mutt, reciting ceremonies performed, and stating appellant would succeed as Head.",
      "type": "material",
      "date": "1951-09-12",
      "source": "admitted"
    },
    {
      "id": "f8",
      "text": "Till January 2, 1960, appellant functioned as Elavarasu by virtue of nomination.",
      "type": "admitted",
      "date": "1951-09-12 to 1960-01-02",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Defendant revoked B-1 by Exhibit B-9 on January 2, 1960, stating no necessity to appoint appellant as Elavarasu.",
      "type": "material",
      "date": "1960-01-02",
      "source": "respondent"
    },
    {
      "id": "f10",
      "text": "Appellant not guilty of any misconduct as found by trial court and first appellate court.",
      "type": "admitted",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Defendant died after institution of suit.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Kasi Mutt at Tiruppanandal affiliated to Dharmapuram Adhinam; custom of senior and junior heads; nomination by will with ceremonies like Manthakashyam, Deekshha, Pooja, Arukattai.",
      "type": "background",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether by virtue of the nomination, the appellant obtained a status or a right in law or became the holder of an office.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the defendant was competent to cancel the nomination without good cause.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Nomination validly made by Exhibit B-1 after ceremonies; appellant acquired status as junior head; cannot be revoked without good cause; relies on customs and precedents like Tiruvambala Desikar.",
      "supporting_facts": [
        "f7",
        "f8",
        "f10",
        "f12"
      ],
      "legal_basis": "Custom of Kasi Mutt; precedents on irrevocability except for good cause"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Nomination by will, revocable at pleasure; no status or office acquired; no essential ceremonies like Achariya Abishegam performed; appellant unworthy.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": "Indian Succession Act s.2(h); will revocable; no custom mandating irrevocability"
    },
    {
      "id": "ra2",
      "text": "Mahantship is property, nomination is testamentary disposal revocable by will.",
      "supporting_facts": [],
      "legal_basis": "Law of wills"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Nomination creates present status or relationship sui generis under Hindu Religious Endowments law, not mere will; takes effect in presenti; ceremonies not essential unless mandatory by usage.",
      "addresses_issue": "i1",
      "key_observation": "Will is record of nomination already made; invests nominee with capacity to succeed."
    },
    {
      "id": "cr2",
      "text": "Status acquired cannot be terminated at whim; revocable only for good cause, bona fide in interest of Mutt; no good cause shown here.",
      "addresses_issue": "i2",
      "key_observation": "Power to nominate and revoke must be exercised bona fide; junior head has recognized status."
    },
    {
      "id": "cr3",
      "text": "Even without Achariya Abishegam, nomination valid and irrevocable without cause; custom from Dharmapuram Adhinam applies.",
      "addresses_issue": "i1",
      "key_observation": "Ceremony confers spiritual capacity but not indefeasible right; nomination precedes."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Nomination valid, creates status of Elavarasu; cancellation by Exhibit B-9 invalid without good cause.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Appellant entitled to succeed to headship on defendant's death.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Giyana Sambendha Pandara Samadhi v. Kandasami Thambiran (Sambandha Case)",
      "citation": "I.L.R. 10 Madras 375",
      "treatment": "followed",
      "relevance": "Historical evolution of Kasi Mutt and Dharmapuram Adhinam; custom of nomination by will with ceremonies."
    },
    {
      "case_name": "Greedharee Doss v. Nandokissore Doss, Mohunt",
      "citation": "1867 M.I.A. 405",
      "treatment": "followed",
      "relevance": "Succession regulated by custom; nomination by word of mouth possible."
    },
    {
      "case_name": "Ramalingam Pillai v. Vythialingam Pillai",
      "citation": "1893 20 I.A. 150",
      "treatment": "followed",
      "relevance": "Custom governs succession; nomination bona fide."
    },
    {
      "case_name": "Vidyapurna Tirthaswami v. Vidvanidhi Tirthswami",
      "citation": "I.L.R. 27 Madras 435",
      "treatment": "followed",
      "relevance": "Nomination during lifetime or by will; analogy to coadjutor."
    },
    {
      "case_name": "Nataraja v. Kaliasam",
      "citation": "1920 48 I.A. 1",
      "treatment": "followed",
      "relevance": "Nomination bona fide in interests of Mutt."
    },
    {
      "case_name": "Tiruvambala Desikar v. Kanikkavachaka Desikar",
      "citation": "I.L.R. 40 Madras 177",
      "treatment": "followed",
      "relevance": "Junior head has status; revocable only for good cause, not arbitrarily."
    },
    {
      "case_name": "Ram Prakash Das v. Anand Das",
      "citation": "1916 43 I.A. 73",
      "treatment": "followed",
      "relevance": "Nomination bona fide."
    },
    {
      "case_name": "Vaidyanatha v. Swaminatha",
      "citation": "1924 51 I.A. 282",
      "treatment": "followed",
      "relevance": "Nomination bona fide."
    },
    {
      "case_name": "M. B. Bhagat v. G. N. Bhagat",
      "citation": "1972 2 S.C.R. 1005",
      "treatment": "followed",
      "relevance": "Ceremonies not essential for installation."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Succession Act, 1925",
      "sections": [
        "s.2(h)"
      ],
      "relevance": "Definition of will; nomination not a will as no property disposition effective after death."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Supreme Court allowed the appeal, set aside Division Bench decree, declared nomination valid and revocation invalid, appellant held status of Elavarasu during defendant's lifetime and entitled to succeed to headship on defendant's death.",
    "relief_granted": "Declaration that appellant entitled to headship of Kasi Mutt.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"A nomination takes effect in presenti. It is the declaration of the intention of the head of the Mutt for the time being as to who his successor would be.\"",
      "speaker": "court",
      "significance": "Core reasoning on nature of nomination distinguishing from revocable will."
    },
    {
      "text": "\"We hold that a nomination when made can be cancelled or revoked only for a good cause and, as admittedly, there was no good cause shown in this case.\"",
      "speaker": "court",
      "significance": "Holding on irrevocability without good cause."
    },
    {
      "text": "\"The junior heads as a class occupy a position of which the creation, continuance or relinquishment, and its principal incident, namely, succession to the office of the headship of the Mutt are matters of sufficient social or public concern.\"",
      "speaker": "court",
      "significance": "Explains status in context of Hindu religious community interest."
    }
  ],
  "_case_id": "1973_420",
  "_label": 1,
  "_text_length": 41718,
  "_extracted_at": "2026-02-10T20:14:19.479647"
}