{
  "metadata": {
    "case_name": "Saraspur Mills v. Ramanlal Chimanlal and others",
    "case_year": 1968,
    "court": "Supreme Court of India",
    "judges": [
      "GROVER, J"
    ],
    "case_number": "Civil Appeal No. 1957 of 1968",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Ramanlal Chimanlal and others are the workers of a canteen which is run by the Saraspur Mills Canteen Co-operative Society Limited, Ahmedabad (hereinafter called the co-operative society).",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The appellant company is responsible for maintaining the canteen under the provisions of S. 46 of the Factories Act and the rules made thereunder.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The appellant handed over to the co-operative society the task of running the canteen.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The workers filed an application before the 2nd Labour Court at Ahmedabad under S. 79 of the Bombay Industrial Relations Act, 1946 (hereinafter called the Act), complaining that the appellant was not paying them the wages and dearness allowances as per the directions contained in the Award of the Bombay Industrial Court made in Reference No. 18 of 1947 and supplementary Awards given in certain miscellaneous applications of 1956 and 1962 respectively relating to additional wages sanctioned by the said Award.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "By virtue of certain amendments made in the Act in the definition of the word 'employer' they became workers of the appellant, which was bound to pay wages and dearness allowances settled by the aforesaid Award and the supplementary Awards.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "The appellant was running the canteen only because it was under an obligation to do so under the Factories Act and the rules made thereunder. Thus the running of the canteen was an ordinary part of the undertaking of the appellant.",
      "type": "material",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "The appellant denied the allegations of the workmen that they were its employees. The aforesaid workers had never been employed either by the appellant or by its agent or contractor.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "The workers in fact were stated to have been employed by the licensees of the appellant and, therefore, there was no question of the wage settlements or Awards being binding on the appellant.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f9",
      "text": "The 2nd Labour Court by its Order dated 14th April, 1966 dismissed the claim of the workmen.",
      "type": "procedural",
      "date": "1966-04-14",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "The workmen filed an appeal before the Industrial Court, which was allowed by its order dated 26th March, 1968.",
      "type": "procedural",
      "date": "1968-03-26",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "The Industrial Court held that the employees of the co-operative society, who were working in the canteen were employees of the appellant and, their wages and dearness allowance etc. were payable in accordance with the Awards mentioned before. The direction was made that the appellant should pay the difference in wages and dearness allowance in accordance with those Awards.",
      "type": "procedural",
      "date": "1968-03-26",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Appeal by special leave from the Award dated March 26, 1968 of the Industrial Court Gujarat Ahmedabad in Appeal IC No. 58 of 1966.",
      "type": "procedural",
      "date": "1968-03-26",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the canteen workers employed by the co-operative society could be treated as employees of the appellant within the meaning of the relevant provisions of the Act for the purpose of payment of their wages in spite of the fact that they are employees of the co-operative society and were being paid wages by that society.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "On a proper construction of the amended clauses (13) and (14) of Section 3 of the Act, the workers, employed in the canteen which was being run by the co-operative society, could not have been held to be employees of the appellant.",
      "supporting_facts": [
        "f2",
        "f3",
        "f7",
        "f8"
      ],
      "legal_basis": "Section 3(13) and 3(14) Bombay Industrial Relations Act, 1946 (as amended); Section 46 Factories Act"
    },
    {
      "id": "pa2",
      "text": "The appellant was under a statutory obligation because of section 46 of the Factories Act and the relevant rules made thereunder to maintain the Canteen for the workers, but the canteen was being actually run by the co-operative society and the appellant had nothing to do with it nor did it pay any wages to the employees of the society who were working in the canteen.",
      "supporting_facts": [
        "f2",
        "f3"
      ],
      "legal_basis": "Section 46 Factories Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "By virtue of certain amendments made in the Act in the definition of the word employer they became workers of the appellant, which was bound to pay wages and dearness allowances settled by the aforesaid Award and the supplementary Awards.",
      "supporting_facts": [
        "f2",
        "f4",
        "f5",
        "f6"
      ],
      "legal_basis": "Amendments to Section 3(13) and 3(14) Bombay Industrial Relations Act, 1946"
    },
    {
      "id": "ra2",
      "text": "The term employee under the Act had been given an extended meaning. An employee was not only a person who was employed by the employer or over whom the employer had control, but also certain types of persons had been constituted statutory employees under the Act.",
      "supporting_facts": [
        "f2",
        "f3"
      ],
      "legal_basis": "Amended Section 3(13) and 3(14) Bombay Industrial Relations Act, 1946"
    },
    {
      "id": "ra3",
      "text": "Conditions fulfilled: (1) the owner of the undertaking must entrust to any person the execution of the whole or any part of any work; (2) such entrustment must be in the course of or for the purpose of conducting the undertaking; (3) such entrustment must be otherwise than as the servant or agent of the owner; and (4) such work must be any work which is ordinarily a part of the undertaking.",
      "supporting_facts": [
        "f2",
        "f3"
      ],
      "legal_basis": "Amended Section 3(14)(e) Bombay Industrial Relations Act, 1946"
    },
    {
      "id": "ra4",
      "text": "There was a statutory obligation on the part of the mills to provide a canteen and this obligation had been discharged by the mills by entrusting that task to the co-operative society.",
      "supporting_facts": [
        "f2",
        "f3"
      ],
      "legal_basis": "Section 46 Factories Act; Statement of Objects and Reasons of Amending Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The matter seems to be concluded by the judgment of this Court in Civil Appeal No. 1044 of 1968 decided on April 14, 1972, in which an identical argument had been addressed that certain gardeners who had been employed by a contractor for working in the gardens of the textile mills, could not be said to fall within the definition of the word 'employed' as contained in Section 3(13) of the Act.",
      "addresses_issue": "i1",
      "key_observation": "Identical situation governed by prior Supreme Court judgment."
    },
    {
      "id": "cr2",
      "text": "Reference was made to the decision in Basti Sugar Mills Ltd. v. Ram Ujagar and Ors., where workmen employed by a contractor fell within the definition as persons employed in the industry to do manual work for reward, and the work was ordinarily part of the industry.",
      "addresses_issue": "i1",
      "key_observation": "Workmen engaged in work incidentally connected with main industry are workmen if statutory requirements satisfied."
    },
    {
      "id": "cr3",
      "text": "The High Court in Ahmedabad Mfg. Calico Printing Co. Ltd. Ors v. Their Workmen had relied on the above ratio and came to the conclusion that the workers in order to come within the definition of an employee need not necessarily be directly connected with the manufacture of textile fabrics.",
      "addresses_issue": "i1",
      "key_observation": "Amenities like gardens supplied to officers are incidentally connected."
    },
    {
      "id": "cr4",
      "text": "Since, under the Factories Act it was the duty of the appellant to run and maintain the canteen for the use of its employees, it appears to us that the ratio of the decision in Ahmedabad Manufacturing Calico Printing Co. Ltd. v. Their Workmen would be fully applicable in which the same provisions of the Act were considered.",
      "addresses_issue": "i1",
      "key_observation": "Running canteen is statutory duty, hence ordinarily part of undertaking."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The canteen workers employed by the co-operative society are employees of the appellant within the meaning of amended Section 3(13) read with Section 3(14) of the Bombay Industrial Relations Act, 1946, and entitled to wages and dearness allowance as per the Awards.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Civil Appeal No. 1044 of 1968",
      "citation": null,
      "treatment": "followed",
      "relevance": "Identical argument on gardeners employed by contractor; held to be employees under Section 3(13)"
    },
    {
      "case_name": "Basti Sugar Mills Ltd. v. Ram Ujagar and Ors.",
      "citation": "1964 2 S.C.R. 838",
      "treatment": "followed",
      "relevance": "Workmen employed by contractor for work ordinarily part of industry are workmen under similar definition in U.P. Industrial Disputes Act"
    },
    {
      "case_name": "Ahmedabad Mfg. Calico Printing Co. Ltd. Ors v. Their Workmen",
      "citation": "1953 I.L.L.J. 647",
      "treatment": "followed",
      "relevance": "Workers need not be directly connected with manufacture; amenities workers covered under the Act"
    }
  ],
  "statutes_cited": [
    {
      "name": "Bombay Industrial Relations Act, 1946",
      "sections": [
        "Section 3(13)",
        "Section 3(14)",
        "Section 79"
      ],
      "relevance": "Definition of 'employee' and 'employer' extended by 1962 amendment to include workers of persons entrusted with ordinarily part of undertaking work; application filed under S.79"
    },
    {
      "name": "Factories Act, 1948",
      "sections": [
        "Section 46",
        "Section 2(1)",
        "Section 2(n)"
      ],
      "relevance": "Statutory obligation on occupier to maintain canteen; definition of 'worker' directly or through agency"
    },
    {
      "name": "Bombay Industrial Disputes Act, 1938",
      "sections": [],
      "relevance": "Repealed by the Act; previously no statutory employees, only direct employees"
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal is dismissed with costs. The order of the Industrial Court holding canteen workers as employees of the appellant and directing payment of wages and dearness allowance as per Awards is upheld.",
    "relief_granted": "Workers entitled to difference in wages and dearness allowance as per Awards (upheld)",
    "costs": "Dismissed with costs"
  },
  "key_quotes": [
    {
      "text": "The only question which requires determination is whether the canteen workers employed by the co-operative society could be treated as employees of the appellant within the meaning of the relevant provisions of the Act",
      "speaker": "court",
      "significance": "Frames the core legal issue"
    },
    {
      "text": "The matter seems to be concluded by the judgment of this Court in Civil Appeal No. 1044 of 1968 decided on April 14, 1972",
      "speaker": "court",
      "significance": "Relies on binding precedent to decide the case"
    },
    {
      "text": "Since, under the Factories Act it was the duty of the appellant to run and maintain the canteen for the use of its employees, it appears to us that the ratio of the decision in Ahmedabad Manufacturing Calico Printing Co. Ltd. v. Their Workmen would be fully applicable",
      "speaker": "court",
      "significance": "Applies precedent to facts, leading to dismissal"
    }
  ],
  "_case_id": "1973_103",
  "_label": 0,
  "_text_length": 12009,
  "_extracted_at": "2026-02-10T20:11:40.567338"
}