{
  "metadata": {
    "case_name": "U.P. State Electricity Board v. Official Liquidator of the Lower Ganges Jamuna Electricity Distributing Co. Ltd.",
    "case_year": 1967,
    "court": "Supreme Court of India",
    "judges": [
      "ALAGIRISWAMI, J."
    ],
    "case_number": "Civil Appeal No. 1201 of 1967",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The respondent company went into liquidation in 1937 and had been administered by the Official Liquidator.",
      "type": "background",
      "date": "1937",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The appellant Board purchased the undertaking on 1-6-1961 for a sum of Rs. 7,82,256/- as mutually agreed.",
      "type": "material",
      "date": "1961-06-01",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Disputes arose about certain reserves of the company, specifically the Development Reserve amounting to Rs. 1,45,422/-, which was finally agreed as the correct figure.",
      "type": "disputed",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Development Reserve created under clause VA of the Sixth Schedule to the Electricity Supply Act, 1948, introduced by amendment in 1957.",
      "type": "background",
      "date": "1957",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The Development Reserve was used in adding to the assets of the Electricity Undertaking by investment in the business of electricity supply.",
      "type": "admitted",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f6",
      "text": "No allegation that the Development Reserve was used for any purpose other than investment in the business of electricity supply, or dissipated, misappropriated, or spent on impermissible items.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "The whole of the Development Reserve has gone into the creation of assets which enhanced the value of the undertaking, benefiting the appellant Board.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Allahabad High Court Single Judge and Division Bench overruled the appellant's contention in Special Appeal No. 727 of 1962, judgment dated December 5, 1963.",
      "type": "procedural",
      "date": "1963-12-05",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the Development Reserve of Rs. 1,45,422/- should be handed over to the purchaser (appellant Board) or deducted from the purchase price, even though it has been utilized in investment in the business of electricity supply and converted into assets passed to the Board.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The Board insisted that a sum of Rs. 1,45,422/- in the Development Reserve should be handed over to it or deducted from the purchase price under clause VA of the Sixth Schedule to the Electricity Supply Act, 1948.",
      "supporting_facts": [
        "f2",
        "f3",
        "f4"
      ],
      "legal_basis": "Clause VA, Sixth Schedule, Electricity Supply Act, 1948; Section 7A, Indian Electricity Act, 1910"
    },
    {
      "id": "pa2",
      "text": "Language in clause VA regarding Development Reserve is different from clauses II, III and IV dealing with other reserves, requiring it to be handed over.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": "Sixth Schedule, Electricity Supply Act, 1948"
    },
    {
      "id": "pa3",
      "text": "Section 70 of the 1948 Act supports handing over the Development Reserve.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": "Section 70, Electricity Supply Act, 1948"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The Development Reserve had been used in adding to the assets of the Electricity Undertaking, so that amount could not be paid separately.",
      "supporting_facts": [
        "f5",
        "f7"
      ],
      "legal_basis": "Clause VA(3), Sixth Schedule, Electricity Supply Act, 1948"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Under sub-cl. 3 of clause VA, the Development Reserve shall be available only for investment in the business of electricity supply of the undertaking, and there is no prohibition against using it for that purpose.",
      "addresses_issue": "i1",
      "key_observation": "No allegation of misuse; entire reserve invested permissibly in business, enhancing assets acquired by Board."
    },
    {
      "id": "cr2",
      "text": "The Development Reserve can be handed over only if available; a notional amount cannot be handed over. It has been converted into other assets passed to the Board.",
      "addresses_issue": "i1",
      "key_observation": "Board cannot be paid twice: once in assets created from reserve, again in cash."
    },
    {
      "id": "cr3",
      "text": "No distinction in language of clause VA compared to other clauses that requires payment of accumulated Development Reserve even if used in tangible assets passed to purchaser.",
      "addresses_issue": "i1",
      "key_observation": "Principle clear; agrees with Division Bench observations."
    },
    {
      "id": "cr4",
      "text": "Provision introduced in 1957; language does not create difficulty in interpretation.",
      "addresses_issue": "i1",
      "key_observation": "No amount left in cash; cannot direct payment to Board."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Official Liquidator cannot be directed to pay any amount to the appellant Board as representing the Development Reserve, as it has been fully utilized in permissible investments enhancing the undertaking's value acquired by the Board.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Electricity Supply Act, 1948",
      "sections": [
        "Sixth Schedule clause VA",
        "Section 70"
      ],
      "relevance": "Governs creation, use, and handling of Development Reserve on purchase of undertaking; reserve available for investment in business and handed over only if available."
    },
    {
      "name": "Indian Electricity Act, 1910",
      "sections": [
        "Section 7A(2)"
      ],
      "relevance": "Market value of undertaking payable without addition for compulsory purchase, goodwill, or profits."
    },
    {
      "name": "Indian Income-tax Act, 1922",
      "sections": [
        "Section 10(2)(vi)b"
      ],
      "relevance": "Development rebate entitlement basis for appropriating to Development Reserve."
    },
    {
      "name": "Finance Act, 1955",
      "sections": [],
      "relevance": "Introduced provision for development rebate in Income Tax Act."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court dismissed the appeal, affirming the Allahabad High Court's judgment that the appellant Board is not entitled to payment or deduction of the Development Reserve amount, as it was permissibly invested in the undertaking's assets already acquired by the Board.",
    "relief_granted": "None to appellant; in favor of respondent Official Liquidator.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The demand of the Board really amounts to saying that it must be paid twice over, once in the form of the assets created out of the Development Reserve, which it has already had, and again the same Development Reserve in cash as though it is still available in cash.",
      "speaker": "court",
      "significance": "Captures core reasoning against double payment."
    },
    {
      "text": "The Development Reserve can be handed over to the purchaser only if it is available. A notional amount cannot be handed over.",
      "speaker": "court",
      "significance": "Clarifies condition for handing over reserve."
    },
    {
      "text": "The principle is so clear that it does not lend itself to any argument whatsoever.",
      "speaker": "court",
      "significance": "Emphasizes obviousness of interpretation."
    }
  ],
  "_case_id": "1973_170",
  "_label": 0,
  "_text_length": 8668,
  "_extracted_at": "2026-02-10T20:12:07.013533"
}