{
  "metadata": {
    "case_name": "Commissioner of Income Tax v. M/s. Vadde Pullaiah & Co.",
    "case_year": 1970,
    "court": "Supreme Court of India",
    "judges": [
      "HEGDE, J."
    ],
    "case_number": "Civil Appeals Nos.1682 to 1684 of 1970",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Up to and including the assessment year 1953-54 business was carried on by Vadde Pallaiah. He was assessed as an individual.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On March 20-3-1953 Vadde Pallaiah entered into a partnership consisting of himself and three others known as M/s. Vadde Pullaiah Co. In that partnership Pallaiah had 8 as. share and out of the remaining three partners two had 3 as. share each and one had 2 as. share.",
      "type": "material",
      "date": "1953-03-20",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "For the assessment years 1954-55, 1955-56 and 1956-57, this firm filed returns of income as a firm. It also applied for registration under section 26A.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The Income-tax Officer rejected the application for registration holding that there was no genuine firm. He concluded that the business was exclusively that of Pallaiah. He accordingly assessed Pallaiah as an individual in respect of the income earned in that business.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "As against that order both the firm as well as Pallaiah went up in appeal to the Appellate Assistant Commissioner.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The Appellate Assistant Commissioner after examining the material before him came to the conclusion that the firm in question was a genuine firm. Consequently, he allowed the appeal of the firm as well as that of Pallaiah. In the firm's appeals, he directed the Income-tax Officer to register that firm and in Pallaiah's appeal he set aside the assessment made on him. In the operative portion of his order he stated: 'The Income-tax Officer is directed to adopt the correct share of income of the appellant from this firm.' But in the body of his order he specifically held that the business in question was carried on by the firm and not by Pallaiah.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "After this order was made, the Income-tax Officer proceeded to assess the firm in respect of the income earned by that firm during the assessment years 1954-55, 1955-56 and 1956-57.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "When the Income-tax Officer initiated proceedings against the firm for the purpose of assessment, the firm resisted the same taking the plea that the proceedings in question is barred by limitation under section 34(3) of the Act. The ITO rejected that contention.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Aggrieved by that order the firm went up in appeal to the Appellate Assistant Commissioner. The Appellate Assistant Commissioner upheld the contention of the assessee and set aside the order of the Income-tax Officer.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "As against that order the Income tax Officer went up in appeal to the Income-Tax Appellate Tribunal. The Tribunal partly accepted the appeal of the Income-tax Officer. It came to the conclusion that the assessment in respect of assessment years 1955-56 and 1956-57 are not barred in view of the Second Proviso to section 34(3) of the Act. But it opined that the assessment in respect of the assessment year 1954-55 was barred by limitation.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Aggrieved by the decision of the Tribunal both the Commissioner of Income-tax as well as the assessee moved the Tribunal under section 66(1) of the Act to refer certain questions of law to the High Court of Andhra Pradesh. The Tribunal submitted the question: 'Whether on the facts and the circumstances of the case, the assessment made on the firms, for each of the assessment years 1954-55, 1955-56 and 1956-57, are valid in law?' to the High Court.",
      "type": "procedural",
      "date": "1969-10-03",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "The High Court has answered that question in favour of the assessee. It came to the conclusion that the impugned assessments were barred by time and they are not saved by the Second Proviso to sub-section (3) of section 34 of the Act.",
      "type": "procedural",
      "date": "1969-10-03",
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Pulliah was the dominant partner of the firm as found by the Tribunal. He had 8 as. share in the firm. He was the original owner of the firm.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether on the facts and the circumstances of the case, the assessment made on the firms, for each of the assessment years 1954-55, 1955-56 and 1956-57, are valid in law?",
      "framed_by": "tribunal"
    },
    {
      "id": "i2",
      "text": "Whether the assessee's case is covered by the Second Proviso to section 34(3) of the Indian Income Tax Act, 1922?",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether the order made by the Income-tax Officer was in consequence of a finding given by the Appellate Assistant Commissioner?",
      "framed_by": "court"
    },
    {
      "id": "i4",
      "text": "Whether the firm can be considered as one of the persons coming within the scope of the Second Proviso to section 34(3)?",
      "framed_by": "court"
    },
    {
      "id": "i5",
      "text": "What does the expression 'finding' in the Second Proviso to sub-section (3) of section 34 of the Act mean?",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The assessments are saved by the Second Proviso to section 34(3) as the ITO's order was in consequence of a finding by the AAC that the business was carried on by the firm and not Pallaiah, which was necessary for disposal of the appeals.",
      "supporting_facts": [
        "f6",
        "f13"
      ],
      "legal_basis": "Second Proviso to section 34(3); precedents like Murlidhar Bhagwan Das"
    },
    {
      "id": "pa2",
      "text": "The firm is intimately connected with Pallaiah and comes within 'any person' in the proviso.",
      "supporting_facts": [
        "f2",
        "f13"
      ],
      "legal_basis": "Second Proviso to section 34(3)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The proceedings against the firm are barred by limitation under section 34(3).",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": "Section 34(3)"
    },
    {
      "id": "ra2",
      "text": "The AAC did not give any direction to assess the assessee; the finding does not qualify under the Second Proviso.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": "Second Proviso to section 34(3)"
    },
    {
      "id": "ra3",
      "text": "The firm was a stranger to Pallaiah's assessment.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": "Second Proviso to section 34(3)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The finding by the AAC that the business was carried on by the firm and not Pallaiah was necessary for deciding both appeals before him.",
      "addresses_issue": "i3",
      "key_observation": "The question before the AAC was whether the business was that of the firm or Pallaiah; he had only two alternatives."
    },
    {
      "id": "cr2",
      "text": "A 'finding' under the Second Proviso must be one necessary for the disposal of the appeal, as per precedents like Murlidhar Bhagwan Das, Sivalingam Chettiar, and Daffadar Bhagat Singh.",
      "addresses_issue": "i5",
      "key_observation": "Finding is a decision on a material question necessary for passing the final order, subject of controversy between parties."
    },
    {
      "id": "cr3",
      "text": "The firm comes within 'any person' in the proviso as Pallaiah was dominant partner with 8 as. share, original owner, and intimately connected; appeals involved both Pallaiah and firm.",
      "addresses_issue": "i4",
      "key_observation": "'Any person' refers to one liable for whole or part of income in the assessment under appeal, intimately connected."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The assessee's case is covered by the Second Proviso to section 34(3); the assessments are valid in law.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "The finding given by the AAC was necessary for deciding the appeals.",
      "resolves_issue": "i3",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h3",
      "text": "The firm is a person within the scope of the Second Proviso.",
      "resolves_issue": "i4",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Income-Tax Officer, A-Ward, Sitapur v. Murlidhar Bhagwan Das",
      "citation": "52 I.T.R. 335",
      "treatment": "followed",
      "relevance": "Meaning of 'finding' and 'any person' in Second Proviso to s34(3)"
    },
    {
      "case_name": "Pt. Hazari Lal v. Income-Tax Officer, Kanpur",
      "citation": null,
      "treatment": "followed",
      "relevance": "Scope of 'finding' as material question necessary for decision, subject of controversy"
    },
    {
      "case_name": "N.K.T. Sivalingam Chettiar v. Commissioner of Income-tax, Madras",
      "citation": "66 I.T.R. 586",
      "treatment": "followed",
      "relevance": "Finding must be necessary for disposal of appeal for particular year"
    },
    {
      "case_name": "Daffadar Bhagat Singh and Sons v. Income-tax Officer, A Ward Ferozepore",
      "citation": "71 I.T.R. 417",
      "treatment": "followed",
      "relevance": "Finding must be necessary for deciding the appeal"
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income Tax Act, 1922",
      "sections": [
        "Section 66(1)",
        "Section 26A",
        "Section 34(3)",
        "Section 31",
        "Section 27",
        "Section 33",
        "Section 33A",
        "Section 33B",
        "Section 66A"
      ],
      "relevance": "Governs reference, registration, limitation for assessment, and Second Proviso excluding limitation for assessments to give effect to findings/directions"
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Supreme Court set aside the order of the Andhra Pradesh High Court, vacated its answer, and answered the referred question in the affirmative and in favour of the Revenue (appellant).",
    "relief_granted": "Assessments held valid; question answered for Revenue.",
    "costs": "Appellant will get his costs from the Respondent. One hearing fee."
  },
  "key_quotes": [
    {
      "text": "'The word finding, interpreted in the sense indicated by us above, will only cover material questions which arise in a particular case for decision by the authority hearing the case or, the appeal which, being necessary for passing the final order or giving the final decision in the appeal, has been the subject of controversy between the interested parties or on which the parties concerned have been given a hearing.'",
      "speaker": "court",
      "significance": "Defines 'finding' under Second Proviso to s34(3)"
    },
    {
      "text": "We vacate the answer given by the High Court and answer the question referred to in the affirmative and in favour of the Revenue.",
      "speaker": "court",
      "significance": "Final holding on validity of assessments"
    }
  ],
  "_case_id": "1973_379",
  "_label": 1,
  "_text_length": 13735,
  "_extracted_at": "2026-02-10T20:13:30.279588"
}