{
  "metadata": {
    "case_name": "State of Uttar Pradesh v. Badlu & Ors.",
    "case_year": 1970,
    "court": "Supreme Court of India",
    "judges": [
      "CHANDRACHUD, J."
    ],
    "case_number": "Criminal Appeal No.215 of 1970",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Incident occurred at about 11.30 p.m. on August 27, 1968 in village Kunwarpur, district Lucknow, a tiny village consisting of ten houses.",
      "type": "material",
      "date": "1968-08-27",
      "source": "prosecution"
    },
    {
      "id": "f2",
      "text": "Complainant Thakur Kanahaiya Bux Singh lived with his family in one house; three houses occupied by five accused: Badlu, Manohar, Chhotey Lal, Jagannath and Dhaniram; remaining five accused from neighbouring villages.",
      "type": "background",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f3",
      "text": "Disputes between complainant and Bindra Ahir over a plot of land, leading to proceedings under sections 107 and 117 CrPC; Manohar is Bindra's son, two accused his brothers, two cousins, three brothers-in-law; all accused connected inter se.",
      "type": "background",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f4",
      "text": "On evening of August 27, Vishwanath Panda and mother Birja arrived at complainant's house as routine visit; Vishwanath's father was family priest of complainant, continued by Vishwanath; Birja accompanied him; Vishwanath and father also priests of Kunwarpur accused.",
      "type": "background",
      "date": "1968-08-27",
      "source": "prosecution"
    },
    {
      "id": "f5",
      "text": "Sleeping arrangements on terrace roofs: North-western roof - complainant, brother Kishan Pal Singh, sister Chandrawali; North-eastern roof - Vishwanath Panda, Birja, Ram Dulari (complainant's mother), Raja Munni (her sister); South-western roof - Bhagwan Bux Singh (12-year-old brother), servant Ram Gopal.",
      "type": "material",
      "date": "1968-08-27",
      "source": "prosecution"
    },
    {
      "id": "f6",
      "text": "Ten accused climbed to roof using ladder on south-eastern side, divided into two groups: Group 1 (Badlu, Manohar, Chhotey Lal, Putti Lal, Hira Lal) assaulted Vishwanath (murdered), Birja, Ram Dulari, Raja Munni; Group 2 (Dhani Ram, Jagannath, Daya Shanker, Mohan Lal, Hari Prasad) murdered Ram Gopal, injured Bhagwan Bux Singh.",
      "type": "material",
      "date": "1968-08-27",
      "source": "prosecution"
    },
    {
      "id": "f7",
      "text": "Complainant, Kishan Pal Singh, Chandrawali escaped to nearby Chhappar, concealed with old clothes, peeped through opening to watch incident.",
      "type": "disputed",
      "date": "1968-08-27",
      "source": "prosecution"
    },
    {
      "id": "f8",
      "text": "Lantern burning near Vishwanath's sleeping place; accused identified in its light by Kanahaiya Bux Singh, Chandrawali, Kishan Pal Singh, Birja, Raja Munni, Bhagwan Bux Singh, Ram Dulari (PW 1-5,7,8).",
      "type": "disputed",
      "date": "1968-08-27",
      "source": "prosecution"
    },
    {
      "id": "f9",
      "text": "Injuries: Vishwanath - two incised on head, long linear cut on chest; Ram Gopal - 17 incised, linear cut, contusion; Birja - 3 incised, lacerated wound, abrasion (skin-deep); Ram Dulari - 3 incised (one muscle-deep, one bone-deep); Raja Munni - muscle-deep incised behind right ear; Bhagwan Bux - one incised.",
      "type": "material",
      "date": "1968-08-27",
      "source": "prosecution"
    },
    {
      "id": "f10",
      "text": "FIR lodged by complainant at Itaunja PS at 9.15 a.m. on August 28 via Chaukidar's son; names all accused, weapons mentioned.",
      "type": "procedural",
      "date": "1968-08-28",
      "source": "prosecution"
    },
    {
      "id": "f11",
      "text": "Sessions Court: accepted eyewitness evidence, found unlawful assembly with common object to murder Kanahaiya Bux Singh and hurt family; murdered Vishwanath by mistake, murdered Ram Gopal; 5 Kunwarpur accused - death; others - life imprisonment.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Allahabad High Court Lucknow Bench in Criminal Appeals 35 & 36 of 1970: set aside conviction, acquitted all accused.",
      "type": "procedural",
      "date": "1970-05-12",
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "One accused Putti Lal died during pendency of SC appeal.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Sessions Court finding: admitted that without light, not possible to identify assailants.",
      "type": "admitted",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f15",
      "text": "FIR mentions Birju Pasi, Ganeshi Pasi and others responded to alarm; complainant told Sessions Court he narrated to them; neither examined.",
      "type": "background",
      "date": "1968-08-28",
      "source": "prosecution"
    },
    {
      "id": "f16",
      "text": "Complainant's wife, daughter, Chandrawali's children slept on ground floor.",
      "type": "background",
      "date": "1968-08-27",
      "source": "prosecution"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether a lantern was burning at the scene enabling identification of the accused.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the murders and assaults fit the alleged motive of targeting Kanahaiya Bux Singh and family, including mistaken identity of Vishwanath Panda.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Credibility of eyewitness identification under the circumstances.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Birja is independent witness with no motive to falsely implicate accused; her evidence on identification must be accepted.",
      "supporting_facts": [
        "f4",
        "f8"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Examine evidence apart from mistaken identity theory.",
      "supporting_facts": [
        "f6",
        "f9"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "No lantern, impossible to identify assailants in darkness; admitted by Sessions Court.",
      "supporting_facts": [
        "f14"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "No motive to murder Vishwanath Panda or injure Birja, their family priest; mistaken identity implausible if lantern burning.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": null
    },
    {
      "id": "ra3",
      "text": "Target was Kanahaiya but he escaped easily despite 10 accused; improbable eyewitness story of hiding in Chhappar and watching.",
      "supporting_facts": [
        "f7",
        "f16"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Fate of case depends on lantern; High Court right that its existence in grave doubt; without light, no identification possible.",
      "addresses_issue": "i1",
      "key_observation": "Sessions Court admitted no light means no identification."
    },
    {
      "id": "cr2",
      "text": "No motive to assault Vishwanath/Birja; if lantern near, impossible to mistake; continued assault after Birja identified him shows not mistake.",
      "addresses_issue": "i2",
      "key_observation": "Accused knew Vishwanath intimately as their priest."
    },
    {
      "id": "cr3",
      "text": "Improbable complainant group slept on roof and hid in Chhappar peeping; likely on ground floor with family.",
      "addresses_issue": "i3",
      "key_observation": "No effort to pursue complainant after murders."
    },
    {
      "id": "cr4",
      "text": "Birja independent but no lantern means no identification; influenced by neighbors' guesses.",
      "addresses_issue": "i3",
      "key_observation": "FIR witnesses like Birju/Ganeshi not examined."
    },
    {
      "id": "cr5",
      "text": "Cannot discard prosecution's own mistaken identity foundation to construct new theory.",
      "addresses_issue": "i2",
      "key_observation": "Motive pattern doesn't fit."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Occurrence under cover of darkness; no light, no identification; accused entitled to benefit of doubt.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Prosecution case foundation (mistaken identity, motive against complainant) fails; acquittal justified.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Criminal Procedure Code",
      "sections": [
        "107",
        "117"
      ],
      "relevance": "Background disputes leading to enmity."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court agrees with High Court acquittal; confirms order giving accused benefit of doubt due to doubt on lantern and identification; dismisses State's appeal; cancels bail bonds, releases any jailed accused.",
    "relief_granted": "Acquittal upheld for all accused (one deceased).",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "As criminal cases go, this is an interesting case in the sense that it offers for solution a riddle of many facets. And since many answers reasonably come to mind, the accused would appear to be entitled to the benefit of that perplexity.",
      "speaker": "court",
      "significance": "Sets tone for benefit of doubt due to perplexities."
    },
    {
      "text": "The fate of the entire case depends on the question whether a lantern was burning near the place where Vishwanath Panda was sleeping.",
      "speaker": "court",
      "key_observation": "Central issue determining identification."
    },
    {
      "text": "We therefore confirm the order of acquittal under which the accused have been given the benefit of doubt and dismiss this appeal.",
      "speaker": "court",
      "significance": "Final disposition upholding acquittal."
    }
  ],
  "_case_id": "1973_354",
  "_label": 0,
  "_text_length": 16259,
  "_extracted_at": "2026-02-10T20:13:34.891595"
}