{
  "metadata": {
    "case_name": "Unnamed Appellant v. State",
    "case_year": 1970,
    "court": "Supreme Court of India",
    "judges": [
      "Dua, J."
    ],
    "case_number": "Criminal Appeal No. 18 of 1970",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant, an industrialist, had factory at Bunder Road, Jamnagar, with adjoining residential bungalow.",
      "type": "background",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f2",
      "text": "During 1965 Pakistan bombardment of Jamnagar, Mohini's parents resided temporarily at Dhrol near Jamnagar.",
      "type": "background",
      "date": "1965",
      "source": "prosecution"
    },
    {
      "id": "f3",
      "text": "Appellant introduced to Mohini's family; on December 18, 1965 (Mohini's birthday), presented her with Parker pen; Mohini below 15 years, school-going girl; returned pen at mother's instance.",
      "type": "background",
      "date": "1965-12-18",
      "source": "prosecution"
    },
    {
      "id": "f4",
      "text": "Appellant took Mohini, her father Liladhar Jivraj, manager Tribhovandas, Malti (Tribhovandas' 12-year-old daughter), and Harish (Malti's brother) to Baroda in his car for land purchase transaction; impression created that Liladhar would be employed as manager.",
      "type": "background",
      "date": "December 1965",
      "source": "prosecution"
    },
    {
      "id": "f5",
      "text": "Party spent night in Baroda, returned to Jamnagar next morning.",
      "type": "background",
      "date": "December 1965",
      "source": "prosecution"
    },
    {
      "id": "f6",
      "text": "During Christmas 1965, appellant took same party to Bombay; stayed 2 nights at Metropolitan Hotel; prosecution alleges appellant, Mohini, Malti slept in one room, others in another; appellant had sexual intercourse with Mohini those nights.",
      "type": "disputed",
      "date": "Christmas 1965",
      "source": "prosecution"
    },
    {
      "id": "f7",
      "text": "Appellant purchased two skirts and waist bands for Mohini and Malti in Bombay.",
      "type": "disputed",
      "date": "Christmas 1965",
      "source": "prosecution"
    },
    {
      "id": "f8",
      "text": "Appellant had sexual intercourse with Mohini in March 1966 at his bungalow around 7 PM when she visited.",
      "type": "disputed",
      "date": "1966-03",
      "source": "prosecution"
    },
    {
      "id": "f9",
      "text": "Mohini visited appellant's place off and on.",
      "type": "background",
      "date": "1966",
      "source": "prosecution"
    },
    {
      "id": "f10",
      "text": "Summer vacation 1966, appellant took Mohini, her parents, and his daughter Rekha to Mahabaleshwar in car; stopped Bombay 2 days en route; stayed Mahabaleshwar 2 days; return halted Bombay one night, then Mount Abu one day; all slept one room; at 3 AM, Mohini's mother saw appellant sleeping by Mohini with hand on her head; restrained from speaking per appellant's prior request.",
      "type": "disputed",
      "date": "Summer 1966",
      "source": "prosecution"
    },
    {
      "id": "f11",
      "text": "Next day to Ambaji, then Jamnagar; Mohini's mother informed husband; he rebuked Mohini; mother warned her.",
      "type": "material",
      "date": "Summer 1966",
      "source": "prosecution"
    },
    {
      "id": "f12",
      "text": "Appellant, learning parents' feelings, said Mohini like his daughter Rekha; took father, Mohini, Rekha to Dattatraya temple, swore on their heads they were his daughters.",
      "type": "material",
      "date": "After summer 1966",
      "source": "prosecution"
    },
    {
      "id": "f13",
      "text": "Post-temple, appellant met Mohini returning from school, took to bungalow in car, had sexual intercourse.",
      "type": "disputed",
      "date": "After summer 1966",
      "source": "prosecution"
    },
    {
      "id": "f14",
      "text": "Parents learned, rebuked Mohini; started accompanying her to school (maid or mother from July 1966).",
      "type": "material",
      "date": "From July 1966",
      "source": "prosecution"
    },
    {
      "id": "f15",
      "text": "Appellant called Mohini to house on Saturday September 24, 1966; mother wrote letter September 26, 1966 requesting desist from contacting Mohini.",
      "type": "material",
      "date": "1966-09-24 to 1966-09-26",
      "source": "prosecution"
    },
    {
      "id": "f16",
      "text": "No contact in Jamnagar post-letter.",
      "type": "background",
      "date": "After 1966-09-26",
      "source": "prosecution"
    },
    {
      "id": "f17",
      "text": "October 1966, Mohini at Ahmedabad school camp; appellant contacted, took her and two girl friends for joy ride.",
      "type": "material",
      "date": "1966-10",
      "source": "prosecution"
    },
    {
      "id": "f18",
      "text": "November-December 1966, nothing particular; appellant claims Mohini wrote letters complaining ill-treatment by parents, desire to leave home.",
      "type": "disputed",
      "date": "1966-11 to 1966-12",
      "source": "appellant"
    },
    {
      "id": "f19",
      "text": "Early January 1967, appellant told Mohini to come to bungalow.",
      "type": "material",
      "date": "Early 1967-01",
      "source": "prosecution"
    },
    {
      "id": "f20",
      "text": "January 16, 1967: Mohini started to school with mother Narmada to court premises; Mohini went to appellant's factory per prior arrangement; appellant took her to motor garage, then attached room; dictated letters to father, DSP Jamnagar, himself complaining ill-treatment, leaving for Bombay with Rs.250/-; posted 2:30 PM.",
      "type": "material",
      "date": "1967-01-16",
      "source": "prosecution"
    },
    {
      "id": "f21",
      "text": "Appellant made Mohini sit in dicky of car for hours; to factory office midnight, sexual intercourse against her will; car sound, hid in cellar; later to garage dicky.",
      "type": "disputed",
      "date": "1967-01-16 night",
      "source": "prosecution"
    },
    {
      "id": "f22",
      "text": "Morning January 17, appellant said called to police, went with Mohini in dicky; policeman to bungalow, appellant parked, took Mohini to inner garage room (4 doors).",
      "type": "material",
      "date": "1967-01-17 morning",
      "source": "prosecution"
    },
    {
      "id": "f23",
      "text": "Mohini thirsty, went garden, asked mali for water.",
      "type": "material",
      "date": "1967-01-17",
      "source": "prosecution"
    },
    {
      "id": "f24",
      "text": "6:30 PM January 17, appellant promised food, water, clothes; returned with them; Mohini changed, washed, eating when car sound; appellant said police, told leave back door to roadside near Gandhinagar, wait.",
      "type": "material",
      "date": "1967-01-17 6:30 PM",
      "source": "prosecution"
    },
    {
      "id": "f25",
      "text": "Mohini waited near Gandhinagar; traced by PSI Chaudhary with appellant ~9 PM; from dicky: bedding, Mohini's wet clothes (skirt, blouse, nicker, petticoat), school books, exercise books.",
      "type": "material",
      "date": "1967-01-17 ~9 PM",
      "source": "prosecution"
    },
    {
      "id": "f26",
      "text": "Inner garage room: unfinished food, utensils with appellant's name.",
      "type": "material",
      "date": "1967-01-17",
      "source": "prosecution"
    },
    {
      "id": "f27",
      "text": "Mohini sent for medical exam; no symptoms of forcible intercourse.",
      "type": "material",
      "date": "1967-01-17",
      "source": "prosecution"
    },
    {
      "id": "f28",
      "text": "After court, Narmada home; school girls said Mohini not at school; suspected appellant, went with Dinkerrai; appellant ignorant, said she took Rs.250/- 4-5:30 PM, gone.",
      "type": "material",
      "date": "1967-01-16 afternoon",
      "source": "prosecution"
    },
    {
      "id": "f29",
      "text": "Liladhar lodged complaint ~7:20 PM January 16.",
      "type": "procedural",
      "date": "1967-01-16 7:20 PM",
      "source": "prosecution"
    },
    {
      "id": "f30",
      "text": "PSI searched bungalow night 16-17, no Mohini; morning 17th, attached letters/papers, checked accounts for Rs.250/- entry.",
      "type": "procedural",
      "date": "1967-01-16/17",
      "source": "prosecution"
    },
    {
      "id": "f31",
      "text": "Liladhar received letter postmark 16-1-1967.",
      "type": "material",
      "date": "1967-01-16",
      "source": "prosecution"
    },
    {
      "id": "f32",
      "text": "Night 17th, PSI to bungalow; Mohini heard car, left per appellant.",
      "type": "material",
      "date": "1967-01-17 night",
      "source": "prosecution"
    },
    {
      "id": "f33",
      "text": "Inner room: Mohini's clothes, purse, comb, 2 plastic buckets water, lantern, etc.; dicky: skirt, blouse, petticoat, book, exercise books.",
      "type": "material",
      "date": "1967-01-17",
      "source": "prosecution"
    },
    {
      "id": "f34",
      "text": "Appellant admitted intimate relations with family, trips to Baroda/Bombay Dec 1965, Metropolitan stay but denied shared room, intercourse, gifts; denied March 1966 intercourse; admitted Mahabaleshwar/Mount Abu trips but denied mother seeing him with Mohini; admitted temple to remove suspicion; on Jan 16 evening, said Mohini took Rs.250/-, adamant not return home, requested stay 15 days due to parental harassment; suggested reason: refusal to appoint father as Baroda manager.",
      "type": "disputed",
      "date": null,
      "source": "appellant"
    },
    {
      "id": "f35",
      "text": "Trial court: Mohini born 18-9-1951, age 14-17 relevant period, minor; believed her on prior intercourse corroborated medically; no reason for false story; appellant guilty ss.366/376 IPC; sentence RI 18 months s.366, RI 2 years + fine Rs.500/- s.376.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f36",
      "text": "High Court: Acquitted s.376 (no corroboration for Jan 16/17 intercourse); upheld s.366 conviction/sentence.",
      "type": "procedural",
      "date": "1969-12-15",
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether appellant guilty under s.366 IPC of taking Mohini out of keeping of lawful guardian with intent to seduce to illicit intercourse.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether appellant guilty under s.376 IPC of rape on night of 16/17 January 1967.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Mohini left home on own accord due to parental harassment from suspicions; came to appellant for help out of compassion; no taking/enticement; prior refusal to appoint father as manager motive for false implication.",
      "supporting_facts": [
        "f18",
        "f34"
      ],
      "legal_basis": "s.366 IPC requires taking/enticement out of guardian's keeping; cites S. Varadaraja v. State of Madras"
    },
    {
      "id": "pa2",
      "text": "Prosecution evidence untrustworthy, especially Mohini's uncorroborated testimony.",
      "supporting_facts": [
        "f20",
        "f21",
        "f24"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Appellant cultivated relations, prior intimacies, gifts, trips; called Mohini 3-4 days prior promising permanent keep; induced to leave home; hid her, dictated letters to mislead; intent to seduce evident.",
      "supporting_facts": [
        "f3",
        "f6",
        "f7",
        "f8",
        "f10",
        "f12",
        "f13",
        "f15",
        "f17",
        "f19",
        "f20",
        "f21",
        "f24",
        "f25",
        "f26"
      ],
      "legal_basis": "ss.366, 361 IPC"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Trial court correctly found Mohini minor; believed her testimony on prior intercourse; no motive for false story; appellant induced her to leave via prior conduct, promise; letters dictated to create defense; upheld s.366.",
      "addresses_issue": "i1",
      "key_observation": "Appellant prepared letters for plausible defense; nothing prevented returning her; secretly confined for intercourse."
    },
    {
      "id": "cr2",
      "text": "High Court rightly acquitted s.376 for lack of corroboration on specific incident but upheld s.366; Mohini's call story natural; prior circumstances telling; presence at premises corroborated by recoveries.",
      "addresses_issue": "i1",
      "key_observation": "Appellant kidnapped from guardianship with intent to seduce, borne by circumstances."
    },
    {
      "id": "cr3",
      "text": "s.361 IPC: gravamen in taking/enticing minor out of guardian's keeping without consent; persuasion sufficient, even prior inducement; appellant's prior allurements, participation in intention formation.",
      "addresses_issue": "i1",
      "key_observation": "Takes/entices: cause to go, inducement/allurement; prior foundation by promise/inducement."
    },
    {
      "id": "cr4",
      "text": "Background letters (Mohini Nov/Dec 1966, mother Sep 1966) essential; mother's suspicion relevant; substratum probable.",
      "addresses_issue": "i1",
      "key_observation": "No reasonable doubt on truthfulness."
    },
    {
      "id": "cr5",
      "text": "Distinguished Varadarajan's case: here prior constant behaviour, allurements unlike voluntary joining there.",
      "addresses_issue": "i1",
      "key_observation": "Ample material of earlier inducement."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Conviction under s.366 IPC proved beyond reasonable doubt; appellant took/enticed minor Mohini out of guardian's keeping with intent to seduce to illicit intercourse.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "No interference with High Court's acquittal under s.376 IPC as no appeal against acquittal.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "State of Haryana v. Raja Ram",
      "citation": "A.I.R. 1973 S.C. 819",
      "treatment": "followed",
      "relevance": "Explains scope of s.361 IPC: taking/enticing minor from guardian's keeping; persuasion sufficient; consent of minor immaterial."
    },
    {
      "case_name": "S. Varadaraja v. State of Madras",
      "citation": "1965 1 S.C.R. 243",
      "treatment": "distinguished",
      "relevance": "Distinction between taking and allowing accompaniment; requires inducement or prior solicitation; not applicable due to prior conduct here."
    },
    {
      "case_name": "Christian Officer",
      "citation": "10 Cox. 420",
      "treatment": "followed",
      "relevance": "If persuasion induces minor to continue away from guardian, guilty even if not initial departure."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "s.366",
        "s.376",
        "s.361",
        "s.375"
      ],
      "relevance": "s.366: kidnapping minor from guardian to seduce to illicit intercourse; s.376: rape; s.361 defines kidnapping; minor's consent immaterial for rape if under age."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court dismissed appellant's special leave appeal, upheld Gujarat High Court judgment maintaining conviction and sentence under s.366 IPC (RI 18 months), while noting acquittal under s.376 IPC.",
    "relief_granted": "None",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The gravamen of this offence lies in the taking or enticing of a minor... out of the keeping of the lawful guardian without the consent of such guardian.",
      "speaker": "court",
      "significance": "Defines core of s.361 IPC offence."
    },
    {
      "text": "Persuasion by the accused person which creates willingness on the part of the minor to be taken out of the keeping of the lawful guardian would be sufficient to attract the section.",
      "speaker": "court",
      "significance": "Clarifies no force/fraud needed for s.366."
    },
    {
      "text": "There is no scope for an inference other than the inference that Mohini was kidnapped from lawful guardianship, with an intention to seduce her to illicit inter-course.",
      "speaker": "court",
      "significance": "High Court conclusion on intent upheld."
    }
  ],
  "_case_id": "1973_155",
  "_label": 0,
  "_text_length": 39617,
  "_extracted_at": "2026-02-10T20:12:27.383095"
}