{
  "metadata": {
    "case_name": "Daughter of Ayyappan Mathevan Pillai v. Son of Ayyappan Mathevan Pillai",
    "case_year": 1967,
    "court": "Supreme Court of India",
    "judges": [
      "ALAGIRISWAMI, J."
    ],
    "case_number": "Civil Appeal No. 1251 of 1967",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant is the daughter of Ayyappan Mathevan Pillai by one of his wives (second respondent).",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "First respondent is the son of Ayyappan Mathevan Pillai by another wife.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Parties belong to the Krishnanvaka Community found mainly in the Kanyakumari district of Tamil Nadu.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Ayyappan Mathevan Pillai died on 17th January, 1949.",
      "type": "material",
      "date": "1949-01-17",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "During the appellant's minority, her mother and the first respondent entered into a deed of partition under which the appellant was given 9 out of 79 items belonging to her father.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Appellant filed suit for partition and possession of a half share in all her father's properties, based on custom of special kind of pathnibhagam where daughter entitled to share on same basis as son per mother.",
      "type": "material",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "Learned Subordinate Judge held against the plaintiff (appellant) on consideration of evidence and earlier decisions.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "District Judge of Kanyakumari allowed the appeal without going into evidence, based on earlier decisions.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Madras High Court in Second Appeal No. 167 of 1963, judgment dated September 29, 1966, held decisions relied on by District Judge did not establish special custom; did not decide on family arrangement.",
      "type": "procedural",
      "date": "1966-09-29",
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the custom pleaded by the appellant has been established, viz., special kind of pathnibhagam where even a daughter was entitled to share on the same basis as sons, i.e., half share if one wife has daughter and other has son.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Reliance placed on evidence and certain earlier decisions regarding prevalence of custom of pathnibhagam among the community, specifically special kind including daughters.",
      "supporting_facts": [
        "f3",
        "f6"
      ],
      "legal_basis": "Customary law principles from precedents like Ramaswami Sadasivan v. Thanu Gouri"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Sought to sustain the partition deed on the basis that it was the result of a family arrangement.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Decisions relied on by lower courts and appellant do not establish the special custom pleaded.",
      "supporting_facts": [
        "f7",
        "f9"
      ],
      "legal_basis": "Custom requires proof by evidence or series of decisions based on evidence"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Legal position on customary law: clear proof of usage outweighs written text; custom repeatedly recognised in courts becomes law without proof (citing Privy Council and Supreme Court cases); under Evidence Act s.57, proof unnecessary if incorporated.",
      "addresses_issue": "i1",
      "key_observation": "Custom must be proved by evidence or decisions based on evidence."
    },
    {
      "id": "cr2",
      "text": "Ordinary pathnibhagam (division per mothers among sons) prevalent in community and elsewhere, recognised in decisions.",
      "addresses_issue": "i1",
      "key_observation": "Precedents like Palaniappa Chettiar confirm ordinary custom."
    },
    {
      "id": "cr3",
      "text": "Special custom including daughters: only solitary observation in Ramaswami Sadasivan v. Thanu Gouri (not based on evidence or necessary); District Court Ex A-6 relied on that observation, not evidence; no series of decisions based on evidence.",
      "addresses_issue": "i1",
      "key_observation": "Special custom not established despite small community."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Existence of ordinary custom of pathnibhagam established, but special kind pleaded by plaintiff (including daughters) not established.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "The Collector of Madura v. Moottoo Ramalinga Sethupathy",
      "citation": "1868 12 M.I.A. 397, 436",
      "treatment": "referred",
      "relevance": "Clear proof of usage outweighs written text of Hindu law."
    },
    {
      "case_name": "Rama Rao v. Rajah of Pittapur",
      "citation": "1918 I.L.R. 41 Madras 778 at 785",
      "treatment": "followed",
      "relevance": "Custom repeatedly brought to notice of courts becomes law without proof in each case."
    },
    {
      "case_name": "Premraj v. Chand Kanwar",
      "citation": "1947 H M.L.J. 516 P.C.",
      "treatment": "followed",
      "relevance": "Custom recognised in series of decisions based on evidence becomes general law, onus shifts."
    },
    {
      "case_name": "Ujagar Singh v. Mst. Jeo",
      "citation": "1959 2 S.C.R. Suppl. 781",
      "treatment": "followed",
      "relevance": "Custom recognised by courts passes into law; proof unnecessary under Evidence Act s.57."
    },
    {
      "case_name": "Palaniappa Chettiar v. Alagan Chetti",
      "citation": "1921 I.L.R. 44 Madras 740",
      "treatment": "referred",
      "relevance": "Pathnibhagam custom exists in Southern India; proved on evidence in that case."
    },
    {
      "case_name": "Avikutti Bhagavathi ANR. v. Chithambarathanu Mathevan",
      "citation": "1890 8 T.L.R. 51",
      "treatment": "referred",
      "relevance": "Krishnanvaka community follows pathnibhagam."
    },
    {
      "case_name": "Ramaswami Sadasivan v. Thanu Gouri",
      "citation": "1904 Kolappa Pillais unreported important cases p. 179",
      "treatment": "distinguished",
      "relevance": "Passing observation on special pathnibhagam including daughters, not based on evidence or necessary."
    },
    {
      "case_name": "Nagaru Pillai Saraswathi Amma v. Thanu Pillai Thanu Pillai",
      "citation": "1944 T.L.R. 710",
      "treatment": "referred",
      "relevance": "Recognised pathnibhagam but special custom not in issue."
    },
    {
      "case_name": "District Court of Nagercoil S. No. 109 of 1096 M.B.",
      "citation": "22nd December 1923, marked Ex A-6",
      "treatment": "distinguished",
      "relevance": "Referred to special custom but relied on observation in Ramaswami, not evidence."
    },
    {
      "case_name": "District Munsiffs Court of Kuzhithurai O.S. No. 18 of 1959",
      "citation": "2nd January 1960",
      "treatment": "referred",
      "relevance": "Recognised ordinary pathnibhagam, not special custom."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Evidence Act",
      "sections": [
        "s. 57"
      ],
      "relevance": "Proof of custom unnecessary if it has passed into law through court recognition."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal is dismissed as the special custom of pathnibhagam pleaded by the appellant was not established. Unnecessary to decide on family arrangement. Costs of the 1st respondent to be paid by the appellant.",
    "relief_granted": null,
    "costs": "Costs of the 1st respondent to be paid by the appellant."
  },
  "key_quotes": [
    {
      "text": "\"Under the Hindu system of law clear proof of usage will outweigh the written text of the law.\"",
      "speaker": "court",
      "significance": "Principle on customary law overriding general Hindu law."
    },
    {
      "text": "\"When a custom or usage... is repeatedly brought to the notice of the Courts of a country, the Courts may hold that custom or usage to be introduced into the law without the necessity of proof in each individual case.\"",
      "speaker": "court",
      "significance": "Establishes when custom becomes part of law."
    },
    {
      "text": "The Pathni Bhagon which prevails in this community seems to go even beyond the usual custom... but when one mother has got only female issue and another a male issue the female issue get a half share.",
      "speaker": "court",
      "significance": "Observation on special custom, but held as obiter."
    },
    {
      "text": "Thus while the existence of the custom of pathnibhagam in the community may be said to have been established, the special kind of pathnibhagam pleaded by the plaintiff cannot be said to have been established.",
      "speaker": "court",
      "significance": "Core holding distinguishing ordinary and special custom."
    }
  ],
  "_case_id": "1973_48",
  "_label": 0,
  "_text_length": 12414,
  "_extracted_at": "2026-02-10T20:11:39.945592"
}