{
  "metadata": {
    "case_name": "Debutter Estate of Sri Radhagobindjee v. Commissioner of Income-tax",
    "case_year": 1973,
    "court": "Supreme Court of India",
    "judges": [
      "Alagiriswami, J."
    ],
    "case_number": "Civil Appeals Nos. 2358-2366 of 1968; 1174, 1288-1299 of 1971",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "In the year 1820 one Smt. Chitra Dassi executed an Ekrarnama making a gift of a piece of land for religious Purposes.",
      "type": "background",
      "date": "1820",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "In 1842 she executed a will referring to the fact that she had earlier made the property debutter and directed her four sons, the executors, to perform the daily service of Sri Radhagobindjee. She died in 1855.",
      "type": "background",
      "date": "1842",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "In 1876 a suit was filed in the Calcutta High Court praying that the trust should be administered by the court and a scheme prepared. Subsequently, there were a number of applications made from time to time and a number of orders were also made on them.",
      "type": "procedural",
      "date": "1876",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "In 1929 a scheme of administration was framed and a little later the Official Trustee of Bengal was appointed to be the trustee of the said debutter estate.",
      "type": "procedural",
      "date": "1929",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "After the official trustee took possession of the properties he was assessed in respect of the income of the debutter estate in the status of an individual under section 41 of the Act.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "In respect of the assessment years 1939-40 to 1942-43 a reference was made under section 66(2) of the Act. A Bench of the Calcutta High Court held that upon a proper construction of the relevant documents and the scheme sanctioned and orders passed by the High Court the property should be held to be a religious trust.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "The matter again went up to the High Court in respect of the assessment years 1943-44 to 1951-52.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "High Court held that upon a proper construction of the relevant documents executed by Chitra Dassi and the relevant Schemes sanctioned and orders passed by the High Court there was a dedication of the properties to the deity, but that there was no trust in the technical sense.",
      "type": "admitted",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "The endowment is a private religious trust and the documents creating it or confirming it grant no benefit to the members of the public, that an order made by the Calcutta High Court by which certain directions were given for feeding the poor, was the only instance in which a benefit enured to the public.",
      "type": "disputed",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "The High Court held that the deity was liable to assessment under the Income-tax Act.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether a Hindu deity is an individual within the meaning of that word under the provisions of the Indian Income-tax Act, 1922.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether upon a proper construction of the relevant documents executed by Smt. Chitra Dassi and the relevant schemes sanctioned and orders passed by the High Court, there was a trust in favour of the Deity or whether there was a dedication of the properties to the Deity?",
      "framed_by": "lower_court"
    },
    {
      "id": "i3",
      "text": "Alternatively, if the dedication to the Thakur constitute trust, is it a religious trust which did not enure to the benefit of the public?",
      "framed_by": "lower_court"
    },
    {
      "id": "i4",
      "text": "Is the Thakur Radha Gobinda Jew liable to assessment under the Indian Income-tax Act?",
      "framed_by": "lower_court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The High Court was not right in coming to the conclusion that the deity is an individual.",
      "supporting_facts": [
        "f10"
      ],
      "legal_basis": "Jogendra Nath Naskar v Commr. of Income-tax (1969) 74 ITR 33 (urged that decision was wrong and should be reconsidered)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The deity is an individual liable to assessment.",
      "supporting_facts": [
        "f5",
        "f10"
      ],
      "legal_basis": "Indian Income-tax Act, 1922"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "A Hindu deity falls within the meaning of the word individual in section 3 and can be treated as a unit of assessment.",
      "addresses_issue": "i1",
      "key_observation": "Entire agreement with Jogendra Nath Naskar v Commr. of Income-tax."
    },
    {
      "id": "cr2",
      "text": "It was conceded that if the word used had been a person instead of an individual the deity would be a person because a person will include a juristic person. That a Hindu deity is a juristic person is a well established proposition.",
      "addresses_issue": "i1",
      "key_observation": "Cites multiple precedents establishing deity as juristic person capable of holding property."
    },
    {
      "id": "cr3",
      "text": "As a Hindu deity can hold property and be in receipt of income and can also sue and be sued in a court of law there is no reason why its income should be held to be outside the ambit of taxation if it can be brought within it without straining the language of the statutory provision.",
      "addresses_issue": "i1",
      "key_observation": "It would naturally be taxed through its shebaits."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "A Hindu deity is an individual within the meaning of the Indian Income-tax Act, 1922, and is liable to assessment.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Jogendra Nath Naskar v Commr. of Income-tax",
      "citation": "1969 74 ITR 33",
      "treatment": "followed",
      "relevance": "Held that a Hindu deity falls within the meaning of the word individual in section 3 and can be treated as a unit of assessment."
    },
    {
      "case_name": "Maharanee Shibessouree Debia v. Mothooranath Acharjo",
      "citation": "1869 13 MIA 270",
      "treatment": "followed",
      "relevance": "The rents constituted in legal contemplation its property. The Sabait had no legal property, but only the title of Manager."
    },
    {
      "case_name": "Prosunno Kumari Debya v. Golab Chand Baboo",
      "citation": "1875 LR 2 IA 145",
      "treatment": "followed",
      "relevance": "Cited above observations with approval."
    },
    {
      "case_name": "Manohar Ganesh v. Lakhmiram",
      "citation": "1887 ILR 12 Bom. 247",
      "treatment": "followed",
      "relevance": "Hindu law recognises juridical persons or subjects called foundations; consistent with grants to the juridical person symbolized in the idol."
    },
    {
      "case_name": "Vidyapurna Tirtha Swami v. Vidyanidhi Tirtha Swami",
      "citation": "1904 ILR 27 Mad. 435",
      "treatment": "followed",
      "relevance": "Laws sanction creation of fictitious person; perhaps the oldest juristic person is the God."
    },
    {
      "case_name": "Pramatha Nath Mullick v. Pradyumna Kumar Mullick",
      "citation": "1925 LR 52 IA 245; AIR 1925 PC 139",
      "treatment": "followed",
      "relevance": "A Hindu idol is a juristic entity with juridical status, power of suing and being sued; managed by shebait."
    },
    {
      "case_name": "C.I.T. Ahmedabad Mill Owners Association",
      "citation": "7 ITR 369",
      "treatment": "distinguished",
      "relevance": "Individual must mean human being, distinct from joint family, firm, company; led to amendment but individual retained."
    },
    {
      "case_name": "Commissioner of Income-tax v. Sodra Devi",
      "citation": "32 ITR 615",
      "treatment": "referred",
      "relevance": "Individual includes corporation created by statute, e.g. University, Bar Council."
    },
    {
      "case_name": "I.T. Commr. v. Jogendra Nath",
      "citation": "AIR 1965 Cal. 570",
      "treatment": "followed",
      "relevance": "A Hindu deity can be either an individual or a person or both."
    },
    {
      "case_name": "Sri Sridhar v. I.T. Officer",
      "citation": "AIR 1966 Cal. 494",
      "treatment": "followed",
      "relevance": "Hindu idol is juristic entity given status of human being capable of having property and called an individual."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act, 1922",
      "sections": [
        "Section 3",
        "Section 4",
        "Section 40",
        "Section 41",
        "Section 66"
      ],
      "relevance": "Whether deity is individual for assessment; word trust applies to Hindu endowments; assessed in status of individual under s.41; references under s.66."
    },
    {
      "name": "Income-tax Act, 1961",
      "sections": [
        "Section 2(31)"
      ],
      "relevance": "Defines person including artificial juridical person; problem unlikely to arise after enactment."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeals challenging the High Court's holding that the Hindu deity is an individual liable to income-tax assessment under the 1922 Act are dismissed.",
    "relief_granted": null,
    "costs": "with costs"
  },
  "key_quotes": [
    {
      "text": "A Hindu deity is a juristic person capable of holding property.",
      "speaker": "court",
      "significance": "Core reasoning affirming deity's status for taxation."
    },
    {
      "text": "There is no reason why its income should be held to be outside the ambit of taxation if it can be brought within it without straining the language of the statutory provision.",
      "speaker": "court",
      "significance": "Justifies taxing deity's income through shebaits."
    },
    {
      "text": "A Hindu idol is, according to long established authority... a juristic entity.",
      "speaker": "court",
      "significance": "Quotes Privy Council to establish long-standing precedent."
    }
  ],
  "_case_id": "1973_345",
  "_label": 0,
  "_text_length": 10694,
  "_extracted_at": "2026-02-10T20:13:28.071169"
}