{
  "metadata": {
    "case_name": "Roop Singh & Ors. v. State of Punjab",
    "case_year": 1971,
    "court": "Supreme Court of India",
    "judges": [
      "KHANNA, J."
    ],
    "case_number": "Criminal Appeal No. 189 of 1971",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Long standing enmity between party of accused and deceased: In 1964, Kaka Singh (brother of Roop Singh) and Nagender Singh (father of Major Singh, brother of Inder Singh) murdered. Twelve persons including Atma Singh PW, Bachan Singh PW, Mohinder Singh deceased prosecuted; four including Atma, Bachan, Mohinder acquitted, others convicted to life imprisonment.",
      "type": "background",
      "date": "1964",
      "source": "prosecution"
    },
    {
      "id": "f2",
      "text": "Hazura Singh (father of Paranjan Singh accused) murdered 12-13 years prior. Nek Singh, Bachhattar Singh, Bikar Singh (sons of Amar Singh deceased) convicted by trial court but acquitted by High Court.",
      "type": "background",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f3",
      "text": "Security proceedings started by police due to strained relations between parties.",
      "type": "background",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f4",
      "text": "Mastan Singh deceased gave land on batai to Amar Singh deceased. Maize crop thrashed on November 7, 1966 at mill of Dalip Singh near abadi of village Kangar. Work complete by 3 p.m. At 5:30 p.m., Amar Singh deceased, son Gurmail Singh PW 16, Mastan Singh deceased, son Mohinder Singh deceased, nephew Bachan Singh PW 45 present removing thrashed maize.",
      "type": "material",
      "date": "1966-11-07",
      "source": "prosecution"
    },
    {
      "id": "f5",
      "text": "Nine accused arrived: Roop Singh, Inder Singh, Major Singh with barchhas; Teja Singh with gun; others (Paranjan Singh, Nirbhai Singh, Maghar Singh, Tara Singh, Naib Singh) with gandasas. Naib Singh son of Teja Singh.",
      "type": "material",
      "date": "1966-11-07",
      "source": "prosecution"
    },
    {
      "id": "f6",
      "text": "Roop Singh shouted assailants of Kaka Singh and Nagender Singh would not be spared. Naib Singh gave gandasa blow on head of Bachan Singh (wrong side struck). Tara Singh gandasa on left wrist of Bachan Singh. Naib Singh another gandasa (lathi portion struck Bachan Singh).",
      "type": "material",
      "date": "1966-11-07",
      "source": "prosecution"
    },
    {
      "id": "f7",
      "text": "Mastan Singh ran towards well (8-9 karams). Teja Singh (gun) confronted him. Roop Singh barchha to neck. Naib Singh, Maghar Singh, Tara Singh gandasa blows. Further injuries by Roop, Tara, Maghar, Naib after fall. Mastan died at spot.",
      "type": "material",
      "date": "1966-11-07",
      "source": "prosecution"
    },
    {
      "id": "f8",
      "text": "Mohinder Singh ran towards village Dina (18 karams), surrounded by Nirbhai Singh, Paranjan Singh, Inder Singh, Major Singh. Nirbhai gandasa to head, further injuries by all four. Mohinder died at spot.",
      "type": "material",
      "date": "1966-11-07",
      "source": "prosecution"
    },
    {
      "id": "f9",
      "text": "Tara Singh, Roop Singh, Naib Singh, Maghar Singh chased Amar Singh near house of Tara Singh refugee. Tara and Maghar gandasa to head. Roop barchha to abdomen. Naib gandasa to neck. Further injuries. Amar died at spot.",
      "type": "material",
      "date": "1966-11-07",
      "source": "prosecution"
    },
    {
      "id": "f10",
      "text": "Occurrence witnessed by Bahadur Singh PW3, Bachan Singh PW9, Gurmail Singh PW12, Atma Singh Sarpanch PW15.",
      "type": "material",
      "date": "1966-11-07",
      "source": "prosecution"
    },
    {
      "id": "f11",
      "text": "Accused pursued Atma Singh into abadi. Bachan to house of Gajjan Singh, Gurmail to own house. Bachan and Gajjan Singh went circuitous route to PS Dialpura (2 miles), lodged FIR at 7 p.m.",
      "type": "procedural",
      "date": "1966-11-07",
      "source": "prosecution"
    },
    {
      "id": "f12",
      "text": "Bachan sent to hospital Bhagta (7-8 miles from PS), injuries examined by Dr. Surjit Singh at 10:40 p.m.",
      "type": "procedural",
      "date": "1966-11-07",
      "source": "prosecution"
    },
    {
      "id": "f13",
      "text": "SI Jagjit Singh left PS, arrived scene 8:15 p.m. Found three dead bodies unguarded. Late night, inquest next morning. Blood-stained earth taken. 2 quintals 35 kg maize, scale P5, weight P10, groom P11, chajjli P12 taken.",
      "type": "procedural",
      "date": "1966-11-07",
      "source": "prosecution"
    },
    {
      "id": "f14",
      "text": "Post-mortem by Dr. Tejinder Singh at Mandi Phul (14 miles) on November 9, 1966.",
      "type": "procedural",
      "date": "1966-11-09",
      "source": "prosecution"
    },
    {
      "id": "f15",
      "text": "Nine accused arrested, weapons recovered.",
      "type": "procedural",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f16",
      "text": "Eyewitnesses PW3, PW9, PW12, PW15 supported prosecution at trial.",
      "type": "material",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f17",
      "text": "Accused denied participation under S.342 CrPC, claimed false implication due to enmity.",
      "type": "disputed",
      "date": null,
      "source": "accused"
    },
    {
      "id": "f18",
      "text": "Trial court (Addl. Sessions Judge Barnala) acquitted all nine accused. Rejected eyewitnesses, recovery, held Bachan injuries not from occurrence, delay in FIR.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f19",
      "text": "State appeal: HC convicted six appellants u/s 302/149 and 326/149 IPC, life + 3 years RI concurrent. Acquitted Major, Inder, Teja; dismissed state appeal against them. Relied on Bachan PW9 and Gurmail PW12; doubted PW3 and PW15; accepted Bachan injuries from occurrence; delay not fatal.",
      "type": "procedural",
      "date": "1971-02-26",
      "source": "lower_court"
    },
    {
      "id": "f20",
      "text": "Post-mortem details: Mohinder Singh - 9 incised wounds, 14 abrasions, 1 post-mortem; 2 fatal (neck, abdomen). Mastan Singh - 5 incised, 4 contusions, 5 abrasions; 1 fatal (neck). Amar Singh - 5 incised, 1 stab, 2 lacerated, 1 contused, 3 abrasions, fracture; 2 fatal (head, abdomen stab).",
      "type": "material",
      "date": "1966-11-09",
      "source": "court"
    },
    {
      "id": "f21",
      "text": "Bachan Singh injuries: 1. Incised 2.5x0.5x1 dorsum left wrist (grievous, cut tendons, ulna head). 2. Lacerated 1.5x0.25x2 right side head posterior. 3. Bruise 3x1 right deltoid. Indoor patient 21-22 days.",
      "type": "material",
      "date": "1966-11-07",
      "source": "court"
    },
    {
      "id": "f22",
      "text": "Heights: Mohinder 5'11.5\", Mastan 6'1\", Amar 5'10\"; well-built. Large number of injuries indicates large number of assailants.",
      "type": "material",
      "date": "1966-11-07",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the High Court was justified in interfering with the trial court's acquittal by relying on the evidence of Bachan Singh PW9 and Gurmail Singh PW12, accepting their presence and participation details of the six appellants.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the injuries on Bachan Singh were received during the occurrence or self-inflicted.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Reliability of eyewitness testimony given delay in FIR and time of occurrence (darkness alleged).",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Trial court considered evidence and found it unreliable; High Court should not have interfered with acquittal.",
      "supporting_facts": [
        "f18"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Bachan Singh and Gurmail Singh would have run away and not remained to witness assaults.",
      "supporting_facts": [
        "f10",
        "f11"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Occurrence in dark; identity not fixable.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": null
    },
    {
      "id": "pa4",
      "text": "Bachan injuries self-inflicted or self-suffered.",
      "supporting_facts": [
        "f21"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "No cogent ground for trial court to reject evidence of Bachan Singh and Gurmail Singh; High Court interfered for substantial reasons.",
      "supporting_facts": [
        "f19"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Good reasons to accept Bachan PW9 and Gurmail PW12: natural presence for maize removal (maize found at scene, articles for batai division); injuries to Bachan genuine, not self-inflicted (nature, grievous, timing, improbability post-murder).",
      "addresses_issue": "i1",
      "key_observation": "Explanation for presence convincing; injuries lend assurance."
    },
    {
      "id": "cr2",
      "text": "Witnesses naturally interested in fate of relatives (Gurmail son of Amar, Bachan nephew of Mastan/cousin Mohinder); stopped at safe distance to watch.",
      "addresses_issue": "i1",
      "key_observation": "Nothing surprising in their conduct."
    },
    {
      "id": "cr3",
      "text": "Testimony accords with medical evidence; large injuries on tall well-built deceased indicate large assailants group.",
      "addresses_issue": "i1",
      "key_observation": "No valid reason to disbelieve participation of six appellants."
    },
    {
      "id": "cr4",
      "text": "Not dark: maize removal ongoing, maize left behind; timing allows FIR at 7pm, medical at 10:40pm.",
      "addresses_issue": "i3",
      "key_observation": "Prosecution evidence establishes daylight attack."
    },
    {
      "id": "cr5",
      "text": "Nature of injuries on deceased shows intent to kill.",
      "addresses_issue": "i1",
      "key_observation": "No doubt on homicidal nature."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "High Court correctly relied on eyewitnesses Bachan Singh and Gurmail Singh; their evidence reliable and accepted.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Conviction under section 302/149 and 326/149 IPC against six appellants upheld.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "302",
        "149",
        "326"
      ],
      "relevance": "Conviction under 302/149 (murder with common object) and 326/149 (grievous hurt with common object)"
    },
    {
      "name": "Code of Criminal Procedure",
      "sections": [
        "342"
      ],
      "relevance": "Statements of accused under S.342 CrPC denying participation"
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court upheld High Court conviction of six appellants under sections 302/149 and 326/149 IPC, sentencing each to life imprisonment and 3 years RI concurrently, dismissing the appeal by special leave against High Court judgment dated February 26, 1971.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"The nature of injuries on the person of Bachan Singh was such as would not, in our opinion, be normally suffered by a person with a view to create evidence regarding his presence at the scene of occurrence.\"",
      "speaker": "court",
      "significance": "Rejects self-infliction argument, supports eyewitness reliability."
    },
    {
      "text": "\"We find in the circumstances no valid reason to disbelieve the evidence of Bachan Singh and Gurmail Singh that all the six appellants participated in the assault on the deceased persons as alleged by the prosecution.\"",
      "speaker": "court",
      "significance": "Core holding upholding participation and conviction."
    },
    {
      "id": "kq3",
      "text": "\"The nature of the injuries which were found on the bodies of the three deceased persons leaves no doubt that the assailants intended to cause their death.\"",
      "speaker": "court",
      "significance": "Establishes murderous intent under IPC 302."
    }
  ],
  "_case_id": "1973_411",
  "_label": 0,
  "_text_length": 19308,
  "_extracted_at": "2026-02-10T20:13:30.769202"
}