{
  "metadata": {
    "case_name": "Private Bus Operators (Appellants) v. State of Uttar Pradesh (Respondents)",
    "case_year": 1972,
    "court": "Supreme Court of India",
    "judges": [
      "KHANNA, J."
    ],
    "case_number": "Civil Appeals Nos. 1737 to 1745 of 1972 and Civil Appeals Nos. 1870 and 1871 of 1972",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "On June 14, 1960, Deputy Secretary to Government of Rajasthan sent letter to Secretary to Government of Uttar Pradesh approving nationalisation of inter-state routes including Bharatpur-Agra, Bharatpur-Mathura, Alwar-Mathura, Mathura-Kama Kosi via Goverdhan, Agra-Dholpur for operation by State transport undertakings of both States under reciprocal arrangement.",
      "type": "background",
      "date": "1960-06-14",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Notification dated December 4, 1961 published in U.P. Gazette dated December 9, 1961 by Uttar Pradesh Government under section 68C proposing scheme for State road transport passenger services on inter-State Agra-Dholpur route, excluding other persons and envisaging cancellation of existing permits.",
      "type": "procedural",
      "date": "1961-12-04",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "No objections filed against the proposed scheme for Agra-Dholpur route.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Scheme approved under section 68D(2) by Joint Judicial Secretary to Government of Uttar Pradesh on July 30, 1962.",
      "type": "procedural",
      "date": "1962-07-30",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Central Government conveyed approval to the scheme under proviso to section 68D(3) on February 6, 1963.",
      "type": "procedural",
      "date": "1963-02-06",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Notification dated February 20, 1963 published in official Gazette dated March 16, 1963 publishing approved scheme under section 68D(3), commencing services from April 1, 1963, excluding private operators on Agra-Dholpur route, reducing private vehicles to nil, and cancelling permits with compensation provisions.",
      "type": "procedural",
      "date": "1963-02-20",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Notification dated April 9, 1963 cancelled permits of private operators including appellants issued by Regional Transport Authority, Jaipur and countersigned by Regional Transport Authority, Agra under section 68F(2).",
      "type": "procedural",
      "date": "1963-04-09",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Appellants (Rajasthan bus operators) filed writ petitions under Articles 226 and 227 challenging notifications; single Judge allowed petitions, quashed notifications holding State cannot act unilaterally beyond territory, cannot cancel other State's permits, and inadequate notice.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Division Bench of Allahabad High Court allowed State appeals on December 9, 1971, upheld schemes and notifications as valid, holding State Government performs Central functions under Article 258(2), permits cancelled reciprocally by respective authorities, adequate notice given.",
      "type": "procedural",
      "date": "1971-12-09",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Civil appeals filed in Supreme Court on certificate from High Court judgment.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Dholpur, Bharatpur, Alwar, Kama Kosi in Rajasthan; Agra, Mathura in Uttar Pradesh; Agra-Dholpur is inter-State route.",
      "type": "background",
      "date": null,
      "source": "admitted"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether Uttar Pradesh Government could approve and publish scheme under section 68D for inter-State route excluding private operators, including those with permits countersigned from Rajasthan.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether State Government approval under section 68D for inter-State route exceeds territorial limits or encroaches on another State's executive power.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether adequate notice was given to Rajasthan operators as notifications published only in U.P. Gazette.",
      "framed_by": "petitioner"
    },
    {
      "id": "i4",
      "text": "Whether permits of Rajasthan operators were properly cancelled.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "State Government cannot approve scheme for inter-State route under section 68D as powers operate only within own territory.",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": "Section 68D proviso; territorial limits of State power"
    },
    {
      "id": "pa2",
      "text": "Approval only for portion within own territory, not entire inter-State route.",
      "supporting_facts": [
        "f2",
        "f6"
      ],
      "legal_basis": "Section 68D"
    },
    {
      "id": "pa3",
      "text": "Scheme approval is law-making beyond territorial limits, unconstitutional.",
      "supporting_facts": [],
      "legal_basis": "Article 13(3), Article 245"
    },
    {
      "id": "pa4",
      "text": "Approval exercises executive power beyond territorial limits.",
      "supporting_facts": [],
      "legal_basis": "Article 298"
    },
    {
      "id": "pa5",
      "text": "No effective notice to Rajasthan operators as published only in U.P. Gazette.",
      "supporting_facts": [
        "f2",
        "f6"
      ],
      "legal_basis": "Natural justice"
    },
    {
      "id": "pa6",
      "text": "State cannot unilaterally cancel permits of other State's operators.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "Territorial jurisdiction"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Provisions of Chapter IVA including sections 68C and 68D complied with; Central Government prior approval obtained for inter-State scheme.",
      "supporting_facts": [
        "f4",
        "f5",
        "f6"
      ],
      "legal_basis": "Sections 68B, 68C, 68D; proviso to 68D(3)"
    },
    {
      "id": "ra2",
      "text": "Permits cancelled reciprocally: U.P. operators' permits by U.P. authorities, Rajasthan operators' by Rajasthan authorities; countersignatures cancelled accordingly.",
      "supporting_facts": [
        "f7",
        "f9"
      ],
      "legal_basis": "Section 68F(2)"
    },
    {
      "id": "ra3",
      "text": "Adequate notice: schemes published per law, notices on notice boards of transport authorities of both States.",
      "supporting_facts": [
        "f2",
        "f6",
        "f9"
      ],
      "legal_basis": "Publication requirements"
    },
    {
      "id": "ra4",
      "text": "State and undertaking perform functions of Central Government under Article 258(2).",
      "supporting_facts": [
        "f1"
      ],
      "legal_basis": "Article 258(2)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Proviso to section 68D(3) expressly contemplates State Government approving inter-State schemes with prior Central approval, which was obtained; rejects territorial limit argument.",
      "addresses_issue": "i1",
      "key_observation": "Plain language of proviso allows State approval for entire inter-State route."
    },
    {
      "id": "cr2",
      "text": "No need for Central approval if intra-State; requirement implies approval for entire route including other State's portion.",
      "addresses_issue": "i2",
      "key_observation": "Inter-State route covers entire route."
    },
    {
      "id": "cr3",
      "text": "Scheme approval is statutory power under Parliamentary law (Motor Vehicles Act), not State legislation under Article 245 or pure executive beyond Article 298; enables State monopoly in trade without territorial limits.",
      "addresses_issue": "i2",
      "key_observation": "Chapter IVA has overriding effect per section 68B; Parliament competent under Entries 21, 35 List III."
    },
    {
      "id": "cr4",
      "text": "No encroachment on Rajasthan's executive as done with concurrence of both States.",
      "addresses_issue": "i2",
      "key_observation": "Reciprocal arrangement."
    },
    {
      "id": "cr5",
      "text": "High Court correctly held reciprocal cancellation of permits and adequate notice via publication and notice boards.",
      "addresses_issue": "i3",
      "key_observation": "Compliance with statutory publication."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Uttar Pradesh Government competent to approve and publish scheme under section 68D for inter-State route with Central Government's prior approval.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Schemes and permit cancellations valid; no violation of territorial limits or Constitution.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Chapter IVA provisions constitutional and overriding.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "H.C. Narayanappa and Ors. v. The State of Mysore and Ors.",
      "citation": "1960 3 S.C.R. 742",
      "treatment": "followed",
      "relevance": "Parliament competent under Entries 21 and 35 List III to enact Chapter IVA for State transport monopoly; wide scope of 'commercial and industrial monopolies'."
    },
    {
      "case_name": "King Emperor v. Sibnath Banerji and Ors.",
      "citation": null,
      "treatment": "referred",
      "relevance": "Executive power includes decision and carrying out; broad interpretation of executive functions."
    }
  ],
  "statutes_cited": [
    {
      "name": "Motor Vehicles Act, 1939",
      "sections": [
        "68A",
        "68B",
        "68C",
        "68D",
        "68F"
      ],
      "relevance": "Chapter IVA enables State transport undertakings to nationalise routes; overriding effect; procedure for schemes including inter-State with Central approval; permit cancellation."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 13(3)",
        "Article 245",
        "Article 258(2)",
        "Article 298",
        "Entry 21 List III",
        "Entry 35 List III",
        "Seventh Schedule"
      ],
      "relevance": "Definition of law; legislative competence; delegation to State; executive power in trade; concurrent list powers for monopolies and vehicles."
    },
    {
      "name": "Motor Vehicles (Amendment) Act, 1956",
      "sections": [],
      "relevance": "Inserted Chapter IVA effective February 16, 1957."
    },
    {
      "name": "Road Transport Corporations Act, 1950",
      "sections": [
        "Section 3"
      ],
      "relevance": "Definition of State transport undertaking."
    },
    {
      "name": "Delhi Road Transport Authority Act, 1950",
      "sections": [
        "Section 3"
      ],
      "relevance": "Definition of State transport undertaking."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court dismissed the appeals, upheld the Allahabad High Court Division Bench judgment, declared the impugned schemes and notifications valid in law, rejecting all contentions of appellants regarding territorial limits, notice, and permit cancellation.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"No such scheme which relates to any inter-State route shall be deemed to be an approved scheme unless it has been published in the Official Gazette with the previous approval of the Central Government.\"",
      "speaker": "court",
      "significance": "Proviso to section 68D(3) central to upholding State competence for inter-State schemes."
    },
    {
      "text": "The proviso manifestly contemplates that the State Government can... approve a scheme relating to an inter-State route and publish the same. The only limitation... is that it should before publishing the scheme obtain the prior approval of the Central Government.",
      "speaker": "court",
      "significance": "Rejects territorial limit argument."
    },
    {
      "text": "\"The amplitude of the powers under the entry in the concurrent list expressly dealing with commercial and industrial monopolies cannot be presumed to be restricted by the generality of the expression trade and commerce in the State list.\"",
      "speaker": "court",
      "significance": "From Narayanappa case, upholding Parliamentary power for Chapter IVA."
    }
  ],
  "_case_id": "1973_424",
  "_label": 0,
  "_text_length": 24616,
  "_extracted_at": "2026-02-10T20:14:12.915698"
}