{
  "metadata": {
    "case_name": "Appellant (Engineering Company) v. Workmen and State of Maharashtra",
    "case_year": 1970,
    "court": "Supreme Court of India",
    "judges": [
      "VAIDIALINGAM, J."
    ],
    "case_number": "Civil Appeal No. 554 of 1970",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "On July 6, 1963, there was a settlement between the appellant and the workmen represented by the Secretaries of two unions - the Chemical Engineering and Metal Workers Union, Poona and the Association of Engineering Workers, Poona. Under clause 1, appellant agreed to pay dearness allowance on the basis of 75 neutralisation of the Sholapur Cost of Living Index computed for a month of 26 working days.",
      "type": "background",
      "date": "1963-07-06",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On July 7, 1964, a charter of demands was submitted by the workmen represented by the General Secretary, Association of Engineering Workers, Poona, relating to various items including wage scales and dearness allowance.",
      "type": "background",
      "date": "1964-07-07",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On December 12, 1964, the Central Government set up the Central Wage Board for engineering industries.",
      "type": "background",
      "date": "1964-12-12",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On January 23, 1965, the Association (2nd respondent) was recognised by the appellant under the code of discipline.",
      "type": "background",
      "date": "1965-01-23",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "On April 1, 1965, the appellant and the said Association entered into a settlement. Company ceded certain demands but not agreeable on wages and dearness allowance due to impending Poona Index and heavy financial liability. Demands treated as withdrawn with liberty to raise after Poona Index declared.",
      "type": "background",
      "date": "1965-04-01",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "In June 1965, the Poona Working Class Consumer Price Index was declared.",
      "type": "background",
      "date": "1965-06",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "On August 3, 1965, the second respondent raised a demand, including Demand No. 2 for replacing Sholapur Index with Poona Index at 100 neutralisation.",
      "type": "background",
      "date": "1965-08-03",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "On July 23, 1966, Central Government accepted majority recommendations of Wage Board for interim relief w.e.f. April 1, 1966, and requested employers to implement.",
      "type": "background",
      "date": "1966-07-23",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "On July 28, 1966, second respondent demanded payment of interim relief.",
      "type": "background",
      "date": "1966-07-28",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "On November 1, 1966, appellant and second respondent entered into settlement on interim relief as per Wage Board, adjustable against final recommendations. Clause 11: Union withdraws charter of Aug 3, 1965 on wages/DA; Clause 12: No dispute on wages/DA pending Wage Board final recommendations.",
      "type": "material",
      "date": "1966-11-01",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "On May 13, 1967, after negotiations on charter dated Aug 3, 1965 etc., settlement where Association withdrew demands on wages/DA pending Wage Board, referencing Nov 1, 1966 settlement.",
      "type": "material",
      "date": "1967-05-13",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "On May 16, 1967, third respondent (Serva Shramik Sanghatana) demanded DA at 6 paise per day for every point over 17 points of Poona CPI w.e.f. Jan 1, 1967.",
      "type": "background",
      "date": "1967-05-16",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "On October 3, 1967, third respondent issued two notices terminating settlements of July 6, 1963; Feb 4, 1965; April 1, 1965; Nov 1, 1966; May 13, 1967 under section 19(2) r/w rule 83 of Industrial Disputes Act, as two months' notice.",
      "type": "procedural",
      "date": "1967-10-03",
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Conciliation proceedings initiated.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f15",
      "text": "On July 2, 1968, appellant wrote to Deputy Commissioner of Labour stating interim relief implemented and will implement final Wage Board recommendations.",
      "type": "procedural",
      "date": "1968-07-02",
      "source": "court"
    },
    {
      "id": "f16",
      "text": "On November 30, 1968, third respondent made fresh demands for dearness allowance.",
      "type": "background",
      "date": "1968-11-30",
      "source": "court"
    },
    {
      "id": "f17",
      "text": "Wage Board made final recommendations around December 23, 1968 or January 3, 1969.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f18",
      "text": "On January 25, 1969, State of Maharashtra referred three disputes to Industrial Tribunal, Bombay (Ref I.T. No. 42/1969): (1) DA for monthly rated staff; (2) DA for daily rated workmen; (3) dismissal of 14 workmen and DA to them.",
      "type": "procedural",
      "date": "1969-01-25",
      "source": "court"
    },
    {
      "id": "f19",
      "text": "Appellant filed Special Civil Application No. 799 of 1969 in Bombay High Court under Article 226 to quash the reference order.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f20",
      "text": "Bombay High Court by judgment dated July 31/August 1, 1969 dismissed the writ petition holding reference valid.",
      "type": "procedural",
      "date": "1969-07-31",
      "source": "court"
    },
    {
      "id": "f21",
      "text": "Appellant filed appeal by special leave (Civil Appeal No. 554 of 1970).",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f22",
      "text": "On September 9, 1965, Minister for Labour of Maharashtra stated Government would not refer disputes on wages/DA for engineering establishments covered by Wage Board if employer agrees to implement interim and final recommendations.",
      "type": "background",
      "date": "1965-09-09",
      "source": "petitioner"
    },
    {
      "id": "f23",
      "text": "Letter dated September 24, 1965 by Engineering Associations referring to Minister's statement.",
      "type": "background",
      "date": "1965-09-24",
      "source": "petitioner"
    },
    {
      "id": "f24",
      "text": "State Government letter dated June 8, 1968 to Indian Hume Pipe Co. Ltd. declining reference as it implemented interim and prepared for final recommendations.",
      "type": "background",
      "date": "1968-06-08",
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the State Government was competent to make the reference for adjudication of disputes on dearness allowance when settlements dated November 1, 1966 and May 13, 1967 were subsisting.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether third respondent (minority union) had right to terminate the settlements entered by majority union.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether Minister's statement estops the Government from referring the dispute after appellant implemented interim relief and assured final implementation.",
      "framed_by": "petitioner"
    },
    {
      "id": "i4",
      "text": "Whether discrimination in referring appellant's dispute but not Indian Hume Pipe Co. Ltd.'s.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Third respondent, representing only minority of workmen, has no right to terminate agreements dated November 1, 1966 and May 13, 1967 entered by majority union (second respondent). These subsisting settlements binding on all, terminable only under section 19(7) of the Act. Hence reference invalid.",
      "supporting_facts": [
        "f10",
        "f11",
        "f13"
      ],
      "legal_basis": "Section 19(7) of Industrial Disputes Act, 1947"
    },
    {
      "id": "pa2",
      "text": "Minister for Labour stated on Sept 9, 1965 that Government would not refer wages/DA disputes if employer implements Wage Board recommendations. Appellant acted on this by implementing interim relief and assuring final, to its prejudice. Reference unjustified.",
      "supporting_facts": [
        "f22",
        "f23",
        "f15",
        "f24"
      ],
      "legal_basis": "Union of India v. Indo-Afghan Agencies Ltd.; Century Spinning Mfg. Co. Ltd. v. Ulhasnagar Municipal Council"
    },
    {
      "id": "pa3",
      "text": "Discrimination: State declined reference for Indian Hume Pipe Co. Ltd. for same reasons (implemented interim, ready for final) but referred appellant's dispute.",
      "supporting_facts": [
        "f24"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Question whether third respondent represented majority on relevant date to be investigated by Tribunal. State's view that settlements relate only to interim relief, so no need to terminate; this is a possible view justifying reference under section 10(1).",
      "supporting_facts": [
        "f10",
        "f11"
      ],
      "legal_basis": "Section 10(1) of Industrial Disputes Act, 1947"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Agrees with High Court that settlements dated Nov 1, 1966 and May 13, 1967 related only to interim relief as per Wage Board; workmen free to raise demands post final recommendations. State's view possible, hence reference competent.",
      "addresses_issue": "i1",
      "key_observation": "Settlements had character of interim relief; no bar on reference."
    },
    {
      "id": "cr2",
      "text": "No opinion on third respondent's right to terminate or majority representation; Tribunal to decide when adjudicating.",
      "addresses_issue": "i2",
      "key_observation": "Controversy on majority representation."
    },
    {
      "id": "cr3",
      "text": "Settlements preceded by union demands, made for industrial peace; no indication linked to Minister's statement. Estoppel decisions inapplicable.",
      "addresses_issue": "i3",
      "key_observation": "Minister's statement does not bind Government under Act."
    },
    {
      "id": "cr4",
      "text": "Discrimination argument not pressed before High Court; declined to entertain.",
      "addresses_issue": "i4",
      "key_observation": "Not argued below."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "State Government's reference valid as its view that settlements were only for interim relief is possible; competent under section 10(1).",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Union of India Ors. v. M/s Indo-Afghan Agencies Ltd.",
      "citation": "1968 2 S.C.R. 366",
      "treatment": "referred",
      "relevance": "Estoppel by representation"
    },
    {
      "case_name": "Century Spinning Manufacturing Company Ltd. and Anr. v. The Ulhasnagar Municipal Council and Anr.",
      "citation": "1970 3 S.C.R. 854",
      "treatment": "referred",
      "relevance": "Estoppel by representation"
    }
  ],
  "statutes_cited": [
    {
      "name": "Industrial Disputes Act, 1947",
      "sections": [
        "Section 19(2)",
        "Section 19(7)",
        "Section 10(1)",
        "Rule 83"
      ],
      "relevance": "Termination of settlements; power to refer disputes"
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 226"
      ],
      "relevance": "Writ petition to quash reference"
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal against Bombay High Court dismissal of writ challenging validity of State Government's reference of DA disputes to Tribunal dismissed. Reference held valid.",
    "relief_granted": null,
    "costs": "No order as to costs"
  },
  "key_quotes": [
    {
      "text": "\"the settlements related only to the interim relief is a possible one in the circumstances of this case. Hence, we cannot say that the reference made by the State Government was incompetent.\"",
      "speaker": "court",
      "significance": "Core holding on validity of reference"
    },
    {
      "text": "\"We express no opinion on the question, regarding the right of the third respondent to terminate the two agreements in question because there is a controversy as to whether, at the relevant date, the third respondent represented the majority of the workmen.\"",
      "speaker": "court",
      "significance": "Defers minority union termination issue to Tribunal"
    }
  ],
  "_case_id": "1973_168",
  "_label": 0,
  "_text_length": 16703,
  "_extracted_at": "2026-02-10T20:12:13.486352"
}