{
  "metadata": {
    "case_name": "Appellants v. Laxman Purshottam Pimputkar",
    "case_year": 1972,
    "court": "Supreme Court of India",
    "judges": [
      "KHANNA, J."
    ],
    "case_number": "Civil Appeal No. 1573 N of 1972",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The appellants and the respondent belong to one family. The respondent represents the seniormost branch of the family. The family was granted Patilki Watan in a number of villages, including Solsumbha, in district Thana. The watan land situated in Solsumbha is the subject matter of the present dispute.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Under the Bombay Hereditary Offices Act, 1874 the person who actually performs the duty of a hereditary office for the time being is called an officiator. Purshottam, father of the respondent, was the officiator till 1921 when, because of a disqualification incurred by him, a deputy was appointed in place of Purshottam. After the death of Purshottam in 1940, the respondent became the officiator.",
      "type": "background",
      "date": "1921",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The branch of the appellants claimed to be in possession of the watan land in dispute and some other lands under a partition effected in 1914.",
      "type": "disputed",
      "date": "1914",
      "source": "appellants"
    },
    {
      "id": "f4",
      "text": "In 1944 the respondent moved the government for resumption of the watan land in dispute which was in possession of the branch of the appellants. Prayer was also made by the respondent that he might be delivered possession of the land.",
      "type": "procedural",
      "date": "1944",
      "source": "respondent"
    },
    {
      "id": "f5",
      "text": "The government after some enquiry resumed that land by order dated October 9, 1946 and directed that possession of the same be restored to the respondent.",
      "type": "material",
      "date": "1946-10-09",
      "source": "government"
    },
    {
      "id": "f6",
      "text": "The appellants thereafter moved the government for reconsideration of that order. The government on May 2, 1947 modified its previous order by directing that the appellants could continue to retain the possession of the land in dispute subject to payment of rent as might be fixed by the government from time to time.",
      "type": "material",
      "date": "1947-05-02",
      "source": "government"
    },
    {
      "id": "f7",
      "text": "The respondent thereupon instituted suit for a declaration that the order of the government dated May 2,1947 and an ancillary order dated March 1, 1949 were null, void and inoperative. Prayer was also made that the appellants should remove all obstructions and hindrances from the land in dispute and should hand over the possession of the same to the respondent. It was further prayed that the appellants should render account of the income of the land to the respondent.",
      "type": "procedural",
      "date": "1949-03-01",
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "The suit was resisted by the appellants on the ground that the impugned orders were administrative orders and no suit could lie for setting them aside. The suits were also stated to be barred by limitation.",
      "type": "procedural",
      "date": null,
      "source": "appellants"
    },
    {
      "id": "f9",
      "text": "The trial court decreed the suit in favour of the respondent.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "On appeal the District Judge set aside the decree in favour of the respondent.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "The decision of the District Judge was affirmed on second appeal by the Gujarat High Court.",
      "type": "procedural",
      "date": "1971-02-03",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "This Court as per its judgment dated December 13, 1962, reported in 1964 1 S.C.R. 200, accepted the appeal of the respondent and set aside the judgment of the High Court and the District Judge and restored that of the trial court whereby decree for possession of the land in dispute had been awarded in favour of the respondent against the appellants.",
      "type": "material",
      "date": "1962-12-13",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "In the meanwhile in 1960 the State of Bombay was bifurcated and the land in dispute which was earlier part of Bombay State became part of the State of Gujarat.",
      "type": "background",
      "date": "1960",
      "source": "court"
    },
    {
      "id": "f14",
      "text": "On April 1, 1963 the Gujarat Patel Watans Abolition Act, 1961 came into force.",
      "type": "background",
      "date": "1963-04-01",
      "source": "court"
    },
    {
      "id": "f15",
      "text": "On July 19, 1966 the respondent filed an application to execute the decree for possession of the land which had been awarded in his favour.",
      "type": "procedural",
      "date": "1966-07-19",
      "source": "respondent"
    },
    {
      "id": "f16",
      "text": "Objection was then taken by the appellants that the decree awarded in favour of the respondent had become inexecutable because of the coming into force of the Act.",
      "type": "procedural",
      "date": null,
      "source": "appellants"
    },
    {
      "id": "f17",
      "text": "This objection found favour with the executing court which subsequently dismissed the execution application.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f18",
      "text": "Appeal filed by the respondent against the order of the executing court was dismissed by the District Judge Bulsar.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f19",
      "text": "The respondent thereafter filed second appeal before the Gujarat High Court. The High Court came to the conclusion that the respondent was entitled to execute the decree for possession of the land obtained by him against the appellants. Appeal of the respondent was accordingly allowed.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the decree for the possession of the land in dispute awarded in favour of Laxman Purshottam Pimputkar respondent No. 1 hereinafter described as the respondent has become inexecutable after the coming into force of the Gujarat Patel Watans Abolition Act, 1961",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "In view of the provisions contained in section 4 of the Act, the decree for the possession of the land in dispute awarded in favour of the respondent has become inexecutable. As the decree was awarded in favour of the respondent in his capacity as a watandar and as patel watans have been abolished, the respondent cannot obtain the possession of the land to which he was entitled as a watandar.",
      "supporting_facts": [
        "f12",
        "f14"
      ],
      "legal_basis": "Section 4 of the Gujarat Patel Watans Abolition Act, 1961"
    },
    {
      "id": "pa2",
      "text": "The words 'any decree or order of a court' in the opening clause of section 4 of the Act indicate that the decree or order of a court can also not be executed with effect from the appointed day.",
      "supporting_facts": [
        "f14"
      ],
      "legal_basis": "Section 4 of the Gujarat Patel Watans Abolition Act, 1961"
    },
    {
      "id": "pa3",
      "text": "Reference to Full Bench decision of Nagpur High Court in Chhote Khan v. Mohammad Obedulla Khan where pre-emption decrees became inexecutable after abolition Act.",
      "supporting_facts": [],
      "legal_basis": "Chhote Khan v. Mohammad Obedulla Khan"
    },
    {
      "id": "pa4",
      "text": "If the appellants are not dispossessed in execution of the decree, the appellants can approach the State Government for regrant of the land under section 10 as their eviction would cause undue hardship.",
      "supporting_facts": [
        "f16"
      ],
      "legal_basis": "Section 10 of the Gujarat Patel Watans Abolition Act, 1961"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "There is nothing in the language of section 4 which renders the decree for the possession of the land in dispute inexecutable. In any case, the right of the respondent to execute the decree and the liability of the appellants to hand over possession of the land to the respondent under the decree have been kept intact by section 22 of the Act.",
      "supporting_facts": [
        "f12",
        "f14"
      ],
      "legal_basis": "Sections 4 and 22 of the Gujarat Patel Watans Abolition Act, 1961"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "There is nothing in the language of section 4 which renders such decrees for possession to be inexecutable. Had the legislature intended that the decrees for possession of the watan lands which had been obtained by the watandars against third persons should become inexecutable, the legislature would have indicated such an intention by incorporating some provision to that effect.",
      "addresses_issue": "i1",
      "key_observation": "Section 4 does not prohibit execution of decree for possession obtained by watandar."
    },
    {
      "id": "cr2",
      "text": "The fact that patel watans have been abolished and incidents appertaining to the watans have been extinguished does not lead to the conclusion that the right of the erstwhile watandar to the possession of the watan lands also comes to an end.",
      "addresses_issue": "i1",
      "key_observation": "Residual right to possession remains via regrant under section 6."
    },
    {
      "id": "cr3",
      "text": "Clause (iv) of section 4 expressly provides that the resumption of watan land consequent upon the abolition of patel watans would be subject to sections 6, 7 and 10. Under section 6, watan land shall be regranted to the watandar who shall be deemed to be occupant.",
      "addresses_issue": "i1",
      "key_observation": "Watandar entitled to possession if complies with section 6."
    },
    {
      "id": "cr4",
      "text": "The object of the Act was to abolish patel watans because its hereditary character smacked of feudalism, but not to deprive watandar of possession if conditions in section 6 complied with.",
      "addresses_issue": "i1",
      "key_observation": "No severance of all connections between watandar and watan land."
    },
    {
      "id": "cr5",
      "text": "A combined reading of sections 4, 6, 7 and 10 shows watandar does not automatically lose right to possession. Position of unauthorised holder different (evictable under s.10).",
      "addresses_issue": "i1",
      "key_observation": "Respondent entitled under s.6."
    },
    {
      "id": "cr6",
      "text": "Words 'any decree or order of a court' in opening clause of s.4 are ejusdem generis with preceding particular expressions like settlement, grant etc., and do not prevent operation of s.4 but do not render decrees inexecutable.",
      "addresses_issue": "i1",
      "key_observation": "Ejusdem generis rule applies (Maxwell on Interpretation)."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The decree for possession of the watan land obtained by the watandar (respondent) against other persons (appellants) remains executable despite abolition of patel watans under the Act.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Previous Supreme Court judgment in this matter",
      "citation": "1964 1 S.C.R. 200",
      "treatment": "followed",
      "relevance": "Restored trial court decree for possession to respondent on December 13, 1962."
    },
    {
      "case_name": "Chhote Khan v. Mohammad Obedulla Khan",
      "citation": null,
      "treatment": "distinguished",
      "relevance": "Nagpur HC Full Bench held preemption decrees inexecutable after MP Abolition Act; distinguished as different context."
    }
  ],
  "statutes_cited": [
    {
      "name": "Gujarat Patel Watans Abolition Act, 1961",
      "sections": [
        "Section 2(7)",
        "Section 2(11)",
        "Section 2(14)",
        "Section 2(15)",
        "Section 2(16)",
        "Section 2(17)",
        "Section 2(18)",
        "Section 3",
        "Section 4",
        "Section 5",
        "Section 6",
        "Section 7",
        "Section 10",
        "Section 22"
      ],
      "relevance": "Abolishes patel watans, resumes watan land subject to regrant to watandar (s.6), authorised holder (s.7), eviction of unauthorised (s.10); s.22 saves prior obligations; does not render decree inexecutable."
    },
    {
      "name": "Bombay Hereditary Offices Act, 1874",
      "sections": [],
      "relevance": "Defines 'officiator' as person performing duty of hereditary office."
    },
    {
      "name": "Bombay Land Revenue Code",
      "sections": [],
      "relevance": "Applicable to regranted watan land as unalienated land; eviction procedures."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court dismissed the appellants' appeal by special leave, holding that the decree for possession awarded to the respondent remains executable despite the Gujarat Patel Watans Abolition Act, 1961, affirming the Gujarat High Court's order allowing execution.",
    "relief_granted": "Respondent entitled to execute decree for possession.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "Whether the decree for the possession of the land in dispute awarded in favour of Laxman Purshottam Pimputkar respondent No. 1 has become inexecutable after the coming into force of the Gujarat Patel Watans Abolition Act, 1961 is the short question which arises for determination in this appeal.",
      "speaker": "court",
      "significance": "Frames the core legal issue."
    },
    {
      "text": "There is nothing in the language of section 4 which renders such decrees for possession to be inexecutable.",
      "speaker": "court",
      "significance": "Key holding on executability of decree."
    },
    {
      "text": "The object of the Act as would appear from its preamble was to abolish patel watans because its hereditary character smacked of some kind of feudalism. At the same time, the legislature made it clear that it was not intended to deprive the watandar of the possession of the land if he complied with the conditions laid down in section 6 of the Act.",
      "speaker": "court",
      "significance": "Explains legislative intent balancing abolition with possession rights."
    }
  ],
  "_case_id": "1973_267",
  "_label": 0,
  "_text_length": 21031,
  "_extracted_at": "2026-02-10T20:13:01.148638"
}