{
  "metadata": {
    "case_name": "Sant Narain Mathur & Ors. v. Rama Krishna Mission & Ors.",
    "case_year": 1973,
    "court": "Supreme Court of India",
    "judges": [
      "KHANNA, J."
    ],
    "case_number": "Civil Appeal No. 689 of 1973",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Dr. Chandan Singh settled in Dehra Dun towards the end of the last century. He had two sons Tegh Singh and Shamsher Singh and two daughters Deva Devi and Lachmi Devi. Dayali Devi was the wife of Shamsher Singh.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On March 26, 1897 Dr. Chandan Singh executed a will bequeathing his estate in equal shares to his sons Tegh Singh and Shamsher Singh for their lifetime, with provisions for their sons or legal heirs thereafter, and maintenance for widows if issue-less.",
      "type": "material",
      "date": "1897-03-26",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Chandan Singh died on April 1, 1897.",
      "type": "material",
      "date": "1897-04-01",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Tegh Singh, elder son of Chandan Singh, died issue-less in 1908.",
      "type": "material",
      "date": "1908",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "On July 14, 1944 Shamsher Singh executed a will appointing Capt. J. N. Mitra as executor, providing maintenance to Dayali Devi and Deva Devi, and bequeathing entire estate to Rama Krishna Mission after Dayali Devi's death.",
      "type": "material",
      "date": "1944-07-14",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Shamsher Singh died issueless on January 20, 1946 leaving behind widow Dayali Devi and sister Deva Devi.",
      "type": "material",
      "date": "1946-01-20",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "On December 10, 1946 Capt. J. N. Mitra applied for probate of Shamsher Singh's will in Allahabad High Court. Dayali Devi contested and set up a rival will. Probate granted on March 18, 1949. Letters Patent appeal dismissed on March 14, 1952.",
      "type": "procedural",
      "date": "1946-12-10",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "On July 15, 1952 Dayali Devi filed Civil Suit No. 54 of 1952 for declaration of ownership of Shamsher Singh's properties under Chandan Singh's will. Dismissed by trial court on November 7, 1958. Appeal No. 605 of 1958 dismissed by Allahabad High Court on November 21, 1961.",
      "type": "procedural",
      "date": "1952-07-15",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "On February 1, 1958 Capt. Mitra filed Suit No. 31 of 1958 for possession of properties: Kothi No. 7 Kutcheri Road (Tegh Villa), shop at No. 4 New Road, two Havelis at No. 4 New Road, Kothi Vishranti at Kishanpura Rajpur Road.",
      "type": "material",
      "date": "1958-02-01",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Trial court decreed possession in favour of Capt. Mitra on March 27, 1963, holding Shamsher Singh full owner, Vishranti and superstructure of Kothi No.7 self-acquired, others ancestral.",
      "type": "procedural",
      "date": "1963-03-27",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Dayali Devi filed appeal No. 360 of 1963. Deva Devi's pauper appeal application rejected September 18, 1963; cross-objections dismissed April 24, 1964.",
      "type": "procedural",
      "date": "1963",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Deva Devi died November 29, 1966. Her name struck off by High Court December 20, 1967.",
      "type": "procedural",
      "date": "1966-11-29",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Dayali Devi died November 10, 1968. Appellants (including Sant Narain Mathur) substituted as her legal representatives based on her alleged will two days prior.",
      "type": "procedural",
      "date": "1968-11-10",
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Allahabad High Court dismissed appeal No. 360 of 1963 on October 19, 1972, holding prior judgment res judicata, decree against Deva Devi final.",
      "type": "procedural",
      "date": "1972-10-19",
      "source": "lower_court"
    },
    {
      "id": "f15",
      "text": "High Court dismissed certificate under Article 133 on February 21, 1973.",
      "type": "procedural",
      "date": "1973-02-21",
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether Shamsher Singh acquired full ownership of Chandan Singh's estate, entitling executor Capt. Mitra to decree for exclusive possession rather than joint possession.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether appellants could raise plea of joint possession for the first time in Supreme Court, given it was not taken in trial court or High Court.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Interpretation of Chandan Singh's will regarding rights of sons' widows and heirs.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Trial court and High Court erred in awarding decree for exclusive possession; Shamsher Singh owned only half share after Tegh Singh's death, so entitled to joint possession only against trespasser.",
      "supporting_facts": [
        "f2",
        "f4",
        "f10"
      ],
      "legal_basis": "Eughes v. Justin; Muir v. Jenks; Naresh Chandra Basu v. Hayder Sheikh Khan; Joy Gopal Singha v. Probodh Chandra Bhattacharjee; Abdul Hamid v. Durga Charan Das; Rain Ranbijaya Prasad Singh v. Ramjivan Ram; Abdul Kabir v. Ht. Jamila Khatoon"
    },
    {
      "id": "pa2",
      "text": "High Court erred in observing that trial court's finding on nature of properties (ancestral vs self-acquired) was not challenged.",
      "supporting_facts": [
        "f10",
        "f14"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Trial court wrongly held Deva Devi had no interest in Chandan Singh's estate; invoke Order 41 Rule 33 CPC to correct.",
      "supporting_facts": [
        "f2",
        "f10"
      ],
      "legal_basis": "Order 41 Rule 33 CPC"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Plea of joint possession not taken in trial court or High Court, so cannot be raised first time in Supreme Court.",
      "supporting_facts": [
        "f9",
        "f10",
        "f14"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Dayali Devi bound by res judicata from earlier suit; decree against Deva Devi final.",
      "supporting_facts": [
        "f8",
        "f11",
        "f14"
      ],
      "legal_basis": "res judicata"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "High Court's observation that certain findings not challenged is unequivocal; no mention in certificate application or SLP, indicating afterthought.",
      "addresses_issue": "i2",
      "key_observation": "Appellants' counsel did not challenge findings earlier."
    },
    {
      "id": "cr2",
      "text": "No plea for joint possession taken in trial court or High Court; suit alleged full ownership by Shamsher Singh.",
      "addresses_issue": "i1",
      "key_observation": "New plea not permitted at apex court stage."
    },
    {
      "id": "cr3",
      "text": "Long litigation history since 1946; principal contestants deceased; allowing new plea would prolong endless dispute.",
      "addresses_issue": "i2",
      "key_observation": "Time to end litigation; remand unnecessary."
    },
    {
      "id": "cr4",
      "text": "Appellants have no direct relation to original parties; claim based on recent alleged will of Dayali Devi.",
      "addresses_issue": "i2",
      "key_observation": "Circumstances weigh against new plea."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Appellants not permitted to raise plea of joint possession for first time in Supreme Court.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Decree for possession in favour of Capt. Mitra upheld; no interference needed as prior findings binding.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Tagore v. Tagore",
      "citation": null,
      "treatment": "followed",
      "relevance": "Bequest to unborn persons void; Dayali Devi not in existence at Chandan Singh's death."
    },
    {
      "case_name": "Eughes v. Justin",
      "citation": "1894 16 B 67",
      "treatment": "referred",
      "relevance": "Plaintiff not entitled to judgment exceeding due amount."
    },
    {
      "case_name": "Muir v. Jenks",
      "citation": "1932 K B 412",
      "treatment": "referred",
      "relevance": "Similar to above."
    },
    {
      "case_name": "Naresh Chandra Basu v. Hayder Sheikh Khan Ors.",
      "citation": "AIR 1929 Cal 28",
      "treatment": "referred",
      "relevance": "Co-sharer against trespasser gets joint possession decree only."
    },
    {
      "case_name": "Joy Gopal Singha Ors. v. Probodh Chandra Bhattacharjee",
      "citation": "AIR 1935 Cal 646",
      "treatment": "referred",
      "relevance": "Similar."
    },
    {
      "case_name": "Abdul Hamid Ors. v. Durga Charan Das",
      "citation": "AIR 1967 Cal 116",
      "treatment": "referred",
      "relevance": "Similar."
    },
    {
      "case_name": "Rain Ranbijaya Prasad Singh v. Ramjivan Ram Ors.",
      "citation": "AIR 1942 Patna 397",
      "treatment": "referred",
      "relevance": "Similar."
    },
    {
      "case_name": "Abdul Kabir and Ors. v. Ht. Jamila Khatoon and Ors.",
      "citation": "AIR 1951 Patna 315",
      "treatment": "referred",
      "relevance": "Similar."
    }
  ],
  "statutes_cited": [
    {
      "name": "Code of Civil Procedure",
      "sections": [
        "Order 41 Rule 33"
      ],
      "relevance": "Power to interfere with decree of non-appealing party only if necessary for appellant's relief; not applicable here as appeal fails."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 133"
      ],
      "relevance": "Certificate for appeal to Supreme Court denied."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court dismissed the appeal by special leave, upholding High Court's dismissal of appeal against trial court's decree for possession in favour of Capt. Mitra (represented by Rama Krishna Mission), refusing to entertain new plea on joint possession due to not raised earlier and protracted litigation.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "Time hath its revolutions, there must be a period and an end to all temporal things-an end of names, and dignities and whatsoever is terrene, and why not of De Vere?",
      "speaker": "court",
      "significance": "Emphasizes need to end long-drawn litigation."
    },
    {
      "text": "It is time, in our opinion, that we draw the final curtain on this long drawn litigation and not allow its embers to smoulder for a further length of time.",
      "speaker": "court",
      "significance": "Core reason for dismissing appeal without remand."
    }
  ],
  "_case_id": "1974_252",
  "_label": 0,
  "_text_length": 22944,
  "_extracted_at": "2026-02-10T20:05:33.698835"
}