{
  "metadata": {
    "case_name": "Hari Singh Mann v. State",
    "case_year": 1970,
    "court": "Supreme Court of India",
    "judges": [
      "RAY, C.J."
    ],
    "case_number": "Civil Appeal No. 1955 of 1970",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant selected by Public Service Commission as direct recruit on 20 May 1965.",
      "type": "background",
      "date": "1965-05-20",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Appellant appointed on 26 May 1965 and joined as probationer with two years probation period.",
      "type": "background",
      "date": "1965-05-26",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On 1 July 1967, period of probation extended by one year.",
      "type": "procedural",
      "date": "1967-07-01",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On 20 May 1968, order terminating services of appellant issued.",
      "type": "procedural",
      "date": "1968-05-20",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Appellant on leave from 20 May 1968 to 2 August 1968, period excluded from probation.",
      "type": "procedural",
      "date": "1968-05-20",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "On 20 July 1968, order revoking termination and extending probation for six months from 20 May 1968.",
      "type": "procedural",
      "date": "1968-07-20",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Order of termination passed on 30 January 1969, effective 2 February 1969 A.N., dispensing with services under Rule 8(b) of Punjab Police Service Rules 1959, considering appellant unfit for appointment to State Police Service.",
      "type": "material",
      "date": "1969-01-30",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "High Court judgment dated 5 November 1969 in Civil Writ No. 309 of 1969 dismissing appellant's writ.",
      "type": "procedural",
      "date": "1969-11-05",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Inspector General of Police's affidavit stated appellant's record during probation was unsatisfactory.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the order of termination of the service of the appellant, a probationer, is in violation of Rule 9 of the Punjab Civil Services (Punishment and Appeal) Rules, 1952.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Order of termination passed on 30 January 1969 after appellant stood confirmed on 19/20 November 1968 due to expiry of three years.",
      "supporting_facts": [
        "f2",
        "f3",
        "f6"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Order of termination is one of punishment as it states appellant considered unfit for appointment, and appellant's record was unsatisfactory, attracting Rule 9 requiring opportunity to show cause.",
      "supporting_facts": [
        "f7",
        "f9"
      ],
      "legal_basis": "Rule 9 of Punjab Civil Services (Punishment and Appeal) Rules, 1952"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Termination under Rule 8(b) of Punjab Police Service Rules 1959 is distinct from penalties under Rule 11 which refers to Punjab Civil Services (Punishment and Appeal) Rules; no violation of Rule 9.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "Rule 8(b) and Rule 11 of Punjab Police Service Rules 1959; Rule 9 of Punjab Civil Services (Punishment and Appeal) Rules, 1952"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Period of probation had not expired by January 1969 due to extensions and exclusion of leave period; appellant could not be confirmed before probation end.",
      "addresses_issue": "i1",
      "key_observation": "Object of extending probation is to assess fitness; no automatic confirmation."
    },
    {
      "id": "cr2",
      "text": "Termination order based on unfitness for appointment at confirmation time, not on misconduct or turpitude; words 'unfit' do not cast stigma or amount to punishment.",
      "addresses_issue": "i1",
      "key_observation": "Termination for inadequacy or unsuitability without moral turpitude is not punishment; preserves authority to judge fitness."
    },
    {
      "id": "cr3",
      "text": "Rule 9 applies to termination for specific fault implying unsuitability with opportunity; here, simple termination under Rule 8(b) on unfitness, separate from penalties under Rule 11.",
      "addresses_issue": "i1",
      "key_observation": "Facts do not show stigma attached to order."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Termination of probationer's services on ground of unfitness for appointment under Rule 8(b) does not attract Rule 9 of Punjab Civil Services (Punishment and Appeal) Rules, 1952, as it is not punitive.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Punjab Police Service Rules, 1959",
      "sections": [
        "Rule 8(b)",
        "Rule 11"
      ],
      "relevance": "Rule 8(b) allows dispensation of services of probationer reported unfit; Rule 11 governs discipline, penalties via Punjab Civil Services Rules, distinguishing termination from punishment."
    },
    {
      "name": "Punjab Civil Services (Punishment and Appeal) Rules, 1952",
      "sections": [
        "Rule 9"
      ],
      "relevance": "Requires opportunity to show cause for termination on specific fault, unsatisfactory record or unfavourable reports implying unsuitability; held not applicable here."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal by special leave dismissed; termination order upheld as not violative of Rule 9, being simple termination on unfitness without stigma of punishment.",
    "relief_granted": null,
    "costs": "Parties to pay and bear their own costs."
  },
  "key_quotes": [
    {
      "text": "\"The President of India is pleased to dispense with the service of Shri Hari Singh Mann... having considered him unfit for appointment to the State Police Service.\"",
      "speaker": "court",
      "significance": "Text of termination order central to determining if punitive."
    },
    {
      "text": "\"To hold that the words unfit to be appointed are a Stigma would rob the authorities of the power to judge fitness for work or suitability to the post at the time of confirmation.\"",
      "speaker": "court",
      "significance": "Core reasoning why termination not punishment."
    },
    {
      "text": "\"Termination of services on account of inadequacy for the job or for any temperamental or other defect not involving moral turpitude is not a stigma which can be called discharge by punishment.\"",
      "speaker": "court",
      "significance": "Distinguishes simple termination from punitive action."
    }
  ],
  "_case_id": "1974_212",
  "_label": 0,
  "_text_length": 6252,
  "_extracted_at": "2026-02-10T20:05:25.257785"
}