{
  "metadata": {
    "case_name": "Writ Petition No. 118 of 1974",
    "case_year": 1974,
    "court": "Supreme Court of India",
    "judges": [
      "CHANDRACHUD, J."
    ],
    "case_number": "Writ Petition No. 118 of 1974",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Petitioner was detained by an order dated August 23, 1973 passed by the District Magistrate, Howrah, under the Maintenance of Internal Security Act, 1971, with a view to preventing him from acting in any manner prejudicial to the maintenance of public order.",
      "type": "procedural",
      "date": "1973-08-23",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Particulars of the ground of detention refer to a solitary incident dated March 18, 1973, at about 2 p.m., where the petitioner and his associates, being armed with swords, Ballams and Lathis, attacked a group of Bengalees at Rajnarayan Roy Choudhury Ghat Road, Shibpur, Howrah, causing severe injuries to them.",
      "type": "material",
      "date": "1973-03-18",
      "source": "grounds_of_detention"
    },
    {
      "id": "f3",
      "text": "The incident led to a reign of terror in the locality as a result of which the shops and the doors of the road side houses were closed, people of the locality fled away in panic and the people were generally afraid of coming out of their houses for fear of being assaulted.",
      "type": "material",
      "date": "1973-03-18",
      "source": "grounds_of_detention"
    },
    {
      "id": "f4",
      "text": "Counter-affidavit filed on behalf of the State Govt. shows that no other material was taken into account by the detaining authority while passing the order of detention.",
      "type": "admitted",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f5",
      "text": "State Government approved the detention on August 30, 1973, but the order of approval referred to a detention order dated 25-8-73.",
      "type": "procedural",
      "date": "1973-08-30",
      "source": "respondent"
    },
    {
      "id": "f6",
      "text": "The impugned order of detention is dated August 23, 1973 and bears number 1818-C.",
      "type": "procedural",
      "date": "1973-08-23",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "State Govt. passed an order on November 8, 1973 confirming the order of detention dated August 23, 1973 after obtaining the opinion of the Advisory Board, and it refers to detention order bearing No. 1818-C.",
      "type": "procedural",
      "date": "1973-11-08",
      "source": "respondent"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the detention order founded on a single incident but using language 'you have been acting in a manner prejudicial to the maintenance of public order' implies undisclosed material over a long period, contravening Article 22(5) of the Constitution.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether the State Government's approval order dated August 30, 1973 referring to a detention order dated 25-8-73 (instead of 23-8-73) means it approved some other order of detention.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The order is founded on a single incident and therefore, the use of language showing that the culpable conduct on the part of the petitioner extended over an appreciably long period of time was wholly inappropriate. Inferentially, the detaining authority had material before it showing that the petitioner was indulging in a criminal course of conduct for a long period of time and as such material was not disclosed to the petitioner, he had no opportunity to meet it, leading to contravention of Article 22(5).",
      "supporting_facts": [
        "f2",
        "f3"
      ],
      "legal_basis": "Article 22(5)"
    },
    {
      "id": "pa2",
      "text": "When the State Government approved the detention on August 30, 1973 it passed an order approving a detention order dated 25-8-73. As the impugned order of detention is dated August 23, 1973, the State Government had before it some other order of detention.",
      "supporting_facts": [
        "f5",
        "f6"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "No other material was taken into account by the detaining authority while passing the order of detention.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "The reference to an order dated 25-8-73 in the order of approval is a typographical error, as confirmed by the order of confirmation dated November 8, 1973 referring to the correct date August 23, 1973 and number 1818-C.",
      "supporting_facts": [
        "f6",
        "f7"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "In matters involving the liberty of the subject, the detaining authorities ought to exercise the greatest care, but that does not justify an unrealistic dissection of detention orders. The counter-affidavit shows no other material was taken into account. The use of the expression 'you have been acting' though unfortunate does not support that the order is founded on undisclosed material. The petitioner was expressly apprised that he had been acting in a manner prejudicial to public order as evidenced by the particulars furnished to him, which refer only to a single incident.",
      "addresses_issue": "i1",
      "key_observation": "We are not impressed by this submission."
    },
    {
      "id": "cr2",
      "text": "The order of approval contains but a typographical error. This is clear from the order passed by the State Govt. on November 8, 1973 confirming the order of detention after obtaining the opinion of the Advisory Board, which refers to the order dated August 23, 1973 and number 1818-C, matching the detention order.",
      "addresses_issue": "i2",
      "key_observation": "There is no substance in this contention."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The detention order is valid; both grounds of challenge rejected.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "The approval order contains a typographical error but correctly refers to the impugned detention order.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Maintenance of Internal Security Act, 1971",
      "sections": [],
      "relevance": "Detention order passed under this Act"
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 32",
        "Article 22(5)"
      ],
      "relevance": "Petition under Art. 32; violation of Art. 22(5) alleged"
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Court confirms the order of detention and discharges the rule in the writ petition for habeas corpus.",
    "relief_granted": "None",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "We are not impressed by this submission.",
      "speaker": "court",
      "significance": "Rejects petitioner's first ground on use of 'you have been acting'"
    },
    {
      "text": "There is no substance in this contention.",
      "speaker": "court",
      "significance": "Rejects petitioner's second ground on approval order date"
    },
    {
      "text": "In matters involving the liberty of the subject, the detaining authorities ought to exercise the greatest care in the discharge of their functions. But that does not justify an unrealistic dissection of detention orders.",
      "speaker": "court",
      "significance": "Balances strict scrutiny with practical interpretation of orders"
    }
  ],
  "_case_id": "1974_296",
  "_label": 0,
  "_text_length": 4199,
  "_extracted_at": "2026-02-10T20:06:03.067090"
}