{
  "metadata": {
    "case_name": "Appellant (Tenant) v. Respondent (Landlord)",
    "case_year": 1973,
    "court": "Supreme Court of India",
    "judges": [
      "RAY, C.J."
    ],
    "case_number": "Civil Appeal No. 1013 of 1973",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The appellant became a tenant of the respondent for a period of five years with effect from 1 March, 1943 in respect of certain agricultural lands belonging to the respondent. The lease contained a clause for renewal for five years which the appellant did not exercise.",
      "type": "background",
      "date": "1943-03-01",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The lease expired on 28 February, 1948.",
      "type": "material",
      "date": "1948-02-28",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Under section 23(1)(b) of the Bombay Tenancy Act, 1939 as amended in 1946, every lease subsisting on the date when that section came into force became deemed to be for a period of not less than ten years, so the appellant's lease expired on 28 February, 1953.",
      "type": "material",
      "date": "1948-02-28 to 1953-02-28",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The respondent by a notice dated 25 October, 1955 terminated the tenancy with effect from 1 April, 1957.",
      "type": "procedural",
      "date": "1955-10-25",
      "source": "respondent"
    },
    {
      "id": "f5",
      "text": "The respondent gave another notice to the appellant on 10 June, 1958 without prejudice to the earlier notice and called upon the appellant to deliver possession within 7 days.",
      "type": "procedural",
      "date": "1958-06-10",
      "source": "respondent"
    },
    {
      "id": "f6",
      "text": "The respondent on 14 September, 1959 filed a suit against the appellant for possession.",
      "type": "procedural",
      "date": "1959-09-14",
      "source": "respondent"
    },
    {
      "id": "f7",
      "text": "The trial Court did not grant a decree for possession. On appeal the High Court also held that the appellant was not liable to be evicted.",
      "type": "procedural",
      "date": "null",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "On appeal, this Court remanded the matter to the High Court for a report on whether the appellant was a protected tenant on 1 March, 1953 and if so, whether the appellant could claim benefit of Section 5 of the Amending Act, 1952.",
      "type": "procedural",
      "date": "null",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "The High Court submitted the report holding that the appellant was a protected tenant on 1 March, 1953 but that the appellant was not entitled to claim the benefit of section 5 of the Amending Act 1952.",
      "type": "procedural",
      "date": "null",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "This Court affirmed both the findings of the High Court and set aside the judgment of the High Court.",
      "type": "procedural",
      "date": "null",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "See Manekji Edulji Mistry Ors. v. Manekshe Ardeshir Irani Anr. 1972 1 C.R. 334.",
      "type": "procedural",
      "date": "1972",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "This Court at the invitation of the parties directed the High Court to determine whether there was a valid termination of tenancy because there were two issues as to damages yet to be decided.",
      "type": "procedural",
      "date": "null",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "The High Court on remand has held that the appellant was not entitled to any notice and that the appellant was a tenant on sufferance. The issues as to damages are not yet heard.",
      "type": "procedural",
      "date": "1972-09-07",
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "The landlord did not make any application to the Mamlatdar for a declaration that the tenant is not a protected tenant prior to 8 November, 1947 as contemplated in section 3A of the 1939 Act as modified by the 1948 Act.",
      "type": "material",
      "date": "1947-11-08",
      "source": "court"
    },
    {
      "id": "f15",
      "text": "From 1 March, 1953 until 31 July, 1956 the appellant remained a protected tenant under the 1948 Act until section 88B was introduced by Act 13 of 1956.",
      "type": "material",
      "date": "1953-03-01 to 1956-07-31",
      "source": "court"
    },
    {
      "id": "f16",
      "text": "The effect of introduction of section 88B in the 1948 Act was that the appellant no longer remained a protected tenant.",
      "type": "material",
      "date": "1956-08-01",
      "source": "court"
    },
    {
      "id": "f17",
      "text": "The Collector held an inquiry under section 88B(2) of the Act for the purpose of granting a certificate to the respondent that the conditions in the proviso to section 88B(1) are satisfied by the Trust.",
      "type": "procedural",
      "date": "null",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "whether the appellant is entitled to protection of section 4B of the Bombay Tenancy and Agricultural Lands Act, 1948",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "whether the appellant was entitled to a notice when the Collector held an inquiry under section 88B(2) of the Act",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "the appellant is entitled to protection under section 4B of the 1948 Act because the appellant is holding over and the tenancy cannot be terminated by efflux of time.",
      "supporting_facts": [
        "f2",
        "f3"
      ],
      "legal_basis": "Section 4B of the Bombay Tenancy and Agricultural Lands Act, 1948"
    },
    {
      "id": "pa2",
      "text": "the appellant was entitled to a notice when the Collector held an inquiry under section 88B(2) of the Act for the purpose of granting a certificate to the respondent.",
      "supporting_facts": [
        "f17"
      ],
      "legal_basis": "Section 88B(2) of the 1948 Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The appellant was not entitled to any notice and that the appellant was a tenant on sufferance.",
      "supporting_facts": [
        "f13"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The appellant became a protected tenant by virtue of the 1948 Act read with section 3A of the 1939 Act since the landlord did not make any application as contemplated.",
      "addresses_issue": "i1",
      "key_observation": "The result was that the appellant became a protected tenant."
    },
    {
      "id": "cr2",
      "text": "From 1 March, 1953 until 31 July, 1956 the appellant remained a protected tenant until section 88B was introduced, after which the appellant no longer remained a protected tenant.",
      "addresses_issue": "i1",
      "key_observation": "After the appellant ceased to be protected tenant on 1 August, 1956 and the original contractual tenancy had ceased on 28 February, 1948 the appellant was in occupation of the lands on sufferance."
    },
    {
      "id": "cr3",
      "text": "It cannot be said that the respondent assented to the appellant continuing in possession on the same terms and conditions as in the original tenancy. When the protection was withdrawn there could be no question of holding over because there was no contractual tenancy.",
      "addresses_issue": "i1",
      "key_observation": "If a lessee remains in possession after determination of the term, he is under the common law a tenant on sufferance."
    },
    {
      "id": "cr4",
      "text": "The expression holding over is used in the sense of retaining possession. If a tenant after the termination of the lease is in possession without the consent of the landlord, he is a tenant by sufferance. It is only where a tenant will continue in possession with the consent of the landlord that he can be called a tenant holding over or a tenant at will.",
      "addresses_issue": "i1",
      "key_observation": "In the present case, there is no doubt that the appellant did not have any consent and the respondent never gave any consent to hold over. The appellant remained in possession on sufferance."
    },
    {
      "id": "cr5",
      "text": "Therefore section 4B of the Act has no application because there is no tenancy. Tenancy is a matter of privity of parties. If there is no consent, the appellant is a trespasser.",
      "addresses_issue": "i1",
      "key_observation": "Section 4B states that no tenancy of any land shall be terminated merely on the ground that the period fixed by agreement or usage for its duration has expired."
    },
    {
      "id": "cr6",
      "text": "The High Court did not accept the contention that the appellant was entitled to a notice in the Collector inquiry under section 88B(2). The appellant at no stage denied the fact that the lands are the property of a Trust. The inquiry is between the Collector and the Trust. The conclusive evidence clause in the section means that it is a rule of evidence which would not render it necessary for it to prove again the compliance with the requirements.",
      "addresses_issue": "i2",
      "key_observation": "The Trust has to satisfy two conditions: registered under Bombay Public Trust Act, 1950 and entire income appropriated for Trust purposes."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The appellant is not entitled to protection under section 4B of the 1948 Act as there is no tenancy; the appellant is a tenant on sufferance without landlord's consent.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "The appellant was not entitled to notice in the Collector inquiry under section 88B(2).",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Manekji Edulji Mistry Ors. v. Manekshe Ardeshir Irani Anr.",
      "citation": "1972 1 C.R. 334",
      "treatment": "referred",
      "relevance": "Prior judgment in related proceedings where this Court affirmed High Court findings and set aside judgment"
    }
  ],
  "statutes_cited": [
    {
      "name": "Bombay Tenancy and Agricultural Lands Act, 1948",
      "sections": [
        "Section 4B",
        "Section 88B",
        "Section 4A"
      ],
      "relevance": "Protection of tenancy, withdrawal of protected status for Trusts, recognition of protected tenants"
    },
    {
      "name": "Bombay Tenancy Act, 1939",
      "sections": [
        "Section 23(1)(b)",
        "Section 3",
        "Section 3A",
        "Section 4"
      ],
      "relevance": "Deeming lease periods longer, protected tenants provisions continued/modified by 1948 Act"
    },
    {
      "name": "Amending Act, 1952",
      "sections": [
        "Section 5"
      ],
      "relevance": "Gave certain relief to tenants other than protected tenants; appellant not entitled"
    },
    {
      "name": "Bombay Public Trusts Act, 1950",
      "sections": [],
      "relevance": "Registration requirement for Trust under section 88B proviso"
    },
    {
      "name": "Bombay Land Revenue Code",
      "sections": [
        "Section 84"
      ],
      "relevance": "Mentioned but no opinion expressed on applicability for notice to quit"
    },
    {
      "name": "Transfer of Property Act",
      "sections": [
        "Section 106"
      ],
      "relevance": "Mentioned but no opinion expressed on applicability for notice to quit"
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal is dismissed. The appellant is not entitled to protection under section 4B as a tenant holding over; instead, the appellant is a tenant on sufferance without consent, hence a trespasser. No notice required in Collector inquiry under section 88B(2). Issues on damages remain unheard.",
    "relief_granted": "None to appellant",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "If a lessee remains in possession after determination of the term, he is under the common law a tenant on sufferance.",
      "speaker": "court",
      "significance": "Defines tenant on sufferance vs holding over"
    },
    {
      "text": "Tenancy is a matter of privity of parties. If there is no consent, the appellant is a trespasser.",
      "speaker": "court",
      "significance": "Explains why section 4B has no application"
    },
    {
      "text": "Section 4B states that no tenancy of any land shall be terminated merely on the ground that the period fixed by agreement or usage for its duration has expired.",
      "speaker": "court",
      "significance": "Core provision at issue"
    }
  ],
  "_case_id": "1974_285",
  "_label": 0,
  "_text_length": 8478,
  "_extracted_at": "2026-02-10T20:06:23.180733"
}