{
  "metadata": {
    "case_name": "Appellant (Wholesale Dealer Firm) v. State",
    "case_year": 1970,
    "court": "Supreme Court of India",
    "judges": [
      "KRISHNA IYER, J."
    ],
    "case_number": "Criminal Appeal No. 177 of 1970",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Petitioners have a wholesale dealers licence to stock drugs at Bombay.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Petitioners have a further licence to distribute the drugs through the motor van throughout the territory of the state of Maharashtra.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Motor van started filled with drugs and reached the Vidarbha area.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Petitioners booked certain drugs for which they have already a licence to distribute, by lorry to Yeotmal.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Motor van was delayed by about three days.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "One of the partners of the petitioner-firm who was moving with the van, went ahead of Yeotmal, released the goods from the transport operator and temporarily kept them in the godown of a local drugs dealer.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Intention was to load the van with those drugs and distribute the drugs as permitted by the licence.",
      "type": "admitted",
      "date": null,
      "source": "appellant"
    },
    {
      "id": "f8",
      "text": "Accused persons had no licence for the premises at Yeotmal for stocking the drugs.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Appellant has licences in Form 20B and 21B for Bombay shop, one for drugs in Schedules C and C(1) and the other for other drugs.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Firm has one more licence in Form 21B authorising sale, stock, exhibit for sale or distribute by wholesale on the premises situated at through Station Wagon No. 1279 in Maharashtra for Schedule C and C(1) drugs not requiring cold storage, valid for two years.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Licence Ex. 39 for the accused's vehicle permitting stocking and selling in the specified vehicle.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Medicines were kept not for sale in those premises at Yeotmal but meant for sale eventually to rural retailers elsewhere.",
      "type": "admitted",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether a temporary deposit of drugs or temporary retention of drugs in a place outside Bombay for which place the petitioners have no licence to stock the goods, amounts to stocking for sale or distribution as contemplated by clause (c) of section 18 of the Drugs and Cosmetics Act, 1940.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the licence Ex. 39 for the vehicle covers the brief interval of storage between taking delivery from the transport and loading into the mobile van.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether storage even for short spells and on ad hoc basis without intent to sell at that place but as part of the sales business, comes within the scope of storage for sale in Sec. 18(c) and Rule 62.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Temporary deposit of the goods in the godown does not amount to stocking for sale; intention was to load into van and distribute.",
      "supporting_facts": [
        "f6",
        "f7"
      ],
      "legal_basis": "Sec. 18(c)"
    },
    {
      "id": "pa2",
      "text": "Licences should not be insisted on for every place of make-shift storage in a far-flung area served by a wholesaler.",
      "supporting_facts": [
        "f2",
        "f10",
        "f11"
      ],
      "legal_basis": "Rule 62 proviso; practical difficulties"
    },
    {
      "id": "pa3",
      "text": "Ex. 39 licence for vehicle covers brief storage.",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": "Rule 61"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Temporary deposit of the goods in the godown of a local drugs dealer amounts to stocking for sale as contemplated by clause (c) of section 18.",
      "supporting_facts": [
        "f6",
        "f8"
      ],
      "legal_basis": "Sec. 18(c); Rule 62; Sec. 27(b)"
    },
    {
      "id": "ra2",
      "text": "Statutory forms are samples for guidance, not exhaustive; no inflexible formula.",
      "supporting_facts": [],
      "legal_basis": "Rule 61; Sec. 18"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Licence in terms for a vehicle cannot do duty for one to keep drugs in a fixed place; Act mandates licence for every place where drugs are stocked for sale.",
      "addresses_issue": "i2",
      "key_observation": "If the law asks for a licence for a place and you do not have it and still keep the articles there you are asking for criminal trouble, whether it is a stopgap stocking or not."
    },
    {
      "id": "cr2",
      "text": "Using Heydon's case and mischief rule, storage even temporary and for eventual sale elsewhere constitutes 'stocked for sale' to suppress mischief of unlicensed storage leading to spurious drugs.",
      "addresses_issue": "i1",
      "key_observation": "Every place where storage for sale is made must be licensed to ensure vigilant medical watch over drugs."
    },
    {
      "id": "cr3",
      "text": "Uphold implied authority to grant suitable licences under R.61 and 62 even if not strictly in prescribed forms, extending to way side depots, but licences must be there for every storage for sale.",
      "addresses_issue": "i3",
      "key_observation": "To loosen the law is to play with life and therefore anti-humanist."
    },
    {
      "id": "cr4",
      "text": "Law has deficiencies in forms for mobile vans and transit storage; highlighted for legislative attention.",
      "addresses_issue": "i3",
      "key_observation": "Social guilt attaches to legal lacunae."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Temporary storage of drugs in unlicensed premises, even for short period and intended for distribution elsewhere, amounts to stocking for sale under Sec. 18(c) and breach of Rule 62, punishable under Sec. 27(b).",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Vehicle licence does not cover storage in a fixed place like a godown.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Licences required for every place of storage for sale, including improvised ones for mobile distribution.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Heydon's case",
      "citation": null,
      "treatment": "followed",
      "relevance": "Rule for statutory interpretation: suppress mischief and advance remedy."
    }
  ],
  "statutes_cited": [
    {
      "name": "Drugs and Cosmetics Act, 1940",
      "sections": [
        "Sec. 18(c)",
        "Sec. 27(b)"
      ],
      "relevance": "Prohibits stocking drugs for sale without licence; penal provision for contravention."
    },
    {
      "name": "Drugs Rules, 1945",
      "sections": [
        "Rule 61",
        "Rule 62",
        "Rule 62A",
        "Rule 2(b)"
      ],
      "relevance": "Forms of licences; separate licences for each place except itinerant vendors; applied to require licence for storage places."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court agrees with Bombay High Court, holds temporary storage in unlicensed godown at Yeotmal amounts to stocking for sale under Sec. 18(c), breach of Rule 62 and offence under Sec. 27(b); upholds conviction and sentence as light but sufficient.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "Every legislation is a social document and judicial construction seeks to decipher the statutory mission, language permitting, taking the cue from the rule in Heydon's case of suppressing the evil and advancing the remedy.",
      "speaker": "court",
      "significance": "Sets tone for purposive interpretation of the Act."
    },
    {
      "text": "If godowns, temporary stores and depots can remain unlicensed, they escape official attention and can deteriorate into foci of dubious or deceptive drugs harmful to society.",
      "speaker": "court",
      "significance": "Explains purpose of licensing to protect public health."
    },
    {
      "text": "To loosen the law in its joints is to play with life and therefore anti-humanist.",
      "speaker": "court",
      "significance": "Justifies strict interpretation against appellant."
    }
  ],
  "_case_id": "1974_33",
  "_label": 0,
  "_text_length": 16677,
  "_extracted_at": "2026-02-10T20:03:12.612031"
}