{
  "metadata": {
    "case_name": "State of Mysore v. Karibasappa",
    "case_year": 1973,
    "court": "Supreme Court of India",
    "judges": [
      "RAY, C.J."
    ],
    "case_number": "Civil Appeal No. 971 of 1973",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Respondent Karibasappa was the President of the Bellary District Co-operative Central Bank Limited, Hospet.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Karibasappa challenged two notifications dated 11 August 1972 issued by the State Government in exercise of powers conferred by sections 54 and 121 of the Mysore Co-operative Societies Act, 1959.",
      "type": "procedural",
      "date": "1972-08-11",
      "source": "respondent"
    },
    {
      "id": "f3",
      "text": "Management and administration of the Bank conducted by Committee consisting of the President, the Vice-President, and ten elected members from various constituencies and certain nominees of the State Government.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "At sometime the Government nominated more than three persons as its representatives.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Bank had a share capital of Rs. 75 lakhs. State Government contributed Rs. 23.8 lakhs.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Reserve Bank of India advanced a loan of Rs. 135 lakhs, guaranteed by the State Government. Apex Bank gave a loan of Rs. 200 lakhs.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Reserve Bank of India inspection on 14 October 1971 referred to many irregularities and stated that financial resources of the Bank had improved slightly.",
      "type": "material",
      "date": "1971-10-14",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Joint Registrar on 3 August 1972 forwarded the RBI report to the Registrar of Co-operative Societies and suggested action under section 54 of the Act.",
      "type": "procedural",
      "date": "1972-08-03",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Notifications recited that State had given Rs. 23.80 lakhs to the Bank and it was necessary in public interest to take powers to exercise control over the conduct of the business of the Bank to safeguard public funds.",
      "type": "material",
      "date": "1972-08-11",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Under first notification, State Government to nominate fifteen persons on the Board of Management, appoint one as President, one as Vice-President, one as Managing Director, exercising powers subject to supervision, direction and control of State Government.",
      "type": "procedural",
      "date": "1972-08-11",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Notification modified section 29 to allow nomination of 15 persons, one as Managing Director with powers to conduct business subject to policy of Board.",
      "type": "procedural",
      "date": "1972-08-11",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Second notification nominated fifteen persons to form the Board of Directors; Deputy Commissioner Bellary appointed President.",
      "type": "procedural",
      "date": "1972-08-11",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Bank challenged notifications on grounds: (1) ultra vires the Act; (2) violation of principles of natural justice; (3) political rivalry to remove President.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f14",
      "text": "High Court upheld first two contentions and set aside the notifications.",
      "type": "procedural",
      "date": "1973-06-01",
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the State Government's notifications under sections 54 and 121 were ultra vires the Act, particularly as they effectively superseded the entire Committee of Management without using section 30.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the notifications violated principles of natural justice by depriving the Committee of opportunity to be heard.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Notifications issued in public interest under section 54 to exercise control over conduct of business to safeguard State interests, given State aid of Rs. 23.80 lakhs.",
      "supporting_facts": [
        "f5",
        "f9"
      ],
      "legal_basis": "Sections 54 and 121 of Mysore Co-operative Societies Act, 1959"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Action of Government ultra vires the Act.",
      "supporting_facts": [
        "f2",
        "f10",
        "f11",
        "f12"
      ],
      "legal_basis": "Sections 29, 30, 54 of the Act"
    },
    {
      "id": "ra2",
      "text": "Action bad in violation of principles of natural justice.",
      "supporting_facts": [
        "f13"
      ],
      "legal_basis": "Section 30 of the Act"
    },
    {
      "id": "ra3",
      "text": "Action taken because of political rivalry with evil eye to remove the President.",
      "supporting_facts": [
        "f13"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Impeached orders suffer from two infirmities: (1) entire Committee of Management superseded indirectly, though section 54 does not confer power to remove President and Vice-President or displace Committee; section 30 provides for supersession after notice; State achieved indirectly what prohibited directly under section 54. Control under section 54 means check, restraint or influence to regulate, not displace.",
      "addresses_issue": "i1",
      "key_observation": "In guise of exercising control, State displaced Committee and substituted its own."
    },
    {
      "id": "cr2",
      "text": "Second infirmity: violation of principles of natural justice; section 30 contemplates notice for supersession, but Committee deprived of rights arbitrarily without notice.",
      "addresses_issue": "i2",
      "key_observation": "Committee deprived of right to manage affairs in defiance of statutory powers."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Section 54 does not permit supersession of Committee or removal of President/Vice-President; such action must use section 30 with notice.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Notifications violate natural justice as no opportunity given to Committee.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Mysore Co-operative Societies Act, 1959",
      "sections": [
        "Section 2(g)",
        "Section 29",
        "Section 30",
        "Section 54",
        "Section 121"
      ],
      "relevance": "Section 54 allows control over business in public interest to safeguard State aid but not supersession; section 30 for supersession with notice; section 121 for exemptions/modifications; section 29 limits nominees."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal against High Court judgment setting aside notifications dismissed; High Court rightly held notifications ultra vires and violative of natural justice.",
    "relief_granted": "Notifications set aside (upholding High Court)",
    "costs": "State will pay costs to the respondents."
  },
  "key_quotes": [
    {
      "text": "The impeached orders suffer from two insurmountable infirmities. One is that the entire committee of Management has been superseded.",
      "speaker": "court",
      "significance": "Identifies first key flaw: indirect supersession under wrong provision."
    },
    {
      "text": "Control is intended to regulate and hold in check and restrain from action. In the guise exercising control the State has displaced the committee of Management and substituted its own Committee.",
      "speaker": "court",
      "significance": "Defines 'control' under section 54, rejecting displacement."
    },
    {
      "text": "The second vice of the notification is that it is in violation of principles of natural justice.",
      "speaker": "court",
      "significance": "Second key flaw: no notice as required analogously under section 30."
    }
  ],
  "_case_id": "1974_211",
  "_label": 0,
  "_text_length": 8363,
  "_extracted_at": "2026-02-10T20:05:28.458793"
}