{
  "metadata": {
    "case_name": "Accused-Appellant v. State (Respondent)",
    "case_year": 1974,
    "court": "Supreme Court of India",
    "judges": [
      "GOSWAMI, J."
    ],
    "case_number": "Criminal Appeal No. 49 of 1974",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The accused has a shop at Kishan Ganj, Delhi.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On 1st February, 1972, the accused sold a packet of playing cards portraying on the reverse luridly obscene naked pictures of men and women in pornographic sexual postures to P.W. 1.",
      "type": "material",
      "date": "1972-02-01",
      "source": "prosecution"
    },
    {
      "id": "f3",
      "text": "This sale was arranged by the police Sub-Inspector P.W. 4 on receipt of secret information about the accused uttering these obscene pictures.",
      "type": "procedural",
      "date": "1972-02-01",
      "source": "prosecution"
    },
    {
      "id": "f4",
      "text": "On getting a signal from the purchaser a raid was made in the accused's shop when two more packets of such obscene cards were also recovered in addition to the packet already sold to P.W. 1.",
      "type": "material",
      "date": "1972-02-01",
      "source": "prosecution"
    },
    {
      "id": "f5",
      "text": "The ten-rupee note, which was the price of the said set of playing cards and which had been earlier given by the Sub-Inspector to P.W. 1, was also recovered from the person of the accused.",
      "type": "material",
      "date": "1972-02-01",
      "source": "prosecution"
    },
    {
      "id": "f6",
      "text": "At the trial the accused was convicted under section 292, Indian Penal Code and sentenced to six months rigorous imprisonment and to a fine of Rs. 500/-, in default further rigorous imprisonment for three months.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "The High Court affirmed the conviction as well as the sentence.",
      "type": "procedural",
      "date": "1973-10-01",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Obscenity of the playing cards recovered from the accused is not challenged and for the matter of that the conviction under section 292, I.P.C.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "The accused is married and is said to be 36 years of age.",
      "type": "background",
      "date": null,
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the sentence imposed is very severe given that only one single sale has been established and only three packets of cards were recovered.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether the accused is entitled to be released on probation under section 4 of the Probation of Offenders Act, 1958.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The sentence is very severe on the ground that only one single sale has been established in this case and also only three packets of cards were recovered from the accused.",
      "supporting_facts": [
        "f2",
        "f4"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "The accused is entitled to be released on probation under section 4 of the Probation of Offenders Act, 1958.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": "Section 4, Probation of Offenders Act, 1958"
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Section 292 IPC defines obscenity and sub-section 2 provides punishment: on first conviction with imprisonment up to two years and fine up to two thousand rupees.",
      "addresses_issue": "i1",
      "key_observation": "The section was amended by Act XXXVI of 1969 enlarging exceptions and enhancing penalty, introducing dichotomy for first and subsequent offenders."
    },
    {
      "id": "cr2",
      "text": "The intention of the legislature is made clear by the amendment in 1969 in dealing with this type of offences which corrupt the minds of people to whom these objectionable things can easily reach, particularly the younger generation.",
      "addresses_issue": "i1",
      "key_observation": "Not prepared to accept the submission to deal with the accused leniently."
    },
    {
      "id": "cr3",
      "text": "Section 4(1) of Probation of Offenders Act applies when any person is found guilty of an offence not punishable with death or imprisonment for life and court opines it expedient to release on probation.",
      "addresses_issue": "i2",
      "key_observation": "Having regard to the circumstances of the case and the nature of the offence and the potential danger of the accused's activity in this nefarious trade affecting the morals of society particularly of the young, not prepared to release him under section 4."
    },
    {
      "id": "cr4",
      "text": "These offences of corrupting the internal fabric of the mind have got to be treated on the same footing as the cases of food adulterators and not prepared to show any leniency.",
      "addresses_issue": "i1",
      "key_observation": "Appeal is rejected."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "No leniency in sentence for offence under section 292 IPC post-1969 amendment due to legislative intent to protect society, especially youth, from corrupting influence.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Accused not entitled to release on probation under section 4 of Probation of Offenders Act given nature of offence and potential danger to society's morals.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "292"
      ],
      "relevance": "Defines obscenity and penalizes sale/possession of obscene objects; amended in 1969 to enhance penalties for first and subsequent convictions."
    },
    {
      "name": "Probation of Offenders Act, 1958",
      "sections": [
        "4"
      ],
      "relevance": "Power of court to release certain offenders on probation of good conduct; court declined to apply due to nature of offence."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal by special leave limited to the question of sentence in conviction under section 292 IPC is rejected. The conviction and sentence affirmed by Delhi High Court on 1st October 1973 stand.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The intention of the legislature is, therefore, made clear by the amendment in 1969 in dealing with this type of offences which corrupt the minds of people...",
      "speaker": "court",
      "significance": "Explains rationale for not reducing sentence."
    },
    {
      "text": "These offences of corrupting the internal fabric of the mind have got to be treated on the same footing as the cases of food adulterators and we are not prepared to show any leniency.",
      "speaker": "court",
      "significance": "Justifies rejection of leniency and probation."
    }
  ],
  "_case_id": "1974_106",
  "_label": 0,
  "_text_length": 6491,
  "_extracted_at": "2026-02-10T20:04:05.917294"
}