{
  "metadata": {
    "case_name": "Union of India v. Respondents (Contractors)",
    "case_year": 1973,
    "court": "Supreme Court of India",
    "judges": [
      "BHAGWATI, J."
    ],
    "case_number": "Civil Appeal Nos. 1224, 1225 and 1330 of 1973",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The respondent tendered for supply of certain quantity of foam compound to the appellant and its tender was accepted by the appellant by acceptance of Tender dated 16th July, 1968. The Acceptance of Tender was subject to the General Conditions of Contract contained in the Standard Form of Contract No. D.G.S.&D. 68.",
      "type": "background",
      "date": "1968-07-16",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The performance of this contract ran into difficulties and a dispute arose between the parties giving rise to claims by either party against the other.",
      "type": "disputed",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The respondent contended that the appellant had committed a breach of the contract and was, therefore, liable to pay to the respondent a sum of Rs. 2,35,800/- by way of damages suffered by the respondent by reason of the breach of the contract.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f4",
      "text": "The appellant said that it was the respondent who had committed the breach of the contract and was liable to pay to the appellant by way of damages a sum of Rs. 2,28,900/- under clause 14 of the General Conditions of Contract.",
      "type": "disputed",
      "date": null,
      "source": "appellant"
    },
    {
      "id": "f5",
      "text": "The Assistant Director of Supplies by his letter dated 30th March, 1971 called upon the respondent to make payment of the amount of Rs. 2,28,900/- and intimated that if the respondent failed to do so on or before 30th April, 1971, the Pay and Accounts Officer, New Delhi/Madras would be authorised to recover the same from the pending bills of the respondent in respect of other contracts.",
      "type": "procedural",
      "date": "1971-03-30",
      "source": "appellant"
    },
    {
      "id": "f6",
      "text": "The respondent filed an application in the Delhi High Court under s. 20 of the Indian Arbitration Act for filing the Arbitration Agreement contained in cl. 24.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f7",
      "text": "Delhi High Court by an order dated 5th May, 1972 allowed the application under s. 20 and ordered the arbitration agreement contained in cl. 24 to be filed and made an order of reference to arbitration.",
      "type": "procedural",
      "date": "1972-05-05",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "During the pendency of the arbitration some amounts became due and payable by the appellant to the respondent in respect of other contracts entered into between the parties.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "The respondent made interim Application No. 119 of 1972 to the Delhi High Court on 17th January, 1972 under s. 41 read with the Second Schedule to the Indian Arbitration Act, 1940 praying that the status quo should be maintained and the appellant should be restrained from recovering its claim for damages from the amounts due and payable by the appellant to the respondent in respect of the pending bills.",
      "type": "procedural",
      "date": "1972-01-17",
      "source": "respondent"
    },
    {
      "id": "f10",
      "text": "The respondent filed another Interim Application No. 846 of 1972 as an independent application under s. 41 read with the Second Schedule on 16th May, 1972 praying for the same interim relief.",
      "type": "procedural",
      "date": "1972-05-16",
      "source": "respondent"
    },
    {
      "id": "f11",
      "text": "Delhi High Court by an order dated 15th November, 1972 allowed both the interim applications and issued an interim injunction restraining the appellant from effecting recovery of the amounts claimed to be due from the other pending bills of the respondent.",
      "type": "procedural",
      "date": "1972-11-15",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "The appellant preferred Civil Appeals Nos. 1224 and 1225 of 1973 and Civil Appeal No. 1330 of 1973 against the orders of the Delhi High Court.",
      "type": "procedural",
      "date": null,
      "source": "appellant"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether clause 18 of the General Conditions of Contract contained in the Standard Form of Contract No. D.G.S.&D. 68 entitles the purchaser to recover a claim for damages (disputed and pending arbitration) by appropriating sums due to the contractor under other contracts.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the Delhi High Court had jurisdiction under s. 41 read with the Second Schedule to the Indian Arbitration Act to grant interim injunction restraining the appellant from such recovery.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The impugned order amounted in effect and substance to an order directing the appellant to pay the amounts of the pending bills of the respondent in respect of the other contracts and since the question of payment of the amounts of such pending bills did not form the subject matter of the reference which was pending before the arbitrator, the learned Judge had no jurisdiction under s. 41 read with the Second Schedule to make such an order.",
      "supporting_facts": [
        "f8",
        "f11"
      ],
      "legal_basis": "Section 41 read with Second Schedule, Indian Arbitration Act, 1940"
    },
    {
      "id": "pa2",
      "text": "Clause 18 comes into play when there is a claim for payment of a sum of money arising out of or under the contract. It is not necessary that the sum of money must be due and payable to the purchaser. It is enough if there is a claim even for damages. The purchaser is entitled to recover it by appropriating any sum then due or which at any time thereafter may become due to the contractor under the contract or any other contract.",
      "supporting_facts": [
        "f1",
        "f4",
        "f5",
        "f8"
      ],
      "legal_basis": "Clause 18, General Conditions of Contract"
    },
    {
      "id": "pa3",
      "text": "No interim injunction could be granted to prevent the exercise of such right under cl. 18 merely because the claim for damages is pending adjudication. Otherwise cl. 18 would become meaningless.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "Clause 18, General Conditions of Contract"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Clause 18 does not authorise the appellant to appropriate the amounts of any pending bills of the respondent towards satisfaction of its claim for damages against the respondent, unless such claim for damages was either admitted by the respondent or adjudicated upon by arbitration or suit in civil court.",
      "supporting_facts": [
        "f4",
        "f7"
      ],
      "legal_basis": "Clause 18, General Conditions of Contract"
    },
    {
      "id": "ra2",
      "text": "The words 'any claim for the payment of a sum of money' in cl. 18 refer only to a claim for a sum due and payable and do not take in a claim for damages which is disputed by the contractor. A claim for damages is not a debt until adjudicated.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": "Clause 18, General Conditions of Contract; Section 74, Indian Contract Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The order of interim injunction is in substance a negative injunction restraining the appellant from recovering suo moto the damages claimed by it from out of other amounts due to the respondent. It does not direct payment and is within the power of the Court under s. 41(b) because the claim for damages forms the subject matter of the arbitration proceedings.",
      "addresses_issue": "i2",
      "key_observation": "The interim order is for the purpose of and in relation to arbitration proceedings."
    },
    {
      "id": "cr2",
      "text": "The heading 'Recovery of Sums Due' and the language of cl. 18 indicate it deals with recovery of sums presently due and payable. A claim for damages, even liquidated under cl. 14, does not give rise to a debt until liability is adjudicated and damages assessed.",
      "addresses_issue": "i1",
      "key_observation": "A sum due means a sum for which there is an existing obligation to pay in praesenti."
    },
    {
      "id": "cr3",
      "text": "Under Indian law, a claim for unliquidated or liquidated damages does not become a debt until adjudicated. The only right upon breach is to sue for damages, not an existing pecuniary obligation.",
      "addresses_issue": "i1",
      "key_observation": "No pecuniary liability arises till the Court has determined that the party complaining of the breach is entitled to damages."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Clause 18 applies only where the purchaser has a claim for a sum presently due and payable by the contractor. A claim for damages for breach of contract is not such a claim until adjudicated.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "The Delhi High Court had jurisdiction under s. 41 read with Second Schedule to grant interim injunction restraining appropriation under cl. 18 pending arbitration.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Webb v. Stenton",
      "citation": "1883 11 Q.B.D. 518",
      "treatment": "followed",
      "relevance": "Classical definition of debt: a sum of money which is now payable or will become payable in the future by reason of a present obligation."
    },
    {
      "case_name": "People v. Arguello",
      "citation": "1869 37 Calif. 524",
      "treatment": "followed",
      "relevance": "Distinction between debt owing and debt due; approved in Kesoram Industries."
    },
    {
      "case_name": "Kesoram Industries v. Commissioner of Wealth Tax",
      "citation": "1966 2 S.C.R. 688",
      "treatment": "followed",
      "relevance": "Approved passage on characteristics of debt."
    },
    {
      "case_name": "Jones v. Thompson",
      "citation": "1858 27 L. J. Q.B. 234",
      "treatment": "referred",
      "relevance": "Claim for unliquidated damages does not become a debt even after verdict till judgment."
    },
    {
      "case_name": "O Driscoll v. Manchester Insurance Committee",
      "citation": "1915 3 K.B. 499",
      "treatment": "referred",
      "relevance": "No debt until verdict assessing damages and judgment given."
    },
    {
      "case_name": "Jabed Sheikh v. Taher Mallik",
      "citation": "45 Cal. Weekly Notes 519",
      "treatment": "referred",
      "relevance": "Indian High Court view on damages not being debt till adjudication."
    },
    {
      "case_name": "S. Malkha Singh v. M/s N. K. Gopala Krishna Mudaliar",
      "citation": "1956 A.I.R. Pun. 174",
      "treatment": "referred",
      "relevance": "Damages claim not a debt till assessed."
    },
    {
      "case_name": "Iron Hardware (India) Co. v. Firm Shamlal Bros.",
      "citation": "1954 A.I.R. Bom. 423",
      "treatment": "followed",
      "relevance": "No pecuniary liability till court determines liability and assesses damages."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Arbitration Act, 1940",
      "sections": [
        "Section 20",
        "Section 41",
        "Second Schedule"
      ],
      "relevance": "Filing arbitration agreement, order of reference, power to grant interim injunction in relation to arbitration proceedings."
    },
    {
      "name": "Indian Contract Act, 1872",
      "sections": [
        "Section 74"
      ],
      "relevance": "No qualitative difference between liquidated and unliquidated damages; only reasonable compensation recoverable."
    },
    {
      "name": "Transfer of Property Act, 1882",
      "sections": [
        "Section 6(e)"
      ],
      "relevance": "Mere right to sue for damages is not an actionable claim and cannot be transferred."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court upheld the Delhi High Court's orders granting interim injunctions restraining the appellant from recovering its claim for damages from pending bills of the respondent under other contracts, holding that cl. 18 does not permit appropriation of disputed damages claims pending arbitration.",
    "relief_granted": "Interim injunction upheld",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"a debt is a sum of money which is now payable or will become payable in the future by reason of a present obligation. There must be debitum in praesenti solvendum maybe in praesenti or in future.\"",
      "speaker": "court",
      "significance": "Defines 'sum due' under cl. 18, excluding unadjudicated damages."
    },
    {
      "text": "\"In my opinion it would not be true to say that a person who commits a breach of the contract incurs any pecuniary liability, nor would it be true to say that the other party to the contract who complains of the breach has any amount due to him from the other party.\"",
      "speaker": "court",
      "significance": "Chagla CJ's view adopted: no debt till court adjudication of damages."
    },
    {
      "text": "The heading of cl. 18 clearly suggests that this clause is intended to deal with the subject of recovery of sum due.",
      "speaker": "court",
      "significance": "Interprets scope of cl. 18 to sums presently payable."
    }
  ],
  "_case_id": "1974_70",
  "_label": 0,
  "_text_length": 36741,
  "_extracted_at": "2026-02-10T20:03:21.791725"
}