{
  "metadata": {
    "case_name": "Messrs Narayanaswami Sons v. Employees State Insurance Corporation",
    "case_year": 1967,
    "court": "Supreme Court of India",
    "judges": [
      "Goswami J."
    ],
    "case_number": "Civil Appeal No. 1626 of 1967",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant and his brother Srinivasamurthy are partners of a firm Messrs Narayanaswami Sons carrying on business of manufacturing and exporting polished granite memorial stones.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The firm is a factory under the Factories Act and Employees State Insurance Act.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Appellant directly employs about 35 persons and pays contribution under the Act on their account.",
      "type": "admitted",
      "date": null,
      "source": "appellant"
    },
    {
      "id": "f4",
      "text": "Adjacent to appellant's factory, on his land leased to Chidambarchari and Shankarsubbachari (contractors), there is another factory employing about 50 workers for cutting and dressing granite stones.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Lorry drivers bring granite from surrounding areas and unload outside the factory; contractors get them to their leased portion for cutting; after cutting, sent to appellant's factory for designing, polishing and export.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Contractors' factory registered under Factories Act in 1963.",
      "type": "procedural",
      "date": "1963",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Employees State Insurance Corporation applied to ESI Court at Bangalore for recovery of Rs. 8893/- as contribution payable by appellant for period 27-7-1958 to 31-1-1964 on account of workers employed by contractors.",
      "type": "procedural",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f8",
      "text": "ESI Court held contractors not immediate employers under s.2(13), independent contractors, appellant not principal employer for their employees.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Corporation appealed to High Court of Mysore under s.82(2); High Court held appellant principal employer, contractors immediate employers, workers employees under s.2(9)(ii), accepted appeal.",
      "type": "procedural",
      "date": "1966-10-14",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "ESI Court findings: Contractors work at place belonging to respondent (appellant), execute part of work necessary for final product; doing foundation work for respondent's final work.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "High Court found evidence shows employees under contractors employed in connection with work of respondent-factory.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Site plan Ext. P-1 shows Portion A (appellant's factory) and Portion B (contractors'), separated by wall with door sometimes closed; environmental and functional unity.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Evidence of PW-1: Raw stones moved to premises B, 50 persons employed by contractors cutting/dressing; power used; after, to A for designing/polishing, final touches in B, back to A for packing/despatch; premises A and B belong to partners.",
      "type": "material",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f14",
      "text": "RW-2 (contractor): Undertaking work for appellant since last three years.",
      "type": "material",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f15",
      "text": "RW-1 (appellant partner): By factory premises meant both A and B.",
      "type": "material",
      "date": null,
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the contractors are immediate employers within the meaning of section 2(13) of the Employees State Insurance Act.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the workers employed by the contractors are employees within the meaning of section 2(9)(ii) of the Act.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether the appellant is the principal employer liable to pay contributions in respect of the contractors' workers.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Contractors owned a separate factory, are independent contractors, cannot be held immediate employers under s.2(13); appellant not liable as principal employer for their employees.",
      "supporting_facts": [
        "f4",
        "f6"
      ],
      "legal_basis": "Section 2(13) ESI Act"
    },
    {
      "id": "pa2",
      "text": "Requires unity of control by principal employer over contractors' manufacturing process.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Appellant is principal employer; contractors immediate employers; their workers employees under the Act.",
      "supporting_facts": [
        "f4",
        "f5",
        "f11"
      ],
      "legal_basis": "Sections 2(9)(ii), 2(13), 2(17) ESI Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Act is beneficial social security legislation; provisions construed to promote scheme; principal employer liable even if work done through immediate employer.",
      "addresses_issue": "i3",
      "key_observation": "Underlying aim to insure employees; charge on principal employer."
    },
    {
      "id": "cr2",
      "text": "Work by contractors preliminary/incidental to principal employer's factory work; intimate connection, integrated whole; on premises including precincts.",
      "addresses_issue": "i1",
      "key_observation": "Contractors' factory on leased land adjoining, within precincts."
    },
    {
      "id": "cr3",
      "text": "Workers employed through immediate employers on premises for work ordinarily part of, preliminary to, or incidental to factory.",
      "addresses_issue": "i2",
      "key_observation": "Satisfies s.2(9)(ii)."
    },
    {
      "id": "cr4",
      "text": "'Premises' includes precincts/environs; generic term for land/buildings; functional/environmental unity between portions A and B.",
      "addresses_issue": "i1",
      "key_observation": "Site plan and evidence show unity despite wall."
    },
    {
      "id": "cr5",
      "text": "Separate registration under Factories Act does not militate; predominant purpose is part of principal employer's work.",
      "addresses_issue": "i1",
      "key_observation": "No evidence contractors pay contribution as principal employers."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Contractors are immediate employers under s.2(13); their workers employees under s.2(9)(ii); appellant as principal employer liable for contributions.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Work undertaken on premises of factory; entire site composite including A and B.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Appeal fails.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Ardeshir H. Bhiwandiwala v. State of Bombay",
      "citation": "1961 3 S.C.R. 592",
      "treatment": "followed",
      "relevance": "'Premises' in factory definition includes land/buildings/precincts."
    },
    {
      "case_name": "Nagpur Electric Light Power Co. Ltd. v. Regional Director Employees State Corporation",
      "citation": "1967 3 S.C.R. 92",
      "treatment": "referred",
      "relevance": "Distinguished Bombay HC case on pre-1966 employee definition."
    },
    {
      "case_name": "Employees State Insurance Corporation v. Raman Chittur Harihar Iyer",
      "citation": "1957 I L.L.J. 267 (Bombay HC)",
      "treatment": "distinguished",
      "relevance": "Dealt with pre-1966 employee definition; not applicable."
    },
    {
      "case_name": "Employees State Insurance Corporation v. Peter Sewing Machine Co.",
      "citation": "AIR 1970 Delhi 182 (Delhi HC)",
      "treatment": "distinguished",
      "relevance": "Contractors manufactured independently; different facts."
    },
    {
      "case_name": "Hindustan Construction Co. Ltd. v. Employees State Insurance Corporation",
      "citation": "1966 I.L.R. 18 Assam Nagaland 87",
      "treatment": "distinguished",
      "relevance": "Remand for manufacturing process; overlooked full s.2(9) definition."
    }
  ],
  "statutes_cited": [
    {
      "name": "Employees State Insurance Act",
      "sections": [
        "2(4)",
        "2(9)",
        "2(12)",
        "2(13)",
        "2(14)",
        "2(17)",
        "38",
        "39",
        "40",
        "42",
        "44",
        "68",
        "72",
        "73A",
        "74",
        "75",
        "82",
        "94"
      ],
      "relevance": "Definitions of contribution, employee, factory, immediate employer, principal employer; liability to pay contributions; adjudication and appeals."
    },
    {
      "name": "Factories Act, 1948",
      "sections": [
        "Manager named under"
      ],
      "relevance": "Factory definition and registration; principal employer includes named manager."
    },
    {
      "name": "Mines Act, 1952",
      "sections": [],
      "relevance": "Exclusion from factory definition."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court dismissed the appeal by special leave against the High Court of Mysore's judgment, upholding that the appellant is the principal employer liable for ESI contributions on workers employed by the contractors, who are immediate employers.",
    "relief_granted": null,
    "costs": "Dismissed with costs."
  },
  "key_quotes": [
    {
      "text": "The Act is thus a beneficial piece of social security legislation in the interest of labour in factories at the first instance and with power to extend to other establishments. Provisions of the Act will have to be construed with that end in view to promote the schemes and avoid the mischief.",
      "speaker": "court",
      "significance": "Explains interpretative approach to the Act."
    },
    {
      "text": "We agree with the High Court that on the findings of fact the work undertaken by the contractors in the adjoining vicinity... is preliminary or incidental to the work in the principal employer-factory turning out the finished product for export.",
      "speaker": "court",
      "significance": "Key finding on nature of contractors' work."
    },
    {
      "text": "The premises include under section 2(13) the precincts thereof. The word precincts means the environs.",
      "speaker": "court",
      "significance": "Interpretation of 'premises' crucial to holding."
    },
    {
      "text": "In the result, the appeal fails and is dismissed with costs.",
      "speaker": "court",
      "significance": "Final disposition."
    }
  ],
  "_case_id": "1974_13",
  "_label": 0,
  "_text_length": 23417,
  "_extracted_at": "2026-02-10T20:03:16.456687"
}