{
  "metadata": {
    "case_name": "State of Punjab v. Hari Singh & Gian Singh",
    "case_year": 1970,
    "court": "Supreme Court of India",
    "judges": [
      "BEG, J."
    ],
    "case_number": "Criminal Appeal No. 213 of 1970",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The occurrence took place during the night between 18th and 19th June, 1969, in village Dhandri Kalan, District Ludhiana.",
      "type": "material",
      "date": "1969-06-18/19",
      "source": "prosecution"
    },
    {
      "id": "f2",
      "text": "Victims Gian Singh (deceased) and his nephew Zora Singh (P.W. 3) cultivated lands jointly with Bachan Singh (W. 5), his son Mukhtiar Singh, his two brothers Gian Singh and Sarwan Singh, and Surjit Singh (P.W. 4) and Jagjit Singh, brothers of Zora Singh and sons of Sarwan Singh. All lived together in village Dhandri Kalan.",
      "type": "background",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f3",
      "text": "Respondents Hari Singh and Gian Singh, and acquitted accused Milkiat Singh and Dalip Singh, are brothers who lived in village Dhandri Kalan.",
      "type": "background",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f4",
      "text": "There had been a fight between Hari Singh (respondent) and Gian Singh (deceased) in 1968, settled by Panchayat.",
      "type": "background",
      "date": "1968",
      "source": "prosecution"
    },
    {
      "id": "f5",
      "text": "In 1969, before the occurrence, Jagjit Singh and Mukhtiar Singh carried away some toori in a cart against wishes of Hari Singh and another.",
      "type": "background",
      "date": "1969",
      "source": "prosecution"
    },
    {
      "id": "f6",
      "text": "Gian Singh and Zora Singh went to their field for watering sugarcane crop on evening of 18th June, 1969. At about 9 p.m., Bachan Singh (P.W. 5) and Surjit Singh (P.W. 4) carried meals to them. Field situated about 100 karams from tubewell lit by electric light.",
      "type": "material",
      "date": "1969-06-18",
      "source": "prosecution"
    },
    {
      "id": "f7",
      "text": "Gian Singh and Zora Singh went to sleep near tubewell. Bachan Singh and Surjit Singh stayed at sugarcane field nearby.",
      "type": "material",
      "date": "1969-06-18",
      "source": "prosecution"
    },
    {
      "id": "f8",
      "text": "At about midnight, Zora Singh got up to urinate, laid down, saw respondents Hari Singh and Gian Singh, and Milkiat Singh and Dalip Singh arrive with weapons. Hari Singh struck kirpan on neck of Gian Singh. Milkiat Singh struck Zora Singh on right arm with gandasa. Zora Singh raised alarm 'Marditta-Marditta'. All four gave blows.",
      "type": "material",
      "date": "1969-06-19",
      "source": "prosecution"
    },
    {
      "id": "f9",
      "text": "Bachan Singh and Surjit Singh rushed to aid, saw attack and assailants running away. Found Zora Singh unconscious.",
      "type": "material",
      "date": "1969-06-19",
      "source": "prosecution"
    },
    {
      "id": "f10",
      "text": "Gian Singh and Zora Singh removed to Hospital in Ludhiana. Gian Singh died at 5.45 a.m. Condition: unconscious, gasping cyanotic, 8x4 wound on left neck cutting trachea, hyoid exposed.",
      "type": "material",
      "date": "1969-06-19",
      "source": "prosecution"
    },
    {
      "id": "f11",
      "text": "Zora Singh injuries: incised wounds on left hand cutting metacarpals, left wrist, left hand chopping thumb, left forearm, right face and jaw, right neck cutting spine partially, right elbow cutting ulna completely.",
      "type": "material",
      "date": "1969-06-19",
      "source": "prosecution"
    },
    {
      "id": "f12",
      "text": "First Information Report lodged at 5.15 a.m. at Police Station Sadar, Ludhiana (7 miles from village), under Sections 307 and 326 IPC. Stated respondents recognised, two other unknown young Sikhs identifiable.",
      "type": "procedural",
      "date": "1969-06-19",
      "source": "prosecution"
    },
    {
      "id": "f13",
      "text": "Surjit Singh (P.W. 4) maker of FIR. Denied tutoring to say could not identify two assailants.",
      "type": "disputed",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f14",
      "text": "Trial Court convicted respondents under 302, 302/34, 307/34 IPC. Hari Singh death under 302, Gian Singh life under 302/34, both 6 years RI and fine Rs. 2000/- under 307/34.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f15",
      "text": "High Court acquitted respondents on 17th June, 1970, in Criminal Appeal No. 258 of 1970.",
      "type": "procedural",
      "date": "1970-06-17",
      "source": "lower_court"
    },
    {
      "id": "f16",
      "text": "Recoveries: kirpan from straw-bin at instance of Hari Singh on 28th June, 1969; gandasa from roof at instance of Gian Singh. Both stained with human blood. Trial Court disbelieved due to delay after arrest.",
      "type": "disputed",
      "date": "1969-06-28",
      "source": "prosecution"
    },
    {
      "id": "f17",
      "text": "Respondents could not be found in village initially, arrested several days later.",
      "type": "material",
      "date": "1969-06",
      "source": "prosecution"
    },
    {
      "id": "f18",
      "text": "No special report to Magistrate sent.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the three eye-witnesses Zora Singh (P.W. 3), Surjit Singh (P.W. 4), and Bachan Singh (P.W. 5) can be relied upon to sustain conviction.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether Supreme Court should interfere with High Court's order of acquittal.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Trial Court accepted testimony of three eye-witnesses despite relations to victims. High Court's reasons for doubting witnesses erroneous, especially regarding Zora Singh's evidence corroborated by medical evidence.",
      "supporting_facts": [
        "f8",
        "f9",
        "f10",
        "f11"
      ],
      "legal_basis": "Article 136 of Constitution; principles on interfering with acquittals"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Eye-witnesses related to victims, unlikely presence/awake at time, contradictions in identifying assailants, improvements in statements, Zora Singh likely unconscious before recognising assailants.",
      "supporting_facts": [
        "f6",
        "f7",
        "f13"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "High Court's approach to Zora Singh's evidence patently erroneous; assumed untruthfulness without basis. Zora Singh must have seen assailants under electric light before unconsciousness, corroborated by injuries and shouts.",
      "addresses_issue": "i1",
      "key_observation": "Zora Singh's evidence strongly corroborated by medical evidence."
    },
    {
      "id": "cr2",
      "text": "Surjit Singh and Bachan Singh likely present and saw escaping assailants; exaggeration possible but not discard whole testimony. No evidence they were elsewhere.",
      "addresses_issue": "i1",
      "key_observation": "Courts must separate chaff from grain in evidence."
    },
    {
      "id": "cr3",
      "text": "High Court's reasons vitiated by erroneous assumptions; duty to interfere to prevent miscarriage of justice.",
      "addresses_issue": "i2",
      "key_observation": "Power under Article 136 exercised differently for acquittals but interference warranted here."
    },
    {
      "id": "cr4",
      "text": "FIR prompt, omission of other names explained by Zora's unconsciousness; no fabrication.",
      "addresses_issue": "i1",
      "key_observation": "Names added after Zora regained consciousness."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Prosecution case established beyond reasonable doubt on Zora Singh's evidence corroborated by medical and other witnesses.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Set aside High Court acquittal; convict respondents under Sections 302/34 and 307/34 IPC.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Sarwan Singh Rattan Singh Vs. State of Punjab",
      "citation": null,
      "treatment": "followed",
      "relevance": "Prosecution must traverse gap between may be true and must be true for conviction."
    },
    {
      "case_name": "State of Madras Vs. A. Vaidyanatha Iyer",
      "citation": "1958 SCR 580; AIR 1957 SC 637",
      "treatment": "referred",
      "relevance": "Principles for interference with acquittals under Article 136 different from convictions."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "302",
        "302/34",
        "307/34",
        "307",
        "326"
      ],
      "relevance": "Charges for murder, common intention murder, attempt to murder with common intention, and grievous hurt."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Supreme Court set aside High Court order of acquittal, convicted both respondents Hari Singh and Gian Singh under Sections 302/34 IPC to life imprisonment and under Sections 307/34 IPC to six years RI and fine of Rs. 2,000/- each (RI 2 years default). Refrained from death sentence due to time elapsed.",
    "relief_granted": "Conviction and sentences as above",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "Courts must try to extract and separate the hard core of truth from the whole evidence. This is what is meant by the proverbial saying that Courts must separate the chaff from the grain.",
      "speaker": "court",
      "significance": "Principle for appraising witness testimony."
    },
    {
      "text": "The ordinary presumption is that a witness speaking under an oath is truthful unless and until he is shown to be untruthful or unreliable in any particular respect.",
      "speaker": "court",
      "significance": "Reversal of High Court's approach to witness credibility."
    },
    {
      "text": "If, after considering the whole mass of evidence, a residue of acceptable truth is established by the prosecution beyond any reasonable doubt the Courts are bound to give effect to the result.",
      "speaker": "court",
      "significance": "Standard for conviction."
    }
  ],
  "_case_id": "1974_100",
  "_label": 1,
  "_text_length": 24448,
  "_extracted_at": "2026-02-10T20:04:06.413263"
}