{
  "metadata": {
    "case_name": "Krishna Prasad v. Commissioner of Income-tax",
    "case_year": 1970,
    "court": "Supreme Court of India",
    "judges": [
      "KHANNA, J."
    ],
    "case_number": "Civil Appeal No. 1553 of 1970",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Krishna Prasad assessee-appellant along with his father Krishnaswami Naidu and brother C. Krishna Kumar formed a Hindu undivided family up to October 30, 1958.",
      "type": "background",
      "date": "1958-10-30",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Partition between Krishnaswami Naidu and his two sons on October 30, 1958; assessee got some house properties and vacant sites.",
      "type": "material",
      "date": "1958-10-30",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Partition recognised by department; order under section 25-A of Indian Income-tax Act, 1922 passed recognising partition with effect from November 1, 1958.",
      "type": "procedural",
      "date": "1958-11-01",
      "source": "lower_court"
    },
    {
      "id": "f4",
      "text": "Assessee was unmarried on date of partition and during relevant period i.e. year ending March 31, 1964.",
      "type": "material",
      "date": "1964-03-31",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Up to assessment year 1963-64, assessee assessed in status of individual.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "For assessment year 1964-65, assessee filed return showing status as individual but claimed assessment in status of Hindu undivided family.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "Income-tax Officer did not accept claim, held status as individual.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Order of Income-tax Officer affirmed by Appellate Assistant Commissioner and Appellate Tribunal.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "At instance of assessee, question referred to Mysore High Court under section 256(1) of Income-tax Act, 1961.",
      "type": "procedural",
      "date": "1969-09-10",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Mysore High Court answered question in affirmative in favour of revenue and against assessee.",
      "type": "procedural",
      "date": "1969-09-10",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "No other person besides assessee is member of alleged family; assessee is absolute owner of property received on partition and can deal with it as he wishes.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "No female member in existence entitled to maintenance or capable of adopting son.",
      "type": "material",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether on the facts and in the circumstances of the case the assessee was rightly assessed in the status of an individual for the assessment year 1964-65?",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether an unmarried male Hindu on partition of a joint Hindu family can be assessed in the status of a Hindu undivided family even though no other person besides him is a member of the alleged family.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Assessee claimed that he should be assessed in the status of a Hindu undivided family for 1964-65.",
      "supporting_facts": [
        "f2",
        "f4",
        "f11"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Reliance on Anant Bhikappa Patil v. Shankar Ramchandra Patil to argue that a Hindu joint family cannot be finally brought to an end while it is possible to add a male member; implicit that single member (widow) constituted family.",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": "Anant Bhikappa Patil v. Shankar Ramchandra Patil, AIR 1943 PC 196"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Assessee's status is that of an individual, not Hindu undivided family.",
      "supporting_facts": [
        "f4",
        "f11"
      ],
      "legal_basis": "Section 2(31) and Section 4 of Income-tax Act, 1961"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "A single individual cannot constitute a Hindu undivided family; family denotes a group, plurality of persons essential.",
      "addresses_issue": "i1",
      "key_observation": "Family connotes a group of people related by blood or marriage; single person remains individual."
    },
    {
      "id": "cr2",
      "text": "Hindu undivided family under Income-tax Act used in sense of Hindu joint family under Hindu law; can consist of single male and widows, but assessment as HUF requires two or more members.",
      "addresses_issue": "i2",
      "key_observation": "Share on partition is ancestral only as regards male issue; assessee sole coparcener, absolute owner."
    },
    {
      "id": "cr3",
      "text": "Status determined by present realities, not future possibilities like adoption.",
      "addresses_issue": "i2",
      "key_observation": "Excursions to speculation not permissible for income-tax assessment."
    },
    {
      "id": "cr4",
      "text": "Anant Bhikappa Patil case concerns widow's adoption power after sole coparcener's death; adopted son's rights relate back, so no single member family during period.",
      "addresses_issue": "i2",
      "key_observation": "Case not applicable as question of single individual as HUF not before Judicial Committee."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Unmarried male Hindu after partition, with no other members, cannot be assessed as Hindu undivided family; correctly assessed as individual.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Hindu undivided family in Income-tax Act requires plurality of persons; single person is individual.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Gowli Buddanna v. Commissioner of Income-tax Mysore",
      "citation": "(1966) 60 ITR 293",
      "treatment": "referred",
      "relevance": "Court refrained from opining if single member HUF is taxable entity."
    },
    {
      "case_name": "Attorney-General of Ceylon v. Arunachalam Chettiar Ors.",
      "citation": "(1958) 34 ITR 42",
      "treatment": "followed",
      "relevance": "Hindu undivided family in Income-tax Act in sense of Hindu joint family under Hindu law."
    },
    {
      "case_name": "Commissioner of Income-tax Madras v. Ram Ar. Ar. Veerappa Chettiar",
      "citation": "(1970) 76 ITR 467",
      "treatment": "followed",
      "relevance": "Hindu joint family need not have male member; continues with widows if property undivided."
    },
    {
      "case_name": "Anant Bhikappa Patil v. Shankar Ramchandra Patil",
      "citation": "AIR 1943 PC 196",
      "treatment": "distinguished",
      "relevance": "Power of widow to adopt not defeated by death of sole coparcener; but adopted son rights relate back, no single member family."
    }
  ],
  "statutes_cited": [
    {
      "name": "Income-tax Act, 1961",
      "sections": [
        "Section 4",
        "Section 2(31)",
        "Section 256(1)"
      ],
      "relevance": "Charging of tax on persons including individual and HUF; HUF distinct from individual; reference to High Court."
    },
    {
      "name": "Indian Income-tax Act, 1922",
      "sections": [
        "Section 25-A"
      ],
      "relevance": "Recognition of partition of HUF."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal dismissed; assessee held to be individual and not Hindu undivided family for assessment year 1964-65; High Court judgment affirmed.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "A family consisting of a single individual is a contradiction in terms.",
      "speaker": "court",
      "significance": "Core holding that single person cannot constitute HUF."
    },
    {
      "text": "Plurality of persons is an essential attribute of a family. A single person, male or female, does not constitute a family.",
      "speaker": "court",
      "significance": "Defines essence of 'family' under Income-tax law."
    },
    {
      "text": "In order to determine the status of the assessee for the purpose of income-tax, we have to look to the realities as they exist at present and it would not be correct to project into the matter future possibilities.",
      "speaker": "court",
      "significance": "Rejects speculation on future members like adoption."
    }
  ],
  "_case_id": "1974_340",
  "_label": 0,
  "_text_length": 13505,
  "_extracted_at": "2026-02-10T20:06:07.958250"
}