{
  "metadata": {
    "case_name": "Writ Petition No. 845 of 1973",
    "case_year": 1973,
    "court": "Supreme Court of India",
    "judges": [
      "BEG, J."
    ],
    "case_number": "Writ Petition No. 845 of 1973",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Petitioner filed habeas corpus petition under Art 32 challenging detention order dated 24-11-1972 passed under Section 5 clause (a) of Maintenance of Internal Security Act, 1971.",
      "type": "procedural",
      "date": "1973-01-01",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Petitioner actually arrested on 20-11-1972; detention order passed subsequently on 24-11-1972 and served on same date.",
      "type": "procedural",
      "date": "1972-11-20",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Sole ground of detention: On 11-10-1972 at about 01.55 hrs., petitioner along with associates, armed with bombs and other weapons, victimised wagon No. NR 17393 Ex Bro to KPD attached to running goods train in EC 249 DN near Booster Sub-station of Dum Dum Jn. R.S. when train slowed down for traffic restriction, committed theft in respect of tea chests; challenged by train guard RPF party, hurled bombs, RPF RK Sitaram Rai fired one round in self defence, fled leaving behind three chests of tea at the P.O.; action caused disruption of train service and affected supplies and services.",
      "type": "material",
      "date": "1972-10-11",
      "source": "detention_order"
    },
    {
      "id": "f4",
      "text": "Petitioner informed in detention document of right to make representation to State Government, to be forwarded through jail superintendent; case to be placed before Advisory Board within 30 days under Section 10 MISA; right to be heard by Advisory Board under Section 11 if desired.",
      "type": "procedural",
      "date": "1972-11-24",
      "source": "detention_order"
    },
    {
      "id": "f5",
      "text": "Petitioner made representation to Government asserting allegations absolutely untrue, palpably false and impracticable (theft from running wagon, fleeing leaving chests at P.O.); no evidence of identification as participator.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "Affidavit by Special Secretary Home Dept., Govt. of West Bengal (District Magistrate who passed order): Train was goods train come to stop due to traffic restriction, not running; petitioner is notorious wagon breaker operating near Dum Dum Junction Railway Station.",
      "type": "background",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f7",
      "text": "Record produced by State: No mention of petitioner as notorious wagon breaker; describes modus operandi of gang on passenger trains depriving passengers of trunks/goods using distraction tactics, activities commenced after 11-10-1972 incident; incriminating articles recovered from gang members including petitioner, prosecutions pending; 11-10-1972 incident mentioned but no indication how petitioner linked to it.",
      "type": "background",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "Petitioner's assertion: Arrested 20-11-1972 for reasons not disclosed; insufficient evidence for prosecution, hence detention order made on convenient ground.",
      "type": "disputed",
      "date": "1972-11-20",
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the detention order is invalid due to vagueness of the sole ground (e.g., meaning of 'P.O.', description of 'running goods train'), non-communication of other matters taken into account (e.g., notorious wagon breaker), preventing effective representation.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether matters not communicated to detainee (e.g., from record) can form basis for detention order.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Allegations in sole ground absolutely untrue, palpably false and impracticable (theft from running wagon, fleeing leaving chests at P.O.); no evidence of identification as participator.",
      "supporting_facts": [
        "f3",
        "f5"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Arrested 20-11-1972 without disclosed reasons; insufficient evidence for prosecution led to detention on convenient ground.",
      "supporting_facts": [
        "f2",
        "f8"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Train was stopped due to traffic restriction, not actually running; petitioner is notorious wagon breaker near Dum Dum.",
      "supporting_facts": [
        "f3",
        "f6"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Detention based on whole record including gang activities post-incident, incriminating articles recovered from petitioner, pending prosecutions.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Vagueness in sole ground ('P.O.' not apparent, 'running goods train' actually stationary); matters like 'notorious wagon breaker' not in communicated grounds or record as stated; no link shown between petitioner and 11-10-1972 incident in record.",
      "addresses_issue": "i1",
      "key_observation": "Grounds do not enable petitioner to make effective representation."
    },
    {
      "id": "cr2",
      "text": "Matters in record (gang on passenger trains, etc.) not communicated to petitioner, yet appear taken into account; District Magistrate should provide fuller information.",
      "addresses_issue": "i2",
      "key_observation": "Non-communication of allegations prevents effective representation."
    },
    {
      "id": "cr3",
      "text": "Nexus exists between sole ground and maintenance of supplies/services, but vagueness of single ground vitiates order (citing Prabhu Dayal Deorah); powers of preventive detention must not be exercised unreasonably, capriciously, etc.",
      "addresses_issue": "i1",
      "key_observation": "Deprivation of liberty serious; must ascertain necessity on proper materials."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Vagueness of a single ground can vitiate detention order; grounds must enable effective constitutional right of representation.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Detaining authority must communicate all allegations/materials taken into account to allow effective representation.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Probhu Dayal Deorah Vs. District Magistrate, Kamrup Ors.",
      "citation": null,
      "treatment": "followed",
      "relevance": "Vagueness of a single ground could vitiate a detention order."
    }
  ],
  "statutes_cited": [
    {
      "name": "Maintenance of Internal Security Act, 1971 (Act 26 of 1971)",
      "sections": [
        "Section 5 clause (a)",
        "Section 10",
        "Section 11"
      ],
      "relevance": "Basis for detention order; rights to representation and hearing by Advisory Board."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 32"
      ],
      "relevance": "Basis for habeas corpus petition; constitutional right of representation against detention."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Detention order held invalid due to vagueness and non-communication of materials, vitiating the order and preventing effective representation.",
    "relief_granted": "Habeas corpus petition allowed (implied quashing of detention).",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "Deprivation of a citizens personal liberty is a serious matter Those exercising drastic powers of preventive detention... should at least take care to ascertain whether a detention is being ordered in a manner and on materials Which disclose that it is really necessary...",
      "speaker": "court",
      "significance": "Emphasizes care required in preventive detention to protect liberty."
    },
    {
      "text": "Recently, it was held by this Court... that vagueness of a single ground could vitiate a detention order.",
      "speaker": "court",
      "significance": "Key holding on vagueness invalidating detention."
    },
    {
      "text": "The grounds given could not, in our opinion enable the petitioner to effectively exercise his constitutional right of making a representation against his detention.",
      "speaker": "court",
      "significance": "Core reason for invalidating the detention order."
    }
  ],
  "_case_id": "1974_53",
  "_label": 1,
  "_text_length": 8378,
  "_extracted_at": "2026-02-10T20:03:15.472808"
}