{
  "metadata": {
    "case_name": "Appellants v. State",
    "case_year": 1974,
    "court": "Supreme Court of India",
    "judges": [
      "JAGANMOHAN REDDY, J."
    ],
    "case_number": "Criminal Appeal No. 325 of 1974",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Criminal first appeal against conviction filed in Bombay High Court as Crl. Appeal No. 305 of 1974.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Bombay High Court dismissed the criminal first appeal summarily under Section 421 of the Criminal Procedure Code by one word 'dismissed' without calling for the record.",
      "type": "procedural",
      "date": "1974-04-08",
      "source": "lower_court"
    },
    {
      "id": "f3",
      "text": "Special leave petition filed in Supreme Court, admitted, appeal registered, and matter heard on merits by learned Advocates for parties.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Statement in special leave petition read before Supreme Court, contending arguable points arise in the case.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the High Court can summarily dismiss a criminal first appeal against conviction under Section 421 CrPC without giving reasons or calling for records, merely on perusal of petition and copy of judgment.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Dismissal was so summary that even the record was not called for; arguable points arise as per statement in special leave petition.",
      "supporting_facts": [
        "f2",
        "f4"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "High Court has power to dismiss appeal summarily under Section 421 CrPC; cited several decisions.",
      "supporting_facts": [
        "f2"
      ],
      "legal_basis": "Section 421 CrPC"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Section 421 CrPC vests power in High Court to dismiss summarily but only on perusal of petition and copy of judgment; High Court should give some reasons why no arguable case is made out, especially given Article 136 special leave jurisdiction.",
      "addresses_issue": "i1",
      "key_observation": "Long series of decisions from 1953 SCR 809 onwards discourages one-word summary dismissals."
    },
    {
      "id": "cr2",
      "text": "Summary dismissals without reasons reverse proper process, burden Supreme Court unnecessarily, cause delay and anxiety to convicted person; High Court function to assess arguable case first.",
      "addresses_issue": "i1",
      "key_observation": "In absence of reasons, Supreme Court cannot ascertain if arguable case exists."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "High Court should not summarily dismiss criminal appeals by one word without reasons after perusal; practice disapproved per series of decisions.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "1953 SCR 809",
      "citation": "1953 SCR 809",
      "treatment": "referred",
      "relevance": "Beginning of series of decisions discouraging summary one-word dismissals of criminal appeals"
    }
  ],
  "statutes_cited": [
    {
      "name": "Criminal Procedure Code",
      "sections": [
        "Section 421"
      ],
      "relevance": "Vests power in High Court to summarily dismiss appeals but only on perusal of documents; requires reasons"
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 136"
      ],
      "relevance": "Any person aggrieved by High Court order can petition Supreme Court for special leave"
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; order of Bombay High Court set aside; appeal remanded to High Court for hearing on admission and disposal in accordance with law and in light of directions given.",
    "relief_granted": "Remand to High Court for proper consideration",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "the High Court should at least have given some reasons why no arguable case is made out on a perusal of those documents.",
      "speaker": "court",
      "significance": "Core direction on need for reasons in summary dismissals"
    },
    {
      "text": "We do hope and trust that the series of decisions over this long period disapproving of the practice of summarily dismissing by one word will be taken note of",
      "speaker": "court",
      "significance": "Express disapproval and caution to High Courts against the practice"
    }
  ],
  "_case_id": "1974_262",
  "_label": 1,
  "_text_length": 3603,
  "_extracted_at": "2026-02-10T20:05:45.172105"
}