{
  "metadata": {
    "case_name": "Sawal Das v. State",
    "case_year": 1974,
    "court": "Supreme Court of India",
    "judges": [
      "BEG J."
    ],
    "case_number": "Review Petition Crl. No.19 of 1974",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Applicant Sawal Das tried together with father Jamuna Prasad and step-mother Kalawati Devi for murder of his wife Chanda Devi, alleged frequent quarrels with Kalawati.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Applicant, father and others charged under Section 201 IPC for disposing of body of Chanda Devi knowing she had been murdered.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Trial Court convicted Sawal Das, Jamuna Prasad and Kalawati under Section 302/34 IPC, sentenced each to rigorous imprisonment for life; convicted applicant and father under Section 201 IPC but no separate sentences imposed.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f4",
      "text": "High Court set aside convictions of Kalawati for both offences, ordered her at liberty; set aside Jamuna Prasad's conviction under 302/34 but maintained under Section 201 IPC with 3 years RI; converted Sawal Das's conviction from 302/34 to 302 IPC simpliciter, maintained life imprisonment and conviction/sentence under Section 201 IPC to run concurrently.",
      "type": "procedural",
      "date": "1968-09-16",
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "High Court erroneously assumed Trial Court had sentenced Sawal Das separately under Section 201 IPC.",
      "type": "disputed",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Supreme Court dismissed Jamuna Prasad's application for leave to appeal against conviction under Section 201 IPC; refused leave to Sawal Das to contest beyond correctness of conviction under Section 302 IPC.",
      "type": "procedural",
      "date": "1974-01-19",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Supreme Court considered uncertainties in facts as to who committed murder, gave benefit to Sawal Das as Section 34 failed; set aside his conviction under Section 302 IPC but affirmed under Section 201 IPC; murder committed after accused seen following Chanda Devi into room.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "No special leave granted against Sawal Das's conviction under Section 201 IPC; some argument heard on appropriate sentence under Section 201 IPC.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Supreme Court imposed sentence of 7 years rigorous imprisonment and fine under Section 201 IPC on Sawal Das.",
      "type": "procedural",
      "date": "1974-01-19",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether this Court can pass a sentence under Section 201 IPC when no separate sentence was imposed by Trial Court or specified by High Court, absent appeal by State.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether failure to pass separate sentence under Section 201 IPC by Trial Court, and High Court's assumption of sentence, prevents Supreme Court from imposing one.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "No appeal filed by State against Trial Court's failure to pass separate sentence under Section 201 IPC or High Court's failure to specify sentence; thus Supreme Court cannot pass any sentence under Section 201 IPC.",
      "supporting_facts": [
        "f3",
        "f4",
        "f5"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Applicant not heard on question of sentence under Section 201 IPC.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Court has power to impose sentence on conviction even if not done by lower courts; sequential and incidental order under Section 423(1)(d) CrPC when affirming conviction without sentence.",
      "addresses_issue": "i1",
      "key_observation": "Law does not envisage conviction without sentence; appellate court can pass just and proper consequential order."
    },
    {
      "id": "cr2",
      "text": "High Court orders showed sentence under Section 201 to run concurrently with life sentence, though period not fixed; upon setting aside 302 conviction, period for 201 had to be fixed.",
      "addresses_issue": "i2",
      "key_observation": "Applicant was convicted and sentence ordered concurrent, only period unspecified."
    },
    {
      "id": "cr3",
      "text": "Applicant was heard on sentence; no sufficient grounds to revise 7 years RI and fine.",
      "addresses_issue": "i1",
      "key_observation": "Re-heard on review after notice to State."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Supreme Court has power to pass sentence under Section 201 IPC as consequential to affirming conviction, even if lower courts failed to impose one.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Sentence of 7 years rigorous imprisonment and fine under Section 201 IPC maintained.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Jayaram Vithoba Anr. v. The State of Bombay",
      "citation": "1955 2 SCR 1049, 1054-55",
      "treatment": "followed",
      "relevance": "Court must impose sentence on conviction; appellate court can pass consequential sentence under Section 423(1)(d) CrPC when affirming conviction without sentence."
    },
    {
      "case_name": "Ibrahim v. Emperor",
      "citation": "AIR 1940 Bom 129",
      "treatment": "distinguished",
      "relevance": "View that such order enhances sentence disagreed with."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "302",
        "34",
        "201",
        "304"
      ],
      "relevance": "Convictions and sentences under these sections; separate sentence required for each offence even if concurrent."
    },
    {
      "name": "Code of Criminal Procedure",
      "sections": [
        "423(1)(d)"
      ],
      "relevance": "Appellate court power to make consequential or incidental orders just and proper, including imposing sentence on affirmed conviction."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Review petition dismissed; sentence of 7 years rigorous imprisonment and fine under Section 201 IPC confirmed, no grounds to revise.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"When a person is tried for an offence and convicted, it is the duty of the Court to impose on him such sentence, as is prescribed therefor. The law does not envisage a person being convicted for an offence without a sentence being imposed therefor.\"",
      "speaker": "court",
      "significance": "Establishes duty to sentence on conviction, basis for appellate power."
    },
    {
      "text": "\"The power to pass a sentence under those circumstances is derived from the law which enacts that on conviction a sentence shall be imposed on the accused, and that is a power which can and ought to be exercised by all the Courts.\"",
      "speaker": "court",
      "significance": "Justifies Supreme Court's authority to impose sentence."
    }
  ],
  "_case_id": "1974_414",
  "_label": 0,
  "_text_length": 8947,
  "_extracted_at": "2026-02-10T20:06:44.628710"
}