{
  "metadata": {
    "case_name": "Heirs of Venkanna v. Venkata Sattayya",
    "case_year": 1967,
    "court": "Supreme Court of India",
    "judges": [
      "ALAGIRISWAMI, J."
    ],
    "case_number": "Civil Appeal No. 1817 of 1967",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Venkanna, the father of the appellants, had a brother Ramamurti who died childless in the year 1908 leaving behind him his widow Narasimham.",
      "type": "background",
      "date": "1908",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "After Ramamurti's death a series of litigations started between Venkanna and Narasimham.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Venkanna filed O.S. No. 14 of 1913 against the widow in respect of acts of waste committed by her of Ramamurti's estate and was appointed a receiver in that suit.",
      "type": "procedural",
      "date": "1913",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "In O.S. No. 14 of 1913, Venkanna got a decree against Narasimham for a sum of Rs.13,539/- as she failed to furnish security as originally decreed by the court.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Venkanna as receiver filed three suits on the foot of three mortgages in favour of Ramamurti. One was O.S. No. 34 of 1916. In execution of that decree item 1 of the A Schedule properties was purchased in court auction.",
      "type": "procedural",
      "date": "1916",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "O.S. No. 443 of 1918 was filed on the foot of another mortgage in favour of Ramamurti executed in 1904 and items 2 and 5 of the plaint schedule properties were purchased in execution of decree in that suit.",
      "type": "procedural",
      "date": "1904 / 1918",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "These three items of properties (1,2,5) are the subject matter of this appeal.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Venkanna died in 1947 and Narasimham in 1951 after executing a will bequeathing in favour of her brother Venkata Sattayya all her properties.",
      "type": "background",
      "date": "1947 / 1951",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Venkata Sattayya filed the suit, out of which this appeal arises, for possession of the properties bequeathed to him under the will and for mesne profits.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "The Subordinate Judge who tried the suit held that items 1, 2 and 5 become accretions to the main estate of Ramamurti and therefore the plaintiff was entitled only to an account of the income from those properties till the death of Venkanna.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "The appeal against the Subordinate Judge's judgment came up for hearing before Justice Satyanarayana Raju and Justice Venkatesam of the Andhra Pradesh High Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "The learned Judges called for a finding with regard to the interest on the two mortgages in execution of the decrees in which items 1, 2 and 5 had been purchased, relating to the period before Ramamurti's death and the period after Ramamurti's death.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "After that finding was received they allowed the appeal in part and held that the plaintiff would be entitled to a 19/34th share of item 1, and 12/23rd share of items 2 and 5.",
      "type": "procedural",
      "date": "21st September 1965",
      "source": "high_court"
    },
    {
      "id": "f14",
      "text": "This appeal is filed in pursuance of a certificate granted by the High Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f15",
      "text": "Before the High Court the learned advocate for the appellants had contended that Narasimham owed to the estate of Ramamurti a sum of Rs.14,639/- and that when the decree was sought to be executed by Venkanna, Narasimham claimed that the account due to her by way of interest under the three mortgage bonds should be set off and that the execution could proceed only for the balance, that the set off claimed by Narasimham was actually allowed.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f16",
      "text": "In the Trial Court the plaintiff's contention was that these properties were purchased out of the accumulated interest on the mortgages and the defendants asserted that they were purchased out of the principal. That Court dismissed the plaintiff's claim on the ground that there was no proof of his allegations.",
      "type": "disputed",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f17",
      "text": "Out of about 16 acres comprised in item 1, 5 acres had been lost in revenue sale because of Narasimham's failure to pay the land revenue on those lands.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f18",
      "text": "Venkanna had submitted accounts to the court in his capacity as receiver till 1940.",
      "type": "material",
      "date": "till 1940",
      "source": "court"
    },
    {
      "id": "f19",
      "text": "Even when Venkanna died a sum of Rs.4,486/- was due to him on the foot of the decree he obtained against Narasimham.",
      "type": "material",
      "date": "1947",
      "source": "court"
    },
    {
      "id": "f20",
      "text": "From the finding submitted by the Trial Court Narasimham claimed that the amounts due to her should be set off and execution should proceed only for the balance and from Ex. A-7 it would appear that the claim was allowed.",
      "type": "admitted",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f21",
      "text": "The decree in Venkanna's suit appears to have directed payment of interest to Narasimham Para III c of the plaint and judgment of the High Court.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f22",
      "text": "When Narasimham's life interest in the estate was sold in E.P. No. 93 of 1927 filed by Venkanna she did not question the legality of the sale on the ground that her interest in the property was not a life interest but was a full interest.",
      "type": "background",
      "date": "1927",
      "source": "court"
    },
    {
      "id": "f23",
      "text": "In the order in E.A. 624 of 1935 passed by the Subordinate Judge, Visakhapatnam the widow treated items 1, 2 and 5 as part of the estate of her husband and she had also asserted therein that she had a right to enjoy the same as representative of his estate.",
      "type": "background",
      "date": "1935",
      "source": "court"
    },
    {
      "id": "f24",
      "text": "Life interest in the A-Schedule properties was sold in E.P. 28 of 1940 in execution of the decree in O.S. 14 of 1913 and the widow did not object to the sale on the ground that what was being sought to be sold was a life interest but that she was entitled to full interest.",
      "type": "background",
      "date": "1940",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the High Court committed an error in confining the appeal after receipt of the finding from the Subordinate Court only to the question of the share, which the appellants and the respondent were entitled to, based on the calculation of the interest due on the mortgages before and after the death of Ramamurti, instead of hearing the whole appeal.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether the set-off claimed by Narasimham for interest under the mortgage bonds was actually allowed against the decree in O.S. 14 of 1913, entitling her to no share in the properties purchased in execution.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether the 5 acres lost in revenue sale due to Narasimham's negligence should be debited against her share in items 1, 2 and 5.",
      "framed_by": "petitioner"
    },
    {
      "id": "i4",
      "text": "Whether the costs incurred by Venkanna in the suit and execution proceedings should be taken into account in allocating items 1, 2 and 5.",
      "framed_by": "petitioner"
    },
    {
      "id": "i5",
      "text": "Whether Narasimham treated items 1, 2 and 5 as accretions to her husband's estate, entitling appellants to the whole property.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "As the High Court had merely framed issues and referred them for trial to the court of first instance under Order XLI Rule 25 of the Code of Civil Procedure and not remanded the whole case under Order XLI Rule 23, they should have heard the whole appeal and not confined the hearing merely to the points on which the finding was called for.",
      "supporting_facts": [
        "f12",
        "f13"
      ],
      "legal_basis": "Order XLI Rule 25 CPC"
    },
    {
      "id": "pa2",
      "text": "Narasimham owed Rs.14,639/- to Ramamurti's estate; set-off of interest under mortgages was allowed against Venkanna's decree, so she gets no share in auction-purchased properties.",
      "supporting_facts": [
        "f4",
        "f15",
        "f20"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "5 acres lost in revenue sale due to Narasimham's failure to pay land revenue should be debited against her share.",
      "supporting_facts": [
        "f17"
      ],
      "legal_basis": null
    },
    {
      "id": "pa4",
      "text": "Costs incurred by Venkanna in suit and execution should be taken into account in allocation.",
      "supporting_facts": [
        "f18",
        "f19"
      ],
      "legal_basis": null
    },
    {
      "id": "pa5",
      "text": "Narasimham treated properties as accretion: did not question sales of her life interest, treated as husband's estate in orders.",
      "supporting_facts": [
        "f22",
        "f23",
        "f24"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "When a finding is called for on the basis of certain issues framed by the Appellate Court the appeal is not disposed of either in whole or in part. Therefore, the parties cannot be barred from arguing the whole appeal after the findings are received from the court of first instance.",
      "addresses_issue": "i1",
      "key_observation": "High Court should have heard whole appeal; cites precedents supporting this."
    },
    {
      "id": "cr2",
      "text": "High Court should consider set-off aspect: unlikely interest not credited given decree directions, accounts, Ex.A-7; but no final opinion, remand for consideration.",
      "addresses_issue": "i2",
      "key_observation": "If set-off, no share for Narasimham."
    },
    {
      "id": "cr3",
      "text": "Hindu widow entitled to full beneficial enjoyment; not liable for loss unless willful waste; reversioner gets only what left at death; no debit for 5 acres.",
      "addresses_issue": "i3",
      "key_observation": "Neither on principle nor authority supported."
    },
    {
      "id": "cr4",
      "text": "Income received and amounts spent by Venkanna, including suit/execution costs, taken into account in accounts; executable decree for balance; cannot now separate.",
      "addresses_issue": "i4",
      "key_observation": "Agrees with High Court."
    },
    {
      "id": "cr5",
      "text": "Facts insufficient to establish widow treated property as accretion; presumption she retains dominion over investments of income; no estoppel.",
      "addresses_issue": "i5",
      "key_observation": "Cites Akkanna v. Venkayya; widow intended properties for brother."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Appellate court calling finding under O.41 R.25 does not dispose appeal; must hear whole case after finding.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "High Court to consider set-off issue afresh.",
      "resolves_issue": "i2",
      "in_favor_of": "partial"
    },
    {
      "id": "h3",
      "text": "No debit for revenue sale loss against widow's share absent willful waste suit.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    },
    {
      "id": "h4",
      "text": "Suit/execution costs already accounted; no separate allocation.",
      "resolves_issue": "i4",
      "in_favor_of": "respondent"
    },
    {
      "id": "h5",
      "text": "No accretion based on facts; presumption of absolute ownership over income investments.",
      "resolves_issue": "i5",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Gopi Nath Shukul v. Sat Narain Shukul",
      "citation": "AIR 1923 Allahabad 384",
      "treatment": "followed",
      "relevance": "Appellate court remitting issues under O.41 R.25 can hear whole case after findings."
    },
    {
      "case_name": "Sultan Beg v. Chunilal",
      "citation": "AIR 1918 Nagpur 193",
      "treatment": "followed",
      "relevance": "Similar view on O.41 R.25 remand."
    },
    {
      "case_name": "Abinash Chandra Bidyanidhi Bhattacharjee v. Dasarath Malo",
      "citation": "XXXII 1927-28 Calcutta Weekly Notes 1233",
      "treatment": "followed",
      "relevance": "O.41 R.25 order decides nothing; court can revisit on final hearing."
    },
    {
      "case_name": "Akkanna v. Venkayya",
      "citation": "I.L.R. 1902 25 Mad. 351",
      "treatment": "followed",
      "relevance": "Presumption Hindu widow retains dominion over investments of husband's estate income."
    }
  ],
  "statutes_cited": [
    {
      "name": "Code of Civil Procedure",
      "sections": [
        "Order XLI Rule 25",
        "Order XLI Rule 23"
      ],
      "relevance": "Distinction between referring issues for finding vs. remanding case; appeal not disposed by former."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed, High Court judgment set aside. High Court to dispose of appeal afresh considering set-off issue and other points. Costs of this appeal to abide and be provided in fresh decree.",
    "relief_granted": "Remand to High Court for fresh disposal",
    "costs": "Costs of this appeal will abide and be provided in the fresh decree to be passed by the High Court."
  },
  "key_quotes": [
    {
      "text": "\"When a finding is called for on the basis of certain issues framed by the Appellate Court the appeal is not disposed of either in whole or in part. Therefore, the parties cannot be barred from arguing the whole appeal after the findings are received.\"",
      "speaker": "court",
      "significance": "Core holding on procedure under O.41 R.25 CPC leading to remand."
    },
    {
      "text": "\"A Hindu widow is entitled to the full beneficial enjoyment of the estate. So long as she is not guilty of willful waste, she is answerable to no one.\"",
      "speaker": "court",
      "significance": "Explains nature of widow's estate; rejects debit for revenue loss."
    }
  ],
  "_case_id": "1974_99",
  "_label": 1,
  "_text_length": 17570,
  "_extracted_at": "2026-02-10T20:04:17.548007"
}