{
  "metadata": {
    "case_name": "Manphul Singh v. Surinder Singh",
    "case_year": 1974,
    "court": "Supreme Court of India",
    "judges": [
      "Gupta, J."
    ],
    "case_number": "Civil Appeal No. 739 NCE of 1974",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "In the election held on March 11, 1972 the appellant Shri Manphul Singh was elected to the Haryana Vidhan Sabha from the Jhajjar Constituency defeating his only rival, Shri Surinder Singh, the respondent before us, by a margin of 265 votes.",
      "type": "background",
      "date": "1972-03-11",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Shri Surinder Singh filed an election petition challenging the election of the returned candidate on various allegations including: 1. 28 votes were cast in favour of the returned candidate by some persons impersonating voters who were dead. 2. 710 absentee voters were impersonated by persons who polled their votes in favour of the returned candidate. 3. 158 government servants who were registered as voters in the Constituency but were not present in their respective villages and did not cast their votes, were impersonated and their votes were polled in favour of the returned candidate. 4. 149 persons, registered as voters at two or more different places in the constituency, polled their votes twice or more than twice in favour of the returned candidate.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "On December 1, 1972 the petitioner filed an application suggesting a procedure to prove impersonation and double voting by producing genuine voters to check counterfoils of ballot papers for their genuine signatures, asking for production of the counterfoils.",
      "type": "procedural",
      "date": "1972-12-01",
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "The prayer for inspection was renewed when one Ranbir Singh, P.W. 17, was in the witness box.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "High Court by order dated January 5, 1973 allowed inspection of two counterfoils of ballot papers to confirm the oral evidence of the witness that he had impersonated two voters by signing their names in the counterfoils.",
      "type": "procedural",
      "date": "1973-01-05",
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "From an earlier interlocutory order passed in this election dispute, the returned candidate had preferred an appeal to this Court which was dismissed. Reported in AIR 1973 S.C. 2158 Manphul Singh v. Surinder Singh.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "On December 17, 1973 the High Court allowed the prayer to allow two finger-print experts named by the petitioner to compare the thumb impressions of some of the witnesses with the thumb impressions on the relevant counterfoils.",
      "type": "procedural",
      "date": "1973-12-17",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "On December 18, 1973 the returned candidate made an application, registered as Civil Miscellaneous Application No. 158-E/73, contending that counterfoils were secret documents and inspection should not be allowed unless prima facie case made out, seeking revocation of permission to fingerprint experts.",
      "type": "procedural",
      "date": "1973-12-18",
      "source": "respondent"
    },
    {
      "id": "f9",
      "text": "High Court order dated February 4, 1974 on the application: Found prima facie impersonation in about 310 cases based on evidence of witnesses recorded till then, allowed petitioner's experts to inspect counterfoils of those 310 voters. Tabulated in seven lists A to G.",
      "type": "procedural",
      "date": "1974-02-04",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "List A: Particulars of dead voters alleged to have been impersonated, 5 in number.",
      "type": "disputed",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "List B: Particulars of voters examined on oath and found prima facie to have been impersonated on basis of their own testimony, 126 in number.",
      "type": "disputed",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "List C: Particulars of voters prima facie impersonated upon evidence of P.Ws. 17 and 472, 4 in number.",
      "type": "disputed",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "List D: Particulars of voters who appeared as witnesses for petitioner but deposed against him, but found prima facie impersonated from deposition of other witnesses, 15 in number.",
      "type": "disputed",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "List E: Particulars of witnesses declared hostile to petitioner but found prima facie impersonated from deposition of other witnesses, 13 in number.",
      "type": "disputed",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f15",
      "text": "List F: Particulars of voters not examined as witnesses but found prima facie impersonated from deposition of other witnesses, 48 in number.",
      "type": "disputed",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f16",
      "text": "List G: Particulars of multiple voting. Category a: polled twice in the constituency, 17 cases. Category b: polled once in constituency and once in another, 46 cases. Total 63 persons where petitioner adduced prima facie evidence supported by electoral roll showing registration at multiple places.",
      "type": "disputed",
      "date": null,
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the High Court was proper in allowing inspection of counterfoils of ballot papers pertaining to 310 voters found prima facie to have been impersonated, or did it amount to a fishing enquiry without prima facie case.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Counterfoils are secret documents and their inspection should not be allowed unless a prima facie case for inspection is made out; High Court's order allowing inspection amounted to a fishing enquiry not permissible in law; prayer for revoking permission to fingerprint experts.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "High Court did not apply its mind to judge the quality of evidence but depended on volume; no material to support allegation of multiple voting.",
      "supporting_facts": [
        "f9",
        "f16"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Procedure to prove impersonation by producing genuine voters to check counterfoils; renewed prayer during witness examination; supported by earlier Supreme Court observation that nothing could be clearer or more reasonable.",
      "supporting_facts": [
        "f3",
        "f4",
        "f6"
      ],
      "legal_basis": "AIR 1973 S.C. 2158"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Legal position well established: Inspection requires prima facie case, not vague allegations or fishing; secrecy of ballot important but justice more so; High Court aware of correct position and found prima facie impersonation in 310 cases after examining evidence, classifying into seven lists with particulars and witness names; evidence if unrebutted sufficient; not arbitrary.",
      "addresses_issue": "i1",
      "key_observation": "High Court satisfied prima facie case existed requiring further investigation."
    },
    {
      "id": "cr2",
      "text": "On multiple voting: Electoral roll shows persons registered at two places with same descriptions; common ground votes polled at both places; prima facie evidence adduced.",
      "addresses_issue": "i1",
      "key_observation": "Petitioner's contention on multiple voting supported by electoral roll."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "High Court order allowing inspection of counterfoils upheld as prima facie case made out; appeal fails.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Dr. Jagjit Singh v. Giani Kartar Singh",
      "citation": "AIR 1966 S.C. 773",
      "treatment": "followed",
      "relevance": "Principle: Application for inspection must give material facts; secrecy important; no roving or fishing enquiry."
    },
    {
      "case_name": "Sashi Bhusan v. Prof. Balraj Madhok and Ors",
      "citation": "1972 2 S.C.R. 177",
      "treatment": "followed",
      "relevance": "Reaffirmed no rigid test; allegations must be supported by material facts, bona fide; justice more important than secrecy."
    },
    {
      "case_name": "Manphul Singh v. Surinder Singh",
      "citation": "AIR 1973 S.C. 2158",
      "treatment": "followed",
      "relevance": "Earlier appeal in same matter: Petitioner's procedure for inspection reasonable, proving prima facie before inspection."
    }
  ],
  "statutes_cited": [],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal by special leave against the High Court's order allowing inspection of counterfoils of ballot papers for 310 voters prima facie impersonated is dismissed, upholding the High Court's finding of prima facie case based on witness evidence classified in lists A to G.",
    "relief_granted": null,
    "costs": "Dismissed with costs."
  },
  "key_quotes": [
    {
      "text": "\"Nothing could be clearer or more reasonable than this. Obviously, in this context proving meant proving prima facie, or there would not have any necessity of examining the counter-foils.\"",
      "speaker": "court",
      "significance": "Supreme Court in earlier appeal endorsing petitioner's inspection procedure."
    },
    {
      "text": "\"Secrecy of ballot is important, but doing justice is undoubtedly more important.\"",
      "speaker": "court",
      "significance": "Balances secrecy with justice in inspection matters."
    },
    {
      "text": "\"The High Court was of the view that the evidence of these witnesses, if unrebutted, would be sufficient to prove the allegation of impersonation.\"",
      "speaker": "court",
      "significance": "Justifies finding prima facie case for inspection."
    }
  ],
  "_case_id": "1974_349",
  "_label": 0,
  "_text_length": 12059,
  "_extracted_at": "2026-02-10T20:06:07.620781"
}