{
  "metadata": {
    "case_name": "Agricultural Officers from Madhya Pradesh region v. Agricultural Officers from Hyderabad region",
    "case_year": 1972,
    "court": "Supreme Court of India",
    "judges": [
      "Goswami, J."
    ],
    "case_number": "Civil Appeal No. 1227 of 1972",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Reorganisation of States on 1st November, 1956 under States Reorganisation Act, 1956.",
      "type": "background",
      "date": "1956-11-01",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Appellants and first nineteen respondents and respondents 22 to 24 are employees in the Agriculture Department of the State of Maharashtra following reorganisation.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Respondents 1 to 19 were officers from the former Hyderabad State prior to the States Reorganisation Act, 1956.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Respondents 1 to 19 filed Special Civil Application No. 1354 of 1970 under Article 226 in Bombay High Court praying for writ to set aside Bombay Government Resolutions of 17th February, 1958 and 16th May, 1969, provisional gradation list of 27th September, 1969, promotion orders of 5th and 6th June, 1970 and consequential reliefs.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "In SCA 1354/1970, respondents 1-19 impleaded State of Maharashtra, Director of Agriculture Maharashtra as respondents 1-2, and three Agricultural Officers as respondents 3-5 in representative capacity under Order 1 Rule 8 CPC.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Respondents 3 to 5 did not contest SCA 1354/1970 and alleged to be in collusion with appellants; State of Maharashtra and Director went by default, belated prayer for appearance rejected.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Bombay High Court disposed of SCA 1354/1970 ex parte on merits in favour of respondents 1-19 by judgment dated 9th December, 1971.",
      "type": "procedural",
      "date": "1971-12-09",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Order of Bombay HC directly affects interests of present appellants, who are Agricultural Officers from Madhya Pradesh region.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Appellant No. 1 and three other Agricultural Officers filed Special Civil Application No. 361 of 1964 at Nagpur Bench impleading State of Maharashtra and 88 others including respondents 1-19.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Nagpur Bench allowed SCA 361/1964 on 6th December, 1967, quashed Government resolution dated 9-9-1960, combined seniority list 22-8-1962, and absorption order dated 11.5.1962; directed opportunity for representations if altering equation basis of 17-2-1958.",
      "type": "procedural",
      "date": "1967-12-06",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Respondents 1-19 (Hyderabad officers) preferred appeal No. 1366 of 1968 against Nagpur Bench judgment; allowed withdrawal by Supreme Court on 23rd January, 1969 without prejudice, allowing representations to Government under section 115 of States Reorganisation Act.",
      "type": "procedural",
      "date": "1969-01-23",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "After SC order, many Agricultural Officers made representations to Government of India under section 115.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Government of Maharashtra passed Resolution dated 16th May, 1969 giving new equation of posts; gradation list made on 27th September, 1969; promotions on 5th and 6th June, 1970.",
      "type": "material",
      "date": "1969-05-16",
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Appellant and another filed Special Civil Application No. 1126 of 1971 at Nagpur Bench for quashing Resolution of 16th May, 1969; pending as of judgment.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f15",
      "text": "In SCA 1126/1971, respondents 1-19 served but did not file return; on 2nd February, 1972, Government Advocate mentioned Bombay HC decision.",
      "type": "procedural",
      "date": "1972-02-02",
      "source": "court"
    },
    {
      "id": "f16",
      "text": "Appellants first learned of impugned Bombay HC judgment via SCA 1126/1971; took steps in Bombay HC to set aside order and rehear but failed.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f17",
      "text": "Bombay HC operative order in SCA 1354/1970: made absolute rule with costs; directed State to decide equation within 3 months or automatically equate Hyderabad Agricultural Assistant Rs.176-300 with Bombay AO Grade I Rs.210-300 and absorb/fix seniority from 1.11.1956.",
      "type": "material",
      "date": "1971-12-09",
      "source": "court"
    },
    {
      "id": "f18",
      "text": "State of Maharashtra filed Civil Application No. 3261 of 1971 for permission to file affidavit and contest SCA 1354/1970; HC found sufficient cause for rehearing but rejected on merits.",
      "type": "procedural",
      "date": "1971-12-24",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether Bombay High Court Division Bench could sit in appeal against Nagpur Bench decision binding on respondents 1-19.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether violation of natural justice in disposing writ ex parte and not reviewing when sufficient cause shown.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether High Court should have allowed representative suit under Order 1 Rule 8 CPC and insisted on personal service in service matter.",
      "framed_by": "petitioner"
    },
    {
      "id": "i4",
      "text": "Whether Central Government was necessary party.",
      "framed_by": "respondent"
    },
    {
      "id": "i5",
      "text": "Authority to determine equation of posts, integration, gradation, seniority under States Reorganisation Act - role of Central Government vs State/High Court.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Division Bench of Bombay High Court could not sit in appeal against Division Bench decision of Nagpur Bench which is binding on respondents 1-19.",
      "supporting_facts": [
        "f9",
        "f10"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Clear violation of principles of natural justice in disposing writ ex parte and not reviewing order when sufficient cause shown by appellants.",
      "supporting_facts": [
        "f6",
        "f7",
        "f16",
        "f18"
      ],
      "legal_basis": "principles of natural justice"
    },
    {
      "id": "pa3",
      "text": "High Court should not have allowed application under Order 1 Rule 8 CPC and should have insisted on personal service of rule nisi on affected persons in service matter.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": "Order 1 Rule 8 CPC"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Central Government was a necessary party and petition should have been dismissed for non-joinder.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Central Government under section 115 of States Reorganisation Act has to determine principles for equation of posts, common gradation lists, ensure fair treatment and give opportunities for representations; High Court cannot direct State Government to perform Central Government's functions or fix time limit leading to automatic relief.",
      "addresses_issue": "i5",
      "key_observation": "High Court not right in directing State or fixing time limit; erroneous in view of Act provisions."
    },
    {
      "id": "cr2",
      "text": "High Court observed sufficient cause for rehearing but rejected; not right in not allowing opportunity to petitioners and State to contest, especially in representative writ where affected persons not impleaded.",
      "addresses_issue": "i2",
      "key_observation": "Sufficient cause for rehearing existed; opportunity must be given to all concerned."
    },
    {
      "id": "cr3",
      "text": "Guidelines in Part X States Reorganisation Act 1956 and Part VIII Bombay Reorganisation Act 1960; Government of India final authority for fair equitable treatment.",
      "addresses_issue": "i5",
      "key_observation": "Ensure proper consideration of representations."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "High Court cannot clothe itself with authority for functions of Central Government under the Act; cannot direct State or fix time limit for automatic entitlement.",
      "resolves_issue": "i5",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Set aside impugned judgment of Bombay High Court dated 9th December 1971; restore SCA 1354/1970 for disposal in accordance with law after opportunity to all parties; direct impleadment of Central Government, present appellants and other affected officers.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "D. Rajiah Raj Others v. Union of India others",
      "citation": "A.I.R. 1974 SC 457 / (1973) 1 SCC 61",
      "treatment": "referred",
      "relevance": "Central Government to determine equation of posts, gradation lists, ensure fair treatment and representations."
    },
    {
      "case_name": "N. Subba Rao etc. v. Union of India and Others",
      "citation": "(1972) 2 SCC 82",
      "treatment": "referred",
      "relevance": "Central Government to determine equation of posts, gradation lists, ensure fair treatment and representations."
    },
    {
      "case_name": "Union of India Anr. v. P. K. Roy Ors.",
      "citation": "1968 2 SCR 186",
      "treatment": "referred",
      "relevance": "Central Government to determine equation of posts, gradation lists, ensure fair treatment and representations."
    }
  ],
  "statutes_cited": [
    {
      "name": "States Reorganisation Act, 1956",
      "sections": [
        "Section 115",
        "Section 117"
      ],
      "relevance": "Central Government determines principles for equation of posts, integration, gradation lists, fair treatment, representations."
    },
    {
      "name": "Bombay Reorganisation Act, 1960",
      "sections": [
        "Section 81",
        "Section 83"
      ],
      "relevance": "Guidelines for division and integration of services among new States, fair treatment."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 226"
      ],
      "relevance": "Writ petition filed under."
    },
    {
      "name": "Code of Civil Procedure",
      "sections": [
        "Order 1 Rule 8"
      ],
      "relevance": "Representative capacity impleadment."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; impugned judgment and order of Bombay High Court dated 9th December 1971 set aside; Special Civil Application No. 1354 of 1970 restored for disposal in accordance with law after giving opportunity to all parties concerned; respondents 1 to 19 to implead Central Government, appellants and other affected officers.",
    "relief_granted": "Restoration of writ petition for rehearing with directions for impleadment.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The High Court cannot clothe upon itself the authority for performing the functions which are specifically and expressly intended to be the obligation and duty of the Central Government under the Act.",
      "speaker": "court",
      "significance": "Defines limits of High Court's jurisdiction vs Central Government's role under s115."
    },
    {
      "text": "We are not satisfied that the High Court was right in not allowing an opportunity to the petitioners as well as to the State to canvass their respective points of view before it against the writ application.",
      "speaker": "court",
      "significance": "Highlights violation of natural justice and need for rehearing."
    },
    {
      "text": "It is well settled that the Central Government under section 115 of the Act has to determine the principles governing equation of posts and prepare common gradation lists by integration of services and in doing so to ensure fair and equitable treatment to all persons concerned.",
      "speaker": "court",
      "significance": "Core principle on service integration post-reorganisation."
    }
  ],
  "_case_id": "1974_157",
  "_label": 1,
  "_text_length": 12015,
  "_extracted_at": "2026-02-10T20:04:58.740416"
}