{
  "metadata": {
    "case_name": "Appellant v. State of Andhra Pradesh",
    "case_year": 1968,
    "court": "Supreme Court of India",
    "judges": [
      "Justice Krishna Iyer"
    ],
    "case_number": "Civil Appeal No. 2025 of 1968",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Government of Andhra Pradesh acquired a large open area with some buildings thereon by Notification dated January 3, 1957 for constructing Income-tax and Central Excise Offices at Hyderabad.",
      "type": "material",
      "date": "1957-01-03",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Acquired land had a building with plinth area of 3,300 sq. yds. situated in an important area of Hyderabad City.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Terrain was uneven with difference in levels to the extent of 27 feet and boulders here and there making building operations expensive.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Collector awarded Rs. 41,674/- for buildings, Rs. 1,440/- for standing trees, Rs. 30,630/- for 50 ft. deep belt at Rs. 15/- per sq. yd., Rs. 99,435/- for remaining 13,258 sq. yds., total with solatium Rs. 1,99,155.85.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "City Civil Court enhanced compensation: area slightly less than Collector, building value nearly fourfold on multiple of 25 times rent, total Rs. 3,31,092/-",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "Andhra Pradesh High Court in C.C.C. Appeal No. 46 of 1963, judgment dated 18th October 1967: altered multiple to 27 for building, restored area acquired, total Rs. 3,52,326.65; awarded Rs. 20/- per sq. yd. for 2042 sq. yds. 50 ft. wide belt and Rs. 10/- per sq. yd. for rest; dismissed State's appeal.",
      "type": "procedural",
      "date": "1967-10-18",
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Appellant claimed potential for cinema house, factually disbelieved by courts below.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "Exhibit A-7 showed rate of interest on Government Securities around mid-1957 between 3% and 4%.",
      "type": "admitted",
      "date": "1957",
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "Belting method (higher value for 50 ft. wide strip adjoining road) adopted originally at instance of appellant before Collector.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Buildings acquired were over 30 years old.",
      "type": "background",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the quantum of compensation awarded by the High Court is adequate, particularly regarding potential value of land, capitalization multiple for building, and belting method.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether there is any substantial question of law warranting interference by Supreme Court.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Land acquired has precious potential value due to Hyderabad's historical development as a great city, not entered into judicial computation below.",
      "supporting_facts": [
        "f2"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Land and building together had a personality of its own with special value; methodology of breaking into buildings/lands and sub-dividing land by belting was wrong.",
      "supporting_facts": [
        "f2",
        "f3"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Capitalization multiple of 27 adopted by High Court inadequate; entitled to 33-1/2 times.",
      "supporting_facts": [
        "f5",
        "f6",
        "f8"
      ],
      "legal_basis": null
    },
    {
      "id": "pa4",
      "text": "Potential user for Cinema House.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "No substantial question of law of general importance; unable to disturb High Court's award which carefully considered all points, stretching in favour of appellant where warranted.",
      "addresses_issue": "i2",
      "key_observation": "High Court duly considered potential value, physical features, situation, comparable sale for Telephone Exchange half mile away."
    },
    {
      "id": "cr2",
      "text": "No evidence substantiating big potential value based on unique features.",
      "addresses_issue": "i1",
      "key_observation": "Rs. 20/- per sq. yd. for 50 ft. belt and Rs. 10/- for rest fair and reasonable."
    },
    {
      "id": "cr3",
      "text": "Belting principle correct for extensive city plot; higher value for road-adjoining strip; no general rule, local circumstances guide; appellant himself adopted it earlier to his benefit.",
      "addresses_issue": "i1",
      "key_observation": "Objection to belting not taken earlier."
    },
    {
      "id": "cr4",
      "text": "Multiple of 27 fair despite buildings over 30 years old; accepted 3-3/4% interest on gilt-edged securities (advantage to appellant) instead of 4%; appellant misread Ex. A-7.",
      "addresses_issue": "i1",
      "key_observation": "Valuation of rented portion correct."
    },
    {
      "id": "cr5",
      "text": "Cinema potential disbelieved below; cannot reopen. Well-established distinction between tiny plot and large area value considered.",
      "addresses_issue": "i1",
      "key_observation": "Uneven terrain, boulders make site preparation expensive."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "High Court's compensation assessment fair; no error in evaluation, capitalization multiple, or belting.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "No substantial question of law; appeal against concurrent findings deserves dismissal.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Mohini Mohan v. Province of Bengal",
      "citation": "A.I.R. 1951 Cal. 246",
      "treatment": "followed",
      "relevance": "Ruling on belting principle for differential valuation in city plots."
    },
    {
      "case_name": "Kunjukrishna v. State",
      "citation": null,
      "treatment": "referred",
      "relevance": "Principle with limitations on value of extensive plots vs. tiny plots."
    }
  ],
  "statutes_cited": [
    {
      "name": "Hyderabad Land Acquisition Act, 1309 Fasli (Act IX)",
      "sections": [],
      "relevance": "Governs acquisition proceedings; substantially resembles Central Land Acquisition Act."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 133(1)(a)"
      ],
      "relevance": "Certificate granted for appeal before recent amendment."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal dismissed with costs; High Court's award of Rs. 3,52,326.65 upheld as fair after escalation from Collector's Rs. 1,99,155.85 and Civil Court's Rs. 3,31,092/-; no interference warranted.",
    "relief_granted": null,
    "costs": "Dismissed with costs"
  },
  "key_quotes": [
    {
      "text": "Having regard to the physical features of the property, its situation in an important locality and the price paid for a small extent of level ground acquired for the Telephone Exchange which is at a distance of about half a mile from the property acquired, we hold that the compensation awarded by the Court below at Rs. 20/- per square yard for the 2042 square yards constituting the 50 wide belt and at Rs. 10/- per square yard for the rest is fair and reasonable.",
      "speaker": "court",
      "significance": "High Court's key finding on land value affirmed by Supreme Court."
    },
    {
      "text": "We are unable to discern any substantial question of law of general importance in counsel's submissions or the points outlined in the memorandum of appeal which merits the consideration of this Court.",
      "speaker": "court",
      "significance": "Basis for dismissing appeal."
    }
  ],
  "_case_id": "1974_246",
  "_label": 0,
  "_text_length": 8894,
  "_extracted_at": "2026-02-10T20:05:30.341876"
}