{
  "metadata": {
    "case_name": "Construction Contractors (Petitioners in Writ Petition Nos. 202/71 etc.) v. Union of India & Ors.",
    "case_year": 1970,
    "court": "Supreme Court of India",
    "judges": [
      "RAY, C.J."
    ],
    "case_number": "Writ Petition Nos. 202/413/71, 92, 320, 330, 375, 391, 509, 626-627/72 and 114, 315-316/73, and 1906/73",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Petitioners carry on the business of contractors for construction of roads, buildings, weigh bridges and dams.",
      "type": "background",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f2",
      "text": "The Contract Labour (Regulation and Abolition) Act, 1970 (the Act) requires contractors to take out licences and imposes certain duties and liabilities on the contractors.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Section 2(c) of the Act defines 'contractor' in relation to an establishment to mean a person who undertakes to produce a given result for the establishment, other than a mere supply of goods or articles of manufacture to such establishment, through contract labour or who supplies contract labour for any work of the establishment and includes a sub-contractor.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Establishment as defined in section 2(e) of the Act means any office or department of the Government or a local authority, or any place where any industry, trade, business, manufacture or occupation is carried on.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Principal employer as defined in section 2(g) of the Act means in relation to any office or department of the Government or a local authority, the head of that office or department; in a factory, the owner or occupier; in a mine, the owner or agent; in any other establishment, any person responsible for the supervision and control of the establishment.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Workman is defined in section 2(i) of the Act to mean any person employed in or in connection with the work of any establishment to do any skilled, semi-skilled or unskilled manual, supervisory, technical or clerical work for hire or reward.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Section 2(b) of the Act states that a workman shall be deemed to be employed as contract labour in or in connection with the work of an establishment, when he is hired in or in connection with such work by or through a contractor, with or without the knowledge of the principal employer.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Petitioners contend that they are not contractors within the definition of the Act because their work is not any part of the work of the principal employer nor is it the work in connection with the work of the establishment, and their work is normally not done in the premises of the establishment of the principal employer.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "Illustration by petitioners: If a banking company which carries on its business at Delhi employs petitioners to construct a building at Allahabad, the building to be constructed is not the work of the bank; the only work of the bank is banking work.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f10",
      "text": "The Act was passed to prevent the exploitation of contract labour and to introduce better conditions of work; it provides for regulation and abolition of contract labour.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Underlying policy of the Act is to abolish contract labour wherever possible and practicable, and where it cannot be abolished, to regulate working conditions to ensure payment of wages and provision of essential amenities.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Section 10 of the Act empowers the Government to prohibit employment of contract labour in any establishment after considering if the work is perennial or ordinarily done through regular workmen.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "The Bill was introduced in 1967 and passed in 1970.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Fees prescribed for registration, licence or renewal of licences; security deposit of Rs. 30/- per workman under Rule 24 of Central Rules.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f15",
      "text": "Provisions for canteens (Sections 16, Rules 40-56, Rule 25(2)(vi)), rest rooms (Section 17, Rule 41), latrines, urinals, drinking water (Sections 17-18).",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f16",
      "text": "Rule 25(2)(v)(a): Wages, conditions of service of contract labour same as direct employees for same/similar work; disagreement decided by Chief Labour Commissioner.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f17",
      "text": "Rule 25(2)(v)(b): In other cases, wages etc. specified by Chief Labour Commissioner having regard to similar employment.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f18",
      "text": "Section 14 provides for revocation/suspension of licence or forfeiture of security if holder fails without reasonable cause to comply with conditions or contravenes Act/Rules.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f19",
      "text": "Section 34: Central Government may make provisions not inconsistent with the Act to remove difficulties in giving effect to provisions.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f20",
      "text": "Section 28: Government appoints inspectors with powers to enter premises, examine records, seize documents if offence suspected.",
      "type": "material",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether petitioners are 'contractors' within the meaning of Section 2(c) of the Act, given that their construction work is not part of the principal employer's core work and not on its premises.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether the provisions of the Act and Rules are unconstitutional as unreasonable restrictions on trade under Article 19(1)(g), including application to pending contracts, fees as tax, impracticability of welfare provisions, forfeiture of security, etc.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether fees for licence/registration amount to tax beyond rule-making power.",
      "framed_by": "petitioner"
    },
    {
      "id": "i4",
      "text": "Whether provisions for canteens, rest rooms etc. are impracticable and unreasonable.",
      "framed_by": "petitioner"
    },
    {
      "id": "i5",
      "text": "Whether Rule 25(2)(v)(b) unreasonable for lack of appeal against Chief Labour Commissioner's decision on wages.",
      "framed_by": "petitioner"
    },
    {
      "id": "i6",
      "text": "Whether Section 14 forfeiture of security unconstitutional under Articles 14, 19(1)(f)/(g).",
      "framed_by": "petitioner"
    },
    {
      "id": "i7",
      "text": "Whether Section 34 amounts to excessive delegation.",
      "framed_by": "petitioner"
    },
    {
      "id": "i8",
      "text": "Whether Section 28 confers arbitrary power violative of Articles 14 and 15.",
      "framed_by": "intervener"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Petitioners are not contractors within Section 2(c) because their work is not part of or in connection with the work of the establishment (principal employer), e.g., construction for a bank is not banking work.",
      "supporting_facts": [
        "f1",
        "f8",
        "f9"
      ],
      "legal_basis": "Sections 2(b), 2(c), 2(e), 2(i)"
    },
    {
      "id": "pa2",
      "text": "Work of petitioners normally not done in premises of principal employer.",
      "supporting_facts": [
        "f1",
        "f8"
      ],
      "legal_basis": "Section 2(e)"
    },
    {
      "id": "pa3",
      "text": "Application of Act to pending construction work is unreasonable restriction under Article 19(1)(g).",
      "supporting_facts": [
        "f13"
      ],
      "legal_basis": "Article 19(1)(g)"
    },
    {
      "id": "pa4",
      "text": "Fees for registration/licence/renewal amount to tax, beyond rule-making power.",
      "supporting_facts": [
        "f14"
      ],
      "legal_basis": null
    },
    {
      "id": "pa5",
      "text": "Provisions for canteens, rest rooms, latrines etc. impracticable (e.g., in Bombay, road construction) and enormously expensive, unreasonable under Article 19(1)(g).",
      "supporting_facts": [
        "f15"
      ],
      "legal_basis": "Sections 16,17; Rules 40-56, 25(2)(vi), 41, 42, 43, 51; Article 19(1)(g)"
    },
    {
      "id": "pa6",
      "text": "Rule 25(2)(v)(b) unreasonable as no appeal against Chief Labour Commissioner's fixation of wages etc.",
      "supporting_facts": [
        "f16",
        "f17"
      ],
      "legal_basis": "Rule 25(2)(v)(b)"
    },
    {
      "id": "pa7",
      "text": "Section 14 forfeiture of security unconstitutional: arbitrary amount Rs.30/workman, no obligation to use for workmen, double penalty with s.24, no rational nexus, harsh on small contractors, forced interest-free loan; violates Arts 14,19(1)(f)/(g).",
      "supporting_facts": [
        "f14",
        "f18"
      ],
      "legal_basis": "Section 14; Rule 24; Articles 14, 19(1)(f), 19(1)(g)"
    },
    {
      "id": "pa8",
      "text": "Section 34 excessive delegation like in Jalan Trading case.",
      "supporting_facts": [
        "f19"
      ],
      "legal_basis": "Section 34"
    },
    {
      "id": "pa9",
      "text": "Contract labour by sub-contractors covered but direct employment by petitioners not, anomalous.",
      "supporting_facts": [
        "f1"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Provision for canteen capable of performance in city or desert; no impossibility proved.",
      "supporting_facts": [
        "f15"
      ],
      "legal_basis": "Rules 42, 43"
    },
    {
      "id": "ra2",
      "text": "Contractor can amend licence if more workmen needed.",
      "supporting_facts": [
        "f14"
      ],
      "legal_basis": "Section 14(1)(b)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Petitioners' contention unsound; when bank employs petitioners to construct building, petitioners are contractors undertaking to produce result through contract labour; construction is work of establishment even if away from usual premises; work site is part of establishment.",
      "addresses_issue": "i1",
      "key_observation": "Work of establishment includes construction for expansion; equates place of business with work erroneously."
    },
    {
      "id": "cr2",
      "text": "Act to prevent exploitation, regulate/abolish contract labour; policy to abolish where possible, regulate otherwise.",
      "addresses_issue": "i2",
      "key_observation": "Interests of workmen paramount; no unreasonableness."
    },
    {
      "id": "cr3",
      "text": "No retrospectivity; applies to contract labour not contracts; no materials show petitioners suffer; knew of legislation since 1967.",
      "addresses_issue": "i2",
      "key_observation": "Pendency of contract irrelevant."
    },
    {
      "id": "cr4",
      "text": "Fees not tax; for services of registration/licensing; guidelines for licences; appeals under s.15.",
      "addresses_issue": "i3",
      "key_observation": "No arbitrary power."
    },
    {
      "id": "cr5",
      "text": "Welfare provisions (canteens etc.) reasonable, practicable; legislature determines needs; rational to object.",
      "addresses_issue": "i4",
      "key_observation": "No proof of impossibility; contractor devises means."
    },
    {
      "id": "cr6",
      "text": "Rule 25(2)(v)(b) reasonable; Commissioner has expertise, hears parties, follows standards of similar employment; no need for appeal as quick decision needed.",
      "addresses_issue": "i5",
      "key_observation": "Absence of appeal not fatal."
    },
    {
      "id": "cr7",
      "text": "Forfeiture under s.14 valid departmental penalty after show cause; for due performance or contravention; appealable; Rs.30 rational per workman; no double jeopardy as administrative not criminal.",
      "addresses_issue": "i6",
      "key_observation": "Security utilisable for obligations; not loan."
    },
    {
      "id": "cr8",
      "text": "S.34 not excessive delegation; no finality/alteration; for implementation difficulties only; unlike Jalan Trading.",
      "addresses_issue": "i7",
      "key_observation": "Internal administrative."
    },
    {
      "id": "cr9",
      "text": "S.28 not raised by petitioners; intervener cannot raise new points.",
      "addresses_issue": "i8",
      "key_observation": "No pleadings."
    },
    {
      "id": "cr10",
      "text": "Act construed as whole; applies to sub-contractors too; work site is establishment.",
      "addresses_issue": "i1",
      "key_observation": "No anomaly."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Petitioners are contractors within the meaning of the Act; construction work is work of the establishment.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Provisions of Act and Rules constitutional; no unreasonable restriction under Art 19(1)(g), no violation of Art 14; fees not tax; welfare provisions reasonable/practicable; forfeiture valid; no excessive delegation.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Jalan Trading Co. v. Mazdoor Union",
      "citation": "1967 1 S.C.R. 15",
      "treatment": "distinguished",
      "relevance": "Section 37 there had finality and alteration power, amounting to delegation; unlike s.34 here."
    }
  ],
  "statutes_cited": [
    {
      "name": "Contract Labour (Regulation and Abolition) Act, 1970",
      "sections": [
        "2(b)",
        "2(c)",
        "2(e)",
        "2(g)",
        "2(i)",
        "10",
        "12",
        "14",
        "15",
        "16",
        "17",
        "18",
        "20",
        "23",
        "24",
        "26",
        "28",
        "34"
      ],
      "relevance": "Definitions, licensing, welfare amenities, prohibition, penalties, inspectors, removal of difficulties; all upheld as valid."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "14",
        "19(1)(g)",
        "32"
      ],
      "relevance": "No violation; petitions under Art 32 challenging on Arts 14,19."
    },
    {
      "name": "Factories Act, 1948",
      "sections": [],
      "relevance": "Referenced in definition of principal employer."
    },
    {
      "name": "Minimum Wages Act",
      "sections": [],
      "relevance": "Wages not less than prescribed under it (licence condition)."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Court dismissed all writ petitions challenging the validity of the Contract Labour (Regulation and Abolition) Act, 1970 and related rules, holding petitioners to be contractors within the Act, and all impugned provisions constitutional.",
    "relief_granted": "None",
    "costs": "Parties will pay and bear their own costs."
  },
  "key_quotes": [
    {
      "text": "The Act was passed to prevent the exploitation of contract labour and also to introduce better conditions of work.",
      "speaker": "court",
      "significance": "States purpose and policy of the Act."
    },
    {
      "text": "The underlying policy of the Act is to abolish contract labour, wherever possible and practicable, and where it cannot be abolished altogether, the policy of the Act is that the working conditions of the contract labour should be so regulated...",
      "speaker": "court",
      "significance": "Explains dominant intent: abolition where possible, regulation otherwise."
    },
    {
      "text": "The construction of the building is the work of the establishment. The building is the property of the establishment.",
      "speaker": "court",
      "significance": "Key holding on scope of 'work of establishment' including construction sites."
    },
    {
      "text": "There is no unreasonableness in the measure. The interests of the workmen are remedied by the objects of the Act.",
      "speaker": "court",
      "significance": "Justifies application to pending works under Art 19(1)(g)."
    }
  ],
  "_case_id": "1974_77",
  "_label": 0,
  "_text_length": 33655,
  "_extracted_at": "2026-02-10T20:03:34.553277"
}