{
  "metadata": {
    "case_name": "Assessee v. Revenue",
    "case_year": 1970,
    "court": "Supreme Court of India",
    "judges": [
      "KHANNA, J."
    ],
    "case_number": "Civil Appeals Nos. 1275 to 1277 of 1970",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The assessee during the relevant period was studying abroad. He derived income during that period by way of dividend on shares and interest from deposits.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The original assessments for the relevant years were completed on January 31, 1956, December 27, 1956 and February 28, 1958. The residential status adopted in those years was resident and ordinarily resident person. Income-tax and supertax were calculated at the rates applicable on the total income.",
      "type": "procedural",
      "date": "1956-01-31",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "In the course of the assessment proceedings for the assessment year 1958-59, corresponding to the year ending on December 31, 1957, the assessee filed a declaration under section 17(1) of the Act on March 24, 1959 claiming to be assessed at rates appropriate to the total world income.",
      "type": "procedural",
      "date": "1959-03-24",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "This assessment was completed on March 23, 1960 in the status of a non-resident. The application under section 17(1) was rejected.",
      "type": "procedural",
      "date": "1960-03-23",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "As the income-tax officer found that the assessee was a non-resident in the three previous years ending on December 31, 1954 to December 31, 1956 and his total income had been assessed to income-tax at the normal rates and further as he had failed to make the requisite declaration under section 17(1) within the requisite time, the income-tax officer formed the view that the earlier assessments had been made at a lower rate.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Action under section 34 of the Act was accordingly taken by the income-tax officer and assessments for the above mentioned three years were reopened and completed under section 23(3) read with section 34 of the Act. The status of the assessee was treated as that of a non-resident. The assessee's declaration under section 17(1), which he had made in the course of assessment proceedings for the assessment year 1958-59, was rejected and ignored and his total income was brought to tax at the maximum rates.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "The assessee in the course of the proceedings for reassessment requested that the income during the three years in question should be taxed at rates appropriate to his world income. According to the assessee, the omission on his part to make the declaration earlier under section 17(1) was due to inadvertence and ignorance.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "It was also contended that as the assessments were being reopened and were thus deemed to be pending for the earlier years, the assessee's declaration made during the assessment proceedings for the year 1958-59 should be taken into account for the purpose of reassessments.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "The income-tax officer rejected all the submissions.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "The assessee went up in appeal to the Appellate Assistant Commissioner.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "The Appellate Assistant Commissioner held that the income-tax officer's reasoning for not accepting the declaration under section 17(1) was not correct. He referred to his order in the appeal by the assessee for the assessment year 1958-59 wherein he had held that the assessee had sufficient cause for not filing the declaration under section 17(1) when the assessee became first assessable and that the failure to file the declaration had not resulted in a reduction of tax liability.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "The declaration filed on March 24, 1959 by the assessee, in the opinion of the Appellate Assistant Commissioner, could be availed of for the assessments for the three years in question as the assessment orders consequent upon the reopening of assessments were being made subsequent to that date.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "The department went up in appeal to the Income-tax Appellate Tribunal against the order of the Appellate Assistant Commissioner. The Tribunal accepted the reasoning of the Appellate Assistant Commissioner and dismissed the appeal.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "On being moved by the Commissioner of Income-tax the Tribunal referred the question to the High Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f15",
      "text": "The High Court answered the question against the assessee and in favour of the revenue on May 2, 1969.",
      "type": "procedural",
      "date": "1969-05-02",
      "source": "lower_court"
    },
    {
      "id": "f16",
      "text": "These three appeals by certificate are directed against the judgment of the Madras High Court in T.C. No. 41 of 1966.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the declaration filed by the assessee under section 17(1) in respect of the assessment year 1958-59 was operative in relation to the reassessments in respect of the previous years ending on 31-12-1954, 31-12-1955 and 31-12-1956 corresponding to the assessment years 1955-56, 1956-57 and 1957-58.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The declaration under section 17(1) made in the course of assessment proceedings for 1958-59 should be taken into account for the purpose of reassessments as the assessments were being reopened and were thus deemed to be pending for the earlier years.",
      "supporting_facts": [
        "f7",
        "f8"
      ],
      "legal_basis": "Section 17(1) of the Indian Income-tax Act, 1922"
    },
    {
      "id": "pa2",
      "text": "The omission to make the declaration earlier was due to inadvertence and ignorance.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "The declaration could be accepted even later provided sufficient cause was shown for not filing the declaration earlier.",
      "supporting_facts": [
        "f10"
      ],
      "legal_basis": "Section 17(1)"
    },
    {
      "id": "pa4",
      "text": "The assessment as non-resident was made for the first time in respect of assessment year 1958-59 and as section 34 proceedings were fresh proceedings the declaration made in 1958-59 ought to be accepted.",
      "supporting_facts": [
        "f3",
        "f6"
      ],
      "legal_basis": "Section 17(1), Section 34"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Option had been exercised by the assessee after the prescribed date and it could not have effect on the assessments for the three years in question.",
      "supporting_facts": [
        "f5",
        "f6"
      ],
      "legal_basis": "Section 17(1), first proviso to section 17(1)"
    },
    {
      "id": "ra2",
      "text": "The declaration could be entertained only on the first occasion on which the assessee became assessable. The second proviso would also not avail the assessee.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": "First and second provisos to section 17(1)"
    },
    {
      "id": "ra3",
      "text": "The expression 'all assessments thereafter' in the two provisos to section 17(1) showed that the declaration could be availed of in respect of assessments for subsequent years and not in respect of assessments made by the revenue in exercise of its power under section 34 of the Act. The word 'assessments' referred to only original assessments and not to assessments made under section 34.",
      "supporting_facts": [
        "f15"
      ],
      "legal_basis": "Section 17(1), Section 34"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The words of the second proviso to section 17(1) make it clear that the declaration would be operative not only for the assessment for the year in which the declaration is made if such assessment had not been completed before such declaration, but also for all assessments to be made thereafter. The words 'all assessments thereafter' signify not only assessments for the subsequent years but would also cover assessments for the earlier years in case the assessments for those earlier years are being made subsequent to the filing of the declaration.",
      "addresses_issue": "i1",
      "key_observation": "The words 'all assessments thereafter' have a wide amplitude and include within their ambit all assessments made subsequent to the filing of the declaration."
    },
    {
      "id": "cr2",
      "text": "We are unable to subscribe to the view taken by the High Court that the assessments referred to in the words reproduced above mean only the original assessments and not the reassessments made under section 34 of the Act. According to section 28 of the Income-tax Act, 1961 the words 'assessment' includes reassessment. Although such a definition was not there in the Act of 1922, the word assessment in the second proviso to section 17(1) of the Act must necessarily cover reassessment under section 34 of the Act.",
      "addresses_issue": "i1",
      "key_observation": "In the context of section 17(1) of the Act the word assessment must necessarily include reassessment under section 34 of the Act."
    },
    {
      "id": "cr3",
      "text": "To hold otherwise would result in an anomalous situation. An assessee files a declaration under section 17(1) in respect of 1955-56. Supposing his assessment for 1956-57 is reopened, the declaration would have to be excluded from consideration in making the reassessment for 1956-57 even though filed earlier. This could hardly have been the intention of the legislature.",
      "addresses_issue": "i1",
      "key_observation": "The entire scheme of section 17(1) clearly shows that the word assessment has been used in a comprehensive sense so as to include reassessment."
    },
    {
      "id": "cr4",
      "text": "There are indications in the Act that whenever the legislature intended that the word assessment should not include reassessment, it used express words for the purpose, e.g., section 33B(2), section 67.",
      "addresses_issue": "i1",
      "key_observation": "The fact that the legislature has used the word 'assessments' and not 'reassessments' in the second proviso to section 17(1) would not exclude the applicability of that proviso to cases of reassessments subsequent to the filing of the declaration."
    },
    {
      "id": "cr5",
      "text": "If assessment does not include reassessment under section 34, the benefit of the declaration would be available only in cases of escaped assessment and not in cases of under-assessment or excessive relief, which would be anomalous.",
      "addresses_issue": "i1",
      "key_observation": "This could hardly have been the intention of the legislature."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The declaration under section 17(1) filed on March 24, 1959 in the course of assessment proceedings for 1958-59 is operative for the reassessments of 1955-56, 1956-57 and 1957-58 made subsequent to that date.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "A. N. Lakshman Shenoy v. Income-tax Officer, Bangalore Ors.",
      "citation": "1958 34 ITR 275",
      "treatment": "followed",
      "relevance": "Held that the word 'assessment' in the Finance Act, 1950 would include reassessment. The collocation of the words 'levy, assessment and collection' showed comprehensive meaning."
    },
    {
      "case_name": "Commissioner of Income-tax v. Khemchand Ramdas",
      "citation": "1938 6 ITR 414",
      "treatment": "distinguished",
      "relevance": "Distinguished in Shenoy's case; observations do not support that 'assessment' must always bear a particular meaning."
    },
    {
      "case_name": "Commissioner for General Purposes of Income Tax for the City of London v. Gibbs and Others",
      "citation": "1942 A.C. 402, 406",
      "treatment": "referred",
      "relevance": "Lord Simon pointed out that 'assessment' is used in more than one sense in English Income Tax Code."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act, 1922",
      "sections": [
        "Section 17(1)",
        "Section 34",
        "Section 23(3)",
        "Section 66(1)",
        "Section 33B",
        "Section 67"
      ],
      "relevance": "Declaration under s.17(1) operative for reassessments under s.34 if made before reassessment orders; 'all assessments thereafter' includes reassessments."
    },
    {
      "name": "Income-tax Act, 1961",
      "sections": [
        "Section 28"
      ],
      "relevance": "'Assessment' includes reassessment."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "The Supreme Court accepted the appeals, set aside the judgment of the Madras High Court, and answered the referred question in the affirmative in favour of the assessee-appellant and against the revenue.",
    "relief_granted": "Declaration under section 17(1) held operative for the reassessments; assessee entitled to costs in this Court and High Court.",
    "costs": "The assessee appellant shall be entitled to his costs both in this Court as well as in the High Court."
  },
  "key_quotes": [
    {
      "text": "The words 'all assessments thereafter' have a wide amplitude and we see no cogent reason for not giving them their natural meaning or for restricting their scope.",
      "speaker": "court",
      "significance": "Core interpretation allowing declaration to apply to reassessments."
    },
    {
      "text": "In the context of section 17(1) of the Act the word assessment must necessarily include reassessment under section 34 of the Act.",
      "speaker": "court",
      "significance": "Rejects High Court's narrow view of 'assessment'."
    },
    {
      "text": "To hold otherwise would result in an anomalous situation.",
      "speaker": "court",
      "significance": "Illustrates absurdity of excluding reassessments from declaration's effect."
    }
  ],
  "_case_id": "1974_429",
  "_label": 1,
  "_text_length": 17844,
  "_extracted_at": "2026-02-10T20:06:54.017953"
}