{
  "metadata": {
    "case_name": "Dealers in State of Mysore v. State of Mysore",
    "case_year": 1973,
    "court": "Supreme Court of India",
    "judges": [
      "Alagiriswami, J."
    ],
    "case_number": "Civil Appeal Nos. 514 of 1970; 166 to 173 of 1973; 181 to 243 of 1973; 2078 of 1970",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "A number of dealers in the State of Mysore (now Karnataka) filed writ petitions questioning the levy of sales tax under the Central Sales Tax Act on certain inter-State sales of declared goods.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The goods were all declared goods and under the Mysore Sales Tax Act they were taxable at the point of purchase at a single point.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The assessment periods are prior to 10th November, 1964.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The assessing authorities assessed all these transactions of inter-State sales to tax.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "This Court delivered its judgment in Yaddalam's Case (16 STC 231) holding that where a certain transaction was not liable to sales tax if it were an intra-state sale under the Sales Tax Law of the appropriate State, it would not be liable to sales tax if it were an inter-State sale.",
      "type": "material",
      "date": "1964-11-10",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Following Yaddalam's Case, the assessment orders were rectified giving effect to the judgment.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Sub-section (1A) was inserted in section 6 and a consequential amendment was made in sub-section (2A) of section 8 of the Central Sales Tax Act.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "After the amendment, the assessing authorities again rectified the assessment orders and brought to tax the inter-State sales.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "The Mysore High Court dismissed the batch of writ petitions.",
      "type": "procedural",
      "date": "1969-12-22",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Judgments and orders of Mysore High Court dated 22nd December 1969, 15th October 1970, and 25th May 1970 in various W.Ps.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Validity of section 8(2)(a) as well as section 6(1A) of the Central Sales Tax Act read with section 10 of the Central Sales Tax Amendment Act, 1969.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether even after the amendment these transactions are not liable to sales tax.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether there was mistake apparent on the face of the record to justify rectification under Rule 38 of the Mysore Sales Tax Rules.",
      "framed_by": "petitioner"
    },
    {
      "id": "i4",
      "text": "Whether rectification is beyond the permitted period.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Section 8(2)(a) is unconstitutional based on decision in G. Rayon Silk Mfg. Wvg. Co. Ltd. v. Asst. Commr., alleging excessive delegation of legislative power.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "G. Rayon Silk Mfg. Wvg. Co. Ltd. v. Asst. Commr.; Article 14"
    },
    {
      "id": "pa2",
      "text": "The rate applicable under section 8(2)(a) is the rate prevalent when the section was enacted, not any subsequent variation.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "Section 8(2)(a) Central Sales Tax Act"
    },
    {
      "id": "pa3",
      "text": "Sub-section (1A) of section 6 violates Article 14 in view of section 10 of the Central Sales Tax Amendment Act, 1969, which exempts certain periods but discriminates against earlier periods.",
      "supporting_facts": [
        "f5",
        "f7"
      ],
      "legal_basis": "Section 6(1A), Section 10 Central Sales Tax Amendment Act 1969; Article 14"
    },
    {
      "id": "pa4",
      "text": "Sub-section (2A) of section 8 has the effect of impliedly repealing sub-section (1A) of section 6.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "Section 6(1A), Section 8(2A) Central Sales Tax Act"
    },
    {
      "id": "pa5",
      "text": "No mistake apparent on the face of the record to justify rectification under Rule 38 of Mysore Sales Tax Rules, especially given prior High Court and Supreme Court decisions.",
      "supporting_facts": [
        "f6",
        "f8"
      ],
      "legal_basis": "Rule 38 Mysore Sales Tax Rules; Mysore Silk House v. State of Mysore; Pierce Leslie Co. v. State of Mysore; Yaddalam's Case"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The decision in G. Rayon Silk actually supports the validity of section 8(2)(a) and (2)(b), as it upholds the legislative policy to prevent evasion.",
      "supporting_facts": [],
      "legal_basis": "G. Rayon Silk Mfg. Wvg. Co. Ltd. v. Asst. Commr."
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Section 8(2)(b) upheld in G. Rayon Silk; similar policy applies to section 8(2)(a) to prevent evasion and discrimination; Parliament has laid down clear legislative policy by adopting higher of 10% or state rate.",
      "addresses_issue": "i1",
      "key_observation": "The adoption of the rate of local sales tax for Central sales tax does not abdicate legislative function."
    },
    {
      "id": "cr2",
      "text": "Rate applicable under section 8(2)(a) means the rate at the relevant point of time, consistent with scheme of Central Sales Tax Act adopting state machinery and rates.",
      "addresses_issue": "i1",
      "key_observation": "Interpretation ensures no discrimination between intra-state and inter-State sales."
    },
    {
      "id": "cr3",
      "text": "Concession under section 10 is not a matter of right; no discrimination under Article 14 as Legislature can grant concessions without extending to all.",
      "addresses_issue": "i3",
      "key_observation": "Court cannot direct similar concessions or legislate."
    },
    {
      "id": "cr4",
      "text": "No implied repeal; sections 6(1A) and 8(2A) read together: inter-State sales taxable if intra-state sales taxable at any point (sale or purchase).",
      "addresses_issue": "i1",
      "key_observation": "Exempt only if wholly exempt under state law."
    },
    {
      "id": "cr5",
      "text": "Error apparent on record post-Amendment Act 1969 and Joseph's case; authorities entitled to rectify earlier orders made pursuant to Yaddalam's case.",
      "addresses_issue": "i3",
      "key_observation": "Amendment supersedes Yaddalam's case."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Sections 6(1A), 8(2)(a), and 8(2A) valid; no unconstitutional delegation; rate applicable at relevant time.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "No violation of Article 14 by section 10.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Inter-State sales liable to tax if intra-state sales taxable at point of purchase or sale.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h4",
      "text": "Rectification orders valid; mistake apparent post-amendment.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Yaddalam's Case",
      "citation": "16 STC 231",
      "treatment": "superseded",
      "relevance": "Held inter-State sales not taxable if not taxable as intra-state; amendment to overcome this."
    },
    {
      "case_name": "G. Rayon Silk Mfg. Wvg. Co. Ltd. v. Asst. Commr.",
      "citation": "33 STC 219",
      "treatment": "followed",
      "relevance": "Upholds section 8(2)(b); similar reasoning for 8(2)(a); no excessive delegation."
    },
    {
      "case_name": "Joseph's Case",
      "citation": null,
      "treatment": "followed",
      "relevance": "Effect of Central Sales Tax Amendment Act 1969 supersedes Yaddalam's case."
    },
    {
      "case_name": "Mysore Silk House v. State of Mysore",
      "citation": null,
      "treatment": "referred",
      "relevance": "Mysore High Court held inter-State transactions not liable."
    },
    {
      "case_name": "Pierce Leslie Co. v. State of Mysore",
      "citation": "SRTP No. 63-64 of 1963",
      "treatment": "referred",
      "relevance": "Mysore High Court held inter-State transactions not liable."
    },
    {
      "case_name": "State of Tamil Nadu v. Sitalakshmi Mills Ltd.",
      "citation": "33 STC 200 (SC)",
      "treatment": "referred",
      "relevance": "Objectives of adopting state rates to check evasion and prevent discrimination."
    }
  ],
  "statutes_cited": [
    {
      "name": "Central Sales Tax Act",
      "sections": [
        "Section 6(1A)",
        "Section 8(2)(a)",
        "Section 8(2)(b)",
        "Section 8(2A)",
        "Section 8(3)",
        "Section 9(2)"
      ],
      "relevance": "Levy on inter-State sales of declared goods at state rate if taxable intra-state; adopts state machinery."
    },
    {
      "name": "Central Sales Tax (Amendment) Act, 1969",
      "sections": [
        "Section 10"
      ],
      "relevance": "Exempts liability for certain periods if no tax collected; validates levy post-amendment."
    },
    {
      "name": "Mysore Sales Tax Act",
      "sections": [],
      "relevance": "Declared goods taxable at point of purchase single point."
    },
    {
      "name": "Mysore Sales Tax Rules",
      "sections": [
        "Rule 38"
      ],
      "relevance": "Rectification of apparent errors."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court dismissed the appeals, upholding the Mysore High Court's dismissal of writ petitions, validating the amendments to the Central Sales Tax Act, the levy on inter-State sales of declared goods taxable at purchase point under state law, and the rectification orders.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"The policy of the law in this respect is that in case the rate of local sales tax be less than 10 per cent... the dealer... should pay Central sales tax at the rate of 10 per cent. If... more than 10 per cent... the rate of Central sales tax shall also be the same.\"",
      "speaker": "court",
      "significance": "Explains legislative policy behind adopting state rates to prevent evasion."
    },
    {
      "text": "\"A concession is not a matter of right. Where the Legislature... gives them a certain concession it does not mean that action is bad as another set of tax-payers... may not have been given a similar concession.\"",
      "speaker": "court",
      "significance": "Rejects Article 14 challenge to section 10."
    },
    {
      "text": "\"Reading section 6(1A) and section 8(2A) together... where the intra-state sales of certain goods are liable to tax, even though only at one point... a subsequent inter-State sale... is liable to tax.\"",
      "speaker": "court",
      "significance": "Harmonizes sections; upholds taxability."
    }
  ],
  "_case_id": "1974_271",
  "_label": 0,
  "_text_length": 26583,
  "_extracted_at": "2026-02-10T20:05:38.269053"
}