{
  "metadata": {
    "case_name": "Shaik Hanif & Ors. v. State of West Bengal",
    "case_year": 1973,
    "court": "Supreme Court of India",
    "judges": [
      "Sarkaria J."
    ],
    "case_number": "Writ Petition Nos. 1679, 1662 and 1681 of 1973",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Petitioner Shaik Hanif, aged 40 years, arrested on February 23, 1973 in pursuance of detention order dated February 19, 1973 passed by District Magistrate, West Dinajpur under s.3(1) read with s.3(2) of Maintenance of Internal Security Act, 1971.",
      "type": "procedural",
      "date": "1973-02-23",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "District Magistrate reported detention to State Government on February 19, 1973; approved on March 1, 1973.",
      "type": "procedural",
      "date": "1973-02-19",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Detenu made representation rejected by State Government on April 5, 1973 and forwarded to Advisory Board.",
      "type": "procedural",
      "date": "1973-04-05",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Advisory Board reported on April 24, 1973 that there was sufficient cause for detention.",
      "type": "procedural",
      "date": "1973-04-24",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Government confirmed order under s.12 of the Act directing detention to continue till 12 months from detention date or expiry of Defence of India Rules, 1971 whichever later.",
      "type": "procedural",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Grounds of detention: On 3-7-72 at dead of night, petitioner along with associates concealed 20 bundles of Telegraph copper wire weighing 2 qtls. 60 kgs. in court-yard under earth to dispose later; recovered on basis of confession of associates; petitioner evaded arrest; disrupted telegraph facilities.",
      "type": "material",
      "date": "1972-07-03",
      "source": "detention_order"
    },
    {
      "id": "f7",
      "text": "Counter-affidavit by Shri Sukumar Sen, Deputy Secretary, Home (Special) Dept., West Bengal; District Magistrate transferred and not available.",
      "type": "procedural",
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "Records show reliable information of illegal anti-social prejudicial activities of detenu relating to maintenance of supplies and services; petitioner is veteran copper wire stealer; on 3-7-72 concealed 20 bundles underground in house court-yard.",
      "type": "background",
      "date": "1972-07-03",
      "source": "respondent"
    },
    {
      "id": "f9",
      "text": "Criminal Biography mentions petitioner organised gang to steal telegraph copper wire systematically.",
      "type": "disputed",
      "source": "respondent"
    },
    {
      "id": "f10",
      "text": "For WP 1662/1973: Petitioner Gudma Majhi; detention order by DM Burdwan on reliable information; veteran copper wire stealer; instances of theft of electric copper wire on November 6, 1971 and November 25, 1971 communicated.",
      "type": "material",
      "date": "1971-11-06",
      "source": "detention_order"
    },
    {
      "id": "f11",
      "text": "History Sheet: On November 3, 1973, theft of electric copper wire 125 ft. from poles near Hatgarui; case u/s 379 IPC at Asansol PS; from boyhood mixed with anti-socials, wagon-breakers, thefts of iron, copper wire etc.",
      "type": "background",
      "date": "1973-11-03",
      "source": "respondent"
    },
    {
      "id": "f12",
      "text": "For WP 1681/1973: Petitioner Kamal Saha; ground: On 10-12-1972 at 19-30 hrs. with associates armed with daggers robbed bundle of 90 woollen shawls worth Rs.9500/- from Golam Kadar Kashmiri in 2nd class compartment of 162 Dn. train at New Barrackpore RS; 44 pieces recovered; caused panic, disturbed public order.",
      "type": "material",
      "date": "1972-12-10",
      "source": "detention_order"
    },
    {
      "id": "f13",
      "text": "Petitioner veteran railway criminal indulging in robbery in running suburban trains; organised gang in Sealdah-Bongaon section; desperate gang with deadly weapons; past instances January 30, 1972 and August 1, 1972.",
      "type": "background",
      "source": "respondent"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether counter-affidavit by Deputy Secretary instead of detaining District Magistrate vitiates detention as passed casually without application of mind.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether non-disclosure of reliable information/material (beyond solitary ground) describing detenu as veteran copper wire stealer violates Art.22(5) as detenu unable to make effective representation.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether provisions of MISA (ss.3,8,11,12) violate Arts.19 and 21; no objective determination, no natural justice in representation consideration, Board can use undisclosed material.",
      "framed_by": "petitioner"
    },
    {
      "id": "i4",
      "text": "Whether continuance of Emergency under Art.352 unconstitutional as suspends fundamental rights indefinitely; no objective facts for proclamation post-war.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "After Rule Nisi, State must produce affidavit of District Magistrate who passed order; Deputy Secretary's affidavit not substitute; omission shows casual detention without application of mind.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "Art.22(5)"
    },
    {
      "id": "pa2",
      "text": "Reliable information/material beyond solitary ground not disclosed to detenu; not justified under Art.22(6); unable to make effective representation.",
      "supporting_facts": [
        "f8",
        "f9"
      ],
      "legal_basis": "Art.22(5)"
    },
    {
      "id": "pa3",
      "text": "MISA ss.3,8,11,12 violate Arts.19,21: no objective determination of allegations; no impartial consideration of representation; Board/Govt. use undisclosed material without opportunity to rebut.",
      "supporting_facts": [],
      "legal_basis": "Arts.19,21; MISA ss.3,8,11,12"
    },
    {
      "id": "pa4",
      "text": "Emergency continuance unconstitutional; suspends rights indefinitely; President must act on objective facts; war ended over two years ago.",
      "supporting_facts": [],
      "legal_basis": "Arts.352,368,19"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Detention based on reliable information of anti-social prejudicial activities; detenu veteran copper wire stealer; solitary incident communicated but history shows pattern.",
      "supporting_facts": [
        "f8",
        "f9",
        "f11",
        "f13"
      ],
      "legal_basis": "MISA s.3"
    },
    {
      "id": "ra2",
      "text": "Counter-affidavit by Deputy Secretary in charge of detention records sufficient as DM transferred.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Counter-affidavit by Deputy Secretary improper but not fatal alone; should be by detaining authority or officer who processed case; here explanation unsatisfactory but mere omission not vitiate.",
      "addresses_issue": "i1",
      "key_observation": "Impropriety, circumstance to consider with others."
    },
    {
      "id": "cr2",
      "text": "All material particulars necessary for effective representation not communicated; 'veteran copper wire stealer' implies repetitive acts based on undisclosed reliable information/criminal biography/history sheet; no Art.22(6) privilege claimed; violates Art.22(5).",
      "addresses_issue": "i2",
      "key_observation": "Impugned order violative of Art.22(5), liable to be quashed."
    },
    {
      "id": "cr3",
      "text": "Not necessary to decide other contentions including constitutionality of MISA provisions and Emergency continuance in view of finding on Art.22(5).",
      "addresses_issue": "i3",
      "key_observation": "Same violation in all three cases due to vagueness/non-communication."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Detention orders violative of Art.22(5) as material facts not communicated enabling effective representation.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Natarajan Singh v. State of Madhya Pradesh",
      "citation": "A.I.R. 1972 S.C. 2215",
      "treatment": "followed",
      "relevance": "State must satisfy court on legality via affidavit of detaining authority post Rule Nisi."
    },
    {
      "case_name": "Ranjit Dam v. State of West Bengal",
      "citation": "A.I.R. 1972 S.C. 1753",
      "treatment": "followed",
      "relevance": "Transfer/promotion not satisfactory reason for not filing affidavit by detaining Magistrate."
    },
    {
      "case_name": "J.N. Roy v. State of West Bengal",
      "citation": "A.I.R. 1972 S.C. 2143",
      "treatment": "distinguished",
      "relevance": "Secretariat official's affidavit accepted where nothing turned on it; here failure is impropriety."
    }
  ],
  "statutes_cited": [
    {
      "name": "Maintenance of Internal Security Act, 1971",
      "sections": [
        "s.3(1)",
        "s.3(2)",
        "s.8(1)",
        "s.11",
        "s.12"
      ],
      "relevance": "Detention order passed under; confirmation by govt.; procedural safeguards including representation and Advisory Board."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art.32",
        "Art.22(5)",
        "Art.22(6)",
        "Art.19",
        "Art.21",
        "Art.352",
        "Art.368",
        "Art.166"
      ],
      "relevance": "Writ of habeas corpus; right to representation; non-disclosure privilege; challenged provisions and Emergency."
    },
    {
      "name": "Defence of India Rules, 1971",
      "sections": [],
      "relevance": "Detention till expiry or 12 months whichever later."
    },
    {
      "name": "Indian Penal Code",
      "sections": [
        "s.379"
      ],
      "relevance": "Case registered for theft."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "All three writ petitions allowed; detentions held illegal due to violation of Art.22(5); petitioners directed to be set at liberty forthwith.",
    "relief_granted": "Release from detention forthwith.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The impugned order of detention is thus violative of Article 22(5) of the Constitution, and is liable to be quashed on that score alone.",
      "speaker": "court",
      "significance": "Core holding quashing detention."
    },
    {
      "text": "It is the duty of the court to see that the efficacy of the limited yet crucial, safeguards provided in the law of preventive detention is not lost in mechanical routine, dull casualness and chill indifference.",
      "speaker": "court",
      "significance": "Emphasises strict construction and watchful application of preventive detention law."
    },
    {
      "text": "In the absence of those material particulars, the detenu could not exercise his constitutional right of making an effective representation.",
      "speaker": "court",
      "significance": "Reason for invalidity across all cases."
    }
  ],
  "_case_id": "1974_397",
  "_label": 1,
  "_text_length": 19537,
  "_extracted_at": "2026-02-10T20:06:51.206143"
}