{
  "metadata": {
    "case_name": "Union of India v. Exen Industries",
    "case_year": 1972,
    "court": "Supreme Court of India",
    "judges": [
      "Alagiriswami, J."
    ],
    "case_number": "Civil Appeal No. 1612 of 1972",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Vora and Mehta formed a partnership under the name of Exen Industries and were manufacturing fountain pens.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "In December 1963 the partnership was dissolved and Vora took in another partner and continued the industry under the original name of Exen Industries.",
      "type": "material",
      "date": "1963-12",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Mehta started another business also of manufacturing fountain pens under the name of Premier Products.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Under the deed of dissolution of partnership all the machineries and other assets were equally divided between the two partners and Vora was also given the benefit of all the existing import licences as well as applications for import licences then pending.",
      "type": "material",
      "date": "1963-12",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Thereafter the respondent firm's new Exen Industries applied for import licences for necessary raw materials and were granted 50 per cent of what the original Exen Industries were getting.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The respondent firm filed a writ petition out of which this appeal arises (C.W. No. 25-D of 1966).",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "A Division Bench of the Delhi High Court allowed the writ petition and quashed the order of the Government dated 3rd December, 1965 and directed the appellants, who were respondents in the writ petition, to consider the claim of the respondent on the basis of its own production and number on the basis that the production of M/s. Exen Industries was divided between the petitioner and Shri Mehta in December 1963.",
      "type": "procedural",
      "date": "1971-11-16",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "The petitioner's case was that his actual production was the same as before the dissolution as the installed capacity of the factory was double that of actual capacity and production, that in the division of the machinery and assets of the partnership the half given to the petitioner was for his level of production and only the other half consisting of the spare and the unutilised capacity of the machinery and stock were given to Mehta.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "Exen Industries was borne on the registers of the Directorate General of Technical Development and the quota of import licence granted to the new Exen Industries is on the basis of the Directorate's recommendation.",
      "type": "background",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the new Exen Industries (respondent) is entitled to import licences on the basis of its own production claiming continuity from the old partnership's full production capacity, or only 50% share post-dissolution.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether distinction between installed capacity and actual production capacity justifies granting full import entitlement to new Exen Industries.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Application of import policy rules (paras 73, 88(2)(c), 71 of Handbook) to divided partnership.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The most equitable way was to divide the old import entitlement equally between the two partners, which is what the Government did.",
      "supporting_facts": [
        "f4",
        "f5"
      ],
      "legal_basis": "Dissolution deed; equitable division"
    },
    {
      "id": "pa2",
      "text": "When machinery divided equally, cannot accept contention that one partner got actual production capacity and other got unutilised spare capacity.",
      "supporting_facts": [
        "f4",
        "f8"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Petitioner's entitlement cannot be considered divorced from past history; depriving other partner Mehta unfair; Mehta should be party.",
      "supporting_facts": [
        "f2",
        "f3",
        "f8"
      ],
      "legal_basis": "Para 73 of Handbook; natural justice"
    },
    {
      "id": "pa4",
      "text": "Principle in para 88(2)(c) requires joint application and proportionate licences post-division.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": "Para 88(2)(c) of Handbook"
    },
    {
      "id": "pa5",
      "text": "Licences normally on DGTD recommendation for registered industries.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": "Para 71 of Handbook"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Actual production same as before dissolution; installed capacity double actual; half machinery given was for his production level, other half spare/unutilised to Mehta; entitled to licences as before.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": "Para 73 of Handbook of Rules Procedure in relation to import trade control"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "High Court erred in thinking petitioner (new Exen) same as old Exen Industries; machinery divided equally, so productive capacity also divided equally.",
      "addresses_issue": "i1",
      "key_observation": "Impossible to divide machinery such that one gets actual production capacity and other spare capacity."
    },
    {
      "id": "cr2",
      "text": "Import licences given on actual production, not installed capacity; equitable to divide old entitlement equally.",
      "addresses_issue": "i2",
      "key_observation": "Dissolution deed did not provide continuing full benefit to Vora."
    },
    {
      "id": "cr3",
      "text": "Para 73 requires scrutiny including past production of applicant; new Exen cannot claim divorced from history; would double total entitlement unfairly.",
      "addresses_issue": "i3",
      "key_observation": "Foreign exchange not plentiful."
    },
    {
      "id": "cr4",
      "text": "Para 88(2)(c) requires proportionate division post-dissolution; principle applies to future licences; recognised in Controller v. Amichand.",
      "addresses_issue": "i3",
      "key_observation": "Joint application needed."
    },
    {
      "id": "cr5",
      "text": "Decision against Mehta's interest cannot be made without him as party; quota based on DGTD recommendation.",
      "addresses_issue": "i1",
      "key_observation": "No artificial distinction between actual and spare capacity."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "New Exen Industries not entitled to more than 50% import quota; High Court erred in quashing government order.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "No distinction between installed and actual capacity post-equal division justifies full entitlement.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h3",
      "text": "Import policy handbook paras 73, 88(2)(c), 71 require proportionate division and scrutiny based on history.",
      "resolves_issue": "i3",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Controller V. Amichand",
      "citation": "1966 1 S.C.R. 242",
      "treatment": "followed",
      "relevance": "Implicitly recognised principle that on partnership dissolution, import licences divided equally among partners."
    }
  ],
  "statutes_cited": [
    {
      "name": "Handbook of Rules Procedure in relation to import trade control",
      "sections": [
        "Paragraph 73",
        "Paragraph 88(2)(c)",
        "Paragraph 71"
      ],
      "relevance": "Basis for licensing on certified requirements scrutinized by past production; division of business requires proportionate licences; DGTD recommendation for registered industries."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "The appeal is allowed; High Court judgment set aside; government order granting 50% import quota upheld; petitioner not entitled to more as equitable division required post-partnership dissolution.",
    "relief_granted": "Appeal allowed, writ petition stands dismissed",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "When the machinery of a factory is divided into two equal halves it is not possible to accept the contention that one of the partners to the partnership got the actual production capacity and the other partner got the unutilised spare capacity.",
      "speaker": "court",
      "significance": "Rejects core argument of respondent on capacity division."
    },
    {
      "text": "The error which the High Court fell into as we already pointed out was in thinking that the new Exen Industries is the same as the old Exen Industries.",
      "speaker": "court",
      "significance": "Identifies fundamental mistake by High Court."
    },
    {
      "text": "The principle that when a partnership is dissolved the import-licences would have to be equally divided among the partners has been implicitly recognised by this Court in its decision in Controller V. Amichand.",
      "speaker": "court",
      "significance": "Affirms equitable principle from precedent."
    }
  ],
  "_case_id": "1974_303",
  "_label": 1,
  "_text_length": 12354,
  "_extracted_at": "2026-02-10T20:06:10.173554"
}