{
  "metadata": {
    "case_name": "Petitioner v. State Government",
    "case_year": 1975,
    "court": "Supreme Court of India",
    "judges": [
      "BHAGWATI J."
    ],
    "case_number": "Writ Petition No. 164 of 1974",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Order of detention dated 26th July, 1972 made by the District Magistrate, Midnapur under section 3 of the Maintenance of Internal Security Act, 1971.",
      "type": "procedural",
      "date": "1972-07-26",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "District Magistrate made a report to the State Government on the same day as the detention order.",
      "type": "procedural",
      "date": "1972-07-26",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "State Government approved the order of detention on 5th August, 1972 and made a report to the Central Government on the same day.",
      "type": "procedural",
      "date": "1972-08-05",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Petitioner was absconding and could not be arrested until 24th October, 1972.",
      "type": "procedural",
      "date": "1972-10-24",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Petitioner arrested on 24th October, 1972; order of detention served along with grounds of detention.",
      "type": "procedural",
      "date": "1972-10-24",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "State Government placed case before Advisory Board; Advisory Board submitted report dated 23rd November, 1972 stating sufficient cause for detention.",
      "type": "procedural",
      "date": "1972-11-23",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "No representation against detention received from petitioner until 27th November, 1972.",
      "type": "procedural",
      "date": "1972-11-27",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "State Government received representation from petitioner on 27th November, 1972.",
      "type": "procedural",
      "date": "1972-11-27",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "State Government passed order of confirmation on 29th November, 1972 without considering the representation.",
      "type": "procedural",
      "date": "1972-11-29",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "State Government considered and rejected the representation on 2nd December, 1972.",
      "type": "procedural",
      "date": "1972-12-02",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the order confirming the detention passed by the State Government without considering the representation of the petitioner violates Article 22(5) of the Constitution and section 7 of the Maintenance of Internal Security Act, 1971.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The order confirming the detention having been passed by the State Government without considering the representation of the petitioner, the detention is unlawful as being in violation of Art. 22(5) of the Constitution and section 7 of the Maintenance of Internal Security Act, 1971.",
      "supporting_facts": [
        "f8",
        "f9"
      ],
      "legal_basis": "Article 22(5) of the Constitution; section 7 of the Maintenance of Internal Security Act, 1971"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Where representation received after expiration of thirty days from date of detention, no obligation on State Government to send it to Advisory Board.",
      "supporting_facts": [],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Peremptory language of Art. 22(5) and section 7 makes it obligatory for State Government to consider representation of detenu as soon as received; confirmation without consideration renders detention illegal.",
      "addresses_issue": "i1",
      "key_observation": "State Government proceeded to confirm without considering representation received before confirmation."
    },
    {
      "id": "cr2",
      "text": "Four principles from Jayanarayan Sukula: (1) opportunity to make and consider rep early; (2) independent of Advisory Board; (3) no delay; (4) form opinion before sending to Board.",
      "addresses_issue": "i1",
      "key_observation": "State must itself consider rep and decide on detention necessity before or at confirmation."
    },
    {
      "id": "cr3",
      "text": "Even after Advisory Board opinion, State must consider rep if available before confirmation; subsequent consideration does not cure invalidity.",
      "addresses_issue": "i1",
      "key_observation": "Support from B. Sunder Rao: Government cannot absolve from considering rep even at later stage like confirmation."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "State Government bound to consider detenu's representation before confirming detention order, even if received after Advisory Board report but before confirmation.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Detention illegal and void if confirmation passed without considering representation.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Jayanarayan Sukula v. State of West Bengal",
      "citation": "1970 3 S.C.R 225",
      "treatment": "followed",
      "relevance": "Obligatory to consider representation early, independent of Advisory Board; four principles enunciated."
    },
    {
      "case_name": "B. Sunder Rao and Ors. v. State of Orissa",
      "citation": "1972 3 S.C.R. 1",
      "treatment": "followed",
      "relevance": "Government must consider representation even at confirmation stage after Advisory Board opinion."
    }
  ],
  "statutes_cited": [
    {
      "name": "Maintenance of Internal Security Act, 1971",
      "sections": [
        "3",
        "7",
        "11"
      ],
      "relevance": "Detention order under s.3; obligation to consider rep under s.7; confirmation after Advisory Board under s.11."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "32",
        "22(5)"
      ],
      "relevance": "Writ petition under Art.32; right to representation under Art.22(5)."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Court set aside the order of detention dated 26th July 1972, declared detention illegal and void, and directed petitioner be set at liberty forthwith due to confirmation without considering representation.",
    "relief_granted": "Set aside detention order; set at liberty forthwith.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "the peremptory language of Art. 22(5) of the Constitution and section 7 of the Act makes it obligatory that the State Government should consider the representation of the detenu as soon as it is received by it.",
      "speaker": "court",
      "significance": "Core holding on mandatory timely consideration of representation."
    },
    {
      "text": "The subsequent consideration and rejection of the representation of the petitioner could not cure the invalidity of the order of confirmation.",
      "speaker": "court",
      "significance": "Explains why later action does not validate prior procedural lapse."
    },
    {
      "text": "We accordingly set aside the order of detention and declare the detention of the petitioner to be illegal and void and direct that the petitioner be set at liberty forthwith.",
      "speaker": "court",
      "significance": "Final operative direction."
    }
  ],
  "_case_id": "1974_249",
  "_label": 1,
  "_text_length": 10142,
  "_extracted_at": "2026-02-10T20:05:25.144326"
}