{
  "metadata": {
    "case_name": "Baradakanta Mishra v. High Court of Orissa",
    "case_year": 1973,
    "court": "Supreme Court of India",
    "judges": [
      "BHAGWATI, J."
    ],
    "case_number": "Criminal Appeal No. 84 of 1973",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The appellant was at all material times a member of the Judicial Service of the State of Orissa.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The appellant was promoted as an Additional District and Sessions Judge on 31st July, 1968.",
      "type": "background",
      "date": "1968-07-31",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "By an order dated 30th March, 1972 made by the High Court of Orissa, the appellant was suspended as a disciplinary inquiry was decided to be instituted against him.",
      "type": "material",
      "date": "1972-03-30",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On 29th April, 1972, a charge-sheet containing eight charges was served on the appellant and he was called upon to show cause why disciplinary action should not be taken against him.",
      "type": "procedural",
      "date": "1972-04-29",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "On 10th April, 1972, the appellant addressed an appeal to the Government complaining against the order of suspension passed by the High Court and requesting the Governor to cancel the order of suspension on the ground that it was outside the authority of the High Court.",
      "type": "procedural",
      "date": "1972-04-10",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The High Court withheld the appeal of the appellant and refused to forward it to the Governor since in its opinion no appeal lay to the Governor against an order of suspension passed by the High Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "The appellant forwarded directly to the Governor a representation dated 14th May, 1972 with a copy to the Registrar of the High Court and by this representation the appellant moved the Governor to transfer the disciplinary inquiry against him to the Administrative Tribunal. There were several statements made in this representation which scandalized the High Court and tended to lower its prestige, dignity and authority and thus constituted criminal contempt of court within the meaning of the Contempt of Courts Act, 1971.",
      "type": "material",
      "date": "1972-05-14",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "The High Court suo motu issued a notice dated 3rd July, 1972 calling upon the appellant to show cause why he should not be punished for contempt of court. The notice set out the passages from the representation made by the appellant to the Governor which, in the prima facie opinion of the High Court, amounted to contempt of court. The proceeding for contempt initiated by this notice was numbered as Criminal Miscellaneous Case No. 8 of 1972.",
      "type": "procedural",
      "date": "1972-07-03",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "The appellant appeared in answer to the notice and raised several contentions with a view to exonerating himself from the charge of contempt. One of the contentions was that whatever he had said in regard to the judges of the High Court in the representation made by him to the Governor was in regard to their conduct in the discharge of administrative functions and not judicial functions, and therefore, it did not amount to contempt of court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "The appellant pleaded before the Full Bench of five judges, which was constituted to hear the proceeding for contempt, that this contention should be tried as a preliminary issue, but the Full Bench rejected the plea of the appellant.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "The appellant preferred a petition for special leave to appeal to this Court and in this petition, the appellant once again made statements which prima facie appeared to constitute criminal contempt of court. The petition was rejected by this Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "The High Court taking notice of the objectionable statements contained in the petition issued a supplementary notice dated 5th January, 1973 to the appellant to show cause why he should not be punished for having committed contempt of court by publishing such statements.",
      "type": "procedural",
      "date": "1973-01-05",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "The Full Bench thereafter heard the proceeding for contempt on the charges contained in both the notices and by an order dated 5th February, 1973 held the appellant guilty of contempt of court and sentenced him to simple imprisonment for two months.",
      "type": "material",
      "date": "1973-02-05",
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Meanwhile the disciplinary inquiry instituted under the charge-sheet dated 29th April, 1972 was entrusted to K. B. Panda, J., and the learned Judge, after holding a proper inquiry in accordance with the principles of natural justice, submitted a report dated 2nd August 1972 finding the appellant guilty of all the eight charges set out in the charge-sheet, except charge No. 4(a).",
      "type": "procedural",
      "date": "1972-08-02",
      "source": "court"
    },
    {
      "id": "f15",
      "text": "The High Court considered the report at a Full Court meeting of all the judges and finding itself in agreement with the report, the High Court issued a show cause notice calling upon the appellant to show cause why he should not be reduced to the rank of Additional District Magistrate (Judicial).",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f16",
      "text": "The appellant was granted personal hearing and after considering the explanation given by him, the High Court again at a Full Court meeting of all the judges held on 8th December, 1972, found the appellant guilty of the charges levelled against him except charge No. 4(a) and reduced him to the rank of Additional District Magistrate (Judicial).",
      "type": "material",
      "date": "1972-12-08",
      "source": "court"
    },
    {
      "id": "f17",
      "text": "The appellant took the view that some of the issues arising in the disciplinary inquiry were the same as those arising in the proceeding for contempt which was pending against him and the decision of those issues by the High Court on the Administrative side in the course of the disciplinary inquiry amounted to pre-judging those issues in the proceeding for contempt which was a judicial proceeding and the Chief Justice and other judges of the High Court, who decided the disciplinary inquiry were, therefore, guilty of criminal contempt of their own High Court.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f18",
      "text": "The appellant, as soon as the proceeding for contempt was decided by the Full Bench on 5th February, 1973, moved the Full Bench for initiating proceeding for contempt against the Chief Justice and other judges in their personal capacity.",
      "type": "procedural",
      "date": "1973-02-05",
      "source": "court"
    },
    {
      "id": "f19",
      "text": "The motion of the appellant was heard by a Full Bench of three judges and by an order dated 13th February, 1973, the Bench held that in its opinion there was no contempt of court committed by the Chief Justice and the other judges and in any event, by reason of section 15, sub-section (4), the appellant was not entitled to move the High Court for taking action against the Chief Justice and other judges since he had not obtained the consent in writing of the Advocate General and the Bench accordingly declined to take any action on the motion of the appellant.",
      "type": "material",
      "date": "1973-02-13",
      "source": "lower_court"
    },
    {
      "id": "f20",
      "text": "The appellant thereupon, purporting to avail of the right of appeal granted under section 19, sub-section (1), preferred the present appeal to this Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether an appeal lies under section 19, sub-section (1) of the Contempt of Courts Act, 1971 against the refusal of the High Court to take action on the motion made by the appellant to initiate proceedings for contempt.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Even if a decision was taken by the High Court not to take action on the motion made by the appellant, it would still be a decision in the exercise of its jurisdiction to punish for contempt and would, therefore, be appealable on the plain terms of section 19, sub-section (1).",
      "supporting_facts": [
        "f19",
        "f20"
      ],
      "legal_basis": "Section 19, sub-section (1) of the Contempt of Courts Act, 1971 - words 'any order or decision in the exercise of its jurisdiction to punish for contempt'"
    },
    {
      "id": "pa2",
      "text": "It is difficult to imagine that the legislature should have conferred a right on the Advocate General or any other person with the consent in writing of the Advocate General to move the High Court for taking action for contempt, but should have refused to grant a right of appeal to the Advocate General or such other person even if his motion was wrongly rejected by the High Court.",
      "supporting_facts": [
        "f19"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "No appeal lay under section 19, sub-section (1) against the refusal of the High Court to take action on the motion made by the appellant. It is only if the High Court suo motu or on a motion made by the Advocate General or any other person with the consent in writing of the Advocate General takes action and initiates proceeding for contempt against the alleged contemner and on arriving at a finding of guilt, punishes him for contempt that the alleged contemner has a right of appeal under section 19, sub-section (1). Even if a proceeding for contempt is initiated against the alleged contemner but the alleged contemner is found not guilty and is exonerated, there is no right of appeal, and neither the Advocate General nor the person who has, with the consent in writing of the Advocate General, moved the High Court, can appeal as of right.",
      "supporting_facts": [
        "f19"
      ],
      "legal_basis": "Section 19, sub-section (1) of the Contempt of Courts Act, 1971"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Criminal contempt is a matter entirely between the Court and the alleged contemner. No one has a statutory or common law right to say that he is entitled as a matter of course to an order for committal because the alleged contemner is guilty of contempt. All that he can do is to move the Court and draw its attention to the contempt alleged to have been committed and it will then be for the Court, if it so thinks fit, to take action to vindicate its authority and commit the alleged contemner for contempt.",
      "addresses_issue": "i1",
      "key_observation": "The Court in its discretion decides whether or not to initiate a proceeding for contempt."
    },
    {
      "id": "cr2",
      "text": "Under the law prior to the Contempt of Courts Act, 1971, no appeal lay at the instance of a party moving the High Court for taking action for contempt, if the High Court refused to take action. Even punishment orders were not appealable as of right.",
      "addresses_issue": "i1",
      "key_observation": "Unsatisfactory state led to Sanyal Committee recommendations resulting in Section 19."
    },
    {
      "id": "cr3",
      "text": "The scheme of Sections 15, 17, 20 is that the Court may initiate a proceeding for contempt suo motu or on motion/reference, but consideration of motion/reference is only to decide whether to initiate. Jurisdiction to punish commences only upon initiation of proceeding.",
      "addresses_issue": "i1",
      "key_observation": "Refusal to initiate is not a decision in exercise of jurisdiction to punish."
    },
    {
      "id": "cr4",
      "text": "Where the Court rejects a motion and declines to initiate a proceeding for contempt, it refuses to assume or exercise jurisdiction to punish for contempt and such a decision cannot be regarded as a decision in the exercise of its jurisdiction to punish for contempt. Such a decision would not fall within section 19(1) and no appeal lies as of right.",
      "addresses_issue": "i1",
      "key_observation": "Remedy available via special leave under Article 136."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The order made by the Full Bench of the Orissa High Court rejecting the motion made by the appellant and refusing to initiate a proceeding for contempt against the Chief Justice and other judges was not appealable under section 19, sub-section (1).",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Narendrabhai Sarabhai Hatheesing v. Chinubhai Manibhai, Seth",
      "citation": "I.L.R. 60 Bom. 894",
      "treatment": "followed",
      "relevance": "An order refusing to commit for breach of undertaking is not a judgment under Letters Patent cl.15 as contempt proceedings are entirely between Court and alleged contemner."
    }
  ],
  "statutes_cited": [
    {
      "name": "Contempt of Courts Act, 1971",
      "sections": [
        "Section 15",
        "Section 17",
        "Section 19",
        "Section 20"
      ],
      "relevance": "Governs initiation of contempt proceedings, procedure, appeal from punishment orders, and limitation. Refusal to initiate not appealable under s.19(1)."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 134",
        "Article 136"
      ],
      "relevance": "Discretionary appeals in contempt cases prior to 1971 Act."
    },
    {
      "name": "Letters Patent",
      "sections": [
        "Clause 15"
      ],
      "relevance": "No appeal in criminal contempt matters under pre-1971 law."
    },
    {
      "name": "Code of Criminal Procedure",
      "sections": [
        "Section 411A",
        "Section 486"
      ],
      "relevance": "No appeal in contempt cases; appeals provided for specific contempts under IPC."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal was dismissed on the preliminary objection raised by the respondent that no appeal lay under section 19(1) of the Contempt of Courts Act, 1971 against the High Court's refusal to initiate contempt proceedings on the appellant's motion.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "It is for the Court in the exercise of its discretion to decide whether or not to initiate a proceeding for contempt. Even if the Court is prima facie satisfied that a contempt has been committed, the Court may yet choose to ignore it and decline to take action.",
      "speaker": "court",
      "significance": "Explains discretionary nature of contempt jurisdiction."
    },
    {
      "text": "The exercise of the jurisdiction to punish for contempt commences with the initiation of a proceeding for contempt, whether suo motu or on a motion or a reference.",
      "speaker": "court",
      "significance": "Defines when jurisdiction under s.19(1) is exercised."
    },
    {
      "text": "We are, therefore, of the view that the preliminary objection raised by the respondent is well founded and the appellant is not entitled to maintain the present appeal under section-19, sub-section (1).",
      "speaker": "court",
      "significance": "Final holding on appealability."
    }
  ],
  "_case_id": "1974_174",
  "_label": 0,
  "_text_length": 24650,
  "_extracted_at": "2026-02-10T20:04:52.609465"
}