{
  "metadata": {
    "case_name": "Appellants v. Respondents",
    "case_year": 1970,
    "court": "Supreme Court of India",
    "judges": [
      "Ray, C.J."
    ],
    "case_number": "Civil Appeal No. 275 of 1970",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The appellant was the owner of several acres of land at Bangalore and developed an agricultural and horticultural Estate on that land.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "In the year 1967 there was a proposal to acquire the aforesaid property of the appellant.",
      "type": "material",
      "date": "1967",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Land acquisition proceedings commenced.",
      "type": "procedural",
      "date": "1967",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Possession of the property was taken in the month of April, 1967.",
      "type": "procedural",
      "date": "1967-04",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Notification under section 4 of the Land Acquisition Act was made in the month of May, 1967.",
      "type": "procedural",
      "date": "1967-05",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "A declaration under section 6 of the Land Acquisition Act was made on 1 July, 1967.",
      "type": "procedural",
      "date": "1967-07-01",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "In the month of August, 1967 the appellant preferred claims for compensation of Rs. 18,83,650.",
      "type": "procedural",
      "date": "1967-08",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "In the month of September, 1967 the Government paid a sum of Rs. 6,50,000/- as an installment.",
      "type": "procedural",
      "date": "1967-09",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "On 30 August, 1968 the Government wrote to the Divisional Commissioner that the Government approved the award for the total of Rs. 6,57,870-15 in respect of lands measuring 86 acres 2 gunthas.",
      "type": "procedural",
      "date": "1968-08-30",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "The appellant made an application under Article 226 of the Constitution inter alia for an order that the proviso to section 11 and section 15-A of the Mysore Land Acquisition Act 17 of 1961 be struck down, for a writ of prohibition to the Deputy Commissioner not to follow the instructions given by the Government in their approval letter dated 30 August, 1968, and for a writ of mandamus directing the Land Acquisition Officer to maintain their own valuation expressed in the draft award dated 24 July, 1968 for the sum of Rs. 13,00,000/-",
      "type": "procedural",
      "date": "1968",
      "source": "petitioner"
    },
    {
      "id": "f11",
      "text": "The High Court at Mysore by judgment dated 6 June 1969 held that the proviso to section 11 of the 1961 Act is valid.",
      "type": "procedural",
      "date": "1969-06-06",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "This is an appeal by certificate against the judgment dated 6 June, 1969 of the High Court at Mysore in Writ Petition No. 3244 of 1968.",
      "type": "procedural",
      "date": "1969-06-06",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the proviso to section 11 and section 15-A of the Mysore Land Acquisition Act, 1961 are unconstitutional and offend Article 31(2) of the Constitution.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The proviso to section 11 of the 1961 Act is unconstitutional as it offends Article 31(2) of the Constitution.",
      "supporting_facts": [
        "f10"
      ],
      "legal_basis": "Article 31(2) of the Constitution; Mysore Land Acquisition Act, 1961"
    },
    {
      "id": "pa2",
      "text": "The proviso overreaches the opinion of the Deputy Commissioner by requiring previous approval of the State Government without guidelines.",
      "supporting_facts": [
        "f9",
        "f10"
      ],
      "legal_basis": "Proviso to section 11 of the 1961 Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The Deputy Commissioner is an agent of the State Government and the compensation fixed in the award is an offer made on behalf of the Government. The proviso to section 11 eliminates rare cases of Land Acquisition officers being influenced by extraneous considerations.",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": "Proviso to section 11 of the 1961 Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The Land Acquisition Act, 1894 is protected under Article 31(5) of the Constitution. The proviso to section 11 of the 1961 Act does not infraction Article 31(2) as the award under section 11 is an offer of compensation made by the Deputy Commissioner as an agent of the Government, subject to approval by the State Government.",
      "addresses_issue": "i1",
      "key_observation": "The Deputy Commissioner acts in an administrative capacity, not judicial or quasi-judicial."
    },
    {
      "id": "cr2",
      "text": "There are guidelines for approval as the Government must consider provisions of the Act, including sections 23 and 24. Grievances regarding compensation can be remedied under sections 15, 18, 23, 26 of the 1961 Act, where the award is not final.",
      "addresses_issue": "i1",
      "key_observation": "The award under section 11 is not final and can be challenged in court."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The proviso to section 11 of the Mysore Land Acquisition Act, 1961 is valid and does not offend Article 31(2) of the Constitution.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Mysore Land Acquisition Act, 1961",
      "sections": [
        "Section 11 (including proviso)",
        "Section 15-A",
        "Section 15",
        "Section 18",
        "Section 23",
        "Section 24",
        "Section 26",
        "Section 9",
        "Section 8",
        "Section 4(1)"
      ],
      "relevance": "Governs enquiry, award by Deputy Commissioner, government approval, reference to court, determination of compensation, and finality of awards."
    },
    {
      "name": "Land Acquisition Act, 1894",
      "sections": [
        "Section 4",
        "Section 6"
      ],
      "relevance": "Notification and declaration procedures applied in proceedings."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 31(2)",
        "Article 31(5)",
        "Article 226"
      ],
      "relevance": "Article 31(2) invoked for challenge to compensation; Article 31(5) protects 1894 Act; Article 226 for writ petition."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal against the Mysore High Court judgment upholding the validity of the proviso to section 11 of the Mysore Land Acquisition Act, 1961 is dismissed. The judgment of the High Court is upheld.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The Deputy Commissioner is not acting in judicial or quasi-judicial capacity in making the award under section 11 of the 1961 Act. The Deputy Commissioner acts in an administrative capacity as an agent of the State Government.",
      "speaker": "court",
      "significance": "Core reasoning upholding the proviso as administrative approval."
    },
    {
      "text": "The contention is utterly unsound. The Land Acquisition Act is a piece of legislation which provides for acquisition of property for public purpose by authority of law for an amount which may be determined in accordance with the principles specified in the Land Acquisition Act.",
      "speaker": "court",
      "significance": "Rejects challenge under Article 31(2)."
    }
  ],
  "_case_id": "1974_183",
  "_label": 0,
  "_text_length": 8054,
  "_extracted_at": "2026-02-10T20:04:43.643896"
}