{
  "metadata": {
    "case_name": "Firm of Pratapchand Nopaji v. Respondents",
    "case_year": 1968,
    "court": "Supreme Court of India",
    "judges": [
      "BEG, J."
    ],
    "case_number": "Civil Appeals Nos. 2382 to 2384 of 1968",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Three consolidated appeals by special leave against common judgment dated 27th September 1967 of Andhra Pradesh High Court dismissing plaintiffs' appeals in three suits filed on similar facts.",
      "type": "procedural",
      "date": "1967-09-27",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Plaintiff-appellant Firm of Pratapchand Nopaji filed suits: O.S. No. 106/1954 for Rs. 78,201.15; O.S. No. 107/1954 for Rs. 13,978.4; O.S. No. 114/1954 for Rs. 91,697.4, claiming indemnity under Section 222 Contract Act for payments made to third parties (Bombay commission agents) on behalf of defendants.",
      "type": "material",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "Defendants, big merchants from Dhone, engaged plaintiff as commission agents to contract with Bombay commission agents for purchasing/selling groundnut seeds and castor oil seeds according to defendants' orders, following Bombay market custom of Badla.",
      "type": "admitted",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "Transactions involved forward contracts with badla (continuation/carrying over), settled after few badlas beneficial to defendants as market falling; defendants directed plaintiff to settle to preserve reputation, agreed to repay amounts with interest.",
      "type": "material",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "Badla transactions are contracts for future delivery without intention of actual delivery, speculation on price differences; plaintiff communicated contracts to defendants who consented.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Relationship between plaintiff and Bombay agents was principal to principal as found by High Court.",
      "type": "disputed",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Contracts entered at Kurnool, Andhra Pradesh, but to be carried out in Bombay.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Total groundnut seeds quantity: 950 tons, impossible for actual delivery to Kurnool which exports groundnuts.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Only one Bombay agent (Shivdanmal Agarwal & Co.) member of recognised association.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the contracts set up by the plaintiff-appellant were struck by the provisions of Section 23 of the Contract Act as unlawful.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the contracts violated Bombay Forward Contracts Control Act, 1947 and Oilseeds Forward Contract Prohibition Order, 1943.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether contracts were wagering contracts under Section 30 Contract Act.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Contracts between plaintiff and defendants not wagering as no mutuality of gain/loss; plaintiff as agent does not speculate on prices.",
      "supporting_facts": [
        "f2",
        "f3",
        "f5"
      ],
      "legal_basis": "Bhagwandas Parasram v. Burjori Ruttomji Bomanji; Section 30 Contract Act"
    },
    {
      "id": "pa2",
      "text": "Collateral contracts to wagering or void contracts enforceable if not prohibited.",
      "supporting_facts": [
        "f2",
        "f7"
      ],
      "legal_basis": "Gherulal Parakh v. Mahadeodas Maiya; Section 23 Contract Act"
    },
    {
      "id": "pa3",
      "text": "Contracts excluded from prohibitions as for specified qualities/types at specified price, not transferable to third parties.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": "Notifications under Oilseeds Forward Contract Prohibition Order, 1943"
    },
    {
      "id": "pa4",
      "text": "Public policy in India post-independence broader but contracts not against it.",
      "supporting_facts": [],
      "legal_basis": "Section 23 Contract Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Contracts illegal under Section 23 as objects defeat provisions of law (Bombay Forward Contracts Control Act and Control Order).",
      "supporting_facts": [
        "f5",
        "f8",
        "f9"
      ],
      "legal_basis": "Section 23 Contract Act; Bombay Forward Contracts Control Act s.8; Oilseeds Order"
    },
    {
      "id": "ra2",
      "text": "Both conditions for exclusion not satisfied (specified delivery documents not transferable AND specified qualities).",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": "Notifications under Oilseeds Order"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Contracts not wagering between plaintiff and defendants due to lack of mutuality; speculation by principal does not make agency wagering.",
      "addresses_issue": "i3",
      "key_observation": "Accepted Bhagwandas precedent."
    },
    {
      "id": "cr2",
      "text": "Objects unlawful under s.23 as violated Bombay Act s.8(1)(b) potentially, but definitively violated Oilseeds Prohibition Order 1943 as not excluded (both conditions not met, no actual delivery intended).",
      "addresses_issue": "i2",
      "key_observation": "Badla transactions speculative, not for actual delivery; 950 tons impractical."
    },
    {
      "id": "cr3",
      "text": "Collateral to prohibited contracts also tainted and unenforceable; cannot do indirectly what prohibited directly.",
      "addresses_issue": "i1",
      "key_observation": "Qui facit per alium facit per se; s.224 excludes indemnity for unlawful acts."
    },
    {
      "id": "cr4",
      "text": "Distinguished Gherulal as there wagering void but not illegal/prohibited; here prohibited by law with penalties.",
      "addresses_issue": "i1",
      "key_observation": "Public harm indisputable."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Contracts between plaintiff and defendants not wagering but objects unlawful under s.23 Contract Act as forbidden by Oilseeds Forward Contract Prohibition Order 1943.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "No indemnity under s.222 as acts unlawful; s.224 excludes criminal acts.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Bhagwandas Parasram v. Burjori Ruttomji Bomanji",
      "citation": "45 I.A. p. 29",
      "treatment": "followed",
      "relevance": "No wagering between principal and agent despite speculation."
    },
    {
      "case_name": "Gherulal Parakh v. Mahadeodas Maiya",
      "citation": "1959 2 Supp. S.C.R. 406",
      "treatment": "distinguished",
      "relevance": "Partnership for wagering enforceable as not prohibited; unlike here where prohibited."
    },
    {
      "case_name": "Shivnarayan Kabra v. State of Madras",
      "citation": null,
      "treatment": "referred",
      "relevance": "Objects of forward contracts control legislation to curb speculation harmful to public."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Contract Act, 1872",
      "sections": [
        "Section 23",
        "Section 30",
        "Section 222",
        "Section 224"
      ],
      "relevance": "Defines unlawful agreements; excludes indemnity for unlawful acts."
    },
    {
      "name": "Bombay Forward Contracts Control Act, 1947",
      "sections": [
        "Section 2(3)",
        "Section 2(4)",
        "Section 6",
        "Section 8",
        "Section 9"
      ],
      "relevance": "Regulates forward contracts; makes non-compliant illegal."
    },
    {
      "name": "Oilseeds Forward Contracts Prohibition Order, 1943",
      "sections": [
        "Clauses 1-5"
      ],
      "relevance": "Prohibits forward contracts in oilseeds except specific exclusions."
    },
    {
      "name": "Essential Supplies (Temporary Powers) Act, 1946",
      "sections": [
        "Section 3(2)(c-g)",
        "Section 7(2)",
        "Section 17"
      ],
      "relevance": "Keeps Control Order alive; penalties for violations."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeals dismissed on merits; decrees for costs to defendants set aside as parties in pari delicto; parties to bear own costs throughout.",
    "relief_granted": "None",
    "costs": "Parties to bear their own costs throughout"
  },
  "key_quotes": [
    {
      "text": "\"Speculation does not necessarily involve a contract by way of wager, and to constitute such a contract a common intention to wager is essential.\"",
      "speaker": "court",
      "significance": "Explains why no wagering between parties."
    },
    {
      "text": "\"That which cannot be done directly may not be done indirectly by engaging another outside the prohibited area to do the illegal act within the prohibited area.\"",
      "speaker": "court",
      "significance": "Justifies unenforceability of collateral contracts to prohibited ones."
    },
    {
      "text": "\"The contracts under consideration are tainted with an unlawfulness of their object and are forbidden by law.\"",
      "speaker": "court",
      "significance": "Core holding on Section 23."
    }
  ],
  "_case_id": "1974_361",
  "_label": 0,
  "_text_length": 36828,
  "_extracted_at": "2026-02-10T20:06:46.434546"
}