{
  "metadata": {
    "case_name": "Appellants v. Respondents",
    "case_year": 1973,
    "court": "Supreme Court of India",
    "judges": [
      "RAY, C.J."
    ],
    "case_number": "Civil Appeal No. 1452 of 1973",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellants belonged to Pepsu Service.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On 20 October 1956, the appellants had been removed from the position of Sub-Inspectors to Inspectors.",
      "type": "procedural",
      "date": "1956-10-20",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On 1 November 1956 there was the reorganization of the State of Punjab. Pepsu became merged in Punjab. The appellants became integrated with other Inspectors working in the State of Punjab.",
      "type": "material",
      "date": "1956-11-01",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On 1 March 1957 the appellants were reverted from the position of Inspector to Sub-Inspector.",
      "type": "procedural",
      "date": "1957-03-01",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "On 11 April 1957 the appellants were promoted again to the position of Inspector.",
      "type": "procedural",
      "date": "1957-04-11",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The appellants contend that the 1936 Rules did not apply to Pepsu before the merger, and therefore the conditions of service could not be varied to their disadvantage after the integration without the previous approval of the Central Government as provided by section 115(7) of the States Reorganization Act.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "The appellants also contend that they have lost one month and eleven days on account of reversion from the position of Inspector to Sub-Inspector between 1 March 1957 and 11 April 1957.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "The gradation list was published on 11 March 1966. The seniority list was prepared on the basis of 1936 Rules.",
      "type": "procedural",
      "date": "1966-03-11",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Rule 5 of the 1936 Rules states that all candidates for the post of Inspectors and Sub-Inspectors of Co-operative industrial Societies shall undergo such training and shall pass such examination as the Registrar may prescribe.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Rule 6 of the 1936 Rules states that the seniority of Inspector candidates recruited from Sub-Inspectors of Co-operative Industrial Societies and Sub-Inspectors of the Punjab Co-operative Union will first be determined by the date of passing the departmental examination. If two or more candidates passed the examination on the same date, seniority will be determined by the length of service as Sub-Inspector.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Rule 7 of the 1936 Rules states that the seniority of Inspectors in the 4th grade will be determined by the date of confirmation. In the third and higher grades of Inspectors, seniority will be determined by the date of confirmation in the respective grades.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "On 1 November 1956 the appellants as well as the respondents were all officiating Inspectors.",
      "type": "admitted",
      "date": "1956-11-01",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Some of the appellants passed their departmental examination in January 1959 and some in May 1961.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Some of the respondents passed their departmental examination in February 1957 and the others in March 1958.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f15",
      "text": "All the respondents who were shown senior to the appellants in the gradation list dated 11 March 1966 had passed their departmental examination before the appellants passed their examination.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f16",
      "text": "The respondents were all confirmed earlier than the appellants. The confirmation of the respondents took place before 1964.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f17",
      "text": "In the High Court it was conceded by the appellants that the respondents had been confirmed earlier than the appellants.",
      "type": "admitted",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f18",
      "text": "The High Court found that the seniority list was prepared on this basis: in the case of confirmed Inspectors the date of confirmation gives the seniority. In the case of Inspectors who were not confirmed the date of passing the departmental examination was taken to be the basis of seniority.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f19",
      "text": "The position of Inspectors in the integrated seniority list of the former Punjab and Pepsu employees as on 1 November 1956 was kept intact.",
      "type": "procedural",
      "date": "1956-11-01",
      "source": "court"
    },
    {
      "id": "f20",
      "text": "In the case of promoted Inspectors selected in the same batch seniority on the basis of the seniority position as Sub-Inspectors was fixed.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f21",
      "text": "All the respondents who were shown senior to the appellants passed their departmental examination long before the appellants did.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f22",
      "text": "The Central Government on 11 May 1957 addressed a memorandum No. S.O. SRDI-I-ARM-57 to all State Governments.",
      "type": "background",
      "date": "1957-05-11",
      "source": "court"
    },
    {
      "id": "f23",
      "text": "Paragraph 2 of the memorandum states that the question of protection to be afforded in the matter of various service conditions to personnel affected by reorganisation was discussed... conditions of service in regard to substantive pay... should be protected. But so far as conditions of service in regard to travelling allowances, discipline, control, classification, appeal, conduct, probation and departmental promotion were concerned it would not be appropriate to provide any protection.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f24",
      "text": "Paragraph 6 of the memorandum stated that in respect of conditions of service as had been specifically dealt with... it would be open to the State Governments to take action... and so long as the State Governments acted in conformity with those decisions, they might assume the Central Government approval in terms of the proviso to section 115(7) of the States Reorganisation Act.",
      "type": "background",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the appellants are wrongly shown as junior to the respondents on the basis of the Punjab Co-operative Subordinate Service Rules, 1936.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether conditions of service have been varied to their disadvantage after the integration without the previous approval of the Central Government as provided by section 115(7) of the States Reorganization Act.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The 1936 Rules did not apply to Pepsu before the merger, and therefore the conditions of service could not be varied to their disadvantage after the integration without the previous approval of the Central Government as provided by section 115(7) of the States Reorganization Act.",
      "supporting_facts": [
        "f1",
        "f3",
        "f6"
      ],
      "legal_basis": "Section 115(7) of the States Reorganization Act"
    },
    {
      "id": "pa2",
      "text": "They have lost one month and eleven days on account of reversion from the position of Inspector to Sub-Inspector between 1 March 1957 and 11 April 1957.",
      "supporting_facts": [
        "f4",
        "f5",
        "f7"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Seniority determined per 1936 Rules: date of passing departmental examination or confirmation.",
      "supporting_facts": [
        "f9",
        "f10",
        "f11",
        "f13",
        "f14",
        "f15",
        "f16"
      ],
      "legal_basis": "Punjab Co-operative Subordinate Service Rules, 1936 (Rules 5,6,7)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Under the 1936 Rules seniority is dependent on the passing of departmental examination. The appellants passed the departmental examination after the respondents had done so. Therefore, the appellants are treated as junior to the respondents.",
      "addresses_issue": "i1",
      "key_observation": "All the respondents who were shown senior to the appellants in the gradation list dated 11 March 1966 had passed their departmental examination before the appellants passed their examination."
    },
    {
      "id": "cr2",
      "text": "The contention of the appellants that conditions of service have been varied to their disadvantage without the previous approval of the Central Government is utterly unsound.",
      "addresses_issue": "i2",
      "key_observation": "The Central Government memorandum dated 11 May 1957 permits State Governments to change conditions regarding departmental promotion without prior approval under section 115(7)."
    },
    {
      "id": "cr3",
      "text": "The appellants also appeared in the examination. They availed of the same method of promotion. They have suffered no prejudice because they passed the departmental examination later than the respondents.",
      "addresses_issue": "i1",
      "key_observation": "No prejudice to appellants."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Seniority list prepared correctly on basis of 1936 Rules: for confirmed Inspectors, date of confirmation; for others, date of passing departmental examination.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Condition of service regarding passing of departmental examination for promotion clothed with previous approval of Central Government via memorandum dated 11 May 1957.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "N.A. Raghavendra Rao v. Deputy Commissioner South Kanara, Mangalore",
      "citation": null,
      "treatment": "followed",
      "relevance": "Memorandum of Central Government dated 11 May 1957 amounted to previous approval under section 115(7) of States Reorganisation Act."
    },
    {
      "case_name": "Mohammad Shujat Ali Ors. v. Union of India Ors.",
      "citation": "Writ Petition No. 385 of 1969 and other Writ Petitions",
      "treatment": "followed",
      "relevance": "Relied on and applied the decision in Raghavendra Rao case."
    }
  ],
  "statutes_cited": [
    {
      "name": "Punjab Co-operative Subordinate Service Rules, 1936",
      "sections": [
        "Rule 5",
        "Rule 6",
        "Rule 7"
      ],
      "relevance": "Basis for determining seniority of Inspectors and Sub-Inspectors: passing departmental examination, confirmation."
    },
    {
      "name": "States Reorganisation Act",
      "sections": [
        "Section 115(7)"
      ],
      "relevance": "Requires previous approval of Central Government to vary conditions of service to disadvantage post-reorganisation; deemed approved for promotion via Central Govt memorandum."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal by special leave is dismissed. The appellants' contentions regarding seniority and variation of service conditions without Central Government approval are rejected as unsound.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The contention of the appellants that conditions of service have been varied to their disadvantage without the previous approval of the Central Government is utterly unsound.",
      "speaker": "court",
      "significance": "Rejects core petitioner argument on section 115(7)."
    },
    {
      "text": "The appellants also appeared in the examination. They availed of the same method of promotion. They have suffered no prejudice because they passed the departmental examination later than the respondents.",
      "speaker": "court",
      "significance": "Court finds no injustice in application of rules."
    }
  ],
  "_case_id": "1974_232",
  "_label": 0,
  "_text_length": 8490,
  "_extracted_at": "2026-02-10T20:05:32.703303"
}