{
  "metadata": {
    "case_name": "Bhuvan Mohan Patnaik & Ors. v. State of Andhra Pradesh & Ors.",
    "case_year": 1974,
    "court": "Supreme Court of India",
    "judges": [
      "CHANDRACHUD, J."
    ],
    "case_number": "Writ Petitions Nos. 295-297 of 1974",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Bhuvan Mohan Patnaik, petitioner in Writ Petition No. 295 of 1974, is undergoing sentences of 4 1/2 years and 5 1/2 years awarded in two sessions cases and is an under-trial prisoner in the Parvatipuram Naxalite Conspiracy case.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Nagabhushan Patnaik, petitioner in Writ Petition No. 296 of 1974, was sentenced to death by the 11th Additional Sessions Judge, Visakhapatnam, commuted to life imprisonment by the State Government.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "P. Hussainar, petitioner in Writ Petition No. 297 of 1974, is undergoing life imprisonment imposed by the same Judge and is an under-trial in the Parvatipuram Case.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "All three petitioners are undergoing sentences in the Central Jail at Visakhapatnam.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Petitioners seek removal of armed police guards posted around the jail and dismantling of livewire electrical mechanism on top of the jail wall.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "Superintendent of Central Jail, Visakhapatnam (3rd respondent) filed affidavit stating usual watch and ward staff inadequate, services of Andhra Pradesh Special Police Force requisitioned to guard jail from outside.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Policemen live in huts on vacant jail land appurtenant to prison; officers accommodated in jail club outside jail; office in block outside jail meant for visitors.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "146 Naxalite prisoners lodged in Visakhapatnam jail, making usual arrangements inadequate.",
      "type": "background",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Eleven Naxalite prisoners, including Nagabhushan Patnaik and P. Hussainar, escaped from prison on the night of October 8, 1969.",
      "type": "material",
      "date": "1969-10-08",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Livewire mechanism installed on top of wall 14 feet from ground (wall 13 feet high), rests on enamel non-conductors fixed to angle irons embedded in wall, no direct contact with wall, no leakage possibility, walls 20 feet from cells, regularly inspected by electrician, prisoners warned, non-electrical barbed-wire fences jail walls.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Petitioners allege segregation of Naxalite prisoners in quarantine, inhuman treatment, subhuman conditions, marathon hunger-strike, difficulties in amenities like carrom powder, defective radio and musical instruments.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f12",
      "text": "3rd respondent claims airy rooms, cross-ventilation, 4000 calories food (breakfast + two meals), extra for ulcer patient (chicken, milk, eggs), reading material, games (Volleyball, Kabbadi, Badminton, Ring tennis), musical instruments, radio network.",
      "type": "disputed",
      "date": null,
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether posting of armed police guards of Andhra Pradesh Special Police Force around the jail, including occupation of appurtenant land, violates fundamental rights of prisoners.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether installation of livewire electrical mechanism on top of jail walls violates Article 21 of the Constitution.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether conditions of detention in jail violate Article 21.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Discipline of prison must have authority of law; iron curtain needed between prisoners and police to prevent influence and tyranny; police occupy part of prison (appurtenant land) causing interference with fundamental rights.",
      "supporting_facts": [
        "f5",
        "f6",
        "f7"
      ],
      "legal_basis": "Prisons Act, 1894 Section 3(1); Article 21"
    },
    {
      "id": "pa2",
      "text": "Livewire mechanism subjects escaping prisoner to death penalty without authority of law; violates policy in Section 224 IPC (max 2 years RI and fine); flagrant violation of Article 21.",
      "supporting_facts": [
        "f5",
        "f10"
      ],
      "legal_basis": "IPC Section 224; Article 21"
    },
    {
      "id": "pa3",
      "text": "Segregation, inhuman treatment, subhuman conditions violate right to life and personal liberty under Article 21.",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": "Article 21"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Livewire mechanism reasonable restriction to prevent escape.",
      "supporting_facts": [
        "f9",
        "f10"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Amenities provided are adequate; denies subhuman conditions.",
      "supporting_facts": [
        "f12"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Convicts not denuded of all fundamental rights by conviction; incarceration deprives freedoms like movement but not others like property; entitled to Article 21 protection.",
      "addresses_issue": "i1",
      "key_observation": "No right to dictate guards to prevent escape; police outside high walls cause no interference."
    },
    {
      "id": "cr2",
      "text": "Infiltration of police into prisons deprecated, especially for under-trials, but here police have no access inside enclosed jail; hypothetical considerations.",
      "addresses_issue": "i1",
      "key_observation": "Presence in vicinity does not interfere with personal liberty."
    },
    {
      "id": "cr3",
      "text": "No satisfactory proof of subhuman conditions violating Article 21; matters of reform, extend Article 42 to jail conditions; barbarous punishments offend Constitution.",
      "addresses_issue": "i3",
      "key_observation": "Allegations not proven; hope amenities true."
    },
    {
      "id": "cr4",
      "text": "Livewire lacks statutory basis (not law under Article 13(3)(a) or procedure under Article 21), but no violation of rights as contact only if attempt escape; no fundamental right to escape.",
      "addresses_issue": "i2",
      "key_observation": "Preventive deterrent; similar to high walls."
    },
    {
      "id": "cr5",
      "text": "Does not contravene CrPC Section 46(3); not causing death by itself, only if prisoner attempts escape.",
      "addresses_issue": "i2",
      "key_observation": "Analogy to arrest/escape provisions inapplicable directly."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Posting of police guards outside jail on appurtenant land does not violate fundamental rights.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Livewire mechanism does not interfere with fundamental rights under Article 21.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "No proven violation of Article 21 by jail conditions.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "State of Maharashtra v. Prabhakar Pandurang Sangzgiri",
      "citation": "AIR 1966 SC (1 SCR 702)",
      "treatment": "followed",
      "relevance": "Detenu's right to send manuscript for publication; conditions of detention imply basic necessities; infringement of liberty."
    },
    {
      "case_name": "Kharak Singh v. State of U.P.",
      "citation": "1964 1 SCR 332",
      "treatment": "followed",
      "relevance": "Approved US view on 'life' meaning more than animal existence."
    },
    {
      "case_name": "Munn v. Illinois",
      "citation": "94 US 113",
      "treatment": "referred",
      "relevance": "'Life' includes faculties by which life enjoyed; due process."
    }
  ],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Article 32",
        "Article 21",
        "Article 13(3)(a)",
        "Article 42"
      ],
      "relevance": "Writ jurisdiction; right to life/liberty; law/procedure; humane conditions."
    },
    {
      "name": "Prisons Act, 1894",
      "sections": [
        "Section 3(1)"
      ],
      "relevance": "Definition of 'prison' includes appurtenant lands."
    },
    {
      "name": "Indian Penal Code, 1860",
      "sections": [
        "Section 224"
      ],
      "relevance": "Punishment for escape from custody (max 2 years RI, fine); contrasted with livewire."
    },
    {
      "name": "Code of Criminal Procedure, 1898",
      "sections": [
        "Section 46"
      ],
      "relevance": "Mode of arrest, force; no right to cause death except for serious offences; analogy to escape/retaking."
    },
    {
      "name": "Defence of India Rules, 1962",
      "sections": [
        "Rule 30(1)(b)",
        "Rule 30(4)"
      ],
      "relevance": "Conditions of detention imply basic rights."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The writ petitions are dismissed as the acts complained of (police guards and livewire) do not interfere with fundamental rights; rule discharged.",
    "relief_granted": "None",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "Convicts are not, by mere reason of the conviction, denuded of all the fundamental rights which they otherwise possess.",
      "speaker": "court",
      "significance": "Affirms prisoners retain fundamental rights except those inherently lost by incarceration."
    },
    {
      "id": "kq2",
      "text": "No person, not even a prisoner, can be deprived of his life or personal liberty except according to procedure established by law.",
      "speaker": "court",
      "significance": "Reiterates Article 21 applies to prisoners."
    },
    {
      "id": "kq3",
      "text": "Whatever be the nature and extent of the petitioners' fundamental right to life and personal liberty, they have no fundamental freedom to escape from lawful custody.",
      "speaker": "court",
      "significance": "Key holding on livewire; no right to escape."
    }
  ],
  "_case_id": "1974_241",
  "_label": 0,
  "_text_length": 18773,
  "_extracted_at": "2026-02-10T20:05:33.330382"
}