{
  "metadata": {
    "case_name": "Collector of Customs, Madras v. Respondent",
    "case_year": 1973,
    "court": "Supreme Court of India",
    "judges": [
      "BEG, J."
    ],
    "case_number": "Civil Appeal No. 1161 of 1973",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Respondent imported a large quantity of sewing machine needles under a licence.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Customs Department held that the licence did not cover the imported sewing machine needles, as they fell under Item 288 of Schedule I of Import Control Order, 1955 ('Needles for domestic sewing machines').",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "Customs authorities confiscated the imported needles and imposed a penalty of Rs. 5,000 on the respondent.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "Central Government confirmed the confiscation order.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "Single Judge of Madras High Court set aside the penalty but maintained the confiscation order, holding needles not proved to be prohibited.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "Respondent appealed to Division Bench of Madras High Court against refusal to quash confiscation.",
      "type": "procedural",
      "date": "1973-06-26",
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Division Bench quashed confiscation and penalty, holding no prohibition under Section 3 of Imports & Exports (Control) Act, 1947, as Import Control Order did not specify prohibition for these goods.",
      "type": "procedural",
      "date": "1973-06-26",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Respondent contended that imported needles could be used in both domestic and industrial sewing machines or were interchangeable, not confined to domestic only.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f9",
      "text": "In Import Trade Control Policy (Red Book), 'nil' appeared against needles for domestic sewing machines for relevant year.",
      "type": "background",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether there was a prohibition on import of needles for domestic sewing machines without a licence under Section 3 of Imports & Exports (Control) Act, 1947 and Clause 3 of Import Control Order, 1955.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the respondent's import licence covered the particular goods imported (sewing machine needles claimed to be interchangeable).",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether rules of natural justice were violated at the inquiry held by customs authorities.",
      "framed_by": "respondent"
    },
    {
      "id": "i4",
      "text": "Whether customs authorities acted in accordance with law in holding imported goods to be prohibited category.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Clause 3 of Import Control Order, 1955 prohibits import of goods in Schedule I (including Item 288: Needles for domestic sewing machines) except under licence; imported needles fall under this.",
      "supporting_facts": [
        "f2",
        "f9"
      ],
      "legal_basis": "Imports & Exports (Control) Act, 1947 Section 3; Import Control Order, 1955 Clause 3, Schedule I Item 288"
    },
    {
      "id": "pa2",
      "text": "Prohibition is conditional and lifted only by valid licence covering the goods; respondent's licence did not cover.",
      "supporting_facts": [
        "f1",
        "f2"
      ],
      "legal_basis": "Customs Act, 1962 Section 111"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "No prohibition or restriction as contemplated by Section 3 of the Act, since Import Control Order did not specify these goods and policy showed 'nil'; needles interchangeable for domestic and industrial use.",
      "supporting_facts": [
        "f8",
        "f9"
      ],
      "legal_basis": "Imports & Exports (Control) Act, 1947 Section 3"
    },
    {
      "id": "ra2",
      "text": "Rules of natural justice violated at inquiry; needles not proved to be exclusively for domestic sewing machines.",
      "supporting_facts": [
        "f2",
        "f5"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Section 3 of the Act and Clause 3 of Import Control Order impose unambiguous prohibition on import of Schedule I goods without licence; prohibition is conditional, lifted by licence permitting it.",
      "addresses_issue": "i1",
      "key_observation": "Language of Clause 3 prohibits unless under licence; 'nil' in Red Book does not override gazetted Control Order."
    },
    {
      "id": "cr2",
      "text": "Division Bench erred in holding no prohibition; reference to Red Book misled, as Control Order was duly notified.",
      "addresses_issue": "i1",
      "key_observation": "Distinguishes case where no gazetted order existed."
    },
    {
      "id": "cr3",
      "text": "Division Bench did not decide if licence covered goods or natural justice violated; High Court can correct errors of law or remit if natural justice breached.",
      "addresses_issue": "i2",
      "key_observation": "Real question is whether licence covers imported goods."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Prohibition exists under Clause 3 of Import Control Order, 1955 against import of needles for domestic sewing machines without licence.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Other undecided questions (licence coverage, natural justice) to be decided by Division Bench.",
      "resolves_issue": "i2",
      "in_favor_of": "partial"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Joint Chief Controller of Imports & Exports, Madras v. M/s. Amichand Mutha etc.",
      "citation": "(1966) 1 SCR 262",
      "treatment": "distinguished",
      "relevance": "'Nil' in policy does not prohibit without gazetted order; here, Control Order was gazetted unlike that case."
    }
  ],
  "statutes_cited": [
    {
      "name": "Imports & Exports (Control) Act, 1947",
      "sections": [
        "Section 3",
        "Section 4A"
      ],
      "relevance": "Empowers prohibition/restriction by gazetted order; all such goods deemed prohibited under Customs Act."
    },
    {
      "name": "Import Control Order, 1955",
      "sections": [
        "Clause 3",
        "Schedule I Item 288"
      ],
      "relevance": "Prohibits import of specified goods (domestic sewing machine needles) except under licence."
    },
    {
      "name": "Customs Act, 1962",
      "sections": [
        "Section 111"
      ],
      "relevance": "Applies to prohibited imports; licence utilisation if goods do not conform."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; judgment of Division Bench of Madras High Court set aside; respondent's appeal restored to original number in High Court to be heard and decided in accordance with law on undecided issues.",
    "relief_granted": "Remitted to Division Bench for decision on merits, licence coverage, and natural justice.",
    "costs": "No costs of the appeal to this Court."
  },
  "key_quotes": [
    {
      "text": "\"no person shall import any goods of the description specified in Schedule I, except under, and in accordance with, a licence or a customs clearance permit\" - Clause 3.",
      "speaker": "court",
      "significance": "Defines the conditional prohibition central to the holding."
    },
    {
      "text": "This language cannot have a meaning other than that the prohibition is there so long as goods of the description given in the schedule are not imported in accordance with an import licence.",
      "speaker": "court",
      "significance": "Crux of court's interpretation of prohibition as conditional."
    },
    {
      "text": "The prohibition is conditional in as much as it can be lifted by a licence which permits it.",
      "speaker": "court",
      "significance": "Explains nature of prohibition and frames key undecided issue."
    }
  ],
  "_case_id": "1974_149",
  "_label": 1,
  "_text_length": 12760,
  "_extracted_at": "2026-02-10T20:04:46.522850"
}