{
  "metadata": {
    "case_name": "Jehan Singh v. State",
    "case_year": 1970,
    "court": "Supreme Court of India",
    "judges": [
      "Sarkaria, J."
    ],
    "case_number": "Criminal Appeal No. 201 of 1970",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "On June 15, 1969, a report was lodged in Police Station, Tilak Marg, New Delhi, by Munshi Ram alleging that he was employed as a Driver of bus DLP 3867 belonging to Indraj Singh and Sukh Lal of Chirag Delhi.",
      "type": "material",
      "date": "1969-06-15",
      "source": "petitioner"
    },
    {
      "id": "f2",
      "text": "On June 13, 1969 at 6 p.m., Munshi Ram stopped the bus at Mathura Road to talk to Devi Singh son of Ganesh Lal, who invited informant, Mahinder Singh Conductor and Sher Singh helper to soft-drinks at a nearby shop. They left the bus unattended.",
      "type": "material",
      "date": "1969-06-13",
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "Jehan Singh appellant, Sharma, R. K. Pathak and another man of stout-build got into the vehicle. The stout man took the steering wheel, and all four drove away despite protests of informant and companions.",
      "type": "disputed",
      "date": "1969-06-13",
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "Munshi Ram went to Chirag Delhi to inform employer Indraj Singh but found him absent. Report mentioned Pathak and Sharma employed in Scindia House.",
      "type": "material",
      "date": "1969-06-13",
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "Police started investigation, arrested Jehan Singh and R. K. Pathak (Assistant Manager of Industrial Credit Co. Ltd., Scindia House). They were released on bail. Bus seized from possession of the Company.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Pathak and appellant filed petitions under s. 561A CrPC challenging police proceedings pursuant to FIR by Munshi Ram.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "Delhi High Court by common judgment allowed Pathak's petition and quashed proceedings against him, but dismissed appellant's petition observing that if Jehan Singh transferred rights in bus against hire-purchase agreement, trial court to consider if guilty of theft.",
      "type": "procedural",
      "date": "1970-02-03",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "At date of filing s.561A petitions, no charge-sheet or complaint laid in court; matter still at police investigation stage.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether petitions under s. 561A CrPC to quash police investigation proceedings are competent and not premature when no charge-sheet has been filed and matter is still at investigation stage.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether allegations in FIR, if taken at face value, constitute offence of theft or abetment thereof against appellant.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Case falls within exception to general rule against interference with police investigation; allegations in FIR even if accepted do not constitute offence alleged.",
      "supporting_facts": [
        "f3",
        "f7"
      ],
      "legal_basis": "R. P. Kapur v. State of Punjab (1960 3 SCR 388)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Petitions under s. 561A to quash proceedings during police investigation are incompetent and premature.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": "King Emperor v. Khwaja Nazir Ahmad (71 IA 203); State of West Bengal v. S. N. Basak (1963 2 SCR 54)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Functions of judiciary and police are complementary, not overlapping; courts' functions begin when charge preferred, not until then. S.561A preserves inherent powers but does not allow interference with statutory police investigation power under Chapter XIV CrPC.",
      "addresses_issue": "i1",
      "key_observation": "Preliminary objection prevails; petitions premature as no charge-sheet filed."
    },
    {
      "id": "cr2",
      "text": "Rule in Basak case applies as basic facts similar: no challan or charge-sheet laid when petitions filed; proceedings were part of police investigation.",
      "addresses_issue": "i1",
      "key_observation": "Police has statutory right to investigate cognizable offences without Magistrate's authority; cannot be interfered via s.439 or s.561A."
    },
    {
      "id": "cr3",
      "text": "R.P. Kapur exception does not apply: allegations in FIR, if correct, disclose cognizable offence of theft; High Court cannot appraise evidence or reliability at this stage.",
      "addresses_issue": "i2",
      "key_observation": "FIR alleges wrongful removal of bus from possession of owners' servants without consent despite opposition."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Petitions under s. 561A CrPC liable to be dismissed as premature and incompetent when filed during police investigation stage before any charge-sheet.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "High Court cannot, under s.561A, interfere with police investigation or embark on enquiry into evidence reliability; allegations in FIR disclose offence.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "King Emperor v. Khwaja Nazir Ahmad",
      "citation": "71 I.A. 203",
      "treatment": "followed",
      "relevance": "Police and court functions complementary; no interference with investigation before charge laid; s.561A preserves inherent powers only."
    },
    {
      "case_name": "State of West Bengal v. S. N. Basak",
      "citation": "1963 2 S.C.R. 54",
      "treatment": "followed",
      "relevance": "Police statutory power to investigate cognizable offences under Chapter XIV CrPC cannot be interfered by s.439 or s.561A."
    },
    {
      "case_name": "R. P. Kapur v. State of Punjab",
      "citation": "1960 3 S.C.R. 388",
      "treatment": "referred",
      "relevance": "Exception to non-interference rule where FIR allegations do not constitute offence; High Court cannot appraise evidence."
    }
  ],
  "statutes_cited": [
    {
      "name": "Code of Criminal Procedure",
      "sections": [
        "s. 561A",
        "s. 154",
        "s. 156",
        "s. 173",
        "s. 439"
      ],
      "relevance": "Inherent power to quash proceedings preserved but not to interfere with police investigation of cognizable offences."
    },
    {
      "name": "Indian Penal Code",
      "sections": [
        "s. 420",
        "s. 120B"
      ],
      "relevance": "Mentioned in context of Basak case offences."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal dismissed on ground that s.561A petitions were premature and incompetent as filed during police investigation stage before any charge-sheet; no observations on merits to prejudice parties.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The functions of the judiciary and the police are complementary, not overlapping and that the courts. functions begin when a charge is preferred before it, and not until then.",
      "speaker": "court",
      "significance": "Core principle against interfering with police investigation."
    },
    {
      "text": "the statutory power of the police to investigate cannot be interfered with by the exercise of power under s. 439 or under the inherent power of the court under s. 561-A",
      "speaker": "court",
      "significance": "Limits High Court's jurisdiction during investigation."
    },
    {
      "text": "In exercise of its jurisdiction under S. 561-A, the High Court cannot embark upon an enquiry as to whether the evidence in the case is reliable or not.",
      "speaker": "court",
      "significance": "Prohibits evidence appraisal at quashing stage."
    }
  ],
  "_case_id": "1974_80",
  "_label": 0,
  "_text_length": 10732,
  "_extracted_at": "2026-02-10T20:03:15.528247"
}