{
  "metadata": {
    "case_name": "Election Petitioner (Appellant) v. 1st Respondent (Elected Candidate from Shirdi Constituency)",
    "case_year": 1972,
    "court": "Supreme Court of India",
    "judges": [
      "ALAGIRISWAMI, J."
    ],
    "case_number": "Civil Appeal No. 2365 of 1972",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "In the election to the Maharashtra State Legislative Assembly held on March 7, 1972 the 1st respondent was declared elected from Shirdi Constituency.",
      "type": "material",
      "date": "1972-03-07",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The appellant, a voter from that constituency filed an election petition questioning election of the 1st respondent on two grounds: corrupt practices and disqualified for holding office of profit as member of Wage Board for Sugar Industry constituted by Government of Maharashtra under section 86-B of Bombay Industrial Relations Act, 1946.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "February 8, 1972 was the last date for filing nominations and February 11, 1972 the last date for withdrawal of candidature.",
      "type": "background",
      "date": "1972-02-08",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The 1st respondent resigned as a member of the Wage Board on February 20, 1972 and the letter of resignation was received by the concerned authorities on February 22, 1972.",
      "type": "material",
      "date": "1972-02-20",
      "source": "respondent"
    },
    {
      "id": "f5",
      "text": "The 1st respondent was nominated as a member of the Wage Board on 13th April 1971 to represent the employers.",
      "type": "background",
      "date": "1971-04-13",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "First Wage Board for Sugar Industry constituted in 1956 by Government notification; new Wage Board in 1967 with five members.",
      "type": "background",
      "date": "1956",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Members of Wage Board paid honorarium at Rs. 25 per day of meeting, travelling allowance and daily allowance as per Bombay Civil Services Rules.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "1st respondent's evidence: Spent Rs. 20 taxi fare, Rs. 25 for meals, Rs. 40 for lodging (Rs. 15-16 common room, Rs. 28-30 single room including board) when attending meetings in Bombay.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f9",
      "text": "Daily allowance Rs. 18, payable for halt up to six hours or half for less; same rate regardless of location.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "High Court judge accepted respondent's evidence and concluded aggregate of honorarium and daily allowance hardly sufficient to meet personal expenditure.",
      "type": "procedural",
      "date": "1972-09-22",
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the membership of the Wage Board is an office of profit under the State Government.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Membership of Wage Board is an office under State Government and an office of profit due to honorarium of Rs.25 per day, which is not compensatory allowance but payment for services rendered.",
      "supporting_facts": [
        "f5",
        "f7"
      ],
      "legal_basis": "Item 11, Schedule I, Bombay Legislature Members Removal of Disqualifications Act, 1956; dictionary meaning of honorarium"
    },
    {
      "id": "pa2",
      "text": "Honorarium cannot be brought within 'such other allowance' as it is a fee, not for meeting personal expenditure.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "Shorter Oxford Dictionary"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Honorarium and allowances are compensatory, not profit; actual expenses exceed payments; no pecuniary gain.",
      "supporting_facts": [
        "f8",
        "f9",
        "f10"
      ],
      "legal_basis": "Item 11, Schedule I, Bombay Legislature Members Removal of Disqualifications Act, 1956"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Membership is an office under State Government: Government appoints, can continue or revoke; performs functions for Government under its control.",
      "addresses_issue": "i1",
      "key_observation": "Satisfies tests: appointment by Govt, right to remove, functions for Govt, control over performance."
    },
    {
      "id": "cr2",
      "text": "Not an office of profit: Honorarium and DA are compensatory allowances to meet personal expenditure; no pecuniary gain as expenses exceed payments; burden on petitioner to prove excess not discharged.",
      "addresses_issue": "i1",
      "key_observation": "Matter of substance not form; realistic view; evidence shows payments hardly sufficient."
    },
    {
      "id": "cr3",
      "text": "Daily/TA not profit per Item 11 Schedule I; honorarium similarly compensatory.",
      "addresses_issue": "i1",
      "key_observation": "No evidence of profit unless staying with friends/relatives."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The 1st respondent did not hold an office of profit under the Government.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Maulana Abdul Shakur v. Rikhabchand",
      "citation": "1958 SCR 387",
      "treatment": "followed",
      "relevance": "Power of Govt to appoint/continue/revoke and payment from revenue determine office of profit."
    },
    {
      "case_name": "Ramappa v. Sangappa",
      "citation": "1959 SCR 1167",
      "treatment": "followed",
      "relevance": "Office held under someone; appointment by Govt means under Govt."
    },
    {
      "case_name": "Gurugobinda Basu v. Sarkari Prasad Ghosal",
      "citation": "1964 4 SCR 311",
      "treatment": "followed",
      "relevance": "No need for master-servant; CAG holds office of profit."
    },
    {
      "case_name": "Shivamurthy Swami v. Agadi Sanganna Andanappa",
      "citation": "1971 3 SCC 870",
      "treatment": "followed",
      "relevance": "Tests for office under Govt and of profit: appointment, removal, remuneration, functions, control."
    },
    {
      "case_name": "Ravanna Subanna v. S. Kaggeerappa",
      "citation": "AIR 1954 SC 653",
      "treatment": "followed",
      "relevance": "Fee for sittings compensatory for out-of-pocket expenses, not remuneration if no pecuniary gain."
    },
    {
      "case_name": "Umrao Singh v. Darbara Singh",
      "citation": "1969 1 SCR 421",
      "treatment": "followed",
      "relevance": "Consolidated allowance compensatory; burden on challenger to prove excess over expenses."
    },
    {
      "case_name": "Mahadeo v. Shantibhai",
      "citation": "1969 2 SCR 422",
      "treatment": "distinguished",
      "relevance": "Payment for court adjournments profit as no expenses incurred."
    }
  ],
  "statutes_cited": [
    {
      "name": "Bombay Industrial Relations Act, 1946",
      "sections": [
        "86B",
        "86C",
        "86G",
        "86H",
        "86I",
        "86J"
      ],
      "relevance": "Wage Board constituted under; powers, appeals, binding parties, review, superintendence."
    },
    {
      "name": "Bombay Legislature Members Removal of Disqualifications Act, 1956",
      "sections": [
        "Item 11, Schedule I; Section 2"
      ],
      "relevance": "Compensatory allowance defined; excludes offices where only compensatory allowance received."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal against the Bombay High Court order dismissing the election petition is dismissed, holding that the 1st respondent did not hold an office of profit as Wage Board member.",
    "relief_granted": "None",
    "costs": "Dismissed with costs."
  },
  "key_quotes": [
    {
      "text": "The power of the Government to appoint a person to an office of profit or to continue him in that office or revoke his appointment at their discretion and payment from out of Government revenue are important factors.",
      "speaker": "court",
      "significance": "Test for office of profit from Maulana Abdul Shakur."
    },
    {
      "text": "The matter must be considered as a matter of substance rather than of form, of the essence of payment rather than its nomenclature.",
      "speaker": "court",
      "significance": "Approach to determining if payment is profit."
    },
    {
      "text": "The law regarding the question whether a person holds an office of profit should be interpreted reasonably having regard to the circumstances of the case and the times with which one is concerned, as also the class of person whose case we are dealing with and not divorced from reality.",
      "speaker": "court",
      "significance": "Realistic interpretation principle."
    }
  ],
  "_case_id": "1974_323",
  "_label": 0,
  "_text_length": 19579,
  "_extracted_at": "2026-02-10T20:06:05.787139"
}