{
  "metadata": {
    "case_name": "Appellant v. Respondent",
    "case_year": 1971,
    "court": "Supreme Court of India",
    "judges": [
      "RAY, C.J."
    ],
    "case_number": "Civil Appeal No. 1991 of 1971",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant filed suit on 2 September 1964 in the High Court of Bombay claiming six months salary in lieu of notice and gratuity for 16 years of service.",
      "type": "procedural",
      "date": "1964-09-02",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "In 1965 the appellant asked for discovery by the respondent of documents relating to pension scheme for foreign employees. The application for discovery was dismissed in November 1965.",
      "type": "procedural",
      "date": "1965",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On 16 December 1969 the appellant took out a Chamber Summons for amendment of the plaint. The proposed amendments were twofold: first set related to averments in support of claim for gratuity already alleged; second set related to claim for Rs. 850 per month by way of pension from 1 February 1964 during lifetime of appellant.",
      "type": "procedural",
      "date": "1969-12-16",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "By order dated 19 January 1970 the appellant was allowed to amend plaint in respect of claim for gratuity. Proposed amendment for pension claim was refused.",
      "type": "procedural",
      "date": "1970-01-19",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "By summons dated 27 April 1970 the appellant sought amendment of plaint claiming Rs. 68,000 as damages in relation to right to pension.",
      "type": "procedural",
      "date": "1970-04-27",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "By order dated 6 July 1970 the appellant was allowed to amend plaint as prayed for.",
      "type": "procedural",
      "date": "1970-07-06",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Respondent preferred appeal against order dated 6 July 1970.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "High Court of Bombay by judgment dated 29 March 1971 allowed the appeal and set aside order dated 6 July 1970.",
      "type": "procedural",
      "date": "1971-03-29",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Appeal to Supreme Court by certificate from High Court judgment.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Respondent contended before trial court that amendment should not be allowed inter alia on ground that alleged claim was barred by limitation in 1970.",
      "type": "disputed",
      "date": "1970",
      "source": "respondent"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether an order allowing amendment of plaint claiming damages for right to pension is a 'judgment' within the meaning of clause 15 of the Letters Patent, appealable to High Court.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether High Court should interfere with discretionary order allowing amendment of plaint.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "No appeal lies against order of amendment because it is not a judgment within meaning of clause 15 of Letters Patent; judgment means decision finally adjudicating rights between parties on substantive rights; amendment is procedural.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": "Dayabhai v. Murrugappa Chettiar I.L.R. 13 Rang. 457; Manohar v. Baliram I.L.R. 1952 Nag. 471"
    },
    {
      "id": "pa2",
      "text": "Order allowing amendment is discretionary; appellate court should not interfere with discretion.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Second application for amendment claiming damages in relation to pension is not the same as first application for pension claim.",
      "supporting_facts": [
        "f3",
        "f5"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Amendment should not be allowed as claim barred by limitation; order allowing amendment deprives respondent of defense of limitation.",
      "supporting_facts": [
        "f10"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Judgment under clause 15 Letters Patent means decision affecting merits by determining right or liability; may be final, preliminary or interlocutory.",
      "addresses_issue": "i1",
      "key_observation": "Cited Sir Richard Couch C.J. in Justice of the Peace for Calcutta v. Oriental Gas Company."
    },
    {
      "id": "cr2",
      "text": "Order of transfer not judgment as neither affects merits nor terminates suit (Asrumati Debi v. Kumar Rupendra). Tests: final pronouncement ending proceeding; determination of right/liability.",
      "addresses_issue": "i1",
      "key_observation": "Referred to Tuljaram v. Alagappa."
    },
    {
      "id": "cr3",
      "text": "Amendment order allowing claim barred by limitation determines right/liability; deprives defendant of immunity from liability; is judgment under cl15 LP.",
      "addresses_issue": "i1",
      "key_observation": "Agreed with M.B. Sarkar Sons v. Powell Co.; distinguished mere procedural amendments."
    },
    {
      "id": "cr4",
      "text": "Second amendment is new claim based on new facts, barred by limitation; no special circumstances to allow despite lapse of time.",
      "addresses_issue": "i2",
      "key_observation": "Appellate court can interfere with discretionary order if insupportable; cited Charan Das v. Amir Khan."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Order allowing amendment claiming damages for pension (barred by limitation) is a judgment under clause 15 Letters Patent as it determines right/liability by taking away defense of limitation.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "High Court rightly interfered as no special circumstances; amendment not allowable.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Justice of the Peace for Calcutta v. Oriental Gas Company",
      "citation": "8 Bengal L.R. 433",
      "treatment": "followed",
      "relevance": "Definition of judgment: decision affecting merits by determining right/liability; final, preliminary or interlocutory."
    },
    {
      "case_name": "Asrumati Debi v. Kumar Rupendra Deb Raikot Ors.",
      "citation": "1953 S.C.R. 1159",
      "treatment": "followed",
      "relevance": "Tests for judgment under cl15 LP: final pronouncement; determination of right/liability. Order of transfer not judgment."
    },
    {
      "case_name": "Tuljaram v. Alagappa",
      "citation": "I.L.R. 35 Mad. 1",
      "treatment": "referred",
      "relevance": "Effect of adjudication on suit: if ends proceeding or non-compliance ends it, is judgment."
    },
    {
      "case_name": "Dayabhai v. Murrugappa Chettiar",
      "citation": "I.L.R. 13 Rang. 457",
      "treatment": "distinguished",
      "relevance": "Petitioner view that judgment is decree determining rights."
    },
    {
      "case_name": "Manohar v. Baliram",
      "citation": "I.L.R. 1952 Nag. 471",
      "treatment": "distinguished",
      "relevance": "Petitioner view that judgment determines rights in suit."
    },
    {
      "case_name": "M.B. Sarkar Sons v. Powell Co.",
      "citation": "A.I.R. 1956 Cal. 630",
      "treatment": "followed",
      "relevance": "Amendment substituting new party taking away limitation defense is judgment under cl15 LP."
    },
    {
      "case_name": "Charan Das v. Amir Khan",
      "citation": "47 I.A. 255",
      "treatment": "referred",
      "relevance": "Amendment taking away accrued limitation right allowable only in exceptional cases with special circumstances."
    }
  ],
  "statutes_cited": [
    {
      "name": "Letters Patent",
      "sections": [
        "Clause 15",
        "Clause 12",
        "Clause 13"
      ],
      "relevance": "Defines 'judgment' for appeal purposes; amendment order affecting limitation is judgment."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court upheld Bombay High Court judgment setting aside trial court order allowing amendment of plaint to claim Rs.68,000 damages for pension right, as such order was a judgment under cl15 Letters Patent depriving respondent of limitation defense, with no special circumstances.",
    "relief_granted": null,
    "costs": "Appeal dismissed with costs."
  },
  "key_quotes": [
    {
      "text": "\"We think that judgment means a decision which affects the merits of the question between the parties by determining some right or liability.\"",
      "speaker": "court",
      "significance": "Definition of judgment from Sir Richard Couch C.J., foundational for analysis."
    },
    {
      "text": "\"If an amendment merely allows the plaintiff to state a new cause of action... it does nothing more than regulate the procedure... Where, on the other hand, an amendment takes away from the defendant the defence of immunity from any liability by reason of limitation, it is a judgment.\"",
      "speaker": "court",
      "significance": "Core holding distinguishing procedural vs substantive amendments affecting rights."
    }
  ],
  "_case_id": "1974_178",
  "_label": 0,
  "_text_length": 13900,
  "_extracted_at": "2026-02-10T20:04:46.835469"
}