{
  "metadata": {
    "case_name": "Assistant Collector of Customs v. Respondents",
    "case_year": 1970,
    "court": "Supreme Court of India",
    "judges": [
      "Chandrachud, J."
    ],
    "case_number": "Criminal Appeals Nos. 114 and 115 of 1970",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "On May 29, 1968 gold bars and sovereigns bearing foreign markings were seized from the respondents by customs officers, Calcutta.",
      "type": "material",
      "date": "1968-05-29",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Respondents were charged under section 135, Customs Act, 1962 for being in possession of goods which they had reason to believe to be liable to confiscation under section 111 of that Act.",
      "type": "procedural",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f3",
      "text": "It was alleged that the goods were imported into India without the requisite permit and without payment of duty and were therefore liable to confiscation under section 111(d) of the Customs Act.",
      "type": "disputed",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f4",
      "text": "Respondents were also charged under Rules 126P(1)(i) and 126P(2)(ii) of the Defence of India Rules, 1962, for failure to make a declaration in respect of the gold found in their possession.",
      "type": "procedural",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f5",
      "text": "Respondents pleaded guilty to the charges but cited facts in extenuation of the offences.",
      "type": "admitted",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f6",
      "text": "Learned Presidency Magistrate, 8th Court, Calcutta, convicted them but directed release under section 4(1) of the Probation of Offenders Act, 1958 on executing a bond of Rs. 1000/- each with one surety, for two years.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Respondents are young boys normally engaged in agriculture. They seem to be carriers who were carrying the gold for a small tip but the learned Magistrate believed their defence that they had purchased the gold for the marriage of the sister of one of them.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "The gold which was of the value of about Rs. 7800/- was already confiscated in the proceedings under the Customs Act.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Appellant, an Assistant Collector of Customs, filed revision application No. 635 of 1969 in the High Court of Calcutta against the judgment of the Magistrate, later converted into an appeal under section 11(2) of the Probation of Offenders Act.",
      "type": "procedural",
      "date": "1969-11-28",
      "source": "petitioner"
    },
    {
      "id": "f10",
      "text": "High Court of Calcutta disposed of the matter by common judgment reported in Aravinda Mohan Sinha v. Prohlad Chandra Samanta, holding that Rule 126P(2)(ii) cannot override Probation of Offenders Act.",
      "type": "procedural",
      "date": "1969-11-28",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "On June 27, 1968 three bars of foreign gold were found on the person of the respondent.",
      "type": "material",
      "date": "1968-06-27",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Respondent pleaded guilty; Presidency Magistrate, 6th Court, Calcutta convicted under section 135 Customs Act and Rules 126P(1)(i) and 126P(2)(ii) Defence of India Rules; sentenced to fines Rs.150 and Rs.100, no separate sentence for latter rule.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "High Court confirmed conviction and sentence under Customs Act but set aside convictions under Gold Control Rules holding no declaration needed for smuggled gold.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "Part XII-A Gold Control consisting of Rules 126A to 126Z inserted in Defence of India Rules by G.S.R. 89 dated January 9, 1963.",
      "type": "background",
      "date": "1963-01-09",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the Probation of Offenders Act, 1958, can apply to offences under the Customs Act, 1962 and to those under Part-XII-A of the Defence of India Rules, 1962, intituled Gold Control.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether a person in possession of smuggled gold is required to make a declaration under Rule 126I of the Defence of India Rules, and whether Rule 126P applies to smuggled gold.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Probation of Offenders Act can have no application to offences consisting of the contravention of the Customs Act or the Gold Control Rules contained in Part XII-A of the Defence of India Rules, 1962.",
      "supporting_facts": [
        "f2",
        "f4",
        "f10"
      ],
      "legal_basis": "Section 135(b)(ii) Customs Act, 1962; Rules 126P Defence of India Rules"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Cited facts in extenuation of the offences; defence that they had purchased the gold for the marriage of the sister of one of them.",
      "supporting_facts": [
        "f5",
        "f7"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Unable to accept that Probation of Offenders Act has no application to these offences; words of section 4(1) are wide and include such offences; it is a reformative measure to reclaim amateur offenders.",
      "addresses_issue": "i1",
      "key_observation": "Every contravention cannot be assumed fraught with consequences of national dimensions; punishment must be proportioned to offence."
    },
    {
      "id": "cr2",
      "text": "No legal impediment in applying Probation Act; discretion of trial court exercised on basis of Probation Officer report; neither urged earlier that not expedient due to antecedents.",
      "addresses_issue": "i1",
      "key_observation": "High Court upheld; no reason to interfere."
    },
    {
      "id": "cr3",
      "text": "No justification for view that smuggled gold not comprehended within Rule 126P; definition of gold in Rule 126A(d) wide, no distinction between smuggled and lawful gold.",
      "addresses_issue": "i2",
      "key_observation": "Legislature intention from words; obligation applies to all gold; scheme of rules covers smuggled gold."
    },
    {
      "id": "cr4",
      "text": "Scheme of Part XII-A shows gold means gold in any form, whether possessed lawfully or otherwise; object to control all gold possession.",
      "addresses_issue": "i2",
      "key_observation": "Prohibitions apply even to smuggled gold; no defence based on smuggling."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Probation of Offenders Act, 1958 applies to offences under Customs Act, 1962 and Gold Control Rules; release on probation upheld.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Person in possession of smuggled gold required to declare under Rule 126I; convictions under Rules 126P(1)(i) and 126P(2)(ii) restored.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Ratan Lal v. State of Punjab",
      "citation": "1964 7 S.C.R. 676",
      "treatment": "followed",
      "relevance": "Remanded for consideration of applying Probation Act even if not prayed earlier; milestone in penology reform."
    },
    {
      "case_name": "Isher Das v. State of Punjab",
      "citation": "A.I.R. 1972 S.C. 1295",
      "treatment": "followed",
      "relevance": "Probation Act applicable even to food adulteration offences."
    },
    {
      "case_name": "Jai Narain v. Municipal Corporation of Delhi",
      "citation": "A.I.R. 1972 S.C. 2607",
      "treatment": "followed",
      "relevance": "Affirmed principle but refused probation on facts."
    },
    {
      "case_name": "K. Vishnumoorthi v. State of Mysore",
      "citation": null,
      "treatment": "referred",
      "relevance": "View of single Judge of Mysore High Court mentioned."
    }
  ],
  "statutes_cited": [
    {
      "name": "Customs Act, 1962",
      "sections": [
        "Section 135",
        "Section 111(d)"
      ],
      "relevance": "Offence of possession of goods liable to confiscation; imported contrary to prohibition."
    },
    {
      "name": "Defence of India Rules, 1962",
      "sections": [
        "Part XII-A (Gold Control)",
        "Rule 126P(1)(i)",
        "Rule 126P(2)(ii)",
        "Rule 126I",
        "Rule 126A(d)",
        "Rule 126",
        "Rule 126B",
        "Rule 126C",
        "Rule 126D",
        "Rule 126F",
        "Rule 126G",
        "Rule 126H",
        "Rule 126L",
        "Rule 126M"
      ],
      "relevance": "Failure to declare gold; possession in contravention; definitions and prohibitions on gold."
    },
    {
      "name": "Probation of Offenders Act, 1958",
      "sections": [
        "Section 4(1)",
        "Section 3"
      ],
      "relevance": "Release on probation instead of sentencing; applies notwithstanding other laws."
    },
    {
      "name": "Foreign Exchange Regulation Act, 1947",
      "sections": [
        "Section 8(1)"
      ],
      "relevance": "Prohibition on import without permit."
    },
    {
      "name": "Code of Criminal Procedure",
      "sections": [
        "Section 562",
        "Sections 245(2)",
        "258(2)",
        "306(2)",
        "309(2)"
      ],
      "relevance": "Release on probation; sentence follows conviction."
    }
  ],
  "outcome": {
    "disposition": "partially_accepted",
    "summary": "In Criminal Appeal No. 114 of 1970, judgment of High Court affirmed, upholding release of respondents on probation. In Criminal Appeal No. 115 of 1970, High Court judgment set aside regarding Gold Control Rules; convictions and sentences under Rules 126P(1)(i) and 126P(2)(ii) restored, Customs conviction already confirmed.",
    "relief_granted": "Probation upheld in first appeal; convictions restored in second appeal",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The Probation of Offenders Act is a reformative measure and its object is to reclaim amateur offenders who, if spared the indignity of incarceration, can be usefully rehabilitated in society.",
      "speaker": "court",
      "significance": "Explains purpose and applicability of Probation Act"
    },
    {
      "text": "The words of section 4(1) of the Probation of Offenders Act are wide and would evidently include offences under the Customs Act and the Gold Control Rules.",
      "speaker": "court",
      "significance": "Holds Act applies to economic offences like Customs and Gold Control"
    },
    {
      "text": "Under the definition contained in Rule 126A(d), gold means gold and no rule of statutory construction can permit the definition to be altered materially so as to read 'Gold means gold but shall not include smuggled gold'.",
      "speaker": "court",
      "significance": "Rejects exclusion of smuggled gold from declaration requirement"
    }
  ],
  "_case_id": "1974_8",
  "_label": 1,
  "_text_length": 22516,
  "_extracted_at": "2026-02-10T20:03:20.288237"
}