{
  "metadata": {
    "case_name": "M. M. Thammaiah & B. M. Kariappa v. State of Mysore & Divisional Forest Officer",
    "case_year": 1975,
    "court": "Supreme Court of India",
    "judges": [
      "CHANDRACHUD, J."
    ],
    "case_number": "Civil Appeal No. 1721 of 1971 and 1000 of 1972",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant No. 1, M. M. Thammaiah, is the holder of immovable properties consisting partly of Bane lands, situate at Nemmale in the district of Coorg.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On October 17, 1968, Appellant No. 1 sold certain soft-wood trees standing on his lands to Appellant No. 2, B. M. Kariappa, for a sum of Rs. 20,000.",
      "type": "material",
      "date": "1968-10-17",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On September 23, 1969, Appellant No. 1 made an application to Respondent No. 2, the Divisional Forest Officer, for the issue of a permit in the name of Appellant No. 2 allowing him to cut and remove the timber.",
      "type": "procedural",
      "date": "1969-09-23",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Respondent No. 2 informed Appellant No. 1 that the Bane lands held by him were not redeemed and that no permission could be granted for cutting and removing the timber unless the timber value was paid under Rule 137 of the Mysore Forest Rules of 1969.",
      "type": "material",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f5",
      "text": "Aggrieved, Appellants filed Writ Petition No. 6394 of 1969 in the High Court of Mysore under Article 226 challenging the constitutionality of Rule 137, contending it violated Article 19(1)(f) and Article 31, was inconsistent with Section 75(1) of Mysore Land Revenue Act, 1964, and beyond rule-making powers under Mysore Forest Act, 1963.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "High Court of Mysore by judgment dated March 18, 1971 upheld validity of Rule 137 but held appellants liable to pay timber value only for trees in existence at the Survey Settlement of 1910, directing forest authorities to determine such trees and issue permit after payment.",
      "type": "procedural",
      "date": "1971-03-18",
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Lands granted to Appellant No. 1 by the Raja of Coorg, situated in Nemmale village, Virajpet Taluk, once part of princely State of Coorg.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Summary settlement carried out in 1896 under orders of Chief Commissioner of Coorg.",
      "type": "background",
      "date": "1896",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Coorg Land and Revenue Regulation (Regulation 1-A of 1899) came into force in 1899. Rule 97(1-A) provided that holder of Bane land who has not paid timber value enjoys personal usufruct for grant purpose; trees not to be cut/removed otherwise without permission and payment of timber value (Seignorage for redemption).",
      "type": "background",
      "date": "1899",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Explanation in Chapter V of Coorg Settlement Report, 1910: Bane lands allotted by Rajas for grazing, leaf manure, firewood for agricultural purposes to each Warg; not intended for cultivation.",
      "type": "background",
      "date": "1910",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "On October 9, 1906, sanction for resettlement of survey; notification under Rule 49 of Regulation 1 of 1899. Rules for Classifiers issued January 1908, in Appendix B to letter dated February 18, 1910 by Settlement Officer.",
      "type": "background",
      "date": "1906-10-09",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Rule 10 of Rules for Classifiers: Owner of unalienated Bane has exclusive right to cut/fell without charge for domestic/agricultural requirements in village (except sandalwood Govt property); no right for sale/barter/removal without permission.",
      "type": "background",
      "date": "1908",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Coorg became Part C State in 1950; part of Mysore (now Karnataka) on November 1, 1956. Existing laws continued until uniform laws.",
      "type": "background",
      "date": "1956-11-01",
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Mysore Forest Act, 5 of 1964 enacted to consolidate law on forests. Section 102 empowers rules. Mysore Forest Rules 1969 promulgated, including Rule 137 on redemption of trees in Bane lands.",
      "type": "background",
      "date": "1964-04-01",
      "source": "court"
    },
    {
      "id": "f15",
      "text": "Rule 137: No holder of Bane lands who has not paid timber value shall cut/remove trees for other than assigned purposes; redeem by payment or permit Forest Dept to extract.",
      "type": "background",
      "date": "1969",
      "source": "court"
    },
    {
      "id": "f16",
      "text": "Mysore Land Revenue Act, 12 of 1964 enacted April 1, 1964. Section 75(1): In villages with original survey settlement before commencement, State's right to trees deemed ceded to occupant except reserved trees.",
      "type": "background",
      "date": "1964-04-01",
      "source": "court"
    },
    {
      "id": "f17",
      "text": "Original survey settlement in Nemmale village completed before April 1, 1964.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f18",
      "text": "Rule 137 deleted by Karnataka Forest Amendment Rules, 1973 notified January 15, 1974 during pendency of appeal.",
      "type": "procedural",
      "date": "1974-01-15",
      "source": "court"
    },
    {
      "id": "f19",
      "text": "Writ petition in High Court sketchy, inadequate averments; State counter-affidavit formal denials.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether Rule 137 of Mysore Forest Rules, 1969 is violative of Article 19(1)(f) and Article 31 of the Constitution, inconsistent with Section 75(1) of Mysore Land Revenue Act, 1964, and beyond rule-making powers under Mysore Forest Act, 1963.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether trees on Bane lands are reserved by express order or notification under Section 75(1) of Mysore Land Revenue Act, 1964, particularly via Rule 10 of Rules for Classifiers in Coorg Settlement Report, 1910.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether Appellant No. 1 is an 'occupant' entitled to benefit of Section 75(1); whether Section 75(1) confers new rights; interplay with Section 79(2); whether Rule 97(1-A) of Coorg Rules reserves trees.",
      "framed_by": "respondent"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Entitled to permit without payment of any timber value; Rule 137 unconstitutional (violates Art 19(1)(f), 31), inconsistent with Sec 75(1) MLRA 1964 deeming owner of trees, ultra vires Mysore Forest Act 1963.",
      "supporting_facts": [
        "f2",
        "f3",
        "f5",
        "f16",
        "f17"
      ],
      "legal_basis": "Article 19(1)(f), Article 31, Section 75(1) Mysore Land Revenue Act 1964, Mysore Forest Act 1963"
    },
    {
      "id": "pa2",
      "text": "By virtue of Sec 75(1) MLRA 1964, deemed owner of trees on Bane lands; DFO has no right to demand timber value under Rule 137.",
      "supporting_facts": [
        "f1",
        "f16",
        "f17"
      ],
      "legal_basis": "Section 75(1) Mysore Land Revenue Act 1964"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "No distinction between trees existing in 1910 and later; liable to pay timber value for all trees before permit; Rule 10 reserves trees.",
      "supporting_facts": [
        "f4",
        "f6",
        "f12"
      ],
      "legal_basis": "Rule 137 Mysore Forest Rules 1969, Rule 10 Rules for Classifiers, Section 75(1) MLRA"
    },
    {
      "id": "ra2",
      "text": "Appellant No. 1 not 'occupant'; Sec 75(1) does not confer new rights; read with Sec 79(2); Rule 97(1-A) Coorg Rules reserves trees.",
      "supporting_facts": [
        "f9",
        "f16"
      ],
      "legal_basis": "Section 75(1) and 79(2) Mysore Land Revenue Act 1964, Rule 97(1-A) Coorg Land Revenue Rules"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Section 75(1) MLRA applies as survey settlement completed before 1964; State's right to trees deemed ceded except reserved trees by express order/notification.",
      "addresses_issue": "i2",
      "key_observation": "Condition precedent satisfied for Nemmale village."
    },
    {
      "id": "cr2",
      "text": "Rule 10 of Rules for Classifiers (1910) is not an express order reserving trees; it is guidance for classifiers during survey, refers to historical fact, not substantive reservation.",
      "addresses_issue": "i2",
      "key_observation": "Nature/context of Rules for Classifiers precludes vesting substantive rights."
    },
    {
      "id": "cr3",
      "text": "Record inadequate (sketchy writ petition, formal counter); cannot decide other contentions like occupier status, Sec 79(2), Rule 97(1-A).",
      "addresses_issue": "i3",
      "key_observation": "Fault partly State's for not showing greater concern."
    },
    {
      "id": "cr4",
      "text": "Relief re validity of Rule 137 infructuous as deleted in 1974; no amendment sought.",
      "addresses_issue": "i1",
      "key_observation": "Only relief sought now moot."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Rule 10 of Rules for Classifiers does not contain express order reserving State's right to trees on Bane lands under Sec 75(1) MLRA 1964.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Article 133(1)(b)",
        "Article 226",
        "Article 19(1)(f)",
        "Article 31"
      ],
      "relevance": "Basis for certificate appeals, writ petition, challenge to Rule 137"
    },
    {
      "name": "Mysore Forest Act, 1963 (5 of 1964)",
      "sections": [
        "Section 102"
      ],
      "relevance": "Empowers rule-making; Rule 137 made thereunder challenged"
    },
    {
      "name": "Mysore Forest Rules, 1969",
      "sections": [
        "Rule 137"
      ],
      "relevance": "Requires payment for redemption of trees on Bane lands; impugned and later deleted"
    },
    {
      "name": "Mysore Land Revenue Act, 1964 (12 of 1964)",
      "sections": [
        "Section 75(1)",
        "Section 79(2)",
        "Section 202"
      ],
      "relevance": "Deems cession of tree rights to occupant except reserved; repeals Coorg Regulation"
    },
    {
      "name": "Coorg Land and Revenue Regulation, 1899 (Regulation 1 of 1899)",
      "sections": [
        "Rule 49",
        "Rule 97(1-A)"
      ],
      "relevance": "Governed Bane lands; Rule 97 on usufruct and payment; repealed"
    }
  ],
  "outcome": {
    "disposition": "partially_accepted",
    "summary": "Set aside High Court judgment on construction of Rule 10; held it does not reserve trees under Sec 75(1) MLRA. Rule 137 validity moot as deleted. Relegated parties to pursue other remedies; no order as to costs.",
    "relief_granted": "Parties at liberty to agitate other questions in appropriate proceedings",
    "costs": "No order as to costs"
  },
  "key_quotes": [
    {
      "text": "\"Rule 10 is a part of the Rules meant for the guidance of Classifiers for implementing the impending survey settlement... At best, Rule 10 may be said to refer to a historical fact.\"",
      "speaker": "court",
      "significance": "Core reasoning rejecting State's reservation claim under Sec 75(1)"
    },
    {
      "text": "\"The condition precedent to the application of section 75(1) is admittedly satisfied... the right of the State Government to all trees in any land... shall be deemed to have been ceded to the occupant.\"",
      "speaker": "court",
      "significance": "Applies Sec 75(1) to Bane lands absent reservation"
    },
    {
      "text": "\"In these circumstances, we have decided to relegate the parties to such remedies as they may be advised to adopt for the vindication of their rights.\"",
      "speaker": "court",
      "significance": "Final disposition due to inadequate record and mootness"
    }
  ],
  "_case_id": "1974_171",
  "_label": 1,
  "_text_length": 17764,
  "_extracted_at": "2026-02-10T20:04:56.718476"
}