{
  "metadata": {
    "case_name": "Bhagwan Dutt v. Kamla Devi",
    "case_year": 1970,
    "court": "Supreme Court of India",
    "judges": [
      "Sarkar"
    ],
    "case_number": "Criminal Appeal No. 228 of 1970",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Respondent No. 1, Kamla Devi was married to the appellant Bhagwan Dutt on January 22, 1957 according to Hindu rites.",
      "type": "background",
      "date": "1957-01-22",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Out of this wedlock a daughter, Respondent No. 2, was born on November 22, 1957.",
      "type": "background",
      "date": "1957-11-22",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On October 18, 1966, Respondent No. 1 filed a petition against the appellant for judicial separation on the ground of desertion and cruelty.",
      "type": "procedural",
      "date": "1966-10-18",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "During the pendency of that petition, she filed an application under s. 488 of the Code of Criminal Procedure, 1898, in the court of the Magistrate, 1st Class, Delhi, claiming maintenance for herself and for her minor daughter, on the ground that the appellant had neglected and refused to maintain them.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "At the date of the application Respondent No. 1 was employed as a stenographer on a monthly salary of Rs. 600/-. The appellant was at that time earning about Rs. 800/- per month.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "However, later on when the case was in the Sessions Court in revision, the monthly income of each of them had increased by Rs. 150/-, approximately.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "By his order dated June 6,1969 the Magistrate directed the husband to pay Rs. 250/- per month i.e. Rs. 175/- for the wife and Rs. 75/- for the child for their maintenance. While fixing the amount of maintenance for the wife, the Magistrate did not take into consideration her own independent income.",
      "type": "procedural",
      "date": "1969-06-06",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Against the order of the Magistrate, the husband went in revision to the Court of Session.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "The Additional Sessions Judge was of the view that since the income of the wife was substantial and enough to maintain herself, she was not entitled to any maintenance. He was further of the opinion that Rs. 75/- p.m. allowed to the child being inadequate, it deserved to be raised to Rs. 125/- p.m. for the period of the pendency of the application in the trial court and thereafter to Rs. 150/- p.m.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "He referred the case to the High Court under s. 438 of the Code with a recommendation that the order of the Magistrate to the extent it allowed maintenance to the wife, be quashed, but the allowance of the child be enhanced as aforesaid.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "A learned single Judge of the High Court who heard the reference held that in making an order for maintenance in favour of a wife under s. 488 of the Code of Criminal Procedure the court has not to take into consideration the personal income of the wife as section 488 does not contemplate such a thing. He therefore declined the reference pro-tanto, but accepted the same in regard to the enhancement of the allowance of the child.",
      "type": "procedural",
      "date": "1970-04-30",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Aggrieved by the judgment of the High Court, the husband has come in appeal before us.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Can the income of the wife be taken into account in determining the amount of maintenance payable to her under Section 488 of the Code of Criminal Procedure, 1898?",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether s. 488 has been partially repealed and modified by s. 23 of the Hindu Adoptions and Maintenance Act, 1956?",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "If s. 488(1) is construed in the light of its primary object and the nature of the jurisdiction conferred by it, together with s. 489(1), it would be amply clear that in determining the wife's claim to maintenance and its quantum, her independent income is a relevant consideration.",
      "supporting_facts": [
        "f5",
        "f6"
      ],
      "legal_basis": "s.488 CrPC, s.489 CrPC; Mohd. Ali v. Mt. Sakina Begum; Narasimha Ayyar v. Rangathayammal; Ploonnabalam v. Saraswathi; Ahmed Ali Saheb v. Sarfara linisa Begum; P. T. Ramankutty A chan v. Kalyanikutty"
    },
    {
      "id": "pa2",
      "text": "s. 488 must be deemed to have been partially repealed and modified by s. 23 of the Hindu Adoptions and Maintenance Act, 1956 which provides that in determining the amount of maintenance, the Court shall have, inter alia, regard to the value of the wife's property and any income derived from such property or from the claimant's own earning or from other sources.",
      "supporting_facts": [],
      "legal_basis": "s.23 Hindu Adoptions and Maintenance Act, 1956; s.4(b) thereof"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The very fact that the Section does not make the inability of a wife to maintain herself, a condition precedent to the grant of maintenance as it does in the case of child, shows that the intention of the Legislature was that the wife's own income or means should not be taken into account either for determining her right to maintenance or for fixing its amount.",
      "supporting_facts": [],
      "legal_basis": "s.488 CrPC; Major Joginder Singh v. Bibi Raj Mohinder Kaur"
    },
    {
      "id": "ra2",
      "text": "The language of s. 489 cannot be called in aid to construe s. 488(1).",
      "supporting_facts": [],
      "legal_basis": "s.488 CrPC, s.489 CrPC"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Section 488 does not confer an absolute right on a neglected wife to get an order of maintenance against the husband nor does it impose an absolute liability on the husband to support her in all circumstances. The use of the word 'may' in Section 488(1) indicates that the power conferred on the Magistrate is discretionary.",
      "addresses_issue": "i1",
      "key_observation": "The Magistrate has to exercise his discretion in a judicial manner consistently with the language of the statute with regard to other relevant circumstances of the case."
    },
    {
      "id": "cr2",
      "text": "Sections 488, 489 and 490 constitute one family... These provisions are intended to fulfil a social purpose. Their object is to compel a man to perform the moral obligation which he owes to society in respect of his wife and children.",
      "addresses_issue": "i1",
      "key_observation": "The jurisdiction conferred by the Section on the Magistrate is more in the nature of a preventive, rather than a remedial jurisdiction."
    },
    {
      "id": "cr3",
      "text": "The mere fact that the language of s. 488(1) does not expressly make the inability of a wife to maintain herself a condition precedent to the maintainability of her petition, does not imply that while determining her claim and fixing the amount of maintenance, the Magistrate is debarred from taking into consideration the wife's own separate income or means of support.",
      "addresses_issue": "i1",
      "key_observation": "There is a clear distinction between a wife's locus standi to file a petition under s. 488 and her being entitled, on merits, to a particular amount of maintenance thereunder."
    },
    {
      "id": "cr4",
      "text": "The object of those provisions being to prevent vagrancy and destitution, the Magistrate has to find out as to what is required by the wife to maintain a standard of living which is neither luxurious nor penurious, but is modestly consistent with the status of the family. The needs and requirements of the wife for such moderate living can be fairly determined, only if her separate income, also, is taken into account together with the earnings of the husband and his commitments.",
      "addresses_issue": "i1",
      "key_observation": "In determining the amount of maintenance under s. 488(1), the Magistrate is competent to take into consideration the separate income and means of the wife."
    },
    {
      "id": "cr5",
      "text": "There is no inconsistency between [Hindu Adoptions and Maintenance] Act 78 of 1956 and s. 488, Criminal Procedure Code. Both can stand together.",
      "addresses_issue": "i2",
      "key_observation": "The scope of the two laws is different. Section 488 provides a summary remedy and is applicable to all persons belonging to all religions and has no relationship with the personal law of the parties."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "In determining the amount of maintenance under s. 488(1), the Magistrate is competent to take into consideration the separate income and means of the wife.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "There is no inconsistency between the Hindu Adoptions and Maintenance Act, 1956 and s. 488 CrPC; both can stand together.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Major Joginder Singh v. Bibi Raj Mohinder Kaur",
      "citation": "A.I.R. 1960 Punjab 249",
      "treatment": "distinguished",
      "relevance": "Held that wife's ability to maintain herself does not deprive her of right to maintenance; court disagreed and distinguished"
    },
    {
      "case_name": "Nanak Chand Banarsi Dass v. Chander Kishore",
      "citation": null,
      "treatment": "followed",
      "relevance": "No inconsistency between Hindu Adoptions and Maintenance Act 1956 and s.488 CrPC"
    },
    {
      "case_name": "P. T. Ramankutty v. Kalyanikutty",
      "citation": "A.I.R. 1971 Kerala 22",
      "treatment": "followed",
      "relevance": "Wife's personal income can be considered in granting maintenance under s.488; explained and distinguished Major Joginder Singh case"
    },
    {
      "case_name": "Mohd. Ali v. Mt. Sakina Begum",
      "citation": "6 N.W.P. 205",
      "treatment": "referred",
      "relevance": "Supports considering wife's income"
    },
    {
      "case_name": "Narasimha Ayyar v. Rangathayammal",
      "citation": "A.I.R. 1944 Lah. 394",
      "treatment": "referred",
      "relevance": "Supports considering wife's income"
    },
    {
      "case_name": "Ploonnabalam v. Saraswathi",
      "citation": "A.I.R. 1957 Mad. 693",
      "treatment": "referred",
      "relevance": "Supports considering wife's income"
    },
    {
      "case_name": "Ahmed Ali Saheb v. Sarfara linisa Begum",
      "citation": "A.I.R. 1947 Mad. 204",
      "treatment": "referred",
      "relevance": "Supports considering wife's income"
    }
  ],
  "statutes_cited": [
    {
      "name": "Code of Criminal Procedure, 1898",
      "sections": [
        "488",
        "489",
        "490",
        "438"
      ],
      "relevance": "Provisions for maintenance of wives and children; Magistrate to consider wife's income in fixing quantum"
    },
    {
      "name": "Code of Criminal Procedure, 1973",
      "sections": [
        "125"
      ],
      "relevance": "Comparative provision making 'unable to maintain herself' explicit for wife"
    },
    {
      "name": "Hindu Adoptions and Maintenance Act, 1956",
      "sections": [
        "23",
        "4"
      ],
      "relevance": "s.23 requires consideration of wife's income; no inconsistency with s.488 CrPC"
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed, judgment of High Court set aside, case remanded to trial Magistrate to refix maintenance for wife taking her income into account along with other circumstances, and for daughter after affording opportunity to lead fresh evidence.",
    "relief_granted": "Remand for refixing maintenance amounts",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "Can the income of the wife be taken into account in determining the amount of maintenance payable to her under Section 488 of the Code of Criminal Procedure, 1898? This is the principal question for determination in this appeal by special leave.",
      "speaker": "court",
      "significance": "Frames the core legal issue"
    },
    {
      "text": "In determining the amount of maintenance under s. 488(1), the Magistrate is competent to take into consideration the separate income and means of the wife.",
      "speaker": "court",
      "significance": "Key holding of the judgment"
    },
    {
      "text": "The object of those provisions being to prevent vagrancy and destitution, the Magistrate has to find out as to what is required by the wife to maintain a standard of living which is neither luxurious nor penurious, but is modestly consistent with the status of the family.",
      "speaker": "court",
      "significance": "Explains the purpose and quantum fixation principle"
    }
  ],
  "_case_id": "1974_266",
  "_label": 1,
  "_text_length": 18458,
  "_extracted_at": "2026-02-10T20:05:38.020284"
}