{
  "metadata": {
    "case_name": "Appellants v. Respondents",
    "case_year": 1967,
    "court": "Supreme Court of India",
    "judges": [
      "MATHEW, J."
    ],
    "case_number": "Civil Appeal No. 1897 of 1967",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The property in question belonged to the father of first appellant. By a will executed by him, he bequeathed the property to appellants 2 and 3.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "After the death of the testator, mutations in favour of appellants 2 and 3 were effected in the revenue records in the year 1996 B.K. (1939).",
      "type": "material",
      "date": "1939",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The first appellant managed to get the mutation of the land in his name in 1944 for the reason that he wanted to get licence for a gun.",
      "type": "material",
      "date": "1944",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "In 1955, when the Pepsu Tenancy and Agricultural Lands Act came into force, the first appellant was shown to be the owner of the land in the revenue records.",
      "type": "background",
      "date": "1955",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Chapter IV-A of the Act was inserted by Pepsu Act No. 15 of 1956 on October 30, 1956 and by s. 32A of this chapter, ceiling was placed on the holding of land.",
      "type": "background",
      "date": "1956-10-30",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "A suit was filed by appellants 2 and 3 for a declaration that the land belonged to them, that the mutation of the land in the name of the first appellant in the revenue records was for the purpose of enabling him to obtain a gun licence and that there was no transfer of the land to first appellant. The first appellant was the only defendant in the suit. He did not contest the suit and it was decreed on February 14, 1961.",
      "type": "procedural",
      "date": "1961-02-14",
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "A few weeks later, the question of declaration of the surplus area of the land in the hands of the first appellant came up for consideration before the Collector of Bhatinda. On the basis of the judgment and decree passed by the Civil Court that there was no transfer of the land to the first appellant, the Collector, by his order dated March 28, 1961, declared that there was no surplus land in the ownership and possession of the first appellant.",
      "type": "procedural",
      "date": "1961-03-28",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "The Act was amended by Act No. 16 of 1962 and s. 32-DD was introduced into the Act with retrospective effect from October 30, 1956.",
      "type": "background",
      "date": "1962",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "The Collector thereupon made a reference presumably under S. 15 of the Punjab Land Revenue Code for sanction to the Commissioner of Patiala to review his order dated March 28, 1961, as it omitted to include the land in question in the holding of the first appellant on the basis of the judgment and decree. The sanction was given, the Collector reviewed the order and he refused to give effect to the judgment and decree by ignoring them as enjoined by s. 32-DD and included the land in the holding of the first appellant. Order dated May 20, 1963 / May 29, 1963.",
      "type": "procedural",
      "date": "1963-05-20",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "The appellants filed a writ petition in the High Court of Punjab to quash this order. Before the High Court, three contentions were raised by the appellants: 1. that the Collector had no jurisdiction to review his order dated March 28, 1961; 2. that the order in review was passed without notice to the appellants; 3. that, in any event, the judgment of the civil court only made a declaration as regards rights of the parties on the date of the suit and it was not, therefore, a judgment of the nature contemplated by s. 32-DD.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f11",
      "text": "The High Court overruled all the contentions and held that the order of the Collector was rendered null and void by virtue of the provisions of s. 32-DD and, therefore, the Collector had the power to determine by his order dated May 29, 1963, the surplus area after ignoring the judgment and decree.",
      "type": "procedural",
      "date": "1966-09-27",
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the Collector had jurisdiction to review his order dated March 28, 1961",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether the order in review was passed without notice to the appellants, violating natural justice",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether the civil court judgment was of the nature contemplated by s. 32-DD(b), i.e., having the effect of diminishing the area which would have been declared as surplus",
      "framed_by": "petitioner"
    },
    {
      "id": "i4",
      "text": "Whether the order dated March 28, 1961 became null and void due to retrospective s. 32-DD, allowing review without specific provision",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The Collector had no jurisdiction to review his order dated March 28, 1961",
      "supporting_facts": [
        "f9",
        "f11"
      ],
      "legal_basis": "No provision in amending Act to reopen orders; s.15 Punjab Land Revenue Code not applicable"
    },
    {
      "id": "pa2",
      "text": "The order in review was passed without notice to the appellants",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": "Principles of natural justice (audi alteram partem)"
    },
    {
      "id": "pa3",
      "text": "The judgment of the civil court only made a declaration as regards rights of the parties on the date of the suit and it was not a judgment having the effect of diminishing the area contemplated by s. 32-DD",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": "s. 32-DD(b) Pepsu Act; nature of judgment declares pre-existing rights, no real transfer"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The order dated March 28, 1961 was null and void as it did not consider mandatory retrospective s. 32-DD, allowing Collector to ignore the judgment and decree",
      "supporting_facts": [
        "f7",
        "f9"
      ],
      "legal_basis": "s. 32-DD Pepsu Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The order of the Collector dated March 28, 1961 was a perfectly valid one when it was passed. No one challenged that order and it became final. It cannot be regarded as null and void merely because s. 32-DD was later incorporated with retrospective effect; no provision in amending Act to review it.",
      "addresses_issue": "i1",
      "key_observation": "Cannot extend fiction of retrospectivity to make prior valid order null without specific review provision"
    },
    {
      "id": "cr2",
      "text": "The Collector was not acting in consonance with principles of natural justice when passing order dated May 20, 1963, as no notice or opportunity to be heard was given to appellants 2 and 3, who were vitally concerned.",
      "addresses_issue": "i2",
      "key_observation": "First appellant heard irrelevant; appellants 2 and 3 could have shown true nature of civil judgment"
    },
    {
      "id": "cr3",
      "text": "The civil court judgment declared that there was no real transfer to first appellant, affirming pre-existing ownership of appellants 2 and 3; it did not diminish the area of first appellant's holding as he never owned it prior to judgment.",
      "addresses_issue": "i3",
      "key_observation": "s.32-DD(b) applies only to judgments diminishing pre-existing holding; not declarations of non-transfer"
    },
    {
      "id": "cr4",
      "text": "Doubts application of Anisminic principle where overlooked provision did not exist at time of inquiry but given retrospective effect.",
      "addresses_issue": "i1",
      "key_observation": "Principle not extendable to subsequently enacted retrospective provisions"
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Order dated March 28, 1961 valid and final; no jurisdiction to review absent specific provision",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Review order violated natural justice due to lack of notice to appellants 2 and 3",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h3",
      "text": "Civil judgment not within s.32-DD(b) as it declared no transfer occurred, not diminishing pre-existing holding",
      "resolves_issue": "i3",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Anisminic Ltd. v. Foreign Compensation Commission",
      "citation": "1967 3 W.L.R. 382",
      "treatment": "doubted",
      "relevance": "Principle that overlooking mandatory provision denudes jurisdiction not applicable to retrospectively enacted provisions not existing at inquiry time"
    }
  ],
  "statutes_cited": [
    {
      "name": "Pepsu Tenancy and Agricultural Lands Act",
      "sections": [
        "s. 32A",
        "Chapter IV-A",
        "s. 32-DD"
      ],
      "relevance": "Ceiling on land holdings; s.32-DD requires ignoring post-commencement tenancies and judgments diminishing surplus area, retrospective from 1956"
    },
    {
      "name": "Punjab Land Revenue Code",
      "sections": [
        "s. 15"
      ],
      "relevance": "Collector purported to act under for review sanction; court holds no application"
    },
    {
      "name": "Indian Evidence Act",
      "sections": [
        "s. 43"
      ],
      "relevance": "A non-party to judgment can show it obtained by fraud or collusion"
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Supreme Court holds High Court erred; Collector's review order invalid due to lack of jurisdiction, violation of natural justice, and misapplication of s.32-DD to the civil decree which declared no transfer. Appeal allowed, implying quashing of review order.",
    "relief_granted": "Writ petition to quash Collector's review order upheld",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "We cannot subscribe to the view that the order of the Collector passed on March 28, 1961 became null and void merely because he failed to take into account the provisions of s. 32-DD even if by virtue of the fiction it is to be assumed that the section was on the statute book when he passed it.",
      "speaker": "court",
      "significance": "Rejects High Court's view on nullity of prior order due to retrospective amendment"
    },
    {
      "id": "kq2",
      "text": "If the effect of the judgment is only to declare that the land never belonged to the first appellant, it has no the effect of diminishing the area of land in his possession.",
      "speaker": "court",
      "significance": "Interprets scope of s.32-DD(b); distinguishes declarations of non-ownership"
    }
  ],
  "_case_id": "1974_405",
  "_label": 1,
  "_text_length": 13488,
  "_extracted_at": "2026-02-10T20:06:49.853286"
}