{
  "metadata": {
    "case_name": "Nawab Ali v. State",
    "case_year": 1971,
    "court": "Supreme Court of India",
    "judges": [
      "KHANNA, J."
    ],
    "case_number": "Criminal Appeal No. 20 of 1971",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Long standing enmity between the seven accused, who are related to each other, and Abdul Hamid Khan. Disputes had arisen between the parties in connection with some land belonging to Sarju Devi and the parties had been involved in civil and criminal litigation.",
      "type": "background",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f2",
      "text": "Abdul Hamid Khan deceased and the accused belong to village Gulalpurwa.",
      "type": "background",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f3",
      "text": "On the evening of June 17, 1967, Abdul Hamid Khan went to the house of his villager Bahao Khan PW 5, because the two wanted to have a talk in connection with a case pending before the Commissioner.",
      "type": "material",
      "date": "1967-06-17",
      "source": "prosecution"
    },
    {
      "id": "f4",
      "text": "Abdul Hamid Khan accompanied by Puttan Khan PW 7 left the house of Bahao Khan at about 10 p.m.",
      "type": "material",
      "date": "1967-06-17",
      "source": "prosecution"
    },
    {
      "id": "f5",
      "text": "When the two reached near the house of Siddiq, the seven accused armed with lathis emerged and attacked Abdul Hamid Khan and his companion.",
      "type": "material",
      "date": "1967-06-17",
      "source": "prosecution"
    },
    {
      "id": "f6",
      "text": "Puttan Khan ran away and, while doing so, raised alarm.",
      "type": "material",
      "date": "1967-06-17",
      "source": "prosecution"
    },
    {
      "id": "f7",
      "text": "Abdul Hamid Khan was given lathi blow, and was apprehended. The accused then lifted Abdul Hamid Khan and carried him to the house of Mohd. Shafi accused.",
      "type": "material",
      "date": "1967-06-17",
      "source": "prosecution"
    },
    {
      "id": "f8",
      "text": "Alarm raised by Abdul Hamid Khan and Puttan Khan attracted Maiku Khan PW 1, Nasir Khan PW 3, Hafeezulla PW 4 and some others including Rahim Khan.",
      "type": "material",
      "date": "1967-06-17",
      "source": "prosecution"
    },
    {
      "id": "f9",
      "text": "Rahim Khan tried to intervene but he too was given lathi blows.",
      "type": "material",
      "date": "1967-06-17",
      "source": "prosecution"
    },
    {
      "id": "f10",
      "text": "After taking Abdul Hamid Khan inside the house of Mohd. Shafi, the accused closed the door of the house.",
      "type": "material",
      "date": "1967-06-17",
      "source": "prosecution"
    },
    {
      "id": "f11",
      "text": "Attempt was made by those present to get the door of the house opened. Six of the accused then emerged from the house armed with lathis and threatened those present to go away and that otherwise they too would be assaulted.",
      "type": "material",
      "date": "1967-06-17",
      "source": "prosecution"
    },
    {
      "id": "f12",
      "text": "The accused thereafter went back to the house and closed the door.",
      "type": "material",
      "date": "1967-06-17",
      "source": "prosecution"
    },
    {
      "id": "f13",
      "text": "Maiku Khan PW 1, who is nephew of Abdul Hamid Khan, in the meantime, rushed to his house and from there proceeded on his cycle to police station Nanpara, at a distance of three miles from the place of occurrence.",
      "type": "procedural",
      "date": "1967-06-17",
      "source": "prosecution"
    },
    {
      "id": "f14",
      "text": "Report was lodged at the police station by Maiku Khan at 11.05 p.m.",
      "type": "procedural",
      "date": "1967-06-17",
      "source": "prosecution"
    },
    {
      "id": "f15",
      "text": "Inspector Yashwant Singh accompanied by some constables immediately proceeded to the place of occurrence and arrived there about half an hour after mid-night.",
      "type": "procedural",
      "date": "1967-06-17",
      "source": "prosecution"
    },
    {
      "id": "f16",
      "text": "The Inspector found a number of persons present outside the house of Mohd. Shafi. The door of the house of Mohd. Shafi had been chained from outside and the mother of Mohd. Shafi was sitting there.",
      "type": "material",
      "date": "1967-06-17",
      "source": "prosecution"
    },
    {
      "id": "f17",
      "text": "The Inspector got the door opened. On going inside, the Inspector found the dead body of Abdul Hamid Khan lying in the verandah of the house. Six of the accused were present inside the house. Nawab Ali appellant was, however, not present there.",
      "type": "material",
      "date": "1967-06-17",
      "source": "prosecution"
    },
    {
      "id": "f18",
      "text": "Nawab Ali had slipped away at the time the accused had emerged out of the house.",
      "type": "material",
      "date": "1967-06-17",
      "source": "prosecution"
    },
    {
      "id": "f19",
      "text": "The six accused present inside the house were taken into custody.",
      "type": "procedural",
      "date": "1967-06-18",
      "source": "prosecution"
    },
    {
      "id": "f20",
      "text": "On the following morning the Inspector prepared the inquest report and sent the dead body to the mortuary.",
      "type": "procedural",
      "date": "1967-06-18",
      "source": "prosecution"
    },
    {
      "id": "f21",
      "text": "Post mortem examination on the dead body was performed by Dr. J. B. Singh at Bahraich on June 18, 1967 at 3 p.m.",
      "type": "material",
      "date": "1967-06-18",
      "source": "prosecution"
    },
    {
      "id": "f22",
      "text": "Dr. J. B Singh found 10 injuries caused with blunt weapon on the body. The doctor found that the brain, larynx, trachea, lungs, intestine, pancreas, spleen and kidney were congested. Rings of the trachea and hyoid bone, were fractured. Blood was found in the tissues of the neck. Death was due to asphyxia as a result of strangulation of the neck.",
      "type": "material",
      "date": "1967-06-18",
      "source": "prosecution"
    },
    {
      "id": "f23",
      "text": "Nawab Ali appellant surrendered himself in Court on June 23, 1967. He was thereafter put under arrest.",
      "type": "procedural",
      "date": "1967-06-23",
      "source": "prosecution"
    },
    {
      "id": "f24",
      "text": "Nawab Ali appellant denied the prosecution allegations about his complicity and stated that he had been falsely involved in this case because of enmity with Puttan Khan.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f25",
      "text": "It is in the evidence of Nasir Khan PW 3 that when he and others rushed to the house of Mohd. Shafi on hearing alarm, all the accused except Rouf came out of the house armed with lathis and threatened those present to go away.",
      "type": "material",
      "date": "1967-06-17",
      "source": "prosecution"
    },
    {
      "id": "f26",
      "text": "Five out of the six accused who had come out then went inside the house. Nawab Ali, however, did not go inside the house.",
      "type": "material",
      "date": "1967-06-17",
      "source": "prosecution"
    },
    {
      "id": "f27",
      "text": "Nasir Khan and others present there then surrounded the house of Mohd. Shafi and remained there till the arrival of the police.",
      "type": "material",
      "date": "1967-06-17",
      "source": "prosecution"
    },
    {
      "id": "f28",
      "text": "The Police Inspector found only six of the accused present there. The appellant was not among those six accused.",
      "type": "material",
      "date": "1967-06-17",
      "source": "prosecution"
    },
    {
      "id": "f29",
      "text": "Nawab Ali was inside the house of Mohd. Shafi only for a very short time and thereafter he left that place.",
      "type": "material",
      "date": "1967-06-17",
      "source": "court"
    },
    {
      "id": "f30",
      "text": "There is no evidence on the record to show that Abdul Hamid Khan was strangulated before Nawab Ali appellant left the house of Mohd. Shafi.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f31",
      "text": "Seven accused including Nawab Ali and his two sons Naim Khan and Azim Khan were convicted by learned Sessions Judge Bahraich under section 302 read with section 149 Indian Penal Code, section 323 read with section 149, section 147, section 342 and section 364 Indian Penal Code.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f32",
      "text": "Appeal filed by the seven accused was dismissed by the Allahabad High Court Lucknow Bench in Criminal Appeal No. 8 of 1968 on 26th August 1970.",
      "type": "procedural",
      "date": "1970-08-26",
      "source": "lower_court"
    },
    {
      "id": "f33",
      "text": "Nawab Ali alone came up in appeal to this Court by special leave. The leave was restricted to the question of conviction of the appellant for the offence under section 302 read with section 149 Indian Penal Code.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the appellant is guilty of the offence under section 302 read with section 149 Indian Penal Code.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Denied the prosecution allegations about his complicity and stated that he had been falsely involved in this case because of enmity with Puttan Khan.",
      "supporting_facts": [
        "f24"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "It can therefore, be said that the appellant was inside the house of Mohd. Shafi only for a very short time and thereafter he left that place. There is no evidence on the record to show that Abdul Hamid Khan was strangulated before Nawab Ali appellant left the house of Mohd. Shafi. Indeed, there is nothing to rule out the possibility of Abdul Hamid Khan having been strangulated after Nawab Ali had left the house of Mohd. Shafi and had thus ceased to be a member of the unlawful assembly.",
      "addresses_issue": "i1",
      "key_observation": "No liability can be fastened upon Nawab Ali for anything done by the members of the unlawful assembly after he had left the house of Mohd. Shafi and had thus ceased to be a member of the unlawful assembly."
    },
    {
      "id": "cr2",
      "text": "According to section 149 Indian Penal Code, if an offence is committed by any member of an unlawful assembly in prosecution of the common object of that assembly, or such as the members of that assembly knew to be likely to be committed in prosecution of that object, every person who, at the time of the committing of that offence, is a member of the same assembly, is guilty of that offence. It is, therefore, incumbent upon the prosecution to show that the person concerned was a member of the unlawful assembly at the time of the commission of the offence. If the person concerned goes away and ceases to be, a member of the unlawful assembly before the commission of the offence, no vicarious liability can be fastened upon him under section 149 Indian Penal Code because of any subsequent act done by the other members of the unlawful assembly.",
      "addresses_issue": "i1",
      "key_observation": "The conviction of Nawab Ali appellant for the offence under section 302 read with section 149 Indian Penal Code in the circumstances cannot be held to be well founded."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "No liability under section 149 IPC can be fastened upon a person who ceases to be a member of the unlawful assembly before the commission of the offence.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "302",
        "149",
        "323",
        "147",
        "342",
        "364"
      ],
      "relevance": "Accused convicted under these sections; appeal restricted to conviction under section 302 read with section 149. Section 149 interpreted to require membership of unlawful assembly at the time of offence commission."
    }
  ],
  "outcome": {
    "disposition": "partially_accepted",
    "summary": "The appeal of Nawab Ali is accepted to the extent of setting aside his conviction under section 302 read with section 149 Indian Penal Code. He is acquitted on that score.",
    "relief_granted": "Acquitted under section 302/149 IPC",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "It is, therefore, incumbent upon the prosecution to show that the person concerned was a member of the unlawful assembly at the time of the committing of that offence.",
      "speaker": "court",
      "significance": "Core interpretation of section 149 IPC applied to acquit appellant."
    },
    {
      "text": "If the person concerned goes away and ceases to be, a member of the unlawful assembly before the commission of the offence, no vicarious liability can be fastened upon him under section 149 Indian Penal Code.",
      "speaker": "court",
      "significance": "Key reasoning for setting aside conviction."
    }
  ],
  "_case_id": "1974_112",
  "_label": 1,
  "_text_length": 7950,
  "_extracted_at": "2026-02-10T20:04:11.487656"
}