{
  "metadata": {
    "case_name": "Harnam Singh v. State of Himachal Pradesh",
    "case_year": 1971,
    "court": "Supreme Court of India",
    "judges": [
      "Chandrachud, J."
    ],
    "case_number": "Criminal Appeal No. 68 of 1971",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "In September 1967, Harnam Singh was working as a Patwari in Halqa Pali.",
      "type": "background",
      "date": "1967-09",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On 19th September 1967, Nitya Nand asked Harnam Singh for copies of revenue record; Harnam Singh demanded hush-money of Rs. 30.",
      "type": "material",
      "date": "1967-09-19",
      "source": "prosecution"
    },
    {
      "id": "f3",
      "text": "On 20th September 1967, Nitya Nand borrowed Rs. 30 from friend Chet Ram and lodged complaint with Anti-Corruption Department.",
      "type": "material",
      "date": "1967-09-20",
      "source": "prosecution"
    },
    {
      "id": "f4",
      "text": "Sub Inspector Kewal Ram obtained permission from Mandi Magistrate to investigate and laid trap; raiding party went to Harnam Singh's office where Nitya Nand allegedly gave marked currency notes of Rs. 30 to Harnam Singh.",
      "type": "procedural",
      "date": "1967-09-20",
      "source": "prosecution"
    },
    {
      "id": "f5",
      "text": "Defence: Rs. 30 not found from Harnam Singh's person but planted by Nitya Nand in residential room.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "Special Judge Mandi, Kulu and Lahaul Spiti Districts convicted Harnam Singh under section 5(1)(d) read with section 5(2) of Prevention of Corruption Act and section 161 IPC; sentenced to RI for 2 years and fine Rs. 300.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Delhi High Court Himachal Bench confirmed conviction but reduced substantive sentence to 1 year RI; judgment dated 18th December 1969/7th January 1970.",
      "type": "procedural",
      "date": "1970-01-07",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Harnam Singh died during pendency of appeal in Supreme Court; by order dated 26 February 1972, his widow substituted as legal representative.",
      "type": "procedural",
      "date": "1972-02-26",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Prosecution witnesses: Nitya Nand (complainant), Kewal Ram (IO), Jai Ram (HC), Panchas Sital Prasad and Lok Bandhu (turned hostile). High Court found PW1, Kewal Ram, Jai Ram partisan; investigation not commendable.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Kewal Ram wrote complaint, obtained Magistrate permission by misleading (no DSP available, hid Inspector Amar Singh in charge); Panchnamas lack time/place; no anthracene powder; witnesses couldn't see/hear; Panchas known to complainant; Jai Ram got affidavit from Sital Prasad; discrepancy on recovery from jacket or shirt pocket.",
      "type": "disputed",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Accused examined himself; evidence preferred over prosecution.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the appeal abates on death of appellant sentenced to composite sentence of imprisonment and fine, under section 431 CrPC 1898, and whether widow can continue appeal.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether conviction sustainable on prosecution evidence, given partisan witnesses, hostile panchas, investigation lapses, and violation of s5A Prevention of Corruption Act.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Section 431 CrPC 1898 has no application to appeals by special leave under Article 136; governed by justice/equity; even if applies, since sentenced to fine, appeal does not abate; if conviction bad, fine unsustainable so conviction must go.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": "Section 431 CrPC 1898; Article 136 Constitution"
    },
    {
      "id": "pa2",
      "text": "Violation of s5A PC Act caused prejudice; evidence unreliable: planted money, investigation lapses.",
      "supporting_facts": [
        "f5",
        "f9",
        "f10",
        "f11"
      ],
      "legal_basis": "Section 5A Prevention of Corruption Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Substantive imprisonment sentence ended with death, appeal abates as to it; composite sentence, appeal abates as to fine too; at best set aside fine, but conviction/substantive sentence stand.",
      "supporting_facts": [
        "f6",
        "f7",
        "f8"
      ],
      "legal_basis": "Section 431 CrPC 1898"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "S431 CrPC not apply to Art 136 appeals but uniformity requires same principles; appeals vs acquittal abate on accused death; conviction appeals abate on appellant death except from sentence of fine; composite sentence appeal is 'from sentence of fine' as fine affects estate; validity of fine involves conviction validity; if conviction bad, set aside all.",
      "addresses_issue": "i1",
      "key_observation": "Appeal from composite sentence does not abate fully; widow entitled to continue."
    },
    {
      "id": "cr2",
      "text": "Prosecution evidence unreliable: partisan witnesses, hostile panchas no corroboration, investigation lapses (Kewal Ram misled Magistrate, no disclosure of superior, no time/place in panchnamas, no anthracene, poor vantage, prior acquaintance, affidavit pressure, recovery discrepancy); accused evidence preferred; s5A violation caused prejudice but unnecessary as merits fail.",
      "addresses_issue": "i2",
      "key_observation": "Evidence wholly unworthy of acceptance; gross injustice."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Appeal by legal representative maintainable despite death as it is from sentence of fine (even composite); if conviction invalid, set aside conviction and all sentences.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Conviction not sustainable; evidence unreliable.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Gondada Gajapathy Rao v. State of Andhra Pradesh",
      "citation": "1964 7 S.C.R. 251",
      "treatment": "distinguished",
      "relevance": "No fine sentence; LRs interest remote (service arrears), unlike direct fine liability on estate."
    },
    {
      "case_name": "Vidya Devi v. State",
      "citation": "A.I.R. 1957 All. 20",
      "treatment": "wrong",
      "relevance": "Held composite appeal abates as to imprisonment but continues as to fine; bisection unjust."
    },
    {
      "case_name": "V. Govindrajalu Ors. v. State of Mysore",
      "citation": "A.I.R. 1962 Mysore 275",
      "treatment": "wrong",
      "relevance": "Assumed partial abatement in composite sentence without discussion."
    }
  ],
  "statutes_cited": [
    {
      "name": "Prevention of Corruption Act",
      "sections": [
        "5(1)(d)",
        "5(2)",
        "5A"
      ],
      "relevance": "Conviction under 5(1)(d) r/w 5(2); s5A violated by unauthorised investigation causing prejudice."
    },
    {
      "name": "Indian Penal Code",
      "sections": [
        "161",
        "70"
      ],
      "relevance": "Conviction u/s 161; s70 on fine levy post-death."
    },
    {
      "name": "Code of Criminal Procedure, 1898",
      "sections": [
        "431",
        "411A(2)",
        "417",
        "404",
        "258(2)",
        "306(2)",
        "309(2)",
        "562",
        "386(1)(b)",
        "70"
      ],
      "relevance": "Abatement rules; exception for fine appeals; sentence follows conviction."
    },
    {
      "name": "Code of Criminal Procedure, 1973",
      "sections": [
        "394"
      ],
      "relevance": "Amends abatement for near relatives in conviction appeals."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "136"
      ],
      "relevance": "Special leave appeals not strictly under CrPC Ch XXXI but apply same abatement principles."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; order of conviction, substantive sentence and sentence of fine set aside.",
    "relief_granted": "Acquittal by setting aside conviction and sentences",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"Every appeal under this Chapter except an appeal from a sentence of fine shall finally abate on the death of the appellant.\"",
      "speaker": "court",
      "significance": "Key statutory language interpreted to save composite sentence appeals."
    },
    {
      "text": "\"The sentence of fine becomes illegal if the conviction is wrong. If the conviction is wrong, no sentence at all can be imposed on the accused.\"",
      "speaker": "court",
      "significance": "Explains why conviction must fall if challenged via fine appeal."
    },
    {
      "text": "\"We find it extremely difficult to appreciate how the evidence of these hostile witnesses could corroborate the evidence of the partisan witnesses.\"",
      "speaker": "court",
      "significance": "Rejects High Court reliance on unreliable evidence."
    },
    {
      "text": "\"The evidence on which the conviction is based is wholly unworthy of acceptance.\"",
      "speaker": "court",
      "significance": "Core finding overturning conviction on merits."
    }
  ],
  "_case_id": "1974_319",
  "_label": 1,
  "_text_length": 23091,
  "_extracted_at": "2026-02-10T20:06:05.713818"
}