{
  "metadata": {
    "case_name": "Income Tax Officer v. Nawab Sahib Mir Osman Ali Khan Bahadur, H. E. H., the Nizam of Hyderabad",
    "case_year": 1970,
    "court": "Supreme Court of India",
    "judges": [
      "GUPTA, J."
    ],
    "case_number": "Civil Appeals Nos. 1179-1782 of 1970",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Assessments for assessment years 1955-56, 1956-57, 1957-58 and 1958-59 were completed respectively on March 18, 1958, March 19, 1958, July 20, 1958 and March 28, 1961 under the Income Tax Act of 1922.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "After returns filed, Income Tax Officer called upon respondent to state his relationship with four ladies: Dulhan Pasha Begum Saheba, Mazharunnisa Begum Saheba, Laila Begum Saheba and Jani Begum Saheba, with three specific queries on rites, legal status of children, and distinguishing factors.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On May 1, 1950, August 6, 1950 and December 29, 1950, respondent executed three trust deeds (Family Trust, Miscellaneous Trust, Family Pocket Money Trust) for benefit of Mazharunnisa Begum, Laila Begum, Jani Begum and their minor children, describing the three ladies as wives of respondent and father of children; in one, preceded by 'ladies of position'.",
      "type": "material",
      "date": "1950-05-01",
      "source": "respondent"
    },
    {
      "id": "f4",
      "text": "Trust deeds of 1950 were before Income Tax Officer before completing assessments for the four years.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "On September 9, 1957, Shri C. B. Taraporewala, Financial Adviser, filed statement: Dulhan Pasha only legally wedded wife; no valid marriage formalities with other three; they are 'ladies of position' referred as wives in trusts due to favours, but not legally; children not legitimate.",
      "type": "material",
      "date": "1957-09-09",
      "source": "respondent"
    },
    {
      "id": "f6",
      "text": "Income Tax Officer accepted explanation, did not include income of three ladies and minor children from trusts in respondent's total income for four years; beneficiaries separately assessed.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Respondent created Fern Hill Trust on March 21, 1957 for children of Laila Begum (described as wife, children as respondent's by her); Race View Trust on December 5, 1957 for Jani Begum and son Imdad Jah (described as wife and son).",
      "type": "material",
      "date": "1957-03-21",
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "Fern Hill and Race View Trust Deeds of 1957 not produced before Income Tax Officer during original assessments.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "On March 13, 1964, notices under sec. 148 issued to reopen assessments under sec. 147(a) of 1961 Act for 1955-59 years.",
      "type": "procedural",
      "date": "1964-03-13",
      "source": "petitioner"
    },
    {
      "id": "f10",
      "text": "Respondent's representatives filed supplemental returns affirming originals, without prejudice.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f11",
      "text": "In letter dated April 15, 1964, ITO stated reasons: 1957 trusts not disclosed; descriptions indicate statement untrue; sec. 268 Mullas presumes marriage; ladies/children legal wives/children.",
      "type": "material",
      "date": "1964-04-15",
      "source": "petitioner"
    },
    {
      "id": "f12",
      "text": "High Court by judgment dated 7th March, 1969 allowed writ petitions, directed ITO to refrain from proceeding under sec. 147.",
      "type": "procedural",
      "date": "1969-03-07",
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the Income Tax Officer had reason to believe under clause (a) of sec. 147 of the Income Tax Act, 1961 that by omission or failure of assessee to disclose fully and truly all material facts necessary for assessment, income had escaped assessment, justifying reopening.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether High Court under Art. 226 had power to investigate if ITO justified in proceeding under sec. 147 on material before him.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "1957 trust deeds (Fern Hill, Race View) were material facts not disclosed; their descriptions show prior statement untrue; sec. 268 Mullas Principles presumes marriage in circumstances present; ladies legally wedded wives.",
      "supporting_facts": [
        "f7",
        "f8",
        "f11"
      ],
      "legal_basis": "Sec. 147(a) Income Tax Act 1961; Sec. 268 Mullas Principles of Mohammedan Law"
    },
    {
      "id": "pa2",
      "text": "High Court under Art. 226 cannot investigate sufficiency of material or correct conclusion from it for sec. 147 jurisdiction.",
      "supporting_facts": [],
      "legal_basis": "S. Narayanappa v. CIT; Kantamani Venkata Narayana v. ITO; CIT Gujarat v. A. Raman Co.; Calcutta Discount Co. v. ITO"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "All material facts disclosed via 1950 trusts and explanation; 1957 trusts repeat same descriptions, throw no new light; no omission to disclose material facts.",
      "supporting_facts": [
        "f3",
        "f4",
        "f5",
        "f6"
      ],
      "legal_basis": "Sec. 147(a) Income Tax Act 1961"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "1957 trust deeds conform to 1950 deeds in material particulars, repeat same descriptions of ladies as wives; non-production not non-disclosure of material fact; ITO accepted prior explanation.",
      "addresses_issue": "i1",
      "key_observation": "The documents of 1957 only repeat what the deeds of 1950 had disclosed."
    },
    {
      "id": "cr2",
      "text": "Having second thoughts on same material does not warrant initiation under sec. 147; no fresh material; no condition precedent for jurisdiction exists.",
      "addresses_issue": "i1",
      "key_observation": "Non-production of the documents executed in 1957 cannot be regarded as non-disclosure of any material fact necessary for the assessment."
    },
    {
      "id": "cr3",
      "text": "Not deciding if ladies legally wedded wives; law unchanged, ITO could have presumed earlier but cannot use sec. 147 to correct mistake.",
      "addresses_issue": "i1",
      "key_observation": "If he should have but did not do so then, he cannot avail of sec. 147 to correct that mistake."
    },
    {
      "id": "cr4",
      "text": "Cited decisions do not help; High Court held no fresh material, not insufficiency or wrong conclusion.",
      "addresses_issue": "i2",
      "key_observation": "The decision of the High Court is not that the material before the Income Tax Officer was insufficient."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Income Tax Officer had no valid reasons to believe respondent omitted or failed to disclose material facts; no jurisdiction under sec. 147(a) to reopen assessments.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "High Court judgment correct in preventing proceedings under sec. 147.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "S. Narayanappa v. Commissioner of Income Tax, Bangalore",
      "citation": null,
      "treatment": "distinguished",
      "relevance": "On High Court power under Art. 226 to investigate sec. 147 jurisdiction"
    },
    {
      "case_name": "Kantamani Venkata Narayana and Sons v. First Additional Income Tax Officer, Rajahmundry",
      "citation": null,
      "treatment": "distinguished",
      "relevance": "On High Court power under Art. 226 to investigate sec. 147 jurisdiction"
    },
    {
      "case_name": "Commissioner of Income Tax, Gujarat v. A. Raman Co.",
      "citation": null,
      "treatment": "distinguished",
      "relevance": "On High Court power under Art. 226 to investigate sec. 147 jurisdiction"
    },
    {
      "case_name": "Calcutta Discount Co. Ltd. v. Income Tax Officer, Companies District I, Calcutta",
      "citation": null,
      "treatment": "distinguished",
      "relevance": "On High Court power under Art. 226 to investigate sec. 147 jurisdiction"
    }
  ],
  "statutes_cited": [
    {
      "name": "Income Tax Act, 1961",
      "sections": [
        "147(a)",
        "148"
      ],
      "relevance": "Basis for reopening assessments; condition precedent of non-disclosure of material facts not satisfied"
    },
    {
      "name": "Income Tax Act, 1922",
      "sections": [
        "16(3)"
      ],
      "relevance": "Income of wife/minor child from transferred assets included in assessee's total income"
    },
    {
      "name": "Constitution of India",
      "sections": [
        "226"
      ],
      "relevance": "High Court's writ jurisdiction to examine sec. 147 proceedings"
    },
    {
      "name": "Mullas Principles of Mohammedan Law",
      "sections": [
        "268"
      ],
      "relevance": "Circumstances presuming marriage; petitioner argued presumption applies but court did not decide"
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court upheld High Court judgment allowing writ petitions and directing Income Tax Officer to refrain from proceeding under sec. 147 of Income Tax Act, 1961, as no material facts undisclosed and no jurisdiction to reopen assessments.",
    "relief_granted": "Prevention of reassessment proceedings under sec. 147",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "Having second thoughts on the same material does not warrant the initiation of a proceeding under sec. 147 of the Income Tax Act, 1961.",
      "speaker": "court",
      "significance": "Core holding on limits of reopening jurisdiction"
    },
    {
      "text": "Non-production of the documents executed in 1957 at the time of the original assessments cannot therefore be regarded as non-disclosure of any material fact necessary for the assessment.",
      "speaker": "court",
      "significance": "Rejects petitioner's basis for reopening"
    }
  ],
  "_case_id": "1974_418",
  "_label": 0,
  "_text_length": 13340,
  "_extracted_at": "2026-02-10T20:06:52.813229"
}