{
  "metadata": {
    "case_name": "Commissioner of Income Tax, West Bengal-III, Calcutta v. Indian Sugar Mills Association",
    "case_year": 1970,
    "court": "Supreme Court of India",
    "judges": [
      "GUPTA J."
    ],
    "case_number": "Civil Appeals Nos. 1225 to 1228 of 1970",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The Indian Sugar Mills Association is a Trade Union registered under the Trade Unions Act, 1926 with office in Calcutta. Any individual, firm or company owning or managing a sugar mill or factory is eligible for membership.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Rule 3(a) of the Rules of the Association: To promote and protect the trade, commerce and industries of India and in particular, the trade, commerce and industries connected with sugar.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Rule 3(b): To encourage friendly feeling and good relations amongst the sugar mills in general and the members in particular and also between producers of sugar and cane-growers, distributors of sugar and others dealing with sugar mills and connected with sugar industry.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Rule 4(a): Subject to such special rules as may be framed for the purpose, the income and property of the Association whensoever derived, shall be applied solely towards the promotion of the Association as set forth in these Rules and Regulations and no portion thereof shall be paid or transferred, directly or indirectly, by way of dividend or bonus or otherwise howsoever by way of profit, to the persons who at any time are, or have been members of the Association or to any of them or to any person claiming through any of them.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Rule 64: Subject to such rules as the General Meeting may frame or prescribe for declaration of dividend and distribution of profits, the profits of the Association shall be applied in such manner as the Committee may in their discretion think fit provided nevertheless that no distribution of profits amongst members will be made unless sanctioned by a Resolution at a General Meeting of the Association held for the purpose.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Income derived by the Association from its sugar export division and interest from current and fixed deposits. Assessment years: 1958-59, 1959-60, 1960-61, 1961-62 (previous years: calendar years 1957, 1958, 1959, 1960).",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Association claimed exemption from tax under section 4(3)(i) of the Income Tax Act, 1922 on the ground that the business it carried on was in the nature of property held under trust or legal obligation to apply the income for charitable purposes.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "Income-tax Officer, Appellate Assistant Commissioner and Tribunal rejected the claim for exemption.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Tribunal referred the question to Calcutta High Court under sec. 66(1) of Income Tax Act, 1922: Whether on the facts and circumstances of the case and on proper construction of the Rules and Regulations of the Association, the Tribunal was justified in holding that the income of the Association derived from the business of export of sugar and interest from current and fixed deposits were not exempt from tax under section 4(3)(i) of the Indian Income-tax Act, 1922?",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "High Court answered the question in the negative and in favour of the assessee (Association) on 11th July, 1969 in Income Tax Reference No. 213 of 1966.",
      "type": "procedural",
      "date": "1969-07-11",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Commissioner of Income Tax preferred appeals to Supreme Court with certificate under section 66A(2) of Income Tax Act, 1922.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Other objects in Rule 3 include: To regulate terms and conditions of employment in the Mills and Factories; To promote good relations between the employers and the employees; To adjust controversies between members; To establish just and equitable principles in trade and impose restrictive conditions on the conduct of sugar trade and business.",
      "type": "background",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the income derived by the respondent, Indian Sugar Mills Association, from its sugar export division is exempt from tax under sec. 4(3)(i) of the Income Tax Act, 1922.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The Association does not hold its income wholly for charitable purposes within sec. 4(3)(i) due to Rule 64 permitting distribution of profits to members, introducing element of private gain.",
      "supporting_facts": [
        "f5",
        "f4"
      ],
      "legal_basis": "All India Spinners Association v. CIT Bombay; Trade Unions Act, 1926 s.2(h)"
    },
    {
      "id": "pa2",
      "text": "Objects under Rule 3 are primary purposes of a Trade Union, not charitable; cannot sever rules or declare some primary and others ancillary.",
      "supporting_facts": [
        "f1",
        "f2",
        "f12"
      ],
      "legal_basis": "Trade Unions Act, 1926 s.2(h)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Clauses 3(a) and 3(b) set out primary objects of general public utility; other objects ancillary; Rule 4(a) imposes legal obligation to apply income for these purposes; Rule 64 inconsistent and void.",
      "supporting_facts": [
        "f2",
        "f3",
        "f4"
      ],
      "legal_basis": "CIT Madras v. Andhra Chamber of Commerce, 55 I.T.R. 722; Trustees of the Tribune; All India Spinners Association"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Rule 64 permits distribution of profits among members, making general prohibition in Rule 4(a) nugatory and introducing private gain inconsistent with general public utility.",
      "addresses_issue": "i1",
      "key_observation": "Rule 64 thus permits distribution of profits among the members on a resolution being passed... introduces an element of private gain."
    },
    {
      "id": "cr2",
      "text": "Cannot treat Rule 64 as void; no right to rewrite rules of registered trade union or assume some objects primary and others ancillary.",
      "addresses_issue": "i1",
      "key_observation": "We have no right to rewrite the rules of a registered trade union by deleting any of them."
    },
    {
      "id": "cr3",
      "text": "Association is Trade Union under s.2(h) Trade Unions Act; listed objects are primary trade union purposes, not charitable.",
      "addresses_issue": "i1",
      "key_observation": "These are all primary purposes of a Trade Union."
    },
    {
      "id": "cr4",
      "text": "Distinguishes Andhra Chamber of Commerce: no profit motive there; here profit distribution possible.",
      "addresses_issue": "i1",
      "key_observation": "This is also what distinguishes the present case from the Andhra Chamber of Commerce case where it was found that the Chamber of Commerce had no profit motive."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The income of the Association derived from the business of export of sugar and interest from current and fixed deposits is not exempt from tax under section 4(3)(i) of the Income Tax Act, 1922.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "In re The Trustees of the Tribune",
      "citation": "7 I.T.R. 415",
      "treatment": "referred",
      "relevance": "Principle on customary law and common opinion for general public utility in countries where English ideas inapplicable."
    },
    {
      "case_name": "All India Spinners Association v. Commissioner of Income-tax, Bombay",
      "citation": "12 I.T.R. 482",
      "treatment": "followed",
      "relevance": "Object of general public utility excludes private gain; income not held wholly for charitable purposes if private gain possible."
    },
    {
      "case_name": "Commissioner of Income-Tax, Madras v. Andhra Chamber of Commerce",
      "citation": "55 I.T.R. 722",
      "treatment": "distinguished",
      "relevance": "Promotion of trade etc. can be general public utility if no profit motive and other objects ancillary; distinguished due to Rule 64 allowing profit distribution."
    }
  ],
  "statutes_cited": [
    {
      "name": "Income Tax Act, 1922",
      "sections": [
        "4(3)(i)",
        "66(1)",
        "66A(2)"
      ],
      "relevance": "Exemption for income held wholly for charitable purposes; reference to High Court and certificate for appeal."
    },
    {
      "name": "Trade Unions Act, 1926",
      "sections": [
        "2(h)"
      ],
      "relevance": "Defines Trade Union; primary purposes include regulating relations between employers, imposing restrictive conditions on trade."
    },
    {
      "name": "Indian Companies Act, 1913",
      "sections": [
        "26"
      ],
      "relevance": "Mentioned in context of Andhra Chamber of Commerce being permitted to omit 'limited'."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Supreme Court allows the appeals, discharges the High Court's answer, answers the referred question in the affirmative and in favour of the Revenue.",
    "relief_granted": "None to respondent; exemption denied.",
    "costs": "Appellant entitled to costs in this Court as well as in the High Court. One hearing fee."
  },
  "key_quotes": [
    {
      "text": "Rule 64 introduces an element of private gain which is inconsistent with the object of general public utility and following the decision in All India Spinners Association... it cannot be said that the Association... held the income... wholly for charitable purposes.",
      "speaker": "court",
      "significance": "Core reasoning for denying exemption."
    },
    {
      "text": "We have no right to rewrite the rules of a registered trade union by deleting any of them.",
      "speaker": "court",
      "significance": "Rejects severing inconsistent rules."
    }
  ],
  "_case_id": "1974_324",
  "_label": 1,
  "_text_length": 15199,
  "_extracted_at": "2026-02-10T20:06:08.460451"
}