{
  "metadata": {
    "case_name": "State of West Bengal v. Respondent (Superintendent of Pak Unit)",
    "case_year": 1970,
    "court": "Supreme Court of India",
    "judges": [
      "BEG, J."
    ],
    "case_number": "Criminal Appeal No. 189 of 1970",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Respondent was serving as Superintendent of Pakistan Section (Pak Unit) of Hindustan Co-operative Life Insurance Society, a unit of Life Insurance Corporation of India, Calcutta, between 12th May 1958 and 7th May 1959.",
      "type": "admitted",
      "date": null,
      "source": "special_court"
    },
    {
      "id": "f2",
      "text": "Respondent collected premiums in cash amounting to about Rs. 2350-49 np. from Pakistani policy holders (witnesses 6,7,8,15 and others) at Hindustan Building, Calcutta, and issued receipts (Ext. 3 series other than Ex. 3/5) on behalf of LIC.",
      "type": "material",
      "date": "1958-05-12 to 1959-05-07",
      "source": "special_court"
    },
    {
      "id": "f3",
      "text": "Respondent made false entries in premium register folio (Exts. 5,8,9 series) and relevant books showing that amounts were received through Bank in Pakistan, misappropriating the premiums.",
      "type": "disputed",
      "date": "1958-05-12 to 1959-05-07",
      "source": "prosecution"
    },
    {
      "id": "f4",
      "text": "Pak Unit had no authority to collect premiums in cash from Pakistani policy holders; they could not make cash payments at cash counter; policies could only be transferred to Indian Unit with migration certificates and permissions from Indian and Pakistan Governments.",
      "type": "admitted",
      "date": null,
      "source": "special_court"
    },
    {
      "id": "f5",
      "text": "Special Court acquitted respondent under Section 409 IPC as no entrustment in capacity as public servant; no alternative charge under Section 406 or 403 IPC possible.",
      "type": "procedural",
      "date": null,
      "source": "special_court"
    },
    {
      "id": "f6",
      "text": "High Court upheld acquittal, finding trial without jurisdiction as offence not under Schedule Item 2.",
      "type": "procedural",
      "date": "1970-02-19",
      "source": "high_court"
    },
    {
      "id": "f7",
      "text": "Respondent denied personally receiving amounts, claimed signed receipts mechanically put up by clerks.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "Offence committed more than 15 years ago; respondent about 64 years old, dismissed from service, refugee from Pakistan under straightened circumstances.",
      "type": "background",
      "date": null,
      "source": "respondent"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the respondent committed criminal breach of trust punishable under Section 409 IPC in his capacity as a public servant, enabling entrustment or dominion over property in that capacity.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the Special Court constituted under West Bengal Criminal Law Amendment (Special Courts) Act XXI of 1949 had jurisdiction to try the offence as per Schedule Item 2.",
      "framed_by": "special_court"
    },
    {
      "id": "i3",
      "text": "Whether the ingredients of Schedule Item 2 differ from those of Section 409 IPC.",
      "framed_by": "high_court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Ingredients of offence under Schedule Item 2 do not differ from Section 409 IPC; respondent acted in capacity as public servant by misusing official position to receive and misappropriate premiums.",
      "supporting_facts": [
        "f1",
        "f2",
        "f3"
      ],
      "legal_basis": "Section 409 IPC; West Bengal Criminal Law Amendment (Special Courts) Act XXI of 1949, Schedule Item 2"
    },
    {
      "id": "pa2",
      "text": "Entrustment arises from ostensible authority and nexus with official capacity, even if technically outside duties; fraudulent receipt creates obligation.",
      "supporting_facts": [
        "f1",
        "f4"
      ],
      "legal_basis": "State of U.P. v. Babu Ram Upadhya; S.N. Puri v. State of Rajasthan"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "No authority or duty as Superintendent to receive cash premiums from Pakistani policy holders; acted outside capacity as public servant; clerks may have deceived.",
      "supporting_facts": [
        "f4",
        "f7"
      ],
      "legal_basis": "Section 409 IPC"
    },
    {
      "id": "ra2",
      "text": "If not under Section 409, convict under Section 403 IPC with fine considering age, dismissal, time elapsed, refugee status.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": "Section 403 IPC"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Offence under Section 409 IPC committed if dominion over property acquired in capacity as public servant, even if fraudulent; ostensible authority and nexus with official capacity suffice, not technical departmental duties.",
      "addresses_issue": "i1",
      "key_observation": "Respondent misused official capacity to obtain payments and issue receipts; policy holders paid due to belief in his authority."
    },
    {
      "id": "cr2",
      "text": "Schedule Item 2 limits Section 409 offences to public servants acting in that capacity, but does not add or alter ingredients.",
      "addresses_issue": "i3",
      "key_observation": "No difference between Schedule Item 2 and Section 409 IPC requirements."
    },
    {
      "id": "cr3",
      "text": "Entrustment can arise from fraudulent conduct using official capacity; obligation to deal honestly created regardless of legal right to receive.",
      "addresses_issue": "i1",
      "key_observation": "Sufficient nexus between official capacity and receipt of monies."
    },
    {
      "id": "cr4",
      "text": "Special Court had jurisdiction as offence falls under Schedule Item 2.",
      "addresses_issue": "i2",
      "key_observation": "Trial not null and void."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Respondent guilty of offence under Section 409 IPC as he acquired dominion over premiums in capacity as public servant by misuse of official position.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Special Court had jurisdiction under the Act.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "State of U.P. Ors. v. Babu Ram Upadhya",
      "citation": null,
      "treatment": "followed",
      "relevance": "Wrongful acquisition of dominion using official capacity constitutes entrustment under Section 409 IPC."
    },
    {
      "case_name": "S. N. Puri v. State of Rajasthan",
      "citation": null,
      "treatment": "followed",
      "relevance": "\"Entrusted\" in Section 409 IPC used in wide sense, includes property voluntarily handed over for specific purpose and dishonestly disposed of."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Penal Code, 1860",
      "sections": [
        "Section 409",
        "Section 406",
        "Section 403"
      ],
      "relevance": "Section 409 for criminal breach of trust by public servant; no alternative charges possible; conviction under 409."
    },
    {
      "name": "West Bengal Criminal Law Amendment (Special Courts) Act XXI of 1949",
      "sections": [
        "Section 4(1) proviso",
        "Schedule Item 2"
      ],
      "relevance": "Empowers Special Court to try Section 409 offences by public servants; may try other offences chargeable at same trial but no alternative framing here."
    },
    {
      "name": "Code of Criminal Procedure, 1898",
      "sections": null,
      "relevance": "Referenced for charging offences at same trial."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 134(1)(c)"
      ],
      "relevance": "Certificate for appeal to Supreme Court."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; orders of Special Court and High Court set aside; respondent convicted under Section 409 IPC and sentenced to one year's rigorous imprisonment and to pay a fine.",
    "relief_granted": "Conviction and sentence under Section 409 IPC; lesser sentence considering time elapsed.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The gravamen of the offence is the dishonest misappropriation of the money or property which comes into the possession or under the control of a public servant who has the ostensible authority to receive it even though, technically speaking, from the point of view of the distribution of departmental duties under internal rules of an office, it may not be within the scope of his authority or duty to accept the money.",
      "speaker": "court",
      "significance": "Defines scope of 'capacity as public servant' under Section 409 IPC."
    },
    {
      "text": "Ordinarily, it is the ostensible or apparent scope of public servant's authority when receiving property and not its technical limitations, under some internal rules of the department or office concerned, and the use made by the servant of his actual official capacity which would... determine whether there is a sufficient nexus...",
      "speaker": "court",
      "significance": "Establishes test for nexus between official capacity and offence."
    },
    {
      "text": "We therefore hold that the respondent is guilty of an offence punishable under section 409 I.P.C. which could be tried by the Special Court.",
      "speaker": "court",
      "significance": "Core holding reversing acquittals."
    }
  ],
  "_case_id": "1974_442",
  "_label": 1,
  "_text_length": 19622,
  "_extracted_at": "2026-02-10T20:06:44.827700"
}