{
  "metadata": {
    "case_name": "Appellant v. Vidya Varidhi Thirtha Swamiar",
    "case_year": 1973,
    "court": "Supreme Court of India",
    "judges": [
      "RAY, C. J."
    ],
    "case_number": "Civil Appeal Nos. 2232 of 1973",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "In 1968, Vidya Varidhi Thirtha Swamiar (third respondent) made an application to the Municipal Council, Udipi for construction of Kalyana Mantap-cum-Lecture Hall.",
      "type": "background",
      "date": "1968",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Licence granted on 8 April 1969 for construction of Kalyana Mantap-cum-Lecture Hall subject to two main conditions: building to be Kalyana Mantap and construction subject to Madras Public Health Act, 1939 and Scheme under Madras Town Planning Act, 1920.",
      "type": "material",
      "date": "1969-04-08",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On 23 March 1970, third respondent applied under Madras Place of Public Resorts Act, 1888 to Chief Officer, Town Municipal Council for licence to use building for exhibition of cinematographic films for public entertainment.",
      "type": "procedural",
      "date": "1970-03-23",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Third respondent also applied under section 256 of Mysore Municipalities Act to install generators with oil engines.",
      "type": "procedural",
      "date": "1970-03",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "On 8 April 1970, third respondent applied to extend period of licence dated 8 April 1969 and for permission to convert building into one for exhibition of films.",
      "type": "procedural",
      "date": "1970-04-08",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "On 18 April 1970, first respondent rejected application on ground that cinema theatre could not be permitted under provisions of Town Planning Scheme in force.",
      "type": "procedural",
      "date": "1970-04-18",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "On 29 April 1970, application for conversion of Kalyana Mantap-cum-Lecture Hall into cinema theatre rejected by first respondent.",
      "type": "procedural",
      "date": "1970-04-29",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "On 4 May 1970, third respondent filed appeal against order dated 18 April 1970 under Madras Place of Public Resorts Act. No appeal filed against order dated 29 April 1970 rejecting conversion.",
      "type": "procedural",
      "date": "1970-05-04",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Municipal Council passed four resolutions: (1) 11 June 1970 - granted licence to exhibit cinematograph films on appeal against 18 April 1970 order; (2) 18 June 1970 - licence subject to conditions (microphone inside, land level above road, engine room to avoid disturbance, Chief Officer to impose further conditions); (3) 19 June 1970 - granted permission under s.256 Mysore Municipalities Act for installation of electric motors and oil engine; (4) 19 June 1970 - approved revised plans for conversion of Kalyana Mantap-cum-Lecture Hall into cinema theatre.",
      "type": "material",
      "date": "1970-06-11",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Government of Madras approved Central Ward Town Planning Scheme in Udipi on 24 May 1945 under Madras Town Planning Act. Clause 15: Shops and business premises (including theatre) permitted only in places shown as reserved (Badagapet Road, Hanuman Office Road, Post Office Road) with sanction of responsible authority and previous approval of Director of Town Planning. Clause 14: Area for residential purposes only, with exceptions permitted by responsible authority with Director's approval.",
      "type": "background",
      "date": "1945-05-24",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "On 31 October 1970, appellant filed suit in Court of Munsiff, Udipi for injunction against third respondent from installing cinematographic apparatus and using building as cinema house.",
      "type": "procedural",
      "date": "1970-10-31",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "On 7 December 1971, Ananthakrishna Rao and two others filed Writ Petition No. 4904 of 1970 before Mysore High Court against respondents; High Court granted stay of four resolutions.",
      "type": "procedural",
      "date": "1971-12-07",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "On 2 April 1972, appellant filed Writ Petition No. 934 of 1972 impeaching the four resolutions.",
      "type": "procedural",
      "date": "1972-04-02",
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Mysore High Court judgment dated 22 September 1972 quashed three resolutions (11 June, 18 June, 19 June s.256), left fourth resolution (19 June plan approval) undisturbed, considering third respondent's expenditure of Rs. 5 lakhs and interval before stay.",
      "type": "procedural",
      "date": "1972-09-22",
      "source": "lower_court"
    },
    {
      "id": "f15",
      "text": "On 13 October 1973, Supreme Court granted special leave to appeal and interim stay.",
      "type": "procedural",
      "date": "1973-10-13",
      "source": "court"
    },
    {
      "id": "f16",
      "text": "On 30 January 1973, interim stay vacated.",
      "type": "procedural",
      "date": "1973-01-30",
      "source": "court"
    },
    {
      "id": "f17",
      "text": "On 14 March 1973, Deputy Commissioner granted licence to third respondent for exhibition of films under Mysore Cinemas (Regulation) Act read with Mysore Cinemas (Regulation) Rules, 1971.",
      "type": "procedural",
      "date": "1973-03-14",
      "source": "court"
    },
    {
      "id": "f18",
      "text": "On 15 March 1973, appellant filed Writ Petition No. 755 of 1973 challenging Deputy Commissioner's order; pending in High Court.",
      "type": "procedural",
      "date": "1973-03-15",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the four resolutions of the Municipal Council, particularly the fourth resolution dated 19 June 1970 approving revised plans for conversion of Kalyana Mantap-cum-Lecture Hall into cinema theatre, are valid in light of the Town Planning Scheme prohibiting cinemas in residential areas.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the appellant, as a resident in the area, has locus standi to challenge the resolutions despite alternative remedies and alleged lack of injury.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether the High Court's refusal to quash the fourth resolution on grounds of third respondent's expenditure validates an illegal act.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "No appeal preferred by third respondent against Municipality's order dated 29 April 1970 refusing permission for construction of cinema theatre building.",
      "supporting_facts": [
        "f7",
        "f8"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Town Planning Scheme (clauses 14 and 15) forbids cinema building (business premises) in residential area without sanction of responsible authority and Director of Town Planning.",
      "supporting_facts": [
        "f10"
      ],
      "legal_basis": "Madras Town Planning Act, 1920 Scheme"
    },
    {
      "id": "pa3",
      "text": "Municipality has no power to sanction conversion into cinema theatre; area is residential.",
      "supporting_facts": [
        "f2",
        "f6",
        "f7",
        "f9"
      ],
      "legal_basis": "Mysore Municipalities Act"
    },
    {
      "id": "pa4",
      "text": "Appellant pursued alternative remedies (suit and writ) but they do not seek relief against impeached resolutions.",
      "supporting_facts": [
        "f11",
        "f18"
      ],
      "legal_basis": null
    },
    {
      "id": "pa5",
      "text": "Appellant as resident has right to compel Municipality to perform statutory duty; special damage from breach in residential area.",
      "supporting_facts": [
        "f14"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Appellant pursued alternative remedies: suit filed 31 Oct 1970 and Writ Petition No. 755/1973.",
      "supporting_facts": [
        "f11",
        "f18"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "No relief without injury; mere grant of licence causes no injury until building used as cinema.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": "Cutler v. Wandsworth Stadium (1949) A.C. 398"
    },
    {
      "id": "ra3",
      "text": "Town Planning Scheme lapsed after 20 years from 1945.",
      "supporting_facts": [
        "f10"
      ],
      "legal_basis": null
    },
    {
      "id": "ra4",
      "text": "High Court correctly did not quash fourth resolution due to expenditure of Rs. 5 lakhs.",
      "supporting_facts": [
        "f14"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "High Court correctly quashed first three resolutions: Madras Place of Public Resorts Act, 1888 ceased to operate; no power under s.256 Mysore Municipalities Act for cinema-related installation.",
      "addresses_issue": "i1",
      "key_observation": "Municipal Council had no power under those Acts for the licences granted."
    },
    {
      "id": "cr2",
      "text": "Town Planning Scheme approved 24 May 1945 did not lapse after 20 years; clause 15 prohibits cinema (business premises) outside specified roads without authority sanction and Director approval; site is residential under clause 14.",
      "addresses_issue": "i1",
      "key_observation": "Municipality cannot approve cinema in residential area; no power to convert or vary scheme."
    },
    {
      "id": "cr3",
      "text": "Appellant as resident in area has locus standi; special and substantial interest injured by illegal construction violating scheme for benefit of residents; can challenge at threshold.",
      "addresses_issue": "i2",
      "key_observation": "Breach of statutory duty for benefit of class (residents) gives right to enforce; distinguishes Cutler case."
    },
    {
      "id": "cr4",
      "text": "Excess of statutory power cannot be validated by acquiescence, estoppel, or expenditure; illegality incurable; High Court wrong to leave fourth resolution undisturbed.",
      "addresses_issue": "i3",
      "key_observation": "Courts will not aid relief against statutory provisions; cites Yabbicom v. King and Maddison v. Alderson."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Municipal resolutions sanctioning cinema in violation of Town Planning Scheme are invalid and must be quashed; Municipality lacks power to approve such conversion in residential area.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Resident in affected area has standing to challenge breach of Town Planning Scheme as statutory duty for public benefit with special interest.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h3",
      "text": "Illegal sanction cannot stand due to expenditure or estoppel.",
      "resolves_issue": "i3",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Cutler v. Wandsworth Stadium",
      "citation": "1949 A.C. 398",
      "treatment": "distinguished",
      "relevance": "Object of Act was for public, not individual bookmakers; unlike here where statute protects residents' class interest."
    },
    {
      "case_name": "Yabbicom v. King",
      "citation": "1899 1 Q.B. 444",
      "treatment": "followed",
      "relevance": "Approval of building plans contravening bye-laws is illegal and inoperative; Municipality amenable to courts if exceeds powers."
    },
    {
      "case_name": "Maddison v. Alderson",
      "citation": "1883 8 App. Cases 467",
      "treatment": "referred",
      "relevance": "Courts of equity will not permit statute to be instrument of fraud; no estoppel against statute."
    }
  ],
  "statutes_cited": [
    {
      "name": "Madras Town Planning Act, 1920",
      "sections": [
        "Scheme clauses 14, 15"
      ],
      "relevance": "Prohibits cinema theatre (business premises) in residential area without specific sanction; scheme in force."
    },
    {
      "name": "Madras Place of Public Resorts Act, 1888",
      "sections": [],
      "relevance": "Ceased to be in force; resolutions under it invalid."
    },
    {
      "name": "Mysore Municipalities Act",
      "sections": [
        "Section 256"
      ],
      "relevance": "Does not contemplate licence for cinema installations; no power to grant."
    },
    {
      "name": "Madras Public Health Act, 1939",
      "sections": [],
      "relevance": "Condition in original licence."
    },
    {
      "name": "Mysore Cinemas (Regulation) Act",
      "sections": [],
      "relevance": "Deputy Commissioner granted licence thereunder; separate challenge pending."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; High Court order set aside insofar as it left the fourth resolution dated 19 June 1970 (Annexure D) undisturbed; that resolution quashed as lacking legal foundation and violating Town Planning Scheme.",
    "relief_granted": "Quashing of Municipal Council's fourth resolution approving conversion to cinema theatre.",
    "costs": "Parties to pay and bear their own costs."
  },
  "key_quotes": [
    {
      "text": "The scheme here is for the benefit of the public. There is special interest in the performance of the duty. All the residents in the area have their personal interest in the performance of the duty.",
      "speaker": "court",
      "significance": "Establishes locus standi of appellant as resident."
    },
    {
      "text": "An excess of statutory power cannot be validated by acquiescence in or by the operation of an estoppel.",
      "speaker": "court",
      "significance": "Rejects estoppel or expenditure as curing illegality."
    },
    {
      "text": "Illegality is incurable.",
      "speaker": "court",
      "significance": "Core holding on invalidity of resolution despite circumstances."
    }
  ],
  "_case_id": "1974_189",
  "_label": 1,
  "_text_length": 18732,
  "_extracted_at": "2026-02-10T20:05:06.512492"
}