{
  "metadata": {
    "case_name": "State of Tamil Nadu v. Abdul Karim & Ors.",
    "case_year": 1974,
    "court": "Supreme Court of India",
    "judges": [
      "ALGIRSWAMI, J."
    ],
    "case_number": "Civil Appeals Nos. 1366, 1850 to 1863, 2550 to 2551 of 1969, 1355, 1356 of 1970, and 1292, 1293 of 1973",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Rule 16 of the Madras General Sales Tax Rules under Madras Act IX of 1939 provided for taxation of untanned hides/skins from the last purchaser in State not exempt under Sec. 3(3); tanned hides/skins tanned outside State from first dealer in State; tanned within State from first dealer with proviso if tax paid on untanned.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Rule 16 struck down by Supreme Court in Firm A.T.B. Mehtab Majid Co. v. State of Madras as discriminatory: tanner buying raw inside State pays tax on purchase price of raw; dealer buying raw outside and tanning pays on sale price of tanned.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Madras Legislature passed Act 11 of 1963, Sec. 2(1): tax on first seller of dressed hides/skins not taxed as raw, for 1st April 1955 to 31st March 1959 at 2% of last purchase price in untanned condition.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Act 11/1963 Sec. 2(1) struck down by Supreme Court in A. Hajee Abdul Shakoor Co. v. State of Madras as discriminatory: uniform 2% rate while general rate 1955-57 was 1 9/16%, discriminating against out-of-State raw purchasers.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Madras Act 37 of 1964, Sec. 2(1): notwithstanding MGST Act 1939 or rules, tax on first seller in State of dressed hides/skins not subjected to tax as raw hides/skins, not exempt under Sec. 3(3): 1 9/16% for 1 Apr 1955-31 Mar 1957; 2% for 1 Apr 1957-31 Mar 1959, of amount last purchased in untanned condition.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Madras High Court struck down Sec. 2(1) of Madras Act 37/1964 in judgments dated 1st March/26th February 1969, 29th July/2nd August 1971 in various WPs and Tax Cases.",
      "type": "procedural",
      "date": "1969-03-01",
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "State appealed to Supreme Court against High Court judgments.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether Sec. 2(1) of Madras Act 37 of 1964 is valid or contravenes Article 286 of the Constitution by discriminating between tanners using raw hides/skins purchased inside vs. outside the State.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Tax under Sec. 2(1) is on first sale of tanned hides/skins, calculated on purchase price of raw hides/skins whether purchased inside or outside State; no distinction or discrimination; out-of-State raw purchases taxed under Central Sales Tax Act, not here; lower base than sale price benefits importers; no tax on imported raw purchases.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": "Article 286; Madras Act 37/1964 Sec. 2(1)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Tax discriminatory as per High Court view; if sale price taxed with rebate, no objection, but current scheme objectionable.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "No discrimination: tax levied on first sale of tanned hides/skins (not on raw purchase) but quantified on last purchase price of raw whether inside or outside State; same for both; importer pays no higher tax, actually less as raw price lower than tanned sale price; State could tax sale price but chose lower raw purchase base.",
      "addresses_issue": "i1",
      "key_observation": "Tax is on sale of tanned hides/skins, not purchase of raw; quantification on raw purchase price uniform regardless of source."
    },
    {
      "id": "cr2",
      "text": "High Court suggestion of taxing sale price with rebate impractical as conversion costs vary by tanner; purchase price figures easier.",
      "addresses_issue": "i1",
      "key_observation": "Scheme not based on sale price, rebate scheme unworkable."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Sec. 2(1) of Madras Act 37 of 1964 does not discriminate or contravene Article 286; High Court erred in striking it down.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Firm A.T.B. Mehtab Majid Co. v. State of Madras",
      "citation": "1963 Supp. S.C.R. 435",
      "treatment": "referred",
      "relevance": "Struck down Rule 16 for discrimination between local and imported raw hides tanners."
    },
    {
      "case_name": "A. Hajee Abdul Shakoor Co. v. State of Madras",
      "citation": "1964 8 S.C.R. 217",
      "treatment": "referred",
      "relevance": "Struck down Sec. 2(1) Act 11/1963 for uniform 2% rate discriminating against periods with lower general rate."
    }
  ],
  "statutes_cited": [
    {
      "name": "Madras General Sales Tax Act, 1939 (Madras Act IX of 1939)",
      "sections": [
        "Section 3(1)",
        "Section 3(3)"
      ],
      "relevance": "General tax levy; exemption under sub-sec. 3; basis for impugned special provisions."
    },
    {
      "name": "Madras Act 37 of 1964",
      "sections": [
        "Section 2(1)"
      ],
      "relevance": "Impugned provision for tax on first sale of dressed hides/skins at specified rates on raw purchase price."
    },
    {
      "name": "Madras Act 11 of 1963",
      "sections": [
        "Section 2(1)"
      ],
      "relevance": "Previous provision struck down; dealt with 1955-59 period at uniform 2%."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 286"
      ],
      "relevance": "Alleged contravention by taxing inter-state imports discriminatorily."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Supreme Court held Sec. 2(1) of Madras Act 37/1964 valid, reversed Madras High Court judgments striking it down; no discrimination under Art. 286 as tax on first intra-state sale of tanned hides/skins quantified uniformly on raw purchase price regardless of source.",
    "relief_granted": "Impugned provision upheld",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "We, therefore, hold that the High Court was in error in striking down the impugned provision of law.",
      "speaker": "court",
      "significance": "Final holding upholding validity of Sec. 2(1)."
    },
    {
      "text": "The tax is on the first sale of the tanned hides and skins but it is calculated on the basis of the purchase price of the raw hides and skins whether they were purchased inside the State or outside the State.",
      "speaker": "court",
      "significance": "Core reasoning on absence of discrimination."
    }
  ],
  "_case_id": "1974_298",
  "_label": 1,
  "_text_length": 9766,
  "_extracted_at": "2026-02-10T20:06:11.240912"
}