{
  "metadata": {
    "case_name": "State of Bihar & Ors. etc. v. Dr. S. Mukherjee & Ors.",
    "case_year": 1974,
    "court": "Supreme Court of India",
    "judges": [
      "KRISHNA IYER, J."
    ],
    "case_number": "Civil Appeal Nos. 1430 and 1431 of 1974",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Three candidates competed for two posts of Lecturer in Orthopaedics in government-run Patna and Darbhanga Medical Colleges: Dr. Mukherjee (with British experience), Dr. Ram, and Dr. Jamuar (India-trained).",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Dr. Mukherjee worked for three years as Registrar in hospitals in Britain under orthopaedic professors like Dr. Robert Roaf and Dr. Geoffrey Osborne, with certificates stating he participated or assisted in teaching.",
      "type": "material",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "Government of Bihar viewed Dr. Mukherjee as lacking necessary teaching experience in a teaching institution and appointed Dr. Ram and Dr. Jamuar.",
      "type": "material",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f4",
      "text": "Dr. Mukherjee filed writ petition C.W.J.C. 754 of 1972 in Patna High Court contending he had required teaching experience from UK and was entitled to appointment.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "High Court in first writ directed Government to reconsider Dr. Mukherjee's case along with others; Government re-examined but again held him ineligible.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Dr. Mukherjee filed second writ C.W.J.C. Nos. 423 and 430 of 1973; High Court allowed it on 22nd November 1973, quashed Government's order and appointments of Dr. Ram and Dr. Jamuar, directed consideration of Dr. Mukherjee finding he possessed requisite experience.",
      "type": "procedural",
      "date": "1973-11-22",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "High Court examined Cabinet papers, reports, and opinions of officers.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "State of Bihar, Health Commissioner, Health Minister (appellants in CA 1430/74) and Dr. Ram, Dr. Jamuar (appellants in CA 1431/74) filed appeals by special leave.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Circular letter by Deputy Director of Health Services dated April 14, 1963 cited by State, but held irrelevant by High Court.",
      "type": "procedural",
      "date": "1963-04-14",
      "source": "respondent"
    },
    {
      "id": "f10",
      "text": "Government took policy decision not to consult Medical Council of India.",
      "type": "background",
      "date": null,
      "source": "respondent"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether 'teaching experience in a teaching institution' under MCI regulations requires experience in India only or includes foreign institutions, particularly those where Dr. Mukherjee worked in UK.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the UK hospitals where Dr. Mukherjee worked as Registrar are 'teaching institutions' as per the regulations, and whether his role involved 'teaching experience'.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether High Court erred in examining Cabinet papers and quashing appointments without proof of mala fides.",
      "framed_by": "appellants"
    },
    {
      "id": "i4",
      "text": "Whether testimonials from UK professors are reliable proof of teaching experience without further verification.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Dr. Mukherjee possessed prescribed qualifications including three years teaching experience as Registrar in UK orthopaedic hospitals under reputed professors, as per certificates.",
      "supporting_facts": [
        "f2"
      ],
      "legal_basis": "MCI Regulations under s.33 Indian Medical Council Act, 1956"
    },
    {
      "id": "pa2",
      "text": "Regulations do not limit teaching experience to India; foreign experience from reputed institutions qualifies.",
      "supporting_facts": [
        "f2",
        "f6"
      ],
      "legal_basis": "ss.12,13,14 Indian Medical Council Act, 1956"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Teaching experience must be in Indian teaching institutions; foreign experience, even from UK, not recognized.",
      "supporting_facts": [
        "f3",
        "f9"
      ],
      "legal_basis": "MCI Regulations; Indian Medical Council Act focuses on Indian institutions"
    },
    {
      "id": "ra2",
      "text": "UK hospitals not proved to be teaching institutions recognized by MCI or under British National Health Service Act s.118; Registrar post not shown to involve teaching functions.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": "British National Health Service Act, 1946 s.118"
    },
    {
      "id": "ra3",
      "text": "Testimonials unreliable without further proof; High Court improperly examined Cabinet papers.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "Art.226 Constitution"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Teaching institutions include those recognized under ss.12,13,14 of Indian Medical Council Act; not limited to India but must be linked to scheduled universities/organizations or recognized by Central Govt.",
      "addresses_issue": "i1",
      "key_observation": "India recognizes foreign medical qualifications from reputed institutions abroad including UK."
    },
    {
      "id": "cr2",
      "text": "Dr. Mukherjee's UK institutions prima facie qualify; testimonials from professors taken at face value unless grave suspicion.",
      "addresses_issue": "i2",
      "key_observation": "Registrar role involved participation/assistance in teaching, sufficient unless disproved."
    },
    {
      "id": "cr3",
      "text": "Government must consider all qualified candidates; screening out eligible candidate without evaluation violates Arts.14,16; must verify on reasonable materials if UK experience/teaching functions satisfied.",
      "addresses_issue": "i1",
      "key_observation": "State adopted turbid attitude, preliminary screening invalid."
    },
    {
      "id": "cr4",
      "text": "High Court not necessarily wrong in examining Cabinet papers, but courts should not routinely pry without mala fides alleged.",
      "addresses_issue": "i3",
      "key_observation": "No usurpation of appointment power; only legal flaws reviewed."
    },
    {
      "id": "cr5",
      "text": "Appointing authority (Government) to decide finally after fair consideration, consulting experts if needed; no speaking order required but reasons relevant to rules must animate.",
      "addresses_issue": "i4",
      "key_observation": "Technical questions judge-proof except glaring cases/mala fides."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "'Teaching experience in a teaching institution' includes experience from foreign institutions recognized under ss.12,13,14 IMC Act; Registrar role with participation in teaching qualifies if verified.",
      "resolves_issue": "i1",
      "in_favor_of": "partial"
    },
    {
      "id": "h2",
      "text": "Appointments quashed; Government to reconsider de novo all candidates' claims by Feb 15, 1975, after parties produce evidence by Jan 31, 1975; consider length, quality of experience, academic attainments.",
      "resolves_issue": "i2",
      "in_favor_of": "partial"
    },
    {
      "id": "h3",
      "text": "No obligation for speaking orders in appointments, but must evaluate eligible candidates fairly.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Seaford Court Estates Ltd. v. Asher",
      "citation": "1949 2 All. E.R. 155",
      "treatment": "followed",
      "relevance": "Judge must construe ambiguous statutory words to find legislative intention, iron out creases."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Medical Council Act, 1956",
      "sections": [
        "s.2",
        "s.3",
        "s.11",
        "s.12",
        "s.13",
        "s.14",
        "s.33"
      ],
      "relevance": "Defines scope of recognized foreign institutions for qualifications; empowers regulations on teaching posts qualifications."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art.14",
        "Art.16",
        "Art.226"
      ],
      "relevance": "Equal opportunity requires considering qualified candidates; writ jurisdiction to quash illegal exclusions."
    },
    {
      "name": "National Health Service Act, 1946 (UK)",
      "sections": [
        "s.118"
      ],
      "relevance": "Designation of teaching hospitals; not determinative but helpful if applied."
    }
  ],
  "outcome": {
    "disposition": "partially_accepted",
    "summary": "Appeals dismissed; orders of appointment of Dr. Ram and Dr. Jamuar declared bad in law; State directed to reconsider de novo appointments to two Lecturer posts conforming to legal criteria on teaching experience, with parties at liberty to adduce evidence by Jan 31, 1975, decision by Feb 15, 1975.",
    "relief_granted": "Reconsideration of Dr. Mukherjee's eligibility afresh; quashing of existing appointments.",
    "costs": "Costs against the State only, in favour of Respondent Dr. Mukherjee."
  },
  "key_quotes": [
    {
      "text": "The whole case turns on the precise construction of the blurred expression teaching experience in a teaching institution occurring in the regulations framed by the Medical Council of India under s. 33.",
      "speaker": "court",
      "significance": "Identifies core legal issue."
    },
    {
      "text": "Screening a candidate out of consideration altogether is illegal if the applicant has eligibility under the regulations.",
      "speaker": "court",
      "significance": "Holds exclusion without evaluation violates Arts.14/16."
    },
    {
      "text": "When a defect appears a Judge cannot simply fold his hands and blame the draftsman. He must set to work on the constructive task of finding the intention of Parliament.",
      "speaker": "court",
      "significance": "Justifies purposive interpretation of ambiguous terms."
    },
    {
      "text": "Our judicial bone-setting operation cannot undo the social fracture inflicted by this long expensive bout in court.",
      "speaker": "court",
      "significance": "Highlights social cost of litigation."
    }
  ],
  "_case_id": "1974_356",
  "_label": 0,
  "_text_length": 32903,
  "_extracted_at": "2026-02-10T20:06:49.848641"
}