{
  "metadata": {
    "case_name": "Appellants v. State",
    "case_year": 1971,
    "court": "Supreme Court of India",
    "judges": [
      "KRISHNA IYER, J."
    ],
    "case_number": "Criminal Appeal No. 40 of 1971",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Two groups-the complainants and the accused-have been on terms of bitter hostility-a background material which has legitimately induced both the courts to be very sceptical about the veracity of the prosecution witnesses in the absence of reliable corroboration.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "A confrontation and exchange of violence occurred on June 22, 1964 each party calling the other aggressor.",
      "type": "material",
      "date": "1964-06-22",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Several on the prosecution side did receive gunshot wounds, although none fatal.",
      "type": "material",
      "date": "1964-06-22",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Three among the accused bunch had on their person lathi blow injuries.",
      "type": "material",
      "date": "1964-06-22",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The trial Judge disbelieved the version of the defence but found the P.Ws. too partisan to pin his faith on, and in consequence acquitted everyone.",
      "type": "procedural",
      "date": null,
      "source": "trial_court"
    },
    {
      "id": "f6",
      "text": "The High Court agreed that unless the infirmity of interested testimony was cured by other credible evidence the fate of the case would be the same and on that basis dismissed the State's appeal against all but the three appellants before us.",
      "type": "procedural",
      "date": "1970-09-21",
      "source": "high_court"
    },
    {
      "id": "f7",
      "text": "An encounter did take place and a case and counter-case ensued.",
      "type": "material",
      "date": "1964-06-22",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "The accused-except a few who pleaded alibi in vain- claimed that they were attacked.",
      "type": "disputed",
      "date": "1964-06-22",
      "source": "respondent"
    },
    {
      "id": "f9",
      "text": "Having regard to the number and nature of injuries and the number of persons who have been hit by fire power, the accused were the attackers.",
      "type": "material",
      "date": null,
      "source": "high_court"
    },
    {
      "id": "f10",
      "text": "The complainants plea is that when attacked by guns he and his men went at them, disarmed them and beat them with lathis.",
      "type": "disputed",
      "date": "1964-06-22",
      "source": "petitioner"
    },
    {
      "id": "f11",
      "text": "The convicted three have injuries which fit in with this version.",
      "type": "material",
      "date": "1964-06-22",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Siya Ram, appellant No. 2, had a gun in his hands at the time of the occurrence.",
      "type": "material",
      "date": "1964-06-22",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "The case has been pending for around ten years and the accused must have been in jail for some time.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "The propriety of the Court of Appeal convicting accused persons whose initial advantage of a presumption of innocence has been strengthened by a judicial affirmation at the first level.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Was this exceptional treatment justified a by the evidence, and b in the light of first court's acquittal?",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether these wounds bring home the guilt so strongly as to warrant upsetting of an earlier acquittal.",
      "framed_by": "court"
    },
    {
      "id": "i4",
      "text": "Whether conviction under s. 149 IPC valid when less than five accused convicted.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The accused claimed that they were attacked.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "When attacked by guns he and his men went at them, disarmed them and beat them with lathis.",
      "supporting_facts": [
        "f10",
        "f11"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The appellate Court is untrammelled in its power to re-evaluate the evidence bearing in mind the seriousness of overthrowing an acquittal once recorded.",
      "addresses_issue": "i1",
      "key_observation": "No error of law in the High Court reconsidering the probative value of the oral and circumstantial evidence."
    },
    {
      "id": "cr2",
      "text": "The injuries on the persons of the three appellants and the fact that Siya Ram, appellant No. 2, had a gun in his hands at the time of the occurrence were sufficient, together with the other evidence, to hold the appellants guilty.",
      "addresses_issue": "i2",
      "key_observation": "Additional probative reinforcement for the three appellants."
    },
    {
      "id": "cr3",
      "text": "Neither mere possibilities nor remote probabilities nor mere doubts which are not reasonable can, without danger to the administration of justice, be the foundation of the acquittal of an accused person, if there is otherwise fairly credible testimony.",
      "addresses_issue": "i3",
      "key_observation": "Trial court's judgment verges on the perverse."
    },
    {
      "id": "cr4",
      "text": "The fact that a large number of accused have been acquitted and the remaining who have been convicted are less than five cannot vitiate the conviction under s. 149 read with the substantive offence if the Court has taken care to find there are other persons who might not have been identified or convicted but were party to the crime and together constituted the statutory number.",
      "addresses_issue": "i4",
      "key_observation": "Unlawful assembly can consist of less than five convicted persons and some unidentified persons."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The principle of law is well-settled that merely because a different view of the evidence is possible you cannot cancel a finding against guilt. But the appellate Court is untrammelled in its power to re-evaluate the evidence bearing in mind the seriousness of overthrowing an acquittal once recorded.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Conviction under s. 307 read with s. 149 IPC sustained even with less than five convicted, as unlawful assembly consisted of convicted persons and unidentified others.",
      "resolves_issue": "i4",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Sukh Ram v. State of U.P.",
      "citation": null,
      "treatment": "followed",
      "relevance": "The acquittal of two out of three named accused does not bar the conviction of the third under s. 302 read with s. 34, if he is shown to have committed the offence with unknown companions."
    },
    {
      "case_name": "Bharwad Mena Dana v. State of Bombay",
      "citation": "1962 2 SCR 172",
      "treatment": "followed",
      "relevance": "Nothing in law prevents the court from finding that the unlawful assembly consisted of less than five convicted persons and some unidentified persons together numbering more than five."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "s. 307",
        "s. 149",
        "s. 147",
        "s. 34"
      ],
      "relevance": "Conviction under s. 307 read with s. 149, and s. 147 IPC; s. 34 and s. 149 applied constructively even with acquittals."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal dismissed with modification of sentence to three years RI under s. 307 r/w s. 149 IPC and one year RI under s. 147 IPC, to run concurrently.",
    "relief_granted": "Sentence reduced considering circumstances including pendency and jail time.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The appellate Court is untrammelled in its power to re-evaluate the evidence bearing in mind the seriousness of overthrowing an acquittal once recorded.",
      "speaker": "court",
      "significance": "Defines scope of appellate power over acquittals."
    },
    {
      "text": "Neither mere possibilities nor remote probabilities nor mere doubts which are not reasonable can, without danger to the administration of justice, be the foundation of the acquittal of an accused person, if there is otherwise fairly credible testimony.",
      "speaker": "court",
      "significance": "Corrects trial court's error in applying benefit of doubt."
    }
  ],
  "_case_id": "1974_126",
  "_label": 0,
  "_text_length": 8074,
  "_extracted_at": "2026-02-10T20:04:05.990990"
}