{
  "metadata": {
    "case_name": "Goburdhan v. Bhagwat Prasad Choudhary",
    "case_year": 1967,
    "court": "Supreme Court of India",
    "judges": [
      "ALAGIRISWAMI, J."
    ],
    "case_number": "Civil Appeal No. 1871 of 1967",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Temple of Shree Maharaja Ram Janki Lacchuman Maharaj in village Mauza Deogan, State of Bihar.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Two brothers, Ram Adhikari Choudhary and Ram Lochan Choudhary, and Amir Prasad Choudhary (son of their brother, for himself and as guardian of Ramakant Prasad Choudhary), members of joint Hindu family, executed samarpannama on 17.6.1921 dedicating certain properties to the temple. Completely divested themselves of any interest except they and family members to be shebaits. Appointed five strangers as panches to oversee accounts yearly after death of executants, remove mismanaging shebait and appoint deserving from family.",
      "type": "material",
      "date": "1921-06-17",
      "source": "deed"
    },
    {
      "id": "f3",
      "text": "On 7-12-1928, Ram Adhikari Choudhary executed another samarpannama endowing further properties, similar terms, new set of five panches (one from earlier). Panches competent to dismiss failing shebait and appoint honest capable from family.",
      "type": "material",
      "date": "1928-12-07",
      "source": "deed"
    },
    {
      "id": "f4",
      "text": "On 14.7.1934, Ram Adhikari Choudhary executed ekrarnama: adopted Bhagwat Prasad Choudhary (present first respondent) as shebait and manager of all dedicated properties. Stipulations of 1928 samarpannama for accounts hold good. Succession: shebait appoints during lifetime or after him most capable son; if no male issue, from nephews etc., only from family.",
      "type": "material",
      "date": "1934-07-14",
      "source": "deed"
    },
    {
      "id": "f5",
      "text": "Subordinate Judge held 1921 document created trust in which public interested.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "Patna High Court judgment and decree dated 3rd May 1965 in Appeal from Original Decree No. 345 of 1960 reversed Subordinate Judge, held private endowment.",
      "type": "procedural",
      "date": "1965-05-03",
      "source": "high_court"
    },
    {
      "id": "f7",
      "text": "Temple situated within independent compound walls, though near house of founders.",
      "type": "background",
      "date": null,
      "source": "high_court"
    },
    {
      "id": "f8",
      "text": "Court over faqirs, sadhus and occasional festivals ancillary to puja of deity.",
      "type": "background",
      "date": null,
      "source": "high_court"
    },
    {
      "id": "f9",
      "text": "Panches had no opportunity to function; nothing indicates founder intended public association in management.",
      "type": "disputed",
      "date": null,
      "source": "high_court"
    },
    {
      "id": "f10",
      "text": "Members of public attend festivals like Ram Navami, Janmashtami.",
      "type": "background",
      "date": null,
      "source": "high_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the temple is a religious trust within the meaning of section 2, clause 1 of the Bihar Hindu Religious Trusts Act, or a private endowment.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The 1921 document created a trust in which the public were interested.",
      "supporting_facts": [
        "f2",
        "f3",
        "f4"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Temple within independent compound walls near founders' house not indicative of public purpose. Feeding faqirs etc. ancillary. Panchs had no opportunity to function, no intent for public association in management. Public festivals do not justify public benefit.",
      "supporting_facts": [
        "f7",
        "f8",
        "f9",
        "f10"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Executants completely divested themselves of title/interest; properties became deity's. Family only right to be shebaits/managers. Unnecessary to decide if later deeds changed 1921 provisions.",
      "addresses_issue": "i1",
      "key_observation": "Complete divestment key."
    },
    {
      "id": "cr2",
      "text": "Subordinate Judge influenced by misreading section 2(g)(i) as 'administration' instead of 'ministration'.",
      "addresses_issue": "i1",
      "key_observation": "Word is ministration."
    },
    {
      "id": "cr3",
      "text": "High Court erred: temple separate building factor for public (per Deoki Nandan). Panchs as outsiders with removal power over family shebait decisive: public associated with management, within section 2(g).",
      "addresses_issue": "i1",
      "key_observation": "Panchs control indicates public character."
    },
    {
      "id": "cr4",
      "text": "Public worship/user evidence of public dedication when endowment to idol itself. Distinguished Privy Council and Patna cases.",
      "addresses_issue": "i1",
      "key_observation": "User by public relevant here."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The trust is a religious trust as the public are interested in it under Bihar Hindu Religious Trusts Act.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Deoki Nandan v. Murlidhar",
      "citation": "1956 SCR 756",
      "treatment": "followed",
      "relevance": "Similar facts indicate public endowment: separate building, committee of outsiders managing."
    },
    {
      "case_name": "Delroos Banoo Begum v. Nawab Syud Ashgur Ally Khan",
      "citation": "1875 15 Bom LR 167",
      "treatment": "referred",
      "relevance": "Location of worship place (inside private house or public building) factor in public/private."
    },
    {
      "case_name": "Bhagwan Din v. Har Saroop",
      "citation": "AIR 1940 PC 7",
      "treatment": "distinguished",
      "relevance": "Public worship alone insufficient if initial grant to individual, not to idol."
    },
    {
      "case_name": "Ramsaran Das v. Jai Ram Das",
      "citation": "AIR 1943 Pat 135",
      "treatment": "distinguished",
      "relevance": "Provision for sadhus etc. not public if property to mahant personally."
    }
  ],
  "statutes_cited": [
    {
      "name": "Bihar Hindu Religious Trusts Act",
      "sections": [
        "Section 2 clause (1)",
        "Section 2(g)(i)"
      ],
      "relevance": "Defines religious trust where public interested in management or ministration."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed, judgment and decree of Patna High Court set aside, judgment of Subordinate Judge restored. Trust held public religious trust.",
    "relief_granted": "Restoration of Subordinate Judge's decree",
    "costs": "1st respondent to pay costs of appellant"
  },
  "key_quotes": [
    {
      "text": "the executants had completely divested themselves of any title to or interest in the dedicated properties which thereby became the properties of the deity.",
      "speaker": "court",
      "significance": "Core finding on dedication."
    },
    {
      "text": "as the only right which the family had was to have a member of the family as a manager or shebait and the shebait was subject to superintendence and control by a body of outsiders... it is decisive of the question as to the public character of the temple.",
      "speaker": "court",
      "significance": "Decisive factor for public trust."
    },
    {
      "text": "there could be no better indication of the fact that the members of the public were associated with the management of the temple and interest in its management was created in them, thus bringing the matter directly within clause (g) of section 2 of the Act.",
      "speaker": "court",
      "significance": "Links to statutory definition."
    }
  ],
  "_case_id": "1974_406",
  "_label": 1,
  "_text_length": 12410,
  "_extracted_at": "2026-02-10T20:06:48.915332"
}