{
  "metadata": {
    "case_name": "Writ Petition No. 305 of 1974",
    "case_year": 1974,
    "court": "Supreme Court of India",
    "judges": [
      "GOSWAMI J."
    ],
    "case_number": "Writ Petition No. 305 of 1974",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Petitioner detained under section 3 of the Maintenance of Internal Security Act, 1971 (the Act) by order of District Magistrate Nadia on 11-4-73 to prevent him from acting in a manner prejudicial to the maintenance of public order.",
      "type": "procedural",
      "date": "1973-04-11",
      "source": "detention_order"
    },
    {
      "id": "f2",
      "text": "On 16-2-73 between 10.08 hours and 10.14 hours, detenu along with associates armed with gun and other weapons committed dacoity in 3rd class compartment of running train S. 110 Dn. between Habibpur R.S. and Lakinarayanpur junction R.S. in Ranaghat Shantipur section, snatched away cash of Rs. 30,000 from Shri Ashutosh Pal of Calcutta causing bullet injuries to him and putting all passengers to fear of death. Action caused confusion, panic and disturbed public order.",
      "type": "material",
      "date": "1973-02-16",
      "source": "detention_order"
    },
    {
      "id": "f3",
      "text": "Detention order served upon detenu who made a representation which was considered by the Government and rejected.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "No illegality found in time schedule of various orders passed by different authorities.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "District Magistrate in affidavit (Paragraph 6) stated that he based his subjective satisfaction only on the ground mentioned in the detention order although other materials were placed before him.",
      "type": "background",
      "date": null,
      "source": "district_magistrate"
    },
    {
      "id": "f6",
      "text": "Court examined records of the case and history sheet of detenu; found that District Magistrate, having regard to the grave nature of the act committed by detenu, was bona fide satisfied that the said act was sufficient for making the detention order.",
      "type": "background",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the facts stated in the ground of detention need to be proved to the satisfaction of the Court before action can be taken under the Act.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether the alleged act affects public order or merely law and order.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Scope of the Court's inquiry in preventive detention cases.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Unless the facts stated in the ground are proved to the satisfaction of this Court, no action can be taken under the Act.",
      "supporting_facts": [
        "f2"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "This is at the worst a matter affecting law and order but not public order.",
      "supporting_facts": [
        "f2"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "District Magistrate based subjective satisfaction only on the ground mentioned, though other materials placed before him; grave nature justifies detention.",
      "supporting_facts": [
        "f2",
        "f5",
        "f6"
      ],
      "legal_basis": "Section 3, Maintenance of Internal Security Act, 1971"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "It is not the function of the Court to examine the truth or otherwise of the allegations mentioned in the grounds. The grounds are assumed by the Court to be true and the scope of inquiry in a case of this nature is very limited.",
      "addresses_issue": "i1",
      "key_observation": "Preventive detention justified even if facts hard to prove in court due to witness terror."
    },
    {
      "id": "cr2",
      "text": "When an armed robbery or dacoity like this is committed by the petitioner armed with guns with his associates similarly armed, in a running train, it no longer remains a matter of simple law and order as the peaceful tempo in life of the community at large is also affected thereby. It puts passengers of the entire train and even other trains in panic. Public order and life of the community is hereby clearly disturbed.",
      "addresses_issue": "i2",
      "key_observation": "Affects public order, likely to prevent traveling public from using trains."
    },
    {
      "id": "cr3",
      "text": "The ground would reasonably give rise to a bona fide satisfaction in the mind of the detaining authority that such incidents were likely to be repeated and those who took part had to be detained to prevent jeopardising peace in public life.",
      "addresses_issue": "i3",
      "key_observation": "No infirmity in the order."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Court does not examine truth of grounds in preventive detention; assumes true with limited inquiry.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Armed dacoity in running train disturbs public order, not merely law and order.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Detention order valid; no infirmity.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Subal Chandra Ghosh v. State of West Bengal",
      "citation": "AIR 1972 SC 2146",
      "treatment": "followed",
      "relevance": "Offence committed in daring manner in presence of passengers, panicky and disturbed public order."
    },
    {
      "case_name": "Arun Ghosh v. State of West Bengal",
      "citation": "1970 3 SCR 288",
      "treatment": "followed",
      "relevance": "Test for public order: degree and extent of reach upon society; disturbance of even tempo of community life."
    },
    {
      "case_name": "Ram Manohar Lohia",
      "citation": "1966 1 SCR 709",
      "treatment": "followed",
      "relevance": "Three concentric circles: law and order (largest), public order (middle), security of State (smallest)."
    }
  ],
  "statutes_cited": [
    {
      "name": "Maintenance of Internal Security Act, 1971",
      "sections": [
        "Section 3"
      ],
      "relevance": "Basis for detention order to prevent acting prejudicial to public order."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 32"
      ],
      "relevance": "Petition under Article 32 invoking original jurisdiction."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Court upheld the detention order under section 3 of the Maintenance of Internal Security Act, 1971, finding no infirmity; petition dismissed.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "It is not the function of the Court to examine the truth or otherwise of the allegations mentioned in the grounds. The grounds are assumed by the Court to be true and it is well settled that the scope of inquiry in a case of this nature is very limited.",
      "speaker": "court",
      "significance": "Defines limited scope of judicial review in preventive detention."
    },
    {
      "text": "When an armed robbery or dacoity like this is committed... in a running train, it no longer remains a matter of simple law and order as the peaceful tempo in life of the community at large is also affected thereby.",
      "speaker": "court",
      "significance": "Distinguishes public order from law and order."
    },
    {
      "text": "The test is: Does it lead to a disturbance of the even tempo and current of life of the community so as to amount to a disturbance of the public order, or, does it affect merely an individual without affecting the tranquility of society.",
      "speaker": "court",
      "significance": "Quote from Arun Ghosh defining public order test."
    }
  ],
  "_case_id": "1974_258",
  "_label": 0,
  "_text_length": 6470,
  "_extracted_at": "2026-02-10T20:05:24.503550"
}