{
  "metadata": {
    "case_name": "Private Bus Operators v. State Transport Undertaking of Uttar Pradesh",
    "case_year": 1974,
    "court": "Supreme Court of India",
    "judges": [
      "KRISHNA IYER, J."
    ],
    "case_number": "Civil Appeals Nos. 1119-1122 of 1973 and 816 to 835 of 1974",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "State Transport Undertaking of Uttar Pradesh contemplated framing four schemes for nationalisation of four inter-state routes, including Agra (U.P.) to Bharatpur (Rajasthan).",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Schemes published in Uttar Pradesh Gazette on December 9, 1961; copies sent to Rajasthan for pasting on notice boards of Transport Authorities there.",
      "type": "procedural",
      "date": "1961-12-09",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Schemes not published in Rajasthan Official Gazette.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Statutory enquiry under Chapter IVA followed; some operators (not appellants) raised objections; schemes approved with concurrence of State of Rajasthan.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Notices pasted on notice boards of State Transport Authority and Regional Transport Authority in Uttar Pradesh and Rajasthan as per Rule 4.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "Private operators, including appellants, aware of scheme details as they were plying buses on the route.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Allahabad High Court upheld schemes in Spl. Appeals Nos. 658 etc./1968 by judgment dated 9th December, 1971.",
      "type": "procedural",
      "date": "1971-12-09",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Earlier challenge on constitutional grounds rejected by Supreme Court in Khazan Singh v. State of U.P.",
      "type": "background",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether failure to publish the scheme in the Official Gazette of Rajasthan violates Section 68C of the Motor Vehicles Act, 1939 for an inter-State route.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether authorities in Uttar Pradesh could validly cancel permits held by bus operators of Rajasthan.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Scheme not published in Rajasthan Official Gazette, violating Section 68C which requires publication in Official Gazette and other manners directed by State Government.",
      "supporting_facts": [
        "f2",
        "f3"
      ],
      "legal_basis": "Section 68C, Motor Vehicles Act, 1939; Rule 4"
    },
    {
      "id": "pa2",
      "text": "Rules not complied with regarding publication and notice.",
      "supporting_facts": [
        "f3",
        "f5"
      ],
      "legal_basis": "Rule 4"
    },
    {
      "id": "pa3",
      "text": "Authorities in Uttar Pradesh could not validly cancel permits held by Rajasthan bus operators.",
      "supporting_facts": [
        "f1"
      ],
      "legal_basis": null
    },
    {
      "id": "pa4",
      "text": "Public bodies, passengers associations in Rajasthan denied opportunity for effective representation.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": "Sections 68C and 68D, Motor Vehicles Act, 1939"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Publication in U.P. Official Gazette complied with Sections 68C and 68D; notices pasted in both states per Rule 4; operators aware of scheme.",
      "supporting_facts": [
        "f2",
        "f5",
        "f6"
      ],
      "legal_basis": "Sections 68C, 68D; Rule 4"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Section 68C requires publication in the Official Gazette of the State whose Undertaking initiates the scheme; for inter-State routes initiated by U.P. Undertaking, U.P. Gazette publication suffices; singular does not imply plural.",
      "addresses_issue": "i1",
      "key_observation": "Expression 'the Official Gazette' refers to the concerned State's Gazette where the Undertaking is based."
    },
    {
      "id": "cr2",
      "text": "Rule 4 complied with as notices pasted on notice boards in both U.P. and Rajasthan; operators not in ignorance.",
      "addresses_issue": "i1",
      "key_observation": "High Court finding that Rule 4 complied with is categorical."
    },
    {
      "id": "cr3",
      "text": "U.P. authorities could cancel permits; High Court reasoning concurred with.",
      "addresses_issue": "i2",
      "key_observation": "Argument rejected for reasons stated by Division Bench."
    },
    {
      "id": "cr4",
      "text": "Desirable to publish inter-State schemes in all concerned States' Gazettes, but legislature to amend; not fatal flaw here.",
      "addresses_issue": "i1",
      "key_observation": "Wholesome intendment of ss.68C,68D fulfilled by existing steps."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Publication of inter-State nationalisation scheme in Official Gazette of initiating State (U.P.) complies with Section 68C.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "U.P. authorities can cancel permits of Rajasthan operators under the scheme.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Khazan Singh v. State of U.P.",
      "citation": "A.I.R. 1974 S.C. 669",
      "treatment": "followed",
      "relevance": "Rejected constitutional challenges to the same schemes; present appeals confined to statutory compliance."
    }
  ],
  "statutes_cited": [
    {
      "name": "Motor Vehicles Act, 1939",
      "sections": [
        "Section 68C",
        "Section 68D",
        "Chapter IVA"
      ],
      "relevance": "Governs framing, publication, objections, and approval of nationalisation schemes by State Transport Undertakings."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeals challenging validity of nationalisation schemes for inter-State routes on grounds of non-publication in Rajasthan Gazette and permit cancellation dismissed; schemes upheld as compliant with statutory requirements.",
    "relief_granted": null,
    "costs": "Dismissed with costs."
  },
  "key_quotes": [
    {
      "text": "\"The expression in the Official Gazette and the publication required therein, does not undergo a change in its semantics when the route concerned is an inter-State as against an intra-State one.\"",
      "speaker": "court",
      "significance": "Core holding on interpretation of Section 68C for inter-State schemes."
    },
    {
      "text": "\"It is a notorious fact that means of public transport in the country are grossly inadequate and energetic measures to overcome this handicap have to be undertaken if the nation is to progress.\"",
      "speaker": "court",
      "significance": "Critique of delays caused by litigation against public interest schemes."
    },
    {
      "text": "\"Something is rotten in the State of Denmark.\"",
      "speaker": "court",
      "significance": "Strong remark on administrative and legal delays in implementing nationalisation."
    }
  ],
  "_case_id": "1974_264",
  "_label": 0,
  "_text_length": 11665,
  "_extracted_at": "2026-02-10T20:05:25.367563"
}