{
  "metadata": {
    "case_name": "Assistant Station Master v. State",
    "case_year": 1971,
    "court": "Supreme Court of India",
    "judges": [
      "KRISHNA IYER, J."
    ],
    "case_number": "Criminal Appeal No. 15 of 1971",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The accused appellant was an Assistant Station Master at Ateli in May 1967.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "P.W. 3, a member of the Armed Forces, was going back home by train from Udaipur with his wife and child on railway concession pass, carrying with him a trunk and bedding.",
      "type": "background",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f3",
      "text": "When the train reached Ateli Railway station in the afternoon of May 9, 1967, P.W. 3 got down with his baggage and, when he handed over his ticket to the accused, was told that he had to pay extra for his wife and child and excess luggage--a sum around Rs. 45 or more.",
      "type": "material",
      "date": "1967-05-09",
      "source": "prosecution"
    },
    {
      "id": "f4",
      "text": "P.W. 3 pleaded that he had no money on him then and was suggested a way out by the payment of Rs. 10 at once (a bribe) and a bargain. Promising to bring the money the next day, P.W. 3 left the station leaving his bedding as something of a non-human hostage which was to be released on the payment of the illicit sum.",
      "type": "material",
      "date": "1967-05-09",
      "source": "prosecution"
    },
    {
      "id": "f5",
      "text": "On reaching his village late in the night, P.W. 3 thought of informing the authorities about this harassment. Accordingly, he contacted the Deputy Commissioner, Narnaul, on May 11 and related to him what had happened.",
      "type": "procedural",
      "date": "1967-05-11",
      "source": "prosecution"
    },
    {
      "id": "f6",
      "text": "The Deputy Commissioner instructed the Superintendent of Police to look into the matter who directed the Deputy Superintendent of Police, Narnaul, to take suitable action. He also sent a telephonic message to Shri Dharamvir, Sub Divisional Magistrate, Narnaul.",
      "type": "procedural",
      "date": "1967-05-11",
      "source": "prosecution"
    },
    {
      "id": "f7",
      "text": "The Sub Divisional Magistrate, P.W. 5, together with the Deputy Superintendent of Police, decided to organise a trap, on being apprised of the story by P.W. 3. The team consisted of the Deputy Superintendent, the Sub Divisional Magistrate, a head constable of the railway police, and P.W. 3 himself. P.W. 4, Lakshmi Narain, also joined them on the way.",
      "type": "procedural",
      "date": "1967-05-11",
      "source": "prosecution"
    },
    {
      "id": "f8",
      "text": "A ten-rupee note, Ex. P1, was handed over by P.W.3 to the Sub Divisional Magistrate, who signed on it, in token whereof a memo was prepared, Ex. PF. P.W. 3 took back the note, his body was searched as part of the usual precaution and he was directed to go to the accused and give signal after the money was paid.",
      "type": "procedural",
      "date": "1967-05-11",
      "source": "prosecution"
    },
    {
      "id": "f9",
      "text": "As arranged, P.W. 3 met the accused, made over the money, gave a signal whereupon the party of the Sub Divisional Magistrate closed in on the accused. The marked note was recovered from his right hand vide memo. Ex. PG.",
      "type": "material",
      "date": "1967-05-11",
      "source": "prosecution"
    },
    {
      "id": "f10",
      "text": "Thereafter, the Sub Divisional Magistrate lodged a First Information Report with the police, a case was registered and on completion of investigation by the Deputy Superintendent of Police having jurisdiction over the Railways, P.W. 7, and after obtaining the statutory sanction, Ex. PD/1, the accused was charged with an offence of having accepted illegal gratification of Rs. 10 on May 11, 1967 from P.W. 3 thereby committing criminal misconduct in the discharge of his duties, punishable under s. 5(2) of the Prevention of Corruption Act, 1947.",
      "type": "procedural",
      "date": "1967-05-11",
      "source": "prosecution"
    },
    {
      "id": "f11",
      "text": "The Special Judge convicted the accused, overruling the defence version set up under s. 342, Cr. P.C., and disbelieving the defence witnesses. The High Court confirmed the conviction. The sentence of one year rigorous imprisonment and a fine of Rs. 200 was also confirmed.",
      "type": "procedural",
      "date": "1970-05-15",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "P.W. 2, a Divisional Officer Senior Scale, who granted the sanction, sworn that by virtue of delegated powers he was competent to remove an Assistant Station Master like the accused.",
      "type": "admitted",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f13",
      "text": "The accused's defence: The Jawan was stopped by the attender or water carrier of the station at the gate for insufficient tickets and excess baggage but, after some sound and fury over an interpolation in the military pass, was allowed to go by the accused who promptly reported to the Jaipur Station Master. The bedding was left behind by P.W. 3 and kept in the lost property room.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the prosecution is invalid for want of competent sanction",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether the investigation is merely illegal but has in consequence inflicted serious prejudice on the accused",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether the non-examination of key witnesses, like the Deputy Superintendent of Police, should have driven the court to draw an adverse inference fatal to the case, and the uncorroborated testimony of accomplices or quasi-accomplices should not have been the foundation for a conviction",
      "framed_by": "petitioner"
    },
    {
      "id": "i4",
      "text": "Whether the Court had drawn a presumption under S. 4 of the Prevention of Corruption Act, although there was no warrant for it in the present case, the charge having been one under s. 5(1)(d), read with s. 5(2) of the said Act",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "P.W. 2, who granted the sanction, did not and, under the rules, could not appoint or dismiss the accused.",
      "supporting_facts": [
        "f12"
      ],
      "legal_basis": "Indian Railway Establishment Code r. 134, r. 3(a)"
    },
    {
      "id": "pa2",
      "text": "The investigation is grossly illegal: Deputy Commissioner did not record statement of P.W. 3; SP or DSP did not register case; subversion of s. 5A PCA by employing magistrate to lay trap.",
      "supporting_facts": [
        "f5",
        "f6",
        "f7"
      ],
      "legal_basis": "s. 5A Prevention of Corruption Act, 1947"
    },
    {
      "id": "pa3",
      "text": "Non-examination of key witnesses like DSP; uncorroborated testimony of accomplices or quasi-accomplices (trap witnesses, magistrate) cannot sustain conviction; traps immoral.",
      "supporting_facts": [
        "f7",
        "f8",
        "f9"
      ],
      "legal_basis": null
    },
    {
      "id": "pa4",
      "text": "Presumption under S. 4 PCA unavailable as charge under s. 5(1)(d) r/w s. 5(2).",
      "supporting_facts": [
        "f10"
      ],
      "legal_basis": "s. 4 Prevention of Corruption Act, 1947"
    },
    {
      "id": "pa5",
      "text": "P.W. 1 illegally treated as hostile.",
      "supporting_facts": [
        "f13"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "P.W. 3 may well have complained of harassment and authorities directed action appropriately; no violation of s. 5A as investigation by competent DSP after trap; trap by magistrate not investigation.",
      "supporting_facts": [
        "f5",
        "f6",
        "f7",
        "f9",
        "f10"
      ],
      "legal_basis": "s. 5A Prevention of Corruption Act; s. 4(1) Cr.P.C."
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Sanction valid: P.W. 2 competent under delegated powers per Indian Railway Establishment Code r. 134; accused Class III servant up to Rs. 250 pay; power to appoint includes dismiss; point not raised below.",
      "addresses_issue": "i1",
      "key_observation": "Power to appoint carries power to dismiss; no delegation issue proven."
    },
    {
      "id": "cr2",
      "text": "Investigation not illegal: No police below DSP rank investigated; trap by magistrate not 'investigation'; s. 5A not violated; no prejudice.",
      "addresses_issue": "i2",
      "key_observation": "Magistrate laying trap de hors s. 5A; investigation commenced post-FIR by PW7."
    },
    {
      "id": "cr3",
      "text": "Trap witnesses (magistrate PW5, PW4) credible; recovery of marked note from accused's right hand; bedding presence corroborates PW3; defence version rejected; PW1 disbelieved as partisan.",
      "addresses_issue": "i3",
      "key_observation": "Marked note recovery and circumstances res ipsa loquitur; no adverse inference needed."
    },
    {
      "id": "cr4",
      "text": "Even without s.4 presumption, facts warrant inference of guilt; charge under s.5(1)(d)/5(2) but circumstances prove bribery.",
      "addresses_issue": "i4",
      "key_observation": "Res ipsa loquitur from marked note in hand post-detaining bedding."
    },
    {
      "id": "cr5",
      "text": "Treating PW1 hostile discretionary to further truth.",
      "addresses_issue": "i3",
      "key_observation": "No merit."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Sanction competent and valid.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "No illegality in investigation or prejudice to accused.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Evidence sufficient beyond reasonable doubt; trap testimony reliable with corroboration from recovery.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    },
    {
      "id": "h4",
      "text": "Presumption not needed; facts prove guilt.",
      "resolves_issue": "i4",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Vinayak V. Joshi v. State",
      "citation": "A.I.R. 1968 Pun. 120",
      "treatment": "distinguished",
      "relevance": "Divisional Medical Officer lacked delegation unlike here."
    },
    {
      "case_name": "Sudarshanlal Bajaj v. S. P. Agarwala",
      "citation": "A.I.R. 1966 Raj. 37",
      "treatment": "distinguished",
      "relevance": "No application."
    },
    {
      "case_name": "Hira Lal",
      "citation": "1970 3 S.C.C. 933",
      "treatment": "distinguished",
      "relevance": "Does not rescue accused on trap as investigation step."
    },
    {
      "case_name": "State of Bihar v. Basawan Singh",
      "citation": "1959 S.C.R. 195",
      "treatment": "followed",
      "relevance": "Flexible approach to trap witnesses; upholds public officers in traps."
    },
    {
      "case_name": "Rishbud and Inder Singh v. State of Delhi",
      "citation": "1955 1 S.C.R. 1150",
      "relevance": "No violation of law or prejudice made out."
    },
    {
      "case_name": "Rao Shiv Bahadur Singh v. State of Vindhya Pradesh",
      "citation": "1954 S.C.R. 1096",
      "treatment": "referred",
      "relevance": "Censure of judicial officers in traps but not ban on executive magistrates."
    }
  ],
  "statutes_cited": [
    {
      "name": "Prevention of Corruption Act, 1947",
      "sections": [
        "s. 4",
        "s. 5(1)(d)",
        "s. 5(2)",
        "s. 5A"
      ],
      "relevance": "Charge under s.5(1)(d) r/w s.5(2); s.5A on investigation rank; s.4 presumption not applied but facts suffice."
    },
    {
      "name": "Code of Criminal Procedure, 1898",
      "sections": [
        "s. 342",
        "s. 4(1)"
      ],
      "relevance": "Defence under s.342; investigation defined."
    },
    {
      "name": "Indian Railway Establishment Code",
      "sections": [
        "r. 134",
        "r. 3(a)"
      ],
      "relevance": "Delegation of appointment/dismissal powers to Divisional Officers Senior Scale."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court dismissed the appeal by special leave, upholding the concurrent conviction and sentence of one year rigorous imprisonment and fine of Rs. 200 by Special Judge and Punjab & Haryana High Court for offence under s.5(1)(d) r/w s.5(2) Prevention of Corruption Act.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "That an Assistant Station Master like the accused has in his hand a marked currency note made over to him by a passenger whose bedding has been detained by him for which no credible explanation is forthcoming, and he is caught red-handed with the note, is a case of res ipsa loquitur.",
      "speaker": "court",
      "significance": "Crux of reasoning on proof of guilt without presumption."
    },
    {
      "text": "In the current crisis of rampant corruption polluting the public services... the need for superior officers vigilantly organising Operation Anti-Corruption cannot be discouraged by legalisms.",
      "speaker": "court",
      "significance": "Justifies traps by public officers."
    }
  ],
  "_case_id": "1974_78",
  "_label": 0,
  "_text_length": 22672,
  "_extracted_at": "2026-02-10T20:03:23.264577"
}