{
  "metadata": {
    "case_name": "Directors of Rajnagar Spinning and Weaving Manufacturing Co. Ltd. & Anr. v. Inspector under Employees Provident Funds Act",
    "case_year": 1973,
    "court": "Supreme Court of India",
    "judges": [
      "CHANDRACHUD, J."
    ],
    "case_number": "Criminal Appeal No. 57 of 1973",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellants 1, 2, 4, 5 and 6 are the directors of Rajnagar Spinning and Weaving Manufacturing Co. Ltd., Ahmedabad, and appellant No. 3 is an officer of the said company.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On March 19, 1969 a complaint was lodged against them by respondent 1, an Inspector appointed under the Employees Provident Funds Act, 1952 that they had failed to pay a sum of Rs. 1,39,419.50 being the contribution to the Provident Fund for the months of June, July and August 1968 and that thereby they had contravened the provisions of Paragraph 38(1) of the Employees Provident Funds Scheme, 1952, an act punishable under Paragraph 76(a) of the Scheme.",
      "type": "material",
      "date": "1969-03-19",
      "source": "prosecution"
    },
    {
      "id": "f3",
      "text": "An investigation was made into the affairs of the company under section 15 of the Industries Development and Regulation Act, 1951 and on being satisfied that the company was managed in a manner highly detrimental to public interest, the Government of India issued an order dated January 7, 1972 authorising the Gujarat State Textile Corporation to take over the management of the company.",
      "type": "background",
      "date": "1972-01-07",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On May 6, 1972 the Gujarat Government issued a notification declaring the company to be a relief undertaking under section 4(1)(a)(iv) of the Bombay Relief Undertakings Special Provisions Act, 1958 (the Act), and directing that all rights, privileges, obligations and liabilities accrued or incurred before the undertaking was declared a relief undertaking and any remedy for the enforcement thereof shall be suspended and all the proceedings relative thereto pending before any Court, tribunal, officer or authority shall be stayed with effect from 6th May 1972.",
      "type": "material",
      "date": "1972-05-06",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The appellants filed one application after another asking the court which was seized of the matter to stay the prosecution in view of the notification issued by the Government of Gujarat.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "Two of such applications were rejected by the learned City Magistrate, III Court, Ahmedabad. Appellants acquiesced in one of the orders, carried the other in revision to the High Court but withdrew that proceeding.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "On October 27, 1972 they made yet another application for the same relief which also was rejected by the learned Magistrate. He took the view that the operation of section 4 of the Act is restricted to the statutes mentioned in the Schedule to that Act and that clause (iv) of section 4(1) did not contemplate stay of criminal proceedings.",
      "type": "procedural",
      "date": "1972-10-27",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "The High Court of Gujarat rejected summarily the revision application filed by the appellants against the judgment of the learned Magistrate on 9th February 1973.",
      "type": "procedural",
      "date": "1973-02-09",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Appeal by special leave to Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the prosecution pending against the appellants under Paragraph 76(a) of the Employees Provident Funds Scheme, 1952 is liable to be stayed by virtue of the notification issued by the Government of Gujarat on May 6, 1972 under section 4(1)(a)(iv) of the Bombay Relief Undertakings Special Provisions Act, 1958.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The prosecution should be stayed in view of the notification issued by the Government of Gujarat under section 4(1)(a)(iv) of the Bombay Relief Undertakings Special Provisions Act, 1958 declaring the company a relief undertaking.",
      "supporting_facts": [
        "f4",
        "f5",
        "f6",
        "f7"
      ],
      "legal_basis": "Section 4(1)(a)(iv) of the Bombay Relief Undertakings Special Provisions Act, 1958"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The operation of section 4 of the Act is restricted to the statutes mentioned in the Schedule to that Act and that clause (iv) of section 4(1) did not contemplate stay of criminal proceedings.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "Section 4 of the Bombay Relief Undertakings Special Provisions Act, 1958"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "All proceedings relative thereto patently means all proceedings relating to any right, privilege, obligation or liability accrued or incurred before the undertaking was declared a relief undertaking. The obligation or liability which sub-clause (iv) speaks of is an obligation or liability incurred by the undertaking before it was declared a relief undertaking.",
      "addresses_issue": "i1",
      "key_observation": "Sub-clause (iv) concerns itself with the pre-existing obligations and liabilities of the undertaking and number of its directors managers or other officers."
    },
    {
      "id": "cr2",
      "text": "Obligations and liabilities of the directors or other officers of the undertaking are not in a true sense obligations and liabilities in relation to the relief undertaking. In plain and simple language they are, the obligations and liabilities of such persons themselves.",
      "addresses_issue": "i1",
      "key_observation": "Their obligations and liabilities have to be viewed from a different angle than the obligations and liabilities of the company itself which only acts impersonally."
    },
    {
      "id": "cr3",
      "text": "The object of section 4(1)(a)(iv) is to declare, so to say, a moratorium on actions against the undertaking during the currency of the notification declaring it to be a relief undertaking.",
      "addresses_issue": "i1",
      "key_observation": "These provisions are aimed at resurrecting and rehabilitating industrial undertakings brought by inefficiency or mismanagement to the brink of dissolution."
    },
    {
      "id": "cr4",
      "text": "Neither the language of the statute nor its object would justify the extension of the immunity so as to cover the individual obligations and liabilities of the director and other officers of the undertaking.",
      "addresses_issue": "i1",
      "key_observation": "If they have incurred such obligations or liabilities, as distinct from the obligations or liabilities of the undertaking, they are liable to be proceeded against for their personal acts of commission and omission."
    },
    {
      "id": "cr5",
      "text": "Paragraph 38(1) of the Employees Provident Funds Scheme, 1952 imposes an obligation on the employer to pay the Provident Fund contribution to the Fund within 15 days of the close of every month. Section 2(e)(ii) of the Act defines Employer as the person who has the ultimate control over the affairs of an establishment.",
      "addresses_issue": "i1",
      "key_observation": "The responsibility to pay the contributions to the Fund was of the appellants and if they have defaulted in paying the amount, they are liable to be prosecuted under Paragraph 76(a) of the Scheme."
    },
    {
      "id": "cr6",
      "text": "Such a personal liability does not fall within the scope of section 4(1)(a)(iv) of the Act.",
      "addresses_issue": "i1",
      "key_observation": "To declare a moratorium on legal actions against persons whose activities have necessitated the issuance of a notification in the interest of unemployment relief is to give to such persons the benefit of their own wrong."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The prosecution pending against the appellants under Paragraph 76(a) of the Employees Provident Funds Scheme, 1952 is not liable to be stayed by virtue of the notification issued under section 4(1)(a)(iv) of the Bombay Relief Undertakings Special Provisions Act, 1958 as it pertains to personal liabilities of directors and officers, not liabilities of the undertaking itself.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Employees Provident Funds Act, 1952",
      "sections": [
        "Section 2(e)(ii)"
      ],
      "relevance": "Defines 'Employer' as the person with ultimate control over the affairs of the establishment, including directors and officers."
    },
    {
      "name": "Employees Provident Funds Scheme, 1952",
      "sections": [
        "Paragraph 38(1)",
        "Paragraph 76(a)",
        "Paragraph 2(m)"
      ],
      "relevance": "Imposes obligation on employer to pay provident fund contributions within 15 days; failure punishable with imprisonment or fine; refers to definitions in the Act."
    },
    {
      "name": "Industries (Development and Regulation) Act, 1951",
      "sections": [
        "Section 15"
      ],
      "relevance": "Basis for investigation into company affairs leading to takeover of management."
    },
    {
      "name": "Bombay Relief Undertakings (Special Provisions) Act, 1958",
      "sections": [
        "Section 4(1)(a)(iv)",
        "Section 4(b)",
        "Section 3",
        "Section 2(g)"
      ],
      "relevance": "Empowers declaration of relief undertaking, suspension of pre-existing obligations/liabilities/remedies of the undertaking, and stay of proceedings; does not extend to personal liabilities of directors/officers."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal is dismissed. The prosecution against the appellants shall proceed expeditiously.",
    "relief_granted": "None",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "Obligations and liabilities of the directors or other officers of the undertaking are not in a true sense obligations and liabilities in relation to the relief undertaking.",
      "speaker": "court",
      "significance": "Distinguishes personal liabilities from undertaking's liabilities."
    },
    {
      "text": "To declare a moratorium on legal actions against persons whose activities have necessitated the issuance of a notification in the interest of unemployment relief is to give to such persons the benefit of their own wrong.",
      "speaker": "court",
      "significance": "Explains policy reason against extending immunity to directors."
    },
    {
      "text": "Such a personal liability does not fall within the scope of section 4(1)(a)(iv) of the Act.",
      "speaker": "court",
      "significance": "Direct holding on applicability to provident fund default prosecution."
    }
  ],
  "_case_id": "1974_11",
  "_label": 0,
  "_text_length": 9737,
  "_extracted_at": "2026-02-10T20:03:12.036415"
}