{
  "metadata": {
    "case_name": "Balak Ram & Ors. v. State of U.P.",
    "case_year": 1973,
    "court": "Supreme Court of India",
    "judges": [
      "CHANDRACHUD, J."
    ],
    "case_number": "Criminal Appeal Nos. 72, 25, 34-35 of 1973",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "On May 27, 1971, Tribeni Sahai and Radhey were shot dead in Dataganj, District Budaun.",
      "type": "material",
      "date": "1971-05-27",
      "source": "prosecution"
    },
    {
      "id": "f2",
      "text": "Balak Ram convicted under section 302 IPC by Sessions Judge Budaun and sentenced to death; also convicted under 337/149 and 148 IPC.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f3",
      "text": "Sessions Judge acquitted Nathoo, Dr. R.P. Kohli, Mohd. Sayeed Khan Banney Khan, Kailash, and Ahmed Sayeed Khan alias Pearey Mian.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f4",
      "text": "Allahabad High Court confirmed Balak Ram's conviction under 302 and 148 IPC, altered 337/149 to 307/149; convicted Nathoo, Dr. Kohli, Banney Khan under 302/149, 307/149, and 148 or 147 IPC, sentenced to life imprisonment.",
      "type": "procedural",
      "date": "1972-12-22",
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "Incident arose out of political rivalry between Congress R, Congress O, and Bharatiya Jan Sangh; Tribeni Sahai was Congress R MLA, Radhey his bodyguard; Balak Ram, Nathoo, Banney Khan Congress O; Dr. Kohli Jan Sangh President.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Elections to Town Area Committee Dataganj scheduled May 30, 1971; Balak Ram contesting Chairmanship on Congress O ticket vs. Dharam Pal (Congress R); Nathoo, Banney Khan contesting membership on Congress O.",
      "type": "background",
      "date": "1971-05-30",
      "source": "prosecution"
    },
    {
      "id": "f7",
      "text": "District Magistrate promulgated section 144 CrPC order on May 24, 1971 prohibiting assembly of more than five and carrying arms.",
      "type": "background",
      "date": "1971-05-24",
      "source": "prosecution"
    },
    {
      "id": "f8",
      "text": "Balak Ram led procession of 25 persons at 6.30 pm on May 27, 1971 defying section 144; clashed with Dharam Pal's group but dispersed by SHO Yogendra Sharma.",
      "type": "material",
      "date": "1971-05-27",
      "source": "prosecution"
    },
    {
      "id": "f9",
      "text": "At 9.15 pm on May 27, six accused with 15-20 followers canvassed; went to lane near Tribeni Sahai's house; raised offensive slogans; Tribeni protested; Dr. Kohli, Banney Khan, Pearey Mian exhorted Balak Ram to fire; Balak Ram fired pistol hitting Tribeni Sahai on right scapular region.",
      "type": "material",
      "date": "1971-05-27",
      "source": "prosecution"
    },
    {
      "id": "f10",
      "text": "Radhey ran to protect Tribeni; Balak Ram, Nathoo, Dr. Kohli fired 4-5 shots; Radhey hit on left back; Jhilmili and Ram Prakash injured on thigh and abdomen respectively.",
      "type": "material",
      "date": "1971-05-27",
      "source": "prosecution"
    },
    {
      "id": "f11",
      "text": "Rajendra Kumar Misra (brother-in-law of Tribeni's brother Radhey Shyam Sharma, DIG) lodged FIR at 9.45 pm at police station 2 furlongs away.",
      "type": "procedural",
      "date": "1971-05-27",
      "source": "prosecution"
    },
    {
      "id": "f12",
      "text": "Tribeni Sahai made dying declaration to Dharam Pal naming Balak Ram instigated by Banney Khan, Pearey Mian, Dr. Kohli.",
      "type": "disputed",
      "date": "1971-05-27",
      "source": "prosecution"
    },
    {
      "id": "f13",
      "text": "SHO Yogendra Sharma recorded second dying declaration from Tribeni in car; tried to interrogate Radhey but unconscious.",
      "type": "disputed",
      "date": "1971-05-27",
      "source": "prosecution"
    },
    {
      "id": "f14",
      "text": "Victims taken to Budaun Civil Hospital arriving 11.30 pm; Radhey declared dead; SDM Sada Ram recorded third dying declaration from Tribeni at 11.50 pm.",
      "type": "procedural",
      "date": "1971-05-27",
      "source": "prosecution"
    },
    {
      "id": "f15",
      "text": "Tribeni died at 8.30 pm on May 28 at Mission Hospital Bareilly.",
      "type": "material",
      "date": "1971-05-28",
      "source": "prosecution"
    },
    {
      "id": "f16",
      "text": "Postmortem on Radhey by Dr. A. Gupta on May 28: lacerated wound left axillary, bullet recovered.",
      "type": "material",
      "date": "1971-05-28",
      "source": "prosecution"
    },
    {
      "id": "f17",
      "text": "Postmortem on Tribeni by Dr. S. Mitra on May 29: gunshot wound right scapular.",
      "type": "material",
      "date": "1971-05-29",
      "source": "prosecution"
    },
    {
      "id": "f18",
      "text": "Jhilmili and Ram Prakash injuries examined by Dr. R.C. Bansal on May 28: thigh entry/exit, abdominal burn.",
      "type": "material",
      "date": "1971-05-28",
      "source": "prosecution"
    },
    {
      "id": "f19",
      "text": "Dr. Kohli arrested 2.30 am May 28; revolver from wife, loaded, smelled freshly fired.",
      "type": "procedural",
      "date": "1971-05-28",
      "source": "prosecution"
    },
    {
      "id": "f20",
      "text": "Banney Khan arrested 5 am May 28; Balak Ram, Nathoo, Pearey Mian surrendered May 29, June 7, June 11.",
      "type": "procedural",
      "date": "1971-05-28",
      "source": "prosecution"
    },
    {
      "id": "f21",
      "text": "Balak Ram's pistol surrendered by father June 1.",
      "type": "procedural",
      "date": "1971-06-01",
      "source": "prosecution"
    },
    {
      "id": "f22",
      "text": "Ballistic expert Shyam Narain: bullet from Radhey's body fired from Balak Ram's pistol; scene bullet from other weapon.",
      "type": "material",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f23",
      "text": "Appellants denied presence, knowledge of s.144; pleaded false implication due to political rivalry; Balak Ram, Nathoo alibi.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f24",
      "text": "Dr. Kohli claimed taken to PS at 10.30 pm May 27, revolver taken from house later.",
      "type": "disputed",
      "date": "1971-05-27",
      "source": "petitioner"
    },
    {
      "id": "f25",
      "text": "Civil suit by Banney Khan, Pearey Mian vs Tribeni pending since 1965.",
      "type": "background",
      "date": "1965",
      "source": "court"
    },
    {
      "id": "f26",
      "text": "Various prior criminal cases between parties: 307 IPC against Banney/Pearey, 120B by Tribeni, etc.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f27",
      "text": "Eyewitnesses: Jhilmili (PW1), Ram Prakash (PW11), Rajendra Kumar Misra (PW13), Aryendra Nath (PW19).",
      "type": "material",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f28",
      "text": "FIR by Rajendra does not mention Jhilmili, Ram Prakash.",
      "type": "disputed",
      "source": "court"
    },
    {
      "id": "f29",
      "text": "Jhilmili's relatives contested on Congress O; son got PAC job post-incident; bank deposit discrepancies.",
      "type": "disputed",
      "source": "court"
    },
    {
      "id": "f30",
      "text": "Ram Prakash's father prosecuted by Tribeni for conspiracy.",
      "type": "background",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the High Court was justified in upholding the conviction of Balak Ram under section 302 IPC and the sentence of death.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the High Court had good and sufficient reasons for interfering with the Sessions Court's order of acquittal in favour of Nathoo, Dr. R.P. Kohli and Banney Khan.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Falsely implicated due to political rivalry; witnesses friends/relatives of Tribeni or pressured by police at instance of DIG Radhey Shyam.",
      "supporting_facts": [
        "f5",
        "f23",
        "f24"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Balak Ram alibi: at Lucknow from May 25.",
      "supporting_facts": [
        "f23"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Nathoo alibi: went to Chandausi morning May 27, returned May 29; feared shooting order by DIG.",
      "supporting_facts": [
        "f23"
      ],
      "legal_basis": null
    },
    {
      "id": "pa4",
      "text": "Dr. Kohli: detained at PS 10.30 pm May 27, revolver taken later; no personal enmity.",
      "supporting_facts": [
        "f19",
        "f24"
      ],
      "legal_basis": null
    },
    {
      "id": "pa5",
      "text": "Banney Khan implicated due to personal enmity, pending civil suit.",
      "supporting_facts": [
        "f25"
      ],
      "legal_basis": null
    },
    {
      "id": "pa6",
      "text": "Dying declarations fabricated; eyewitnesses unreliable, mutual corroboration invalid; ballistic evidence infirm.",
      "supporting_facts": [
        "f12",
        "f13",
        "f14",
        "f27",
        "f28"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Prosecution case: accused in procession raised slogans, exhorted Balak Ram to fire; fired shots killing Tribeni and Radhey, injuring Jhilmili and Ram Prakash; corroborated by eyewitnesses, dying declarations, ballistic evidence.",
      "supporting_facts": [
        "f9",
        "f10",
        "f11",
        "f12",
        "f13",
        "f14",
        "f22",
        "f27"
      ],
      "legal_basis": "Sections 302, 307/149, 148, 147 IPC"
    },
    {
      "id": "ra2",
      "text": "FIR prompt; eyewitnesses independent; dying declarations voluntary and consistent.",
      "supporting_facts": [
        "f11",
        "f27"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Eyewitnesses (Jhilmili, Ram Prakash, Rajendra, Aryendra) not independent, infirmities: omissions in FIR, political links, unnatural conduct, prior enmities; cannot corroborate each other.",
      "addresses_issue": "i2",
      "key_observation": "Two reasonable views possible; Sessions acquittal reasonable, High Court should not interfere."
    },
    {
      "id": "cr2",
      "text": "Dying declarations unreliable: first not mentioned by eyewitnesses, second to IO unsafe, third when victim in shock, influenced by friends; no independent corroboration.",
      "addresses_issue": "i2",
      "key_observation": "Not safe to act on uncorroborated dying declarations."
    },
    {
      "id": "cr3",
      "text": "No ballistic link to Dr. Kohli's revolver or Nathoo; Nathoo's name scored off dying declaration; Banney Khan old, only exhortation evidence weak.",
      "addresses_issue": "i2",
      "key_observation": "Acquit Nathoo, Dr. Kohli, Banney Khan."
    },
    {
      "id": "cr4",
      "text": "Concurrent findings against Balak Ram; ballistic expert confirms bullet from his pistol killed Radhey; eyewitnesses natural on his role; alibi weak.",
      "addresses_issue": "i1",
      "key_observation": "No reason to interfere with concurrent conviction under 302 IPC."
    },
    {
      "id": "cr5",
      "text": "No provocation; Balak Ram fired pistol at unarmed victims after vulgar slogans protest.",
      "addresses_issue": "i1",
      "key_observation": "Death sentence justified."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "High Court erred in reversing Sessions acquittal of Nathoo, Dr. Kohli, Banney Khan as two views possible; acquittal restored.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Concurrent conviction of Balak Ram under section 302 IPC upheld; death sentence confirmed.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Ramabhupala Reddy v. State of Andhra Pradesh",
      "citation": "AIR 1971 SC 460",
      "treatment": "followed",
      "relevance": "Supreme Court does not re-appraise concurrent findings of fact unless exceptional circumstances."
    },
    {
      "case_name": "Ram Jag v. State of U.P.",
      "citation": "1974 4 SCC 201",
      "treatment": "followed",
      "relevance": "High Court interferes with acquittal only if fails to apply correct principles; if two views possible, no interference."
    },
    {
      "case_name": "Bhupendra Singh v. State of Punjab",
      "citation": "1968 3 SCR 404",
      "treatment": "referred",
      "relevance": "In death sentence reference, High Court must examine entire evidence independently."
    },
    {
      "case_name": "Jamman v. State of Punjab",
      "citation": null,
      "treatment": "referred",
      "relevance": "High Court must consider defence evidence in confirmation of death sentence."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Penal Code, 1860",
      "sections": [
        "302",
        "307",
        "149",
        "148",
        "147",
        "337",
        "120B"
      ],
      "relevance": "Convictions for murder, attempt to murder, rioting with deadly weapons, causing hurt by rash act in unlawful assembly."
    },
    {
      "name": "Code of Criminal Procedure, 1898",
      "sections": [
        "144",
        "164",
        "374"
      ],
      "relevance": "Prohibitory order, recording statements, reference for death sentence confirmation."
    },
    {
      "name": "U.P. Police Regulations",
      "sections": [
        "115"
      ],
      "relevance": "Dying declaration to be recorded in presence of two witnesses with declarant's signature."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "136"
      ],
      "relevance": "Special leave appeals; limited interference in criminal matters."
    }
  ],
  "outcome": {
    "disposition": "partially_accepted",
    "summary": "Appeals of Nathoo, Dr. R.P. Kohli and Mohd. Sayeed Khan Banney Khan allowed; High Court convictions set aside, Sessions acquittal restored, to be released forthwith. Balak Ram's appeal dismissed; conviction and death sentence upheld.",
    "relief_granted": "Acquittal and release for three appellants; no relief for Balak Ram.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "This Court would not therefore re-appraise the evidence unless... substantial and grave injustice has otherwise resulted.",
      "speaker": "court",
      "significance": "Limits SC interference with concurrent findings."
    },
    {
      "text": "If two views of the evidence are reasonably possible the High Court ought not to interfere with the order of acquittal passed by the trial court.",
      "speaker": "court",
      "significance": "Principle for appeals against acquittal."
    },
    {
      "text": "Corroboration in such cases must be forthcoming from an independent source.",
      "speaker": "court",
      "significance": "Eyewitnesses cannot corroborate each other due to infirmities."
    },
    {
      "text": "Balak Ram was carrying a pistol and he fired from that pistol without any provocation either from Tribeni Sahai or from Radhey.",
      "speaker": "court",
      "significance": "Justifies death sentence."
    }
  ],
  "_case_id": "1974_191",
  "_label": 0,
  "_text_length": 54636,
  "_extracted_at": "2026-02-10T20:05:04.687228"
}