{
  "metadata": {
    "case_name": "Satya Deo Prasad Gupta v. State of Bihar",
    "case_year": 1974,
    "court": "Supreme Court of India",
    "judges": [
      "BHAGWATI, J.",
      "Chandrachud, J."
    ],
    "case_number": "Writ Petition No. 448 of 1974",
    "date_of_judgment": "1974-11-18"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Petitioner is the karta of a Joint Hindu family and as such karta he runs a shop for selling medicines and drugs under the name of Popular Pharmacy in Ranchi.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On 22nd April, 1974, at about 8 p.m. one Vijoy Shankar accompanied by R. N. P. Dube, Executive Magistrate, went to the shop of the petitioner and asked for certain medicines according to a prescription made out by a House Surgeon of the Medical College, Ranchi.",
      "type": "material",
      "date": "1974-04-22",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The petitioner, who was present at the shop, asked Vijoy Shankar and R. N. P. Dube to come at 8.30 p.m. and stated that he would then be able to supply the medicines to them.",
      "type": "material",
      "date": "1974-04-22",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Vijoy Shankar and Dube accordingly visited the shop again at 8.30 p.m. when the petitioner supplied most of the medicines mentioned in the prescription. Amongst the medicines so supplied were two ampoules of pethidine and one bottle of ether.",
      "type": "material",
      "date": "1974-04-22",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The petitioner charged for these two ampoules of pethidine Rs. 3/- as against the price of 90 paise per ampoule shown in the current price list and for the bottle of ether, which contained 450 grms., he charged Rs. 20/- as against the price of Rs. 6.85 shown in the current price list. This was in contravention of paragraph 15(2) of the Drug Price Control Order, 1970.",
      "type": "material",
      "date": "1974-04-22",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The petitioner also refused to issue cash memo in respect of the two ampoules of pethidine and one bottle of ether supplied by him, though he was bound to do so under paragraph 22 of the Drug Price Control Order, 1970.",
      "type": "material",
      "date": "1974-04-22",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "When asked by Vijoy Shankar and R. N. P. Dube to give his name, the petitioner falsely and deliberately gave his name as Sailendra Kumar Gupta though his real name was Satya Deo Prasad Gupta.",
      "type": "material",
      "date": "1974-04-22",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "On the following day, that is, 23rd April, 1974, a group of persons claiming to be representatives of a body known as Nao Nirman Samiti came to the petitioner's shop, forcibly took him out and after placing a garland of shoes around his neck and affixing a placard displaying the slogan 'Main black marketeer hun. Chharupia ka ether bees rupia men bechta hun-Ropular Medical, Bariat-u,' paraded him through the streets in a rickshaw with a rope tied around his waist.",
      "type": "background",
      "date": "1974-04-23",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "The New Republic, a local newspaper, published in its issue dated 27th April, 1974, a photograph of the petitioner as he was being paraded in this procession.",
      "type": "background",
      "date": "1974-04-27",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "The District Magistrate, Ranchi issued an order of detention under section 3(2)(iii) of the Maintenance of Internal Security Act, 1971 directing that Sailendra Kumar Gupta be detained as it was necessary so to do with a view to preventing him from acting in a manner prejudicial to the maintenance of supplies and services essential to the community.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "This order of detention had to be cancelled since the real name of the petitioner was Satya Deo Prasad Gupta and not Sailendra Kumar Gupta as mentioned in the order of detention.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "The District Magistrate then issued another order dated 11th June, 1974 of detention under section 3(2)(iii) of the Act on the ground that it was necessary to detain the petitioner with a view to preventing him from acting in a manner prejudicial to the maintenance of supplies and services essential to the community.",
      "type": "procedural",
      "date": "1974-06-11",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Pursuant to the order of detention the petitioner was arrested on 11th July, 1974 and at the time of his arrest, grounds of detention were served on him.",
      "type": "procedural",
      "date": "1974-07-11",
      "source": "court"
    },
    {
      "id": "f14",
      "text": "These grounds related to the incident of 22nd April, 1974 when the petitioner had sold two ampoules of pethidine and one bottle of ether at prices exceeding those shown in the current list of prices in contravention of paragraph 15(2) of the Drug Price Control Order, 1970 and refused to issue cash memo in respect of these sales though required to do so under paragraph 22 of that order.",
      "type": "material",
      "date": "1974-07-11",
      "source": "court"
    },
    {
      "id": "f15",
      "text": "The District Magistrate, immediately after making the order of detention, reported the fact to the State Government and the order of detention was approved by the State Government within the period prescribed by section 3, sub-section (3).",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f16",
      "text": "The State Government thereafter placed the case of the petitioner before the Advisory Board on 9th August, 1974 as required by section 10.",
      "type": "procedural",
      "date": "1974-08-09",
      "source": "court"
    },
    {
      "id": "f17",
      "text": "The representation of the petitioner against the order of detention was not received until this date and could therefore not be forwarded to the Advisory Board at the time when the papers relating to the case of the petitioner were forwarded to it.",
      "type": "procedural",
      "date": "1974-08-09",
      "source": "court"
    },
    {
      "id": "f18",
      "text": "Subsequently, on 16th August, 1974 the representation of the petitioner was received and the State Government immediately sent it to the Advisory Board for its consideration.",
      "type": "procedural",
      "date": "1974-08-16",
      "source": "court"
    },
    {
      "id": "f19",
      "text": "The Advisory Board, after considering the grounds of detention, the other material placed before it and the representation of the petitioner made a report dated 20th August, 1974 stating that in its opinion there was sufficient cause to detain the petitioner.",
      "type": "procedural",
      "date": "1974-08-20",
      "source": "court"
    },
    {
      "id": "f20",
      "text": "The State Government should have immediately thereafter proceeded to consider the representation of the petitioner and decide whether or not to confirm the order of detention under section 12, sub-section (1) but no such action was taken by the State Government for some time.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f21",
      "text": "The petitioner filed the present petition challenging the validity of the detention.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f22",
      "text": "Deputy Collector, Ranchi in paragraph 15 of his affidavit in reply sworn on 14th October, 1974 stated that the State Government fully, rightly and sympathetically considered the petition of the petitioner.",
      "type": "procedural",
      "date": "1974-10-14",
      "source": "respondent"
    },
    {
      "id": "f23",
      "text": "The petition came up for hearing on 11th November, 1974 before Chandrachud, J. and Bhagwati, J. and was adjourned directing production of original record.",
      "type": "procedural",
      "date": "1974-11-11",
      "source": "court"
    },
    {
      "id": "f24",
      "text": "On perusing the record on 18th November, 1974, the Court found that the order rejecting the representation of the petitioner and confirming the order of detention was made by the Government as late as 15th November, 1974.",
      "type": "procedural",
      "date": "1974-11-15",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the State Government failed to consider the representation of the petitioner and to make the order of confirmation within a reasonable time, rendering the detention invalid.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether the confirmation of the detention order was made within three months from the date of detention as required by Article 22(4) of the Constitution.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The State Government had failed to consider the representation of the petitioner and to make the order of confirmation within a reasonable time and the detention of the petitioner had therefore become invalid.",
      "supporting_facts": [
        "f18",
        "f20",
        "f24"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The State Government fully, rightly and sympathetically considered the petition of the petitioner (as stated in affidavit of Deputy Collector, Ranchi).",
      "supporting_facts": [
        "f22"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "There was inordinate delay on the part of the State Government in considering the representation of the petitioner: received on 16th August 1974, Advisory Board opinion on 20th August 1974, but considered only on 15th November 1974, a period of about three months, with no explanation offered.",
      "addresses_issue": "i1",
      "key_observation": "The constitutional requirement of affording an opportunity to a detenu to make a representation against the order of detention is intended to provide a safeguard against improper or unjustified exercise of the power of detention and it is for this reason that the decisions of this Court have always insisted that the representation of the detenu should be considered promptly and without undue delay."
    },
    {
      "id": "cr2",
      "text": "The statement in the affidavit of Deputy Collector that State Government considered the representation prior to 14th October 1974 was patently false and misleading.",
      "addresses_issue": "i1",
      "key_observation": "This only shows how cavalierly and irresponsibly the executive authorities in the present case seem inclined to view questions concerning personal liberty and betrays complete lack of candour and frankness with the Court."
    },
    {
      "id": "cr3",
      "text": "Where there is inordinate delay in considering the representation and no satisfactory explanation, the constitutional obligation is violated and detention invalid (citing Jayanarayan Sukul).",
      "addresses_issue": "i1",
      "key_observation": "The inescapable conclusion is that the appropriate authority failed to discharge its constitutional obligation by inactivity and lack of independent judgment."
    },
    {
      "id": "cr4",
      "text": "Confirmation of detention must be within three months from date of detention under Art. 22(4); here detention on 11th July 1974, confirmation on 15th November 1974, beyond limit.",
      "addresses_issue": "i2",
      "key_observation": "The order of confirmation was clearly made beyond three months from the date of detention."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Inordinate delay in considering detenu's representation without explanation violates constitutional obligation, rendering detention invalid.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Confirmation of detention order must be within three months from date of detention as per Art. 22(4); delay beyond renders invalid.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Dwarika Prasad Sahu v. State of Bihar",
      "citation": "W. P. 346 of 1974, decided on 12-11-1974",
      "treatment": "referred",
      "relevance": "Earlier judgment pointing out economic offenders are a menace and court loath to interfere, but here procedural lapses."
    },
    {
      "case_name": "Jayanarayan Sukul v. State of West Bengal",
      "citation": "A.I.R. 1972 S.C. 1924",
      "treatment": "followed",
      "relevance": "Inordinate delay in considering representation without explanation violates constitutional obligation, detention invalid."
    },
    {
      "case_name": "S. Roy v. The State of West Bengal",
      "citation": "1970 (3) S.C.R. 225",
      "treatment": "followed",
      "relevance": "On proper interpretation of Art. 22(4), confirmation must be within three months from date of detention."
    }
  ],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Article 32",
        "Article 22(4)"
      ],
      "relevance": "Petition under Art. 32; confirmation within 3 months under Art. 22(4); representation to be considered without avoidable delay."
    },
    {
      "name": "Maintenance of Internal Security Act, 1971",
      "sections": [
        "Section 3(2)(iii)",
        "Section 3(3)",
        "Section 10",
        "Section 12(1)"
      ],
      "relevance": "Basis for detention order to prevent acting prejudicial to supplies and services; approval, Advisory Board, confirmation procedures."
    },
    {
      "name": "Drug Price Control Order, 1970",
      "sections": [
        "Paragraph 15(2)",
        "Paragraph 22"
      ],
      "relevance": "Contravention by selling above price list and refusing cash memo formed grounds of detention."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "The petition is allowed, rule made absolute, detention held invalid due to inordinate delay in considering representation and confirming beyond three months; petitioner directed to be set at liberty forthwith.",
    "relief_granted": "Petitioner set at liberty forthwith",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "This is yet another instance where this Court is reluctantly compelled to set free from detention a person believed to be an economic offender.",
      "speaker": "court",
      "significance": "Highlights court's reluctance but necessity due to procedural lapses."
    },
    {
      "text": "We fail to see why the State Government should not have been able to consider the representation of the petitioner for about three months. This only shows callous disregard of the constitutional provision.",
      "speaker": "court",
      "significance": "Emphasizes violation due to delay in considering representation."
    },
    {
      "text": "It is not well settled... that on a proper interpretation of Art. 22, clause (4) of the Constitution, the confirmation of the detention... must be within three months from the date of detention.",
      "speaker": "court",
      "significance": "Key holding on time limit for confirmation."
    },
    {
      "text": "No words can be too strong to condemn such irresponsible attitude.",
      "speaker": "court",
      "significance": "Condemns false affidavit by executive officer."
    }
  ],
  "_case_id": "1974_337",
  "_label": 1,
  "_text_length": 17194,
  "_extracted_at": "2026-02-10T20:06:11.209743"
}