{
  "metadata": {
    "case_name": "Appellant v. Respondent",
    "case_year": 1973,
    "court": "Supreme Court of India",
    "judges": [
      "RAY, C.J."
    ],
    "case_number": "Civil Appeal No. 1228 of 1973",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The building in question was constructed sometime in 1958.",
      "type": "material",
      "date": "1958",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The appellant let out the building to the respondent on lease for three years on monthly basis on 1 November 1958. The lease expired on 31 October 1961.",
      "type": "background",
      "date": "1958-11-01",
      "source": "appellant"
    },
    {
      "id": "f3",
      "text": "Appellant filed application before Rent Controller, Chandragiri for eviction under section 10(2)(i) read with section 3(1)(a) of the Andhra Pradesh Buildings (Lease, Rent and Eviction Control) Act, 1960. Application dismissed on 30 September 1963.",
      "type": "procedural",
      "date": "1963-09-30",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On 7 October 1963, appellant gave notice to respondent determining the lease and demanding possession, stating building constructed after 26 August 1957 and Act did not apply.",
      "type": "procedural",
      "date": "1963-10-07",
      "source": "appellant"
    },
    {
      "id": "f5",
      "text": "Respondent replied on 21 October 1963 denying that building was constructed after 26 August 1957.",
      "type": "disputed",
      "date": "1963-10-21",
      "source": "respondent"
    },
    {
      "id": "f6",
      "text": "Appellant appealed to Appellate Authority against Rent Controller's order; appeal dismissed on 17 December 1965.",
      "type": "procedural",
      "date": "1965-12-17",
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "On 20 November 1967, appellant instituted suit in Court of District Munsiff, Tirupathi for eviction on grounds: respondent did not surrender possession on lease expiry, default in rent payment, Act did not apply as building constructed after 26 August 1957.",
      "type": "procedural",
      "date": "1967-11-20",
      "source": "appellant"
    },
    {
      "id": "f8",
      "text": "Trial court decreed appellant's suit on 26 March 1969.",
      "type": "procedural",
      "date": "1969-03-26",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Respondent's appeal dismissed by Subordinate Judge on 24 February 1972, confirming decree.",
      "type": "procedural",
      "date": "1972-02-24",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Andhra Pradesh High Court on 5 September 1972 reversed the decree, holding appellant precluded by principle of waiver.",
      "type": "procedural",
      "date": "1972-09-05",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Concurrent finding of trial court and first appellate court: building constructed in 1958, after August 1957, so Act does not apply; civil court has jurisdiction.",
      "type": "admitted",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the appellant waived the jurisdiction of the civil court to entertain the suit for eviction by previously approaching the Rent Controller.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the appellant is estopped or barred by res judicata from pleading that the Rent Control Act does not apply to the building constructed in 1958.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether the Rent Controller had jurisdiction over the building constructed after August 1957.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Building constructed after 26 August 1957, so Act does not apply; Rent Controller lacked jurisdiction; prior proceedings coram non judice; no res judicata, estoppel or waiver.",
      "supporting_facts": [
        "f1",
        "f11"
      ],
      "legal_basis": "Andhra Pradesh Buildings (Lease, Rent and Eviction Control) Act, 1960 exemption for post-August 1957 buildings; Section 44 Evidence Act"
    },
    {
      "id": "pa2",
      "text": "Approached Rent Controller under mistake of fact regarding applicability of Act.",
      "supporting_facts": [
        "f3",
        "f7"
      ],
      "legal_basis": "Doctrine of waiver requires intentional relinquishment of known right; no waiver of non-existent right"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Appellant waived right to evict by invoking Rent Controller's jurisdiction.",
      "supporting_facts": [
        "f3",
        "f6"
      ],
      "legal_basis": "Lachoo Mall v. Radhey Shyam; principle of waiver"
    },
    {
      "id": "ra2",
      "text": "Building construction date disputed; Act applies.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Rent Controller lacked jurisdiction as building constructed in 1958 after August 1957; proceedings coram non judice; no res judicata as per Gokul Mandar v. Pudmanund and Section 44 Evidence Act.",
      "addresses_issue": "i3",
      "key_observation": "Want of jurisdiction deprives order of conclusive effect."
    },
    {
      "id": "cr2",
      "text": "Waiver is intentional relinquishment of known right; requires voluntary choice; appellant acted under mistake of fact; no waiver of civil court jurisdiction.",
      "addresses_issue": "i1",
      "key_observation": "One cannot waive non-existent right or confer jurisdiction by consent; Rent Acts operate in rem."
    },
    {
      "id": "cr3",
      "text": "Lachoo Mall distinguished: no application as it concerned waiving benefit of exemption, not jurisdiction.",
      "addresses_issue": "i1",
      "key_observation": "Lachoo Mall involved waiving Act's benefit where owner chose not to avail exemption."
    },
    {
      "id": "cr4",
      "text": "No estoppel: representation must be of existing facts, not intention; status under Rent Act cannot be acquired by estoppel or res judicata.",
      "addresses_issue": "i2",
      "key_observation": "Civil court has jurisdiction over such buildings."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Appellant not disentitled to relief on grounds of res judicata, estoppel or waiver; civil court has jurisdiction.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Rent Control Act does not apply to buildings constructed after August 1957.",
      "resolves_issue": "i3",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Lachoo Mall v. Radhey Shyam",
      "citation": "1971 3 S.C.R. 693; A.I.R. 1971 S.C. 2213",
      "treatment": "distinguished",
      "relevance": "Distinguished as it allowed waiving benefit of exemption under U.P. Rent Act, unlike jurisdictional issue here."
    },
    {
      "case_name": "Gokul Mandar v. Pudmanund",
      "citation": "29 I.A. 196",
      "treatment": "followed",
      "relevance": "Decree by court lacking jurisdiction cannot operate as res judicata."
    },
    {
      "case_name": "Dawsons Bank Ltd. v. Nippon M. K. Kaisha",
      "citation": null,
      "treatment": "referred",
      "relevance": "Foundation of estoppel is representation of existing facts, not mere intention."
    }
  ],
  "statutes_cited": [
    {
      "name": "Andhra Pradesh Buildings (Lease, Rent and Eviction Control) Act, 1960",
      "sections": [
        "10(2)(i)",
        "3(1)(a)"
      ],
      "relevance": "Basis for eviction application before Rent Controller; exemption for buildings constructed after August 1957."
    },
    {
      "name": "Indian Evidence Act",
      "sections": [
        "44"
      ],
      "relevance": "Allows showing judgment delivered by court not competent."
    },
    {
      "name": "U.P. (Temporary) Control of Rents and Eviction Act",
      "sections": [
        "1-A",
        "3"
      ],
      "relevance": "Cited in Lachoo Mall for exemption of post-1951 buildings."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Supreme Court set aside High Court judgment, restored trial court and first appellate court decree for eviction in favour of appellant. Respondent granted time to quit and vacate.",
    "relief_granted": "Eviction and possession of building to appellant.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "Waiver is an intentional relinquishment of a known right or advantage, benefit, claim or privilege which except for such waiver the party would have enjoyed.",
      "speaker": "court",
      "significance": "Defines waiver, central to rejecting High Court's finding."
    },
    {
      "text": "The Rent Control Acts operate in rem. These Acts give a status to the house from which certain legal consequences follow.",
      "speaker": "court",
      "significance": "Explains why estoppel/res judicata cannot confer jurisdiction."
    },
    {
      "text": "If there is want of jurisdiction the whole proceeding is coram non judice.",
      "speaker": "court",
      "significance": "Key to holding prior Rent Controller proceedings void."
    }
  ],
  "_case_id": "1974_244",
  "_label": 1,
  "_text_length": 11434,
  "_extracted_at": "2026-02-10T20:05:32.813075"
}