{
  "metadata": {
    "case_name": "Mysore State Road Transport Corporation v. Inter-State Operators",
    "case_year": 1973,
    "court": "Supreme Court of India",
    "judges": [
      "Beg, J."
    ],
    "case_number": "Civil Appeal Nos. 1755 to 1756 of 1969, 362 to 363 and 1918 to 1920 of 1970 and 490 to 492 of 1973; SLP Nos. 2015 to 2112 and 2408 to 2412 of 1969",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Three approved schemes for nationalisation under Chapter IVA of the Motor Vehicles Act, 1939: Anekal Scheme dated 15-4-1959, Gulbarga Scheme dated 18-2-1960, and Bangalore Scheme dated 7-6-1960, covering certain intrastate routes in Mysore.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Parts of intrastate routes under the schemes overlap interstate routes over which private transporters were granted permits and renewals by State Transport authorities.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Mysore State Road Transport Corporation objects to these permits insofar as they cover overlapping portions of intrastate routes.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "Regional Transport Officer granted or renewed permits to inter-state operators in some cases; in others, rejected but overturned by final State Appellate Authority.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Condition imposed by final Appellate Transport Authority on each inter-state operator: will neither pick up nor drop passengers on any part of the overlapping notified route.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "Mysore High Court upheld grants of permits to inter-state operators in judgments dated 10th October 1968, 11th March 1969, 24th March 1969, 16th June 1969, and 11th November 1969, finding schemes ambiguous and not warranting total exclusion.",
      "type": "procedural",
      "date": "1968-10-10",
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Twenty-two appeals by special leave and thirteen connected special leave petitions filed before Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Manager of appellant Corporation confined objections to sufficiency of buses on overlapping parts and did not rely on schemes for total prohibition.",
      "type": "admitted",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f9",
      "text": "Schemes published in official Gazette with particulars as per Mysore Gazette rules dated 27-2-1958, including routes with starting points, termini, intermediate stations, existing operators' names and trips.",
      "type": "background",
      "date": "1958-02-27",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Inter-state operators' names not mentioned in appended statements listing existing operators in the schemes.",
      "type": "material",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Can a permit be granted to an Inter-State Transport Operator for the whole of his route despite the fact that a part of the route overlaps a part of a notified intra-State route?",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the schemes provide for partial or total exclusion of private operators, including inter-state operators from overlapping portions.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether Transport authorities have power to grant permits to inter-state operators with conditions prohibiting pick up/drop on overlapping notified routes, or if that modifies the schemes.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Schemes under s.68C provide for exclusion, complete or partial, of other persons including inter-state operators from notified routes or portions thereof; transport authorities cannot deviate or modify approved schemes.",
      "supporting_facts": [
        "f1",
        "f2",
        "f3"
      ],
      "legal_basis": "Motor Vehicles Act, 1939 s.68C, 68D, 68E; Nilkanth Prasad v. State of Bihar"
    },
    {
      "id": "pa2",
      "text": "Route under Chapter IVA includes physical track; notification excludes private operators completely from sectors/routes vested in State Transport Undertaking.",
      "supporting_facts": [
        "f1"
      ],
      "legal_basis": "Nilkanth Prasad v. State of Bihar; Kondala Rao v. Andhra Pradesh State Road Transport Corporation"
    },
    {
      "id": "pa3",
      "text": "Schemes warrant total exclusion of inter-state operators on overlapping parts; High Court erred in not allowing contention as it goes to jurisdiction.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Schemes ambiguous and do not clearly indicate total exclusion of inter-state operators from mere user/passage on overlapping portions; exclusion only for services between termini on notified routes.",
      "supporting_facts": [
        "f1",
        "f9",
        "f10"
      ],
      "legal_basis": "Motor Vehicles Act s.68C requires clear particulars; Mysore Rules 1958 require naming existing operators"
    },
    {
      "id": "ra2",
      "text": "Inter-state operators not named in schemes' lists of existing operators, so not intended to be excluded; could not object as affected persons.",
      "supporting_facts": [
        "f10"
      ],
      "legal_basis": "Motor Vehicles Act s.68D, 68G"
    },
    {
      "id": "ra3",
      "text": "Conditions imposed (no pick/drop) align with schemes; Corporation's Manager impliedly admitted no total prohibition by objecting only to sufficiency.",
      "supporting_facts": [
        "f5",
        "f8"
      ],
      "legal_basis": "H.C. Narayanappa v. State of Mysore"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "State Transport Undertaking has power under s.68C to exclude even inter-state operators from part of notified route, but scheme must make intention clear; mere physical overlap insufficient without unequivocal language.",
      "addresses_issue": "i1",
      "key_observation": "Route is line of travel between termini (post-1969 def. s.2(28A)); nationalisation of services, not highway surfaces."
    },
    {
      "id": "cr2",
      "text": "Schemes' preambles and clauses 3-7 do not indicate total exclusion; refer to routes by termini, list only intra-state operators; inter-state not named, so reasonable inference they are not excluded from passage.",
      "addresses_issue": "i2",
      "key_observation": "Anekal, Gulbarga, Bangalore schemes examined; omission of inter-state names supports non-exclusion."
    },
    {
      "id": "cr3",
      "text": "Transport authorities can impose conditions consistent with schemes; no modification as conditions enforce no service on notified portions.",
      "addresses_issue": "i3",
      "key_observation": "Conditions rightly imposed to reflect scheme meaning."
    },
    {
      "id": "cr4",
      "text": "Distinguishes Nilkanth Prasad as pre-definition of route and different context; follows Narayanappa interpreting Anekal scheme.",
      "addresses_issue": "i1",
      "key_observation": "Schemes cover services between specified termini, not mere passage."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Approved schemes do not prohibit inter-state operators from using overlapping portions of notified intra-state routes without picking up/dropping passengers thereon.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Schemes are not of total exclusion extending to mere user by inter-state operators on overlapping parts.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Nilkanth Prasad Ors. v. State of Bihar",
      "citation": "1962 1 Suppl. S.C.R. 728",
      "treatment": "distinguished",
      "relevance": "Distinguished on definition of route pre-s.2(28A); not applicable to these schemes."
    },
    {
      "case_name": "Standard Motor Union Pvt Ltd. v. State of Kerala Ors",
      "citation": "1969 1 S.C.R. 464",
      "treatment": "followed",
      "relevance": "Power under s.68C includes excluding inter-state operators from part of route."
    },
    {
      "case_name": "S. Abdul Khader Saheb v. Mysore Revenue Appellate Tribunal Ors.",
      "citation": null,
      "treatment": "followed",
      "relevance": "Power under s.68C to exclude inter-state operators."
    },
    {
      "case_name": "Saghir Ahmed Anr. v. State of U.P. Ors.",
      "citation": "1955 1 S.C.R. 707, 717",
      "treatment": "referred",
      "relevance": "Public right to use highways anterior to Act; State regulates but right to passage exists."
    },
    {
      "case_name": "H.C. Narayanappa Ors. v. State of Mysore Ors.",
      "citation": "1960 3 S.C.R. 742",
      "treatment": "followed",
      "relevance": "Interpreted Anekal scheme; route refers to service between termini, not blanket prohibition on portions."
    },
    {
      "case_name": "Kondala Rao v. Andhra Pradesh State Road Transport Corporation",
      "citation": "AIR 1961 S.C. 82",
      "treatment": "referred",
      "relevance": "Whether route can be area; distinguished in Nilkanth."
    },
    {
      "case_name": "Kelani Valley Motor Transit Co. v. Colombo Ratnapura Omnibus Co.",
      "citation": "1946 A.C. 338",
      "treatment": "distinguished",
      "relevance": "Route as abstract line between termini, distinguished in Nilkanth."
    }
  ],
  "statutes_cited": [
    {
      "name": "Motor Vehicles Act, 1939",
      "sections": [
        "68C",
        "68D",
        "68E",
        "68G",
        "Chapter IVA",
        "2(28A)"
      ],
      "relevance": "Framing, approval, modification of nationalisation schemes; requires particulars including routes by termini; power to exclude but must be clear."
    },
    {
      "name": "Mysore State Road Transport Undertaking Rules, 1958",
      "sections": [
        "Rule 1 (sub-rules 3,4)"
      ],
      "relevance": "Prescribed particulars for schemes: routes with termini, existing operators' names/trips, etc."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court dismissed the appeals and special leave petitions, upholding the Mysore High Court's decisions granting/renewing permits to inter-state operators over overlapping portions of notified routes, subject to no pick-up/drop conditions, as schemes do not clearly prohibit mere passage.",
    "relief_granted": "Permits to inter-state operators upheld with conditions.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"Can a permit be granted to an Inter-State Transport Operator for the whole of his route despite the fact that a part of the route overlaps a part of a notified intra-State route?\"",
      "speaker": "court",
      "significance": "Formulates the common question of law."
    },
    {
      "text": "\"Unless a scheme clearly indicates that the user of every portion of a highway covered by an intrastate notified route is prohibited also to an inter-state motor vehicle operator... the inter-state operator may not be completely debarred.\"",
      "speaker": "court",
      "significance": "Key principle for interpreting exclusion in schemes."
    },
    {
      "text": "\"The interpretation of the three schemes advanced on behalf of the inter-state operators is more reasonable.\"",
      "speaker": "court",
      "significance": "Court's conclusion on scheme ambiguity."
    }
  ],
  "_case_id": "1974_164",
  "_label": 0,
  "_text_length": 29388,
  "_extracted_at": "2026-02-10T20:04:58.513185"
}