{
  "metadata": {
    "case_name": "Appellant v. Respondent No. 1 & Ors.",
    "case_year": 1973,
    "court": "Supreme Court of India",
    "judges": [
      "KHANNA, J."
    ],
    "case_number": "Civil Appeals Nos. 844 and 845 of 1973",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "There is a distillery installation owned by the State at Daman. The Government has been leasing out the said distillery for specified period to members of the public for manufacture of country liquor.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "At the expiry of each lease, the Government used to invite fresh tenders from the public for the next lease and granted lease of the distillery to the person whose tender was accepted.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "For a number of years before 1973 the appellants tender in respect of the above distillery was accepted by the Government as the amount offered by him was the highest.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The last lease in favour of the appellant expired on January 31, 1973.",
      "type": "material",
      "date": "1973-01-31",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "By notice dated September 25, 1972 the Finance Secretary for the Union Territory of Goa, Daman and Diu invited tenders on behalf of the President of India from the public for the lease of the said distillery for a period of three years commencing from February 1, 1973 for the manufacture of country liquor.",
      "type": "procedural",
      "date": "1972-09-25",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Clause 7 of the terms and conditions: 'The highest tender shall ordinarily be accepted but the Government reserves the right to select any tender or reject all tenders without assigning any reason therefor.'",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Pursuant to the notice the appellant and respondent No. 1 submitted closed tenders to the Government in the prescribed form.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "The tenders were opened on December 20, 1972 in the office of the Commissioner of Excise in the presence of the tenderers.",
      "type": "procedural",
      "date": "1972-12-20",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "It was found that the tender of respondent No. 1 for an amount of Rs. 3,51,345 was the highest, while that of the appellant for Rs. 3,25,000 was second.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Respondent No. 1 wrote a letter on January 16, 1973 to the Finance Secretary calling upon him to accept the tender of respondent No. 1 within 24 hours and to take necessary steps for the execution of the lease.",
      "type": "procedural",
      "date": "1973-01-16",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "On January 18, 1973 the Advocate of respondent No. 1 sent notice to the Finance Secretary to accept the tender of respondent No. 1.",
      "type": "procedural",
      "date": "1973-01-18",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Respondent No. 1 learnt that the distillery had been given on lease to the appellant for Rs. 3,52,345, i.e., Rs. 1,000 more than the amount mentioned in the tender of respondent No. 1.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "The tender of respondent No. 1 was rejected after the appellant had been informed that his tender could be accepted provided he raised his offer so as to pay an amount higher than that offered by the person with the highest tender. The appellant accordingly raised his and thereupon his tender was accepted.",
      "type": "material",
      "date": null,
      "source": "state_government"
    },
    {
      "id": "f14",
      "text": "The grounds for the rejection of the tender of respondent No. 1 were stated to have been recorded in the file.",
      "type": "admitted",
      "date": null,
      "source": "state_government"
    },
    {
      "id": "f15",
      "text": "Respondent No. 1 filed petition under articles 226 and 227 praying for the issuance of a writ to quash and set aside the grant of lease of the distillery in question in favour of the appellant and for directing the Government to grant the lease of the distillery in favour of respondent No. 1.",
      "type": "procedural",
      "date": null,
      "source": "respondent_no_1"
    },
    {
      "id": "f16",
      "text": "Learned Judicial Commissioner cancelled the leases of the distilleries granted in favour of the appellant and directed the Government to deal with the tender of respondent No. 1 according to law in the light of the observations made by the Judicial Commissioner. He held that clause 7 was ultra vires to the extent it allowed rejection of highest tender without reasons.",
      "type": "procedural",
      "date": "1973-03-31",
      "source": "lower_court"
    },
    {
      "id": "f17",
      "text": "After the judgment of the Judicial Commissioner, letter dated April 10, 1973 was addressed on behalf of the Government stating that in pursuance of the decision of the Judicial Commissioner the Government had decided that the existing contract with the appellant be set aside and the lease of the distillery be granted in favour of respondent No. 1.",
      "type": "procedural",
      "date": "1973-04-10",
      "source": "government"
    },
    {
      "id": "f18",
      "text": "No allegations were made in the writ petition by respondent No. 1 that the act of the authorities in the grant of lease of the distillery in question to the appellant was mala fide.",
      "type": "admitted",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether clause 7 of the tender conditions, which reserves the right to the Government to select any tender or reject all tenders without assigning any reason, is void for violation of Article 14 of the Constitution.",
      "framed_by": "respondent_no_1"
    },
    {
      "id": "i2",
      "text": "Whether the Government was bound to accept the highest tender and whether rejection of respondent No. 1's highest tender without assigning reasons was arbitrary.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether the Judicial Commissioner was justified in setting aside the lease granted to the appellant without giving any reason.",
      "framed_by": "petitioner"
    },
    {
      "id": "i4",
      "text": "Whether the grant of lease is governed by Article 9 of Legislative Diploma No. 1761.",
      "framed_by": "respondent_no_1"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The Judicial Commissioner was not justified in setting aside the lease in favour of the appellant without giving any reason.",
      "supporting_facts": [
        "f16"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Clause 7 is valid and does not contravene Article 14 of the Constitution.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": "Article 14"
    },
    {
      "id": "pa3",
      "text": "Respondent No. 1 cannot be allowed to take the benefit of one part of clause 7 without at the same time being bound by the other part of that clause.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": null
    },
    {
      "id": "pa4",
      "text": "The said Legislative Diploma was no longer in force at the time the distillery was leased in favour of the appellant.",
      "supporting_facts": [
        "f12"
      ],
      "legal_basis": "Legislative Diploma No. 1761"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "It was incumbent upon the Government to give reasons for the rejection of his tender.",
      "supporting_facts": [
        "f9",
        "f13"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Clause 7 is void for violation of Article 14 as it enables the Government to reject the highest tender without assigning any reason.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": "Article 14"
    },
    {
      "id": "ra3",
      "text": "The judgment of the Judicial Commissioner does not suffer from any infirmity.",
      "supporting_facts": [
        "f16"
      ],
      "legal_basis": null
    },
    {
      "id": "ra4",
      "text": "The grant of lease of the distillery in question is governed by the provisions of Article 9 of Legislative Diploma No. 1761.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": "Article 9 of Legislative Diploma No. 1761"
    },
    {
      "id": "ra5",
      "text": "There must have been some negotiation between the Government and the appellant as a result of which the appellant raised his offer.",
      "supporting_facts": [
        "f12",
        "f13"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The Judicial Commissioner should not have without giving some comment reason set aside the lease of the distillery in favour of the appellant. The main reason was the submission by State that it was prepared to annul if court directed, but absence of concurrence of appellant makes it insufficient.",
      "addresses_issue": "i3",
      "key_observation": "Circumstance hardly sufficient to warrant setting aside of the lease."
    },
    {
      "id": "cr2",
      "text": "Clause 7 is not violative of Article 14. Government not bound to accept highest tender in contractual matters. Matter concluded by precedents like C.K. Achuthan, Trilochan Mishra, State of Orissa v. Harinarayan Jaiswal.",
      "addresses_issue": "i1",
      "key_observation": "In matters relating to contracts with the Government, the latter is not bound to accept the tender of the person who offers the highest amount."
    },
    {
      "id": "cr3",
      "text": "Legislative Diploma No. 1761 para 2 of Article 9 relates to auction, not invitation for tenders. There was invitation for tenders, not auction.",
      "addresses_issue": "i4",
      "key_observation": "Difference between auction and invitation for tenders."
    },
    {
      "id": "cr4",
      "text": "Negotiation with appellant ensured pecuniary interest of Government did not suffer; appellant paid Rs. 1,000 more.",
      "addresses_issue": "i2",
      "key_observation": "No loss to Government."
    },
    {
      "id": "cr5",
      "text": "No alteration of position by respondent No. 1 to prejudice relying on representation. Distinguished other cases cited by respondent No. 1.",
      "addresses_issue": "i2",
      "key_observation": "No such question arises."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Clause 7 is valid and not violative of Article 14.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Government is not bound to accept the highest tender in matters of contract.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h3",
      "text": "Setting aside of lease by Judicial Commissioner without sufficient reason was not justified.",
      "resolves_issue": "i3",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h4",
      "text": "Lease not governed by Article 9 of Legislative Diploma No. 1761 as it was invitation for tenders, not auction.",
      "resolves_issue": "i4",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "C. K. Achuthan v. The State of Kerala Ors.",
      "citation": "1959 Suppl. 1 S.C.R. 787",
      "treatment": "followed",
      "relevance": "Government free to choose person for contract; no discrimination under Art. 14; no vested right till acceptance."
    },
    {
      "case_name": "Trilochan Mishra, etc. v. State of Orissa Ors.",
      "citation": "1971 3 S.C.R. 153",
      "treatment": "followed",
      "relevance": "Government may prefer lower tenderer if overall preferable; no loss if raised to highest."
    },
    {
      "case_name": "State of Orissa Ors. v. Harinarayan Jaiswal Ors.",
      "citation": "1972 2 S.C.C. 36",
      "treatment": "followed",
      "relevance": "Absolute power to accept/reject highest bid without reason not violative of Arts. 14, 19(1)(g); protects revenue."
    },
    {
      "case_name": "Cooverjee B. Bharucha",
      "citation": "1954 S.C.R. 873",
      "treatment": "referred",
      "relevance": "Purpose of liquor contracts is revenue; Government protects financial interest."
    },
    {
      "case_name": "Union of India and Ors. v. M/s. Bhimsen Walaiti Ram",
      "citation": "1970 2 S.C.R. 594",
      "treatment": "referred",
      "relevance": "No concluded contract till bid accepted; bidders can withdraw."
    },
    {
      "case_name": "Century Spinning Manufacturing Company Ltd. Anr. v. The Ulhasnagar Municipal Council Anr.",
      "citation": "1970 3 S.C.R. 854",
      "treatment": "distinguished",
      "relevance": "Public body bound by representations altering position to prejudice; no such case here."
    },
    {
      "case_name": "Rashbihari Panda etc. v. State of Orissa",
      "citation": null,
      "treatment": "distinguished",
      "relevance": "Restriction to previous contractors created monopoly; no such restriction here."
    },
    {
      "case_name": "Dwarka Prasad Laxmi Narain v. The State of Uttar Pradesh Two Ors.",
      "citation": null,
      "treatment": "distinguished",
      "relevance": "Absolute licensing power; no such issue here."
    },
    {
      "case_name": "Guruswamy v. State of Mysore",
      "citation": null,
      "treatment": "distinguished",
      "relevance": "Cancellation after auction knock-down proper if irregular, but contrary to rules; no rule violation here."
    }
  ],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Article 14",
        "Article 19(1)(g)",
        "Article 226",
        "Article 227",
        "Article 32"
      ],
      "relevance": "Clause 7 not violative of Art. 14; no right under Art. 19(1)(g); writ under 226/227."
    },
    {
      "name": "Orissa Kendu Leaves (Control of Trade) Act, 1961",
      "sections": [
        "Section 3(2)(a)",
        "Section 8(1)"
      ],
      "relevance": "Validity upheld; Govt may reject highest bids."
    },
    {
      "name": "Orissa Excise Act",
      "sections": [
        "Section 22",
        "Section 29(2)"
      ],
      "relevance": "Absolute power to grant privileges by tender/auction/otherwise."
    },
    {
      "name": "Legislative Diploma No. 1761",
      "sections": [
        "Article 9"
      ],
      "relevance": "Governs auctions, not tenders; not applicable."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "The Supreme Court allowed the appeals by special leave, set aside the judgment of the Judicial Commissioner, upheld the validity of clause 7 and the grant of lease to the appellant, holding that the Government is not bound to accept the highest tender and has discretion in contractual matters without violating Article 14.",
    "relief_granted": "Lease in favour of appellant upheld; lower court direction to consider respondent No. 1's tender set aside.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"The highest tender shall ordinarily be accepted but the Government reserves the right to select any tender or reject all tenders without assigning any reason therefor.\"",
      "speaker": "court",
      "significance": "Clause 7 of tender conditions upheld as valid."
    },
    {
      "text": "\"When one person is chosen rather than another, the aggrieved party cannot claim the protection of Art. 14, because the choice of the person to fulfil a particular contract must be left to the Government.\"",
      "speaker": "court",
      "significance": "From C.K. Achuthan; core reasoning on govt discretion in contracts."
    },
    {
      "text": "\"Government is not bound to accept the highest tender but may accept a lower one in case it thinks that the person offering the lower tender is on an overall consideration to be preferred.\"",
      "speaker": "court",
      "significance": "From Trilochan Mishra; supports rejection of highest bid."
    },
    {
      "text": "\"There is no concluded contract till the bid is accepted.\"",
      "speaker": "court",
      "significance": "No vested right in highest bidder."
    }
  ],
  "_case_id": "1974_14",
  "_label": 1,
  "_text_length": 25561,
  "_extracted_at": "2026-02-10T20:03:23.536331"
}