{
  "metadata": {
    "case_name": "Sugar Manufacturers (Appellants) v. Union of India & Ors.",
    "case_year": 1968,
    "court": "Supreme Court of India",
    "judges": [
      "BEG, J."
    ],
    "case_number": "Civil Appeals Nos. 1928/67, 1274-76, 1293, 1356-57/68",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellants are manufacturers of sugar who challenged notification dated 28-6-1967 issued by Central Government under clause 7 of Sugar Control Order, 1966, fixing ex-factory prices for specified sugar factories.",
      "type": "material",
      "date": "1967-06-28",
      "source": "petitioner"
    },
    {
      "id": "f2",
      "text": "Initial fixation of sugar prices by notification dated 1-2-1967, followed by final fixation on 28-6-1967.",
      "type": "material",
      "date": "1967-02-01",
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "Writ petitions filed in Delhi High Court for quashing the impugned notification and mandamus; judgments and orders dated 10th October 1967 and 5th February 1968 dismissing writs; appeals certified fit under Article 133(1)(c) of Constitution.",
      "type": "procedural",
      "date": "1967-10-10",
      "source": "lower_court"
    },
    {
      "id": "f4",
      "text": "Sugar Enquiry Commission Report October 1965 provided schedules of cost for price fixation; recommended five zones for country.",
      "type": "background",
      "date": "1965-10",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Government divided country into 22 zones for price fixation; Saraswati Industrial Syndicate (Haryana) claimed inefficiency due to same zone as Madhya Pradesh despite higher efficiency and wages.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "Ex-factory price for Punjab including Haryana fixed at Rs. 137.35 per quintal on 24th March 1966, revised to Rs. 134.55 on 20th October 1966.",
      "type": "material",
      "date": "1966-03-24",
      "source": "respondent"
    },
    {
      "id": "f7",
      "text": "Counter-affidavit by Shri K. L. Pasricha, Joint Secretary, Ministry of Food, explaining price fixation based on estimates at start of season, revisions after; no provision for adjustment for prior deliveries.",
      "type": "admitted",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "Prices revised on 28-6-1967 for various regions e.g., Haryana 142.25, Madhya Pradesh 171.91 per quintal.",
      "type": "material",
      "date": "1967-06-28",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "No demand made by appellants to Government for adjustments before approaching court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Undertaking by Union of India in High Court to pay balance to Saraswati Industrial Syndicate if price found too low, exhausted with dismissal of writ.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Correctness of method adopted in fixing prices of sugar under clause 7 of Sugar Control Order, 1966, including zoning and failure to adjust for initial price fixation on 1-2-1967.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether Government required to make adjustments or allowances in final fixation of 28-6-1967 for prior deliveries at initial price.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether price fixation must follow exactly Sugar Enquiry Commission schedules, e.g., 5 zones, specific cost heads like excise duty.",
      "framed_by": "petitioner"
    },
    {
      "id": "i4",
      "text": "Nature of price fixation: legislative or quasi-judicial, requiring hearing or natural justice.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Government divided country into 22 zones instead of 5 recommended by Commission; inequitable zoning e.g., Haryana with Madhya Pradesh ignoring higher wages and efficiency of appellant.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": "Clause 7 Sugar Control Order 1966; Sugar Enquiry Commission Report"
    },
    {
      "id": "pa2",
      "text": "No adjustment in final fixation of 28-6-1967 for losses on deliveries between 1-2-1967 and 28-6-1967 at lower initial price.",
      "supporting_facts": [
        "f2",
        "f8"
      ],
      "legal_basis": "Clause 7(2) Sugar Control Order 1966"
    },
    {
      "id": "pa3",
      "text": "Prices not determined per Commission schedules: excluded excise duty, used wrong recovery basis, working days.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": "Sugar Enquiry Commission Report schedules"
    },
    {
      "id": "pa4",
      "text": "Provisional fixation on 1-2-1967 required final adjustment for whole season.",
      "supporting_facts": [
        "f2"
      ],
      "legal_basis": "Sugar Enquiry Commission Report p.116"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Clause 7 requires fixing price 'having regard to' estimated cost per Commission schedules, not mandatory adherence; no obligation for adjustments for prior fixations.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "Clause 7 Sugar Control Order 1966; Ryots of Garabandho v. Zemindar of Parlakimedi"
    },
    {
      "id": "ra2",
      "text": "Price fixation from time to time based on estimates at season start, revised after; practice followed since 1963; appellants benefited previously.",
      "supporting_facts": [
        "f6",
        "f7"
      ],
      "legal_basis": "Sugar Control Orders 1963 and 1966"
    },
    {
      "id": "ra3",
      "text": "Zoning and cost items discretionary; schedules are guidelines, not rigid; excise duty not part of manufacturing cost.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": "Clause 7(2)"
    },
    {
      "id": "ra4",
      "text": "Price fixation legislative, not quasi-judicial; no hearing required.",
      "supporting_facts": [],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "'Having regard to' obliges consideration of relevant material but not strict adherence; no mandatory duty for adjustments compensating prior fixations.",
      "addresses_issue": "i1",
      "key_observation": "Expression 'having regard to' only obliges Govt. to consider as relevant data material to which it must have regard."
    },
    {
      "id": "cr2",
      "text": "More zones than 5 recommended ok; encourages efficiency; Haryana appellant's efficiency offsets higher wages.",
      "addresses_issue": "i1",
      "key_observation": "Modern manufacturer gains from price profitable for less efficient ones."
    },
    {
      "id": "cr3",
      "text": "Schedules are guidelines with elasticity; items like excise duty not necessarily manufacturing cost; no All India or 5-zone mandate.",
      "addresses_issue": "i3",
      "key_observation": "Criteria elastic enough to include or exclude items."
    },
    {
      "id": "cr4",
      "text": "Price fixation legislative measure, not quasi-judicial; no natural justice breach; must be reasonable with nexus to purposes.",
      "addresses_issue": "i4",
      "key_observation": "Price fixation more in nature of legislative measure."
    },
    {
      "id": "cr5",
      "text": "No prior demand to Govt.; no retrospective effect; Section 15 Essential Commodities Act protects good faith actions; no losses asserted.",
      "addresses_issue": "i2",
      "key_observation": "No allegation of lack of good faith."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Clause 7 permits price fixation from time to time without adjustments for prior periods; no mandatory duty breached.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "No writ issues without demand and refusal; fixation not ultra vires or unreasonable.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Price fixation legislative; no hearing required if reasonable.",
      "resolves_issue": "i4",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Ryots of Garabandho and other Villages v. Zemindar of Parlakimedi",
      "citation": "70 I.A. 129",
      "treatment": "followed",
      "relevance": "Meaning of 'having regard to' as obliging consideration of relevant material."
    },
    {
      "case_name": "Shree Meenakshi Mills Ltd v. Union of India",
      "citation": "1974 1 S.C.R. p. 468",
      "treatment": "followed",
      "relevance": "Price fixation under control orders; reasonableness; fair price for consumer, reasonable profit."
    },
    {
      "case_name": "Panipat Cooperative Sugar Mills v. Union of India",
      "citation": "1973 2 S.C.R. 860",
      "treatment": "followed",
      "relevance": "Sugar price fixation; unit-wise fixation perpetuates inefficiency; fair price ensures reasonable return."
    },
    {
      "case_name": "Premier Automobiles Ltd. v. Union of India",
      "citation": "1972 2 S.C.R. 526",
      "treatment": "distinguished",
      "relevance": "Concept of fair prices varies; not applicable due to special agreement."
    }
  ],
  "statutes_cited": [
    {
      "name": "Sugar Control Order, 1966",
      "sections": [
        "Clause 7"
      ],
      "relevance": "Power to fix ex-factory prices having regard to estimated cost per Sugar Enquiry Commission schedules; from time to time."
    },
    {
      "name": "Essential Commodities Act, 1955",
      "sections": [
        "Section 3",
        "Section 15"
      ],
      "relevance": "Issued Sugar Control Order; protection for good faith actions in price fixation."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 133(1)(c)"
      ],
      "relevance": "Certification for appeal to Supreme Court."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court dismissed the appeals, upholding Delhi High Court dismissal of writ petitions challenging sugar price notifications under Sugar Control Order, 1966; no breach of mandatory duty or unreasonableness found.",
    "relief_granted": "None",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The expression 'having regard to' only obliges the Govt. to consider as relevant data material to which it must have regard.",
      "speaker": "court",
      "significance": "Interprets scope of clause 7(2); limits judicial review."
    },
    {
      "text": "Price fixation is more in the nature of a legislative measure even though it may be based upon objective criteria.",
      "speaker": "court",
      "significance": "Determines no quasi-judicial procedure or natural justice required."
    },
    {
      "text": "A modern manufacturer of sugar, with more efficient methods of production, would gain by a fixation of price which was profitable even for less efficient manufacturers.",
      "speaker": "court",
      "significance": "Rejects zoning grievance; promotes efficiency."
    }
  ],
  "_case_id": "1974_192",
  "_label": 0,
  "_text_length": 32948,
  "_extracted_at": "2026-02-10T20:04:54.774649"
}