{
  "metadata": {
    "case_name": "Accused Compounder v. State",
    "case_year": 1970,
    "court": "Supreme Court of India",
    "judges": [
      "KRISHNA IYER, J."
    ],
    "case_number": "Criminal Appeal No. 222 of 1970",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Senior doctor PW2 arrives at hospital around 9:30 a.m. with bad headache and asks accused compounder for ten grains of aspirin.",
      "type": "material",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f2",
      "text": "Accused takes 12-13 minutes to bring two packets labeled 'aspirin' from dispensing room to PW2.",
      "type": "material",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f3",
      "text": "PW2 consumes contents of one packet, experiences unusual bitterness, asks peon Badri for water.",
      "type": "material",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f4",
      "text": "PW3, other doctor, arrives and PW2 complains of bitter taste, noting aspirin is tasteless.",
      "type": "material",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f5",
      "text": "PW2 gargles, washes face, chews betel leaves, proceeds to work but feels shaky, develops cramps in calf muscles.",
      "type": "material",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f6",
      "text": "PW3 asks accused from which bottle aspirin was given; accused shows aspirin bottle in dispensing room, denies any strychnine in stock, begins to tremble.",
      "type": "material",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f7",
      "text": "PW3 seals aspirin bottle from dispensing room, paper packet used by PW2, and unused packet.",
      "type": "procedural",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f8",
      "text": "PW2 removed to District Hospital, given stomach wash; condition precarious; statement recorded by PW7 (police officer); FIR under s.328 IPC registered (Ex. Ka.1); PW3 gives report (Ex. Ka.2) and sealed packets to PW7.",
      "type": "procedural",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f9",
      "text": "Investigation: Dispensing and store rooms inspected, stock register examined; no strychnine in dispensing room, but bottle containing 4.2 grams strychnine found in store room (Ex. Ka.8).",
      "type": "procedural",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f10",
      "text": "Chemical Examiner: Strychnine in PW2's stomach wash; traces of strychnine crystals in paper of consumed packet; unused packet contains only aspirin.",
      "type": "material",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f11",
      "text": "Symptoms developed by PW2 indicative of strychnine poisoning.",
      "type": "material",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f12",
      "text": "High Court findings: Accused brought two packets to PW2; accused dispensed medicine; no strychnine in dispensing room but in store room; accused falsely denied strychnine stock to PW3 and trembled.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Accused's statement in sessions court: PW2 told Badri for aspirin; accused told Badri packets ready, Badri to give; denies direct request or delivery; denies PW3 asked specifically about bottle used; denies denying strychnine stock.",
      "type": "disputed",
      "date": null,
      "source": "accused"
    },
    {
      "id": "f14",
      "text": "Accused suggests case due to grudge by PW3 (Dr. Baijal).",
      "type": "disputed",
      "date": null,
      "source": "accused"
    },
    {
      "id": "f15",
      "text": "Before Committal Court, accused falsely stated PW2 neither asked nor dispensed aspirin; claimed purias dispensed by hospital attendants.",
      "type": "disputed",
      "date": null,
      "source": "accused"
    },
    {
      "id": "f16",
      "text": "Sessions Court acquitted accused on perverse view, considering trivialities like why two purias, paper not mentioned in Ex.Ka.2, possibility via water, peons prepare mixtures, strychnine in other medicines, insufficient dose, no urgency.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f17",
      "text": "Allahabad High Court (15th January 1970) reversed acquittal, convicted accused under s.328 IPC in Government Appeal No.132 of 1967.",
      "type": "procedural",
      "date": "1970-01-15",
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether accused guilty under s.328 IPC of administering poison (strychnine) to PW2 with intent to cause hurt, based on circumstantial evidence.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether circumstantial evidence excludes every reasonable hypothesis of innocence and proves guilt beyond reasonable doubt.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Prosecution case built solely on circumstantial evidence; circumstances do not form a chain excluding innocence wholly; various 'maybes' possible (e.g., attender made packets, water contaminated, peons dispensed, etc.).",
      "supporting_facts": [
        "f13",
        "f14",
        "f15",
        "f16"
      ],
      "legal_basis": "Rule of circumstantial evidence: must exclude innocence and make guilt only inference; cited S.S. Robade v. State of Maharashtra and Kali Ram v. State of Himachal Pradesh"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Accused brought packets containing different substances from different bottles, showing guilty mind not accident; false denial of strychnine stock; trembled; motive and circumstances point to guilt.",
      "supporting_facts": [
        "f2",
        "f6",
        "f9",
        "f10",
        "f12"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Sessions Court erred in obsessing over fanciful possibilities and trivialities; court concerned with practical realities not fantastic chances.",
      "addresses_issue": "i1",
      "key_observation": "High Court correctly appraised evidence and found accused guilty."
    },
    {
      "id": "cr2",
      "text": "Circumstantial evidence rules: Links must form chain excluding innocence; proof beyond reasonable doubt not distorted by remote doubts; here, circumstances compel conclusion of guilt.",
      "addresses_issue": "i2",
      "key_observation": "Incontrovertible facts: Accused prepared poisonous medicine intentionally, had motive, falsely denied stock, trembled, changed pleas."
    },
    {
      "id": "cr3",
      "text": "Two packets from different bottles (one strychnine, one aspirin) shows no accidental mistake but guilty intent.",
      "addresses_issue": "i1",
      "key_observation": "Long time taken suggests fetching from store room."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Accused guilty under s.328 IPC; High Court conviction upheld.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Circumstantial evidence sufficient where chain excludes reasonable hypothesis of innocence.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "S. S. Robade v. State of Maharashtra",
      "citation": null,
      "treatment": "followed",
      "relevance": "Proof beyond reasonable doubt not distorted into acquittal on remote doubts."
    },
    {
      "case_name": "Kali Ram v. State of Himachal Pradesh",
      "citation": null,
      "treatment": "followed",
      "relevance": "Benefit of reasonable doubt to accused if arises."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "s. 328"
      ],
      "relevance": "Administering poison to cause hurt; accused convicted thereunder."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court dismisses appeal by special leave against Allahabad High Court conviction under s.328 IPC, upholding reversal of sessions court acquittal based on circumstantial evidence proving guilt.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"The circumstances must make so strong a mesh that the innocence of the accused is wholly excluded and on every reasonable hypothesis the guilt of the accused must be the only inference.\"",
      "speaker": "court",
      "significance": "States test for circumstantial evidence conviction."
    },
    {
      "text": "\"Link after link forged firmly by credible testimony may form a strong chain of sure guilt binding the accused.\"",
      "speaker": "court",
      "significance": "Explains chaining of circumstantial evidence."
    },
    {
      "text": "\"A court is not concerned with fantastic possibilities but with practical realities.\"",
      "speaker": "court",
      "significance": "Rejects sessions court's fanciful doubts."
    }
  ],
  "_case_id": "1974_87",
  "_label": 0,
  "_text_length": 15371,
  "_extracted_at": "2026-02-10T20:04:06.103543"
}