{
  "metadata": {
    "case_name": "Satyendra Nath Dutta & Anr. v. Ram Narain",
    "case_year": 1971,
    "court": "Supreme Court of India",
    "judges": [
      "Chandrachud J."
    ],
    "case_number": "Criminal Appeal No. 55 of 1971",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellants Satyendra Nath Dutta and Subhash Mauzumdar tried by Civil and Sessions Judge, Lucknow, for offences in connection with death of Nanhey Lal and injuries to his son Raj Kishore.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Satyendra Nath Dutta charged under section 302 and section 307 read with section 34 IPC; Subhash Mauzumdar charged under section 307 and section 302 read with section 34 IPC.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Sessions Judge acquitted the appellants.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f4",
      "text": "Ram Narain, brother of deceased Nanhey Lal, filed revision application in Allahabad High Court, Lucknow Bench, under section 439 CrPC (Criminal Revision No. 364 of 1966) challenging acquittal.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "State of U.P. wanted to file appeal against acquittal under section 417 CrPC but could not as record was missing.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "High Court allowed revision, set aside acquittal order dated 29th September 1970, and directed retrial by Sessions Court.",
      "type": "procedural",
      "date": "1970-09-29",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Deceased Nanhey Lal ran grocery shop at Hewett Road, Lucknow; Pan shop of Hari Sharma Shukla short distance away.",
      "type": "background",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f8",
      "text": "On September 4, 1965, around 11 p.m., Nanhey Lal, brother Ram Narain, sons Raj Kishore and Bijay Kishore, and relation Sheetal Prasad were chatting.",
      "type": "material",
      "date": "1965-09-04",
      "source": "prosecution"
    },
    {
      "id": "f9",
      "text": "Ram Narain sent Raj Kishore to fetch Pan from Hari Sharma's shop; appellant Subhash gave cane blow to Raj Kishore.",
      "type": "material",
      "date": "1965-09-04",
      "source": "prosecution"
    },
    {
      "id": "f10",
      "text": "On hearing shouts, Nanhey Lal went to Pan shop; appellant Satyendra Nath Dutta snatched cane from Subhash.",
      "type": "material",
      "date": "1965-09-04",
      "source": "prosecution"
    },
    {
      "id": "f11",
      "text": "Nanhey Lal tried to disarm Satyendra; Subhash caught hold of Nanhey Lal, facilitating knife attack by Satyendra on Nanhey Lal.",
      "type": "material",
      "date": "1965-09-04",
      "source": "prosecution"
    },
    {
      "id": "f12",
      "text": "Raj Kishore intervened; Subhash gave him two knife blows.",
      "type": "material",
      "date": "1965-09-04",
      "source": "prosecution"
    },
    {
      "id": "f13",
      "text": "Nanhey Lal succumbed to injuries at about 5 a.m. on September 5, 1965.",
      "type": "material",
      "date": "1965-09-05",
      "source": "prosecution"
    },
    {
      "id": "f14",
      "text": "Prosecution examined five eye-witnesses: Ram Narain, Barati Lal, Bijay Kishore, Kallu, Raj Kishore.",
      "type": "procedural",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f15",
      "text": "Prosecution relied on cycle taken on hire by Subhash found at scene of occurrence.",
      "type": "material",
      "source": "prosecution"
    },
    {
      "id": "f16",
      "text": "Sessions Judge rejected eye-witness evidence for various reasons: Raj Kishore's hospital statement (2:30 p.m. Sept 5) omitted Ram Narain but included Sheetal Prasad; Ram Narain did not take injured to hospital, Bijay Kishore (12-13 years) did; FIR by Ram Narain mentioned Ram Narain and Bijay Kishore but inconsistencies; Barati Lal chance witness with unnatural conduct; Kallu rickshaw puller, frequent police witness; no medical corroboration for Raj Kishore's cane blow injury examined within half hour; cycle recovered from Bengali Sweet House, not Pan shop; no identification parade held.",
      "type": "disputed",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f17",
      "text": "Sessions Judge held there was dying declaration of Nanhey Lal recorded but suppressed; High Court found no admissible evidence for this.",
      "type": "disputed",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f18",
      "text": "High Court dismissed need for identification parade as appellants did not ask for it and found witnesses knew appellants.",
      "type": "disputed",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether High Court in exercise of revisional jurisdiction under section 439 CrPC at instance of private complainant can set aside acquittal and order retrial by re-appreciating evidence.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Scope of High Court's revisional powers under section 439(4) CrPC vis-a-vis section 417 CrPC appeals against acquittal.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "High Court transgressed limits of revisional jurisdiction by re-appreciating evidence of eye-witnesses, blaming accused for no identification parade, and wrongly assuming Sessions Court's dying declaration finding based on inadmissible evidence.",
      "supporting_facts": [
        "f3",
        "f16",
        "f17",
        "f18"
      ],
      "legal_basis": "Section 439(4) CrPC; precedents like D. Stephens, Logendranath Jha, K. Chinnaswamy Reddy"
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Revisional jurisdiction under section 439 CrPC ought not be exercised lightly by private complainant against acquittal appealable by State under section 417; only in exceptional cases of manifest illegality or gross miscarriage of justice.",
      "addresses_issue": "i1",
      "key_observation": "High Court cannot reappraise evidence or direct retrial based on re-appraisal."
    },
    {
      "id": "cr2",
      "text": "High Court erred in entering into evidence details, despite awareness of limitations; Sessions Court's acquittal based on critical examination of eye-witnesses, not just dying declaration.",
      "addresses_issue": "i2",
      "key_observation": "No manifest illegality or miscarriage of justice in Sessions Court's order."
    },
    {
      "id": "cr3",
      "text": "Cited precedents illustrate exceptional cases: lack of jurisdiction, exclusion of admissible evidence, reliance on inadmissible, overlooking material evidence; none apply here.",
      "addresses_issue": "i1",
      "key_observation": "High Court fell into error corrected in prior decisions."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "High Court cannot in revisional jurisdiction invoked by private complainant reverse acquittal or direct retrial by re-appreciating evidence absent manifest illegality or gross miscarriage of justice.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Section 439(4) CrPC prohibits High Court from converting acquittal to conviction; retrial order based on evidence re-appraisal is invalid.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "D. Stephens v. Nosibolla",
      "citation": "1951 SCR 284",
      "treatment": "followed",
      "relevance": "Revisional jurisdiction not to be exercised lightly by private complainant; only for manifest illegality or gross miscarriage."
    },
    {
      "case_name": "Logendranath Jha v. Polailal Biswas",
      "citation": "1951 SCR 676",
      "treatment": "followed",
      "relevance": "High Court cannot reappraise evidence and direct retrial in revision against acquittal."
    },
    {
      "case_name": "K. Chinnaswamy Reddy v. State of Andhra Pradesh",
      "citation": "1963 3 SCR 412",
      "treatment": "followed",
      "relevance": "Revisional powers in exceptional cases like glaring defect, manifest error, or flagrant miscarriage; examples given."
    },
    {
      "case_name": "Mahendra Pratap Singh v. Sarju Singh",
      "citation": "1968 2 SCR 287",
      "treatment": "followed",
      "relevance": "High Court wrong in entering minute details of evidence in revision."
    },
    {
      "case_name": "Khetrabasi Samal v. State of Orissa",
      "citation": "1970 1 SCR 880",
      "treatment": "followed",
      "relevance": "High Court cannot set aside acquittal by disbelieving witnesses on re-appraisal."
    }
  ],
  "statutes_cited": [
    {
      "name": "Code of Criminal Procedure, 1898",
      "sections": [
        "417",
        "439",
        "423"
      ],
      "relevance": "Section 417: State appeal against acquittal; Section 439: Revisional powers, sub-s(4) prohibits converting acquittal to conviction; Section 423: Appellate powers."
    },
    {
      "name": "Indian Penal Code",
      "sections": [
        "302",
        "307",
        "34"
      ],
      "relevance": "Charges against appellants for murder, attempt to murder with common intention."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Supreme Court allowed the appeal by special leave, set aside the High Court's judgment ordering retrial, and restored the Sessions Court's order of acquittal, holding that the High Court transgressed the limits of its revisional jurisdiction under section 439(4) CrPC.",
    "relief_granted": "Acquittal restored",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "the revisional jurisdiction conferred by section 439 of the Code ought not to be exercised lightly when it is invoked by a private complainant against an order of acquittal which could have been appealed against by the Government under section 417.",
      "speaker": "court",
      "significance": "Defines limits of revisional jurisdiction against acquittal."
    },
    {
      "text": "the High Court has thus transgressed the narrow limits of its revisional jurisdiction under section 439(4) of the Code of Criminal Procedure.",
      "speaker": "court",
      "significance": "Core holding on High Court's error."
    }
  ],
  "_case_id": "1974_316",
  "_label": 1,
  "_text_length": 14861,
  "_extracted_at": "2026-02-10T20:06:12.169902"
}