{
  "metadata": {
    "case_name": "Appellant v. State of Tamil Nadu & Ors.",
    "case_year": 1974,
    "court": "Supreme Court of India",
    "judges": [
      "ALAGIRISWAMI, J."
    ],
    "case_number": "Civil Appeal No. 1131 of 1974",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant entered service as a Junior Engineer in the Highways Department of the then Province of Madras on 21-8-1946.",
      "type": "background",
      "date": "1946-08-21",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Appellant was promoted as an Assistant Engineer on 12-3-1951.",
      "type": "background",
      "date": "1951-03-12",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "In 1955 appellant was selected by the State Public Service Commission as an Assistant Engineer along with respondents 2 to 4 and was placed above them in rank.",
      "type": "background",
      "date": "1955",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "In 1957 the 2nd respondent was promoted as Divisional Engineer by relaxing the relevant rules regarding the length of service necessary for promotion.",
      "type": "material",
      "date": "1957",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Appellant made a representation to the Government upon 2nd respondent's promotion in 1957 and made another representation in the same year.",
      "type": "procedural",
      "date": "1957",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Appellant made two further representations in 1968 to consider his case for promotion as Superintending Engineer along with his juniors.",
      "type": "procedural",
      "date": "1968",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Respondents 2 to 4 were promoted as Superintending Engineers over the head of the appellant.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "In 1970 the 5th respondent who was junior to the appellant as Assistant Engineer and Divisional Engineer was promoted as Superintending Engineer over the head of the appellant.",
      "type": "material",
      "date": "1970",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Appellant was promoted as Superintending Engineer on 23-1-1971.",
      "type": "background",
      "date": "1971-01-23",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Appellant filed a writ petition before the High Court of Madras which was dismissed, as also the appeal against the dismissal (Judgment Order dated 5th February, 1974 in W. Appeal No. 67/1974).",
      "type": "procedural",
      "date": "1974-02-05",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Main grievance of the appellant is that the 2nd respondent who was junior to him as Assistant Engineer was promoted as Divisional Engineer in 1957 by relaxing rules and that his claim for similar relaxation was not considered.",
      "type": "disputed",
      "date": "1957",
      "source": "petitioner"
    },
    {
      "id": "f12",
      "text": "Learned Judge of Madras High Court viewed relaxation in favour of 2nd respondent without considering appellant's case as arbitrary, but Government stated it was only for overseas scholars, not controverted.",
      "type": "disputed",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Respondents 3 and 4 who were juniors became Divisional Engineers in 1957 on merits over appellant's head.",
      "type": "material",
      "date": "1957",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the appellant's claim challenging the 1957 relaxation of rules for promotion of junior (2nd respondent) as Divisional Engineer without considering appellant's case can be entertained in 1971 due to inordinate delay.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the courts should exercise extraordinary powers under Article 226 in cases of stale claims where petitioner stood by and allowed promotions to happen.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Relaxation of rules in favour of 2nd respondent (junior) for promotion as Divisional Engineer in 1957 without considering appellant's case for similar relaxation.",
      "supporting_facts": [
        "f3",
        "f4",
        "f11"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Such relaxation was given only in the case of overseas scholars.",
      "supporting_facts": [
        "f12"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Government decided as a matter of policy not to relax rules except for overseas scholars.",
      "supporting_facts": [
        "f12"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Cannot agree with High Court Judge's view of arbitrariness in relaxation as Government statement that it was only for overseas scholars not controverted.",
      "addresses_issue": "i1",
      "key_observation": "Relaxation justified for overseas scholars."
    },
    {
      "id": "cr2",
      "text": "Appellant should have approached court in 1957 after representations failed, or when resp 3-4 promoted as DE, or when resp 2-4 promoted as SE; delay of 14 years bars relief; cannot unscramble scrambled egg.",
      "addresses_issue": "i1",
      "key_observation": "Inordinate delay and laches; person should approach within 6 months to a year."
    },
    {
      "id": "cr3",
      "text": "Conditions of 1957 cannot be reproduced now; pointless to direct reconsideration as policy now excludes non-overseas scholars.",
      "addresses_issue": "i1",
      "key_observation": "Government entitled to policy decision."
    },
    {
      "id": "cr4",
      "text": "Sound exercise of discretion to refuse Article 226 powers for non-expeditious approaches that unsettle settled matters; petition should be dismissed in limine.",
      "addresses_issue": "i2",
      "key_observation": "No limitation but laches apply; entertaining such petitions wastes court time."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Courts should refuse to exercise powers under Article 226 for stale claims where petitioner does not approach expeditiously and allows things to happen, trying to unsettle settled matters.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Appellant's petition dismissed due to inordinate delay from 1957 events.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Article 226"
      ],
      "relevance": "Courts' extraordinary powers under Article 226 to be exercised judiciously, refusing relief for delayed stale claims."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court dismissed the appeal, upholding the Madras High Court's dismissal of the writ petition, holding that the appellant's challenge to the 1957 promotion relaxation was barred by inordinate delay and laches, and it would be futile to direct reconsideration now.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "In effect he wants to unscramble a scrambled egg.",
      "speaker": "court",
      "significance": "Illustrates futility of challenging old promotions after long delay."
    },
    {
      "text": "A person aggrieved by an order of promoting a junior over his head should approach the Court at least within six months or at the most a year of such promotion.",
      "speaker": "court",
      "significance": "Sets guideline on timeliness for service promotion challenges."
    },
    {
      "text": "It would be a sound and wise exercise of discretion for the Courts to refuse to exercise their extra-ordinary powers under Article 226 in the case of persons who do not approach it expeditiously for relief and who stand by and allow things to happen and then approach the Court to put forward stale claims and try to unsettle settled matters.",
      "speaker": "court",
      "significance": "Core holding on doctrine of laches in writ jurisdiction."
    }
  ],
  "_case_id": "1974_445",
  "_label": 0,
  "_text_length": 5057,
  "_extracted_at": "2026-02-10T20:06:42.726264"
}