{
  "metadata": {
    "case_name": "Appellants v. Respondent No. 1 (Haji Mohamad, Haji Dada Wakf Trust)",
    "case_year": 1970,
    "court": "Supreme Court of India",
    "judges": [
      "MATHEW, J."
    ],
    "case_number": "Civil Appeal No. 1915 of 1970",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The suit premises consisted of a building known as Abdul Ratman Manzil and it belonged to Haji Mohamad, Haji Dada Wakf Trust.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The building was leased to Osman Jamal and Company under a rent note dated January 15, 1947.",
      "type": "background",
      "date": "1947-01-15",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "In or about the year 1951, the firm of Osman Jamal and Company was wound up and the appellants took the premises on rent on a monthly rent of Rs. 320/-.",
      "type": "background",
      "date": "1951",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The appellants sub-let the premises while the Saurashtra Rent Control Act, 1951 was in force.",
      "type": "disputed",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The Saurashtra Rent Control Act, 1951 was repealed on December 31, 1963.",
      "type": "procedural",
      "date": "1963-12-31",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The Bombay Rents, Hotel and Lodging House Rates Control Act, 1947 was made applicable to the area on January 1, 1964.",
      "type": "procedural",
      "date": "1964-01-01",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "The respondent purported to terminate the tenancy by a notice dated February 12, 1964 on the ground of default in rent and sub-letting.",
      "type": "procedural",
      "date": "1964-02-12",
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "At trial, plea of default in rent given up; sole issue was sub-letting.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Trial court held contract of tenancy contained no prohibition against sub-letting and dismissed the suit.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "District Judge, Jamnagar allowed respondent's appeal, held s.15 Saurashtra Act superseded contract, right to possession under s.13(1)(e), survived repeal.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Appellants filed revision in Gujarat High Court, Revision Appln. No. 371 of 1966.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f12",
      "text": "Gujarat High Court Division Bench by judgment dated 2nd/3rd March, 1970 confirmed decree for ejectment, holding accrued right under s.51 proviso 2 Bombay Act.",
      "type": "procedural",
      "date": "1970-03-02",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Appeal by special leave to Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the High Court was right in dismissing the revision petition and upholding the decree for possession on ground of sub-letting.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the landlord is entitled to maintain a suit for recovery of possession under s.13(1)(e) of the Bombay Rent Act as applied to Gujarat on 31 Dec 1963, where sub-letting was during Saurashtra Act, but notice and suit after repeal.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether landlord had accrued right or privilege under s.51 proviso Bombay Act to recover possession despite repeal of Saurashtra Act without prior notice.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Under the contract of lease, appellants had right to sub-let; respondent not entitled to possession.",
      "supporting_facts": [
        "f3",
        "f9"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "No accrued right to recover possession without notice terminating tenancy before repeal of Saurashtra Act; notice under TP Act sine qua non.",
      "supporting_facts": [
        "f7",
        "f5"
      ],
      "legal_basis": "Transfer of Property Act; s.51 Bombay Act"
    },
    {
      "id": "pa3",
      "text": "Sub-letting before Bombay Act; s.13(1)(e) Bombay Act inapplicable as not 'unlawfully' sub-let post its operation.",
      "supporting_facts": [
        "f4",
        "f6"
      ],
      "legal_basis": "s.13(1)(e) Bombay Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "s.15 Saurashtra Act prohibited sub-letting notwithstanding contract; superseded tenancy contract.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": "s.15, s.13(1)(e) Saurashtra Act"
    },
    {
      "id": "ra2",
      "text": "Repeal did not affect accrued right under s.51 proviso 2 Bombay Act; suit maintainable.",
      "supporting_facts": [
        "f5",
        "f10"
      ],
      "legal_basis": "s.51 proviso 2 Bombay Act"
    },
    {
      "id": "ra3",
      "text": "Even if no accrued right, at least a privilege to terminate tenancy survived repeal.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "s.51 proviso Bombay Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Saurashtra Act s.15 unconditionally prohibited sub-letting; s.13(1)(e) entitled landlord to possession without need for prior notice under TP Act.",
      "addresses_issue": "i1",
      "key_observation": "No notice required under Saurashtra Act to terminate tenancy for sub-letting."
    },
    {
      "id": "cr2",
      "text": "Right to recover possession accrued on sub-letting during Saurashtra Act; survives repeal under s.51 proviso 2 Bombay Act.",
      "addresses_issue": "i2",
      "key_observation": "Accrued right upon happening of event (sub-letting), no further notice needed."
    },
    {
      "id": "cr3",
      "text": "Under TP Act, sub-letting not ground for forfeiture unless contract prohibits; but Saurashtra Act overrides, no notice needed.",
      "addresses_issue": "i3",
      "key_observation": "Landlord could not terminate under TP Act as contract allowed sub-let."
    },
    {
      "id": "cr4",
      "text": "Cited precedents distinguish accrued rights from mere expectations; right here accrued on sub-let.",
      "addresses_issue": "i3",
      "key_observation": "Privilege to terminate exists but right to possession accrues directly under s.13(1)(e)."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Suit for possession under s.13(1)(e) Saurashtra Act maintainable post-repeal based on sub-letting during its currency.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "No notice under TP Act required; right accrues on sub-letting under Saurashtra Act and survives repeal.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Bombay Act s.13(1)(e) inapplicable as sub-let pre its operation.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Hamilton Coll v. While",
      "citation": "1922 2 K.B. 422",
      "treatment": "followed",
      "relevance": "Provisions preserve specific rights upon events, not abstract rights."
    },
    {
      "case_name": "Abbott v. Minister of Lands",
      "citation": "1895 A.C. 425",
      "treatment": "followed",
      "relevance": "Mere right to take advantage of repealed Act not accrued right."
    },
    {
      "case_name": "Director of Public Works v. Ho Po Sang",
      "citation": "1961 A.C. 901",
      "treatment": "followed",
      "relevance": "Distinction between investigation of right vs. whether right exists; former preserved."
    },
    {
      "case_name": "Free Lanka Insurance Co. Ltd. v. Ranasinghe",
      "citation": "1964 A.C. 541",
      "treatment": "referred",
      "relevance": "Inchoate or contingent right may be accrued if more than hope."
    }
  ],
  "statutes_cited": [
    {
      "name": "Saurashtra Rent Control Act, 1951",
      "sections": [
        "s.15",
        "s.13(1)(e)"
      ],
      "relevance": "Prohibited sub-letting unconditionally; entitled landlord to possession on sub-let; right accrued survives repeal."
    },
    {
      "name": "Bombay Rents, Hotel and Lodging House Rates Control Act, 1947",
      "sections": [
        "s.13(1)(e)",
        "s.51 proviso 2"
      ],
      "relevance": "Repealed Saurashtra Act but preserved accrued rights; s.13(1)(e) inapplicable to pre-operation sub-let."
    },
    {
      "name": "Transfer of Property Act",
      "sections": [
        "s.111"
      ],
      "relevance": "Sub-letting not ground for forfeiture unless contract prohibits; no notice possible here."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court dismissed the appeal, upholding the Gujarat High Court and District Judge decrees for possession in favor of the landlord on ground of sub-letting during Saurashtra Act, as right accrued and survived repeal under Bombay Act s.51 proviso 2.",
    "relief_granted": "Decree for possession of suit premises to respondent No.1.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"the right of a landlord to recover possession on the ground that the tenant has sub-let the premises is an accrued right before the issue of a notice, if under any law it was necessary for the landlord to issue the notice to determine the tenancy on the ground of sub-letting.\"",
      "speaker": "court",
      "significance": "Court rejects need for prior notice under TP Act."
    },
    {
      "text": "\"a right accrued to the landlord to recover possession under s.13(1) of the Saurashtra Act when the tenant sub-let the premises during the currency of that Act and the right survived the repeal.\"",
      "speaker": "court",
      "significance": "Core holding on survival of accrued right post-repeal."
    },
    {
      "text": "\"It may be, therefore, that under some repealed enactment a right has been given but that in respect of it some investigation or legal proceeding is necessary. The right is then unaffected and preserved... But there is a manifest distinction between an investigation in respect of a right and an investigation which is to decide whether some right should or should not be given.\"",
      "speaker": "court",
      "significance": "Quote from Ho Po Sang explaining preservation of accrued rights."
    }
  ],
  "_case_id": "1974_203",
  "_label": 0,
  "_text_length": 19198,
  "_extracted_at": "2026-02-10T20:05:34.622278"
}