{
  "metadata": {
    "case_name": "Writ Petition No. 2371 of 1974",
    "case_year": 1974,
    "court": "Supreme Court of India",
    "judges": [
      "BHAGWATI, J."
    ],
    "case_number": "Writ Petition No. 2371 of 1974",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Order of detention dated 30th March, 1973 made by the District Magistrate, Nadia under section 3(1) of the Maintenance of Internal Security Act, 1971, reciting satisfaction that with a view to preventing the petitioner from acting in any manner prejudicial to the maintenance of public order it was necessary to detain him.",
      "type": "material",
      "date": "1973-03-30",
      "source": "lower_court"
    },
    {
      "id": "f2",
      "text": "Petitioner arrested on 3rd April, 1973; at the time of arrest, grounds of detention dated 30th March, 1973 served upon him together with their translation in Bengalee language.",
      "type": "procedural",
      "date": "1973-04-03",
      "source": "lower_court"
    },
    {
      "id": "f3",
      "text": "Grounds of detention set out one incident of dacoity committed by petitioner in a third class compartment of a running train where cash money was stolen, on the basis of which District Magistrate reached subjective satisfaction.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f4",
      "text": "Usual ritual prescribed by the Act followed: order approved by State Government, representation of petitioner considered and rejected, case placed before Advisory Board, opinion received, order confirmed by State Government.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "Present petition filed by petitioner from jail challenging validity of detention.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "In paragraph 4 of affidavit-in-reply, District Magistrate stated he was bona fide satisfied from materials that detention necessary to prevent acting prejudicial to public order, and further satisfied that if not detained, petitioner likely to act prejudicial to maintenance of supplies and services essential to the community.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the order of detention is invalid due to lack of nexus between the grounds of detention (dacoity incident) and the subjective satisfaction of the District Magistrate that detention was necessary to prevent petitioner from acting prejudicial to maintenance of supplies and services essential to the community.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether the averment in paragraph 4 of the District Magistrate's affidavit-in-reply regarding satisfaction as to supplies and services should be disregarded as a mistake.",
      "framed_by": "respondent"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "There was no nexus at all between the grounds of detention communicated to the petitioner and the subjective satisfaction of the District Magistrate that it was necessary to detain the petitioner with a view to preventing him from acting in any manner prejudicial to the maintenance of supplies and services essential to the community; order based inter alia on such satisfaction is invalid.",
      "supporting_facts": [
        "f3",
        "f6"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Incident of dacoity in third class compartment of running train where cash money stolen wholly irrelevant to support subjective satisfaction regarding supplies and services; impossible for rational human being to infer likelihood of acting prejudicial to supplies and services.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Averment in paragraph 4 of affidavit-in-reply that District Magistrate satisfied petitioner likely to act prejudicial to supplies and services crept in through mistake and should not be taken into account; only subjective satisfaction was for public order as recited in order and grounds.",
      "supporting_facts": [
        "f1",
        "f3"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Affidavit-in-reply made by District Magistrate himself with sense of responsibility; must presume statements correct; burden heavy on party alleging contrary; cannot lightly accept incorrect statement without subsequent correcting affidavit by District Magistrate explaining mistake.",
      "addresses_issue": "i2",
      "key_observation": "No subsequent affidavit confessing mistake; accept para 4 averment as correct."
    },
    {
      "id": "cr2",
      "text": "Order based not only on satisfaction re public order but also re supplies and services; solitary ground of dacoity wholly irrelevant to support latter satisfaction, which could not be founded upon it and was colourable and no satisfaction at all.",
      "addresses_issue": "i1",
      "key_observation": "Dacoity for theft of money in train compartment cannot rationally support inference of prejudice to supplies and services."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Order of detention invalid since based on subjective satisfaction regarding supplies and services not supported by grounds of detention.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Maintenance of Internal Security Act, 1971",
      "sections": [
        "Section 3(1)"
      ],
      "relevance": "Authority for detention order to prevent acting prejudicial to public order or supplies and services."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 32"
      ],
      "relevance": "Basis for writ petition challenging detention."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Petition allowed, rule made absolute; order of detention held invalid; petitioner directed to be set at liberty forthwith.",
    "relief_granted": "Petitioner set at liberty forthwith",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"I was also further satisfied that if the detenu petitioner is not detained under the said Act he is likely to act in a manner prejudicial to the maintenance of supplies and services essential to the community.\"",
      "speaker": "lower_court",
      "significance": "Key averment in DM's affidavit establishing dual basis for satisfaction, mismatch with grounds."
    },
    {
      "text": "We must, therefore, accept the averment made by the District Magistrate in paragraph 4 of his affidavit-in-reply as correct and proceed on the basis that the order of detention was based not only on his subjective satisfaction that the petitioner would be likely to act in a manner prejudicial to the maintenance of public order but also on his further subjective satisfaction that it was necessary to detain the petitioner with a view to preventing him from acting in any manner prejudicial to the maintenance of supplies and services essential to the community.",
      "speaker": "court",
      "significance": "Court's refusal to disregard affidavit; basis for invalidating order."
    },
    {
      "text": "We, therefore, allow the petition and make the rule absolute and direct that the petitioner be set at liberty forthwith.",
      "speaker": "court",
      "significance": "Final operative order quashing detention."
    }
  ],
  "_case_id": "1974_336",
  "_label": 1,
  "_text_length": 9193,
  "_extracted_at": "2026-02-10T20:06:06.609123"
}