{
  "metadata": {
    "case_name": "Govindan (First Defendant-Appellant) v. Plaintiffs (Respondents)",
    "case_year": 1967,
    "court": "Supreme Court of India",
    "judges": [
      "Mathew, J."
    ],
    "case_number": "Civil Appeal No. 1887 of 1967",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Dr. Krishnan went to England in 1920 for higher studies in medicine. His father helped initially, then elder brother Padmanabhan stopped sending money after father's death.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Krishnan received financial help from Miss Hepworth, set up practice at Sheffield, purchased house at 75 Woodhouse Road, Sheffield, lived at 97 Prince of Wales Road with Miss Hepworth, had private secretary Mary Woodliff.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "First defendant (Govindan, Krishnan's brother) went to England end of 1949 for F.R.C.S. and to bring Krishnan back, but Krishnan did not return. Krishnan died intestate on October 18, 1950 in England, no wife or children.",
      "type": "material",
      "date": "1950-10-18",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Krishnan's assets in England: house at 75 Woodhouse Road, Sheffield, valuable movables and moneys. Family partition allotted share to Krishnan, managed by Padmanabhan till his death. Properties in Schedules A and B.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Suit for partition instituted, originally Schedules A and B. Defendants 22 and 23 (Arksey and Mary Woodliff) impleaded in 1953 as administrators appointed by English High Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Appellant executed power of attorney to Arksey and Woodliff for letters of administration. They obtained originating summons for domicile question. Ex. 56 order: Krishnan domiciled in England.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "House and movables sold, proceeds (Schedule C) handed to defendants 1 and 2 on indemnity bond. Plaint amended to include Schedule C.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Trial court held Krishnan not domiciled in England, Ex. 56 obtained by fraud, opposed to natural justice, not res judicata; partition per Travancore Ezhava Act including Schedule C.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Kerala High Court confirmed trial court on domicile, fraud, natural justice; modified: house proceeds to next of kin (1st and 2nd defendants) per English law situs.",
      "type": "procedural",
      "date": "1963-12-20",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Letters by Krishnan (1932-1949) expressing intention to return to India after studies, see mother, get share, but postponed repeatedly.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f11",
      "text": "Post-1939 letters by Krishnan and Govindan indicate reluctance to return, attachment to practice, Miss Hepworth.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f12",
      "text": "Miss Hepworth's letters (post-death): Krishnan repeatedly said he would never return to India.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Notices of English proceedings served on all parties including minors' natural guardians; guardians appeared personally but not for minors; court appointed official solicitor as guardian ad litem.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Affidavits and evidence in English court from administrators, Miss Hepworth, others supporting English domicile.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether Ex. 56 order of English High Court declaring Krishnan domiciled in England operates as res judicata.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether Krishnan died domiciled in England.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether Ex. 56 order was obtained by fraud.",
      "framed_by": "court"
    },
    {
      "id": "i4",
      "text": "Whether proceedings leading to Ex. 56 were opposed to natural justice, particularly regarding minors.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Courts below erred by not first considering if English judgment binding; no pleading/evidence of fraud or violation of natural justice; all parties served, represented; minors had official solicitor; no evidence deceased domiciled in India; witnesses said no intention to return.",
      "supporting_facts": [
        "f13",
        "f14"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Judgment declaring domicile is in rem, binding on world, no need for submission to jurisdiction.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": "Order 11 RSC England"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Concurrent findings: deceased intended to return to India; no change of domicile; minors did not submit to English jurisdiction; official solicitor appointment formal, not proper guardian understanding interests; opposed to natural justice; fraud under s.13 CPC by appellant misguiding attorneys.",
      "supporting_facts": [
        "f10",
        "f13"
      ],
      "legal_basis": "s.13 CPC"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "No fraud in obtaining Ex.56: administrators, Miss Hepworth etc. competent witnesses with no motive to lie; appellant's letters not conclusive of fraud; fraud must be extrinsic, not mere mistake or re-trial of merits.",
      "addresses_issue": "i3",
      "key_observation": "No evidence administrators tricked court or adduced false evidence knowingly."
    },
    {
      "id": "cr2",
      "text": "No opposition to natural justice: notices served on natural guardians; they appeared personally but not for minors; court appointed official solicitor; substantial compliance with fair play.",
      "addresses_issue": "i4",
      "key_observation": "Minors given opportunity through guardians."
    },
    {
      "id": "cr3",
      "text": "Ex.56 not res judicata for minors as no submission to jurisdiction; English court assumed jurisdiction over absentees under Order 11 RSC, not recognized internationally.",
      "addresses_issue": "i1",
      "key_observation": "Minors did not submit; guardians did not appear for them."
    },
    {
      "id": "cr4",
      "text": "On merits, Krishnan acquired domicile of choice in England: conduct (practice, house purchase, life with Hepworth), post-1939 declarations to Hepworth true; letters to family interested to extract income, not fortified by acts.",
      "addresses_issue": "i2",
      "key_observation": "Reliance on conduct over declarations; intention changed after 1939."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Foreign judgment not res judicata if obtained by fraud or opposed to natural justice; fraud must mislead court extrinsic to merits.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Ex.56 valid and res judicata for majors who submitted; invalid for minors lacking jurisdiction.",
      "resolves_issue": "i1",
      "in_favor_of": "partial"
    },
    {
      "id": "h3",
      "text": "Krishnan domiciled in England at death.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h4",
      "text": "Succession to movables and moneys (Schedule C minus house proceeds) governed by English law; distributed to first and second defendants (next of kin) equally.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Abouloff v. Oppenheimer",
      "citation": "1882 10 Q.B.D. 295",
      "treatment": "followed",
      "relevance": "Foreign judgment impeachable for fraud if court misled by evidence not in issue before it."
    },
    {
      "case_name": "Vadala v. Lawes",
      "citation": "1890 25 Q.B.D. 310",
      "treatment": "followed",
      "relevance": "Fraud allowing re-trial of merits if necessary to prove misleading by false evidence."
    },
    {
      "case_name": "Syal v. Heyward",
      "citation": "1948 2 All E.R. 576",
      "treatment": "followed",
      "relevance": "Broad scope for proving fraud on court even retrying merits."
    },
    {
      "case_name": "Duchess of Kingston's Case",
      "citation": null,
      "treatment": "referred",
      "relevance": "Distinction between mistake and trickery in fraud vitiating judgment."
    },
    {
      "case_name": "Bell v. Kennedy",
      "citation": "1868 L.R. 1 Sc. Div. 307",
      "treatment": "referred",
      "relevance": "Domicile involves intention inferred from acts."
    },
    {
      "case_name": "Travers v. Holley",
      "citation": "1953 2 All E.R. 794",
      "treatment": "distinguished",
      "relevance": "Reciprocity in jurisdiction for matrimonial status, not general."
    },
    {
      "case_name": "Buchanan v. Rucker",
      "citation": "1808 9 East 192",
      "treatment": "followed",
      "relevance": "Judgment against absentee without jurisdiction is nullity."
    },
    {
      "case_name": "Schibsby v. Westenholz",
      "citation": "1870 L.R. 6 Q.B. 155",
      "treatment": "followed",
      "relevance": "No duty to appear unless connection to forum."
    }
  ],
  "statutes_cited": [
    {
      "name": "Code of Civil Procedure, 1908",
      "sections": [
        "Section 13",
        "Order 32"
      ],
      "relevance": "Foreign judgment not conclusive if by fraud or opposed to natural justice; appointment of guardian for minors."
    },
    {
      "name": "Travancore Ezhava Act",
      "sections": [],
      "relevance": "Governs succession if Indian domicile."
    },
    {
      "name": "Indian Evidence Act, 1872",
      "sections": [
        "Section 41"
      ],
      "relevance": "Judgments in rem in specified jurisdictions conclusive."
    },
    {
      "name": "Supreme Court Rules (England)",
      "sections": [
        "Order 11"
      ],
      "relevance": "Originating summons for domicile; jurisdiction over absentees."
    },
    {
      "name": "Foreign Judgments (Reciprocal Enforcement) Act, 1933 (UK)",
      "sections": [
        "s.2(1)",
        "s.4(1)(a)(iv)"
      ],
      "relevance": "Registration and setting aside foreign judgments."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed: Ex.56 not res judicata for minors but Krishnan held domiciled in England on merits; succession to movables/moneys in Schedule C (excluding Sheffield house proceeds) governed by English law, divided equally between first and second defendants; house proceeds per English law to them; High Court judgment upheld only on house, set aside otherwise.",
    "relief_granted": "Partition of Schedule C movables per English law to appellant (first defendant) and second defendant equally.",
    "costs": "No order as to costs."
  },
  "key_quotes": [
    {
      "text": "\"It is a well established principle of private international law that if a foreign judgment was obtained by fraud, or if the proceedings in which it was obtained were opposed to natural justice, it will not operate as res judicata.\"",
      "speaker": "court",
      "significance": "Core rule applied to Ex.56 order."
    },
    {
      "text": "\"Domicile is a mixed question of law and fact... more reliance is placed upon conduct than upon declaration intention.\"",
      "speaker": "court",
      "significance": "Basis for finding English domicile from acts over letters."
    },
    {
      "text": "\"Can the island of Tobago pass a law to bind the rights of the whole world?\"",
      "speaker": "court",
      "significance": "Illustrates nullity of judgments without international jurisdiction (Lord Ellenborough)."
    }
  ],
  "_case_id": "1974_127",
  "_label": 1,
  "_text_length": 61192,
  "_extracted_at": "2026-02-10T20:04:15.673290"
}