{
  "metadata": {
    "case_name": "Appellant Company v. Respondent Workman",
    "case_year": 1972,
    "court": "Supreme Court of India",
    "judges": [
      "GOSWAMI, J."
    ],
    "case_number": "Civil Appeal No. 1764 of 1972",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The respondent was in employment under the appellant company at the Tiruchirapalli Branch as a typewriter mechanic since 1950.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The charges against the respondent were that he was absent on November 2, 1970, without leave and without sufficient cause.",
      "type": "disputed",
      "date": "1970-11-02",
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "The second charge was that on November 2, 1970, the respondent was privately doing some repair work of a typewriter in the premises belonging to the Eswari Institute of Commerce, Tiruchirapalli.",
      "type": "disputed",
      "date": "1970-11-02",
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "The respondent was directed to show cause on November 17, 1970 and was placed under suspension.",
      "type": "procedural",
      "date": "1970-11-17",
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "After receipt of his reply to the charge-sheet, a domestic enquiry was held in which witnesses were examined. The respondent examined only himself and the appellant examined three witnesses including the Manager of the Tiruchirapalli Branch and the company's doctor.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The Enquiry Officer found both the charges to be established and on receipt of his report the management passed an order of dismissal on December 29, 1970.",
      "type": "material",
      "date": "1970-12-29",
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "Since an industrial dispute was pending at the relevant time, the management submitted an application to the Industrial Tribunal, Madras, for approval of the order of dismissal under section 33(2)(b) of the Industrial Disputes Act, 1947.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "The respondent took the plea before the Tribunal that he was a protected workman and hence his dismissal was illegal in the absence of prior permission from the Tribunal under section 33(3) of the I.D. Act.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f9",
      "text": "The Tribunal refused to accept the plea that the respondent was a protected workman and approved the order of dismissal by its order dated February 18, 1971.",
      "type": "procedural",
      "date": "1971-02-18",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Prior to the termination of the proceedings before the Tribunal on February 18, 1971, the respondent had filed an appeal before the Commissioner under section 41(2) of the Tamil Nadu Shops and Establishments Act.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f11",
      "text": "The Commissioner after a perusal of all the documents produced by the parties before him took some additional evidence and after hearing the parties set aside the order of dismissal by the impugned order of November 16, 1971.",
      "type": "material",
      "date": "1971-11-16",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "The Commissioner held that the first charge namely that he was absent without leave on November 2, 1970, was established while the second charge about doing repair work in the premises of Eswari Institute of Commerce, Tiruchirapalli, was not proved.",
      "type": "admitted",
      "date": "1970-11-02",
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "The Commissioner also held that the order of dismissal was absolutely disproportionate to the gravity of the offence proved.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "The doctor stated during cross-examination that the Branch Manager Mr. Padmanabhan called on me at about 11 a.m. on 2-11-1970.",
      "type": "disputed",
      "date": "1970-11-02",
      "source": "court"
    },
    {
      "id": "f15",
      "text": "Padmanabhan's case was that at about 11.10 A.M. on November 2, 1970, he saw the respondent working on one of the typewriters in the premises of the Eswari Institute of Commerce.",
      "type": "disputed",
      "date": "1970-11-02",
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the remedy under the Industrial Disputes Act excludes the remedy under the Tamil Nadu Shops and Establishments Act, and whether the Commissioner had jurisdiction.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether the Commissioner's order is perverse, particularly in considering the evidence of the doctor.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether the Commissioner could interfere with the order passed in the domestic enquiry.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "As a special forum relief has been provided under the I.D. Act, namely, for making an application under section 33A of that Act, the remedy resorted to by the respondent under the Shops Act must be held to be excluded.",
      "supporting_facts": [
        "f7",
        "f8",
        "f9"
      ],
      "legal_basis": "Section 33A of the Industrial Disputes Act, 1947"
    },
    {
      "id": "pa2",
      "text": "The Commissioner's order is perverse as he absolutely failed to consider the evidence of the doctor a perusal of which would have certainly led to a contrary conclusion.",
      "supporting_facts": [
        "f14",
        "f15"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "The Commissioner should not have interfered with the order passed in the domestic enquiry since there was no violation of the principles of natural justice nor was the finding perverse.",
      "supporting_facts": [
        "f5",
        "f6"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "He was a protected workman and hence his dismissal was illegal in the absence of prior permission from the Tribunal under section 33(3) of the I.D. Act.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": "Section 33(3) of the Industrial Disputes Act, 1947"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "It is rather extraordinary that even though the Commissioner at the instance of the appellant had rejected the plea of protected workman, the management now seeks to raise a plea of ouster of jurisdiction before the Commissioner on the self-same ground. This cannot be allowed. Besides, the appellant submitted to the jurisdiction of the Commissioner and had not raised any objection to its jurisdiction to hear the appeal.",
      "addresses_issue": "i1",
      "key_observation": "Plea of jurisdiction not allowed as not raised earlier."
    },
    {
      "id": "cr2",
      "text": "We were taken through the evidence of the doctor before the Commissioner and we find that he stated during cross-examination that the Branch Manager Mr. Padmanabhan called on me at about 11 a.m. on 2-11-1970. There is, therefore, absolutely no foundation for the contention advanced by the learned counsel that the Tribunal ignored the evidence of the doctor. On the other hand his evidence ran counter to the stand taken by the management.",
      "addresses_issue": "i2",
      "key_observation": "Doctor's evidence does not support management's case."
    },
    {
      "id": "cr3",
      "text": "The jurisdiction of the Commissioner is an appellate jurisdiction and is of wider scope unlike that of the Tribunal in an application under section 33 of the I.D. Act. The Commissioner is competent to rehear the matter completely and come to its own conclusion after re-appreciation of the evidence. There is no legal bar in entertaining additional evidence if that is necessary in the interest of justice. The rule of law laid down by this Court with regard to jurisdiction of the Industrial Tribunal in an application under section 33 of the I.D. Act in interfering with the order of dismissal passed in a domestic enquiry, is not applicable to the case of an appeal before the Commissioner provided for under section 41 of the Shops Act.",
      "addresses_issue": "i3",
      "key_observation": "Commissioner's jurisdiction wider than Tribunal's."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Plea of ouster of jurisdiction not allowed as appellant submitted to Commissioner's jurisdiction and did not raise objection earlier.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Commissioner's order not perverse; doctor's evidence counters management's stand.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Commissioner has wider appellate jurisdiction under section 41 of Shops Act to re-appreciate evidence and interfere with dismissal order.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Industrial Disputes Act, 1947",
      "sections": [
        "33(2)(b)",
        "33(3)",
        "33A",
        "10",
        "33"
      ],
      "relevance": "Approval of dismissal during pending dispute; protected workman plea; special remedy invoked by petitioner."
    },
    {
      "name": "Tamil Nadu Shops and Establishments Act",
      "sections": [
        "41(2)",
        "41(3)"
      ],
      "relevance": "Appellate jurisdiction of Commissioner to set aside dismissal; binding on parties."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal by special leave against the order of the Additional Commissioner for Workmen's Compensation, Madurai, dated November 16, 1971, setting aside the dismissal order is dismissed.",
    "relief_granted": null,
    "costs": "Dismissed with costs."
  },
  "key_quotes": [
    {
      "text": "The jurisdiction of the Commissioner is an appellate jurisdiction and is of wider scope unlike that of the Tribunal in an application under section 33 of the I.D. Act.",
      "speaker": "court",
      "significance": "Distinguishes scope of Commissioner's powers from Tribunal's."
    },
    {
      "text": "It is rather extraordinary that even though the Commissioner at the instance of the appellant had rejected the plea of protected workman, the management now seeks to raise a plea of ouster of jurisdiction before the Commissioner on the self-same ground.",
      "speaker": "court",
      "significance": "Rejects petitioner's jurisdiction argument due to prior conduct."
    }
  ],
  "_case_id": "1974_245",
  "_label": 0,
  "_text_length": 7077,
  "_extracted_at": "2026-02-10T20:05:36.176336"
}