{
  "metadata": {
    "case_name": "Various Appellants/Petitioners v. Municipal Corporation of Greater Bombay & Ors.",
    "case_year": 1975,
    "court": "Supreme Court of India",
    "judges": [
      "A. N. Ray (C.J.)",
      "D. G. Palekar",
      "K. K. Mathew",
      "A. Alagiriswami",
      "H. R. Khanna",
      "P. N. Bhagwati",
      "V. R. Krishna Iyer"
    ],
    "case_number": "Civil Appeal No. 680 of 1968; Civil Appeals Nos. 2076-2080 of 1969; 2093-2103 of 1969; Civil Appeal No. 2527 of 1969; Civil Appeal No. 249 of 1970; Writ Petitions Nos. 333-348 of 1970",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Chapter V-A introduced in Bombay Municipal Corporation Act, 1888 by Maharashtra Act 14 of 1961 containing sections 105A and 105B granting powers of eviction to Commissioner in respect of unauthorised occupation of corporation premises.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Unauthorised occupation defined as occupation by any person of corporation premises without authority for such occupation and includes continuance in occupation after authority expired or determined.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Under section 105B, Commissioner issues notice to person in unauthorised occupation to vacate if arrears of rent/taxes for more than two months, sub-let contrary to terms, acts of waste, contravention of terms, or premises required in public interest.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Before eviction order, notice to show cause specifying grounds; person can file written statement, produce documents, appear by advocate; Commissioner has powers as civil court for inquiry.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Appeal from Commissioner's order to principal Judge of City Civil Court or designated judicial officer; order final subject to appeal; writ to High Court under Art. 226/227 available.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Bombay Government Premises Eviction Act, 1955 similar provisions for government premises by competent authority not lower than Deputy Collector or Executive Engineer; section 8A bars civil court jurisdiction post-amendment.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Proceedings taken under these Acts challenged before Bombay High Court in various petitions; appeals and writs before Supreme Court from HC judgments dated August 1967, March 1969 etc.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether Chapter V-A of Bombay Municipal Corporation Act and Bombay Government Premises Eviction Act, 1955 violate Article 14 as there are two procedures available (special procedure under Acts and ordinary civil suit), the special one being harsher/onerous without guidelines for choice.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether the special procedures are substantially more drastic and prejudicial than ordinary civil suit procedure so as to result in discrimination.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Two procedures available to Corporation/Government: ordinary civil suit and special procedure under Acts which is harsher/onerous; no guidelines as to which to adopt; leads to arbitrary discrimination violating Art. 14.",
      "supporting_facts": [
        "f1",
        "f3",
        "f6"
      ],
      "legal_basis": "Northern India Caterers Ltd. v. State of Punjab, 1967 3 SCR 399; Anwar Ali Sarkar 1952 SCR 284"
    },
    {
      "id": "pa2",
      "text": "Special procedure provides administrative tribunal instead of civil court, lacks appeals, more drastic.",
      "supporting_facts": [
        "f4",
        "f5"
      ],
      "legal_basis": "Art. 14 of Constitution"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Special provisions for government/municipal premises based on reasonable classification for speedy recovery in public interest; not discriminatory.",
      "supporting_facts": [
        "f1",
        "f6"
      ],
      "legal_basis": "Baburao Shantaram More v. Bombay Housing Board 1954 SCR 572; Collector of Malabar v. Ermal Ebrahim Hajee 1957 SCR 970"
    },
    {
      "id": "ra2",
      "text": "Procedures fair; discretion guided by policy of expeditious recovery; no violation of Art. 14 even if choice exists.",
      "supporting_facts": [
        "f3",
        "f4",
        "f5"
      ],
      "legal_basis": "Kathi Raning Rawat v. State of Saurashtra 1952 SCR 435; Kedar Nath Bajoria v. State of West Bengal 1954 SCR 30"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Special procedures not substantially more drastic than civil suit; provide notice, inquiry powers as civil court, representation by advocate, appeal to judicial officer (Principal Judge City Civil Court), writ remedy under Art. 226/227.",
      "addresses_issue": "i2",
      "key_observation": "In effect and substance same procedure as civil court available; civil suits long-drawn, expensive; special procedure prompt for public premises recovery."
    },
    {
      "id": "cr2",
      "text": "Discretion to choose procedure guided by policy/purpose of speedy eviction of unauthorised occupiers from public premises; nature of dispute, complexity, public need provide guidance; not arbitrary.",
      "addresses_issue": "i1",
      "key_observation": "Legislature defines broad categories, leaves guided discretion to authority; no compulsion to use special procedure in all cases."
    },
    {
      "id": "cr3",
      "text": "Northern India Caterers overruled; majority erred in assuming arbitrary choice ignoring obligatory notice under s.4 and discretionary eviction after hearing.",
      "addresses_issue": "i1",
      "key_observation": "Precedents like Anwar Ali Sarkar distinguished; where policy indicated (speedy recovery public premises), classification rational."
    },
    {
      "id": "cr4",
      "text": "Mere minor differences between procedures not enough for Art. 14; must be real/substantial disparities; here procedures not disparate qualitatively.",
      "addresses_issue": "i2",
      "key_observation": "Avoid dogmatic approach; consider realities of civil court delays vs. need for expeditious public property recovery."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Chapter V-A of Bombay Municipal Corporation Act and Bombay Government Premises Eviction Act, 1955 do not violate Art. 14; constitutional.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Special procedures not substantially more drastic/onerous than ordinary civil procedure.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Northern India Caterers Ltd. v. State of Punjab overruled.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Northern India Caterers Ltd. v. State of Punjab",
      "citation": "1967 3 SCR 399",
      "treatment": "overruled",
      "relevance": "Relied on by petitioners for discrimination due to two procedures; held erroneous as ignored statutory scheme."
    },
    {
      "case_name": "State of West Bengal v. Anwar Ali Sarkar",
      "citation": "1952 SCR 284",
      "treatment": "distinguished",
      "relevance": "No policy/guidance for special courts; unlike here with clear policy for public premises."
    },
    {
      "case_name": "Kathi Raning Rawat v. State of Saurashtra",
      "citation": "1952 SCR 435",
      "treatment": "followed",
      "relevance": "Guided discretion valid if policy indicated; affidavit supported classification."
    },
    {
      "case_name": "Kedar Nath Bajoria v. State of West Bengal",
      "citation": "1954 SCR 30",
      "treatment": "followed",
      "relevance": "Legislature indicates policy, executive selects within class; not arbitrary."
    },
    {
      "case_name": "A. Thangal Kunju Musaliar v. M. Venkitachalam Potti",
      "citation": "1955 2 SCR 1196",
      "treatment": "referred",
      "relevance": "Classification between cases with definite information vs. prima facie evasion valid."
    },
    {
      "case_name": "Suraj Mall Mohta v. A. V. Viswanatha Sastri",
      "citation": "1955 1 SCR 448",
      "treatment": "distinguished",
      "relevance": "No classification/guidance between ordinary and special income-tax procedures."
    },
    {
      "case_name": "Baburao Shantaram More v. Bombay Housing Board",
      "citation": "1954 SCR 572",
      "treatment": "followed",
      "relevance": "Special provisions for government/local authority premises upheld."
    }
  ],
  "statutes_cited": [
    {
      "name": "Bombay Municipal Corporation Act, 1888",
      "sections": [
        "Chapter V-A",
        "105A",
        "105B",
        "105C",
        "s. 68"
      ],
      "relevance": "Provides special eviction procedure for unauthorised occupiers of corporation premises; powers, inquiry, appeal."
    },
    {
      "name": "Bombay Government Premises Eviction Act, 1955",
      "sections": [
        "s. 4",
        "s. 8A"
      ],
      "relevance": "Similar special procedure for government premises; bars civil court jurisdiction post-amendment."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 14",
        "Art. 19",
        "Art. 226",
        "Art. 227",
        "Art. 32"
      ],
      "relevance": "Equality clause challenge; writ jurisdiction available."
    },
    {
      "name": "Code of Civil Procedure",
      "sections": [],
      "relevance": "Powers vested in Commissioner for summoning witnesses, discovery of documents."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "All appeals and writ petitions challenging constitutionality of Chapter V-A of Bombay Municipal Corporation Act and Bombay Government Premises Eviction Act dismissed; provisions held not violative of Art. 14.",
    "relief_granted": "None; upholding special eviction procedures.",
    "costs": "Petitioners to pay one set of costs."
  },
  "key_quotes": [
    {
      "text": "What the equality clause strikes at is discrimination howsoever it results. To the person subjected to the more drastic and onerous procedure it is immaterial whether such procedure is put into operation by one or the other agency.",
      "speaker": "court",
      "significance": "Explains substance over form in Art. 14 discrimination."
    },
    {
      "text": "The two procedures are not substantially and qualitatively disparate as to attract the vice of discrimination.",
      "speaker": "court",
      "significance": "Core holding on procedures not being discriminatory."
    },
    {
      "text": "We, therefore, find ourselves unable to agree with the majority in the Northern India Caterers case.",
      "speaker": "court",
      "significance": "Explicit overruling of precedent."
    },
    {
      "text": "Art. 14 does not demand a fanatical approach.",
      "speaker": "court",
      "significance": "Caution against rigid application of equality."
    }
  ],
  "_case_id": "1974_115",
  "_label": 0,
  "_text_length": 168650,
  "_extracted_at": "2026-02-10T20:04:17.713597"
}