{
  "metadata": {
    "case_name": "Appellants v. State of Rajasthan",
    "case_year": 1973,
    "court": "Supreme Court of India",
    "judges": [
      "RAY, C.J."
    ],
    "case_number": "Civil Appeals Nos. 943 and 980 to 989 of 1973",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "State of Rajasthan proposed to acquire land for the planned development of the city of Jaipur.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Notification under section 4 of the Rajasthan Land Acquisition Act, 1953 issued on 13 May 1960, published in Rajasthan Gazette on 9 June 1960.",
      "type": "procedural",
      "date": "1960-05-13",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "No objection was made under section 5A of the Act.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Notification under section 6 of the Act published on 11 May 1961.",
      "type": "procedural",
      "date": "1961-05-11",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Notices under section 9 of the Act issued on 18 July 1961.",
      "type": "procedural",
      "date": "1961-07-18",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "63 persons including the predecessor-in-title of the appellant in Civil Appeal No. 943 of 1973 filed claims.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Award under the Act made on 9 January 1964.",
      "type": "procedural",
      "date": "1964-01-09",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Award amended on 9 July 1964 because of certain transactions of sale of portions of the land.",
      "type": "procedural",
      "date": "1964-07-09",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Writ Petitions filed on 23 January 1970 challenging notifications dated 13 May 1960 and 3 May 1961 under sections 4 and 6, and notices dated 18 July 1961 under section 9.",
      "type": "procedural",
      "date": "1970-01-23",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Rajasthan High Court judgment dated 12 April 1973 dismissing writs on ground of inordinate delay and rejecting merits of challenges on discrimination and low acquisition price.",
      "type": "procedural",
      "date": "1973-04-12",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Appeals by special leave to Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether appellants guilty of inordinate delay in challenging notifications under sections 4, 6 and 9.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Validity of land acquisition proceedings on ground of discrimination.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether land acquired at negligible price to be sold at exorbitant price by Improvement Trust.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Challenged validity of notifications dated 13 May 1960 and 3 May 1961 under sections 4 and 6, and notices under section 9 dated 18 July 1961.",
      "supporting_facts": [
        "f2",
        "f4",
        "f5"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Land acquisition proceedings discriminatory.",
      "supporting_facts": [],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Land being acquired at negligible price and same would be sold at exorbitant price by Improvement Trust.",
      "supporting_facts": [],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Appellants guilty of inordinate delay; no need to go into merits if delay ground succeeds.",
      "supporting_facts": [
        "f9",
        "f10"
      ],
      "legal_basis": "Aflatoon Ors. v. Lt. Governor of Delhi Ors."
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "High Court rightly held appellants guilty of inordinate delay; appellants came to court nine years after declaration under section 6.",
      "addresses_issue": "i1",
      "key_observation": "Challenge to section 4 and 6 notifications should be made within reasonable time thereafter; delay puts premium on dilatory tactics."
    },
    {
      "id": "cr2",
      "text": "In Aflatoon case, petitioners waited till after section 9 notice to challenge earlier notifications.",
      "addresses_issue": "i1",
      "key_observation": "Length of delay important due to nature of acts done in interval based on notifications."
    },
    {
      "id": "cr3",
      "text": "Land acquisition proceedings commence with section 4 notification, followed by 5A objections, then section 6 declaration.",
      "addresses_issue": "i1",
      "key_observation": "Any challenge to section 4 or 6 must be prompt."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Writs dismissed by High Court on ground of delay upheld; no merit in other contentions.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Aflatoon Ors. v. Lt. Governor of Delhi Ors.",
      "citation": "1975 1 S.C.R. 802",
      "treatment": "followed",
      "relevance": "Held that challenging section 4 and 6 notifications after completion of proceedings due to dilatory tactics not permitted."
    }
  ],
  "statutes_cited": [
    {
      "name": "Rajasthan Land Acquisition Act, 1953",
      "sections": [
        "Section 4",
        "Section 5A",
        "Section 6",
        "Section 9"
      ],
      "relevance": "Notifications, declarations, objections, claims and award under these provisions; challenge to their validity dismissed on delay."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court dismissed the appeals by special leave from Rajasthan High Court judgment, upholding dismissal of writs on ground of inordinate delay in challenging land acquisition notifications.",
    "relief_granted": null,
    "costs": "Dismissed with costs."
  },
  "key_quotes": [
    {
      "text": "if persons allowed the Government to complete the acquisition proceedings on the basis that the notification under section 4 and the declaration under 6 were valid and then attacked the notification on grounds which were available to them at the time when the notification was published it would be putting a premium on dilatory tactics.",
      "speaker": "court",
      "significance": "Core reasoning on laches in land acquisition challenges."
    },
    {
      "text": "The appellants came to Court nine years after the declaration under section 6 of the Act.",
      "speaker": "court",
      "significance": "Highlights extent of delay justifying dismissal."
    }
  ],
  "_case_id": "1974_243",
  "_label": 0,
  "_text_length": 4029,
  "_extracted_at": "2026-02-10T20:05:25.866470"
}