{
  "metadata": {
    "case_name": "Jagdish Prasad v. District Magistrate, Ranchi",
    "case_year": 1973,
    "court": "Supreme Court of India",
    "judges": [
      "KRISHNA IYER, J."
    ],
    "case_number": "Writ Petition No. 1972 of 1973",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Petitioner Shri Jagdish Prasad, Proprietor M/s Lachmi Bhandar, North Market Road, Upper Bazar, Ranchi, detained by order No. 1182/C dated 9th October 1973 by District Magistrate, Ranchi under Sub-section (2) of Section 3 of Maintenance of Internal Security Act, 1971.",
      "type": "procedural",
      "date": "1973-10-09",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Detention order states satisfaction that petitioner acting in manner prejudicial to maintenance of supplies and services essential to the community, necessary to detain him in Ranchi Jail as Class Y, Division IB.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f3",
      "text": "On 2-10-72 at about 12 O'Clock at night, petitioner transporting 50 bags of rice on truck No. BRV 6627, checked by Sub-Divisional Magistrate, Sadar, Ranchi.",
      "type": "material",
      "date": "1972-10-02",
      "source": "lower_court"
    },
    {
      "id": "f4",
      "text": "Petitioner produced cash memo book asserting 15 bags sold to Biswanath Flour Mill, Khelari (cash memo 1134 dt 2-10-73, licence 34/69 R); verification showed licence 63/68, no purchase on 2-10-73.",
      "type": "disputed",
      "date": "1973-10-02",
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "10 bags to Pramod Flour Mill, Khelari (cash memo 1135 dt 2-10-73, licence 31/68 R); verification showed licence 9/72, no licence in 1969, no purchase on 2-10-73.",
      "type": "disputed",
      "date": "1973-10-02",
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "10 bags to Shri Kundan Lal, Khelari (cash memo 1137 dt 2-10-73, licence 26/67 R); verification showed no foodgrain dealers licence, does not deal in foodgrains, no purchase on 2-10-73.",
      "type": "disputed",
      "date": "1973-10-02",
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Petitioner is licensed wholesale dealer, can carry business only at specified place, no transport/sale outside, sell only to permit holders, issue correct receipts with name, address, licence number.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Affidavit in return by Upper Division Assistant, Special Home Department, State; 'and services' struck off after 'maintenance of supplies'.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the detention order suffers from fatal genetic disease due to uncertainty whether detaining for preventing disruption of supplies or services essential to the community.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether the grounds of detention are vague or lacking particulars, especially regarding prejudice to services as distinct from supplies, rendering the order invalid.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether blackmarketing in foodgrains is prejudicial only to supplies and not services.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "District Magistrate uncertain whether detaining to prevent disruption of supplies or services; mindless order suffers from fatal genetic disease as per Prabhu Dayal, Lohia cases.",
      "supporting_facts": [
        "f2",
        "f8"
      ],
      "legal_basis": "Prabhu Dayal v. District Magistrate, Kamrup (W.P. No. 1496/1973 dt 11.10.1973); Lohia case (AIR 1960 SC 633)"
    },
    {
      "id": "pa2",
      "text": "Blackmarketing affects supplies only (hoarding, blackmarketing foodgrains), not services; supplies and services compartmentalised with marginal overlap; order mentions both cumulatively but particulars relate only to supplies, vague on services.",
      "supporting_facts": [
        "f3",
        "f4",
        "f5",
        "f6"
      ],
      "legal_basis": "Rameshwar Lal v. State of Bihar (1968 2 SCR 505)"
    },
    {
      "id": "pa3",
      "text": "Mental vacillation shown by striking off 'and services' in affidavit; if one ground vague, order fails even if others good.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": "Prabhu Dayal; Keshav Talpade v. Emperor (AIR 1943 FC 18)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Filed affidavit asserting grounds, but by junior official without personal knowledge.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Supplies and services not strictly dichotomous; essential commodities like food, light, power are both supplies and services depending on viewpoint; illicit transport of rice affects both.",
      "addresses_issue": "i3",
      "key_observation": "Rushing food supplies is composite of supplies and services; blackmarketing disrupts supplies when scarcity exists."
    },
    {
      "id": "cr2",
      "text": "Grounds detailed with prolix particulars of midnight rice transport, fake cash memos, wrong licences; rational basis for subjective satisfaction of future prejudice to supplies/services.",
      "addresses_issue": "i2",
      "key_observation": "Preventive not punitive; admitted facts tell-tale of licence violations."
    },
    {
      "id": "cr3",
      "text": "Order cumulative 'supplies and services', not alternative; affidavit striking off unfortunate but not fatal as order clear; mechanical affidavits deprecated.",
      "addresses_issue": "i1",
      "key_observation": "Detaining authority must be firm, not doubtful."
    },
    {
      "id": "cr4",
      "text": "Procedure must be rigorously observed; gravity of evil no excuse for invading liberty without strict compliance.",
      "addresses_issue": "i2",
      "key_observation": "Illicit nocturnal transport by wholesaler impacts distribution wheels of supplies/services."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Detention order valid; blackmarketing in foodgrains prejudicial to maintenance of supplies and services essential to community.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Grounds not vague; sufficient particulars provided for effective representation.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "No fatal flaw as in Prabhu Dayal; order does not break down for mentioning both supplies and services.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Prabhu Dayal v. District Magistrate, Kamrup",
      "citation": "W.P. No. 1496 of 1973 judgment dated October 11, 1973",
      "treatment": "distinguished",
      "relevance": "Distinguished as grounds here detailed unlike vague smuggling inference there."
    },
    {
      "case_name": "Lohia case",
      "citation": "A.I.R. 1960 S.C. 633",
      "treatment": "referred",
      "relevance": "Concentric circles imagery for law/order/public order, cautioned against transplanting."
    },
    {
      "case_name": "Rameshwar Lal v. State of Bihar",
      "citation": "1968 2 S.C.R. 505",
      "treatment": "followed",
      "relevance": "Blackmarketing prejudicial to supplies; 'and' disjunctive; if grounds vague or non-existing, order fails."
    },
    {
      "case_name": "Blackpool Corporation v. Lovkar",
      "citation": "1948 1 K.B. 349",
      "treatment": "followed",
      "relevance": "Housing accommodation within supplies/services."
    },
    {
      "case_name": "Keshav Talpade v. Emperor",
      "citation": "A.I.R. 1943 F.C.R. 18, 375",
      "treatment": "referred",
      "relevance": "If some reasons bad, cannot be certain extent they operated on mind."
    }
  ],
  "statutes_cited": [
    {
      "name": "Maintenance of Internal Security Act, 1971 (No. 26 of 1971)",
      "sections": [
        "Section 3(2)",
        "Section 8"
      ],
      "relevance": "Power to detain for acting prejudicial to supplies/services; grounds to be furnished."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 32"
      ],
      "relevance": "Writ of habeas corpus."
    },
    {
      "name": "Defence of India Rules, 1971",
      "sections": [
        "Section 36(3)"
      ],
      "relevance": "Defines essential commodity as food, water, fuel, light, power etc."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Court upheld the validity of the detention order, finding no vagueness in grounds and that the activity affected both supplies and services essential to the community. Habeas corpus petition dismissed.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"The touchstone of social control is that it must be a thing essential for the existence of the community when crystallised it is supplies, when sublimated it is services.\"",
      "speaker": "court",
      "significance": "Explains overlap between supplies and services."
    },
    {
      "text": "\"Observance of procedure has been the bastion against wanton assaults on personal liberty over the years.\"",
      "speaker": "court",
      "significance": "Emphasizes strict procedural compliance in preventive detention."
    },
    {
      "text": "\"The gravity of the evil to the community resulting from anti-social activities can never furnish an adequate reason for invading the personal liberty of a citizen, except in accordance with the procedure established by the Constitution and the laws.\"",
      "speaker": "court",
      "significance": "Balances social security and personal liberty."
    }
  ],
  "_case_id": "1974_398",
  "_label": 0,
  "_text_length": 22122,
  "_extracted_at": "2026-02-10T20:06:52.021137"
}