{
  "metadata": {
    "case_name": "Appellant (Inamdar) v. Respondent No. 1 (Tenant)",
    "case_year": 1968,
    "court": "Supreme Court of India",
    "judges": [
      "UNTWALIA, J."
    ],
    "case_number": "Civil Appeal No. 30 of 1968",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The disputed land comprised in Survey No. 206/B, measuring 15 acres and 14 Gunthas in Osmanabad, at one time formed part of the erstwhile State of Hyderabad and eventually came to be a part of the State of Maharashtra.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "There is no dispute that the appellant was the Inamdar of this land.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The Hyderabad Abolition of Inams and Cash Grants Act, 1954 (Hyderabad Act No. VIII of 1955), hereinafter called the Abolition of Inams Act, came into force on its publication in the gazette on the 20th July, 1955.",
      "type": "background",
      "date": "1955-07-20",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The Abolition of Inams Act was amended by the Hyderabad Abolition of Inams Amendment Act, 1956 and was further amended by Bombay Act 64 of 1959 which came into force on 1st July, 1960.",
      "type": "background",
      "date": "1960-07-01",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "It is no longer in controversy that the Abolition of Inams Act became applicable to the appellant's Inam by virtue of the amended provisions on 1-7-1960 as a result of which under Section 3 appellant's Inam was abolished and vested in the State.",
      "type": "admitted",
      "date": "1960-07-01",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The first round of litigation started by the appellant against respondent No. 1 treating him as his tenant under the Hyderabad Tenancy and Agricultural Land Act, 1950 (Hyderabad Act No. XXI of 1950), hereinafter called the Tenancy Act, by serving a notice on the first respondent under section 44 of the said Tenancy Act.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "The appellant claimed in that proceeding that he bona fide required the land for cultivating it personally and hence after service of notice purporting to terminate the tenancy by the 31st day of December, 1958 proceeded to file an application on 18-3-1959 for possession of the land under section 32(2) of the Tenancy Act.",
      "type": "procedural",
      "date": "1959-03-18",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "The Naib Tehsildar, Land Reforms, Osmanabad rejected the resumption application of the appellant by his order dated 22-10-1959 holding against him on merits that he has made out no case for termination of the tenancy.",
      "type": "procedural",
      "date": "1959-10-22",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "The appellant went up in appeal which was allowed by the Deputy Collector Land Reforms Osmanabad by his order dated 25-5-1962. The Deputy Collector allowed the appellant to resume the disputed lands in Survey No. 206 holding in his favour on merits.",
      "type": "procedural",
      "date": "1962-05-25",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Respondent No. 1 went up in revision. The Revenue Tribunal allowed the revision of respondent No. 1 by its order made on 15-10-1962. It took the view accepting a new stand taken on behalf of the tenant respondent No. 1 that after the abolition and vesting of the appellant's Inam the said respondent who was in possession of the land comprised by the Inam as a tenant holding from the Inamdar had acquired all the rights of an occupant in respect of such land under section 6(1)(a) of the Abolition of Inams Act.",
      "type": "procedural",
      "date": "1962-10-15",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "The appellant moved the High Court of Bombay under Article 227 of the Constitution of India in Special Civil Application No. 1881 of 1962. Agreeing with the view of the Revenue Tribunal the Special Civil Application was dismissed by the High Court on 26-9-1963.",
      "type": "procedural",
      "date": "1963-09-26",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "The second round of fight started when proceedings under section 2A which was introduced in the Abolition of Inams Act by section 6 of Bombay Act, 64 of 1959 were initiated before the Officer authorised by the State Government to decide certain questions relating to Inams.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "The Tehsildar gave a notice to respondent No. 1 for payment of price in lieu of his having acquired the right of an occupant in the land in accordance with section 6 of the Abolition of Inams Act.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "The Deputy Collector decided the matter in the first instance by his order dated 30-11-1962. He held that the land was granted to the appellant for his service as Mahajan it could, therefore, be deemed to be a Watan land. He further held that the provisions of section 6 of Abolition of Inams Act were applicable and the date of vesting of the Inam was 1st July, 1960 and not 20th July, 1955.",
      "type": "procedural",
      "date": "1962-11-30",
      "source": "lower_court"
    },
    {
      "id": "f15",
      "text": "The Deputy Collector stated: 'The land in question being the Watan land, shall be resumed and vested in Government with effect from 1st July 1960 and the person in possession of the land at the time of vesting shall be entitled to occupancy right under section 6(1) of the Act in respect of the said land.' He finally directed that a copy of this order be sent to the Tehsildar Osmanabad for further necessary action.",
      "type": "procedural",
      "date": "1962-11-30",
      "source": "lower_court"
    },
    {
      "id": "f16",
      "text": "The Tehsildar by his order dated 15-7-1963 decided the matter in favour of the first respondent and held him to be a tenant in possession of the land on the date of vesting of the Inam and hence a person acquiring the rights of an occupant under section 6(1). The objection of the appellant was rejected by the Tehsildar.",
      "type": "procedural",
      "date": "1963-07-15",
      "source": "lower_court"
    },
    {
      "id": "f17",
      "text": "The appellant filed an appeal before the State Government under section 2A(2) of the Abolition of Inams Act from the decision of the Tehsildar. The rejection of the appellant's appeal by the State Government was communicated to him by a letter dated 27th November, 1964 of the Under Secretary to the Government of Maharashtra, Revenue and Forest Department.",
      "type": "procedural",
      "date": "1964-11-27",
      "source": "lower_court"
    },
    {
      "id": "f18",
      "text": "The appellant challenged the order of the State Government in Special Civil Application No. 1019 of 1965 under Articles 226 and 227 of the Constitution of India in the Bombay High Court. A Bench of the High Court dismissed his Writ Application by its judgment and order dated 14-10-1966.",
      "type": "procedural",
      "date": "1966-10-14",
      "source": "court"
    },
    {
      "id": "f19",
      "text": "The appellant presented this appeal by special leave of this Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f20",
      "text": "Respondent No. 1 was admittedly the appellant's tenant.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f21",
      "text": "Respondent No. 1 was in cultivating possession of the land in question paying rent to the appellant since long before the vesting of the Inam.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f22",
      "text": "Indisputably, respondent No. 1 was in possession of the land on 1st July, 1960.",
      "type": "admitted",
      "date": "1960-07-01",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the State Government was justified in rejecting the appellant's statutory appeal without giving him a hearing and without passing any reasoned order.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether the Inam in question was a service Inam and hence in view of the provision of law contained in section 102A(c) of the Tenancy Act the said Act was not applicable to the land in question and respondent No. 1 could therefore never be a tenant of the land.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether the proceedings initiated by the appellant for resumption of land under the Tenancy Act were all ultra vires and without jurisdiction, there being no relationship of landlord and tenant between the parties under the Tenancy Act.",
      "framed_by": "petitioner"
    },
    {
      "id": "i4",
      "text": "Whether res judicata operated on the question of respondent No. 1 acquiring the right of an occupant under section 6(1) of the Abolition of Inams Act.",
      "framed_by": "petitioner"
    },
    {
      "id": "i5",
      "text": "Whether the tenancy was terminated by service of a notice under section 44 and the filing of the application under section 32(2) of the Tenancy Act, so that respondent No. 1 was not a tenant in possession on 1-7-1960 the date of vesting of the Inam.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The State Government was not justified in rejecting the appellant's statutory appeal without giving him a hearing and without passing any reasoned order.",
      "supporting_facts": [
        "f17"
      ],
      "legal_basis": "Section 2A(2) of the Abolition of Inams Act; Articles 226 and 227 of the Constitution"
    },
    {
      "id": "pa2",
      "text": "The Inam in question was a service Inam and hence in view of the provision of law contained in section 102A(c) of the Tenancy Act the said Act was not applicable to the land in question; respondent No. 1 could therefore never be a tenant of the land.",
      "supporting_facts": [
        "f14",
        "f2"
      ],
      "legal_basis": "Section 102A(c) of the Tenancy Act"
    },
    {
      "id": "pa3",
      "text": "The proceedings initiated by the appellant for resumption of land under the Tenancy Act were all ultra vires and without jurisdiction, there being no relationship of landlord and tenant between the parties under the Tenancy Act.",
      "supporting_facts": [
        "f6",
        "f7",
        "f8",
        "f9",
        "f10",
        "f11"
      ],
      "legal_basis": null
    },
    {
      "id": "pa4",
      "text": "Res judicata did not operate on the question of respondent No. 1 acquiring the right of an occupant under section 6(1) of the Abolition of Inams Act.",
      "supporting_facts": [
        "f10",
        "f11"
      ],
      "legal_basis": "Principles of res judicata"
    },
    {
      "id": "pa5",
      "text": "In any view of the matter the tenancy was terminated by service of a notice under section 44 and the filing of the application under section 32(2) of the Tenancy Act, against respondent No. 1. He was, therefore, not a tenant in possession of the land on 1-7-1960 the date of vesting of the Inam.",
      "supporting_facts": [
        "f6",
        "f7"
      ],
      "legal_basis": "Sections 44(1) and 32(2) of the Tenancy Act"
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "It was not necessary for the State Government to give a personal hearing to the appellant or his authorised representative before disposal of his appeal. As has been repeatedly pointed out by this Court the State Government ought to have disposed of the statutory appeal by a speaking order. But on the facts and in the circumstances of this case the High Court did not feel persuaded, and rightly, to set aside the order of the State Government and remit back the appellant's appeal to them merely on that account. No determination or adjudication of facts was involved. The decision of the case rested on the points of law.",
      "addresses_issue": "i1",
      "key_observation": "Speaking order desirable but not grounds for remand here as pure question of law."
    },
    {
      "id": "cr2",
      "text": "The High Court did examine the question as to whether respondent No. 1 could not be a tenant of the appellant because the Inam had been held to be a Watan Inam and consequently according to the appellant it was a service Inam. In the present proceeding the High Court pointed out that respondent No. 1 was admittedly the appellant's tenant. Mere service of notice under section 44 of the Tenancy Act had not terminated the tenancy.",
      "addresses_issue": "i2",
      "key_observation": "Respondent No. 1 was admittedly the appellant's tenant."
    },
    {
      "id": "cr3",
      "text": "Such a stand [service Inam, Tenancy Act not applicable] is wholly contrary to the appellant's case in the previous proceedings for resumption of land. Everywhere the appellant asserted that respondent No. 1 was his tenant... It is not open to the appellant to change his stand and then assert that the previous proceedings started by him for resumption of the land was ultra vires and without jurisdiction as the Tenancy Act was not applicable to the land.",
      "addresses_issue": "i3",
      "key_observation": "Appellant estopped from changing stand; previous assertion that land not service Inam."
    },
    {
      "id": "cr4",
      "text": "The fact remains that respondent No. 1 was in cultivating possession of the land in question paying rent to the appellant since long before the vesting of the Inam. It could not but be in his capacity as a tenant of the appellant.",
      "addresses_issue": "i2",
      "key_observation": "Long possession paying rent establishes tenancy."
    },
    {
      "id": "cr5",
      "text": "It is not open to the appellant to assert that the order made by the Revenue Tribunal or as a matter of that in his earlier Special Civil Application by the Bombay High Court was in a proceeding in which there was inherent lack of jurisdiction in the first authority and consequently the order was also a nullity.",
      "addresses_issue": "i3",
      "key_observation": "Cannot collaterally attack previous orders."
    },
    {
      "id": "cr6",
      "text": "Reading the wordings of sections 44(1) and 32(2) of the Tenancy Act it was not possible to accept the contention put forward on behalf of the appellant that by mere service of notice and the filing of application for possession the tenancy had come to an end. Until and unless possession was directed to be delivered to the landholder by the competent authority, the tenant continued in possession and continued to be so as a tenant.",
      "addresses_issue": "i5",
      "key_observation": "Tenancy terminates only on order for possession."
    },
    {
      "id": "cr7",
      "text": "In view of rule 28(5) of the Hyderabad Tenancy and Agricultural Lands Rules... it is clear that the tenancy did not come to an end by the mere service of notice and the filing of the application by the appellant against respondent No. 1 under the Tenancy Act. He was a tenant when the Inam of the appellant vested in the State on the 1st of July, 1960. Indisputably, he was in possession of the land on that date. Consequently he acquired the rights of an occupant under section 6(1) of the Abolition of Inams Act.",
      "addresses_issue": "i5",
      "key_observation": "Rule 28(5) confirms tenancy continues until application granted."
    },
    {
      "id": "cr8",
      "text": "The High Court was also right in holding that the issue as to the acquiring by respondent No. 1 of the right of an occupant was barred on the principles of res judicata in view of the previous decision in the earlier Special Civil Application. Neither the Revenue Tribunal nor the High Court in the earlier proceeding went into the merits of the appellant's claim for resumption of the land. It defeated him on the ground that since respondent No. 1 had acquired the right of an occupant on the abolition and the vesting of the Inam the application under section 32(2) of the Tenancy Act had got to fail. The issue directly and substantially fell for determination in the earlier case.",
      "addresses_issue": "i4",
      "key_observation": "Res judicata applies as issue directly decided earlier."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "None of the points urged on behalf of the appellant is fit to succeed.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Respondent No. 1 was a tenant of the appellant at the time of vesting; service Inam argument rejected due to inconsistent prior stand.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Previous resumption proceedings not ultra vires; appellant cannot change stand or collaterally attack.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    },
    {
      "id": "h4",
      "text": "Res judicata bars re-agitation of whether respondent No. 1 acquired occupant rights under section 6(1).",
      "resolves_issue": "i4",
      "in_favor_of": "respondent"
    },
    {
      "id": "h5",
      "text": "Tenancy not terminated by notice and application alone; terminates only per rule 28(5) upon grant of application. Respondent No. 1 was tenant in possession on vesting date and acquired occupant rights under section 6(1).",
      "resolves_issue": "i5",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Dattatraya Sadashiv Dhond v. Ganpati Raghu Gaoli",
      "citation": "67 Bombay Law Reporter, 521",
      "treatment": "referred",
      "relevance": "Full Bench view on termination of tenancy under section 44: tenancy terminates only when application for possession granted by Tehsildar."
    }
  ],
  "statutes_cited": [
    {
      "name": "Hyderabad Abolition of Inams and Cash Grants Act, 1954 (Hyderabad Act No. VIII of 1955)",
      "sections": [
        "Section 3",
        "Section 6(1)(a)",
        "Section 2A",
        "Section 2A(2)"
      ],
      "relevance": "Abolished Inam and vested in State on 1-7-1960; tenant in possession on vesting acquires occupant rights; proceedings to determine occupant rights and payment."
    },
    {
      "name": "Hyderabad Tenancy and Agricultural Lands Act, 1950 (Hyderabad Act No. XXI of 1950)",
      "sections": [
        "Section 44",
        "Section 44(1)",
        "Section 32(2)",
        "Section 102A(c)",
        "Section 6",
        "Section 19"
      ],
      "relevance": "Notice to terminate tenancy for personal cultivation; application for possession; inapplicable to service Inams per 102A(c); tenancy not terminated until order."
    },
    {
      "name": "Hyderabad Abolition of Inams Amendment Act, 1956",
      "sections": [],
      "relevance": "Amended Abolition of Inams Act."
    },
    {
      "name": "Bombay Act 64 of 1959",
      "sections": [
        "Section 6"
      ],
      "relevance": "Amended Abolition of Inams Act effective 1-7-1960, introduced section 2A."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 226",
        "Article 227"
      ],
      "relevance": "Writ jurisdiction; supervisory jurisdiction over tribunals."
    },
    {
      "name": "Hyderabad Tenancy and Agricultural Lands Rules",
      "sections": [
        "Rule 28(5)"
      ],
      "relevance": "Tenancy stands terminated on granting of application for possession from commencement of following year."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal fails and is dismissed with costs to Respondent No. 1. Court rejected all appellant's contentions, upheld that respondent No. 1 was tenant in possession on vesting date 1-7-1960 and acquired occupant rights under section 6(1) of Abolition of Inams Act; res judicata applied from prior proceedings.",
    "relief_granted": "None to appellant",
    "costs": "Costs to Respondent No. 1"
  },
  "key_quotes": [
    {
      "text": "\"It is not open to the appellant to change his stand and then assert that the previous proceedings started by him for resumption of the land was ultra vires and without jurisdiction as the Tenancy Act was not applicable to the land.\"",
      "speaker": "court",
      "significance": "Rejects appellant's inconsistent position on applicability of Tenancy Act."
    },
    {
      "text": "\"He was a tenant when the Inam of the appellant vested in the State on the 1st of July, 1960. Indisputably, he was in possession of the land on that date. Consequently he acquired the rights of an occupant under section 6(1) of the Abolition of Inams Act.\"",
      "speaker": "court",
      "significance": "Core holding on occupant rights."
    },
    {
      "text": "\"The issue directly and substantially fell for determination in the earlier case. It was decided against the appellant and he cannot re-agitate the very same question in this proceeding.\"",
      "speaker": "court",
      "significance": "Application of res judicata."
    }
  ],
  "_case_id": "1974_380",
  "_label": 0,
  "_text_length": 16764,
  "_extracted_at": "2026-02-10T20:07:00.181204"
}