{
  "metadata": {
    "case_name": "Shiv Pujan Singh v. Union of India/State",
    "case_year": 1973,
    "court": "Supreme Court of India",
    "judges": [
      "RAY, C.J."
    ],
    "case_number": "Writ Petition No. 2053 of 1973",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Petition under Article 32 of the Constitution challenging order of detention dated 15 March 1973 passed in exercise of powers conferred by sub-section 1 read with sub-section 2 of section 3 of the Maintenance of Internal Security Act directing petitioner to be detained.",
      "type": "procedural",
      "date": "1973-03-15",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Order of detention fixes the maximum period of detention as per section 13 of the Act as amended by section 6 of the Defence of India Act, 1971, which is 12 months from date of detention or until expiry of Defence of India Act, whichever later.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Petitioner submits that authorities bodily lifted the section fixing maximum period without applying their mind to the circumstances requiring detention.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the order of detention suffers from constitutional infirmity because authorities failed to fix period of detention after examining circumstances and merely adopted maximum period under section 13 without applying mind.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Validity of section 13 of the Maintenance of Internal Security Act fixing maximum detention period with reference to expiry of Defence of India Act.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "It is the duty of the authority to fix the period of detention after carefully examining the circumstances requiring detention; authorities bodily lifted the section fixing the maximum period without applying their mind as to the period of detention.",
      "supporting_facts": [
        "f1",
        "f3"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "This Court in Fagu Shaw etc. v. The State of West Bengal AIR 1974 S.C. 613 held that the maximum period mentioned in section 13 of the Act as amended by section 6 of the Defence of India Act, 1971 is a constitutionally valid provision.",
      "addresses_issue": "i2",
      "key_observation": "Section 13 states maximum period is 12 months from date of detention or until expiry of Defence of India Act whichever later; valid with reference to Article 22(7)(b) as maximum period can be fixed with reference to duration of emergency."
    },
    {
      "id": "cr2",
      "text": "The order of detention in the present case does not suffer from any constitutional infirmity; authorities have applied their mind by detaining for the maximum period mentioned in the statute.",
      "addresses_issue": "i1",
      "key_observation": "Expiry of Defence of India Act is dependent upon revocation of emergency; duration of maximum period with reference to cessation of emergency is not indefinite."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Section 13 of Maintenance of Internal Security Act is constitutionally valid under Article 22(7)(b); detention order fixing maximum period thereunder is valid as authorities applied their mind.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Order of detention dated 15 March 1973 does not suffer from constitutional infirmity.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Fagu Shaw etc. v. The State of West Bengal",
      "citation": "AIR 1974 S.C. 613",
      "treatment": "followed",
      "relevance": "Held maximum period in section 13 of the Act constitutionally valid with reference to Article 22(7)(b)"
    }
  ],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Article 32",
        "Article 22(7)(b)"
      ],
      "relevance": "Basis for writ petition; validates maximum detention period fixed with reference to emergency"
    },
    {
      "name": "Maintenance of Internal Security Act",
      "sections": [
        "Section 3(1)",
        "Section 3(2)",
        "Section 13"
      ],
      "relevance": "Powers for detention order; maximum period of detention fixed thereunder upheld"
    },
    {
      "name": "Defence of India Act, 1971",
      "sections": [
        "Section 6"
      ],
      "relevance": "Amends section 13 of Maintenance of Internal Security Act"
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The writ petition challenging the detention order dated 15 March 1973 under the Maintenance of Internal Security Act is dismissed as the order does not suffer from any constitutional infirmity and authorities applied their mind in fixing the maximum period under section 13.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "This Court in Fagu Shaw etc. v. The State of West Bengal AIR 1974 S.C. 613 held that the maximum period mentioned in section 13 of the Act ... is a constitutionally valid provision.",
      "speaker": "court",
      "significance": "Upholds validity of maximum detention period under section 13"
    },
    {
      "text": "The order of detention in the present case does not suffer from any constitutional infirmity. The authorities have applied their mind.",
      "speaker": "court",
      "significance": "Rejects petitioner's challenge and dismisses petition"
    }
  ],
  "_case_id": "1974_172",
  "_label": 0,
  "_text_length": 2108,
  "_extracted_at": "2026-02-10T20:04:40.063199"
}