{
  "metadata": {
    "case_name": "Appellants v. Respondents (Pre-emption Suits)",
    "case_year": 1973,
    "court": "Supreme Court of India",
    "judges": [
      "MATHEW, J."
    ],
    "case_number": "Civil Appeals Nos. 941, 1123, 1572, 1666, 1667, 1760, 1780 of 1973 and 8 of 1974",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "A common question of law arises for consideration in these appeals and this judgment will dispose of all the appeals.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Civil Appeal No. 941 of 1973 challenges the correctness of a decree passed by the High Court dismissing a suit for pre-emption.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The plaint property belonged to defendant No. 4.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Defendant No. 4 sold the property to defendants Nos. 1 to 3 by a sale deed dated July 29, 1965 and registered on October 14, 1965.",
      "type": "material",
      "date": "1965-07-29",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The appellant, daughter of defendant No. 4, claiming right to pre-empt, instituted the suit through her guardian.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The trial court decreed the suit.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Against the decree, an appeal was preferred by the vendees and that appeal was dismissed on July 17, 1971.",
      "type": "procedural",
      "date": "1971-07-17",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "An appeal was preferred to the High Court against this decree.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "The Punjab Pre-emption Repeal Act, 1973 (Act 11 of 1973) received the assent of the Governor of Punjab on April 6, 1973 and was published in the Punjab Gazette on April 9, 1973.",
      "type": "background",
      "date": "1973-04-06",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "The High Court allowed the appeal and dismissed the suit holding that the provision of s. 3 of the above Act should govern the decision.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "The plaintiff appellant then applied for leave to file Letters Patent Appeal. That was dismissed.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Appeals by special leave from the judgment and order dated 22nd May/31st August, 22nd May/20th September/17th August/17th September, 1973 of the Punjab Haryana High Court in S. As. Nos. 1095/71, 271/69, 11/68, 879/70, 899/11, 2015/70 and 1137 of 1973 respectively.",
      "type": "procedural",
      "date": "1973-05-22",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the appellate court, when it passes a decree confirming the decree for pre-emption passed by the trial court or the lower appellate court, is passing a decree for pre-emption.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the provision of s. 3 of the Punjab Pre-emption Repeal Act, 1973 should govern the decision in the High Court appeal.",
      "framed_by": "high_court"
    }
  ],
  "petitioner_arguments": [],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "In these appeals, a common question of law arises for consideration and this judgment will dispose of all the appeals. We will take up for consideration Civil Appeal No. 941 of 1973.",
      "addresses_issue": "i1",
      "key_observation": "Common question across appeals."
    },
    {
      "id": "cr2",
      "text": "Section 3 of the Punjab Pre-emption Repeal Act, 1973, provides: Bar to pass decree in suit for pre-emption--On and from the date of commencement of the Punjab Pre-emption Repeal Act, 1973, no court shall pass a decree in any suit for pre-emption. The section, in effect, says that no court shall decree a suit for preemption after the coming into force of the Act.",
      "addresses_issue": "i1",
      "key_observation": "Interpretation of s. 3 barring courts from passing decrees in pre-emption suits post-commencement."
    }
  ],
  "holdings": [],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Punjab Pre-emption Repeal Act, 1973 (Act 11 of 1973)",
      "sections": [
        "3"
      ],
      "relevance": "Bars courts from passing decrees in suits for pre-emption on and from the date of commencement."
    }
  ],
  "outcome": {
    "disposition": null,
    "summary": "The judgment introduces the facts and the common legal question regarding the effect of Section 3 of the Punjab Pre-emption Repeal Act, 1973 on appellate decrees confirming trial court pre-emption decrees, but the final disposition is not provided in the text.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "Section 3 of the Punjab Pre-emption Repeal Act, 1973, provides Bar to pass decree in suit for pre-emption--On and from the date of commencement of the Punjab Pre-emption Repeal Act, 1973, no court shall pass a decree in any suit for pre-emption.",
      "speaker": "court",
      "significance": "Core provision at issue determining the bar on pre-emption decrees."
    },
    {
      "text": "The question is, whether the appellate court, when it passes a decree, confirming the decree for pre-emption passed by the trial court or the lower appellate court, is passing a decree for pre-emption.",
      "speaker": "court",
      "significance": "Central legal question framed by the Supreme Court."
    }
  ],
  "_case_id": "1974_198",
  "_label": 0,
  "_text_length": 2540,
  "_extracted_at": "2026-02-10T20:04:46.423551"
}