{
  "metadata": {
    "case_name": "Civil Appeals Nos. 141 of 1971, 268 of 1972, 2467-2468 of 1972 & Writ Petitions Nos. 12 of 1971, 17, 471-474 of 1972",
    "case_year": 1972,
    "court": "Supreme Court of India",
    "judges": [
      "RAY, C.J."
    ],
    "case_number": "Civil Appeal Nos. 141 of 1971, 268 of 1972, 2467-2468 of 1972; Writ Petitions Nos. 12 of 1971, 17, 471-474 of 1972",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Regulation 561 provided that officers who joined Indian Civil Service prior to 1921 entitled to annuity of £1000; after 1921 to Rs. 10,666-10-8 subject to minimum £1000.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Regulation 983 provided payment of annuities in sterling or rupees at specified exchange rates: Rs. 10-2/3 or Rs. 10-65 per £; options for annuitants residing in India at fixed rates including 1 sh-6d to a rupee.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On 15 August 1947, under Regulation 561, ICS member on retirement entitled to Rs. 10,666-10-8 subject to minimum £1000; if drawn at Home Treasury (London), sterling minimum £1000.",
      "type": "background",
      "date": "1947-08-15",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Secretary of State despatch dated 25 February 1928 fixed rate of exchange at 1 sh-6d to a rupee for pension, continued up to 15 August 1947.",
      "type": "background",
      "date": "1928-02-25",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Regulation 561 amended by President under Article 309, effective 12 June 1956: Indian ICS members entitled to Rs. 13,333.33 payable in India in rupees only (equivalent to £1000 at 1 sh-6d to rupee).",
      "type": "procedural",
      "date": "1956-06-12",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Petitioners and appellants in CA 147/71, 2467-68/72, WP Nos. 12/71 etc. are members of ICS who joined after 1921; entitled under Regulation 561 to Rs. 13,333.33 subject to reductions.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Former Secretary of State Service Officers Conditions of Service Act, 1972 amends Regulations 561 and 983; Section 7 entitles to Rs. 13,333.33; Section 8 bars claims for sterling pension, payment outside India, or conversion exceeding Rs. 13,333.33 to £1000.",
      "type": "material",
      "date": "1972-10-01",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Article 312A introduced by Constitution (Twenty-eighth Amendment) Act, 1972 empowers Parliament to vary/revoke pension conditions of pre-Constitution Secretary of State appointees retrospectively/prospectively.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Petitioners reside in India; annuitants under 1972 Act entitled to Rs. 13,333.33 equivalent to £1000 at 1 sh-6d rate; no change from 1956 amendment.",
      "type": "admitted",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether Regulations 561 and 983 of the Civil Service Regulations could be amended by the Former Secretary of State Service Officers Conditions of Service Act, 1972.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Salary, annuity and pension of ICS members form basic structure which cannot be amended by Parliament.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "ICS officers entitled to annuity by converting £1000 into Indian currency at official rate of exchange; denial is unconstitutional violation of basic rights.",
      "supporting_facts": [
        "f1",
        "f2",
        "f3",
        "f9"
      ],
      "legal_basis": "Regulations 561, 983"
    },
    {
      "id": "pa3",
      "text": "Entitled to pension in sterling, payment outside India, or conversion at rate exceeding Rs. 13,333.33 to £1000.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "No right to sterling pension or conversion exceeding fixed rate; 1956 and 1972 amendments valid as Indian currency legal tender; no constitutional vice in fixing rate/mode by legislation.",
      "supporting_facts": [
        "f5",
        "f7",
        "f9"
      ],
      "legal_basis": "Article 309; 1972 Act Sections 7,8"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "1956 amendment delinked pension from sterling (no longer legal tender); payable in rupees only at Rs. 13,333.33 equivalent to £1000 at 1928 rate continued to 1947.",
      "addresses_issue": "i1",
      "key_observation": "Amendment necessary due to transfer of power; no infringement of Articles 14, 16."
    },
    {
      "id": "cr2",
      "text": "1972 Act effects no change in quantum (Rs. 13,333.33); merely bars sterling claims, foreign payment, or higher conversion; petitioners have no right or merit.",
      "addresses_issue": "i1",
      "key_observation": "Article 312A empowers variation; basic structure contention absurd and unsustainable."
    },
    {
      "id": "cr3",
      "text": "Post-1921 joiners' 1947 entitlements unaltered; uniform treatment for India-resident annuitants irrespective of citizenship/domicile.",
      "addresses_issue": "i1",
      "key_observation": "Privileges under British Government regulated even then; no vested right to fluctuating exchange."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Regulations 561 and 983 validly amended by 1972 Act; no constitutional invalidity; petitioners not entitled to sterling pension, foreign payment, or higher rupee conversion.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Civil Service Regulations",
      "sections": [
        "561",
        "983"
      ],
      "relevance": "Amended by 1956 notification and 1972 Act; governed pre- and post-1921 ICS annuities, exchange rates, payment modes."
    },
    {
      "name": "Former Secretary of State Service Officers Conditions of Service Act, 1972",
      "sections": [
        "7",
        "8"
      ],
      "relevance": "Fixes annuity at Rs. 13,333.33; bars sterling/foreign payment or higher conversion; validates amendments."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "14",
        "16",
        "32",
        "309",
        "312A"
      ],
      "relevance": "Art 309 enabled 1956 amendment; Art 312A empowers pension variations; no violation of Arts 14,16."
    },
    {
      "name": "Constitution (Twenty-eighth Amendment) Act, 1972",
      "sections": [],
      "relevance": "Introduced Art 312A for retrospective/prospective pension changes."
    }
  ],
  "outcome": {
    "disposition": "partially_accepted",
    "summary": "Petitions under Art 32 dismissed as failed; CA 268/72 allowed; CA 147/71, 2467/72, 2468/72 dismissed.",
    "relief_granted": "None to petitioners; confirmation of 1972 Act amendments.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The only question which falls for determination in these petitions and appeal is whether Regulations 561 and 983 of the Civil Service Regulations could be amended by the Former Secretary of State Service Officers Conditions of Service Act, 1972.",
      "speaker": "court",
      "significance": "Frames the sole issue."
    },
    {
      "text": "The alleged basic rights are not only absurd but also insupportable in law.",
      "speaker": "court",
      "significance": "Rejects petitioners' core contention on basic rights."
    },
    {
      "text": "There is no constitutional vice in fixing the rate of exchange and the mode of payment by legislation.",
      "speaker": "court",
      "significance": "Upholds validity of 1972 Act."
    }
  ],
  "_case_id": "1974_226",
  "_label": 0,
  "_text_length": 9977,
  "_extracted_at": "2026-02-10T20:05:27.101923"
}