{
  "metadata": {
    "case_name": "Appellant (Election Petitioner) v. Respondents",
    "case_year": 1973,
    "court": "Supreme Court of India",
    "judges": [
      "ALAGIRISWAMI, J."
    ],
    "case_number": "Civil Appeal No. 1326 of 1973",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Elections were held in March 1972 to the Himachal Pradesh State Legislative Assembly.",
      "type": "background",
      "date": "1972-03",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The 1st respondent was elected to the Assembly from the Shahpur Constituency in Kangra District.",
      "type": "material",
      "date": "1972-03",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "An election petition was filed by the appellant, a voter in that constituency, on the ground, among others, that at the time of filing of nominations the 1st respondent was holding an office of profit under the Government of Himachal Pradesh and as such was disqualified for election under Article 191(1)(a) of the Constitution.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "The petition was dismissed by the High Court of Himachal Pradesh on 31st July, 1973.",
      "type": "procedural",
      "date": "1973-07-31",
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "The 1st respondent was nominated Chairman of the Board of School Education of Himachal Pradesh in the year 1969 by the Himachal Pradesh Government under the provisions of the Himachal Pradesh Board of School Education Act, 1968.",
      "type": "material",
      "date": "1969",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "At all relevant times he was holding that post.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Under s. 18 of the Act the Chairman is nominated by the Government. The Board is constituted by the Government under S. 3 of the Act.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "The office of the Chairman of the Board is an office under the State Government.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Admittedly, the 1st respondent was not in receipt of a salary. The order appointing him to the post of Chairman makes it clear that he was appointed only in an honorary capacity.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "He was entitled to receive travelling and daily allowance in the course of the discharge of his duties as Chairman.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Resolution No. 12 passed by the Board on January 17, 1970 fixing a salary of Rs. 1600-1800 per month for the Chairman.",
      "type": "disputed",
      "date": "1970-01-17",
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the 1st respondent was holding an office of profit under the State Government as Chairman of the Board of School Education and thus disqualified under Article 191(1)(a) of the Constitution to be elected as a member of the State Legislative Assembly.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the Board was competent to fix a scale of pay for the Chairman by resolution under the Himachal Pradesh Board of School Education Act, 1968.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Though the 1st respondent might not have been in receipt of a salary, the post itself carried a scale of pay (per Board's Resolution No. 12 dated January 17, 1970) and therefore it is an office of profit.",
      "supporting_facts": [
        "f5",
        "f11"
      ],
      "legal_basis": "Article 191(1)(a); Section 10 clause 18 of Himachal Pradesh Board of School Education Act, 1968"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The appointment was in honorary capacity with no salary received, only TA/DA which is not disqualifying.",
      "supporting_facts": [
        "f9",
        "f10"
      ],
      "legal_basis": "Section 3(m) of the Himachal Pradesh Legislative Assembly Members Removal of Disqualifications Act, 1971"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The question is whether the holding of the office has resulted in any profit to the holder of that office, however small that profit may be.",
      "addresses_issue": "i1",
      "key_observation": "In the absence of any profit accruing to the 1st respondent as a result of the holding of the office of Chairman it cannot be said that he was holding an office of profit."
    },
    {
      "id": "cr2",
      "text": "The Board was not competent to fix a scale of pay for the Chairman by a resolution; Section 10 clause 18 does not enable it; no provision in the Act allows it.",
      "addresses_issue": "i2",
      "key_observation": "A mere resolution of the Board cannot have the effect of fixing the scale of pay of the Chairman."
    },
    {
      "id": "cr3",
      "text": "The test is whether he can sue for or otherwise claim the scale of pay fixed by the resolution of the Board. In the face of his order of appointment such a claim would not be upheld.",
      "addresses_issue": "i1",
      "key_observation": "Appointment was honorary; no scale of pay attached to the post for the 1st respondent."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The 1st respondent was not holding an office of profit at the time when he filed his nomination or when he was elected.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "The Board lacked competence to fix scale of pay for Chairman via resolution.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "C.A. No. 2365 of 1972",
      "citation": null,
      "treatment": "followed",
      "relevance": "Discussed the question of office of profit at great length in judgment delivered today."
    }
  ],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Article 191(1)(a)"
      ],
      "relevance": "Disqualification for holding office of profit under the State Government."
    },
    {
      "name": "Himachal Pradesh Board of School Education Act, 1968",
      "sections": [
        "S. 3",
        "S. 10 cl. 18",
        "S. 17",
        "S. 18",
        "S. 19",
        "S. 22",
        "S. 23(4)",
        "S. 26(2)(i)",
        "S. 26(2)(p)",
        "S. 27"
      ],
      "relevance": "Governs constitution of Board, nomination and powers regarding Chairman, Secretary etc.; no power to Board to fix Chairman's pay."
    },
    {
      "name": "Himachal Pradesh Legislative Assembly Members Removal of Disqualifications Act, 1971",
      "sections": [
        "Section 3(m)"
      ],
      "relevance": "Exempts travelling and daily allowances from disqualification."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal against the dismissal of the election petition by the High Court is dismissed. The Court holds that the 1st respondent was not holding an office of profit and is not disqualified under Article 191(1)(a).",
    "relief_granted": null,
    "costs": "with costs"
  },
  "key_quotes": [
    {
      "text": "The question is whether the holding of the office has resulted in any profit to the holder of that office, however small that profit may be.",
      "speaker": "court",
      "significance": "Defines the test for 'office of profit'."
    },
    {
      "text": "In the absence of any profit accruing to the 1st respondent as a result of the holding of the office of Chairman it cannot be said that he was holding an office of profit.",
      "speaker": "court",
      "significance": "Core holding on no disqualification."
    },
    {
      "text": "We are satisfied that the Board was not competent to fix a scale of pay for the Chairman by a resolution.",
      "speaker": "court",
      "significance": "Rejects petitioner's key contention on scale of pay."
    }
  ],
  "_case_id": "1974_334",
  "_label": 0,
  "_text_length": 9325,
  "_extracted_at": "2026-02-10T20:06:10.820689"
}