{
  "metadata": {
    "case_name": "Iqbal Ismail Sodawala v. State (Writ Petition Nos. 1522, 1523 and 1637 of 1973)",
    "case_year": 1973,
    "court": "Supreme Court of India",
    "judges": [
      "KHANNA, J."
    ],
    "case_number": "Writ Petition Nos. 1522, 1523 and 1637 of 1973",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Petitioner tried in the Court of Shri P. K. Gupte, Judge, City Civil and Sessions Court, Greater Bombay for offences under sections 392 and 397 Indian Penal Code.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Petitioner found guilty and sentenced to undergo rigorous imprisonment for seven years as per judgment dated May 12, 1972.",
      "type": "material",
      "date": "1972-05-12",
      "source": "lower_court"
    },
    {
      "id": "f3",
      "text": "After conviction, petitioner kept in Aurangabad jail and thereafter transferred to Nagpur Central Prison.",
      "type": "background",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "Petitioner asked for copy of judgment at time of pronouncement but informed it would be sent through jail authorities.",
      "type": "procedural",
      "date": "1972-05-12",
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "Jail authorities informed petitioner that despite communications, copy of judgment not available.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "Petitioner sent petition No. 1523 of 1973 from jail on January 12, 1973 and petition No. 1522 on January 22, 1973 for writ of habeas corpus.",
      "type": "procedural",
      "date": "1973-01-12",
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "Copy of judgment received by jail authorities on February 19, 1973 and handed over to petitioner.",
      "type": "procedural",
      "date": "1973-02-19",
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "Petitioner filed appeal on May 4, 1973 against judgment of Sessions Judge, dismissed by Bombay High Court on September 13, 1973.",
      "type": "procedural",
      "date": "1973-05-04",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Petitioner sent petition under section 561A CrPC by post to Bombay High Court in June 1973.",
      "type": "procedural",
      "date": "1973-06",
      "source": "petitioner"
    },
    {
      "id": "f10",
      "text": "Registrar of Bombay High Court declined to place petition before court as not accompanied by copy of register of petition duly filled by Jail Superintendent.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Shri Gupte stated judgments dictated in open court, final order intimated by Sheristedar; copy not immediately supplied as needed transcription from shorthand.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Can a convicted person be said to be lawfully imprisoned if at the time of his conviction the trial judge dictates the judgment but does not sign the same because of its having not been transcribed?",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the procedure adopted by Sessions Judge of dictating judgment in open court but apprising accused of result through Sheristedar is in accordance with law?",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Validity of order of Registrar of Bombay High Court declining to place petition received by post from prisoner unless accompanied by copy of register of petition duly filled by Jail Superintendent.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Judgment was not pronounced by Sessions Judge but only clerk apprised him of decision; no judgment could be pronounced till complete.",
      "supporting_facts": [
        "f2",
        "f11"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Sessions Judge must sign judgment at time of pronouncement; dictation without transcription does not justify departure from signing requirement.",
      "supporting_facts": [
        "f2",
        "f7"
      ],
      "legal_basis": "Sections 366, 367 CrPC"
    },
    {
      "id": "pa3",
      "text": "Detained for seven months without copy of judgment.",
      "supporting_facts": [
        "f4",
        "f5",
        "f6",
        "f7"
      ],
      "legal_basis": "Section 371 CrPC"
    },
    {
      "id": "pa4",
      "text": "High Court summary dismissal does not cause merger of trial court judgment.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": "U.J.S. Chopra v. State of Bombay"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Judgments ordinarily dictated in open court; final order intimated to accused by Sheristedar.",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Copy could not be immediately supplied as judgment had to be transcribed from shorthand.",
      "supporting_facts": [
        "f7",
        "f11"
      ],
      "legal_basis": null
    },
    {
      "id": "ra3",
      "text": "Judgment of Sessions Judge merged in High Court judgment upon dismissal of appeal.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Dictation of judgment including concluding part in open court by Sessions Judge tantamount to pronouncement; Sheristedar apprising accused of result does not introduce infirmity.",
      "addresses_issue": "i2",
      "key_observation": "Trial judges should convey result themselves but this is not fatal."
    },
    {
      "id": "cr2",
      "text": "Failure to sign judgment at pronouncement because not transcribed is procedural irregularity curable under section 537 CrPC unless occasions failure of justice.",
      "addresses_issue": "i1",
      "key_observation": "Judgment must be complete except for date and signature at pronouncement to enable prompt supply of copy."
    },
    {
      "id": "cr3",
      "text": "Delay of over nine months in supplying copy unjustified; affects right to appeal and bail; paucity of staff no excuse.",
      "addresses_issue": "i1",
      "key_observation": "Prompt transcription essential for liberty of subject."
    },
    {
      "id": "cr4",
      "text": "No failure of justice as judgment ultimately signed, copy supplied, appeal filed and dismissed by High Court.",
      "addresses_issue": "i1",
      "key_observation": "Procedural irregularity cured; conviction valid."
    },
    {
      "id": "cr5",
      "text": "Registrar's order valid; petitions from jail must be forwarded through Superintendent per rules to ensure authenticity.",
      "addresses_issue": "i3",
      "key_observation": "Safeguard against frivolous petitions."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Dictation of concluding part of judgment in open court is pronouncement even if not signed due to non-transcription; irregularity curable under s.537 CrPC absent failure of justice.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "No failure of justice occasioned; petitioner lawfully imprisoned as conviction affirmed on appeal.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Registrar's refusal to entertain petition not forwarded through jail superintendent upheld.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Firm Gokal Chand v. Firm Nand Ram",
      "citation": "AIR 1938 PC 292",
      "treatment": "followed",
      "relevance": "Failure to sign judgment is irregularity not nullifying it; court can supply defect."
    },
    {
      "case_name": "Surendra Singh Ors v. The State of Uttar Pradesh",
      "citation": "1954 SCR 330",
      "treatment": "followed",
      "relevance": "Section 537 CrPC cures procedural irregularities like signing unless failure of justice; small irregularities in authentication curable."
    },
    {
      "case_name": "U.J.S. Chopra v. State of Bombay",
      "citation": "1955 2 SCR 94",
      "treatment": "referred",
      "relevance": "On merger doctrine in summary dismissals."
    },
    {
      "case_name": "Queen-Empress v. Hargovind Singh Ors.",
      "citation": "ILR 14 All. 242",
      "treatment": "distinguished",
      "relevance": "Different facts with multiple illegalities and no judgment before sentencing."
    },
    {
      "case_name": "Velivalli Brahmaiah Ors. v. Emperor",
      "citation": "AIR 1930 Mad. 867",
      "treatment": "distinguished",
      "relevance": "Initials not sufficient; full signatures needed, but different context."
    }
  ],
  "statutes_cited": [
    {
      "name": "Code of Criminal Procedure, 1898",
      "sections": [
        "366(1)",
        "367(1)",
        "371(1)",
        "419",
        "420",
        "426(1)",
        "537",
        "561A"
      ],
      "relevance": "Pronouncement, writing, signing, supply of judgment copy, appeals from jail, bail, curing irregularities."
    },
    {
      "name": "Indian Penal Code, 1860",
      "sections": [
        "392",
        "397"
      ],
      "relevance": "Offences for which petitioner convicted."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 32"
      ],
      "relevance": "Basis for writ petitions including habeas corpus."
    },
    {
      "name": "Bombay Jail Manual, 1955",
      "sections": [
        "Rule 1416, Chapter XXXIX"
      ],
      "relevance": "Petitions from prisoners to be forwarded by Superintendent."
    },
    {
      "name": "Bombay High Court Appellate Side Rules, 1960",
      "sections": [
        "Rule 25, Chapter XXXVI"
      ],
      "relevance": "Applications from jail to be accompanied by register copy filled by Superintendent."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "All three writ petitions dismissed; habeas corpus prayer rejected as conviction valid despite procedural irregularity in not signing judgment at pronouncement, which is curable under s.537 CrPC with no failure of justice; Registrar's order upheld.",
    "relief_granted": "None",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The dictation of the concluding part of the judgment in open court by the learned Sessions Judge which should in the circumstances be taken to be tantamount to the pronouncement of the judgment.",
      "speaker": "court",
      "significance": "Defines valid pronouncement of judgment."
    },
    {
      "text": "A delay of more than nine months in the supply of copy of the judgment is wholly unjustified.",
      "speaker": "court",
      "significance": "Highlights urgency for prompt supply impacting appeal and bail rights."
    },
    {
      "text": "The failure of the learned Sessions Judge in not appending his signature to the judgment at the time it was pronounced because of the judgment having not till then been transcribed was a procedural irregularity which would not vitiate the conviction of the accused.",
      "speaker": "court",
      "significance": "Core holding on curable irregularity."
    },
    {
      "text": "Small irregularities in the manner of pronouncement or the mode of delivery do not matter but the substance of the thing must be there.",
      "speaker": "court",
      "significance": "From Surendra Singh, emphasizing substance over form."
    }
  ],
  "_case_id": "1974_213",
  "_label": 0,
  "_text_length": 25493,
  "_extracted_at": "2026-02-10T20:05:31.961513"
}