{
  "metadata": {
    "case_name": "Appellants v. Ludhiana Improvement Trust & Ors.",
    "case_year": 1971,
    "court": "Supreme Court of India",
    "judges": [
      "GOSWAMI, J."
    ],
    "case_number": "Civil Appeals Nos. 345, 347 to 349 of 1971",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Land measuring 165 acres including the appellants' land measuring 6 bighas, 4 biswas and 17 biswasi, comprised in various khasra numbers situated in the revenue estate of Piru Banda within the municipal limits of Ludhiana Municipal Committee, was acquired for a development scheme of the Ludhiana Improvement Trust styled as Model Town Extension Scheme No.1.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Notification under section 36 of the Punjab Town Improvement Act published on September 16, 1960.",
      "type": "procedural",
      "date": "1960-09-16",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Land Acquisition Collector, Improvement Trust, Ludhiana, made his award on March 31, 1964, classifying the land under three categories: belt A at Rs. 60/-, belt B at Rs. 40/-, and belt C at Rs. 20/- per square yard.",
      "type": "procedural",
      "date": "1964-03-31",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Appellant and other landowners made applications under section 18 of the Land Acquisition Act for reference to the Tribunal constituted under the Improvement Act.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Tribunal took up all references together and delivered a common judgment on October 16, 1968, modifying the award for appellant in C.A. No. 345/1971 by raising belt C from Rs. 20/- to Rs. 30/- per square yard and upholding belt B at Rs. 40/- per square yard.",
      "type": "procedural",
      "date": "1968-10-16",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Appellant challenged Tribunal's order by writ petition in Punjab and Haryana High Court, which dismissed it following an earlier decision on February 5, 1970, but granted certificate under Article 133(1)(a).",
      "type": "procedural",
      "date": "1970-02-05",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether Section 59(a) of the Punjab Town Improvement Act, 1922 is ultra vires Article 14 of the Constitution.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether the Tribunal took a wrong principle into consideration in determining compensation of the lands acquired.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether the Tribunal has not applied its own rule as to the rate of compensation uniformly to the different appellants.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "There is no guideline in the Improvement Act itself for determining compensation; by Section 59(a), Tribunal not deemed Court for Section 54 LA Act, and under 59(d) Tribunal award final, denying right of appeal available under LA Act, leading to discrimination under Article 14 when land could be acquired under LA Act.",
      "supporting_facts": [
        "f1",
        "f2"
      ],
      "legal_basis": "Section 59(a), 59(d) Punjab Town Improvement Act; Section 54 Land Acquisition Act; Article 14 Constitution"
    },
    {
      "id": "pa2",
      "text": "Tribunal took into account only sale deeds executed prior to notification under Section 36 (September 16, 1960), including within five years before, but refused post-notification sales, which is unreasonable and wrong principle.",
      "supporting_facts": [
        "f2",
        "f5"
      ],
      "legal_basis": "Section 23 Land Acquisition Act; Para 10 Schedule to Improvement Act"
    },
    {
      "id": "pa3",
      "text": "Tribunal has not applied its own rule as to the rate of compensation uniformly to the different appellants.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Improvement Act adopts LA Act principles referentially via Section 59 with modifications; land under Improvement Act reasonably classified due to scheme requirements, pre-acquisition procedures, and town improvement object; denial of appeal avoids delay, not violative of Article 14.",
      "addresses_issue": "i1",
      "key_observation": "Acquisition under Improvement Act admits of reasonable basis of classification; right of appeal is statutory, not fundamental."
    },
    {
      "id": "cr2",
      "text": "Material date is notification under Section 36 (Sept 16, 1960); post-notification sales affected by speculation, not reliable guide; Tribunal correctly ignored them.",
      "addresses_issue": "i2",
      "key_observation": "Post-notification sales reflect potentiality due to acquisition notification."
    },
    {
      "id": "cr3",
      "text": "No case of gross injustice or discrimination made out regarding quantum of compensation.",
      "addresses_issue": "i3",
      "key_observation": "Unable to interfere with Tribunal's quantum."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Section 59(a) of Punjab Town Improvement Act not ultra vires Article 14.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Tribunal adopted correct principles by considering only pre-notification sales for market value.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "No interference with quantum of compensation absent gross injustice.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Punjab Town Improvement Act, 1922",
      "sections": [
        "Section 3",
        "Sections 22 to 44",
        "Section 36",
        "Section 42",
        "Section 59(a)",
        "Section 59(d)",
        "Section 60",
        "Schedule Para 10"
      ],
      "relevance": "Governs acquisition for town improvement schemes; modifies LA Act application; Tribunal award final."
    },
    {
      "name": "Land Acquisition Act, 1894",
      "sections": [
        "Section 4",
        "Section 6",
        "Section 18",
        "Section 23",
        "Section 54"
      ],
      "relevance": "Applied with modifications for compensation determination; material date notification; right of appeal denied."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 14",
        "Article 133(1)(a)"
      ],
      "relevance": "No violation by reasonable classification; certificate for appeal."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeals challenging Section 59(a) of the Punjab Town Improvement Act as ultra vires Article 14, the Tribunal's principles for compensation, and uniformity of rates were rejected; Tribunal's award upheld.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "It is well settled that article 14 does not abhor a reasonable classification provided the basis of the classification has a rational relation to the object to be achieved by the Act.",
      "speaker": "court",
      "significance": "Core reasoning upholding Section 59(a) against Article 14 challenge."
    },
    {
      "text": "Right of appeal is a creature of the statute and mere denial or taking away of such a right under the law cannot be considered as an infringement of a persons fundamental right.",
      "speaker": "court",
      "significance": "Rejects argument on denial of appeal as violating Article 14."
    },
    {
      "text": "The sale that takes place after the date of a notification under section 36... cannot be taken as a reasonable guide for determination of compensation.",
      "speaker": "court",
      "significance": "Justifies ignoring post-notification sales."
    }
  ],
  "_case_id": "1974_384",
  "_label": 0,
  "_text_length": 13649,
  "_extracted_at": "2026-02-10T20:06:40.989004"
}