{
  "metadata": {
    "case_name": "Commissioner of Income Tax v. Nizam Mir Osman Ali Khan Bahadur",
    "case_year": 1970,
    "court": "Supreme Court of India",
    "judges": [
      "KHANNA, J."
    ],
    "case_number": "Civil Appeals Nos. 1184 to 1186 and 1198 to 1200 of 1970",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Nizam Mir Osman Ali Khan Bahadur was the Ruler of Hyderabad State prior to its integration with the Union of India. Matter relates to his assessment for years 1952-53, 1953-54 and 1954-55.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Prince Muazzam Jah Bahadur, second son of the assessee, married Princess Niloufer in Nice, France on November 12, 1931 according to Muslim rites.",
      "type": "background",
      "date": "1931-11-12",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On October 8, 1949, assessee made a settlement of Rs. 30,00,000 by transferring that amount to a trust created on that day for the benefit of Princess Niloufer. Trustees: assessee, Sir Sultan Ahmed and Shavax Ardeshir Lal (nominee of Government of India).",
      "type": "material",
      "date": "1949-10-08",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On October 8, 1949, agreement entered into between Government of India, assessee (as settlor) and the three trustees for deposit of Rs. 30,00,000 with Government of India at 1% interest per annum free of income-tax, super-tax and all other taxes. Government to pay Rs. 1,00,000 per year (interest + from corpus) free of tax until corpus exhausted.",
      "type": "material",
      "date": "1949-10-08",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Trust deed: Trustees to deposit Rs. 30,00,000 with Government per agreement. Pay net interest recovered from Government to Princess free of tax until death/remarriage (or post-divorce if not her fault). Pay top-up from corpus to make Rs. 1,00,000 per year free of tax. On Princess's death, corpus to her issues per Muslim law, then to settlor or Nizam.",
      "type": "material",
      "date": "1949-10-08",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Unhappy differences arose between Prince Muazzam Jah Bahadur and Princess Niloufer; they lived separately. No child born.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "On September 18, 1952, two documents executed: (1) Dissolution of marriage of Prince and Princess. Trustees opined dissolution not due to any act or default on part of Princess Niloufer. (2) Deed of release by Princess Niloufer, assessee, Prince, trustees of Princess Niloufer Trust and trustees of another trust for Prince.",
      "type": "material",
      "date": "1952-09-18",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Deed of release: Princess Niloufer received Rs. 10,00,000 from assessee and released/assigned/transferred her rights in Princess Niloufer Trust (net interest and top-up to Rs. 1,00,000 per year) to assessee free of income-tax etc. Trustees covenanted to pay Rs. 1,00,000 per year to assessee free of tax until Princess's death/remarriage.",
      "type": "material",
      "date": "1952-09-18",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Pursuant to release deed, Rs. 1,00,000 received from Government under 1949 agreement (previously paid to Princess) was paid to assessee during each of the three years 1952-53 to 1954-55.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Income-tax Officer held Rs. 1,00,000 per year by assessee from trustees is income liable to tax. Affirmed by Appellate Assistant Commissioner and Tribunal.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "On reference under s.66(1) of 1922 Act, Andhra Pradesh High Court held Rs. 1,00,000 is income but assessee entitled to exemption under 1949 agreement dated October 8, 1949. Assessee stands in shoes of Princess Niloufer.",
      "type": "procedural",
      "date": "1969-07-25",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Rate of interest on Government/gilt-edged securities at time of 1949 agreement was 3.5 to 4% per annum.",
      "type": "background",
      "date": "1949-10-08",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "During the three years, Government acted upon 1949 agreement by paying Rs. 1,00,000 despite transfer to assessee.",
      "type": "admitted",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether, on the facts of the case, the sum of Rs. 1,00,000/- received by the assessee from the Trustees of Princess Niloufer Trust constituted income under the Indian Income-tax Act, 1922 and if so, whether the assessee was entitled to exemption from tax in respect of the income under the terms of the agreement entered into with the Government of India on October 8, 1949.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Exemption from tax on Rs. 1,00,000 under trust deed could be availed only by Princess Niloufer. Assessee as transferee of her rights cannot get benefit of exemption. Onus on assessee to prove exemption, which is not discharged.",
      "supporting_facts": [
        "f5",
        "f8"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Assessee as settlor divested of ownership of Rs. 30,00,000 upon creation of trust.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Princess Niloufer could not transfer her beneficial interest to assessee.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": null
    },
    {
      "id": "pa4",
      "text": "Taxing authorities can look to substance over form; legal effect of transaction determines taxability.",
      "supporting_facts": [],
      "legal_basis": "Commissioner of Income Tax Gujarat II v. B. M. Kharwar"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Fair reading of agreement dated October 8, 1949 shows exemption from tax on Rs. 1,00,000 not confined to Princess Niloufer but available to assessee.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Rs. 1,00,000 is income in hands of assessee, as held by High Court.",
      "addresses_issue": "i1",
      "key_observation": "High Court correctly held it is income."
    },
    {
      "id": "cr2",
      "text": "Agreement dated October 8, 1949 between GoI, assessee and trustees provides comprehensive tax exemption on interest and Rs. 1,00,000 payments from Rs. 30L deposit. Exemption not restricted to Princess Niloufer but extends to settlor, trustees, any beneficiaries. Assessee as settlor and now beneficiary via release steps into her shoes.",
      "addresses_issue": "i1",
      "key_observation": "Basic scheme: Rs. 1,00,000 payments tax-free. Quid pro quo for low 1% interest vs market 3.5-4%. No special favour to Princess personally."
    },
    {
      "id": "cr3",
      "text": "GoI aware of trust deed recitals divesting settlor, yet explicitly exempted settlor from tax on income/corpus.",
      "addresses_issue": "i1",
      "key_observation": "Exemption intention covers settlor regardless."
    },
    {
      "id": "cr4",
      "text": "Princess Niloufer competent to transfer interest under s.58 Indian Trusts Act, 1882; transfer at time of divorce, not during marriage.",
      "addresses_issue": "i1",
      "key_observation": "Transfer valid."
    },
    {
      "id": "cr5",
      "text": "GoI continued payments under agreement post-transfer, linking low interest deposit to tax exemption.",
      "addresses_issue": "i1",
      "key_observation": "Anomalous to withhold exemption while retaining deposit benefits."
    },
    {
      "id": "cr6",
      "text": "No equity in tax, but here question is construction of agreement terms and parties' intention.",
      "addresses_issue": "i1",
      "key_observation": "Parties never contemplated tax on settlor receiving Rs. 1,00,000."
    },
    {
      "id": "cr7",
      "text": "CIT v. B.M. Kharwar applies to determine true legal relation, but here agreement terms govern; payment covered by agreement, so exempt.",
      "addresses_issue": "i1",
      "key_observation": "Cannot ignore legal effect of agreement."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Sum of Rs. 1,00,000 received by assessee constitutes income under Income-tax Act, 1922, but assessee entitled to exemption under agreement dated October 8, 1949.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Decision of this Court in respect of the assessment of this very assessee for previous years",
      "citation": "59 ITR 666",
      "treatment": "followed",
      "relevance": "Decided most questions in light of this for previous years."
    },
    {
      "case_name": "Commissioner of Income Tax Gujarat II v. B. M. Kharwar",
      "citation": null,
      "treatment": "referred",
      "relevance": "Tax authorities determine true legal relation; cannot displace legal effect by substance."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act, 1922",
      "sections": [
        "Section 66(1)"
      ],
      "relevance": "Reference to High Court on question whether Rs. 1,00,000 is income and exempt."
    },
    {
      "name": "Indian Trusts Act, 1882",
      "sections": [
        "Section 58"
      ],
      "relevance": "Beneficiary competent to transfer interest, subject to law; proviso not applicable as transfer post-dissolution of marriage."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court upholds Andhra Pradesh High Court judgment that Rs. 1,00,000 per year received by assessee is income but exempt from tax under terms of agreement dated October 8, 1949 between Government of India, assessee and trustees.",
    "relief_granted": "Exemption from tax on Rs. 1,00,000 for assessment years 1952-53, 1953-54, 1954-55",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The short question which arises for determination... is whether... the sum of Rs. 1,00,000/- received by the assessee from the Trustees of Princess Niloufer Trust constituted income under the Indian Income-tax Act, 1922... and if so, whether the assessee was entitled to exemption from tax...",
      "speaker": "court",
      "significance": "Frames the core issue."
    },
    {
      "text": "We are of the opinion that a fair reading of the agreement shows that the basic scheme of the agreement was that the payment of Rs. 1,00,000 under the agreement would be exempted from the payment of tax.",
      "speaker": "court",
      "significance": "Crux of reasoning on exemption's scope."
    },
    {
      "text": "There is nothing in the agreement that the Government wanted to show a special favour to Princess Niloufer personally and that the same would have been withheld in case the person entitled to receive Rs. 1,00,000 was not the princess but her father-in-law.",
      "speaker": "court",
      "significance": "Rejects limitation to Princess only."
    }
  ],
  "_case_id": "1974_273",
  "_label": 0,
  "_text_length": 28765,
  "_extracted_at": "2026-02-10T20:05:34.462307"
}