{
  "metadata": {
    "case_name": "Appellant v. Delhi Municipal Corporation",
    "case_year": 1970,
    "court": "Supreme Court of India",
    "judges": [
      "BEG, J."
    ],
    "case_number": "Criminal Appeal No. 199 of 1970",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "On 17-3-1967 at 4:30 p.m. in Rameshwar Nagar, appellant obstructed Sarvshri Rattan Singh, Maharaj Singh, Raghbir Singh, Section Inspectors, and Dunger, a Peon of the Delhi Municipal Corporation, when they went to seize a buffalo belonging to the appellant to realise milk tax arrears of Rs. 153.75 plus Rs. 10 recovery charges.",
      "type": "material",
      "date": "1967-03-17",
      "source": "prosecution"
    },
    {
      "id": "f2",
      "text": "Appellant struck Rattan Singh on the nose with the result that it bled and was fractured.",
      "type": "material",
      "date": "1967-03-17",
      "source": "prosecution"
    },
    {
      "id": "f3",
      "text": "Appellant convicted under Section 353/332/333 IPC by trial court, sentenced to one year rigorous imprisonment on each count and fine of Rs. 400/-, in default four months further rigorous imprisonment under Section 333 IPC.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f4",
      "text": "Delhi High Court confirmed conviction and sentence on 12th November 1969 in Criminal Appeal No. 103 of 1968.",
      "type": "procedural",
      "date": "1969-11-12",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Commissioner issued order dated 22-7-1959 under Section 491 DMC Act delegating powers to Inspectors of the Corporation.",
      "type": "background",
      "date": "1959-07-22",
      "source": "respondent"
    },
    {
      "id": "f6",
      "text": "Appellant objected to taking of buffalo and as it was of no avail, gave blow to Rattan Singh.",
      "type": "disputed",
      "date": "1967-03-17",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Appellant did not plead that officers were not known to him as Inspectors or that they could not show authority.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Appellant told officers he did not have ready money to pay instantly but did not refuse to pay.",
      "type": "admitted",
      "date": "1967-03-17",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether attempt to realise milk tax by seizing buffalo was illegal due to non-compliance with Section 154 DMC Act notice of demand, entitling appellant to right of private defence.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether Inspectors were duly empowered by Commissioner to seize buffalo under Section 491 DMC Act.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether Inspectors acted in good faith under colour of office protected by Section 99 IPC.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Attempt to realize Rs. 153.75 as arrears of milk tax together with Rs. 10/- as recovery charges was illegal due to non-compliance with provisions of Delhi Municipal Corporation Act, 1957, particularly notice of demand under Section 154, entitling appellant to right of private defence.",
      "supporting_facts": [
        "f1",
        "f5"
      ],
      "legal_basis": "Delhi Municipal Corporation Act, 1957 Sections 154, 155; IPC Section 99"
    },
    {
      "id": "pa2",
      "text": "Inspectors not duly empowered by Commissioner to seize buffalo.",
      "supporting_facts": [
        "f1",
        "f5"
      ],
      "legal_basis": "Delhi Municipal Corporation Act, 1957 Section 491"
    },
    {
      "id": "pa3",
      "text": "Person is defaulter under Section 161 only after notice under Section 154 and non-payment within 30 days per Section 155; recoveries under Sections 156, 157, 159 require notice.",
      "supporting_facts": [
        "f1"
      ],
      "legal_basis": "Delhi Municipal Corporation Act, 1957 Sections 152-159, 161"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Section 161 DMC Act empowers Inspectors to seize and remove buffalo for non-payment of tax at any time after tax due, overriding other provisions.",
      "supporting_facts": [
        "f1"
      ],
      "legal_basis": "Delhi Municipal Corporation Act, 1957 Section 161"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Section 491 does not require delegation to every Inspector by name; general order to class of officers sufficient.",
      "addresses_issue": "i2",
      "key_observation": "Supported by Kanwar Singh vs. Delhi Administration."
    },
    {
      "id": "cr2",
      "text": "No contention that Inspectors did not act under colour of office; Section 99 IPC protects public servant acting in good faith under colour of office though act not strictly justifiable.",
      "addresses_issue": "i3",
      "key_observation": "Appellant did not plead lack of knowledge or authority."
    },
    {
      "id": "cr3",
      "text": "Section 161 power to seize after tax due is drastic; prefer interpretation confining to defaulter under Sections 154-155 (notice required, non-payment in 30 days).",
      "addresses_issue": "i1",
      "key_observation": "Notice optional but required to invoke Section 161."
    },
    {
      "id": "cr4",
      "text": "Inspectors acted honestly under delegated powers; error in procedure does not vitiate good faith; no prior decision on point; High Court view supported no legal defect.",
      "addresses_issue": "i3",
      "key_observation": "Appellant only said no ready money, did not refuse."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Delegation under Section 491 valid via general order to class of Inspectors.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Section 161 seizure power confined to defaulters under Sections 154-155 requiring notice of demand.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h3",
      "text": "No right of private defence under Section 99 IPC as Inspectors acted in good faith under colour of office despite procedural error.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Kanwar Singh vs. Delhi Administration",
      "citation": "1965 (1) SCR p. 711",
      "treatment": "followed",
      "relevance": "Delegation of powers under Section 491 DMC Act by general order to class of officers sufficient."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Penal Code, 1860",
      "sections": [
        "Section 99",
        "Section 332",
        "Section 333",
        "Section 353"
      ],
      "relevance": "No right of private defence against public servant acting in good faith under colour of office; convictions under 353/332/333."
    },
    {
      "name": "Delhi Municipal Corporation Act, 1957",
      "sections": [
        "Section 152",
        "Section 153",
        "Section 154",
        "Section 155",
        "Section 156",
        "Section 157",
        "Section 159",
        "Section 161",
        "Section 491"
      ],
      "relevance": "Tax due dates; no bill for animal tax; notice of demand required for default; seizure power under 161 confined to defaulters post-notice; delegation to Inspectors."
    }
  ],
  "outcome": {
    "disposition": "partially_accepted",
    "summary": "Supreme Court maintained convictions under Sections 353/332/333 IPC but reduced sentences to period already undergone and set aside fine, finding Inspectors protected by Section 99 IPC despite procedural irregularity in tax recovery.",
    "relief_granted": "Sentences reduced to period already undergone; fine of Rs. 400 set aside.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"There is no right of private defence against an act which does not reasonably cause the apprehension of death or of grievous hurt, if done, or attempted to be done, by a public servant acting in good faith under colour of his office, though that act may not be strictly justifiable by law.\"",
      "speaker": "court",
      "significance": "Quotes Section 99 IPC, central to upholding protection for Inspectors."
    },
    {
      "text": "Out of two possible interpretations, the one which confines the content of such power of seizure to reasonable limits and fair modes of operation should be preferred lest the validity of the provision itself becomes questionable.",
      "speaker": "court",
      "significance": "Principle for interpreting Section 161 DMC Act to require notice."
    }
  ],
  "_case_id": "1974_152",
  "_label": 0,
  "_text_length": 12950,
  "_extracted_at": "2026-02-10T20:04:49.816745"
}