{
  "metadata": {
    "case_name": "Writ Petition Nos. 1678 and 1855 of 1973 (Mohd. Alam and Jiten Ninia v. State of West Bengal)",
    "case_year": 1973,
    "court": "Supreme Court of India",
    "judges": [
      "Sarkaria, J."
    ],
    "case_number": "Writ Petitions Nos. 1678 and 1855 of 1973",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Petitioner in Writ Petition No. 1678 of 1973 (Mohd. Alam) is in detention since January 15, 1972 in pursuance of an order dated January 14, 1972, passed under s. 3(2) of the Maintenance of Internal Security Act, 1971 by the District Magistrate, Burdwan.",
      "type": "procedural",
      "date": "1972-01-15",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Detention order confirmed by the Government on April 12, 1972 under S. 12(1) of the Act, directs that the detention will continue till the expiration of 12 months from the date of his detention or until the expiry of Defence of India Act, 1971 whichever is later.",
      "type": "procedural",
      "date": "1972-04-12",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Counter-affidavit filed by Shri Sukumar Sen, Deputy Secretary, Home (Special) Department, Government of West Bengal, stating receipt of reliable information relating to illegal anti-social and prejudicial activities of detenu-petitioner relating to maintenance of Supplies and Services essential to the community.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f4",
      "text": "Detenu-petitioner described as a veteran copper wire criminal. Two instances of thefts of copper wire or cable used for telecommunication services on December 19, 1971 and December 22, 1971.",
      "type": "background",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f5",
      "text": "Grounds of detention: On 19-12-1971 at about 00-30 hrs., detenu along with associates Md. Kasim and Hyder Ali took away 40 kgs. underground copper wire cable from St. Patric School compound, P.S. Asansol, Dist. Burdwan, disrupting telecommunication service between Panagarh Army Base Camp and Patna for 6 hours.",
      "type": "disputed",
      "date": "1971-12-19",
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "Grounds of detention: Between 22-12-71 28.30 hrs. and 23-12-71 00.30 hrs., detenu along with associates Md. Kasim and Hyder Ali took away 80 kgs. underground copper wire cable from St. Patric School compound, P.S. Asansol, Dist. Burdwan, disrupting service for 8 hours.",
      "type": "disputed",
      "date": "1971-12-22",
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Petitioner alleged wrongful arrest and detention for 22 days in police station, then detention order foisted on false charges concocted by police and detaining authority from ulterior motives.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "In Writ Petition No. 1855 of 1973, petitioner (Jiten Ninia) is a person of desperate and dangerous character and veteran copper wire stealer. Two instances of theft of underground post and telegraph telecommunication cables over 2-1/2 months communicated.",
      "type": "background",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f9",
      "text": "Undisclosed material about Jiten Ninia: Originally from Dumka, temporary loading coolie in colliery, no education, no landed property, addicted to wine, gambling, close association with criminals, mode of living beyond means, committing petty thefts, in contact with copper wire criminals, committing thefts of P.T. telecommunication cables and D.V.C. cables, dangerous and desperate character.",
      "type": "background",
      "date": null,
      "source": "respondent"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether theft of telecommunication copper wire disrupts 'supplies and services essential to the community' under s. 3(1)(a)(iii) of MISA, or only services, making the ground irrelevant and vague.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether the period of detention fixed as 12 months or until expiry of Defence of India Act, 1971 (whichever later) is indefinite and uncertain, infringing Article 22(7)(b).",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether failure of District Magistrate to file counter-affidavit, and stereotyped affidavit by Deputy Secretary without personal knowledge, is sufficient.",
      "framed_by": "petitioner"
    },
    {
      "id": "i4",
      "text": "Whether grounds of detention were false, vague, deficient; and whether all material (e.g., showing detenu as veteran copper wire criminal) was communicated, violating Article 22(5).",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Theft of telecommunication wire disrupts services but has no connection with maintenance of supplies. In s. 3(1)(a)(iii), 'supplies and services' to be read disjunctively; ground re supplies irrelevant and vague; no particulars communicated, violating Art. 22(5).",
      "supporting_facts": [
        "f5",
        "f6"
      ],
      "legal_basis": "s. 3(1)(a)(iii) MISA; Art. 22(5)"
    },
    {
      "id": "pa2",
      "text": "Period of detention indefinite and uncertain, co-extensive with life of Defence of India Act, 1971, infringing Art. 22(7)(b).",
      "supporting_facts": [
        "f2"
      ],
      "legal_basis": "Art. 22(7)(b)"
    },
    {
      "id": "pa3",
      "text": "District Magistrate did not furnish affidavit; no explanation why; stereotyped affidavit of Deputy Secretary without personal dealing insufficient to rebut allegations of false grounds and mala fides.",
      "supporting_facts": [
        "f3",
        "f7"
      ],
      "legal_basis": null
    },
    {
      "id": "pa4",
      "text": "Grounds false, vague, deficient; all material showing veteran copper wire criminal not communicated, depriving right to effective representation.",
      "supporting_facts": [
        "f4",
        "f7"
      ],
      "legal_basis": "Art. 22(5)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Received reliable information of illegal anti-social prejudicial activities relating to maintenance of supplies and services essential to community; detenu is veteran copper wire criminal; specific instances of thefts mentioned.",
      "supporting_facts": [
        "f3",
        "f4",
        "f5",
        "f6"
      ],
      "legal_basis": "s. 3 MISA"
    },
    {
      "id": "ra2",
      "text": "Explanation for no affidavit by DM: Preoccupied with maintenance of law and order and procurement of rice.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Expression 'Supplies and Services' in s. 3(1)(a)(iii) construed pragmatically; telecommunication copper wire is both supply and service essential to community; theft affects both.",
      "addresses_issue": "i1",
      "key_observation": "Copper wire and cables used for telecommunications are at once supplies and services."
    },
    {
      "id": "cr2",
      "text": "Period of detention not indefinite; concluded by Fagu Shah v. State of WB; maximum period can be tied to emergency duration.",
      "addresses_issue": "i2",
      "key_observation": "Power to detain must be adequate in duration to cope with emergency."
    },
    {
      "id": "cr3",
      "text": "Proper person for counter-affidavit is DM or senior officer who dealt with case; Deputy Secretary's stereotyped affidavit on records insufficient, especially with mala fides allegations; but not fatal alone due to imprecise allegations.",
      "addresses_issue": "i3",
      "key_observation": "Onus on State to show procedure followed; not empty formality."
    },
    {
      "id": "cr4",
      "text": "Material showing detenu as veteran copper wire criminal (implying repeated crimes) not communicated; contributed to subjective satisfaction; non-communication violates Art. 22(5), depriving effective representation; detention illegal.",
      "addresses_issue": "i4",
      "key_observation": "All grounds/material enabling effective representation must be communicated unless privileged under Art. 22(6)."
    },
    {
      "id": "cr5",
      "text": "Similar in second petition: Undisclosed material about desperate character, veteran stealer, criminal propensity influenced detention; non-communication prejudiced representation.",
      "addresses_issue": "i4",
      "key_observation": "Omission seriously prejudiced right to effective representation."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Theft of copper wire for telecommunication is prejudicial to maintenance of supplies and services essential to community under s. 3(1)(a)(iii) MISA.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Period of detention tied to Defence of India Act expiry is valid maximum period under Art. 22(7)(b).",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Non-communication of material regarding detenu's veteran/habitual criminal status violates Art. 22(5); detention illegal.",
      "resolves_issue": "i4",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Blackpool Corporation v. Locker",
      "citation": "1948 1 K.B. 349",
      "treatment": "followed",
      "relevance": "Provisions of housing accommodation within supplies and services."
    },
    {
      "case_name": "Jagdish Prasad v. State of Bihar",
      "citation": "Writ Petition No. 1972 of 1973 etc. decided on 20-12-1973",
      "treatment": "followed",
      "relevance": "Meaning of supplies and services in context of hoarding; essential commodities are both supplies and services."
    },
    {
      "case_name": "Fagu Shah etc. v. State of West Bengal",
      "citation": null,
      "treatment": "followed",
      "relevance": "Period of detention tied to emergency duration is valid maximum under Art. 22(7)(b)."
    },
    {
      "case_name": "Shaik Hanif v. State of West Bengal",
      "citation": "Writ Petition No. 1679 of 1973",
      "treatment": "followed",
      "relevance": "Proper person to file counter-affidavit in habeas corpus is District Magistrate or senior officer who dealt with case."
    }
  ],
  "statutes_cited": [
    {
      "name": "Maintenance of Internal Security Act, 1971",
      "sections": [
        "s. 3(1)(a)(iii)",
        "s. 3(2)",
        "s. 12(1)",
        "s. 13"
      ],
      "relevance": "Basis for detention order; grounds prejudicial to supplies and services essential to community."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 32",
        "Art. 22(5)",
        "Art. 22(6)",
        "Art. 22(7)(b)"
      ],
      "relevance": "Right to be informed of grounds and make representation; privilege for non-disclosure; maximum detention period."
    },
    {
      "name": "Defence of India Act, 1971",
      "sections": [],
      "relevance": "Detention period linked to its expiry."
    },
    {
      "name": "Defence of India Rules, 1971",
      "sections": [
        "s. 36(3)"
      ],
      "relevance": "Defines essential commodity including light, power, etc., as supplies/services."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Both writ petitions allowed; detention orders set aside; petitioners directed to be set at liberty forthwith due to non-communication of material essential for effective representation under Art. 22(5).",
    "relief_granted": "Petitioners set at liberty forthwith.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"No body is born a criminal, much less a habitual or veteran criminal- It takes time for one, to become so. The adjective veteran which is synonymous with habitual implies a long course of recurring or persistent criminal behaviour.\"",
      "speaker": "court",
      "significance": "Explains why undisclosed 'veteran criminal' material was essential ground for detention."
    },
    {
      "text": "\"The non-communication of that material was violative of Article 22(5) of the Constitution and the Act inasmuch as it did not intimate to the detenu the full grounds or material to enable him to make an effective representation.\"",
      "speaker": "court",
      "significance": "Core holding declaring detention illegal."
    },
    {
      "text": "\"all supplies are not services and all services are not supplies but the complex needs and amenities of modern life ... mingle supplies and services so much that the concentric circle geometry becomes a misleading stroke.\"",
      "speaker": "court",
      "significance": "From Jagdish Prasad; clarifies supplies and services overlap for essential commodities like copper wire."
    }
  ],
  "_case_id": "1974_28",
  "_label": 1,
  "_text_length": 20379,
  "_extracted_at": "2026-02-10T20:03:27.645767"
}