{
  "metadata": {
    "case_name": "Appellant (Tenant) v. Respondent (Landlord)",
    "case_year": 1970,
    "court": "Supreme Court of India",
    "judges": [
      "BHAGWATI, J."
    ],
    "case_number": "Civil Appeal No. 2180 of 1970",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Respondent is owner of house in Lohia Bazar, Gwalior, consisting of shop on ground floor (Lohia Bazar shop) and residential accommodation on first floor. Respondent occupies residential accommodation.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Appellant in possession of Lohia Bazar shop as tenant for about 30 years, carrying on business as dealer in iron and steel materials. Rent originally Rs.8/- per month, increased to Rs.25/- per month by 1946.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Towards end of 1952, respondent filed first suit for eviction claiming genuine requirement for personal use. Trial Court decreed eviction. Additional District Judge reversed decree on 8th December 1956 under Madhya Bharat Premises Restriction Act, Sy. 2006, as non-residential premises requirement not valid ground.",
      "type": "procedural",
      "date": "1952-12-08",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Shortly after dismissal, respondent filed second suit under Madhya Pradesh Accommodation Control Act, 1955, claiming need for continuing grocery business (Phalke Bazar shop notice to quit) and later amended in March 1959 to starting iron and steel business. Trial Court decreed eviction. Additional District Judge reversed on 4th August 1962 under section 4(h) due to other accommodation (Phalke Bazar shop).",
      "type": "procedural",
      "date": "1959-03-04-1962-08-04",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "On 15th September 1962, respondent entered lease deed with appellant for Lohia Bazar shop for 2 years at Rs.60/- per month.",
      "type": "material",
      "date": "1962-09-15",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Lease expired on 15th September 1964, but appellant continued in possession as monthly tenant at Rs.60/- per month.",
      "type": "procedural",
      "date": "1964-09-15",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Sometime in 1964, respondent voluntarily surrendered Phalke Bazar shop (rented from Vishwanath), closed grocery business. Appellant alleged surrender for premium, but not established by Trial Court or First Appellate Court.",
      "type": "disputed",
      "date": "1964",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Respondent had no other occupation after closing grocery business.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "On 17th August 1966, respondent filed third suit for eviction under section 12(1)(f) Madhya Pradesh Accommodation Control Act, 1961, claiming bona fide requirement of Lohia Bazar shop for starting business as dealer in iron and steel materials. Arrears of rent ground abandoned.",
      "type": "material",
      "date": "1966-08-17",
      "source": "petitioner"
    },
    {
      "id": "f10",
      "text": "Appellant disputed bona fides of requirement and claimed respondent had other accommodation.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f11",
      "text": "Trial Court found respondent without occupation for two years prior, no other shop, bona fide required shop for new business; negatived appellant's plea of commission agent/moneylender business; decreed eviction.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Additional District Judge (final court of fact) found: respondent 63 years old, new business, no preparations (capital, permits), delay of two years after lease expiry, no positive proof of bona fides; set aside decree, dismissed suit.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "High Court in second appeal reversed Additional District Judge, held no need for preparations proof, respondent's unchallenged statement + objective facts (prior claim since 1959, unemployment) established bona fides, no other shop; restored Trial Court decree dated 14th August 1970.",
      "type": "procedural",
      "date": "1970-08-14",
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "Appellant filed appeal by special leave to Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the finding of the Additional District Judge that the respondent did not bona fide require the Lohia Bazar shop for starting business as dealer in iron and steel materials is a pure finding of fact or mixed question of law and fact, and whether High Court could interfere in second appeal.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the High Court exceeded jurisdiction in second appeal by reversing the finding of fact on bona fide requirement.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "High Court exceeded jurisdiction in second appeal by interfering with pure finding of fact by Additional District Judge on absence of bona fide requirement; jurisdiction limited to errors of law.",
      "supporting_facts": [
        "f12"
      ],
      "legal_basis": "Second appeal jurisdiction under Madhya Pradesh law; settled law that lower appellate court final on facts unless perverse."
    },
    {
      "id": "pa2",
      "text": "Additional District Judge's finding supported by evidence: no preparations, delay, new business at age 63, persistent eviction attempts since 1952.",
      "supporting_facts": [
        "f2",
        "f3",
        "f4",
        "f6",
        "f12"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Finding on bona fide requirement is mixed question of law and fact; High Court entitled to examine correctness.",
      "supporting_facts": [
        "f9",
        "f11"
      ],
      "legal_basis": "Smt. Kamla Soni v. Rup Lal Mehra"
    },
    {
      "id": "ra2",
      "text": "Additional District Judge erred in requiring proof of preparations (capital, permits) and in considering demand for whole shop irrelevant.",
      "supporting_facts": [
        "f7",
        "f8"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "High Court in second appeal cannot re-appreciate evidence or interfere with pure findings of fact by lower appellate court unless error of law, no evidence, or perverse.",
      "addresses_issue": "i1",
      "key_observation": "Bona fide requirement is pure question of fact, not mixed."
    },
    {
      "id": "cr2",
      "text": "Prefer Sarvate T.B. v. Nemichand (larger bench) over Smt. Kamla Soni v. Rup Lal Mehra; mere assertion insufficient, objective test required, burden on landlord.",
      "addresses_issue": "i1",
      "key_observation": "No error of law by Additional District Judge."
    },
    {
      "id": "cr3",
      "text": "Preparations and whole shop demand irrelevant as litigation delays make pre-possession preparations impractical; but other evidence supports finding: persistent eviction since 1952, two-year delay post-lease, new business at 63 with no experience.",
      "addresses_issue": "i2",
      "key_observation": "Finding not perverse, supported by evidence."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Finding of no bona fide requirement is pure finding of fact, not interfered with in second appeal unless vitiated by error of law or perversity.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "High Court erred in reversing Additional District Judge's finding; decree for eviction set aside.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Sarvate T. B. v. Nemichand",
      "citation": "1966 M. P. Law Journal 26",
      "treatment": "followed",
      "relevance": "High Court cannot interfere in second appeal with lower appellate court's finding of fact on bona fide requirement."
    },
    {
      "case_name": "Smt. Kamla Soni v. Rup Lal Mehra",
      "citation": "C. A. No. 2150 of 1966, decided on 26th September, 1969",
      "treatment": "distinguished",
      "relevance": "Held bona fide requirement mixed question; overruled implicitly as smaller bench contradicting larger bench in Sarvate."
    }
  ],
  "statutes_cited": [
    {
      "name": "Madhya Pradesh Accommodation Control Act, 1961",
      "sections": [
        "12(1)(f)"
      ],
      "relevance": "Ground for eviction if landlord bona fide requires non-residential premises for starting own business."
    },
    {
      "name": "Madhya Pradesh Accommodation Control Act, 1955",
      "sections": [
        "4(h)"
      ],
      "relevance": "Disentitles eviction if landlord has other reasonably suitable accommodation."
    },
    {
      "name": "Madhya Bharat Premises Restriction Act, Sy. 2006",
      "sections": [],
      "relevance": "Non-residential requirement not ground for eviction."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Supreme Court allowed the appeal, set aside High Court judgment restoring eviction decree, upheld Additional District Judge's dismissal of suit holding no bona fide requirement proved.",
    "relief_granted": "Eviction decree set aside; appellant tenant continues in possession.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "It is settled law that the High Court in second appeal cannot reappreciate the evidence and interfere with findings of fact reached by the lower appellate court. The lower appellate court is final so far as findings of fact are concerned.",
      "speaker": "court",
      "significance": "Defines scope of second appeal jurisdiction."
    },
    {
      "text": "The word 'required' signifies that mere desire on the part of the landlord is not enough but there should be an element of need and the landlord must show, the burden being upon him, that he genuinely requires the non-residential accommodation.",
      "speaker": "court",
      "significance": "Objective test for bona fide requirement."
    },
    {
      "text": "This finding of the District Court was based on appreciation of evidence and was binding upon the High Court and the High Court had no power to reverse that finding.",
      "speaker": "court",
      "significance": "Quote from Sarvate case affirming finality of fact findings."
    }
  ],
  "_case_id": "1974_118",
  "_label": 1,
  "_text_length": 30447,
  "_extracted_at": "2026-02-10T20:04:15.175926"
}