{
  "metadata": {
    "case_name": "Anil Kumar Bose & Raghunath Prasad v. State",
    "case_year": 1970,
    "court": "Supreme Court of India",
    "judges": [
      "Goswami, J."
    ],
    "case_number": "Criminal Appeal Nos. 223 and 224 of 1970",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Dr. Rama Shankar (PW 14) and Dr. Ram Balak Singh (PW 4) were House Physicians and Dr. Sailendra Kumar (PW 5) was a House Surgeon in Darbhanga Medical College Hospital.",
      "type": "background",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f2",
      "text": "House Surgeons or House Physicians appointed for six months (January-June, July-December) by Superintendent, monthly emoluments Rs. 125/- (Rs. 75/- stipend + Rs. 50/- diet allowance).",
      "type": "background",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f3",
      "text": "For March 1963, fictitious pay bill for Rs. 125/- prepared in name of Dr. Rama Shankar, who worked only up to December 1962 and handed over charge in January 1963.",
      "type": "material",
      "date": "1963-03",
      "source": "prosecution"
    },
    {
      "id": "f4",
      "text": "Fictitious pay bill for March 1963 prepared for Dr. Sailendra Kumar (working in Ear, Nose and Throat Department) but in Pediatric Section.",
      "type": "material",
      "date": "1963-03",
      "source": "prosecution"
    },
    {
      "id": "f5",
      "text": "Fictitious pay bill for March 1963 prepared in name of Dr. Ram Balak Singh, who never joined the post and was substituted by Dr. Rana Chandraketu.",
      "type": "material",
      "date": "1963-03",
      "source": "prosecution"
    },
    {
      "id": "f6",
      "text": "Amounts of the three pay bills drawn from Treasury and disbursed to fictitious persons.",
      "type": "material",
      "date": "1963-03",
      "source": "prosecution"
    },
    {
      "id": "f7",
      "text": "Letters of appointment and joining reports of House Staff sent to Accounts Department for pay bills preparation.",
      "type": "procedural",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f8",
      "text": "Yogesh Prasad Thakur was Bill Clerk (convicted, not appealing).",
      "type": "background",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f9",
      "text": "Raghunath Prasad was Accountant (appellant in Crl. A. No. 224/70). Anil Kumar Bose was Cashier (appellant in Crl. A. No. 223/70).",
      "type": "background",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f10",
      "text": "Procedure: Pay bills prepared by Bill Clerk, checked by Accountant, placed before Superintendent for signature; then peon to Treasury; money to Cashier for entries in cash book/registers; disbursement per Acquittance Roll; certificate by Deputy Superintendent that money disbursed in his presence.",
      "type": "procedural",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f11",
      "text": "In May 1963, during preparation of Annual Establishment Return for Accountant General, Bihar, Head Clerk Bhola Nath Jha (PW 3) noticed more Housemen in March 1963 Acquittance Roll than sanctioned strength.",
      "type": "material",
      "date": "1963-05",
      "source": "prosecution"
    },
    {
      "id": "f12",
      "text": "Enquiry by several officers; information to police; charge-sheet against two appellants and Bill Clerk.",
      "type": "procedural",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f13",
      "text": "Sessions Court convicted accused under section 420/34 IPC; each sentenced to RI one year and fine Rs. 200/-, default RI six months.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "Patna High Court in Crl. Appeals Nos. 213 and 236 of 1967 (judgment dated 4th August 1970) affirmed conviction and sentence.",
      "type": "procedural",
      "date": "1970-08-04",
      "source": "lower_court"
    },
    {
      "id": "f15",
      "text": "Defence of Accountant Raghunath Prasad: Bills did not pass through him; no knowledge of correctness; directly put before Superintendent; after signature, to Treasury; nothing to do thereafter.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f16",
      "text": "Defence of Cashier Anil Kumar Bose: Nothing to do with bill preparation; received cash with other bills; disbursed per Acquittance Roll; did not know three Doctors personally; not guilty of cheating.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f17",
      "text": "Accountant's duty chart (Ext. 1): Sole in charge of accounts, supervision; complete Bill Book, checked/signed by Dy. Supdt.; put up salary bills before Superintendent.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f18",
      "text": "Superintendent PW 9 Dr. Safdar Ali Khan: Accountant responsible for keeping Acquittance Roll in order.",
      "type": "admitted",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f19",
      "text": "Superintendent directed bills placed on his table for signature without clerk standing; against Accountant's duty chart item 5.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f20",
      "text": "Disputed pay bills do not bear initial/signature of Accountant below Superintendent's signature.",
      "type": "material",
      "date": "1963-03",
      "source": "court"
    },
    {
      "id": "f21",
      "text": "Cashier's duty chart (Ext. 1/1): Daily receipt/disbursement of cash; solely responsible.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f22",
      "text": "Deputy Superintendent PW 6: Duty of Cashier to see payment to correct person.",
      "type": "admitted",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f23",
      "text": "Payment to PW 5 on 5th April and 10th April for March (five days apart); Cashier ought to detect if bona fide.",
      "type": "disputed",
      "date": "1963-04-05",
      "source": "lower_court"
    },
    {
      "id": "f24",
      "text": "Practice: Payment in presence of Deputy Superintendent, his initial below seal/rubber stamp; not obtained in disputed cases; no explanation.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f25",
      "text": "High Court observation: Superintendent and Deputy Superintendent careless; latitude to employees; Superintendent could detect no Accountant signature.",
      "type": "admitted",
      "date": null,
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the Accountant (Raghunath Prasad) and Cashier (Anil Kumar Bose) are guilty under section 420/34 IPC, having mens rea, given Bill Clerk's fictitious bills.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Accountant: Bills did not pass through him; no knowledge; directly to Superintendent; after signature to Treasury.",
      "supporting_facts": [
        "f15"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Cashier: No role in preparation; disbursed per Acquittance Roll; did not know doctors personally; impossible to know all Housemen.",
      "supporting_facts": [
        "f16",
        "f23"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Accountant failed duties per chart: did not check bills, no signature on disputed bills purposely to avoid responsibility.",
      "supporting_facts": [
        "f17",
        "f19",
        "f20"
      ],
      "legal_basis": "Section 420 IPC (mens rea via duty lapse)"
    },
    {
      "id": "ra2",
      "text": "Cashier duty to disburse bona fide after enquiry; failed to detect repeat payment, no Deputy Supdt. signature/initial on disputed payments.",
      "supporting_facts": [
        "f21",
        "f22",
        "f23",
        "f24"
      ],
      "legal_basis": "Section 420 IPC (mens rea via improper disbursement)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Bill Clerk's guilt accepted; for appellants, evidence must prove mens rea beyond doubt. Accountant's case: At highest, failure to perform duties/administrative lapse; Superintendent's procedure change; no purposeful avoidance proven; High Court incorrect on purposeful non-signature.",
      "addresses_issue": "i1",
      "key_observation": "No material to impute guilty intention essential for 420 IPC."
    },
    {
      "id": "cr2",
      "text": "Cashier's case: No Duty Chart requirement to verify payee personally; High Court accepted impossible to know all Housemen; no evidence known to him; no proof payments not in Deputy Supdt. presence (only usual practice); Superintendent/Dy. Supdt. careless.",
      "addresses_issue": "i1",
      "key_observation": "At highest, error of judgment/breach of duty; not dishonest intention for 420 IPC."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Evidence does not establish mens rea for Accountant and Cashier under section 420/34 IPC; mere duty lapse not cheating.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "420",
        "34"
      ],
      "relevance": "Conviction under 420/34 for cheating; requires proof of mens rea/dishonest intention."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeals allowed; Patna High Court judgment set aside insofar as two appellants; both acquitted of charge under section 420/34 IPC and discharged from bail bonds.",
    "relief_granted": "Acquittal and discharge from bail bonds.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"Without, however, anything more we do not think it will be correct to impute to this appellant a guilty intention which is one of the essential ingredients of the offence of cheating under section 420 I.P.C.\"",
      "speaker": "court",
      "significance": "Core holding on lack of mens rea for Accountant."
    },
    {
      "text": "\"On the evidence which the High Court has relied upon against him, it is not possible to hold that the requisite mens rea has been established against this accused.\"",
      "speaker": "court",
      "significance": "Acquittal reasoning for Cashier."
    },
    {
      "text": "\"I am constrained to remark that both, the Superintendent and the Deputy Superintendent have shown carelessness in their duties\"",
      "speaker": "court",
      "significance": "High Court observation shifting some blame, aiding reasonable doubt."
    }
  ],
  "_case_id": "1974_129",
  "_label": 1,
  "_text_length": 12655,
  "_extracted_at": "2026-02-10T20:04:07.318930"
}