{
  "metadata": {
    "case_name": "Multiple Appellants v. State of Madhya Pradesh and State of Kerala",
    "case_year": 1974,
    "court": "Supreme Court of India",
    "judges": [
      "RAY, C.J."
    ],
    "case_number": "Civil Appeal Nos. 1711 to 1721, 7123, 1699, 1706, 1744 of 1974; Civil Appeal No. 1267 of 1970; Writ Petitions Nos. 436 of 1971, 26 and 133 of 1972",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Prior to 1 April 1964, licences for sale of foreign liquor in Madhya Pradesh were granted by excise authorities under fee per bottle system.",
      "type": "background",
      "date": "Before 1964-04-01",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "In 1964-65, Madhya Pradesh State decided licences for foreign liquor would be disposed of by public auction to highest bidder. Appellants challenged in Madhya Pradesh High Court, did not succeed due to 1964 amendment.",
      "type": "procedural",
      "date": "1964-65",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "1964 amendment to Madhya Pradesh Act empowered Government to grant lease in respect of any liquor (foreign and country liquor). Public auctions held under section 18 for foreign liquor in 1965-66, leases renewed up to 1969-70.",
      "type": "material",
      "date": "1964",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "In 1967-68, prohibition withdrawn in certain areas of Madhya Pradesh, new foreign liquor vends opened and disposed of by public auction.",
      "type": "material",
      "date": "1967-68",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Notification dated 29 March 1968: With effect from 1 April 1965, foreign liquor licences disposed of on payment of extra fee of Rs. 1000 in addition to fee per bottle; new shops by public auction plus fee per bottle.",
      "type": "material",
      "date": "1968-03-29",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Notification dated 14 August 1970: State Government to dispose of foreign liquor licences by public auction – subject matter of Madhya Pradesh appeals.",
      "type": "material",
      "date": "1970-08-14",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Madhya Pradesh appeals from Judgment and Order dated 24th April 1974 of Madhya Pradesh High Court in Misc. Petitions Nos. 391 etc. of 1970.",
      "type": "procedural",
      "date": "1974-04-24",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Kerala appeal (CA 1267/70) from judgment dated 8th April 1970 of Kerala High Court in O.P. No. 995 of 1970.",
      "type": "procedural",
      "date": "1970-04-08",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Writ petitions under Art. 32: Nos. 436/71, 26/72, 133/72.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Kerala governed by Abkari Act No. 1, sections on import/export/transport (6-11), manufacture/possession/sale (12-15C), duties (17-23), privilege grant (18A), Rule 13(1) on public auction.",
      "type": "background",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether it is permissible for the State Government to auction licences for carrying on the business of selling foreign liquor which is neither manufactured nor imported by the State Government.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Fundamental right of citizens to carry on trade in liquor under Article 19(1)(g). Right to trade in liquor not declared by legislature as State monopoly to exclude from Article 19(1)(g). State has no right or privilege in manufacture or sale of liquor to grant to citizens.",
      "supporting_facts": [],
      "legal_basis": "Article 19(1)(g); Krishna Kumar Narula v. State of Jammu and Kashmir (1967) 3 SCR 50"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "State not claiming monopoly in foreign liquor. Auction of licences is consideration for lease under section 18 MP Act or section 18A Abkari Act, not fee or tax. State has exclusive right/privilege to manufacture, possess, sell intoxicants; grants to highest bidder. Citizens cannot trade except per legislative conditions under regulatory powers. Entry 8 List II.",
      "supporting_facts": [
        "f3",
        "f6",
        "f10"
      ],
      "legal_basis": "Sections 17-18 MP Act; Section 18A Abkari Act; Entry 8 List II"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "No inherent or fundamental right of citizens to carry on trade or business in intoxicating liquor. State has police power for public morality, can prohibit entirely (Art.47). History of excise laws shows State exclusive privilege, grants by licence/lease/auction as regulation to raise revenue.",
      "addresses_issue": "i1",
      "key_observation": "There is no inherent right in a citizen to sell intoxicating liquors by retail; it is not a privilege of a citizen."
    },
    {
      "id": "cr2",
      "text": "Auction sale is method of regulation; bid is consideration for lease of privilege/right to sell, not tax/fee. Valid under excise Acts and constitutional entries.",
      "addresses_issue": "i1",
      "key_observation": "State possesses right of complete control over manufacture, collection, sale, consumption of intoxicants."
    },
    {
      "id": "cr3",
      "text": "Narula case does not establish fundamental right to trade in liquor; reaffirms regulation possible. Bharucha, Jaiswal etc. upheld auctions.",
      "addresses_issue": "i1",
      "key_observation": "Trade in liquor inherently requires legislative control; not on par with other trades under Art.14/19."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "State has exclusive right/privilege of manufacturing and selling liquor; grants such right by licence/lease; can auction and accept payment as consideration for grant.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Krishna Kumar Narula v. State of Jammu and Kashmir",
      "citation": "1967 3 SCR 50",
      "treatment": "distinguished",
      "relevance": "Dealing in liquor is business subject to reasonable restrictions; does not confer fundamental right."
    },
    {
      "case_name": "Cooverjee B. Bharucha v. Excise Commissioner, Ajmer",
      "citation": "1954 SCR 873",
      "treatment": "followed",
      "relevance": "No inherent right to trade in liquor; auction is regulation to raise revenue; monopoly only if excludes public from lawful trade."
    },
    {
      "case_name": "State of Assam v. A.N. Kidwai",
      "citation": "1957 SCR 295",
      "treatment": "followed",
      "relevance": "No absolute right to sell liquor; control for public health, morals, revenue."
    },
    {
      "case_name": "State of Bombay v. F.N. Balsara",
      "citation": "1951 SCR 682",
      "treatment": "followed",
      "relevance": "Absolute prohibition permissible except medicinal."
    },
    {
      "case_name": "M/s Guruswamy & Co. v. State of Mysore",
      "citation": "1957 1 SCR 548",
      "treatment": "followed",
      "relevance": "Auction of privilege to sell toddy valid; payment for exclusive privilege."
    },
    {
      "case_name": "State of Orissa v. Hari Narayan Jaiswal",
      "citation": "1972 3 SCR 784",
      "treatment": "followed",
      "relevance": "Public auction of exclusive privilege valid attribute of revenue collection."
    },
    {
      "case_name": "Amar Chandra Chakraborty v. Collector of Excise, Tripura",
      "citation": "1973 1 CCR 533",
      "treatment": "followed",
      "relevance": "Trade in country liquor special category; auction restrictions reasonable under Art.19."
    },
    {
      "case_name": "A.B. Abdulkadir v. State of Kerala",
      "citation": "1962 2 Supp. SCR 741",
      "treatment": "followed",
      "relevance": "Auction system method to realise duty via licences."
    },
    {
      "case_name": "State of Bombay v. R.M.D. Chamarbaugwalla",
      "citation": "1957 SCR 874",
      "treatment": "referred",
      "relevance": "Inherently vicious activities like gambling not trade under Art.19(1)(f)(g)."
    }
  ],
  "statutes_cited": [
    {
      "name": "Central Provinces and Berar Excise Act, 1915 (Madhya Pradesh Act)",
      "sections": [
        "Sections 8",
        "9",
        "13",
        "17",
        "18"
      ],
      "relevance": "Power to prohibit import/export/transport; licence for manufacture/possession/sale; lease right to manufacture/supply/sell liquor."
    },
    {
      "name": "Kerala Abkari Act, 1077 (Act No. 1)",
      "sections": [
        "Sections 6-11",
        "9",
        "12-15C",
        "17",
        "18A",
        "Rule 13(1)"
      ],
      "relevance": "Import/export/transport regulation; manufacture/sale prohibition except licence; privilege grant by auction/negotiation as rental additional to duties."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 19(1)(g)",
        "Article 32",
        "Article 47",
        "Entry 8 List II"
      ],
      "relevance": "Trade right subject to restrictions; writ jurisdiction; prohibition endeavour; state power over intoxicating liquors."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The civil appeals and writ petitions challenging the State Governments' authority to auction licences for selling foreign liquor are dismissed. State held to have exclusive privilege to grant such rights via auction as consideration for lease.",
    "relief_granted": "None",
    "costs": "Parties will pay and bear their own costs."
  },
  "key_quotes": [
    {
      "text": "There is no inherent right in a citizen to sell intoxicating liquors by retail it is not a privilege of a citizen of the State.",
      "speaker": "court",
      "significance": "Core holding rejecting fundamental right to trade in liquor."
    },
    {
      "text": "The State has the exclusive right or privilege of manufacturing and selling liquor. The State grants such right or privilege in the shape of a licence or a lease.",
      "speaker": "court",
      "significance": "Affirms State's monopoly privilege and validity of auction."
    },
    {
      "text": "Rental is the consideration for the agreement for grant of privilege by the Government.",
      "speaker": "court",
      "significance": "Distinguishes auction bid from tax/fee."
    }
  ],
  "_case_id": "1974_306",
  "_label": 0,
  "_text_length": 30409,
  "_extracted_at": "2026-02-10T20:06:12.878989"
}