{
  "metadata": {
    "case_name": "Writ Petition No. 379 of 1974",
    "case_year": 1974,
    "court": "Supreme Court of India",
    "judges": [
      "BHAGWATI, J."
    ],
    "case_number": "Writ Petition No. 379 of 1974",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "On the night of 25/26-6-73 at about 00.1 hrs. you along with your associates being armed with lethal weapons including fire Arms raided the house of Ananta Keyal of Naitala under Diamond Harbour P.S. and looted away cash, ornaments etc. At the time of operation you fixed from your fire arms indiscriminately disregarding human lives and their safety. As a result, the house owner Ananta Kayal and his close door neighbour Ajit Kayal sustained grievous gun shot injuries on their persons, Subsequently both of them ,expired in Diamond Harbour Hospital. You also brutally assulated some of the inmates of the house of occurrence. Your action created such panic in the locality and the local people felt a sense of insecurity.",
      "type": "material",
      "date": "1973-06-25",
      "source": "grounds_of_detention"
    },
    {
      "id": "f2",
      "text": "District Magistrate, 24-Parganas, by an order dated 29th December, 1973 made under sub-section (1) read with subsection (2) of section 3 of the Maintenance of Internal Security Act, 1971 directed that the petitioner be detained as he was satisfied that with a view to preventing the petitioner from acting in a manner prejudicial to the maintenance of public order it was necessary to detain him.",
      "type": "procedural",
      "date": "1973-12-29",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Fact of the making of the order of detention was reported by the District Magistrate to the State Government on 2nd January, 1974.",
      "type": "procedural",
      "date": "1974-01-02",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "State Government, by an order dated 8th January, 1974, approved the order of detention.",
      "type": "procedural",
      "date": "1974-01-08",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Pursuant to the order of detention, the petitioner was arrested on 18th January, 1974 and immediately on his arrest he was served with the grounds on which the order of detention was made.",
      "type": "procedural",
      "date": "1974-01-18",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Petitioner made a representation against the order of detention on 29th January, 1974 but it was considered and rejected by the State Government on 31st January, 1974.",
      "type": "procedural",
      "date": "1974-01-29",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "State Government submitted the case of the petitioner to the Advisory Board along with his representation and the Advisory Board, after hearing the petitioner and taking into account the representation made by him, made a report to the State Government on 6th March, 1974 stating that in its opinion there was sufficient cause for the detention of the petitioner.",
      "type": "procedural",
      "date": "1974-03-06",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "State Government passed an order dated 14th March, 1974 confirming the detention of the petitioner.",
      "type": "procedural",
      "date": "1974-03-14",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "In connection with the incident set out in the grounds of detention a criminal case was filed in the court of the Sub-Divisional Judicial Magistrate, Diamond Harbour on 26th June, 1973 and he was arrested in connection with that case, but it appeared during investigation that witnesses were unwilling to give evidence in open court against the petitioner and his associates and it was, therefore, felt that it was futile to proceed with the criminal case and it was decided to drop it against the petitioner.",
      "type": "background",
      "date": "1973-06-26",
      "source": "state_affidavit"
    },
    {
      "id": "f10",
      "text": "Petitioner was actually in jail on 29th December, 1973 when the order of detention was made.",
      "type": "background",
      "date": "1973-12-29",
      "source": "state_affidavit"
    },
    {
      "id": "f11",
      "text": "The record of the case showed that the criminal case was actually pending against the petitioner on 3rd January, 1974. That means that the criminal case must have been dropped and the petitioner must have been discharged sometime between 3rd January, 1974 and 18th January, 1974.",
      "type": "background",
      "date": "1974-01-03",
      "source": "state_record"
    },
    {
      "id": "f12",
      "text": "District Magistrate passed eight other orders of detention on 29th December, 1973 (a Saturday) and the materials in connection with all these nine cases had to be typed out by the typist which could not possibly be completed in one single day. 30th December, 1973 was a Sunday. District Magistrate could not send the report on 31st December, 1973 as he was very busy in connection with food procurement work in the district and 1st January, 1974 being a public holiday.",
      "type": "background",
      "date": "1973-12-29",
      "source": "district_magistrate_affidavit"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the solitary incident set out in the grounds of detention was so remote from the date of the order of detention (about six months) that the District Magistrate could not possibly have arrived at his subjective satisfaction on the basis of that incident, and the requirement of proximity was not satisfied.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether the incident set out in the grounds of detention merely affected maintenance of law and order and did not have any impact on public order, hence no nexus between the act and the subjective satisfaction.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether the District Magistrate had taken into account other material contained in the history sheet of the petitioner in arriving at his subjective satisfaction and since this material was not disclosed to the petitioner, he had no opportunity of making an effective representation.",
      "framed_by": "petitioner"
    },
    {
      "id": "i4",
      "text": "Whether there was unreasonable delay of twenty days in arresting the petitioner pursuant to the order of detention.",
      "framed_by": "petitioner"
    },
    {
      "id": "i5",
      "text": "Whether the District Magistrate did not report the fact of the making of the order of detention to the State Government forthwith as required by section 3 sub-section (3), since there was a delay of about five days until 2nd January, 1974.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The solitary incident set out in the grounds of detention was so remote from the date of the order of detention-in fact there was a time lag about six months that the District Magistrate could not possibly have arrived at his subjective satisfaction on the basis of that incident. The requirement of proximity was not satisfied and the subjective satisfaction could not be regarded as real or genuine.",
      "supporting_facts": [
        "f1",
        "f2"
      ],
      "legal_basis": "Golam Hussain v. The Commissioner of Police, Calcutta; Lakshman Khatik v. State of West Bengal"
    },
    {
      "id": "pa2",
      "text": "Even if the incident set out in the grounds of detention were true, it merely affected maintenance of law and order and did not have any impact on public order and hence there was no nexus between the act alleged against the petitioner and the subjective satisfaction reached by the District Magistrate.",
      "supporting_facts": [
        "f1"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "The District Magistrate had taken into account other material contained in the history sheet of the petitioner in arriving at his subjective satisfaction and since this material was not disclosed to the petitioner, he had no opportunity of making an effective representation and that the order of detention was, therefore, invalid.",
      "supporting_facts": [
        "f2"
      ],
      "legal_basis": null
    },
    {
      "id": "pa4",
      "text": "Though the order of detention was made on 29th December, 1973, the petitioner was not arrested until 18th January, 1974 and there was thus a delay of twenty days in arresting the petitioner pursuant to the order of detention.",
      "supporting_facts": [
        "f2",
        "f5"
      ],
      "legal_basis": null
    },
    {
      "id": "pa5",
      "text": "Though the order of detention was made by the District Magistrate on 29th December, 1973, he did not report the fact of the making of the order of detention to the State Government until 2nd January, 1974 and there was thus a delay of about five days which constituted a violation of the statutory requirement of section 3, sub-section (3) that the fact of the making of the order of detention must be reported forthwith to the State Government.",
      "supporting_facts": [
        "f2",
        "f3"
      ],
      "legal_basis": "Section 3(3) of the Maintenance of Internal Security Act, 1971"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The act alleged against the petitioner was a daring act of dacoity in a village by a gang consisting of the petitioner and his associates and if this act is judged in its correct setting, grave proportions and clear implications, it would be clear that it cannot be a stray isolated act but must be the work of a habituated and hardened criminal given to commit dacoities.",
      "supporting_facts": [
        "f1",
        "f9",
        "f10"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "In connection with the incident a criminal case was filed on 26th June, 1973, petitioner arrested, but witnesses unwilling, case dropped, petitioner would be released and free to carry on activities; order of detention passed in anticipation; case pending on 3rd Jan 1974, dropped between then and 18th Jan.",
      "supporting_facts": [
        "f9",
        "f10",
        "f11"
      ],
      "legal_basis": null
    },
    {
      "id": "ra3",
      "text": "No material prejudicial to the petitioner other than that set out in the grounds of detention in the history-sheet.",
      "supporting_facts": [
        "f2"
      ],
      "legal_basis": null
    },
    {
      "id": "ra4",
      "text": "Delay of twenty days between order and arrest not unreasonable; petitioner in jail on 29 Dec, released between 3-18 Jan.",
      "supporting_facts": [
        "f5",
        "f10",
        "f11"
      ],
      "legal_basis": null
    },
    {
      "id": "ra5",
      "text": "29 Dec Saturday, 8 other detention orders, typing not possible in one day; 30 Dec Sunday; 31 Dec busy with food procurement; 1 Jan holiday; reported 2 Jan with all reasonable despatch.",
      "supporting_facts": [
        "f3",
        "f12"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "There must be a live link between the grounds of criminal activity alleged by the detaining authority and the purpose of detention. This credible chain is snapped if there is too long and unexplained an interval. No mechanical test by counting months. Depends on nature of acts, length of gap, reason for delay. Here, daring dacoity by gang suggests not isolated but course of conduct; criminal case dropped, detention in anticipation of release.",
      "addresses_issue": "i1",
      "key_observation": "The prejudicial act of the detenu may in a given case of such a character as to suggest that it is a part of an organised operation... cannot be a stray isolated act but must be the work of a habituated and hardened criminal."
    },
    {
      "id": "cr2",
      "text": "Acts must have relevance to public order, not just law and order. Public order is the even tempo of the life of the community... degree of disturbance. Here, serious dacoity at night with lethal weapons, firing indiscriminately, deaths, panic in locality, disturbed even tempo of village life.",
      "addresses_issue": "i2",
      "key_observation": "This act of dacoity created a panic in the locality and seriously disturbed the even tempo of life of the community in the village. There was clearly disturbance of public order."
    },
    {
      "id": "cr3",
      "text": "If any material not disclosed goes into subjective satisfaction, invalid. But here, no material other than grounds in history-sheet.",
      "addresses_issue": "i3",
      "key_observation": "We have looked at the history-sheet... do not find any material prejudicial to the petitioner other than that set out in the grounds of detention."
    },
    {
      "id": "cr4",
      "text": "Delay of twenty days not unreasonable; explanation: petitioner in jail, released later.",
      "addresses_issue": "i4",
      "key_observation": "The delay of twenty days... cannot be regarded as unreasonable... sufficient explanation for the delay."
    },
    {
      "id": "cr5",
      "text": "'Forthwith' means with all reasonable despatch and without avoidable delay. Explanation of Saturday, multiple orders, typing, Sunday, busy 31st, holiday 1st sufficient; no avoidable delay.",
      "addresses_issue": "i5",
      "key_observation": "This explanation... sufficient to show that he sent the report... with all reasonable despatch and there was no avoidable delay on his part."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Test of proximity is not a rigid or mechanical test... Whether the acts... are too remote... must depend on the facts and circumstances of each case.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "The act alleged... had nexus with the object of maintenance of public order.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "No factual basis... contention rejected.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    },
    {
      "id": "h4",
      "text": "Delay in arrest unsustainable.",
      "resolves_issue": "i4",
      "in_favor_of": "respondent"
    },
    {
      "id": "h5",
      "text": "The District Magistrate must, therefore, be held to have sent the report forthwith as required by section 3, sub-section (3).",
      "resolves_issue": "i5",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Golam Hussain v. The Commissioner of Police, Calcutta",
      "citation": "1974 4 SCC 530",
      "treatment": "followed",
      "relevance": "Live link between grounds and purpose of detention; proximity requirement."
    },
    {
      "case_name": "Lakshman Khatik v. State of West Bengal",
      "citation": "1974 4 SCC 1",
      "treatment": "followed",
      "relevance": "Ratio of proximity; no satisfaction of future mischief merely because long ago evil done."
    },
    {
      "case_name": "Arun Ghosh v. State of West Bengal",
      "citation": "1970 3 SCR 288",
      "treatment": "followed",
      "relevance": "Distinction between law and order and public order; degree of disturbance."
    },
    {
      "case_name": "Keshav Nilkanth Joglekar v. The Commissioner of Police, Greater Bombay",
      "citation": "1956 SCR 653",
      "treatment": "followed",
      "relevance": "Meaning of 'forthwith' in s.3(3): with all reasonable despatch and without avoidable delay."
    }
  ],
  "statutes_cited": [
    {
      "name": "Maintenance of Internal Security Act, 1971",
      "sections": [
        "Section 3(1)",
        "Section 3(2)",
        "Section 3(3)"
      ],
      "relevance": "Order of detention made under s.3(1) r/w s.3(2); report forthwith under s.3(3); approval and confirmation."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 32"
      ],
      "relevance": "Petition under Article 32 challenging detention."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "All contentions urged on behalf of the petitioner rejected; detention upheld as valid.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"Public order is the even tempo of the life of the community taking the country as a whole or even a specified locality. Disturbance of public order is to be distinguished from acts directed against individuals which do not disturb the society to the extent of causing a general disturbance of public tranquillity.\"",
      "speaker": "court",
      "significance": "Defines distinction between law/order and public order from Arun Ghosh."
    },
    {
      "text": "No mechanical test by counting the months of the interval is sound. It all depends on the nature of the acts relied on...",
      "speaker": "court",
      "significance": "Explains proximity test not rigid."
    },
    {
      "text": "an act which is to be done forthwith must be held to have so done, when it is done with all reasonable despatch and without avoidable delay",
      "speaker": "court",
      "significance": "Interpretation of 'forthwith' from Joglekar."
    }
  ],
  "_case_id": "1974_359",
  "_label": 0,
  "_text_length": 20621,
  "_extracted_at": "2026-02-10T20:06:55.825153"
}