{
  "metadata": {
    "case_name": "Petitioner-firm v. Respondents",
    "case_year": 1973,
    "court": "Supreme Court of India",
    "judges": [
      "SARKARIA, J."
    ],
    "case_number": "Writ Petitions Nos. 122 to 125 of 1973",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The petitioner-firm is dealing in the manufacture of automobile parts, wires and cables.",
      "type": "background",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f2",
      "text": "The petitioner made four applications on November 5,1969, March 23,1970, November 5, 1970 and November 6,1970, for the grant of licences to import stainless steel sheets and electrolytic copper wire bars, for the period April-March 1970 and April- March 1971.",
      "type": "material",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "At the time of the receipt of the first application dated November 5, 1969, Respondent 3 Deputy Chief Controller of Imports and Exports, Hyderabad received some complaints that the petitioner-firm was mis-utilizing the imported material.",
      "type": "disputed",
      "date": "1969-11-05",
      "source": "respondent"
    },
    {
      "id": "f4",
      "text": "After a preliminary investigation made by the C.B.I., a First Information Report was registered on December 12, 1969 with the police against the petitioner-firm and some others in respect of the commission of offences under s.5 of the Imports Control Act, 1947 read with clause 5 of the Imports Control Order, 1948.",
      "type": "material",
      "date": "1969-12-12",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Such applications should have been disposed of within three weeks of the dates on which they were received.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The petitioner-firm filed four writ petitions Nos. 3526-3529 of 1971 in the High Court of Madras praying for the issue of writ of Mandamus directing the respondents to issue the import licences applied for.",
      "type": "procedural",
      "date": "1971",
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "Before the High Court, no counter-affidavit was filed by the Respondents. The High Court, instead of issuing a writ of Mandamus, directed the Respondents to consider and dispose of the applications in accordance with law as expeditiously as possible.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "The applications were however not disposed of for another five months.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "On September 20,1970, the petitioner moved the High Court for proceeding against the authorities for contempt of its order.",
      "type": "procedural",
      "date": "1970-09-20",
      "source": "petitioner"
    },
    {
      "id": "f10",
      "text": "On October 22, 1972, the petitioner caused a notice by registered post to be served on the respondents.",
      "type": "procedural",
      "date": "1972-10-22",
      "source": "petitioner"
    },
    {
      "id": "f11",
      "text": "Respondent No. 3 informed the petitioner-firm by his communication dated November 7, 1972, that its applications had been rejected.",
      "type": "material",
      "date": "1972-11-07",
      "source": "respondent"
    },
    {
      "id": "f12",
      "text": "Reasons set out in the impugned orders: 1. Stainless steel-sheets are not allowed for the manufacture of the end product of automobile parts as their import has been prohibited in terms of the existing instructions. 2. Since the petitioner-firm was a manufacturer of automobile parts import of Electrolytic copper wire bars for end use of automobile parts is not permissible.",
      "type": "material",
      "date": "1972-11-07",
      "source": "respondent"
    },
    {
      "id": "f13",
      "text": "Serious complaints of the commission of criminal offences arising out of the mis-utilization of materials previously imported under import licences, were pending investigation by the C.B.I. against the petitioners. Subsequently, a criminal complaint has also been made in court for trial of the petitioners and others for those offences.",
      "type": "background",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f14",
      "text": "The Import Trade Control Policy (Red Book-Vol.1) had been amended and the import of the materials in question for utilization in the end products of most automobile parts was prohibited as per instructions conveyed by Chief Controller of Imports Exports in his letter No. IPC Gen. 33/73/72/3499, dated September 29, 1972 although general notice of this amendment was published later on August 18, 1973 Vide Annexure. R-5.",
      "type": "material",
      "date": "1972-09-29",
      "source": "respondent"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the impugned orders of November 7, 1972 rejecting the import licence applications are void in view of the Import Policy contained in the Red Book for the relevant period, and whether the existing instructions override that Import Policy.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether the existing instructions are unconstitutional as they do not amount to reasonable restrictions within the contemplation of Article 19 of the Constitution on the petitioners' right to carry on their trade.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether the writ petition filed by the firm is maintainable under Article 19(1)(g) as only citizens of India can avail of it.",
      "framed_by": "respondent"
    },
    {
      "id": "i4",
      "text": "Whether the petitioners had a fundamental right violated or threatened, entitling them to relief under Article 32, given no specific legal right to licences and the law being intra vires.",
      "framed_by": "respondent"
    },
    {
      "id": "i5",
      "text": "Whether Respondents contravened mandatory procedure in the Import Trade Control Hand Book, violating Articles 14 and 19.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "In view of the Import Policy contained in the Red Book for the relevant period, they were entitled to the grant of these import licences, and the existing instructions on the basis of which their applications were rejected, could not override that Import Policy.",
      "supporting_facts": [
        "f2",
        "f11",
        "f12"
      ],
      "legal_basis": "Import Policy (Red Book)"
    },
    {
      "id": "pa2",
      "text": "The existing instructions are unconstitutional as they do not amount to reasonable restrictions within the contemplation of Article 19 of the Constitution on the petitioners' right to carry on their trade.",
      "supporting_facts": [
        "f12"
      ],
      "legal_basis": "Article 19"
    },
    {
      "id": "pa3",
      "text": "The Respondents have not followed the mandatory procedure prescribed in the Import Trade Control Hand Book, contravention of which entitles the petitioners to the issue of a writ of Certiorari or any other appropriate order or direction. This contravention has violated the fundamental rights under Articles 14 and 19.",
      "supporting_facts": [
        "f5",
        "f6",
        "f7",
        "f8",
        "f9"
      ],
      "legal_basis": "Articles 14 and 19; Import Trade Control Hand Book"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Article 19(1)(g) on which the petitioners stake their claim can be availed of only by a citizen of India; the writ petition filed by the firm is therefore not maintainable.",
      "supporting_facts": [],
      "legal_basis": "Article 19(1)(g)"
    },
    {
      "id": "ra2",
      "text": "Since the petitioners had no fundamental right to the grant of the licences in question and the law in pursuance of which Respondent 3 passed the impugned order, was intra vires, the procedural irregularity or error, if any, committed by the Respondent, not having resulted in violation of or threat to any fundamental right, cannot be impeached by way of a petition under Article 32.",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": "Article 32; Smt. Ujjam Bai v. State of U.P."
    },
    {
      "id": "ra3",
      "text": "No Mandamus or other relief as prayed for by the petitioners, can be granted because the petitioners had no specific legal right to the licences, nor was the Respondent under a corresponding legal obligation to grant the same.",
      "supporting_facts": [],
      "legal_basis": null
    },
    {
      "id": "ra4",
      "text": "In any case, no import licences for the year 1969-70 in respect of the materials in question can now be granted because of the restrictions subsequently imposed by Import Control Policy of the year 1972.",
      "supporting_facts": [
        "f14"
      ],
      "legal_basis": "Import Control Policy 1972"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "We find no merit in the preliminary objection that the writ petition on behalf of the firm is not maintainable. Since firm stands for all the partners collectively, the petition is to be deemed to have been filed by all the partners who are citizens of India.",
      "addresses_issue": "i3",
      "key_observation": "Petition maintainable."
    },
    {
      "id": "cr2",
      "text": "Jurisdiction under Article 32 can be invoked only for the enforcement of fundamental rights, not any other legal right. Petitioner not entitled unless establishes fundamental right violated or threatened.",
      "addresses_issue": "i4",
      "key_observation": "No fundamental right violated."
    },
    {
      "id": "cr3",
      "text": "Instant case not covered by categories where Art 32 relief available: Act and orders intra vires; no jurisdictional defect; no misconstruction or natural justice violation resulting in fundamental right breach.",
      "addresses_issue": "i4",
      "key_observation": "Case falls outside Art 32 categories."
    },
    {
      "id": "cr4",
      "text": "Import Policy Statement (Red Book) is not a statutory document. No person can claim enforceable right to import licence merely on basis of such Statement. Policy can be changed by administrative orders.",
      "addresses_issue": "i1",
      "key_observation": "No absolute or fundamental right to licence."
    },
    {
      "id": "cr5",
      "text": "Policy amended prohibiting import for automobile parts (letter Sep 29,1972); thus could not grant licences in Nov 1972 for past period.",
      "addresses_issue": "i1",
      "key_observation": "Amended policy prohibits."
    },
    {
      "id": "cr6",
      "text": "Respondent 3 had jurisdiction; CBI investigation pending due to mis-utilization complaints; delay not undue or in bad faith.",
      "addresses_issue": "i5",
      "key_observation": "Delay justified by criminal proceedings."
    },
    {
      "id": "cr7",
      "text": "Restrictions imposed in interests of general public and national economy; not unreasonable under Art 19(1)(g).",
      "addresses_issue": "i2",
      "key_observation": "Restrictions reasonable."
    },
    {
      "id": "cr8",
      "text": "No violation of Article 14; no plea or particulars of discrimination.",
      "addresses_issue": "i5",
      "key_observation": "No hostile discrimination."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Writ petition by firm maintainable as partners are citizens.",
      "resolves_issue": "i3",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "No fundamental right to import licence based on Import Policy Statement; no relief under Art 32 as no violation of fundamental rights.",
      "resolves_issue": "i4",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Impugned rejection orders valid; amended policy prohibits imports; delay not violative.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h4",
      "text": "Instructions not unconstitutional restrictions under Art 19.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Smt. Ujjam Bai v. State of U.P.",
      "citation": "1963 1 S.C.R. 781",
      "treatment": "referred",
      "relevance": "Jurisdiction under Art 32 only for fundamental rights violation; categories of cases where relief available."
    },
    {
      "case_name": "Deputy Assistant Iron and Steel Controller and anr. v. L. Maneckchand, Proprietor, Katrella Metal Corpn., Madras",
      "citation": "1972 3 S.C.R. 1",
      "treatment": "followed",
      "relevance": "No vested right to import licence per policy at application time; policy changeable; no mandamus; imports need control for economy."
    }
  ],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Article 32",
        "Article 19(1)(g)",
        "Article 19",
        "Article 14"
      ],
      "relevance": "Art 32 for fundamental rights enforcement; Art 19(1)(g) right to trade; restrictions reasonable; Art 14 equality."
    },
    {
      "name": "Imports and Exports (Control) Act, 1947",
      "sections": [
        "s.3(1)(a)",
        "s.5"
      ],
      "relevance": "Governs import control orders; offences for mis-utilization."
    },
    {
      "name": "Imports (Control) Order",
      "sections": [
        "clause 5 (1948)",
        "cl.6(1)(a) (1955)"
      ],
      "relevance": "Regulates import licences; no vested right."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The four writ petitions under Article 32 are dismissed. No fundamental right violated; no enforceable right to import licences under non-statutory Policy; rejection valid per amended policy and pending criminal proceedings; restrictions reasonable.",
    "relief_granted": "None",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "No person can merely on the basis of such a [Policy] Statement claim a right to the grant of an import licence, enforceable at law.",
      "speaker": "court",
      "significance": "Core holding: Policy not statutory, no legal right to licence."
    },
    {
      "text": "Jurisdiction of this Court under Article 32 can be invoked only for the enforcement of the fundamental rights guaranteed by the Constitution, and not any other legal right.",
      "speaker": "court",
      "significance": "Limits Art 32 relief to fundamental rights."
    },
    {
      "text": "In granting licences for imports, the authority concerned has to keep in view various factors which may have impact on imports of other items of relatively greater priority in the larger interest, of the overall economy of the country which has to be the supreme consideration.",
      "speaker": "court",
      "significance": "Justifies import controls for national economy."
    }
  ],
  "_case_id": "1974_125",
  "_label": 0,
  "_text_length": 12822,
  "_extracted_at": "2026-02-10T20:04:20.662199"
}