{
  "metadata": {
    "case_name": "Petitioners carrying on business in Goa, Daman and Diu v. Union of India and Income-tax Officer",
    "case_year": null,
    "court": "Supreme Court of India",
    "judges": [
      "R. S. Sarkaria, J.",
      "A. Alagiriswami, J. (dissenting)"
    ],
    "case_number": "Writ Petitions Nos. 112, 391-394 of 1971 and 330-31, 382-387 of 1974",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Goa, Daman and Diu are erstwhile Portuguese territories which became a part of the Union of India on and from December 19, 1961.",
      "type": "background",
      "date": "1961-12-19",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The President promulgated Taxation Laws (Extension to Union Territories) Regulation III of 1963 extending the Indian Income-tax Act, 1961 to Goa, Daman and Diu with effect from April 1, 1963, subject to modifications including insertion of s. 294-A.",
      "type": "procedural",
      "date": "1963-04-01",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Under Portuguese law in force immediately before April 1, 1963, there was no provision for granting depreciation allowance; net profits and gains were not calculated and tax was levied at a certain percentage on the gross income or turnover of the business, irrespective of profits or losses.",
      "type": "admitted",
      "date": "pre-1963-04-01",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Clause 4 of Regulation III of 1963 repealed laws in force in the Union Territory corresponding to the Acts specified in the Schedule from April 1, 1963.",
      "type": "procedural",
      "date": "1963-04-01",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Clause 7 of Regulation III of 1963 provides that if any difficulty arises in giving effect in any Union Territory to the provisions of any Act, the Central Government may make provisions or give directions for removal of the difficulty.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "On November 8, 1970, Central Government promulgated Taxation Laws (Extension to Union Territories) Removal of Difficulties Order No. 2 of 1970 under Clause 7 of the Regulation, deemed to come into force from April 1, 1963.",
      "type": "procedural",
      "date": "1970-11-08",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Clause 3 of 1970 Order provides for computation of aggregate depreciation allowable and written down value under Income-tax Act, 1961, taking into account depreciation actually allowed under local laws; 2nd Proviso deems depreciation calculated at rates under Income-tax Act where not actually allowed or ascertainable under local law.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Petitioners carrying on business in Goa, Daman and Diu were assessed under Income-tax Act, 1961 for assessment years from 1964-65 onwards; depreciation allowed on basis of written-down value under cl. (b) of s. 43(6) read with s. 32; for 1964-65, written-down value taken as actual cost since no prior depreciation allowed.",
      "type": "procedural",
      "date": "1964-65 onwards",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "In light of 2nd Proviso to Clause 3 of 1970 Order, past completed assessments of petitioners are being revised; written-down value reduced, increasing tax liability from 1964-65.",
      "type": "disputed",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "In Writ Petitions 330-331 of 1971, Income-tax Officer revised assessment for 1965-66, reduced depreciation, raised higher demand kept in abeyance pending decision.",
      "type": "procedural",
      "date": "1965-66",
      "source": "respondent"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the 2nd Proviso to Clause 3 of the Taxation Laws (Extension to Union Territories) Removal of Difficulties Order No. 2 of 1970 is valid, promulgated under Clause 7 of Regulation III of 1963.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether any difficulty arose in giving effect to the Income-tax Act, 1961 in Goa, Daman and Diu justifying exercise of power under Clause 7.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether the impugned Proviso is consistent with the scheme of ss. 32, 34 and 43(6) of the Income-tax Act, 1961, particularly by deeming fictional depreciation where none was actually allowed.",
      "framed_by": "court"
    },
    {
      "id": "i4",
      "text": "Whether the impugned Proviso is workable, given no prior income-tax law for computing losses or carry-forward of unabsorbed depreciation pre-1963.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Arising of a difficulty is condition precedent to invocation of power under Clause 7; no objective difficulty established as Act applied since 1963 without issue.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": "Straw Products Ltd v. ITO, Bhopal"
    },
    {
      "id": "pa2",
      "text": "Power under Clause 7 can only be exercised consistent with scheme and essential provisions of the Act; impugned Proviso changes scheme by providing fictional depreciation inconsistent with ss. 43(6)(b) and 32 requiring 'actually allowed'.",
      "supporting_facts": [
        "f3",
        "f7"
      ],
      "legal_basis": "ss. 32, 43(6) Income-tax Act, 1961; Straw Products Ltd v. ITO"
    },
    {
      "id": "pa3",
      "text": "Impugned Proviso unworkable as no law (Portuguese or Indian) during interregnum Dec 19, 1961 to Apr 1, 1963 for computing prior losses/profits for carry-forward of unabsorbed depreciation under s. 32(2).",
      "supporting_facts": [
        "f1",
        "f2",
        "f3"
      ],
      "legal_basis": "s. 32(2) Income-tax Act, 1961"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Difficulties arisen in allowing depreciation; assessees not entitled under cl. (a) or (b) of s. 43(6) as assets acquired before previous year and local law not repealed by IT Act; implied prohibition against full actual cost for old assets.",
      "supporting_facts": [
        "f3",
        "f8"
      ],
      "legal_basis": "ss. 32, 43(6) Income-tax Act, 1961"
    },
    {
      "id": "ra2",
      "text": "Allowing full actual cost divorced from realities, gives undue advantage to Goa assessees over others; Proviso removes disparity, brings parity.",
      "supporting_facts": [
        "f3",
        "f9"
      ],
      "legal_basis": "Straw Products Ltd v. ITO; CIT MP v. Straw Products; CIT Hyderabad v. Dewan Bahadur Ramgopal Mills Ltd."
    },
    {
      "id": "ra3",
      "text": "Difficulty for subjective satisfaction; Straw Products supports Revenue.",
      "supporting_facts": [
        "f6",
        "f7"
      ],
      "legal_basis": "Clause 7 Regulation III 1963"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "'Actually allowed' in s. 43(6)(b) means depreciation taken into account or granted and given effect to by ITO in computing taxable income, not notional; where no prior depreciation actually allowed, written-down value is actual cost.",
      "addresses_issue": "i3",
      "key_observation": "Key word is 'actually'; antithesis of speculative or imaginary."
    },
    {
      "id": "cr2",
      "text": "No difficulty arose as objective fact; Act applied smoothly since 1963 with depreciation on actual cost basis; impugned Proviso changes essence of scheme by substituting fictional for actual depreciation.",
      "addresses_issue": "i2",
      "key_observation": "Difficulty must be established objectively, not subjective."
    },
    {
      "id": "cr3",
      "text": "Power under Clause 7 limited: to remove difficulties in giving effect to Act, minor adjustments only, cannot change basic structure or scheme; akin to Henry VIII clause but circumscribed.",
      "addresses_issue": "i1",
      "key_observation": "Cannot tinker to alter essential provisions."
    },
    {
      "id": "cr4",
      "text": "Impugned Proviso unworkable: no machinery for retrospective assessments pre-1963 for losses/carry-forward unabsorbed depreciation under s. 32(2).",
      "addresses_issue": "i4",
      "key_observation": "Creates difficulties rather than removes."
    },
    {
      "id": "cr5",
      "text": "Dissent (Alagiriswami J.): Difficulty exists as no depreciation under Portuguese law; full actual cost unrealistic for old assets, advantages Goa assessees; Proviso harmonises with IT Act scheme, valid like Ramgopal Mills; workable via accounts.",
      "addresses_issue": "i1",
      "key_observation": "Brings parity, accords with realities."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "2nd Proviso to Clause 3 of 1970 Order ultra vires Central Government under Clause 7 of Regulation III of 1963; Revenue cannot levy tax on basis of depreciation computed per Proviso.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "No difficulty arose justifying Proviso; inconsistent with ss. 32, 43(6) IT Act.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Straw Products Ltd v. Income-tax Officer, Bhopal",
      "citation": "1968 2 S.C.R. 1",
      "treatment": "followed",
      "relevance": "Power under removal of difficulties clause conditioned on objective difficulty; cannot change scheme of Act by deeming fictional depreciation; 1962 Order struck down."
    },
    {
      "case_name": "Commissioner of Income-tax, Madhya Pradesh v. Straw Products",
      "citation": "1964 2 S.C.R. 881",
      "treatment": "referred",
      "relevance": "Explains 'actually allowed'; declines to examine vires."
    },
    {
      "case_name": "Commissioner of Income-tax, Hyderabad v. Dewan Bahadur Ramgopal Mills Ltd.",
      "citation": "1961 2 S.C.R. 318",
      "treatment": "distinguished",
      "relevance": "Upholds difficulties removal order and explanation where prior depreciation actually allowed under local law; harmonises schemes."
    },
    {
      "case_name": "Badridas Daga v. Commissioner of Income-tax",
      "citation": "1 I.T.R. 10 S.C.",
      "treatment": "referred",
      "relevance": "Profits computed per commercial principles unless prohibited."
    },
    {
      "case_name": "Commissioner of Income-tax v. Plymen",
      "citation": "46 I.T.R. 649 S.C.",
      "treatment": "referred",
      "relevance": "Deductions allowable under s. 28(1) per commercial principles."
    }
  ],
  "statutes_cited": [
    {
      "name": "Income-tax Act, 1961",
      "sections": [
        "s. 28",
        "s. 29",
        "s. 32",
        "s. 34",
        "s. 43(1)",
        "s. 43(6)",
        "s. 294-A"
      ],
      "relevance": "Scheme of depreciation on written-down value based on actual cost less depreciation actually allowed; carry-forward unabsorbed depreciation."
    },
    {
      "name": "Taxation Laws (Extension to Union Territories) Regulation, 1963",
      "sections": [
        "Clause 3",
        "Clause 4",
        "Clause 7"
      ],
      "relevance": "Extends IT Act to Goa etc.; removal of difficulties power."
    },
    {
      "name": "Taxation Laws (Extension to Union Territories) Removal of Difficulties Order No. 2 of 1970",
      "sections": [
        "Clause 3 (2nd Proviso)"
      ],
      "relevance": "Impugned provision deeming prior depreciation; held ultra vires."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 32",
        "Article 240"
      ],
      "relevance": "Writ petitions; Presidential power for Regulation."
    },
    {
      "name": "Indian Income-tax Act, 1922",
      "sections": [
        "s. 10(2)(vi)",
        "s. 10(5)(b)"
      ],
      "relevance": "Corresponding provisions; referenced in precedents."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Writ petitions allowed; 2nd Proviso to Clause 3 of 1970 Order declared ultra vires Clause 7 of Regulation III of 1963; Revenue restrained from levying tax based on depreciation per Proviso.",
    "relief_granted": "Declaration of invalidity of impugned Proviso; no revision of assessments per Proviso.",
    "costs": "Respondents to pay costs of the petitioners."
  },
  "key_quotes": [
    {
      "text": "The existence of that condition had not been established as an objective fact, the Central Government had no power to promulgate the impugned Proviso.",
      "speaker": "court",
      "significance": "Condition precedent for Clause 7 power."
    },
    {
      "text": "The key word in clause (b) is 'actually'. It is the anti-thesis of that which is merely speculative, theoretical or imaginary.",
      "speaker": "court",
      "significance": "Interpretation of 'actually allowed' in s. 43(6)(b)."
    },
    {
      "text": "The power conferred by s. 6 of Act 67 of 1949 is a power to remove a difficulty which arose in the application of the Indian Income-tax Act to the merged States it can be exercised in the manner consistent with the scheme and essential provisions of the Act.",
      "speaker": "court",
      "significance": "Limits of removal of difficulties power (from Straw Products)."
    },
    {
      "text": "It stands to reason and common sense that in such a case the written down value of the asset in question on the date the Indian Income-tax Act 1961 becomes applicable to that territory should be related to realities and not be wholly unrelated to them or notional.",
      "speaker": "court",
      "significance": "Dissenting view on realism in depreciation."
    }
  ],
  "_case_id": "1974_312",
  "_label": 1,
  "_text_length": 70314,
  "_extracted_at": "2026-02-10T20:06:18.211831"
}