{
  "metadata": {
    "case_name": "Appellant v. Respondent",
    "case_year": 1971,
    "court": "Supreme Court of India",
    "judges": [
      "BEG, J."
    ],
    "case_number": "Criminal Appeal No. 79 of 1971",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The appellant aged 23 was arrested on 9-4-1967 by the Railway Police at the Bombay Central Railway Station as he was hurriedly trying to get into a second class compartment of the Frontier Mail bound for Delhi.",
      "type": "material",
      "date": "1967-04-09",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Manner in which he was trying to enter the second class compartment and his nervousness on being questioned by a Railway C.I.D. Police Officer, although the appellant had a ticket on him, aroused suspicion so that the appellant was detained.",
      "type": "material",
      "date": "1967-04-09",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On a search of his person at the Police Station in the presence of Panchas, nine bars of gold with foreign markings were found secreted in especially made concealed pockets of his trousers. These were seized by the Railway Police.",
      "type": "material",
      "date": "1967-04-09",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "After further questioning by the Police, the appellant was summoned before Shri L. A. Digama, Additional Chief Inspector of Customs, Bombay, where his statement under section 108 of the Customs Act 1962 was recorded on 10-4-67.",
      "type": "procedural",
      "date": "1967-04-10",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "In that statement, the appellant admitted the recovery of gold bars from his person and stated that he had agreed with one Pannalal to carry them for delivery at Delhi for a sum of Rs. 100 to be paid to the appellant. He stated that, from what Pannalal had told him and also from the weight of the bars, he knew that he was carrying gold.",
      "type": "admitted",
      "date": "1967-04-10",
      "source": "appellant"
    },
    {
      "id": "f6",
      "text": "He stated that his father was also with him, but, as nothing incriminating was recovered from the father, he was allowed to go away.",
      "type": "background",
      "date": "1967-04-09",
      "source": "appellant"
    },
    {
      "id": "f7",
      "text": "He also admitted that he knew that transporting of gold like this was a criminal offence.",
      "type": "admitted",
      "date": "1967-04-10",
      "source": "appellant"
    },
    {
      "id": "f8",
      "text": "The appellant was prosecuted and convicted by the Presidency Magistrate of Bombay under section 135(b) of the Customs Act of 1962 and sentenced to three months rigorous imprisonment. Charges under the Defence of India Rules were also preferred against him but he was acquitted of these.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "The High Court of Bombay after carefully re-examining the whole evidence in the case, had affirmed the conviction and sentence of the appellant.",
      "type": "procedural",
      "date": "1971-01-16",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "The appellant had obtained special leave to appeal to this Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Appellant had filed an elaborate written statement before the Magistrate.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "The appellant has already served nearly three months of the sentence and there is no previous conviction recorded against him.",
      "type": "background",
      "date": null,
      "source": "appellant"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether there was any evidence whatsoever to hold that the gold seized from the person of the appellant was liable to confiscation as contemplated by Section 111 of the Act, particularly under Section 111(d).",
      "framed_by": "appellant"
    },
    {
      "id": "i2",
      "text": "Whether the High Court had wrongly used section 123 of the Act so as to wrongly place the burden of proof on the appellant when this provision did not apply.",
      "framed_by": "appellant"
    },
    {
      "id": "i3",
      "text": "Whether Section 342 of the Criminal Procedure Code had been complied with inasmuch as only two very general questions were asked by the Trying Magistrate.",
      "framed_by": "appellant"
    },
    {
      "id": "i4",
      "text": "Whether the sentence should be reduced given the period already undergone and no previous conviction.",
      "framed_by": "appellant"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "There was no evidence whatsoever to hold that the gold seized from the person of the appellant was liable to confiscation as contemplated by Section 111 of the Act. The only category in which the gold could fall is Section 111(d), but as restrictions on the import of gold were only imposed in 1948, there should have been some evidence to show when it was brought into India.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": "Section 111(d) Customs Act 1962; Section 135(1)(b) Customs Act 1962"
    },
    {
      "id": "pa2",
      "text": "The High Court had wrongly used section 123 of the Act so as to wrongly place the burden of proof on the appellant when this provision did not apply because there must be a seizure of the goods by the proper Customs Officer duly authorised as provided by section 110 of the Act. Initial seizure by Railway Police not under the Act.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": "Section 123 Customs Act 1962; Section 110 Customs Act 1962; Gian Chand Ors. v. The State of Punjab"
    },
    {
      "id": "pa3",
      "text": "Section 342 of the Criminal Procedure Code had not been complied with inasmuch as only two very general questions were asked by the Trying Magistrate, followed by two others on one point. But, the seizure of gold from his possession and the surrounding circumstances were not put to him.",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": "Section 342 Criminal Procedure Code"
    },
    {
      "id": "pa4",
      "text": "The appellant has already served nearly three months of the sentence and there is no previous conviction recorded against him so that the sentence should be reduced to the period already undergone.",
      "supporting_facts": [
        "f12"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "An offence under section 135(1)(b) is punishable if the offender acquires possession of or is in any way concerned in carrying... any goods which he knows or has reason to believe are liable to confiscation under section 111.",
      "addresses_issue": "i1",
      "key_observation": "Argument overlooks the elements of s135(1)(b)."
    },
    {
      "id": "cr2",
      "text": "Even if ratio of Gian Chand applied, no presumption under s123 used; courts relied on circumstantial evidence to infer character of gold and accused's guilty knowledge.",
      "addresses_issue": "i2",
      "key_observation": "High Court and Magistrate did not use s123 presumption."
    },
    {
      "id": "cr3",
      "text": "Conduct of the accused and incredible version enough to saddle with knowledge per Issardas; suspicious conduct, admission knew offence, incredible story of Pannalal, carrying from Bombay port to Delhi market, clandestine manner; inference gold recently imported post-1948; presumption under s114 Evidence Act; burden under s106 Evidence Act.",
      "addresses_issue": "i1",
      "key_observation": "Totality of facts proved enough to raise presumption gold illegally imported under s111(d)."
    },
    {
      "id": "cr4",
      "text": "Appellant fully aware of allegations; gave detailed s108 statement and elaborate written statement; general questions do not strictly comply with s342 CrPC but no injustice suffered; not raised earlier; technical and flimsy.",
      "addresses_issue": "i3",
      "key_observation": "Defect could not vitiate conviction."
    },
    {
      "id": "cr5",
      "text": "In view of age and no previous conviction, reduce sentence to period already undergone; undesirable to send back to jail.",
      "addresses_issue": "i4",
      "key_observation": "Modify sentence."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Circumstantial evidence sufficient to convict under s135(b) without needing s123 presumption; gold liable to confiscation under s111(d).",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "s123 presumption not used and not applicable on facts as per Gian Chand, but conviction sustainable on other evidence.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Non-compliance with s342 CrPC does not vitiate conviction.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    },
    {
      "id": "h4",
      "text": "Sentence reduced to period already undergone.",
      "resolves_issue": "i4",
      "in_favor_of": "partial"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Gian Chand Ors. v. The State of Punjab",
      "citation": "1962 Supp. 1 S.C.R. 364",
      "treatment": "followed",
      "relevance": "Ratio that s123 presumption applies only to seizure by proper Customs officer under the Act; applied but does not lead to acquittal as presumption not used."
    },
    {
      "case_name": "Issardas Daulat Ram Ors. v. Union of India Ors.",
      "citation": "1962 Supp. 1 S.C.R. 358",
      "treatment": "followed",
      "relevance": "Conduct of accused and incredible version enough to infer knowledge of illicit nature of goods."
    }
  ],
  "statutes_cited": [
    {
      "name": "Customs Act 1962",
      "sections": [
        "Section 135(b)",
        "Section 111(d)",
        "Section 108",
        "Section 123",
        "Section 110",
        "Section 111"
      ],
      "relevance": "Basis of offence, statement, presumption, seizure, confiscability of smuggled gold."
    },
    {
      "name": "Evidence Act",
      "sections": [
        "Section 106",
        "Section 114"
      ],
      "relevance": "Burden on accused to prove innocent receipt; presumption from proved facts that gold illegally imported."
    },
    {
      "name": "Criminal Procedure Code",
      "sections": [
        "Section 342"
      ],
      "relevance": "Examination of accused; general questions sufficient, no prejudice."
    },
    {
      "name": "Defence of India Rules",
      "sections": [],
      "relevance": "Charges preferred but acquitted."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Subject to modification of sentence to period already undergone, the appeal is dismissed. The appellant, who is on bail, need not surrender.",
    "relief_granted": "Sentence reduced to period already undergone",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "He also admitted that he knew that transporting of gold like this was a criminal offence.",
      "speaker": "appellant",
      "significance": "Appellant's own admission of guilty knowledge."
    },
    {
      "text": "The totality of facts proved was enough, in our opinion, to raise a presumption under section 114 Evidence Act that the gold had been illegally imported into the country so as to be covered by Section 111(d) of the Act.",
      "speaker": "court",
      "significance": "Court's key finding on smuggled nature of gold."
    },
    {
      "text": "We, therefore, reduce the sentence to the period already undergone.",
      "speaker": "court",
      "significance": "Final modification of sentence."
    }
  ],
  "_case_id": "1974_433",
  "_label": 0,
  "_text_length": 11565,
  "_extracted_at": "2026-02-10T20:06:56.255308"
}