{
  "metadata": {
    "case_name": null,
    "case_year": null,
    "court": null,
    "judges": [],
    "case_number": null,
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "This appeal stands referred to a Bench of three Judges because it was found that a Bench of two learned Judges had taken the view that the conclusion of an earlier Bench of three learned Judges was difficult to accept.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "In Brij Mohan Das Laxman Das vs. Commissioner of Income Tax 223 I.T.R. 825 two learned judges concluded that Explanation 2 to Section 40(b) of the Income Tax Act, 1961, introduced with effect from 1st April, 1985, was declaratory.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "This view was accepted by a Bench of three learned judges in Suwalal Anandilal Jain vs. Commissioner of Income Tax 224 I.T.R. 753.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "In the case of Rashik Lal Co. vs. Commissioner of Income Tax 229 I.T.R. 458 this view was doubted. A Bench of two learned Judges observed that it was difficult to accept the proposition that the said Explanation was only clarificatory for the reason that if what was contained in the said Explanation was already the law in force, then giving effect to the said Explanation from 1st April, 1985 did not make any sense.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "However, in Rashik Lal case, no question of payment of any interest was involved. In other words, the application of Section 40(b) and the said Explanation was not really in issue.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The observations in Rashik Lal case relative to the said Explanation must, therefore, be treated as obiter dicta.",
      "type": "background",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether Explanation 2 to Section 40(b) of the Income Tax Act, 1961, introduced with effect from 1st April, 1985, is prospective in operation or only declaratory.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "A Bench of two learned Judges had taken the view that the conclusion of an earlier Bench of three learned Judges was difficult to accept, leading to referral to a Bench of three Judges.",
      "addresses_issue": "i1",
      "key_observation": "Conflict in views on whether the Explanation is prospective or declaratory."
    },
    {
      "id": "cr2",
      "text": "In Rashik Lal, the doubt expressed was obiter dicta because no question of payment of interest was involved and application of Section 40(b) and Explanation not really in issue.",
      "addresses_issue": "i1",
      "key_observation": "Observations in Rashik Lal relative to the Explanation must be treated as obiter dicta."
    }
  ],
  "holdings": [],
  "precedents_cited": [
    {
      "case_name": "Brij Mohan Das Laxman Das vs. Commissioner of Income Tax",
      "citation": "223 I.T.R. 825",
      "treatment": "followed",
      "relevance": "Two judges concluded Explanation 2 to Section 40(b) was declaratory."
    },
    {
      "case_name": "Suwalal Anandilal Jain vs. Commissioner of Income Tax",
      "citation": "224 I.T.R. 753",
      "treatment": "followed",
      "relevance": "Three judges accepted the view that Explanation was declaratory."
    },
    {
      "case_name": "Rashik Lal Co. vs. Commissioner of Income Tax",
      "citation": "229 I.T.R. 458",
      "treatment": "doubted",
      "relevance": "Two judges doubted the declaratory nature but observations treated as obiter dicta."
    }
  ],
  "statutes_cited": [
    {
      "name": "Income Tax Act, 1961",
      "sections": [
        "40(b)"
      ],
      "relevance": "Explanation 2 introduced w.e.f. 1st April 1985; issue of whether prospective or declaratory."
    }
  ],
  "outcome": {
    "disposition": "remanded",
    "summary": "The appeal stands referred to a Bench of three Judges due to conflicting views on the nature of Explanation 2 to Section 40(b).",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "This appeal stands referred to a Bench of three Judges because it was found that a Bench of two learned Judges had taken the view that the conclusion of an earlier Bench of three learned Judges was difficult to accept.",
      "speaker": "court",
      "significance": "States the reason for referral."
    },
    {
      "text": "However, in the case before us, no question of payment of any interest is involved. In other words, the application of Section 40(b) and the said Explanation was not really in issue in Rashik Lal's case relative to the said Explanation must, therefore, be treated as obiter dicta.",
      "speaker": "court",
      "significance": "Explains why Rashik Lal observations are obiter."
    }
  ],
  "_case_id": "2000_1026",
  "_label": 0,
  "_text_length": 1449,
  "_extracted_at": "2026-02-10T19:13:40.081348"
}