{
  "metadata": {
    "case_name": "State of Punjab v. Respondent Nos. 1 and 2",
    "case_year": null,
    "court": "Supreme Court of India",
    "judges": [
      "Khare, J."
    ],
    "case_number": null,
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Erstwhile Pepsu government decided to allot land measuring 89 canals 5 biswas situated in village Magha to Smt. Bachan Kaur, widow of late Jangir Singh, for maintenance during her lifetime.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On 1.4.52, the deputy commissioner, Sangrur allotted the land to Smt. Bachan Kaur pursuant to government decision; allotment order indicated life estate only.",
      "type": "material",
      "date": "1952-04-01",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Smt. Bachan Kaur came into possession over the said land pursuant to allotment order.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On 10.2.64, Smt. Bachan Kaur executed a registered sale deed in favour of respondent Nos. 1 and 2 in respect of the said land for consideration of Rs. 24,000/-",
      "type": "material",
      "date": "1964-02-10",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Respondent Nos. 1 and 2 came into possession over the said land pursuant to sale deed.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Respondent Nos. 1 and 2 applied for mutation of their names in revenue records, which was granted.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "State of Punjab filed objection against mutation, which was allowed.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "On appeal before financial commissioner, mutation order set aside and parties directed to establish right in civil court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "State of Punjab instituted civil suit on 2.9.74 for declaration that sale deed is illegal and void and confers no title.",
      "type": "procedural",
      "date": "1974-09-02",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Respondent Nos. 1 and 2 filed written statement claiming bona fide purchasers for consideration, acquired title under Section 41 TPA.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f11",
      "text": "Trial court decreed the suit in favour of State of Punjab.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Respondents' appeal before first appellate court dismissed, affirming trial court decree.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Respondents preferred second appeal before High Court, which allowed appeal holding sale deed not voidable as respondents bona fide purchasers for consideration.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the widow having only life estate could sell the interest in the land beyond her lifetime, and whether respondents protected under Section 41 of Transfer of Property Act as bona fide purchasers from ostensible owner.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Widow having limited right during her lifetime could not have transferred interest in land beyond her lifetime.",
      "supporting_facts": [
        "f2",
        "f11"
      ],
      "legal_basis": ""
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Respondents being bona fide purchasers from ostensible owner for consideration and in good faith, sale deed valid under Section 41 of Transfer of Property Act.",
      "supporting_facts": [
        "f4",
        "f5",
        "f6",
        "f10"
      ],
      "legal_basis": "Section 41, Transfer of Property Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Widow had only life estate; could be ostensible owner only to extent of her right during lifetime; ceased to be ostensible owner after death; cannot pass better title than she had; title reverts to State after her death.",
      "addresses_issue": "i1",
      "key_observation": "Section 41 applies only during lifetime of limited owner and not to protect transferees against reversioners."
    },
    {
      "id": "cr2",
      "text": "Mt. Phool Kuer case held Section 41 applies only during lifetime of limited owner.",
      "addresses_issue": "i1",
      "key_observation": "Directly applicable precedent."
    },
    {
      "id": "cr3",
      "text": "Sankara Hali Sankara Institute case inapplicable as arose out of benami transaction.",
      "addresses_issue": "i1",
      "key_observation": "Distinguished."
    },
    {
      "id": "cr4",
      "text": "Syed Abdul Khader case inapplicable as father was ostensible owner in different context.",
      "addresses_issue": "i1",
      "key_observation": "Distinguished."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Widow with life estate cannot transfer interest beyond her lifetime; Section 41 TPA protects only during her lifetime, not against reversioners.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Mt. Phool Kuer v. Mt. Prem Kuer and after her death Bohre Manohor Lal and Anr.",
      "citation": null,
      "treatment": "followed",
      "relevance": "Held that Section 41 applies only during lifetime of limited owner and not to protect transferees against reversioners."
    },
    {
      "case_name": "Sankara Hali Sankara Institute of Philosophy and Culture v. Kishori Lal Goenka and Anr.",
      "citation": null,
      "treatment": "distinguished",
      "relevance": "Inapplicable as arose out of benami transaction."
    },
    {
      "case_name": "Syed Abdul Khader v. Rami Reddy and Ors.",
      "citation": null,
      "treatment": "distinguished",
      "relevance": "Inapplicable as father found to be ostensible owner in different context."
    }
  ],
  "statutes_cited": [
    {
      "name": "Transfer of Property Act",
      "sections": [
        "Section 41"
      ],
      "relevance": "Applies to protect bona fide transferees from ostensible owner, but only during lifetime of limited owner."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; judgment and order of High Court set aside; decree of trial court affirmed.",
    "relief_granted": "Declaration that sale deed illegal and void upheld.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "where a person who has allowed another to occupy the position of an ostensible Owner has a limited estate, the rule of Section 41 applies only during the lifetime of the limited owner and is not available to protect transferees against the claim of the reversioners.",
      "speaker": "court",
      "significance": "Core holding from cited precedent adopted by court."
    },
    {
      "text": "The widow can be ostensible owner to the extent that she has a right during her lifetime. She ceased to be an ostensible owner after her death and cannot pass on a better title than what she had.",
      "speaker": "court",
      "significance": "Key reasoning on limits of Section 41 TPA."
    }
  ],
  "_case_id": "2002_473",
  "_label": 1,
  "_text_length": 4799,
  "_extracted_at": "2026-02-10T19:13:31.519948"
}