{
  "metadata": {
    "case_name": "Deepa Jain & Hari Om Maheshwari v. Respondent",
    "case_year": 2003,
    "court": "Supreme Court of India",
    "judges": [
      "Santosh Hegde, J."
    ],
    "case_number": "Arising out SLP (C) No. 16202 of 2003 With CIVIL APPEAL NO. 7979 OF 2004 Arising out SLP (C) No. 16360 of 2003",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Two disputes pertaining to claims of appellants (Deepa Jain and Hari Om Maheshwari) against respondent referred to arbitration: Arbitration Reference No. 313/95 (Deepa Jain) and No. 316/95 (Hari Om Maheshwari). Proceedings considered together.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "In Reference No. 313/95 (Deepa Jain), evidence of both parties concluded on 29th January 1999.",
      "type": "procedural",
      "date": "1999-01-29",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "In Reference No. 316/95 (Hari Om Maheshwari), evidence of appellant concluded on 8th April 1999; matter listed for evidence of respondent on 10/11th May 1999.",
      "type": "procedural",
      "date": "1999-04-08",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On 10th May 1999, respondent and his advocate absent; arbitrators waited till 4:40 p.m., closed evidence, posted for awards. Order: 'Neither the respondent nor his Advocate is present... It seems that they do not wish to lead any evidence in the matter. The case is closed. We shall make the award.'",
      "type": "procedural",
      "date": "1999-05-10",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "On 20th May 1999, before awards made, respondent sent application to arbitrators seeking further opportunity to lead evidence in Reference No. 313/95 (Deepa Jain); no application in No. 316/95.",
      "type": "procedural",
      "date": "1999-05-20",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Application not entertained; arbitrators delivered awards in November 1999.",
      "type": "procedural",
      "date": "1999-11",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Respondent filed applications under Section 30 of Arbitration Act, 1940 before Single Judge, Bombay High Court to set aside awards, contending wrong noting of date led to absence on 10th May 1999.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "Single Judge allowed applications, set aside awards, remitted to arbitrators for fresh disposal after opportunity to respondent to lead evidence; directed to decide along with earlier remanded case of Jayesh Sanghani.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Appellate Bench of Bombay High Court dismissed appeals against Single Judge's order.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Arbitration proceedings started in 1995.",
      "type": "background",
      "date": "1995",
      "source": "petitioner"
    },
    {
      "id": "f11",
      "text": "Three arbitration proceedings (including Jayesh Sanghani) held simultaneously by same arbitrators involving similar issues; Jayesh Sanghani case already remitted by court.",
      "type": "background",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f12",
      "text": "On 8th April 1999, proceeding order: 'Meeting adjourned to 10th 11th of May, 1999 at 4.00 p.m. No notice to the parties.' Respondent and advocate present on that date.",
      "type": "procedural",
      "date": "1999-04-08",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Single Judge observation: Cross-examination in Deepa Jain case over in 1997; in Maheshwari case completed 8th April 1999; adjourned to 10/11 May for respondent's evidence; respondent noted wrong date, applied 20th May explaining mistake; arbitrators could have permitted evidence as awards delayed till Nov 1999.",
      "type": "disputed",
      "date": null,
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the learned Single Judge or the Division Bench of the High Court were justified in setting aside the award of the arbitrators solely on the ground that the respondent herein who failed to appear before the arbitrators on a day fixed for his evidence ought to have been granted another opportunity to produce his evidence.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether grant or refusal of an adjournment by arbitrators constitutes misconduct under Section 30 of the Arbitration Act, 1940, permitting courts to set aside the award.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Grounds on which High Court set aside award are not the grounds contemplated under Section 30 of the Act.",
      "supporting_facts": [
        "f10"
      ],
      "legal_basis": "Section 30, Arbitration Act, 1940"
    },
    {
      "id": "pa2",
      "text": "Arbitration proceedings started in 1995 could not be completed even in 1999; High Court ought not to have interfered.",
      "supporting_facts": [
        "f10"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "In Reference No. 313/95 (Deepa Jain), evidence already concluded; respondent's explanation for not leading evidence on 10th May 1999 frivolous; arbitrators rightly did not entertain prayer for further opportunity.",
      "supporting_facts": [
        "f2",
        "f4",
        "f5"
      ],
      "legal_basis": "Section 30, Arbitration Act, 1940"
    },
    {
      "id": "pa4",
      "text": "Denial of further opportunity by arbitrators would not be a ground contemplated under Section 30 to set aside award; courts below exceeded scope of Section 30.",
      "supporting_facts": [
        "f4",
        "f5",
        "f6"
      ],
      "legal_basis": "Section 30, Arbitration Act, 1940"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Three arbitration proceedings against respondent held simultaneously by same arbitrators involving similar issues.",
      "supporting_facts": [
        "f1",
        "f11"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "In Jayesh Sanghani case, court already set aside award and remitted; arbitrators did not grant reasonable opportunity to respondent to lead evidence in these cases; High Court justified in giving further opportunity.",
      "supporting_facts": [
        "f11",
        "f8"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Civil court has very limited jurisdiction under Section 30 to interfere with award; does not permit interference with discretionary order of granting or refusing adjournment.",
      "addresses_issue": "i1",
      "key_observation": "Jurisdiction extremely limited to grounds in Section 30(a)-(c); refusal of adjournment does not fall within parameters."
    },
    {
      "id": "cr2",
      "text": "Arbitrators' order of 10.5.1999 reasoned; respondent present on 8.4.1999 when date fixed; closed evidence after waiting; application in 313/95 not acceded to as evidence already closed.",
      "addresses_issue": "i1",
      "key_observation": "Respondent failed to appear despite presence when date fixed."
    },
    {
      "id": "cr3",
      "text": "Refusal of adjournment sought in 1999 in proceedings pending since 1995 not perverse, considering object of Act for speedy resolution.",
      "addresses_issue": "i2",
      "key_observation": "Not perverse given delay."
    },
    {
      "id": "cr4",
      "text": "Cites Arosan Enterprises: Section 30 restrictive; no reappraisal of evidence; no interference unless total perversity or wrong proposition of law; if arbitrator's view possible, no interference.",
      "addresses_issue": "i2",
      "key_observation": "Arbitrator's decision final; court cannot substitute evaluation."
    },
    {
      "id": "cr5",
      "text": "Single Judge and Division Bench erred in setting aside award to give opportunity to defaulting respondent.",
      "addresses_issue": "i1",
      "key_observation": "High Courts exceeded jurisdiction."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "High Court not justified in interfering with discretionary jurisdiction of arbitrators under Section 30; grant/refusal of adjournment not ground to set aside award.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Arbitrators' refusal of further opportunity not misconduct or perversity warranting interference under Section 30.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Arosan Enterprises Ltd. v. Union of India",
      "citation": "(1999) 9 SCC 449",
      "treatment": "followed",
      "relevance": "Section 30 restrictive; no reappraisal of evidence; no interference unless perversity or wrong law; possible view by arbitrator not examinable."
    },
    {
      "case_name": "State of U.P. v. Allied Constructions",
      "citation": "(2003) 7 SCC 396",
      "treatment": "followed",
      "relevance": "Similar view on limited jurisdiction under Section 30."
    },
    {
      "case_name": "Continental Construction Ltd. v. State of U.P.",
      "citation": "(2003) 8 SCC 4",
      "treatment": "followed",
      "relevance": "Similar view on limited jurisdiction under Section 30."
    }
  ],
  "statutes_cited": [
    {
      "name": "Arbitration Act, 1940",
      "sections": [
        "Section 30",
        "Section 35"
      ],
      "relevance": "Limited grounds for setting aside award: misconduct, invalid proceedings, improperly procured; does not cover refusal of adjournment."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Supreme Court holds that High Court erred in setting aside arbitration awards; Single Judge and Division Bench exceeded scope of Section 30 by interfering with arbitrators' discretionary refusal of adjournment to defaulting respondent.",
    "relief_granted": "Appeals allowed; High Court orders set aside; arbitration awards restored (implied).",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"An award shall not be set aside except on one or more of the following grounds, namely: (a) that an arbitrator or umpire has misconducted himself or the proceedings...\"",
      "speaker": "court",
      "significance": "Defines limited grounds under Section 30, Arbitration Act, 1940."
    },
    {
      "text": "\"Neither the respondent nor his Advocate is present... It seems that they do not wish to lead any evidence in the matter. The case is closed. We shall make the award.\"",
      "speaker": "court",
      "significance": "Arbitrators' reasoned order closing evidence after respondent's absence."
    },
    {
      "text": "\"The court as a matter of fact, cannot substitute its evaluation and come to the conclusion that the arbitrator had acted contrary to the bargain between the parties. If the view of the arbitrator is a possible view the award... cannot be examined.\"",
      "speaker": "court",
      "significance": "From Arosan Enterprises; crux of non-interference principle."
    }
  ],
  "_case_id": "2004_764",
  "_label": 1,
  "_text_length": 12923,
  "_extracted_at": "2026-02-08T22:08:45.844340"
}