{
  "metadata": {
    "case_name": "Appellants (Family members of Baldev Singh & Harjap Singh) v. State",
    "case_year": 1997,
    "court": "Supreme Court of India",
    "judges": [
      "K. Sabharwal, J."
    ],
    "case_number": "Criminal Appeal Nos. 151 of 1997 and 227 of 1997",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Baldev Singh was married with Manmohan Kaur in the year 1979.",
      "type": "background",
      "date": "1979",
      "source": "prosecution"
    },
    {
      "id": "f2",
      "text": "Baldev Singh was harassing Manmohan Kaur for not bringing sufficient amount of dowry.",
      "type": "material",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f3",
      "text": "Manmohan Kaur visited house of her father Harbans Singh (PW4) in village Nangal Thindal on 21st June, 1985 and told him that a demand of Rs.30,000/- was still continuing from her husband and she has been told to return to her husband's house only with the said amount.",
      "type": "material",
      "date": "1985-06-21",
      "source": "prosecution"
    },
    {
      "id": "f4",
      "text": "Harbans Singh sent back Manmohan Kaur to her matrimonial house with assurance that he would soon visit the house of her in-laws and settle the matter. She left behind her three years old daughter at her parents house.",
      "type": "material",
      "date": "1985-06-21",
      "source": "prosecution"
    },
    {
      "id": "f5",
      "text": "On 22nd June at about 2.35 p.m., Baldev Singh came to the house of his father-in-law and informed him that Manmohan Kaur was missing from the house since early morning that day.",
      "type": "material",
      "date": "1985-06-22",
      "source": "prosecution"
    },
    {
      "id": "f6",
      "text": "Harbans Singh told Baldev Singh that she had come to him only a day before and was complaining about harassment on account of dowry demand of Rs.30,000/- by him, his parents, sisters, sisters-in-law and brothers, and asked for thorough search.",
      "type": "material",
      "date": "1985-06-22",
      "source": "prosecution"
    },
    {
      "id": "f7",
      "text": "Harbans Singh went out with relatives to search for his daughter but could not succeed. On return on 23rd June, learnt that dead body of Manmohan Kaur had been traced by her in-laws.",
      "type": "material",
      "date": "1985-06-23",
      "source": "prosecution"
    },
    {
      "id": "f8",
      "text": "Harbans Singh rushed to house of in-laws, saw dead body of Manmohan Kaur being consigned to flames at cremation ground.",
      "type": "material",
      "date": "1985-06-23",
      "source": "prosecution"
    },
    {
      "id": "f9",
      "text": "On enquiry, Baldev Singh and parents told Harbans Singh that dead body was cremated after informing Police, completing necessary formalities, as it was decomposing and could not wait.",
      "type": "disputed",
      "date": "1985-06-23",
      "source": "respondent"
    },
    {
      "id": "f10",
      "text": "On 24th June, Harbans Singh filed written application (Exhibit PD) with Senior Superintendent of Police, Hoshiarpur suspecting murder by in-laws for not bringing sufficient dowry, naming appellants besides Baldev Singh and his father.",
      "type": "procedural",
      "date": "1985-06-24",
      "source": "prosecution"
    },
    {
      "id": "f11",
      "text": "Complaint sent to SHO with endorsement dated 4th July, 1985 that prima facie case under Section 306 IPC, case to be registered.",
      "type": "procedural",
      "date": "1985-07-04",
      "source": "prosecution"
    },
    {
      "id": "f12",
      "text": "Formal FIR under Section 306 IPC registered on 4th July, investigation conducted, challan filed under Section 306/201 IPC, committed to Sessions Court.",
      "type": "procedural",
      "date": "1985-07-04",
      "source": "prosecution"
    },
    {
      "id": "f13",
      "text": "Harbans Singh filed criminal complaint against appellants and others under Section 302/201/149 IPC, committed to Sessions, directed to be tried with police case, both consolidated.",
      "type": "procedural",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f14",
      "text": "Sessions Court acquitted all accused of Section 302 and 302/149 IPC. Baldev Singh held guilty under Section 306 IPC. Appellants acquitted under Section 306 but guilty under Section 201 IPC, sentenced to RI for one year and fine.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f15",
      "text": "State and Harbans Singh appealed acquittal; appellants appealed conviction under Section 201. High Court dismissed all appeals by common judgment, confirming acquittal under 306 and conviction under 201 for appellants.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f16",
      "text": "Acquittal of appellants under Section 306 IPC attained finality. Baldev Singh's conviction under 306 final as leave refused.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f17",
      "text": "Sessions Court found: When Harbans Singh (PW4) with Darshan Singh (PW8) reached cremation ground, pyre burning, all accused present with others; accused said body in house before cremation; no autopsy conducted.",
      "type": "material",
      "date": "1985-06-23",
      "source": "lower_court"
    },
    {
      "id": "f18",
      "text": "Appellants in C.A. No.151/1997: Appellant Nos. 3 and 5 brothers of Baldev Singh, No.4 wife of No.3, No.6 wife of No.5, No.7 sister, No.2 mother (died, appeal abated).",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f19",
      "text": "Harjap Singh sole appellant in C.A. No.227/1997, family friend of Baldev Singh.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f20",
      "text": "High Court reasons: Accused (family members except Harjap Singh) knew of death and missing; all present at cremation per PW4,5,8; cremated without informing police/Harbans; acted to eliminate evidence screening Baldev under 306.",
      "type": "disputed",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Correctness of the conviction of the appellants for offence under Section 201 IPC.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Sessions Court concluded that body cremated in haste without informing parents/police, no autopsy; accused close relations in same house had knowledge/reason to believe offence committed and caused disappearance of evidence by cremation.",
      "addresses_issue": "i1",
      "key_observation": "Circumstances indicate knowledge and intent under Section 201."
    },
    {
      "id": "cr2",
      "text": "High Court confirmed: Family knew of missing and death; all present at cremation; responsible for eliminating evidence without informing police/Harbans; acted in common object to screen Baldev under Section 306.",
      "addresses_issue": "i1",
      "key_observation": "Presence and relationship imply responsibility."
    },
    {
      "id": "cr3",
      "text": "For conviction under Section 201, prosecution must prove appellants had knowledge/reason to believe offence under 306 committed by Baldev, and with such knowledge caused evidence to disappear to screen offender.",
      "addresses_issue": "i1",
      "key_observation": "Only findings: family relationship, Harpal friend, presence at house/cremation; mere presence/relationship does not attract Section 201."
    },
    {
      "id": "cr4",
      "text": "No presumption of knowledge from mere presence/relationship; no other evidence; cannot assume on suspicion that appellants knew/believed Baldev committed offence and participated to conceal.",
      "addresses_issue": "i1",
      "key_observation": "Absence of evidence; suspicion insufficient."
    },
    {
      "id": "cr5",
      "text": "Perused record: No evidence to prove guilt under Section 201.",
      "addresses_issue": "i1",
      "key_observation": "Cannot hold appellants knew/believed offence committed and caused evidence disappearance."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "To establish charge under Section 201 IPC, essential to prove offence committed (mere suspicion insufficient), accused knew/reason to believe it committed, and with intent to screen offender caused evidence to disappear.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Palvinder Kaur v. The State of Punjab",
      "citation": "1953 4 SCR 94",
      "treatment": "followed",
      "relevance": "Essential to prove offence committed (not mere suspicion), knowledge/reason to believe, and intent to screen offender by causing evidence disappearance."
    },
    {
      "case_name": "Suleman Rahiman Mulani Anr. v. State of Maharashtra",
      "citation": "AIR 1968 SC 829",
      "treatment": "followed",
      "relevance": "Followed Palvinder Kaur on requirements for Section 201 IPC."
    },
    {
      "case_name": "Nathu Anr. v. State of Uttar Pradesh",
      "citation": "1979 3 SCC 574",
      "treatment": "followed",
      "relevance": "Followed Palvinder Kaur on requirements for Section 201 IPC."
    },
    {
      "case_name": "V.L. Tresa v. State of Kerala",
      "citation": "2001 3 SCC 549",
      "treatment": "followed",
      "relevance": "Followed Palvinder Kaur on requirements for Section 201 IPC."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "Section 201",
        "Section 306",
        "Section 302",
        "Section 149"
      ],
      "relevance": "Conviction under Section 201 for causing disappearance of evidence; Section 306 for abetment of suicide (Baldev convicted); 302/149 alleged murder."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "The appeals are allowed. Conviction of the appellants under Section 201 IPC set aside and they are acquitted.",
    "relief_granted": "Acquittal from offence under Section 201 IPC",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The mere presence of the accused at the house or at the cremation ground or their relationship with her husband would not attract the provision of Section 201 IPC.",
      "speaker": "court",
      "significance": "Rejects inference of guilt from presence/relationship alone."
    },
    {
      "text": "Presumption that the appellants had the knowledge of commission of offence cannot be drawn from their mere presence at the house or cremation ground or on account of relationship.",
      "speaker": "court",
      "significance": "No presumption without evidence."
    },
    {
      "text": "In absence of evidence, it cannot be assumed on suspicion alone that the appellants must have known or must have reason to believe that Baldev Singh abetted in commission of offence.",
      "speaker": "court",
      "significance": "Suspicion insufficient for conviction."
    }
  ],
  "_case_id": "2004_139",
  "_label": 1,
  "_text_length": 10088,
  "_extracted_at": "2026-02-08T22:08:56.625057"
}