{
  "metadata": {
    "case_name": "In Re: Special Reference No. 1 of 2001 under Article 143(1) of the Constitution (Gujarat Gas Regulation of Transmission, Supply and Distribution Act, 2001)",
    "case_year": 2004,
    "court": "Supreme Court of India",
    "judges": [
      "G. Balakrishnan, J."
    ],
    "case_number": "Special Reference No. 1/2001 with W.P.(C) No. 852/91, C.A. Nos. 3575, 3576 of 1991",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Gujarat State legislature passed the Gujarat Gas Regulation of Transmission, Supply and Distribution Act, 2001 (Gujarat Act), which came into force w.e.f. 19th December 2000.",
      "type": "background",
      "date": "2000-12-19",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Object of Gujarat Act is to provide for regulation of transmission, supply and distribution of gas, in the interests of general public and to promote gas industry in the State, establishing Gujarat Gas Regulatory Authority.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Gas defined in Gujarat Act under Section 2(h) as 'a matter in gaseous state which predominantly consists of methane'.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Gujarat Act passed tracing legislative competence under Entry No. 25 of List II (Gas and gas works).",
      "type": "background",
      "date": null,
      "source": "state"
    },
    {
      "id": "f5",
      "text": "Parliament passed enactments under Entry No. 53 of List I (Regulation and development of oilfields and mineral oil resources; petroleum and petroleum products...) including Petroleum Act, 1934; Oil Fields (Regulation and Development) Act, 1948; Oil Industry (Development) Act, 1974; Petroleum and Minerals Pipelines (Acquisition of Right of User in Land) Act, 1962.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Oil and Natural Gas Commission increased price of natural gas supplied by them.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Association of Natural Gas Consuming Industries of Gujarat and others filed Civil Writ Petition before High Court of Gujarat challenging legislative competence of Union to make laws on gas and gas works.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "President of India made Reference under Article 143(1) of the Constitution referring three questions on legislative competence over natural gas.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Notices served on States and Union Territories; Attorney General for Union and counsel for States heard.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Gujarat Act provisions: Commissioner of Gas (Ch II); Gujarat Gas Regulatory Authority (Ch III); functions include regulating transmission, supply, distribution (Ch IV); no person other than specified company to carry on transmission business (S.23); no pipelines without licence (S.25); penalties for contravention (S.34).",
      "type": "background",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether natural gas in whatever physical form including Liquefied Natural Gas (LNG) is a Union subject covered by Entry 53 of List I and the Union has exclusive legislative competence to enact laws on natural gas.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether States have legislative competence to make laws on the subject of natural gas and Liquefied Natural Gas under Entry 25 of List II of the Seventh Schedule to the Constitution.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether the State of Gujarat had legislative competence to enact Gujarat Gas Regulation of Transmission, Supply and Distribution Act 2001.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Natural gas is a Union subject covered by Entry 53 List I; definitions in various enactments indicate petroleum and petroleum products include natural gas; uniform legislative practice treats natural gas as such; Central legislations like Oil Fields Act 1948, Oil Industry Development Act 1974 etc. passed under Entry 53; Entry 25 List II relates to manufactured gas like acetylene, oxygen etc., not natural gas.",
      "supporting_facts": [
        "f5",
        "f3"
      ],
      "legal_basis": "Entry 53 List I; Oil Fields (Regulation and Development) Act, 1948; Oil Industry (Development) Act, 1974; Petroleum and Minerals Pipelines Act, 1962; Petroleum Natural Gas Rules, 1959; Industries (Development and Regulation) Act, 1951"
    },
    {
      "id": "pa2",
      "text": "Gujarat Act trenches upon Union field by regulating distribution/transmission of gas, licensing, etc., ultra vires.",
      "supporting_facts": [
        "f10"
      ],
      "legal_basis": "Entry 53 List I"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Expression 'gas' in Entry 25 List II includes all types of gases including natural gas and LNG; widest amplitude to entries; reconcile conflicts; Calcutta Gas Co. held Entry 25 covers gas industry; natural gas predominantly methane, not petroleum product; can be extracted without petroleum.",
      "supporting_facts": [
        "f3",
        "f4"
      ],
      "legal_basis": "Entry 25 List II; Calcutta Gas Company (Proprietary) Ltd v. State of West Bengal (1962 Suppl. 3 SCR 1)"
    },
    {
      "id": "ra2",
      "text": "In Assam, gases extracted not in association with petroleum; natural resource vital to State economy; federalism requires States to exploit; natural gas distinct from petroleum in commercial/scientific parlance; classified as wet/lean/dry/sour/sweet gas, not associated with petroleum products.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": "Entry 25 List II; Sir Byramji Jeejibhai v. Province of Bombay"
    },
    {
      "id": "ra3",
      "text": "Natural gas equivalent to electricity/water; States best to exploit/distribute; gas works include natural gas industry.",
      "supporting_facts": [],
      "legal_basis": "Entry 25 List II"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Entries are fields of legislation; reconcile apparent conflicts; doctrine of pith and substance; incidental encroachment allowed but irreconcilable conflict favours Union.",
      "addresses_issue": "i1",
      "key_observation": "Harmonise entries; legislative practice important."
    },
    {
      "id": "cr2",
      "text": "Natural gas is petroleum product/mineral oil resource per definitions in encyclopedias (Kirk-Othmer, Britannica), dictionaries; formed with petroleum; processed to methane etc.; associated in nature.",
      "addresses_issue": "i1",
      "key_observation": "Natural gas predominantly methane, extracted from oilfields; encompassed in regulation/development of oilfields/mineral oil resources."
    },
    {
      "id": "cr3",
      "text": "Legislative practice: Indian Acts like Oil Fields Act 1948 (mineral oils include natural gas), Mines Act 1952, MMDR Act 1957, PNG Rules 1959, Pipelines Act 1962, OID Act 1974 all include natural gas in petroleum/petroleum products/mineral oils.",
      "addresses_issue": "i1",
      "key_observation": "Consistent practice treats natural gas as Union subject under Entry 53 List I."
    },
    {
      "id": "cr4",
      "text": "Entry 25 List II covers manufactured gas/gas works (e.g., artificial gas for lighting/welding); not natural gas; colocation of 'gas and gas works' indicates manufactured gas.",
      "addresses_issue": "i2",
      "key_observation": "Natural gas fundamentally different from manufactured gas."
    },
    {
      "id": "cr5",
      "text": "National interest: equitable distribution across States; cannot allow one State monopoly; publici juris like water.",
      "addresses_issue": "i1",
      "key_observation": "Fortifies Union control."
    },
    {
      "id": "cr6",
      "text": "Calcutta Gas Co. not applicable as did not consider natural gas vs petroleum; dealt with manufactured gas company.",
      "addresses_issue": "i2",
      "key_observation": "Distinguished."
    },
    {
      "id": "cr7",
      "text": "Gujarat Act definition of gas includes natural gas; provisions regulate transmission/supply/distribution encroaching Union field.",
      "addresses_issue": "i3",
      "key_observation": "Ultra vires to extent relating to natural gas/LNG."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Natural Gas including Liquefied Natural Gas (LNG) is a Union subject covered by Entry 53 of List I and the Union has exclusive legislative competence to enact laws on natural gas.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "The States have no legislative competence to make laws on the subject of natural gas and liquefied natural gas under Entry 25 of List II of the Seventh Schedule to the Constitution.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h3",
      "text": "The Gujarat Gas Regulation of Transmission, Supply and Distribution Act, 2001, so far as the provisions contained therein relating to the natural gas or liquefied natural gas (LNG) are concerned, is without any legislative competence and the Act is to that extent ultra vires of the Constitution.",
      "resolves_issue": "i3",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Calcutta Gas Company (Proprietary) Ltd v. State of West Bengal",
      "citation": "1962 Suppl. 3 SCR 1",
      "treatment": "distinguished",
      "relevance": "Held Entry 25 List II covers gas industry but did not consider natural gas as petroleum product."
    },
    {
      "case_name": "Prafulla Kumar Mukherjee v. Bank of Commerce Ltd.",
      "citation": "1947 74 IA 23",
      "treatment": "followed",
      "relevance": "Doctrine of pith and substance; overlaps possible."
    },
    {
      "case_name": "State of Madras v. Gannon Dunkerley & Co.",
      "citation": "1959 SCR 379",
      "treatment": "followed",
      "relevance": "Legislative practice important in interpreting constitutional words."
    },
    {
      "case_name": "In re Central Provinces and Berar Act No. XIV of 1938",
      "citation": "1939 ELR 18",
      "treatment": "referred",
      "relevance": "Reconcile conflicting entries; context and scheme."
    },
    {
      "case_name": "Subramanyan Chettiar v. Muttuswami Goundar",
      "citation": "1940 FCR 188",
      "treatment": "followed",
      "relevance": "Pith and substance to avoid invalidity from incidental overlap."
    },
    {
      "case_name": "Sir Byramji Jeejibhai v. Province of Bombay",
      "citation": "1939 3 FLJ HC 25",
      "treatment": "referred",
      "relevance": "Reconcile conflicting lists."
    },
    {
      "case_name": "Borys v. Canadian Pacific Railway Co.",
      "citation": "1953 1 All ER 451",
      "treatment": "distinguished",
      "relevance": "Gas and petroleum distinct in specific conveyance context; not applicable."
    },
    {
      "case_name": "In re Cauvery Water Disputes Tribunal",
      "citation": "1993 Supp(1) SCC 96",
      "treatment": "referred",
      "relevance": "Flowing water publici juris; analogous to natural gas national interest."
    }
  ],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Article 143(1)",
        "Article 246",
        "Entry 53 List I",
        "Entry 25 List II"
      ],
      "relevance": "Exclusive Union competence over natural gas under Entry 53 List I; States limited to manufactured gas under Entry 25 List II."
    },
    {
      "name": "Gujarat Gas (Regulation of Transmission, Supply and Distribution) Act, 2001",
      "sections": [
        "S.2(h)",
        "S.2(g)",
        "S.18",
        "S.23",
        "S.25",
        "S.34",
        "S.55"
      ],
      "relevance": "Ultra vires to extent regulating natural gas/LNG."
    },
    {
      "name": "Oil Fields (Regulation and Development) Act, 1948",
      "sections": [
        "S.3(c)"
      ],
      "relevance": "Mineral oils include natural gas and petroleum."
    },
    {
      "name": "Oil Industry (Development) Act, 1974",
      "sections": [
        "S.2(h)",
        "S.2(m)"
      ],
      "relevance": "Mineral oil includes petroleum and natural gas; petroleum product from petroleum/natural gas."
    },
    {
      "name": "Petroleum and Minerals Pipelines (Acquisition of Right of User in Land) Act, 1962",
      "sections": [
        "S.2(c)"
      ],
      "relevance": "Petroleum includes natural gas and refinery gas."
    },
    {
      "name": "Petroleum and Natural Gas Rules, 1959",
      "sections": [
        "R.3(k)",
        "R.3(n)"
      ],
      "relevance": "Petroleum includes natural gas; petroleum product from petroleum/natural gas."
    },
    {
      "name": "Mines Act, 1952",
      "sections": [
        "S.2(jj)"
      ],
      "relevance": "Minerals include mineral oils (natural gas and petroleum)."
    },
    {
      "name": "Mines and Minerals (Development and Regulation) Act, 1957",
      "sections": [
        "S.3(b)"
      ],
      "relevance": "Mineral oils include natural gas and petroleum."
    },
    {
      "name": "Industries (Development and Regulation) Act, 1951",
      "sections": [],
      "relevance": "Central legislation on petroleum products."
    },
    {
      "name": "Petroleum Act, 1934",
      "sections": [],
      "relevance": "Basis for definitions including natural gas."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Reference answered holding natural gas/LNG is Union subject under Entry 53 List I; States have no competence under Entry 25 List II; Gujarat Act ultra vires to extent dealing with natural gas/LNG. Writ Petition and Civil Appeals dismissed.",
    "relief_granted": "None; declaratory opinion on legislative competence.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"Natural Gas including Liquefied Natural Gas (LNG) is a Union subject covered by Entry 53 of List I and the Union has exclusive legislative competence to enact laws on natural gas.\"",
      "speaker": "court",
      "significance": "Direct answer to first question, core holding."
    },
    {
      "text": "\"Entry 25 of List II could only cover manufactured gas and does not cover Natural Gas within its ambit.\"",
      "speaker": "court",
      "significance": "Interpretation limiting State competence."
    },
    {
      "text": "\"Natural gas being a petroleum product, we are of the view that under Entry 53 List I, Union Govt. alone has got legislative competence.\"",
      "speaker": "court",
      "significance": "Key reasoning on classification."
    },
    {
      "text": "\"For free and smooth flow of trade, commerce and industry throughout the length and breadth of the country, natural gas and other petroleum products play a vital role.\"",
      "speaker": "court",
      "significance": "National interest justification for Union control."
    }
  ],
  "_case_id": "2004_246",
  "_label": 0,
  "_text_length": 47404,
  "_extracted_at": "2026-02-10T19:13:43.176634"
}