{
  "metadata": {
    "case_name": "Special Reference No. 1 of 2001 (Gujarat Gas Question)",
    "case_year": 2004,
    "court": "Supreme Court of India",
    "judges": [
      "G. Balakrishnan, J."
    ],
    "case_number": "Special Reference No. 1/2001 under Article 143(1)",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Gujarat State legislature passed Gujarat Gas Regulation of Transmission, Supply and Distribution Act, 2001, effective w.e.f. 19th December 2000.",
      "type": "background",
      "date": "2000-12-19",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Object of Gujarat Act: to provide for regulation of transmission, supply and distribution of gas, in the interests of general public and to promote gas industry in the State, establishing Gujarat Gas Regulatory Authority.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Gas defined in Gujarat Act Section 2(h) as: Gas means a matter in gaseous state which predominantly consists of methane.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Gujarat Act passed tracing legislative competence under Entry No. 25 of List II (Gas and gas works).",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Parliament passed enactments under Entry No. 53 of List I: Petroleum Act, 1934; Oil Fields (Regulation and Development) Act, 1948; Oil Industry (Development) Act, 1974; Petroleum and Minerals Pipelines (Acquisition of Right of User in Land) Act, 1962; Petroleum Natural Gas Rules, 1959; Industries (Development and Regulation) Act, 1951.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Oil and Natural Gas Commission increased price of natural gas supplied by them.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Association of Natural Gas Consuming Industries of Gujarat and others filed Civil Writ Petition before High Court of Gujarat challenging legislative competence of Union to make laws on gas and gas works.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "President of India made Reference under Article 143(1) posing three questions on legislative competence over natural gas including LNG.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Notices served on States and Union Territories; Attorney General for Union; counsel for States appeared.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Gujarat Act provisions: Commissioner of Gas; Gujarat Gas Regulatory Authority (Chairperson + 2 members); regulates transmission, supply, distribution; licensing for pipelines; offences and penalties.",
      "type": "material",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether natural gas in whatever physical form including Liquefied Natural Gas (LNG) is a Union subject covered by Entry 53 of List I and the Union has exclusive legislative competence to enact laws on natural gas.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether States have legislative competence to make laws on the subject of natural gas and Liquefied Natural Gas under Entry 25 of List II of the Seventh Schedule to the Constitution.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether the State of Gujarat had legislative competence to enact Gujarat Gas (Regulation of Transmission, Supply and Distribution) Act 2001.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Natural gas is a Union subject covered by Entry 53 List I; definitions in various enactments include natural gas in petroleum and petroleum products; uniform legislative practice; Central Government ensures balanced growth in supply, transmission, distribution; Entry 25 List II relates to manufactured gas like acetylene, oxygen for local use.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": "Entry 53 List I; Oil Fields (Regulation and Development) Act, 1948; Oil Industry (Development) Act, 1974; Petroleum and Minerals Pipelines Act, 1962; Petroleum Natural Gas Rules, 1959"
    },
    {
      "id": "pa2",
      "text": "Gujarat Act trenches upon Union field; provisions confer authority on State to regulate distribution/transmission, take over mineral oil fields, licensing ultra vires.",
      "supporting_facts": [
        "f10"
      ],
      "legal_basis": "Entry 53 List I"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Expression 'gas' in Entry 25 List II includes all types of gases including natural gas and LNG; widest amplitude to entries; reconcile conflicts; Calcutta Gas Co. held entire gas industry under Entry 25 List II.",
      "supporting_facts": [
        "f4",
        "f3"
      ],
      "legal_basis": "Entry 25 List II; Calcutta Gas Company (Proprietary) Ltd v. State of West Bengal (1962 Suppl. 3 SCR 1)"
    },
    {
      "id": "ra2",
      "text": "Natural gas is matter in gaseous state predominantly methane, not within petroleum/petroleum products; extracted without petrol; distinct in commercial, scientific parlance; federalism requires States to exploit resources.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": "Entry 25 List II; Sir Byramji Jeejibhai v. Province of Bombay"
    },
    {
      "id": "ra3",
      "text": "Natural gas equivalent to electricity/water; categories like wet gas, lean gas etc. not associated with petroleum; States best to exploit and distribute.",
      "supporting_facts": [],
      "legal_basis": "Entry 25 List II"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Entries are fields of legislation; reconcile apparent conflicts; doctrine of pith and substance; incidental encroachment allowed but irreconcilable conflict Central prevails.",
      "addresses_issue": "i1",
      "key_observation": "Harmonise entries; legislative practice important."
    },
    {
      "id": "cr2",
      "text": "Natural gas defined in encyclopedias/dictionaries as naturally occurring hydrocarbon gases often associated with petroleum; processed to methane etc.; formed similarly to petroleum.",
      "addresses_issue": "i1",
      "key_observation": "Natural gas is a petroleum product."
    },
    {
      "id": "cr3",
      "text": "Legislative practice: Various Union Acts define petroleum/mineral oils inclusively to include natural gas (e.g., Oil Fields Act 1948, Mines Act 1952, Petroleum Rules 1959, etc.).",
      "addresses_issue": "i1",
      "key_observation": "Consistent treatment as Union subject under Entry 53 List I."
    },
    {
      "id": "cr4",
      "text": "Entry 25 List II covers manufactured gas and gas works (local gases like acetylene for welding, hospitals); not natural gas; colocation of words limits to manufactured gas.",
      "addresses_issue": "i2",
      "key_observation": "States competent only for manufactured gas."
    },
    {
      "id": "cr5",
      "text": "National interest: Natural gas vital for trade/commerce; equitable sharing across States; regulation by Union for development.",
      "addresses_issue": "i1",
      "key_observation": "Union competence for oilfields/mineral oil resources encompasses natural gas."
    },
    {
      "id": "cr6",
      "text": "Gujarat Act definition includes natural gas; provisions on natural gas ultra vires.",
      "addresses_issue": "i3",
      "key_observation": "Act lacks competence re natural gas/LNG."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Natural Gas including Liquefied Natural Gas (LNG) is a Union subject covered by Entry 53 of List I and the Union has exclusive legislative competence to enact laws on natural gas.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "The States have no legislative competence to make laws on the subject of natural gas and liquefied natural gas under Entry 25 of List II.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h3",
      "text": "The Gujarat Gas (Regulation of Transmission, Supply Distribution) Act, 2001, so far as provisions relating to natural gas or LNG are concerned, is without legislative competence and ultra vires.",
      "resolves_issue": "i3",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Calcutta Gas Company (Proprietary) Ltd v. State of West Bengal",
      "citation": "1962 Suppl. 3 SCR 1",
      "treatment": "followed",
      "relevance": "Scope of Entry 25 List II covers gas industry but distinguished as not addressing natural gas vs petroleum."
    },
    {
      "case_name": "Prafulla Kumar Mukherjee v. Bank of Commerce Ltd.",
      "citation": "1947 74 IA 23",
      "treatment": "referred",
      "relevance": "Doctrine of pith and substance; overlaps in legislative powers."
    },
    {
      "case_name": "State of Madras v. Gannon Dunkerley Co.",
      "citation": "1959 SCR 379",
      "treatment": "followed",
      "relevance": "Legislative practice in interpreting constitutional words."
    },
    {
      "case_name": "In re Central Provinces and Berar Act No. XIV of 1938",
      "citation": "1939 ELR 18",
      "treatment": "referred",
      "relevance": "Reconciling conflicting entries; context and scheme."
    },
    {
      "case_name": "Borys v. Canadian Pacific Railway Co.",
      "citation": "1953 1 All ER 451",
      "treatment": "distinguished",
      "relevance": "Gas and petroleum distinct but not applicable here."
    }
  ],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Article 143(1)",
        "Article 246",
        "Entry 53 List I",
        "Entry 25 List II"
      ],
      "relevance": "Distribution of legislative powers; reference jurisdiction; natural gas under Union List."
    },
    {
      "name": "Gujarat Gas (Regulation of Transmission, Supply and Distribution) Act, 2001",
      "sections": [
        "Section 2(h)",
        "Section 2(g)",
        "Section 23",
        "Section 25",
        "Section 34",
        "Section 55"
      ],
      "relevance": "State enactment held ultra vires re natural gas."
    },
    {
      "name": "Oilfields (Regulation and Development) Act, 1948",
      "sections": [
        "Section 3(c)"
      ],
      "relevance": "Mineral oils include natural gas."
    },
    {
      "name": "Mines Act, 1952",
      "sections": [
        "Section 2(jj)"
      ],
      "relevance": "Minerals include mineral oils (natural gas, petroleum)."
    },
    {
      "name": "Mines and Minerals (Development and Regulation) Act, 1957",
      "sections": [
        "Section 3(b)"
      ],
      "relevance": "Mineral oils include natural gas."
    },
    {
      "name": "Petroleum and Natural Gas Rules, 1959",
      "sections": [
        "Rule 3(k)",
        "Rule 3(n)"
      ],
      "relevance": "Petroleum includes natural gas; products from petroleum/natural gas."
    },
    {
      "name": "Petroleum and Minerals Pipelines (Acquisition of Right of User in Land) Act, 1962",
      "sections": [
        "Section 2(c)"
      ],
      "relevance": "Petroleum includes natural gas."
    },
    {
      "name": "Oil Industry (Development) Act, 1974",
      "sections": [
        "Section 2(h)",
        "Section 2(m)"
      ],
      "relevance": "Mineral oil includes natural gas; petroleum products from it."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Reference answered: Natural gas/LNG is Union subject under Entry 53 List I; States lack competence under Entry 25 List II; Gujarat Act ultra vires re natural gas. Writ Petition (W.P.C. No. 852/91) and Civil Appeals (C.A. Nos. 3575, 3576 of 1991) dismissed.",
    "relief_granted": "None; opinion in favour of Union legislative competence.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"Natural Gas including Liquefied Natural Gas (LNG) is a Union subject covered by Entry 53 of List I and the Union has exclusive legislative competence to enact laws on natural gas.\"",
      "speaker": "court",
      "significance": "Direct answer to first referred question."
    },
    {
      "text": "\"Entry 25 of List II could only cover manufactured gas and does not cover Natural Gas within its ambit.\"",
      "speaker": "court",
      "significance": "Limits State legislative power."
    },
    {
      "text": "\"Natural gas being a petroleum product, we are of the view that under Entry 53 List I, Union Govt. alone has got legislative competence.\"",
      "speaker": "court",
      "significance": "Core holding on classification."
    }
  ],
  "_case_id": "2004_246",
  "_label": 0,
  "_text_length": 47404,
  "_extracted_at": "2026-02-08T22:08:45.952138"
}