{
  "metadata": {
    "case_name": "Deepa Jain & Hari Om Maheshwari v. Respondent",
    "case_year": 2004,
    "court": "Supreme Court of India",
    "judges": [
      "Santosh Hegde, J."
    ],
    "case_number": "SLP(C) No. 16202 of 2003 with Civil Appeal No. 7979 of 2004 arising out SLP(C) No. 16360 of 2003",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Two disputes pertaining to claims of appellants against respondent referred to arbitration: Arbitration Reference No. 313/95 (Deepa Jain) and No. 316/95 (Hari Om Maheshwari). Proceedings considered together.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "In Reference No. 313/95 (Deepa Jain), evidence of both parties concluded on 29th January 1999.",
      "type": "procedural",
      "date": "1999-01-29",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "In Reference No. 316/95 (Hari Om Maheshwari), evidence of appellant concluded on 8th April 1999; matter listed for evidence of respondent on 10/11th May 1999.",
      "type": "procedural",
      "date": "1999-04-08",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On 10th May 1999, respondent absent; arbitrators waited till 4:40 p.m., closed evidence, posted for awards. Order: 'Neither the respondent nor his Advocate is present... It seems that they do not wish to lead any evidence... The case is closed. We shall make the award.'",
      "type": "procedural",
      "date": "1999-05-10",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Arbitration proceedings started in 1995.",
      "type": "background",
      "date": "1995",
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "Before awards made (on 20th May 1999), respondent sent application seeking further opportunity to lead evidence in Reference No. 313/95 (Deepa Jain); no application in No. 316/95.",
      "type": "procedural",
      "date": "1999-05-20",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Application not entertained by arbitrators; awards delivered in November 1999.",
      "type": "procedural",
      "date": "1999-11",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Respondent filed applications under Section 30 of Arbitration Act, 1940 before Single Judge, Bombay High Court to set aside awards, contending wrong noting of date, absence on 10th May 1999.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f9",
      "text": "Single Judge allowed applications, set aside awards, remitted to arbitrators for fresh disposal after opportunity to respondent to lead evidence; directed to decide along with earlier remanded case of Jayesh Sanghani.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Appellate Bench of Bombay High Court dismissed appeals against Single Judge's order.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "On 8.4.1999, proceeding note: 'Meeting adjourned to 10th 11th of May, 1999 at 4.00 p.m. No notice to the parties.' Respondent and advocate present on that date.",
      "type": "procedural",
      "date": "1999-04-08",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Three arbitration proceedings against respondent held simultaneously by same arbitrators involving similar issues; Jayesh Sanghani case already remitted by court.",
      "type": "background",
      "date": null,
      "source": "respondent"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the learned Single Judge or the Division Bench of the High Court were justified in setting aside the award of the arbitrators solely on the ground that the respondent who failed to appear before the arbitrators on a day fixed for his evidence ought to have been granted another opportunity to produce his evidence.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether grant or refusal of an adjournment by arbitrator constitutes misconduct under Section 30 of the Arbitration Act, 1940.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Grounds on which High Court set aside award are not the grounds contemplated under Section 30 of the Act.",
      "supporting_facts": [
        "f5",
        "f7"
      ],
      "legal_basis": "Section 30, Arbitration Act 1940"
    },
    {
      "id": "pa2",
      "text": "Arbitration proceedings started in 1995 could not be completed even in 1999; High Court ought not to have interfered.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "In Reference No. 313/95, evidence already concluded; explanation by respondent for not leading evidence on 10th May 1999 frivolous; arbitrators rightly did not entertain prayer for further opportunity.",
      "supporting_facts": [
        "f2",
        "f4",
        "f6"
      ],
      "legal_basis": "Section 30, Arbitration Act 1940"
    },
    {
      "id": "pa4",
      "text": "Denial of further opportunity not a ground under Section 30; courts below exceeded scope.",
      "supporting_facts": [
        "f4",
        "f6"
      ],
      "legal_basis": "Section 30, Arbitration Act 1940"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Three arbitration proceedings simultaneous by same arbitrators, similar issues; Jayesh Sanghani case already remitted; arbitrators did not grant reasonable opportunity to lead evidence.",
      "supporting_facts": [
        "f1",
        "f12",
        "f9"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "High Court justified in giving further opportunity; not fit for interference under Article 136.",
      "supporting_facts": [
        "f8",
        "f9"
      ],
      "legal_basis": "Article 136, Constitution of India"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Jurisdiction under Section 30 extremely limited; does not permit interference with discretionary order of arbitrators on granting/refusing adjournment.",
      "addresses_issue": "i1",
      "key_observation": "Civil court cannot reappraise evidence or substitute its evaluation."
    },
    {
      "id": "cr2",
      "text": "Arbitrators' refusal of adjournment sought in 1999 for proceedings pending since 1995 not perverse, given object of Act for speedy resolution.",
      "addresses_issue": "i2",
      "key_observation": "Refusal by reasoned order of 10.5.1999."
    },
    {
      "id": "cr3",
      "text": "Single Judge erred in finding arbitrators should have permitted evidence since they waited till Nov 1999; this exceeds Sec 30 scope.",
      "addresses_issue": "i1",
      "key_observation": "Respondent present on 8.4.1999 when date fixed."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Courts below erred in setting aside awards solely to give opportunity to defaulting respondent; Single Judge and Division Bench orders set aside.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Grant/refusal of adjournment does not fall within parameters of Section 30; no interference unless misconduct, etc., as specified.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Arosan Enterprises Ltd. v. Union of India",
      "citation": "(1999) 9 SCC 449",
      "treatment": "followed",
      "relevance": "Section 30 restrictive; no reappraisal of evidence; court cannot interfere if arbitrator's view possible."
    },
    {
      "case_name": "State of U.P. v. Allied Constructions",
      "citation": "(2003) 7 SCC 396",
      "treatment": "followed",
      "relevance": "Limited jurisdiction under Section 30."
    },
    {
      "case_name": "Continental Construction Ltd. v. State of U.P.",
      "citation": "(2003) 8 SCC 4",
      "treatment": "followed",
      "relevance": "Limited jurisdiction under Section 30."
    }
  ],
  "statutes_cited": [
    {
      "name": "Arbitration Act, 1940",
      "sections": [
        "Section 30"
      ],
      "relevance": "Grounds for setting aside award limited to arbitrator misconduct, invalid proceedings, improperly procured award; no interference with discretionary orders like adjournment."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 136"
      ],
      "relevance": "Special leave petition jurisdiction invoked by respondent."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeals allowed; common judgment of Appellate Bench and Single Judge of Bombay High Court set aside; arbitration awards restored as High Court exceeded scope of Section 30 by interfering with arbitrators' discretionary refusal of adjournment.",
    "relief_granted": "Awards of arbitrators upheld",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"An award shall not be set aside except on one or more of the following grounds, namely (a) that an arbitrator or umpire has misconducted himself or the proceedings...\"",
      "speaker": "court",
      "significance": "Defines limited grounds under Section 30 Arbitration Act, 1940."
    },
    {
      "text": "\"The civil court has very limited jurisdiction to interfere with an award made by the arbitrators and it certainly does not permit the civil court including the High Court to interfere with the discretionary order of granting or refusing an adjournment.\"",
      "speaker": "court",
      "significance": "Core holding on scope of interference."
    },
    {
      "text": "\"Reappraisal of evidence by the court is not permissible and as a matter of fact exercise of power by the court to reappraise the evidence is unknown to proceedings under Section 30.\"",
      "speaker": "court",
      "significance": "Limits judicial review from Arosan Enterprises."
    },
    {
      "text": "\"Neither the respondent nor his Advocate is present... It seems that they do not wish to lead any evidence in the matter. The case is closed.\"",
      "speaker": "court",
      "significance": "Arbitrators' reasoned order closing evidence."
    }
  ],
  "_case_id": "2004_764",
  "_label": 1,
  "_text_length": 12923,
  "_extracted_at": "2026-02-10T19:13:41.297435"
}