{
  "metadata": {
    "case_name": "Granddaughter of Hirday Ram v. Respondents",
    "case_year": 2005,
    "court": "Supreme Court of India",
    "judges": [
      "Santosh Hegde, J."
    ],
    "case_number": null,
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Hirday Ram was the owner of the suit property with three wives: Kubja (pre-deceased, leaving daughter Tikami), Pari, and Uttamdassi.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Hirday Ram made a Will dated 1.10.1938 bequeathing part of property to Tikami and remaining to Pari and Uttamdassi for maintenance, without power to alienate; property to revert to Tikami after their death.",
      "type": "material",
      "date": "1938-10-01",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Hirday Ram and second wife Pari died in 1939; property vested with Uttamdassi per Will.",
      "type": "material",
      "date": "1939",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Hindu Succession Act, 1956 came into force.",
      "type": "procedural",
      "date": "1956",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Uttamdassi sold part of property to Sandup (predecessor-in-interest of respondents 1 and 2) on 28.11.1958; Sandup mortgaged it back to Uttamdassi.",
      "type": "material",
      "date": "1958-11-28",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Uttamdassi gifted another property to respondent No.3 on 2.12.1958; respondent No.3 sold it to respondent No.4.",
      "type": "material",
      "date": "1958-12-02",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Appellant (daughter of Tikami, granddaughter of Hirday Ram) filed suit challenging alienations by Uttamdassi; trial court decreed on 12.7.1961 declaring alienations not binding on reversionary rights; appeal dismissed 25.1.1963, final.",
      "type": "procedural",
      "date": "1961-07-12",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Uttamdassi gifted property sold to Sandup to respondent No.5 on 24.5.1975.",
      "type": "material",
      "date": "1975-05-24",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Appellant filed second suit challenging 1975 gift; trial court dismissed, first appellate court accepted, held gift void ab initio, declaration alienations not binding on reversionary rights; decree final.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Uttamdassi made Will gifting part of property to respondent No.5 on 27.12.1986; died on 1.1.1987.",
      "type": "material",
      "date": "1986-12-27",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "After Uttamdassi's death, appellant filed suit for possession as nearest reversioner based on two declaratory decrees; trial court dismissed on 22.8.1989 relying on V. Tulasamma (1977 3 SCC 99) and Section 14(1) HSA making Uttamdassi absolute owner.",
      "type": "procedural",
      "date": "1989-08-22",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "First appellate court dismissed appeal on 30.9.1991 holding declaratory decrees not res judicata as filed as presumptive reversioner, present suit as owner.",
      "type": "procedural",
      "date": "1991-09-30",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "High Court dismissed second appeal holding Section 14 interpretation pure question of law; earlier decrees based on Mst. Karmi (AIR 1971 SC 745) superseded by V. Tulasamma; declaratory decrees erroneous, not res judicata.",
      "type": "procedural",
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Division Bench referred appeals to larger bench on 27.10.2004 due to contradictory views in Teg Singh, Kesar Singh, Balwant Singh.",
      "type": "procedural",
      "date": "2004-10-27",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the earlier declaratory decrees obtained by the appellant declaring alienations not binding on her reversionary rights operate as res judicata in a subsequent suit for possession, given the interpretation of Section 14 of Hindu Succession Act in V. Tulasamma making Uttamdassi absolute owner.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Two declaratory decrees final, entitled to fruits thereof; declaration of law in V. Tulasamma not retrospective, so earlier final judgments valid despite subsequent change in law; res judicata prevents respondents from contending against reversionary rights under Will.",
      "supporting_facts": [
        "f7",
        "f9"
      ],
      "legal_basis": "Teg Singh (1977 2 SCC 732)"
    },
    {
      "id": "pa2",
      "text": "First declaratory decree based on law as it stood then (pre-Tulasamma), final, protected even if Tulasamma prospective.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "Managing Director, ECIL (1993 4 SCC 727)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Declaratory decrees do not operate as res judicata; based on superseded law (Karmi); contrary to V. Tulasamma where Section 14(1) enlarged Uttamdassi's limited estate to absolute ownership, allowing alienation.",
      "supporting_facts": [
        "f4",
        "f11",
        "f12",
        "f13"
      ],
      "legal_basis": "V. Tulasamma (1977 3 SCC 99), Section 14 HSA"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Teg Singh and Kesar Singh under Punjab Custom Act, not applicable here; Balwant Singh similar facts, suit for possession not maintainable on declaratory decree alone post-HSA enlargement under Section 14(1).",
      "addresses_issue": "i1",
      "key_observation": "Uttamdassi became absolute owner under Section 14(1); declaratory rights under Will not basis for possession without better title."
    },
    {
      "id": "cr2",
      "text": "Res judicata exceptions apply: earlier decrees contrary to existing law (Tulasamma), pure question of law; cannot preclude challenge.",
      "addresses_issue": "i1",
      "key_observation": "Where law altered since earlier decision, or pure question of law/jurisdiction, res judicata does not apply (Mathura Prasad)."
    },
    {
      "id": "cr3",
      "text": "Declaratory decree simpliciter does not attain finality for possession suit; defendant can challenge if unlawful or contrary to prevailing law.",
      "addresses_issue": "i1",
      "key_observation": "Tulasamma prospective but second decree post-Tulasamma, contrary to it; first decree also challengeable in possession suit."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Earlier declaratory decrees do not operate as res judicata in suit for possession as they are contrary to law declared in V. Tulasamma under Section 14(1) HSA enlarging estate to absolute; res judicata not attracted to pure questions of law or jurisdictional errors.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Suit for possession not maintainable solely on basis of declaratory decree without establishing better title independent thereof.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Teg Singh vs. Charan Singh",
      "citation": "1977 2 SCC 732",
      "treatment": "distinguished",
      "relevance": "Declaratory decree operative under special Punjab Custom Act; not applicable here."
    },
    {
      "case_name": "Kesar Singh vs. Sadhu",
      "citation": "1996 7 SCC 711",
      "treatment": "distinguished",
      "relevance": "Suit for possession not maintainable post-vendor death under Punjab Custom Act; not applicable."
    },
    {
      "case_name": "Balwant Singh vs. Daulat Singh",
      "citation": "1997 7 SCC 137",
      "treatment": "followed",
      "relevance": "Suit for possession not maintainable on declaratory decree; widow's estate enlarged under HSA Section 14(1)."
    },
    {
      "case_name": "V. Tulasamma vs. V. Sesha Reddy",
      "citation": "1977 3 SCC 99",
      "treatment": "followed",
      "relevance": "Section 14(1) HSA enlarges limited estate to absolute ownership."
    },
    {
      "case_name": "Mst. Karmi vs. Amru Ors.",
      "citation": "AIR 1971 SC 745",
      "treatment": "distinguished",
      "relevance": "Superseded by Tulasamma on Section 14 interpretation."
    },
    {
      "case_name": "Mathura Prasad Bajoo Jaiswal Ors. vs. Dossibai B. Jeejeebhoy",
      "citation": "1970 1 SCC 613",
      "treatment": "followed",
      "relevance": "Res judicata not apply if law altered or pure question of law/jurisdiction."
    },
    {
      "case_name": "Chief Justice of Andhra Pradesh Ors. vs. V.A. Dixitulu Ors.",
      "citation": "1979 2 SCC 34",
      "treatment": "followed",
      "relevance": "Pure question of law/jurisdiction not barred by res judicata."
    },
    {
      "case_name": "Ashok Leyland Ltd. vs. State of T.N. Anr.",
      "citation": "2004 3 SCC 1",
      "treatment": "followed",
      "relevance": "Jurisdictional error or nullity not protected by res judicata."
    },
    {
      "case_name": "Management of M/s. Sonepat Cooperative Sugar Mills Ltd. vs. Ajit Singh",
      "citation": "2005 2 Scale 151",
      "treatment": "followed",
      "relevance": "Principle of res judicata procedural; not apply to jurisdictional questions or bad law."
    },
    {
      "case_name": "Managing Director, ECIL, Hyderabad Ors. vs. B. Karunakar Ors.",
      "citation": "1993 4 SCC 727",
      "treatment": "distinguished",
      "relevance": "Tulasamma prospective, but declaratory decree not final for possession if unlawful."
    }
  ],
  "statutes_cited": [
    {
      "name": "Hindu Succession Act, 1956",
      "sections": [
        "Section 14(1)"
      ],
      "relevance": "Enlarged Uttamdassi's limited estate under Will to absolute ownership, validating alienations."
    },
    {
      "name": "Code of Civil Procedure, 1908",
      "sections": [
        "Section 11"
      ],
      "relevance": "Res judicata principle; exceptions for pure questions of law, jurisdictional errors, or contrary to prevailing law."
    },
    {
      "name": "Punjab Custom (Power to Contest) Act, 1920",
      "sections": [],
      "relevance": "Governed Teg Singh and Kesar Singh; not applicable here."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court dismissed the appeal, upholding the High Court; held that the earlier declaratory decrees do not operate as res judicata in the suit for possession due to being contrary to the law declared in V. Tulasamma under Section 14(1) HSA, and no better title established by appellant.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"Where the law is altered since the earlier decision, the earlier decision will not operate as res judicata between the same parties.\"",
      "speaker": "court",
      "significance": "From Mathura Prasad; core exception to res judicata applied here."
    },
    {
      "text": "\"A declaratory decree simpliciter does not attain finality if it has to be used for obtaining any future decree like possession.\"",
      "speaker": "court",
      "significance": "Explains why possession suit allows challenge to prior declaratory decree."
    },
    {
      "text": "\"The principle of res judicata is a procedural provision. A jurisdictional question if wrongly decided would not attract the principle of res judicata.\"",
      "speaker": "court",
      "significance": "From Ashok Leyland/Sonepat; reinforces non-applicability to pure law/jurisdiction."
    }
  ],
  "_case_id": "2005_208",
  "_label": 0,
  "_text_length": 19252,
  "_extracted_at": "2026-02-10T19:13:47.977488"
}