{
  "metadata": {
    "case_name": null,
    "case_year": null,
    "court": "Supreme Court of India",
    "judges": [
      "SANTOSH HEGDE, J."
    ],
    "case_number": null,
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Hirday Ram was the owner of the suit property. He had three wives: Kubja, Pari and Uttamdassi. Kubja pre-deceased Hirday Ram leaving behind a daughter named Tikami.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "During his lifetime, Hirday Ram made a Will dated 1.10.1938 whereby he bequeathed a part of his property to his daughter Tikami and the remaining property was given to his two other wives, Pari and Uttamdassi, for their maintenance with the condition that they would not have the power to alienate the same in any manner. As per the Will, after the death of the above two wives, the property was to revert back to his daughter Tikami as absolute owner.",
      "type": "material",
      "date": "1938-10-01",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "After the death of Hirday Ram and his second wife Pari in 1939, the property in question came to be vested with the third wife, Uttamdassi as per the terms of the Will.",
      "type": "material",
      "date": "1939",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "After coming into force of the Hindu Succession Act, 1956, Uttamdassi claiming to be the absolute owner sold a part of the property to one Sandup on 28.11.1958, predecessor-in-interest of respondent Nos.1 and 2 herein.",
      "type": "material",
      "date": "1958-11-28",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The said Sandup mortgaged back the property to Uttamdassi.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Uttamdassi on 2.12.1958 made a gift of another property in favour of respondent No.3 herein who in turn sold it to respondent No.4.",
      "type": "material",
      "date": "1958-12-02",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "The appellant herein is a daughter of Tikami and granddaughter of Hirday Ram.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Appellant filed a suit challenging the alienation made by Uttamdassi seeking a decree for declaration that the alienation made by Uttamdassi would not affect her reversionary rights. The suit was decreed by the trial court on 12.7.1961.",
      "type": "procedural",
      "date": "1961-07-12",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Appeal filed by Uttamdassi was dismissed on 25.1.1963. Thus the said declaratory decree became final as it was not put to challenge in further appeal in the High Court.",
      "type": "procedural",
      "date": "1963-01-25",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "On 24.5.1975 Uttamdassi gifted the property sold by her to Sandup in 1958 in favour of respondent No.5.",
      "type": "material",
      "date": "1975-05-24",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Appellant filed a suit challenging the said alienation also and seeking a declaration that the said alienation made by Uttamdassi would not affect her reversionary rights. The trial court dismissed the suit but an appeal preferred by the appellant was accepted by the First Appellate Court and the gift made by Uttamdassi in favour of respondent No.5 was held to be void ab initio and a declaration was given that the alienation made by Uttamdassi would not affect reversionary rights of the plaintiff. This decree also became final as the same was not put to any further challenge.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Uttamdassi had gifted a part of the property in favour of respondent No.5 by way of a Will on 27.12.1986. She died on 1.1.1987.",
      "type": "material",
      "date": "1986-12-27",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "After the death of Uttamdassi, appellant brought a suit for possession of the suit property being the nearest reversioner and on the basis of the two earlier declaratory decrees obtained by her. The trial court dismissed the suit on 22.8.1989.",
      "type": "procedural",
      "date": "1989-08-22",
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Trial court relied upon V.Tulasamma vs. V.Sesha Reddy (1977) 3 SCC 99 holding that though the suit property was given to the wives of Hirday Ram as limited owners but in view of Section 14(1) of the Hindu Succession Act, 1956 Uttamdassi became the absolute owner of the suit property and had the right to alienate the same by way of sale, gift or will.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f15",
      "text": "Appeal filed by the appellant was dismissed on 30.9.1991 by the First Appellate Court holding inter alia that the declaratory decrees obtained by the appellant did not operate as res judicata inter se parties as the same were passed in suits filed by the appellant as presumptive reversioner of the widow of Hirday Ram and the present suit was filed after her death for possession as owner.",
      "type": "procedural",
      "date": "1991-09-30",
      "source": "lower_court"
    },
    {
      "id": "f16",
      "text": "Appellant preferred a regular second appeal which has been dismissed by the impugned judgment of the High Court holding inter alia that interpretation of Section 14 of the Hindu Succession Act, 1956 was a pure question of law and the earlier decrees obtained on the interpretation of law in the case of Mst. Karmi vs. Amru Ors. AIR 1971 SC 745 cannot operate as res judicata in the face of the contrary interpretation put to Section 14 in the later decision of this Court in V.Tulasamma case supra.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f17",
      "text": "Noticing certain contradictory views in three different judgments of this Court in Teg Singh vs. Charan Singh (1977) 2 SCC 732, Kesar Singh vs. Sadhu (1996) 7 SCC 711 and Balwant Singh vs. Daulat Singh (1997) 7 SCC 137, a Division Bench of 2-Judges of this Court referred the instant appeals for disposal by a larger bench by its referral order dated 27th October, 2004.",
      "type": "procedural",
      "date": "2004-10-27",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the finding of the High Court that the earlier decree obtained by the appellant being declaratory in nature would not operate as res judicata in favour of the appellant and would not enable her to obtain possession through the court of law by filing a suit for possession, is correct in law or not?",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The two declaratory decrees obtained by the appellant declaring her right as a reversioner to the property in question having become final, she is entitled to the fruits of the said decree.",
      "supporting_facts": [
        "f8",
        "f9",
        "f11"
      ],
      "legal_basis": "Principles of res judicata"
    },
    {
      "id": "pa2",
      "text": "The declaration of law made by this Court in V.Tulasamma case not being retrospective the judgments obtained by the appellant even if it is contrary to the said judgment in Tulasamma case the same having become final cannot be held to be invalid in law, merely because by a subsequent judgment law stood changed.",
      "supporting_facts": [
        "f8",
        "f9",
        "f11"
      ],
      "legal_basis": "V.Tulasamma vs. V.Sesha Reddy (1977) 3 SCC 99; Teg Singh vs. Charan Singh (1977) 2 SCC 732"
    },
    {
      "id": "pa3",
      "text": "In such cases, the parties opposing the said judgment would be prevented by the principles of res judicata from contending that the appellant has no right to claim the property as the reversioner by virtue of the terms of the Will under which the property in question was bequeathed by Uttamdassi, predecessor-in-interest of the respondents herein.",
      "supporting_facts": [
        "f2",
        "f8",
        "f9",
        "f11"
      ],
      "legal_basis": "Section 11 CPC (res judicata)"
    },
    {
      "id": "pa4",
      "text": "The judgment in Tulasamma case being prospective the first declaratory decree obtained by her would prevail since that was based on the law as it stood then and had become final, therefore, the first declaratory decree would be protected.",
      "supporting_facts": [
        "f8",
        "f9"
      ],
      "legal_basis": "Managing Director, ECIL, Hyderabad vs. B.Karunakar (1993) 4 SCC 727"
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The law laid down in Teg Singh and Kesar Singh cases do not apply as they are governed by Punjab Custom (Power to Contest) Act, 1920, which does not apply here.",
      "addresses_issue": "i1",
      "key_observation": "Provisions of law in those cases have nothing in common with the present appeal."
    },
    {
      "id": "cr2",
      "text": "Balwant Singh case holds that suit for possession would not be maintainable on the basis of a declaratory decree as the declaratory decree did not convey any title in favour of the reversioners.",
      "addresses_issue": "i1",
      "key_observation": "Facts similar: widow continued in possession post-declaratory decree due to enlarged rights under HSA Sec 14(1), subsequent alienations valid."
    },
    {
      "id": "cr3",
      "text": "Ordinarily res judicata argument accepted but exception where earlier declaration contrary to existing law.",
      "addresses_issue": "i1",
      "key_observation": "Where the law is altered since the earlier decision, the earlier decision will not operate as res judicata (Mathura Prasad Bajoo Jaiswal vs. Dossibai N.B. Jeejeebhoy (1970) 1 SCC 613)."
    },
    {
      "id": "cr4",
      "text": "First declaratory decree when obtained, law gave Uttamdassi limited right; second after Tulasamma declared enlargement under Sec 14 HSA.",
      "addresses_issue": "i1",
      "key_observation": "Second decree contrary to Supreme Court declaration in Tulasamma."
    },
    {
      "id": "cr5",
      "text": "Question purely of law relating to jurisdiction or sanctioning illegal thing, res judicata does not preclude challenge (Mathura Prasad).",
      "addresses_issue": "i1",
      "key_observation": "Declaratory decrees contrary to Tulasamma can be challenged."
    },
    {
      "id": "cr6",
      "text": "Pure question of law depending on interpretation, if contrary renders lack of jurisdiction, no res judicata (Chief Justice of A.P. vs. L.V.A. Dixitulu; Ashok Leyland; Sonepat Cooperative).",
      "addresses_issue": "i1",
      "key_observation": "Earlier judgment contrary to existing law or without jurisdiction not res judicata."
    },
    {
      "id": "cr7",
      "text": "Tulasamma prospective, but declaratory decree simpliciter does not attain finality if used for future possession; defendant can challenge if unlawful.",
      "addresses_issue": "i1",
      "key_observation": "Suit for possession based on illegal declaration not maintainable without better title."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Earlier declaratory decrees obtained by the appellant being contrary to the judgment in V.Tulasamma case would not be of any assistance to the appellant to obtain the possession of the suit property.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "If a suit is based on an earlier decree and such decree is contrary to the law prevailing at the time of its consideration as to its legality or is a decree granted by a court which has no jurisdiction to grant such decree, principles of res judicata under Section 11 of the CPC will not be attracted.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Teg Singh vs. Charan Singh",
      "citation": "1977 2 SCC 732",
      "treatment": "distinguished",
      "relevance": "Declaratory decree under Punjab Custom Act protected, but does not apply here."
    },
    {
      "case_name": "Kesar Singh vs. Sadhu",
      "citation": "1996 7 SCC 711",
      "treatment": "distinguished",
      "relevance": "Suit for possession not maintainable post-death based on old declaratory decree under Punjab Custom Act; does not apply here."
    },
    {
      "case_name": "Balwant Singh vs. Daulat Singh",
      "citation": "1997 7 SCC 137",
      "treatment": "followed",
      "relevance": "Suit for possession not maintainable on declaratory decree; widow's rights enlarged under HSA Sec 14(1), subsequent gifts valid."
    },
    {
      "case_name": "V.Tulasamma vs. V.Sesha Reddy",
      "citation": "1977 3 SCC 99",
      "treatment": "followed",
      "relevance": "Limited estate under Will enlarged to absolute under Sec 14(1) HSA; right to alienate."
    },
    {
      "case_name": "Mst. Karmi vs. Amru Ors.",
      "citation": "AIR 1971 SC 745",
      "treatment": "distinguished",
      "relevance": "Earlier interpretation of Sec 14 HSA superseded by Tulasamma."
    },
    {
      "case_name": "Mathura Prasad Bajoo Jaiswal Ors. vs. Dossibai B.Jeejeebhoy",
      "citation": "1970 1 SCC 613",
      "treatment": "followed",
      "relevance": "Earlier decision not res judicata if law altered; pure question of law or jurisdictional error not barred."
    },
    {
      "case_name": "Chief Justice of Andhra Pradesh Ors. vs. V.A.Dixitulu Ors.",
      "citation": "1979 2 SCC 34",
      "treatment": "followed",
      "relevance": "Pure question of law or lack of jurisdiction not sustained by res judicata."
    },
    {
      "case_name": "Ashok Leyland Ltd. vs. State of T.N. Anr.",
      "citation": "2004 3 SCC 1",
      "treatment": "followed",
      "relevance": "Jurisdictional question wrongly decided not attracts res judicata; nullity not supported by procedural principles."
    },
    {
      "case_name": "Management of M/s. Sonepat Cooperative Sugar Mills Ltd. vs. Ajit Singh",
      "citation": "2005 2 Scale 151",
      "treatment": "followed",
      "relevance": "Principle of res judicata procedural; jurisdictional question or contrary to law not barred."
    },
    {
      "case_name": "Managing Director, ECIL, Hyderabad Ors. vs. B.Karunakar Ors.",
      "citation": "1993 4 SCC 727",
      "treatment": "distinguished",
      "relevance": "Tulasamma prospective but declaratory decree not final for possession if unlawful."
    }
  ],
  "statutes_cited": [
    {
      "name": "Hindu Succession Act, 1956",
      "sections": [
        "Section 14(1)"
      ],
      "relevance": "Enlarged limited estate under Will to absolute ownership for Uttamdassi, enabling alienation by sale, gift or will."
    },
    {
      "name": "Code of Civil Procedure, 1908",
      "sections": [
        "Section 11"
      ],
      "relevance": "Principle of res judicata does not apply to decrees contrary to law or on pure questions of law/jurisdiction."
    },
    {
      "name": "Punjab Custom (Power to Contest) Act, 1920",
      "sections": [],
      "relevance": "Protected declaratory decrees in Teg Singh and Kesar Singh cases, but inapplicable here."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal is dismissed. The earlier declaratory decrees do not operate as res judicata due to being contrary to the law declared in V. Tulasamma case regarding enlargement of estate under Section 14(1) HSA. Suit for possession not maintainable without better title independent of such decrees.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"Where the law is altered since the earlier decision, the earlier decision will not operate as res judicata between the same parties.\"",
      "speaker": "court",
      "significance": "Exception to res judicata from Mathura Prasad case, applied here."
    },
    {
      "text": "\"Where, however, the question is one purely of law and it relates to the jurisdiction of the court or a decision of the court sanctioning something which is illegal, by resort to the rule of res judicata a party affected by the decision will not be precluded from challenging the validity of that order.\"",
      "speaker": "court",
      "significance": "Further exception allowing challenge to illegal declaratory decrees."
    },
    {
      "text": "\"A jurisdictional question if wrongly decided would not attract the principle of res judicata. When an order is passed without jurisdiction, the same becomes a nullity.\"",
      "speaker": "court",
      "significance": "From Ashok Leyland, reinforcing no res judicata for pure law/jurisdiction errors."
    }
  ],
  "_case_id": "2005_208",
  "_label": 0,
  "_text_length": 19252,
  "_extracted_at": "2026-02-08T22:09:09.587239"
}