{
  "metadata": {
    "case_name": "Tenant-Appellant v. Landlord-Respondent",
    "case_year": 2002,
    "court": "Supreme Court of India",
    "judges": [],
    "case_number": "Civil Appeal Nos. 85-86 of 2002",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "A suit was filed by the landlord-respondent for eviction of the tenant-appellant from the premises bearing Door No. 188 Old No. 112 at Jawaharlal Nehru Street, Pondicherry on the ground that the premises is very old and in a dilapidated condition requiring demolition and that he has taken steps to get permission and approval from the competent authority for demolition and reconstruction.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Landlord filed another suit on the ground that the tenant-appellant had ceased to occupy the demised premises under Section 10(2)(vi) of the Pondicherry Buildings Lease and Rent Control Act, 1969.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The Trial Court decreed both the suits filed by the landlord-respondent and granted decree of eviction against the tenant-appellant.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f4",
      "text": "Aggrieved against both the judgments and decrees of the Trial Court, the appellant preferred two separate appeals before the Appellate Authority.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The Appellate Authority reversed both the judgments and decrees passed by the Trial Court.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "Aggrieved against the orders passed by the First Appellate Court, the landlord-respondent preferred two revision petitions (R.P Nos. 1280/1998 and 1281/1998) before the High Court of Madras.",
      "type": "procedural",
      "date": "2000-11-13",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Learned Single Judge of the High Court of Madras reversed the orders passed by the Appellate Authority and maintained the judgment and decree of the Trial Court.",
      "type": "procedural",
      "date": "2000-11-13",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "The High Court found that the building is about 60 years old and it has developed cracks in it.",
      "type": "disputed",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the High Court in exercise of revisional jurisdiction under Section 25 of the Pondicherry Buildings Lease and Rent Control Act, 1969 could interfere with the finding of fact recorded by the Appellate Authority.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Under Section 25 of the Act a revision petition is maintainable before the High Court and in revision the High Court could not have reversed the finding of fact recorded by the First Appellate Court.",
      "supporting_facts": [
        "f5",
        "f7"
      ],
      "legal_basis": "Section 25 of the Pondicherry Buildings Lease and Rent Control Act, 1969; M. Punnoose Vs. K.M. Munneruddin and Others, 2003 10 SCC 610"
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Section 25 of the Act is almost pari materia with Section 25 of the Tamil Nadu Lease and Rent Control Act, 1960. The revisional jurisdiction conferred upon the High Court is not as narrow as under Section 115 CPC. A finding of fact by Appellate Authority cannot be lightly interfered with, but the scope of Section 25 is very wide as High Court can examine the record for regularity, correctness, legality or propriety of any decision and modify, annul, reverse or remit.",
      "addresses_issue": "i1",
      "key_observation": "The expression in Section 25 has wide import and High Court has power to examine facts also."
    },
    {
      "id": "cr2",
      "text": "High Court found building 60 years old with cracks and rightly interfered with finding of fact by Appellate Authority and affirmed Trial Court's decree of eviction.",
      "addresses_issue": "i1",
      "key_observation": "High Court approach is correct under wide scope of Section 25."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "High Court rightly interfered under Section 25 with finding of fact by Appellate Authority; appeals fail and are dismissed.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "M. Punnoose Vs. K.M. Munneruddin and Others",
      "citation": "2003 10 SCC 610",
      "treatment": "followed",
      "relevance": "Held that revisional jurisdiction under analogous provision not as narrow as S.115 CPC but fact findings not lightly interfered with; applied to affirm wide scope allows fact examination here."
    }
  ],
  "statutes_cited": [
    {
      "name": "Pondicherry Buildings Lease and Rent Control Act, 1969",
      "sections": [
        "Section 10(2)(vi)",
        "Section 25"
      ],
      "relevance": "Grounds for eviction (ceased occupation and dilapidated condition); wide revisional jurisdiction of High Court exercised to interfere with fact findings."
    },
    {
      "name": "Tamil Nadu Lease and Rent Control Act, 1960",
      "sections": [
        "Section 25"
      ],
      "relevance": "Pari materia with Pondicherry Act S.25; considered for scope of revisional jurisdiction."
    },
    {
      "name": "Code of Civil Procedure, 1908",
      "sections": [
        "Section 115"
      ],
      "relevance": "Revisional jurisdiction narrower than under Pondicherry Act S.25."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeals by special leave against High Court order dated 13.11.2000 are dismissed, upholding the eviction decree of Trial Court as High Court rightly interfered under Section 25 with Appellate Authority's findings. No need to examine other ground under Section 10(2)(vi).",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"It is true that the revisional jurisdiction conferred upon the High Court is not as narrow as one under Section 115 of the Code of Civil Procedure nevertheless a finding of fact arrived at by the Appellate Authority cannot be lightly interfered with by the High Court acting like a court of appeal and reappreciating the evidence.\"",
      "speaker": "court",
      "significance": "Quote from P.M. Punnoose case distinguishing narrow CPC revision from wide Act revision."
    },
    {
      "text": "The scope of Section 25 of the Act is very wide as the High Court can under this provision examine the record of the appellate authority as to the regularity of such proceeding or the correctness, legality or propriety of any decision or order passed therein and can modify, annul, reverse or remit for reconsideration.",
      "speaker": "court",
      "significance": "Defines wide scope of High Court's revisional power including facts."
    }
  ],
  "_case_id": "2008_368",
  "_label": 0,
  "_text_length": 5622,
  "_extracted_at": "2026-02-08T22:08:43.953839"
}