{
  "metadata": {
    "case_name": "Tenant-Appellant v. Landlord-Respondent",
    "case_year": 2002,
    "court": "Supreme Court of India",
    "judges": [],
    "case_number": "CIVIL APPEAL NOS. 85-86 OF 2002",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Suit filed by landlord-respondent for eviction of tenant-appellant from premises bearing Door No. 188 Old No. 112 at Jawaharlal Nehru Street, Pondicherry on ground that premises is very old and in dilapidated condition requiring demolition and reconstruction, and landlord has taken steps to get permission and approval from competent authority.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Another suit filed by landlord-respondent for eviction on ground that tenant-appellant had ceased to occupy the demised premises under Section 10(2)(vi) of the Pondicherry Buildings Lease and Rent Control Act, 1969.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Trial Court decreed both suits filed by landlord-respondent and granted decree of eviction against tenant-appellant.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Tenant-appellant preferred two separate appeals before the Appellate Authority, which reversed both judgments and decrees passed by the Trial Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Landlord-respondent preferred two revision petitions (R.P Nos. 1280/1998 and 1281/1998) before the High Court of Madras.",
      "type": "procedural",
      "date": "13.11.2000",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Learned Single Judge of High Court of Madras reversed orders passed by Appellate Authority and maintained judgment and decree of Trial Court.",
      "type": "procedural",
      "date": "13.11.2000",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Tenant-appellant filed present appeals by special leave before Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Building is about 60 years old and has developed cracks in it.",
      "type": "disputed",
      "date": null,
      "source": "high_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Scope of revisional jurisdiction of High Court under Section 25 of the Pondicherry Buildings Lease and Rent Control Act, 1969, particularly whether High Court can interfere with findings of fact recorded by the Appellate Authority.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether decree of eviction can be granted on ground that tenant ceased to occupy premises under Section 10(2)(vi) of the Act.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Under Section 25 of the Act, a revision petition is maintainable before the High Court and in revision the High Court could not have reversed the finding of fact recorded by the First Appellate Court.",
      "supporting_facts": [
        "f4",
        "f5",
        "f6"
      ],
      "legal_basis": "Section 25 of Pondicherry Buildings Lease and Rent Control Act, 1969; M. Punnoose Vs. K.M. Munneruddin and Others (2003) 10 SCC 610"
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Section 25 of the Act is almost pari materia with Section 25 of the Tamil Nadu Lease and Rent Control Act, 1960. Revisional jurisdiction under Section 25 is not as narrow as under Section 115 CPC; High Court can examine record of appellate authority to satisfy itself as to regularity of proceedings or correctness, legality or propriety of any decision or order, and can modify, annul, reverse or remit for reconsideration.",
      "addresses_issue": "i1",
      "key_observation": "Scope of Section 25 is very wide, allowing High Court to examine correctness, legality or propriety including facts."
    },
    {
      "id": "cr2",
      "text": "High Court found building about 60 years old with cracks, rightly interfered with finding of fact by Appellate Authority and affirmed Trial Court's decree of eviction.",
      "addresses_issue": "i1",
      "key_observation": "High Court exercised power under Section 25 correctly."
    },
    {
      "id": "cr3",
      "text": "No useful purpose served by examining issue under Section 10(2)(vi) since upholding on ground of Section 25.",
      "addresses_issue": "i2",
      "key_observation": "Issue not gone into as appeals dismissed on other ground."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "High Court under Section 25 of the Act has wide power to interfere with findings of fact of Appellate Authority if incorrect, illegal or improper.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "High Court rightly interfered and affirmed Trial Court's eviction decree.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "M. Punnoose Vs. K.M. Munneruddin and Others",
      "citation": "(2003) 10 SCC 610",
      "treatment": "followed",
      "relevance": "Held that revisional jurisdiction under analogous Section 25 of Tamil Nadu Act not as narrow as Section 115 CPC, but findings of fact not to be lightly interfered; however, wide scope allows examination of facts for correctness, legality or propriety."
    }
  ],
  "statutes_cited": [
    {
      "name": "Pondicherry Buildings Lease and Rent Control Act, 1969",
      "sections": [
        "Section 10(2)(vi)",
        "Section 25"
      ],
      "relevance": "Grounds for eviction (cessation of occupation and dilapidated condition); wide revisional jurisdiction of High Court allowing interference with factual findings."
    },
    {
      "name": "Tamil Nadu Lease and Rent Control Act, 1960",
      "sections": [
        "Section 25"
      ],
      "relevance": "Pari materia with Section 25 of Pondicherry Act; scope of revisional jurisdiction interpreted."
    },
    {
      "name": "Code of Civil Procedure, 1908",
      "sections": [
        "Section 115"
      ],
      "relevance": "Revisional jurisdiction narrower than under Section 25 of the Act."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court dismissed the appeals filed by the tenant-appellant, upheld the High Court's judgment reversing the Appellate Authority and restoring the Trial Court's eviction decrees against the tenant.",
    "relief_granted": "Eviction decree in favor of landlord-respondent upheld.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"It is true that the revisional jurisdiction conferred upon the High Court is not as narrow as one under Section 115 of the Code of Civil Procedure nevertheless a finding of fact arrived at by the Appellate Authority cannot be lightly interfered with by the High Court acting like a court of appeal and reappreciating the evidence.\"",
      "speaker": "court",
      "significance": "Quote from P.M. Punnoose case explaining limits but affirming wide scope of Section 25."
    },
    {
      "text": "\"The scope of Section 25 of the Act is very wide as the High Court can under this provision examine the record of the appellate authority as to the regularity of such proceeding or the correctness, legality or propriety of any decision or order passed therein and can modify, annul, reverse or remit for reconsideration.\"",
      "speaker": "court",
      "significance": "Defines wide import of revisional power under Section 25, justifying High Court's interference."
    }
  ],
  "_case_id": "2008_368",
  "_label": 0,
  "_text_length": 5622,
  "_extracted_at": "2026-02-10T19:13:39.787630"
}