{
  "metadata": {
    "case_name": "Appellant v. D. Patchaiammal",
    "case_year": 2010,
    "court": "Supreme Court of India",
    "judges": [
      "Markandey Katju, J."
    ],
    "case_number": null,
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant married Lakshmi according to Hindu Customary Rites on 25.6.1980. Out of wedlock, a male child born, now studying in Engineering college at Ooty.",
      "type": "admitted",
      "date": "1980-06-25",
      "source": "petitioner"
    },
    {
      "id": "f2",
      "text": "Appellant working as Secondary Grade Teacher in Thevanga Higher Secondary School, Coimbatore, drawing salary of Rs.10,000/- per month.",
      "type": "background",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "Respondent filed petition under Section 125 Cr.P.C. in 2001 before Family Court, Coimbatore, alleging marriage to appellant on 14.9.1986, lived together in her father's house for 2-3 years, then appellant left but visited occasionally, deserted her, she has no livelihood, prays Rs.500/- per month maintenance.",
      "type": "disputed",
      "date": "2001",
      "source": "respondent"
    },
    {
      "id": "f4",
      "text": "Respondent alleged appellant deserted her 2-3 years after 1986 marriage, i.e., 1988 or 1989.",
      "type": "disputed",
      "date": "1988 or 1989",
      "source": "respondent"
    },
    {
      "id": "f5",
      "text": "Delay of about 12 years in filing Section 125 petition in 2001 after alleged desertion in 1988-89.",
      "type": "procedural",
      "date": "2001",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Appellant filed counter affidavit before Family Court alleging marriage to Lakshmi on 25.6.1980 per Hindu rites, produced ration card, voters identity card of wife, transfer certificate of son, discharge certificate of wife from hospital, photographs of wedding.",
      "type": "material",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "Family Court, Coimbatore by judgment dated 5.3.2004 held appellant married to respondent and not to Lakshmi.",
      "type": "procedural",
      "date": "2004-03-05",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Madras High Court by judgment dated 12.10.2009 upheld Family Court findings.",
      "type": "procedural",
      "date": "2009-10-12",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Lakshmi not made party or issued notice in Family Court or High Court proceedings.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether courts below could hold that appellant was not married to Lakshmi and was married to respondent without issuing notice and hearing Lakshmi.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Meaning of 'relationship in the nature of marriage' under Section 2(f) of Protection of Women from Domestic Violence Act, 2005.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether respondent entitled to maintenance under Section 125 Cr.P.C. as wife, given alleged prior subsisting marriage.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Appellant married to Lakshmi on 25.6.1980 per Hindu rites, has male child; produced documentary proofs like ration card, voter ID, son's TC, hospital discharge, wedding photos.",
      "supporting_facts": [
        "f1",
        "f2",
        "f6"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Respondent's case doubtful due to 12-year delay in filing Section 125 petition after alleged desertion.",
      "supporting_facts": [
        "f4",
        "f5"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Married to appellant on 14.9.1986, lived together 2-3 years in father's house, then deserted, no livelihood, entitled to Rs.500/- maintenance.",
      "supporting_facts": [
        "f3",
        "f4"
      ],
      "legal_basis": "Section 125 Cr.P.C."
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Declaration that Lakshmi not married to appellant without notice/hearing to her is null and void, violative of natural justice; affects her rights.",
      "addresses_issue": "i1",
      "key_observation": "Without hearing Lakshmi, no valid finding she was not married to appellant."
    },
    {
      "id": "cr2",
      "text": "If Lakshmi wife of appellant, he could not validly marry respondent without divorce; second marriage void.",
      "addresses_issue": "i1",
      "key_observation": "Respondent cannot be wife unless appellant's marriage to Lakshmi disproved."
    },
    {
      "id": "cr3",
      "text": "Under Section 125 Cr.P.C., 'wife' includes divorced woman not remarried, but second wife in subsisting first marriage not legally wedded wife, not entitled to maintenance.",
      "addresses_issue": "i3",
      "key_observation": "Strict proof of earlier marriage required when husband negates claim depicting woman as kept-mistress."
    },
    {
      "id": "cr4",
      "text": "'Relationship in the nature of marriage' under DV Act 2005 akin to common law marriage: parties must hold out as spouses, legal age, qualified to marry, cohabited significantly in shared household; not mere live-in, weekends, or one-night stand; not keeper for sexual/domestic purposes.",
      "addresses_issue": "i2",
      "key_observation": "Conditions must be proved by evidence; Parliament distinguished from marriage."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Courts below erred in holding appellant not married to Lakshmi without notice/hearing her; finding set aside.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Matter remanded to Family Court to issue notice to Lakshmi, hear her, and give fresh finding on appellant's marriage to Lakshmi; question of marriage to respondent thereafter.",
      "resolves_issue": "i1",
      "in_favor_of": "partial"
    },
    {
      "id": "h3",
      "text": "'Relationship in the nature of marriage' requires holding out as spouses, cohabitation in shared household for significant time, etc.; mere live-in insufficient.",
      "resolves_issue": "i2",
      "in_favor_of": "partial"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Vimala K vs. Veeraswamy K",
      "citation": "1991 2 SCC 375",
      "treatment": "followed",
      "relevance": "Section 125 Cr.P.C. for social purpose to prevent vagrancy; strict proof of earlier marriage needed; second wife not entitled."
    },
    {
      "case_name": "Savitaben Somabhai Bhatiya vs. State of Gujarat",
      "citation": "AIR 2005 SC 1809",
      "treatment": "followed",
      "relevance": "Woman not lawfully married not 'wife' under Section 125; legislative amendment needed."
    },
    {
      "case_name": "S. Khushboo vs. Kanniammal",
      "citation": "2010 5 SCC 600",
      "treatment": "referred",
      "relevance": "Commented on live-in relationships in India."
    },
    {
      "case_name": "Marvin vs. Marvin",
      "citation": "1976 18 C3d 660",
      "treatment": "referred",
      "relevance": "First palimony case in USA."
    },
    {
      "case_name": "Taylor vs. Fields",
      "citation": "1986 224 Cal. Rptr. 186",
      "treatment": "referred",
      "relevance": "Relationship of married man and mistress not enforceable; no stable cohabitation."
    },
    {
      "case_name": "Devaney vs. L'Esperance",
      "citation": "195 N.J. 247 (2008)",
      "treatment": "referred",
      "relevance": "Cohabitation not necessary; promise to support in marital-type relationship key."
    }
  ],
  "statutes_cited": [
    {
      "name": "Code of Criminal Procedure, 1973",
      "sections": [
        "Section 125",
        "Explanation (b) to Section 125(1)"
      ],
      "relevance": "Maintenance to wife (including divorced not remarried); second wife in subsisting marriage not entitled."
    },
    {
      "name": "Protection of Women from Domestic Violence Act, 2005",
      "sections": [
        "Section 2(a)",
        "Section 2(f)",
        "Section 2(s)",
        "Section 3(a)",
        "Section 12",
        "Section 20(1)(d)",
        "Section 26(1)"
      ],
      "relevance": "Defines aggrieved person, domestic relationship (incl. in nature of marriage), shared household, domestic violence (incl. economic abuse); relief incl. maintenance."
    }
  ],
  "outcome": {
    "disposition": "remanded",
    "summary": "Supreme Court set aside findings of Family Court and High Court that appellant was married to respondent and not to Lakshmi, as Lakshmi not heard; remanded to Family Court to issue notice to Lakshmi, hear parties, and decide afresh on validity of marriage to Lakshmi and consequently to respondent.",
    "relief_granted": "Remand for fresh adjudication after hearing Lakshmi",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "Without giving a hearing to Lakshmi no such declaration could have validly be given by the Courts below that she had not married the appellant herein since such a finding would seriously affect her rights.",
      "speaker": "court",
      "significance": "Basis for setting aside lower courts' findings on natural justice."
    },
    {
      "text": "However, under the law a second wife whose marriage is void on account of the survival of the first marriage is not a legally wedded wife, and is, therefore, not entitled to maintenance under this provision.",
      "speaker": "court",
      "significance": "Clarifies entitlement under Section 125 Cr.P.C."
    },
    {
      "text": "In our opinion a relationship in the nature of marriage under the 2005 Act must also fulfill the above requirements, and in addition the parties must have lived together in a shared household as defined in Section 2(s) of the Act.",
      "speaker": "court",
      "significance": "Defines criteria for 'relationship in the nature of marriage' under DV Act."
    }
  ],
  "_case_id": "2010_721",
  "_label": 1,
  "_text_length": 18402,
  "_extracted_at": "2026-02-08T22:08:44.860921"
}