{
  "metadata": {
    "case_name": "Appellant v. D. Patchaiammal",
    "case_year": 2010,
    "court": "Supreme Court of India",
    "judges": [
      "Markandey Katju, J."
    ],
    "case_number": null,
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant married to Lakshmi according to Hindu Customary Rites on 25.6.1980. Out of wedlock, a male child born, now studying in Engineering college at Ooty.",
      "type": "admitted",
      "date": "1980-06-25",
      "source": "petitioner"
    },
    {
      "id": "f2",
      "text": "Appellant working as Secondary Grade Teacher in Thevanga Higher Secondary School, Coimbatore, drawing salary of Rs.10,000/- per month.",
      "type": "background",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "Respondent filed petition under Section 125 Cr.P.C. in 2001 before Family Court, Coimbatore, alleging marriage to appellant on 14.9.1986, lived together in her father's house for two or three years, then appellant left and started living in native place but visited occasionally, deserted her, she has no livelihood, prayed for Rs.500/- per month maintenance.",
      "type": "disputed",
      "date": "1986-09-14",
      "source": "respondent"
    },
    {
      "id": "f4",
      "text": "In petition and deposition, respondent alleged appellant left her two or three years after 1986 marriage i.e. 1988 or 1989, petition filed in 2001 after 12 years delay.",
      "type": "material",
      "date": "1988",
      "source": "respondent"
    },
    {
      "id": "f5",
      "text": "Appellant filed counter affidavit before Family Court alleging marriage to Lakshmi on 25.6.1980 per Hindu rites, male child studying in C.S.I. Engineering college Ooty; produced ration card, voters identity card of wife, transfer certificate of son, discharge certificate of wife from hospital, photographs of wedding.",
      "type": "admitted",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "Family Court by judgment dated 5.3.2004 held appellant married to respondent and not to Lakshmi.",
      "type": "procedural",
      "date": "2004-03-05",
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Madras High Court by judgment dated 12.10.2009 upheld Family Court findings.",
      "type": "procedural",
      "date": "2009-10-12",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Lakshmi not made party to proceedings before Family Court or High Court, no notice issued to her.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether appellant was married to respondent or to Lakshmi, and whether respondent entitled to maintenance under Section 125 Cr.P.C. as wife.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Meaning of expression 'a relationship in the nature of marriage' under Section 2(f) of Protection of Women from Domestic Violence Act, 2005.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Appellant married to Lakshmi on 25.6.1980 per Hindu rites, has male child; produced documentary evidence including ration card, voter ID, transfer certificate, discharge certificate, wedding photos.",
      "supporting_facts": [
        "f1",
        "f2",
        "f5"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Married to appellant on 14.9.1986, lived together 2-3 years in father's house, then deserted, no livelihood, appellant earns Rs.10,000/month, entitled to Rs.500/month maintenance.",
      "supporting_facts": [
        "f3",
        "f4"
      ],
      "legal_basis": "Section 125 Cr.P.C."
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Family Court and High Court erred in holding appellant not married to Lakshmi without making her party or issuing notice, violative of natural justice; such declaration affects her rights and is null and void.",
      "addresses_issue": "i1",
      "key_observation": "Without hearing Lakshmi, no valid declaration she was not married to appellant, hence no valid marriage to respondent possible without divorce from Lakshmi."
    },
    {
      "id": "cr2",
      "text": "Under Section 125 Cr.P.C., 'wife' includes divorced woman not remarried, but second wife whose marriage void due to subsisting first marriage not legally wedded wife, not entitled to maintenance.",
      "addresses_issue": "i1",
      "key_observation": "Strict proof required of earlier marriage when husband denies second marriage claim."
    },
    {
      "id": "cr3",
      "text": "'Relationship in the nature of marriage' under DV Act 2005 akin to common law marriage: parties must hold out as spouses, legal age, qualified to marry, cohabited significantly in shared household; not mere live-in, weekends, or kept for sexual purposes.",
      "addresses_issue": "i2",
      "key_observation": "Conditions must be proved by evidence; excludes many live-in relationships but Court cannot amend statute."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Declaration that appellant not married to Lakshmi without notice to her is null and void, violative of natural justice.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Respondent cannot be held wife unless established appellant not married to Lakshmi; divorced wife covered under Section 125 but not if never married.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h3",
      "text": "'Relationship in the nature of marriage' requires holding out as spouses, significant cohabitation in shared household, etc., akin to common law marriage.",
      "resolves_issue": "i2",
      "in_favor_of": "partial"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Vimala K vs. Veeraswamy K",
      "citation": "(1991) 2 SCC 375",
      "treatment": "followed",
      "relevance": "Strict proof of earlier marriage required when husband denies claim of neglected wife; second wife not entitled if first marriage subsists."
    },
    {
      "case_name": "Savitaben Somabhai Bhatiya vs. State of Gujarat",
      "citation": "AIR 2005 SC 1809",
      "treatment": "followed",
      "relevance": "Woman not lawfully married not within 'wife' under Section 125 Cr.P.C.; legislative amendment needed."
    },
    {
      "case_name": "S. Khushboo vs. Kanniammal",
      "citation": "(2010) 5 SCC 600",
      "treatment": "referred",
      "relevance": "Commented on live-in relationships as emerging social phenomenon."
    }
  ],
  "statutes_cited": [
    {
      "name": "Code of Criminal Procedure, 1973",
      "sections": [
        "Section 125",
        "Explanation (b) to Section 125(1)"
      ],
      "relevance": "Provides maintenance to wife including divorced not remarried; excludes second wife if first marriage subsists."
    },
    {
      "name": "Protection of Women from Domestic Violence Act, 2005",
      "sections": [
        "Section 2(a)",
        "Section 2(f)",
        "Section 2(s)",
        "Section 3(a)",
        "Section 12",
        "Section 20(1)(d)",
        "Section 26(1)"
      ],
      "relevance": "Defines domestic relationship including 'relationship in the nature of marriage'; provides relief including maintenance for aggrieved person in shared household subjected to domestic violence including economic abuse."
    }
  ],
  "outcome": {
    "disposition": "remanded",
    "summary": "Set aside findings of Family Court and High Court that appellant not married to Lakshmi; remanded to Family Court to issue notice to Lakshmi, hear her, and give fresh finding on marriage with appellant; question of marriage with respondent to be decided thereafter.",
    "relief_granted": "None at this stage; matter remanded.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "Without giving a hearing to Lakshmi no such declaration could have validly be given by the Courts below that she had not married the appellant herein since such a finding would seriously affect her rights.",
      "speaker": "court",
      "significance": "Basis for setting aside lower courts' findings on natural justice grounds."
    },
    {
      "text": "In our opinion a relationship in the nature of marriage under the 2005 Act must also fulfill the above requirements, and in addition the parties must have lived together in a shared household as defined in Section 2(s) of the Act.",
      "speaker": "court",
      "significance": "Defines criteria for 'relationship in the nature of marriage' under DV Act."
    },
    {
      "text": "No doubt the view we are taking would exclude many women who have had a live in relationship from the benefit of the 2005 Act, but then it is not for this Court to legislate or amend the law.",
      "speaker": "court",
      "significance": "Limits judicial interpretation to statutory language."
    }
  ],
  "_case_id": "2010_721",
  "_label": 1,
  "_text_length": 18402,
  "_extracted_at": "2026-02-10T19:13:39.474833"
}