{
  "metadata": {
    "case_name": "Appellant Company v. Punjab State Water Supply & Sewerage Board",
    "case_year": 2019,
    "court": "Supreme Court of India",
    "judges": [
      "F. Nariman"
    ],
    "case_number": null,
    "date_of_judgment": "2019-03-11"
  },
  "facts": [
    {
      "id": "f1",
      "text": "In 2008, the Punjab State Water Supply Sewerage Board, Bhatinda issued notice inviting tender for extension and augmentation of water supply, sewerage scheme, pumping station and sewerage treatment plant for various towns on a turnkey basis.",
      "type": "background",
      "date": "2008",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On 25.9.2008, the appellant company, involved in civil electrical works in India, was awarded the tender after being found the best suited.",
      "type": "material",
      "date": "2008-09-25",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On 16.1.2009, a formal contract was entered into between the appellant and respondent No. 2, with the notice inviting tender forming part and parcel of the formal agreement.",
      "type": "procedural",
      "date": "2009-01-16",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The notice inviting tender contained a detailed arbitration clause, particularly clause 25(viii) requiring the party invoking arbitration to furnish a deposit-at-call for ten percent of the amount claimed to avoid frivolous claims, with refund in proportion to amount awarded and balance forfeited.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The appellant had entered into similar contracts with respondent No. 2 containing the same arbitration clause, addressed letters seeking waiver of 10% deposit fee for arbitrator appointment, received no response.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "Appellant filed Civil Writ Petition No. 18917 of 2016 before High Court of Punjab and Haryana challenging the tender condition, dismissed by judgment dated 14.9.2016 as not arbitrary or unreasonable.",
      "type": "procedural",
      "date": "2016-09-14",
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "On 8.3.2017, appellant filed Civil Writ Petition No. 4882 of 2017 before High Court of Punjab and Haryana challenging validity of clause 25(viii), dismissed by impugned judgment following earlier judgment.",
      "type": "procedural",
      "date": "2017-03-08",
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether clause 25(viii) of the arbitration clause requiring 10% deposit-at-call of the amount claimed is arbitrary, discriminatory or violative of Article 14 of the Constitution of India.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether the clause amounts to a contract of adhesion or unconscionable term applicable to commercial contracts between State instrumentalities and contractors.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether the clause acts as a clog on the arbitration process as an alternative dispute resolution mechanism.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The arbitration clause contained in the tender condition amounts to a contract of adhesion, and since there is unfair bargaining strength between respondent No. 2 and the appellant, this clause ought to be struck down following Central Inland Water Transport Corpn. v. Brojo Nath Ganguly.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": "Central Inland Water Transport Corpn. v. Brojo Nath Ganguly, (1986) 3 SCC 156"
    },
    {
      "id": "pa2",
      "text": "Arbitration being an alternative dispute resolution process, a 10% deposit would amount to a clog on entering the process.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Claims may ultimately be found to be untenable but need not be frivolous; frivolous claims can be compensated by heavy costs; even in event of award in favour of claimant, refund only in proportion to amount awarded, rest forfeited, which is arbitrary.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "No infraction of Article 14 as clause 25(viii) applies to both parties equally, cannot be struck down as discriminatory.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": "Article 14"
    },
    {
      "id": "ra2",
      "text": "Principle in Central Inland Water Transport Corpn. supra cannot apply to commercial contracts.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": "Central Inland Water Transport Corpn. v. Brojo Nath Ganguly, (1986) 3 SCC 156"
    },
    {
      "id": "ra3",
      "text": "In similar cases, this Court has not entertained this kind of challenge.",
      "supporting_facts": [],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Terms of invitation to tender not open to judicial scrutiny unless arbitrary, discriminatory or actuated by malice; Government must have freedom of contract; courts interfere only if arbitrary etc. per Tata Cellular and others.",
      "addresses_issue": "i1",
      "key_observation": "Terms in realm of contract, judicial restraint unless Wednesbury unreasonableness."
    },
    {
      "id": "cr2",
      "text": "Central Inland applies to contracts of adhesion with unequal power but not to commercial contracts between businessmen and State.",
      "addresses_issue": "i2",
      "key_observation": "Distinguished for commercial transactions."
    },
    {
      "id": "cr3",
      "text": "S.K. Jain distinguished as different clause (tiered deposit adjusted against costs); here fixed 10% with proportional refund and forfeiture even if successful.",
      "addresses_issue": "i1",
      "key_observation": "Materially different, does not apply."
    },
    {
      "id": "cr4",
      "text": "Arbitrariness distinct facet of Article 14 per A.L. Kalra; clause applies equally but arbitrary as no direct nexus to frivolous claims (exemplary costs suffice per Dnyandeo), applies to all claims at threshold, disproportionate (partial forfeiture even on success), clog on arbitration (encouraged for speedy resolution).",
      "addresses_issue": "i1",
      "key_observation": "10% deposit excessive, unfair, no reasonable man would agree."
    },
    {
      "id": "cr5",
      "text": "Arbitration to be encouraged as speedy, inexpensive ADR per State of J&K v. Dev Dutt Pandit, Centrotrade etc.; deposit greater than court fees, clogs process.",
      "addresses_issue": "i3",
      "key_observation": "Primary object frustrated by such requirement."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Clause 25(viii) is arbitrary and violative of Article 14 of the Constitution as it lacks nexus to preventing frivolous claims, applies indiscriminately, leads to disproportionate forfeiture even on success, and acts as a clog on arbitration.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Terms of tender not generally scrutinizable but can be struck down if arbitrary under Article 14 even in commercial contracts involving State instrumentalities.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Central Inland Water Transport Corpn. v. Brojo Nath Ganguly",
      "citation": "(1986) 3 SCC 156",
      "treatment": "distinguished",
      "relevance": "Does not apply to commercial contracts between businessmen and State."
    },
    {
      "case_name": "Tata Cellular v. Union of India",
      "citation": "(1994) 6 SCC 651",
      "treatment": "followed",
      "relevance": "Terms of tender not open to scrutiny unless arbitrary; judicial restraint."
    },
    {
      "case_name": "Directorate of Education v. Educomp Datamatics Ltd.",
      "citation": "(2004) 4 SCC 19",
      "treatment": "followed",
      "relevance": "Courts scrutinize contracts to prevent arbitrariness but with limitations."
    },
    {
      "case_name": "Global Energy Ltd. v. Adani Exports Ltd.",
      "citation": "(2005) 4 SCC 435",
      "treatment": "followed",
      "relevance": "Terms of tender not open to scrutiny unless wholly arbitrary."
    },
    {
      "case_name": "S.K. Jain v. State of Haryana",
      "citation": "(2009) 4 SCC 357",
      "treatment": "distinguished",
      "relevance": "Different security deposit clause upheld in commercial context; no cap needed."
    },
    {
      "case_name": "ABL International Ltd. v. Export Credit Guarantee Corpn. of India Ltd.",
      "citation": "(2004) 3 SCC 553",
      "treatment": "referred",
      "relevance": "Article 14 requires State to act fairly in contractual sphere."
    },
    {
      "case_name": "A.L. Kalra v. Project & Equipment Corpn. of India Ltd.",
      "citation": "1984 3 SCR 646",
      "treatment": "followed",
      "relevance": "Arbitrariness is distinct facet of Article 14, strikes at arbitrary State action."
    },
    {
      "case_name": "Dnyandeo Sabaji Naik v. Pradnya Prakash Khadekar",
      "citation": "(2017) 5 SCC 496",
      "treatment": "followed",
      "relevance": "Frivolous claims dismissed with exemplary costs."
    },
    {
      "case_name": "General Motors I P Ltd. v. Ashok Ramniklal Tolat",
      "citation": "(2015) 1 SCC 429",
      "treatment": "followed",
      "relevance": "Punitive damages only if litigation frivolous."
    },
    {
      "case_name": "State of J&K v. Dev Dutt Pandit",
      "citation": "(1999) 7 SCC 339",
      "treatment": "followed",
      "relevance": "Arbitration encouraged as speedy ADR; inflated claims penalized."
    },
    {
      "case_name": "Centrotrade Minerals & Metal Inc. v. Hindustan Copper Ltd.",
      "citation": "(2017) 2 SCC 228",
      "treatment": "followed",
      "relevance": "Arbitration for speedy, inexpensive resolution."
    },
    {
      "case_name": "Union of India v. U.P. State Bridge Corpn. Ltd.",
      "citation": "(2015) 2 SCC 52",
      "treatment": "followed",
      "relevance": "Fair, speedy arbitration; party autonomy."
    },
    {
      "case_name": "Union of India v. Varindera Constructions Ltd.",
      "citation": "(2018) 7 SCC 794",
      "treatment": "followed",
      "relevance": "Primary object of arbitration: speedy, effective, inexpensive."
    }
  ],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Article 14"
      ],
      "relevance": "Strikes at arbitrariness in State action, including contractual; clause held violative."
    },
    {
      "name": "Arbitration and Conciliation Act, 1996",
      "sections": [],
      "relevance": "Implied; arbitration as ADR process to be encouraged, not clogged."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "The appeal is allowed. The impugned judgment of the High Court is set aside. Clause 25(viii) of the arbitration clause is struck down as arbitrary and violative of Article 14. Frivolous claims can be dealt with by exemplary costs.",
    "relief_granted": "Clause 25(viii) declared invalid; writ petition deemed allowed.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "A 10% deposit has to be made before any determination that a claim made by the party invoking arbitration is frivolous. This is also one important aspect of the matter to be kept in mind in deciding that such a clause would be arbitrary in the sense of being something which would be unfair and unjust and which no reasonable man would agree to.",
      "speaker": "court",
      "significance": "Core reasoning on arbitrariness of the clause."
    },
    {
      "text": "This would render the entire clause wholly arbitrary, being not only excessive or disproportionate but leading to the wholly unjust result of a party who has lost an arbitration being entitled to forfeit such part of the deposit as falls proportionately short of the amount awarded as compared to what is claimed.",
      "speaker": "court",
      "significance": "Explains unjust refund mechanism."
    },
    {
      "text": "Art. 14 strikes at arbitrariness in executive administrative action because any action that is arbitrary must necessarily involve the negation of equality.",
      "speaker": "court",
      "significance": "Affirms arbitrariness as facet of Article 14 from precedent."
    }
  ],
  "_case_id": "2019_890",
  "_label": 1,
  "_text_length": 28354,
  "_extracted_at": "2026-02-10T19:13:45.884832"
}