{
  "metadata": {
    "case_name": "Appellant Company v. Punjab State Water Supply & Sewerage Board",
    "case_year": 2019,
    "court": "Supreme Court of India",
    "judges": [
      "F. Nariman"
    ],
    "case_number": null,
    "date_of_judgment": "2019-03-11"
  },
  "facts": [
    {
      "id": "f1",
      "text": "In 2008, the Punjab State Water Supply Sewerage Board, Bhatinda issued notice inviting tender for extension and augmentation of water supply, sewerage scheme, pumping station and sewerage treatment plant for various towns on a turnkey basis.",
      "type": "background",
      "date": "2008",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On 25.9.2008, the appellant company, involved in civil electrical works in India, was awarded the said tender after having been found to be the best suited for the task.",
      "type": "material",
      "date": "2008-09-25",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On 16.1.2009, a formal contract was entered into between the appellant and respondent No. 2. The notice inviting tender formed part and parcel of the formal agreement.",
      "type": "material",
      "date": "2009-01-16",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Contained in the notice inviting tender is a detailed arbitration clause, specifically clause 25(viii) requiring the party invoking arbitration to furnish a deposit-at-call for ten percent of the amount claimed.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The appellant had entered into similar contracts with respondent No. 2 which contained the same arbitration clause.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Appellant addressed letters to respondent No. 2 with regard to appointment of arbitrator in those matters and sought waiving the 10% deposit fee. After having received no response.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Appellant filed Civil Writ Petition No. 18917 of 2016 before the High Court of Punjab and Haryana, which was dismissed by judgment dated 14.9.2016 stating that such tender condition can in no way be said to be arbitrary or unreasonable.",
      "type": "procedural",
      "date": "2016-09-14",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "On 8.3.2017, the appellant approached the High Court of Punjab and Haryana challenging the validity of clause 25(viii) by filing Civil Writ Petition No. 4882 of 2017.",
      "type": "procedural",
      "date": "2017-03-08",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "The High Court in the impugned judgment merely followed its earlier judgment and dismissed the writ petition.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether clause 25(viii) of the arbitration clause in the tender/contract, requiring a 10% deposit-at-call of the amount claimed to invoke arbitration, is arbitrary, discriminatory or violative of Article 14 of the Constitution of India.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the clause amounts to a contract of adhesion or unconscionable term applicable to commercial contracts between State instrumentalities and private parties.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The arbitration clause contained in the tender condition amounts to a contract of adhesion, and since there is unfair bargaining strength between respondent No. 2 and the appellant, this clause ought to be struck down following Central Inland Water Transport Corpn. v. Brojo Nath Ganguly.",
      "supporting_facts": [
        "f4",
        "f5"
      ],
      "legal_basis": "Central Inland Water Transport Corpn. v. Brojo Nath Ganguly, (1986) 3 SCC 156"
    },
    {
      "id": "pa2",
      "text": "Arbitration being an alternative dispute resolution process, a 10% deposit would amount to a clog on entering the aforesaid process.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Claims may ultimately be found to be untenable but need not be frivolous. Frivolous claims can be compensated by heavy costs.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": null
    },
    {
      "id": "pa4",
      "text": "Even in the event that the award is in favour of the claimant, what can be refunded to him is only in proportion to the amount awarded and the rest is to be forfeited, which is arbitrary and highhanded.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "There is no infraction of Article 14 as clause 25(viii) would apply to both parties equally, and cannot be struck down as discriminatory.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": "Article 14"
    },
    {
      "id": "ra2",
      "text": "The principle contained in Central Inland Water Transport Corpn. supra cannot possibly be applied to commercial contracts.",
      "supporting_facts": [
        "f2",
        "f3"
      ],
      "legal_basis": "Central Inland Water Transport Corpn. v. Brojo Nath Ganguly, (1986) 3 SCC 156"
    },
    {
      "id": "ra3",
      "text": "In similar cases, this Court has not entertained this kind of challenge. Terms of invitation to tender are not open to judicial scrutiny unless arbitrary, discriminatory or actuated by malice.",
      "supporting_facts": [
        "f1"
      ],
      "legal_basis": "Tata Cellular v. Union of India, (1994) 6 SCC 651; Directorate of Education v. Educomp Datamatics Ltd., (2004) 4 SCC 19"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The 10% deposit-at-call before invoking arbitration is to avoid frivolous claims, but frivolous claims can be dismissed with exemplary costs by the arbitrator.",
      "addresses_issue": "i1",
      "key_observation": "A deposit-at-call of 10% of the amount claimed applies to all claims at the threshold, without determination of frivolousness, lacking direct nexus."
    },
    {
      "id": "cr2",
      "text": "Even if a claim succeeds, refund is only proportional to amount awarded vs claimed, balance forfeited to the losing party, which is unjust.",
      "addresses_issue": "i1",
      "key_observation": "Leads to wholly arbitrary result where losing party forfeits part of deposit despite award against it."
    },
    {
      "id": "cr3",
      "text": "Arbitration is an important alternative dispute resolution process to be encouraged due to high pendency and cost of litigation; deposit requirement clogs this process.",
      "addresses_issue": "i1",
      "key_observation": "Often exceeds court fees and discourages access."
    },
    {
      "id": "cr4",
      "text": "Clause applies equally but arbitrariness is a distinct facet of Article 14, separate from discrimination.",
      "addresses_issue": "i1",
      "key_observation": "Art. 14 strikes at arbitrariness in State action."
    },
    {
      "id": "cr5",
      "text": "Central Inland applies to unequal bargaining but not to commercial contracts between businessmen; S.K. Jain distinguished as different clause and no Art.14 plea.",
      "addresses_issue": "i2",
      "key_observation": "Present clause materially different and arbitrary."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Clause 25(viii) is arbitrary and violative of Article 14 of the Constitution of India as it requires 10% deposit at threshold for all claims, lacks nexus to frivolousness, leads to unjust forfeiture, and clogs arbitration process.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Central Inland Water Transport Corpn. v. Brojo Nath Ganguly",
      "citation": "(1986) 3 SCC 156",
      "treatment": "distinguished",
      "relevance": "Does not apply to commercial contracts between businessmen."
    },
    {
      "case_name": "Directorate of Education v. Educomp Datamatics Ltd.",
      "citation": "(2004) 4 SCC 19",
      "treatment": "followed",
      "relevance": "Terms of invitation to tender not open to judicial scrutiny unless arbitrary, discriminatory or mala fide."
    },
    {
      "case_name": "Tata Cellular v. Union of India",
      "citation": "(1994) 6 SCC 651",
      "treatment": "followed",
      "relevance": "Principles on judicial restraint in contractual matters, Government freedom of contract."
    },
    {
      "case_name": "Global Energy Ltd. v. Adani Exports Ltd.",
      "citation": "(2005) 4 SCC 435",
      "treatment": "followed",
      "relevance": "Terms of tender not open to scrutiny unless wholly arbitrary, discriminatory or actuated by malice."
    },
    {
      "case_name": "S.K. Jain v. State of Haryana",
      "citation": "(2009) 4 SCC 357",
      "treatment": "distinguished",
      "relevance": "Different security deposit clause upheld in commercial context; no Art.14 plea; materially different from present clause."
    },
    {
      "case_name": "ABL International Ltd. v. Export Credit Guarantee Corpn. of India Ltd.",
      "citation": "(2004) 3 SCC 553",
      "treatment": "referred",
      "relevance": "State instrumentalities must act fairly under Art.14 in contractual sphere."
    },
    {
      "case_name": "A.L. Kalra v. Project & Equipment Corpn. of India Ltd.",
      "citation": "1984 3 SCR 646",
      "treatment": "followed",
      "relevance": "Arbitrariness is distinct facet of Art.14, strikes at State action per se."
    },
    {
      "case_name": "Dnyandeo Sabaji Naik v. Pradnya Prakash Khadekar",
      "citation": "(2017) 5 SCC 496",
      "treatment": "followed",
      "relevance": "Frivolous claims to be dismissed with exemplary costs."
    },
    {
      "case_name": "State of J&K v. Dev Dutt Pandit",
      "citation": "(1999) 7 SCC 339",
      "treatment": "referred",
      "relevance": "Arbitration to be encouraged as alternative to court litigation."
    },
    {
      "case_name": "Centrotrade Minerals & Metal Inc. v. Hindustan Copper Ltd.",
      "citation": "(2017) 2 SCC 228",
      "treatment": "referred",
      "relevance": "Primary object of arbitration is speedy, effective resolution."
    }
  ],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Article 14"
      ],
      "relevance": "Clause held violative as arbitrary State action in contractual sphere."
    },
    {
      "name": "Arbitration and Conciliation Act, 1996",
      "sections": [],
      "relevance": "Arbitration as alternative dispute resolution to be encouraged; clause clogs process."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "The Supreme Court allowed the appeal, set aside the High Court judgments, and struck down clause 25(viii) of the arbitration clause as arbitrary and violative of Article 14.",
    "relief_granted": "Clause 25(viii) struck down",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"A 10% deposit has to be made before any determination that a claim made by the party invoking arbitration is frivolous. This is also one important aspect of the matter to be kept in mind in deciding that such a clause would be arbitrary.\"",
      "speaker": "court",
      "significance": "Core reasoning on lack of nexus to frivolousness and arbitrariness."
    },
    {
      "text": "\"Art. 14 strikes at arbitrariness in State action and ensure fairness and equality of treatment.\"",
      "speaker": "court",
      "significance": "Affirms arbitrariness as distinct violation under Article 14."
    },
    {
      "text": "\"The terms of the invitation to tender are not open to judicial scrutiny because the invitation to tender is in the realm of contract.\"",
      "speaker": "court",
      "relevance": "Limits judicial review but allows interference if arbitrary."
    }
  ],
  "_case_id": "2019_890",
  "_label": 1,
  "_text_length": 28354,
  "_extracted_at": "2026-02-08T22:08:44.557016"
}